{"_id": "95", "name": "Bill Murray", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:22", "biography": "William James Murray (born September 21, 1950) is an American actor, comedian, filmmaker, and writer. He first rose to fame on Saturday Night Live, a series of performances that earned him his first Emmy Award, and later starred in comedy films—including Meatballs (1979), Caddyshack (1980), Stripes (1981), Tootsie (1982), Ghostbusters (1984), Scrooged (1988), Ghostbusters II (1989), What About Bob? (1991), and Groundhog Day (1993). He also co-directed Quick Change (1990).\nMurray garnered additional critical acclaim later in his career, starring in Lost in Translation (2003), which earned him a Golden Globe and a BAFTA Award for Best Actor, as well as an Oscar nomination for Best Actor, and for frequently collaborating with director Wes Anderson. He also received Golden Globe nominations for his roles in Ghostbusters, Rushmore (1998), Hyde Park on Hudson (2012), St. Vincent (2014), and the HBO miniseries Olive Kitteridge (2014), for which he later won his second Primetime Emmy Award. Murray received the Mark Twain Prize for American Humor in 2016. His comedy is known for its deadpan delivery.", "Early life": "Murray was born on September 21, 1950, in Evanston, Illinois, to Lucille (née Collins), a mail-room clerk, and Edward Joseph Murray II, a lumber salesman. He was raised in Wilmette, Illinois, a northern suburb of Chicago.Murray and his eight siblings were raised in a Roman Catholic Irish-American family. Three of his siblings, John Murray, Joel Murray, and Brian Doyle-Murray, are also actors. A sister, Nancy, is an Adrian Dominican nun in Michigan, who has traveled the United States in a one-woman program, portraying St. Catherine of Siena. Their father died in 1967 at the age of 46 from complications of diabetes when Bill was 17 years old.As a youth, Murray read children's biographies of American heroes like Kit Carson, Wild Bill Hickok, and Davy Crockett. He attended St. Joseph's grade school and Loyola Academy. During his teen years, he worked as a golf caddy to fund his education at the Jesuit high school. One of his sisters had polio and his mother suffered several miscarriages. During his teen years he was the lead singer of a rock band called the Dutch Masters and took part in high school and community theater.After graduating Loyola Academy, Murray attended Regis University in Denver, Colorado, taking pre-medical courses. He quickly dropped out, returning to Illinois. Decades later, in 2007, Regis awarded him an honorary Doctor of Humanities degree. On September 21, 1970, his 20th birthday, the police arrested Murray at Chicago's O'Hare Airport for trying to smuggle 10 lb (4.5 kg) of cannabis, which he had allegedly intended to sell. The drugs were discovered after Murray joked to the passenger next to him that he had packed a bomb in his luggage. Murray was convicted and sentenced to probation.", "Career": "=== Second City ===\nWith an invitation from his older brother, Brian, Murray got his start at The Second City in Chicago, an improvisational comedy troupe, studying under Del Close. In 1974, he moved to New York City and was recruited by John Belushi as a featured player on The National Lampoon Radio Hour.\n\n\n=== Saturday Night Live ===\nIn 1975, an Off-Broadway version of a Lampoon show led to his first television role as a cast member of the ABC variety show Saturday Night Live with Howard Cosell.  That same season, another variety show titled NBC's Saturday Night premiered. Cosell's show lasted just one season, canceled in early 1976. After working in Los Angeles with the \"guerrilla video\" commune TVTV on several projects, Murray rose to prominence in 1976. He officially joined the cast of NBC's Saturday Night Live for the show's second season, following the departure of Chevy Chase. Murray was with SNL for three seasons from 1977 to 1980. A Rutland Weekend Television sketch Eric Idle brought for his appearance on SNL developed into the 1978 mockumentary All You Need Is Cash with Murray (alongside other SNL cast members) appearing as \"Bill Murray the K\", a send-up of New York radio host Murray the K, in a segment of the film that is a parody of the Maysles Brothers's documentary The Beatles: The First U.S. Visit. During the first few seasons of SNL, Murray engaged in a romantic relationship with fellow cast member Gilda Radner.\n\n\n=== Film career ===\n\nMurray landed his first starring role with the film Meatballs in 1979. He followed this with a portrayal of Hunter S. Thompson in 1980's Where the Buffalo Roam. In the early 1980s, he starred in a string of box-office hits, including Caddyshack, Stripes, and Tootsie. Murray was the first guest on NBC's Late Night with David Letterman on February 1, 1982. He later appeared on the first episode of the Late Show with David Letterman on August 30, 1993, when the show moved to CBS. On January 31, 2012 – 30 years after his first appearance with Letterman – Murray appeared again on his talk show. He appeared as Letterman's final guest when the host retired on May 20, 2015.Murray began work on a film adaptation of the novel The Razor's Edge. The film, which Murray co-wrote, was his first starring role in a dramatic film. He later agreed with Columbia Pictures to star in Ghostbusters—in a role originally written for John Belushi—to get financing for The Razor's Edge. Ghostbusters became the highest-grossing film of 1984 and the highest-grossing comedy of all-time. The Razor's Edge, which was filmed before Ghostbusters but not released until after, was a box-office flop.\nFrustrated over the failure of The Razor's Edge, Murray retired from acting for four years to study philosophy and history at Sorbonne University, frequent the Cinémathèque in Paris, and spend time with his family in their Hudson River Valley home. During that time, his second son, Luke, was born. With the exception of a cameo appearance in the 1986 movie Little Shop of Horrors, he did not make any appearances in films, though he did participate in several public readings in Manhattan organized by playwright/director Timothy Mayer and in a stage production of Bertolt Brecht's A Man's a Man.Murray returned to films with Scrooged in 1988 and Ghostbusters II in 1989. In 1990, Murray made his first and only attempt at directing when he co-directed Quick Change with producer Howard Franklin. His subsequent films What About Bob? (1991) and Groundhog Day (1993) were box-office hits. After Groundhog Day, he appeared in a series of well-received supporting roles in films like Ed Wood, Kingpin, and Space Jam (where he appeared as himself). However, his starring roles in Larger than Life and The Man Who Knew Too Little were not as successful with critics or audiences. In 1998, he received much critical acclaim for Wes Anderson's Rushmore, for which he won Best Supporting Actor awards from the New York Film Critics Circle, the National Society of Film Critics, and the Los Angeles Film Critics Association (tying with Billy Bob Thornton). Murray decided to take a turn towards more dramatic roles and experienced a resurgence in his career, taking on roles in Wild Things, Cradle Will Rock, Hamlet (as Polonius), and The Royal Tenenbaums. In 2003, he appeared in Sofia Coppola's Lost in Translation and went on to earn a Golden Globe Award, a BAFTA Award, and an Independent Spirit Award, as well as Best Actor awards from several film critic organizations. He was considered a favorite to win the Academy Award for Best Actor, but Sean Penn ultimately won the award for his performance in Mystic River. In an interview included on the Lost in Translation DVD, Murray states that it is his favorite movie in which he has appeared. Also in 2003, he appeared in a short cameo for Jim Jarmusch's Coffee and Cigarettes, in which he played himself \"hiding out\" in a local coffee shop.\n\nDuring this time Murray still appeared in comedic roles such as Charlie's Angels and Osmosis Jones. In 2004, he provided the voice of Garfield in Garfield: The Movie, and again in 2006 for Garfield: A Tail of Two Kitties. Murray later said that he only took the role because he was under the mistaken impression the screenplay, co-written by Joel Cohen, was the work of Joel Coen.  In 2004, he made his third collaboration with Wes Anderson in The Life Aquatic with Steve Zissou and in 2005 his second collaboration with Jim Jarmusch in Broken Flowers. That same year, Murray announced that he was taking a hiatus from acting as he had not had the time to relax since his new breakthrough in the late 1990s. He did return to the big screen for brief cameos in Wes Anderson's The Darjeeling Limited and in Get Smart as Agent 13, the agent in the tree. In 2008, he played an important role in the post-apocalyptic film City of Ember, and in 2009, had a cameo role in the zombie comedy Zombieland.\nMurray provided the voice for the character Mr. Badger in the 2009 animated film Fantastic Mr. Fox.\n\nSince 2010, Murray has been part of ensembles which received several award nominations in two Wes Anderson movies: Moonrise Kingdom (2012) and Grand Budapest Hotel (2014). Murray was nominated for a Golden Globe for his performance in the 2014 film St. Vincent. He played a music manager in 2015's Rock the Kasbah. In 2016, he was the voice of Baloo in Disney's live action remake of The Jungle Book. The film earned a 95% approval rating on Rotten Tomatoes, and Murray was nominated to for Favorite Animated Movie Voice at the People's Choice Awards; he lost to Ellen DeGeneres.\nMurray appeared as Martin Heiss, a cynical ghost debunker, in the reboot of Ghostbusters, which was released on July 15, 2016. There had been speculation that he might return to the Ghostbusters franchise for a rumored Ghostbusters 3, but he dispelled such rumors in an interview with GQ. In March 2010, Murray appeared on the Late Show with David Letterman and talked about his return to Ghostbusters III, stating \"I'd do it only if my character was killed off in the first reel.\" In an interview with GQ, Murray said: \"You know, maybe I should just do it. Maybe it'd be fun to do.\" In the interview, when asked \"Is the third Ghostbusters movie happening? What's the story with that?\", Murray replied, \"It's all a bunch of crock.\"He was part of the ensemble cast of the 2018 animated film Isle of Dogs, by Wes Anderson, which premiered at the 68th Berlin International Film Festival.", "Outside show business": "Murray is a partner with his brothers in Murray Bros. Caddy Shack, a restaurant with two locations. In 2001, they opened at the World Golf Village near St. Augustine, Florida. In 2018, they opened the second location inside the Crowne Plaza Rosemont Hotel near the O'Hare International Airport. He resides in Charleston, South Carolina, where he is a very active community member.In 1978, Murray appeared in two at-bats for the Grays Harbor Loggers Minor League Baseball team, credited with one hit and a lifetime batting average of .500.He is a part-owner of the St. Paul Saints independent baseball team and occasionally travels to Saint Paul, Minnesota to watch the team's games. He also owns part of the Charleston RiverDogs, the Hudson Valley Renegades, and the Brockton Rox. He has invested in a number of other minor league teams in the past, including the Utica Blue Sox, the Fort Myers Miracle, the Salt Lake Sting (APSL), the Catskill Cougars, and the Salt Lake City Trappers. In 2012 he was inducted into the South Atlantic League Hall of Fame for his ownership and investment activities in the league.\nBeing very detached from the Hollywood scene, Murray does not have an agent or manager and reportedly only fields offers for scripts and roles using a personal telephone number with a voice mailbox that he checks infrequently. This practice has the downside of sometimes preventing him from taking parts in films such as Who Framed Roger Rabbit, Monsters, Inc., The Squid and the Whale, Charlie and the Chocolate Factory, and Little Miss Sunshine.  When asked about this practice, however, Murray seemed content with his inaccessibility, stating, \"It's not that hard. If you have a good script that's what gets you involved. People say they can't find me. Well, if you can write a good script, that's a lot harder than finding someone. I don't worry about it; it's not my problem.\"\nMurray's popularity has been such that (as of 2017) he holds an iconic status in U.S. popular culture. Murray's eccentric style of comedy, both on-screen and in his personal life, has caused him to be seen as a folk hero to many making him a significant meme in various media including books and the internet. In 2016 he was awarded the Mark Twain Prize for American Humor by the Kennedy Center.", "Personal life": "During the filming of Stripes, Murray married Margaret Kelly on Super Bowl Sunday in Las Vegas on January 25, 1981. Later, they remarried in Chicago for their families. Margaret gave birth to two sons, Homer (born 1982) and Luke (born 1985). Luke is an assistant basketball coach at the University of Louisville, moving from his former position as an assistant at Xavier University in 2018 shortly after former Xavier head coach Chris Mack was hired to the same position at Louisville. Following Murray's affair with Jennifer Butler, the couple divorced in 1996. In 1997, he married Butler. Together, they have four sons: Caleb (born January 11, 1993), Jackson (born October 6, 1995), Cooper (born January 27, 1997), and Lincoln (born May 30, 2001). Butler filed for divorce on May 12, 2008, accusing Murray of domestic violence, infidelity, and addictions to sex, marijuana, and alcohol. Their divorce was finalized on June 13, 2008.Murray stated in a 1984 interview: \"I'm definitely a religious person, but it doesn't have much to do with Catholicism anymore.  I don't think about Catholicism as much.\" He is also \"apparently a big fan of Jazz Age mystic George Ivanovich Gurdjieff, creator of a religious philosophy known as “The Fourth Way.”Murray was once pulled over by Swedish police on suspicion of driving a golf cart under the influence of alcohol.Murray has homes in Los Angeles, California, Rancho Santa Fe, California, Martha's Vineyard, Massachusetts, Charleston, South Carolina, and Palisades, New York, a suburb of New York City. Between 2008 and 2013, Murray maintained a residence in the Greenwich Village neighborhood of Lower Manhattan.During the 2000 presidential campaign, Murray supported Green Party candidate Ralph Nader. He also donated  $1,000 to former Governor of Nebraska Bob Kerrey's successful election to the United States Senate in 1988.\n\nMurray is a fan of several Chicago professional sports teams, especially the Chicago Cubs, Chicago Bears, and the Chicago Bulls. (He was once a guest color commentator for a Cubs game during the 1980s.)  He was in attendance, along with fellow Cubs fans John Cusack, Eddie Vedder and Bonnie Hunt, during the Cubs' historic Game Seven victory during the 2016 World Series. Murray is an avid Quinnipiac University basketball fan, where his son served as head of basketball operations, and he is a regular fixture at home games. He cheered courtside for the Illinois Fighting Illini's game against the 2004–05 Arizona Wildcats in the Regional Final game in Chicago. He is a fixture at home games of those teams when in his native Chicago. After traveling to Florida during the Cubs' playoff run to help \"inspire\" the team (Murray joked with Cubs slugger Aramis Ramírez he was very ill and needed two home runs to give him the hope to live), he was invited to the champagne party in the Cubs' clubhouse when the team clinched the NL Central in late September 2007, along with fellow actors John Cusack, Bernie Mac, James Belushi, and former Cubs player Ron Santo. Murray appears in Santo's documentary, This Old Cub. In 2006, Murray became the sixth recipient of Baseball Reliquary's annual Hilda Award, established in 2001 \"to recognize distinguished service to the game by a fan.\"\nHe sang \"Take Me Out to the Ballgame\" during a 2016 World Series game at Wrigley Field.\n\nAs a Chicago native, Murray appeared at the 50th annual Chicago Air & Water Show in August 2008. He performed a tandem jump with the U.S. Army Parachute Team Golden Knights. He was the MC for Eric Clapton's Crossroads Guitar Festival on July 28, 2007, where he dressed in various guises of Clapton as he appeared through the years. He was MC again in 2010.\nIn 1987, he donated a large amount of money to help build the Nathalie Salmon House, which provides affordable housing for low-income seniors. Michael and Lilo Salmon, the founders of Housing Opportunities and Maintenance for the Elderly (HOME), said Murray performed \"miracles\" for them.\n\n\n=== Feuds ===\nMurray has been known for his mood swings, leading Dan Aykroyd to refer to him as \"The Murricane\". Murray has said of his reputation: \"I remember a friend said to me a while back: 'You have a reputation.' And I said: 'What?' And he said: 'Yeah, you have a reputation of being difficult to work with.' But I only got that reputation from people I didn't like working with, or people who didn't know how to work, or what work is. Jim, Wes and Sofia, they know what it is to work, and they understand how you're supposed to treat people.\"In the book Live from New York: An Uncensored History of Saturday Night Live, as Told By Its Stars, Writers and Guests, Chevy Chase recalls being confronted by Murray shortly before an SNL broadcast in which Chase had returned to guest host. The issue, likely to do with Chase's insistence on doing the \"Weekend Update\" segment that had been taken over by Jane Curtin, led to Murray and Chase trading insults, with Murray telling Chase to go have sex with Jacqueline Carlin, Chase's wife at the time, while Chase commented that Murray's face looked \"like something Neil Armstrong had landed on\". The argument eventually turned physical. Murray later said of the incident, \"It was an Oedipal thing, a rupture. Because we all felt mad he had left us, and somehow I was the anointed avenging angel, who had to speak for everyone. But Chevy and I are friends now. It's all fine.\" The two later starred together in Caddyshack in 1980.\nAccording to Den of Geek, Murray did not get along with Sean Young during the production of Stripes and has refused to work with her ever again.Murray has said in interviews that he did not get along with film director Richard Donner while filming Scrooged, stating that they would disagree with each other. Donner said of Murray: \"He's superbly creative, but occasionally difficult — as difficult as any actor.\"Both Murray and Richard Dreyfuss have confirmed in separate interviews that they did not get along with each other during the making of What About Bob? In addition, the film's producer Laura Ziskin recalled having a disagreement with Murray that led him to toss her into a lake. Ziskin confirmed in 2003, \"Bill also threatened to throw me across the parking lot and then broke my sunglasses and threw them across the parking lot. I was furious and outraged at the time, but having produced a dozen movies, I can safely say it is not common behavior.\"  Dreyfuss later alleged in 2019 that Murray screamed at him while he was intoxicated and told him “Everyone hates you! You are tolerated!” and then threw an ashtray at him.Murray also had a falling out with film director and longtime collaborator Harold Ramis during the production of Groundhog Day. According to screenwriter Danny Rubin, \"They were like two brothers who weren't getting along.\" As a result, Groundhog Day ultimately served as the final film collaboration between Murray and Ramis. Murray eventually reconciled with Ramis just before Ramis's death in February 2014.During the making of Charlie's Angels, Lucy Liu allegedly threw punches at Murray after he told her that she could not act. However, Murray claims that he and Liu only had an argument rather than a feud and that they have \"made peace\" since then. Film director McG, who directed Charlie's Angels, alleged in 2009 that Murray headbutted him. Murray has denied ever doing so.Lost in Translation director Sofia Coppola said that the central scene of Scarlett Johansson and Murray lying on the bed together took multiple takes because the actors did not seem to be getting along. She eventually stopped for the day and started again the next morning.Anjelica Huston recalled having a feud with Murray during the making of The Life Aquatic with Steve Zissou.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Radio ===\n\n\n=== Video games ===", "Awards and Nominations": "=== Academy Awards ===\n\n\n=== Primetime Emmy Award ===\n\n\n=== Golden Globe Awards ===\n\n\n=== Screen Actors Guild ===\n\n\n=== BAFTA Award ===", "References": "", "External links": "Bill Murray at Box Office Mojo\nBill Murray at Curlie\nBill Murray on IMDb \nBill Murray at the Internet Off-Broadway Database\nBill Murray at AllMovie\n\"Bill Murray collected news and commentary\". The Guardian. \nCareer statistics and player information from Baseball-Reference (Minors)"}