{"_id": "7", "name": "Zoe Saldana", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:27", "biography": "Zoë Yadira Saldaña Nazario is an American actress. Following her performances with the theater group Faces, Saldana made her screen debut in a 1999 episode of Law & Order. Her film career began a year later with Center Stage (2000), where she played a struggling ballet dancer.\nSaldana became known for her work in science fiction films, beginning in 2009 with her first of multiple appearances as Nyota Uhura in the Star Trek film series and her first appearance as Neytiri in the Avatar film series. She has also played Gamora in the Marvel Cinematic Universe, beginning with Guardians of the Galaxy (2014). Due to her appearances in some of the highest-grossing films of all time, such as Avatar, and Avengers Endgame, she is the second highest-grossing film actress of all time.  Her films having collectively grossed more than $4 billion worldwide.", "Early life": "Saldana was born June 19, 1978 in Passaic, New Jersey. Her father, Aridio Saldaña, was Dominican, while her mother, Asalia Nazario, is Puerto Rican.  She was christened Zoë Yadira Saldaña Nazario, reflecting both of her parents surnames. With regard to her racial identity, Saldana stated, \"There's no one way to be black. I'm black the way I know how to be.\" She spent the majority of her early childhood growing up in Jackson Heights, New York. She was raised bilingual, speaking English and Spanish. She has two sisters, Cisely and Mariel. Their father died in a car crash when Zoe was 9 years old, and their mother subsequently moved with the children to the Dominican Republic.Saldana discovered her love of dance in the Dominican Republic and enrolled in the ECOS Espacio de Danza Academy; she studied various forms of dance, but describes ballet as her first passion. She told Vanity Fair that she quit ballet because she did not \"have the feet\" and had too much pride and ambition to just be in the corps de ballet. The family returned to New York after her sophomore year in high school. In 1995, she began performing with the Faces theater group in Brooklyn, which put on plays geared toward providing positive messages for teens via themes dealing with issues such as substance abuse and adolescent sexuality. Concurrently, she performed with the New York Youth Theater; her appearance in their production of Joseph and the Amazing Technicolor Dreamcoat led a talent agency to recruit her. Her previous dance training, and her acting experience, helped her land her first film role, playing talented and headstrong ballet student Eva Rodriguez in Center Stage (2000).", "Career": "=== Beginnings ===\n\nSaldana was still a member of Faces when she gained exposure in an episode of Law & Order (titled \"Refuge, Part 2\") which first aired in 1999. Saldana's first film role was in Center Stage (2000), directed by Nicholas Hytner, about a group of young dancers from various backgrounds who enroll at the fictitious American Ballet Academy in New York City. She then appeared in the Britney Spears vehicle Crossroads (2002). The film was met with negative reviews from critics, but became somewhat of a box office success. The same year, Saldana starred in the comedy-drama Drumline (2002), alongside Nick Cannon, which was met with generally favorable reviews.In Pirates of the Caribbean: The Curse of the Black Pearl (2003), she played Anamaria, a female pirate who signs up to join Will Turner and Mr. Gibbs for a chance to confront Jack Sparrow for stealing her ship. She then appeared in The Terminal as Dolores Torres, an immigration officer and Star Trek fan, a role that would later help Saldana when she came to appear in the Star Trek reboot (2009). In 2004, she also made appearances in Haven and Temptation, both of which had little to no box office success.\nIn 2005, Saldana appeared in Constellation, Guess Who with Ashton Kutcher, and Dirty Deeds. She then starred in the romantic comedy-dramas Premium (2006) and After Sex (2007). The same year, Saldana starred in Blackout, a television film set in New York City during the Northeast Blackout of 2003. The film premiered at the 2007 Zurich Film Festival and debuted on BET in 2008. Saldana also had a small role as Angie Jones in the action thriller Vantage Point (2008).\n\n\n=== Breakthrough roles, Avatar and Guardians of the Galaxy ===\n\nSaldana appeared in two roles in 2009, which both went on to raise her profile considerably. She played Nyota Uhura in Star Trek. The film's director J. J. Abrams asked Saldana to play the role because he had seen and liked her previous work. Saldana had never seen the original series, though she had played a Trekkie in The Terminal (2004), but agreed to play the role after Abrams complimented her. She met with Nichelle Nichols, who explained to her how she had created Uhura's background and named the character. Saldana's mother was a Star Trek fan and sent her voicemails during filming, giving advice on the role. Steven Spielberg taught her the Vulcan salute five years earlier when he directed her in The Terminal. Star Trek (2009) was a box office success grossing $385.7 million.Saldana's second high-profile film in 2009 was James Cameron's Avatar, in which she played the indigenous hunter Neytiri. Avatar was well-received by critics, accumulating an approval rating of 83% on the review aggregator Rotten Tomatoes. It grossed $2.7 billion worldwide to become the highest-grossing film of all time, as well as in the United States and Canada. It also became the first film to gross more than $2 billion worldwide. The film was nominated for ten Saturn Awards and won all ten at the 36th Saturn Awards ceremony. Saldana's Saturn Award for Best Actress win marked a rare occurrence for an all-CG character.\n\nIn 2010, Saldana performed in The Losers as Aisha al-Fadhil, a native Bolivian woman. For the role, she was required to gain weight, as she was expected to carry weapons around for eight hours a day. In 2010, she also appeared in Takers, Death at a Funeral and Burning Palms. Her television ad for Calvin Klein's \"Envy\" line also debuted in 2010. In 2011, Saldana starred in the romantic comedy The Heart Specialist and played Cataleya Restrepo, a professional assassin, in the crime drama Colombiana. While the latter film was met with negative reviews from critics, Saldana's performance was praised.In 2012, she appeared in the romantic drama The Words, which also received negative reviews from critics and saw little success at the box office.In 2013, Saldana reprised her role as Uhura in Star Trek Into Darkness, the sequel to the Star Trek reboot. Like the previous film, it was a box office success ending its North American theatrical run with a box office total of $228,778,661, placing it as the 11th highest-grossing film for 2013. It also earned $467,365,246 worldwide, ranking it in 14th place for 2013 and making it the highest-grossing film of the franchise.  Saldana also voiced her character in the 2013 release of the Star Trek video game.\nIn 2014, Saldana played Gamora in the hit film Guardians of the Galaxy. Saldana said that she became Gamora through make-up rather than computer generated imagery (CGI) or performance capture. The film became the third highest-grossing film in the Marvel Cinematic Universe, behind The Avengers and Iron Man 3. It was the third highest-grossing 2014 film (behind Transformers: Age of Extinction and The Hobbit: The Battle of the Five Armies, and the highest-grossing superhero film of 2014.The film was met with positive reviews and Saldana was nominated for numerous awards including Critics' Choice Movie Award for Best Actress in an Action Movie, Favorite Action Movie Actress at the People's Choice Awards and Best On-Screen Transformation at the MTV Movie Awards.In May 2014, she performed in Rosemary's Baby, a television miniseries adaptation of Ira Levin's horror novel. Saldana also co-produced the four-hour, two-part show.\nIn 2014, Saldana was recognized by Elle magazine during The Women in Hollywood Awards, honoring women for their outstanding achievements in film, spanning all aspects of the motion picture industry, including acting, directing, and producing.\n\n\n=== 2016–present ===\nSaldana starred in Nina, an unauthorized biopic about the jazz musician Nina Simone, which was released in 2016. The film depicts the late singer's rise to fame and relationship with her manager Clifton Henderson. Simone's family has been critical of the decision to cast her in the role. Also in 2016, she co-starred in the science-fiction sequel Star Trek Beyond, which was released in July, and Ben Affleck's crime drama Live by Night, which was released in December.Saldana returned as Gamora in the Guardians of the Galaxy sequel, Guardians of the Galaxy Vol. 2 (2017), which was released in May. She again reprised the role in the sequel Avengers: Infinity War (2018), and in Avengers: Endgame, which was released in April 2019.\nAlso in 2017, Saldana played Mrs. Mollé in I Kill Giants, Anders Walter's adaptation of Joe Kelly's graphic novel I Kill Giants. Shooting commenced in Ireland in September 2016. Also that year, she appeared in My Little Pony: The Movie, where she performed the voice of pirate parrot Captain Celaeno.\nOn May 3, 2018, she received a star on the Hollywood Walk of Fame, honoring her legacy in the motion picture industry.\nShe will reprise her role as Neytiri in the sequels Avatar 2 and Avatar 3 which will release in 2021 and 2023 respectively.", "Personal life": "In June 2010, Saldana became engaged to her longtime boyfriend Keith Britton, an actor and the CEO of My Fashion Database. Saldana and Britton announced in November 2011 that they had ended their relationship after 11 years together.In March 2013, Saldana began dating Italian artist Marco Perego. They secretly married in June 2013 in London. In July 2015, Saldana revealed that, in a reversal of tradition, Perego adopted her surname upon marriage. Thereafter, Zoe became Zoe Saldana-Perego and Marco became Marco Perego-Saldana. Their children would be Perego-Saldana. Saldana and Perego have three sons together, twins born in November 2014 and the third born in February 2017. Saldana stated that her children will be bilingual as she and her husband plan to speak both Spanish and English around them.In July 2016, during an interview with Net-a-Porter's The Edit, Saldana revealed that she has Hashimoto's thyroiditis, an autoimmune disease, along with her mother and sisters. To combat the effects of this disease, Saldana said she and her husband adhere to a gluten- and dairy-free diet.Saldana is a supporter of FINCA International, a microfinance organization.Saldana is left-handed. In 2015, on an International Lefthanders Day, she tweeted a message in support of the Lefthanders movement.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===", "Awards and nominations": "", "References": "", "External links": "Zoe Saldana\nZoe Saldana on IMDb \nZoe Saldana at the TCM Movie Database \nZoe Saldana at AllMovie\nZoe Saldana, at Future Movies\n\"Zoe Saldana Shines on ESSENCE's April Cover\". Essence. March 9, 2010. Retrieved December 27, 2017.\nSandell, Laurie (March 1, 2010). \"Zoë Saldana: The Most Elegant Member of the Glam New Guard\". Glamour. Condé Nast. Retrieved December 27, 2017."}