{"_id": "56", "name": "Danai Gurira", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:46", "biography": "Danai Jekesai Gurira (; born February 14, 1978) is an American actress and playwright. She is best known for her starring roles as Michonne on the AMC horror drama series The Walking Dead (2012–present) and as Okoye in the Marvel Cinematic Universe superhero films Black Panther (2018), Avengers: Infinity War (2018), and Avengers: Endgame (2019).\nGurira is also the playwright of the Broadway play Eclipsed, for which she was nominated for a Tony Award for Best Play.", "Early life and education": "Gurira was born in Grinnell, Iowa, to Josephine Gurira, a college librarian, and Roger Gurira, a lecturer in the Department of Chemistry at Grinnell College (both parents later joined the staff of University of Wisconsin–Platteville). Her parents moved from Southern Rhodesia, which is now Zimbabwe, to the United States in 1964. She is the youngest of four siblings; Shingai and Choni are her sisters and Tare, her brother, is a chiropractor. Gurira lived in Grinnell until December 1983, when at age five she and her family moved back to Harare, the capital of Zimbabwe, after the country gained independence.She attended high school at Dominican Convent High School. Afterward, she returned to the United States to study at Macalester College in Saint Paul, Minnesota, graduating with a Bachelor of Arts in psychology. Gurira also earned a Master of Fine Arts in acting from New York University's Tisch School of the Arts.", "Career": "=== Early career ===\nGurira taught playwriting and acting in Liberia, Zimbabwe and South Africa.\n\n\n=== Theater ===\n\nGurira said that she began writing plays in an effort to better utilize her strengths as an actress, and to tell stories that convey ideas about strong women with whom she identifies. As a playwright, she has been commissioned by Yale Repertory Theatre, Center Theatre Group, Playwrights Horizons, and the Royal Court.\nGurira co-wrote and co-starred in In the Continuum, first at Woolly Mammoth Theatre Company and later Off-Broadway, which won her an Obie Award, an Outer Critics Circle Award, and a Helen Hayes Award for Best Lead Actress. In December 2011, In the Continuum commemorated World AIDS Day 2011. Sponsored by the United States Embassy in Zimbabwe, the play was performed at Harare's Theatre and featured the story of two women who were navigating the world after contracting HIV.In 2009, Gurira made her acting debut on Broadway in August Wilson's play Joe Turner's Come and Gone playing Martha Pentecost.Gurira's 2012 play The Convert was premiered as a co-production between the Goodman Theatre in Chicago and the McCarter Theatre in New Jersey. Later that year, Gurira received the Whiting Award for an emerging playwright.In January 2015, Familiar, a play written by Gurira and directed by Rebecca Taichman, opened at Yale Repertory Theatre. It later premiered Off-Broadway in New York at Playwrights Horizons. The play is about family, cultural identity, and the experience of life as a first-generation American, and Gurira has said that it was inspired in part by her family and friends.In 2015, Lupita Nyong'o starred in Gurira's play, Eclipsed (2009), Off-Broadway at The Public Theater. It was announced that the play would move to Broadway in 2016 at the John Golden Theatre. It was the first play to premiere on Broadway with an all female and black cast and creative team. The play is set in war-torn Liberia and focuses on three women who are living as sex slaves to a rebel commander and how they deal with this difficult situation. The play was inspired by a photograph of female fighters and their tale of survival. It starred Saycon Sengbloh, Akosua Busia, Lupita Nyong'o, Zainab Jah, and Pascale Armand and was directed by Liesl Tommy.\n\nShe received the 2016 Sam Norkin Award, for Eclipsed and Familiar, presented by the Drama Desk Awards, which said, in part: \"Danai Gurira demonstrates great insight, range and depth, bringing a fresh new voice to American theater.\" Eclipsed was nominated for the Tony Award for Best Play, and won the Tony Award for Best Costume Design in a Play.\n\n\n=== Film and television ===\nGurira starred in the drama film The Visitor in 2007, for which she won Method Fest Independent Film Festival Award for Best Supporting Actress. She appeared in the 2008 film Ghost Town, the 2010 films 3 Backyards and My Soul to Take, and Restless City in 2011, as well as the television series Law & Order: Criminal Intent, Life on Mars and Law & Order. From 2010 to 2011, she appeared in the HBO drama series Treme.\nIn March 2012, AMC announced on a live broadcast that Gurira would join the cast of their horror-drama series The Walking Dead, the highest rated series in cable television history, in its third season. Gurira plays Michonne, a relentless, katana-wielding character who joins a close-knit group in an apocalyptic world. Gurira had to learn how to ride horses for the series, which she enjoyed because it was a physical challenge. In February 2019, reports emerged that Gurira would be exiting the show once she had filmed her last episodes during the tenth season.In 2013, Gurira played a lead role in director Andrew Dosunmu's independent drama film Mother of George, which premiered at 2013 Sundance Film Festival. Gurira received critical acclaim for her performance as a Nigerian woman struggling to live in the United States. In June 2013, Gurira won the Jean-Claude Gahd Dam award at the 2013 Guys Choice Awards.Gurira played rapper Tupac Shakur's mother, Afeni Shakur, in All Eyez on Me, a 2017 biopic about the rap star. She then starred in Marvel's film Black Panther, which was released in February 2018. She played Okoye, the head of the Dora Milaje, the personal bodyguards of the Black Panther, and received critical acclaim for her performance. Gurira reprised Okoye in both Avengers: Infinity War and Avengers: Endgame, released in 2018 and 2019 respectively.", "Activism": "In 2008, Gurira appeared at the Global Green Sustainable Design Awards to read a letter written by a New Orleans native displaced by Hurricane Katrina.\nIn 2011, Gurira co-founded Almasi Arts, an organization dedicated to continuing arts education in Zimbabwe. Gurira currently serves as the Executive Artistic Director.In 2015, Gurira signed an open letter begun by the ONE Campaign. The letter was addressed to Angela Merkel and Nkosazana Dlamini-Zuma, urging them to focus on women as they serve as the head of the G7 in Germany and the AU in South Africa respectively. The following year, Gurira founded the non-profit organization Love Our Girls, which aims to highlight the issues and challenges that specifically affect women throughout the world. In 2016, Gurira partnered with Johnson & Johnson in the fight against HIV/AIDS.On December 2, 2018, Gurira was announced as a UN Women Goodwill Ambassador by UN Women Executive Director Phumzile Mlambo-Ngcuka at the Global Citizen Festival in Johannesburg, South Africa. As a UN Women Goodwill Ambassador, Gurira dedicates her support to putting a spotlight on gender equality and women's rights, as well as bringing unheard women's voices front and center.", "Personal life": "Gurira is a Christian and lives in Los Angeles, though she regularly spends time in New York City. She speaks four languages: French, Shona, basic Xhosa, and English and stays physically fit through Pilates and cross training.", "Filmography": "=== Film ===\n\n\n=== Television ===", "Stage": "", "Works or publications": "Gurira, Danai. Running Head: The Neglect of Black Women in Psychology. 2001. Honors paper, Macalester College\nGurira, Danai, and Nikkole Salter. In the continuum. New York, NY: Samuel French, 2008. ISBN 978-0-573-65089-5\nGurira, Danai. Eclipsed. New York: Dramatists Play Service, 2010. ISBN 978-0-822-22446-4\nGurira, Danai. The Convert. Washington, DC : Woolly Mammoth Theatre Company, 2013.\nGurira, Danai. Familiar. New York Public Library for the Performing Arts Billy Rose Theatre Division, 2016.\nGurira, Danai. Power of women : Lupita Nyong'o. New York: DKC / O&M, 2016.", "Awards and nominations": "", "References": "", "External links": "Danai Gurira (official website)\nDanai Gurira on IMDb \nDanai Gurira at the TCM Movie Database\nDanai Gurira at AllMovie\nIn Conversation with Danai Gurira with the American Theatre Wing"}