{"_id": "8", "name": "Chris Hemsworth", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:27", "biography": "Christopher Hemsworth (born 11 August 1983) is an Australian actor. He rose to prominence playing Kim Hyde in the Australian TV series Home and Away (2004–07) before leaving to begin a film career in Hollywood. Hemsworth appeared in the science fiction action film Star Trek (2009) and the thriller adventure A Perfect Getaway (2009) before gaining positive reviews in the horror comedy The Cabin in the Woods (2012).  \nHe held starring roles in the fantasy film Snow White and the Huntsman (2012), the war film Red Dawn (2012), the action thriller film Blackhat (2015), the biographical thriller film In the Heart of the Sea (2015), and in the Men in Black film series spin-off Men in Black: International (2019). His most critically acclaimed roles include the horror comedy The Cabin in the Woods (2012) and the biographical sports drama film Rush (2013) as James Hunt, the 1976 Formula 1 World Champion.  In 2016, he appeared in a supporting role in the Ghostbusters reboot film.\nHemsworth's greatest commercial successes have been with the Marvel Cinematic Universe, playing Thor, beginning in Thor (2011) and most recently with Avengers: Endgame (2019), for which he has been nominated for and won numerous awards. His work with the franchise have established him as one of the leading and highest-paid actors in the world.", "Early life": "Hemsworth was born in Melbourne, to Leonie (née van Os), an English teacher, and Craig Hemsworth, a social-services counsellor. He is the middle of three boys; his brothers Luke (older) and Liam (younger) are also actors. His maternal grandfather is a Dutch immigrant and his maternal grandmother is of Irish descent; he also has English, Scottish, and German ancestry. He was raised both in Melbourne and in the Australian Outback in Bulman, Northern Territory. He has stated, \"My earliest memories were on the cattle stations up in the Outback, and then we moved back to Melbourne and then back out there and then back again. Certainly most of my childhood was in Melbourne but probably my most vivid memories were up there [in Bulman] with crocodiles and buffalo. Very different walks of life.\" He attended high school at Heathmont College before his family again returned to the Northern Territory, and then moved a few years later to Phillip Island.", "Career": "=== Early work and Home and Away: 2002–2010 ===\nHemsworth began his career by appearing in several television series. In 2002, Hemsworth starred in two episodes of fantasy television series Guinevere Jones as King Arthur, as well as making an appearance in soap opera series Neighbours and one episode of Marshall Law. The following year, he appeared in an episode of The Saddle Club. In 2004, Hemsworth auditioned for the role of Robbie Hunter in Australian soap opera Home and Away. He did not receive the part, but was subsequently recalled for the part of Kim Hyde. He moved to Sydney to join the cast, appearing in 171 episodes of the series. He left the cast of Home and Away on 3 July 2007.  Hemsworth later revealed that though he was became more visible after Home and Away, his work in a soap opera did not earn him respect from the film industry.Hemsworth was a contestant on the fifth season of Dancing with the Stars Australia, partnered with professional dancer Abbey Ross. The season premiered on 26 September 2006, and after six weeks, Hemsworth was eliminated on 7 November.  Hemsworth's appearance in the franchise almost cost him the role of Thor, as producers of the Marvel film franchise feared fans would be put off.In 2009, Hemsworth portrayed James T. Kirk's father, George Kirk, in the opening scenes of J. J. Abrams' film Star Trek. The role was initially offered to Matt Damon, who declined; Abrams appreciated Hemsworth taking up the role.  Josh Tyler from Cinema Blend was impressed with Hemsworth, describing the actor's scene as the \"best five minutes I’ve spent in a movie theater this year.\" The film was a box office success, grossing $385.7 million. That same year, Hemsworth played the character Kale in the thriller A Perfect Getaway. It was a modest success, grossing $22 million against a $14 million budget, and received mixed reviews, although Hemsworth was praised for his \"appropriately intimidating\" performance of a \"thuggish backpacker.\" Paul Young from Screen Rant also praised Hemsworth's performance as \"solid.\"Hemsworth went on to play Sam in 2010's Ca$h alongside English actor Sean Bean, which was the first film he shot when he arrived in the United States. The film's director, Stephen Milburn Anderson, said Hemsworth had only been in the United States for six weeks when he had auditioned for the role, recalling, \"Here's a guy who is young, has the right look, is a very good actor and, let's face it, he's beautiful. So I say, we need to get this guy in. I was very impressed\". In November 2010, The Hollywood Reporter named Hemsworth as one of the young male actors who are \"pushing – or being pushed\" onto the Hollywood \"A-List\".\n\n\n=== Breakthrough: 2011–2015 ===\n\nIn 2011, Sony Pictures announced that Hemsworth would star in the thriller Shadow Runner, though the film has yet to go into production.  That same year, Hemsworth was cast as the superhero Thor in the Marvel Cinematic Universe. His first film in the franchise was 2011's Thor. He and castmate Tom Hiddleston, who ultimately played Loki, had each auditioned for the role, for which Hemsworth said he put on 20 pounds of muscle.  Grossing a worldwide total of $449.3 million, Thor was the 15th highest-grossing film of 2011. The film received positive reviews, and Hemsworth's portrayal of the God of Thunder was praised by Kenneth Turan of the Los Angeles Times. Hemsworth reprised the role the following year for the film The Avengers (2012) as one of the six superheroes—alongside Robert Downey Jr.'s Tony Stark / Iron Man, Chris Evans's Steve Rogers / Captain America, Mark Ruffalo's Bruce Banner / Hulk, Scarlett Johansson's Natasha Romanova / Black Widow, and Jeremy Renner's Clint Barton / Hawkeye—sent to defend Earth from his adopted brother, Loki. The film was a critical and commercial success, grossing $1.519 billion worldwide. The ensemble casts were praised for their on-screen chemistry by Peter Travers from the Rolling Stone.Although Hemsworth shot the horror film The Cabin in the Woods shortly after the release of Star Trek, the former went unreleased until 2012. It garnered positive reviews, and his portrayal of Alpha male jock Curt Vaughan was described by Alison Foreman from Mashable as his \"sexiest\" role yet.  Hemsworth later starred opposite Kristen Stewart in the film Snow White and the Huntsman (2012) as the Huntsman. Although a commercial success, grossing $396 million worldwide, it received mixed reviews. Critics were critical of Hemsworth and Stewart's on-screen chemistry, and Angela Watercutter from the Wired felt that the characters were \"not fully fleshed-out.\" Hemsworth was cast as Jed Eckert in the 2012 Red Dawn remake after MGM saw dailies footage of a scene from The Cabin in the Woods; he was cast as Thor two days after being cast in Red Dawn. The film was a box-office bomb, grossing only $50 million against a production budget of $65 million, and received negative reviews.In 2013, Hemsworth starred in Ron Howard's sports drama film Rush, as 1976 Formula 1 World Champion James Hunt. The film was critically praised and became a box office success, grossing $98.2 million against a budget of $38 million. Henry Barnes from The Guardian praised Hemsworth's portrayal, admiring him for delivering the \"superb script\" with \"some mastery.\" Later that year, Hemsworth reprised the character Thor for the sequel to Thor in Thor: The Dark World (2013). Although a commercial success with a worldwide gross of $644.6 million, the film became the lowest rated film in the MCU franchise on the review aggregator website Rotten Tomatoes at 66% approval rating. Hemsworth's on-screen chemistry with Hiddleston was praised by critics; Ben Child of The Guardian said, \"Thanks to Hiddleston and Hemsworth's impressive collective charisma, Thor: The Dark World is far from a franchise killer.\"In 2015, Hemsworth starred in director Michael Mann's action thriller Blackhat, opposite Viola Davis. The film bombed at the box office and was received negatively. For many critics, a significant issue of the film is the casting of Hemsworth as a hacker. Christy Lemire in the Chicago Sun-Times stated in her review, \"Anyone who makes his or her way in the world sitting in front of a computer screen all day is not going to look as hunky as Hemsworth.\" Hemsworth himself was unsatisfied with his performance, saying, \"I didn’t enjoy what I did in the film...It just felt flat, and it was also an attempt to do what I thought people might have wanted to see. But I don’t think I’m good in that space.\" He reprised his role as Thor for the fourth time in the sequel to The Avengers, Avengers: Age of Ultron. In addition to the film receiving positive reviews and grossing over $1.4 billion worldwide, Hemsworth also won the People's Choice Awards for Favorite Action Movie Actor. Hemsworth returned to the set of Home and Away in November 2014 to film a scene as an extra and not as his character Kim Hyde. The episode in which he appeared in was broadcast on 19 May 2015.That same year, he co-starred in the comedy film Vacation, along with Ed Helms, a revival of the film series that originally starred Chevy Chase. He was nominated for the MTV Movie Awards for Best Kiss with Leslie Mann.  His last 2015 film was In the Heart of the Sea, based on the book of the same name by Nathaniel Philbrick, with Hemsworth playing first mate Owen Chase. In an interview on Jimmy Kimmel Live!, he said that to prepare for the role of starving sailors, the cast was put on a diet of 500–600 calories a day to lose weight. In the Heart of the Sea received mixed reviews from critics, and was a box office disappointment, grossing $93 million against a $100 million budget, although Hemsworth received a nomination for Choice Movie Actor: Action at the 18th Teen Choice Awards.\n\n\n=== Worldwide recognition: 2016–present ===\n\nIn 2016, Hemsworth reprised the role of Eric the Huntsman in The Huntsman: Winter's War, alongside Jessica Chastain, who plays his love interest. Writing for IndieWire, Oliver Lyttelton criticized Hemsworth's on-screen chemistry with Chastain, writing that \"they’re both struggling uphill against accents they’re palpably not comfortable with, displaying zero chemistry, and frankly appearing to be in different films.\" The film underperform compared its predecessor, grossing only $165 million.  Hemsworth later joined the casts of the reboot Ghostbusters film, portraying Kevin the receptionist.  The film underperformed critically and commercially, although Hemsworth was praised for \"deliver[ing] the most fun\" by Caroline Westbrook for Metro and won the Kids' Choice Awards for Favorite Movie Actor.Hemsworth reprised his role as Thor in Thor: Ragnarok, released on 3 November 2017 in the U.S., and again in both the third and fourth Avengers films, Avengers: Infinity War and Avengers: Endgame in 2018 and 2019 respectively. All three films were critical and commercial success, with Thor: Ragnarok widely described as saving the Thor franchise. Matt Zoller Seitz of RogerEbert.com positively compared Hemsworth's performance to Cary Grant: \"Hemsworth's charisma holds [Thor: Ragnarok] together whenever it threatens to spin apart\". Hemsworth won the Teen Choice Awards for Choice Sci-Fi Movie Actor. Meanwhile, in his review of Avengers: Endgame, Joe Morgenstern of The Wall Street Journal acknowledged \"Chris Hemsworth’s Thor, endearing despite some ragged material and the actor’s seemingly limited dramatic range\" while praising Hemsworth in the MCU Infinity Saga finale \"as the graceful, exuberant comic actor he was destined to be, while Thor morphs, alarmingly and charmingly—yet still heroically—into a beer-bellied apparition who could pass for Jeff Lebowski.\"In 2019, Hemsworth also starred in a spin-off of the Men in Black series, titled Men in Black: International. The film grossed $251 million worldwide and received generally unfavorable reviews from critics, who criticized the \"lackluster action and forgettable plot,\" although the chemistry between Hemsworth and co-star Tessa Thompson was praised.Hemsworth was originally going to reprise his role as George Kirk in the fourth film of the rebooted Star Trek film series, but he left the project in August 2018 after contract negotiations fell through. Hemsworth later revealed that the reason for his exit was because he found the script underwhelming. He will reprise the role of Thor for the fourth solo movie, Thor: Love and Thunder, which is set to start filming in August 2020, in Australia, and scheduled to be released on November 5, 2021.", "In the media": "After appearing as Thor in the MCU franchise, Hemsworth's physique gained attention from fans. His exercise routines are regularly discussed in the media, including The Times of India, Men's Health, MensXP, Entertainment Tonight, and Metro. He later created the fitness app, Centr, which provides paid customers access to nutrition, wellness, and exercise routines. In 2014, he was named by People magazine as \"Sexiest Man Alive.\"Hemsworth was the star of the Australian Football League's 2014 Everything's Possible campaign. He donated fees for his involvement to the Australian Children Foundation. Hemsworth was also the star in the AFL's 2017 \"I'd Like to See That\" commercial.", "Personal life": "Hemsworth began dating Spanish actress Elsa Pataky in early 2010 after meeting through their mutual representatives. They wed in December 2010. They have three children: a daughter born in May 2012, and twin sons born in March 2014. In 2015, Hemsworth and his family moved from Los Angeles to Byron Bay in his native Australia.\n\n\n=== Wealth ===\nHemsworth is one of the highest-paid actors in the world. He appeared in Forbes' World's Highest Paid Actors list in 2014, 2015, and 2018. Additionally, he ranked 31st in the magazine's list of Highest Paid Celebrities in 2018 and 24th in 2019 with an estimated earning of $76.4 million.", "Filmography": "", "Awards and nominations": "", "References": "", "External links": "Chris Hemsworth on IMDb \nChris Hemsworth at the TCM Movie Database \nChris Hemsworth at AllMovie"}