{"_id": "45", "name": "Sebastian Stan", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:42", "biography": "Sebastian Stan (born August 13, 1982) is a Romanian-American actor. On television, he has played Carter Baizen in Gossip Girl, Prince Jack Benjamin in Kings, Jefferson in Once Upon a Time, and T.J. Hammond in Political Animals. The latter earned him a nomination for the Critics' Choice Television Award for Best Supporting Actor in a Movie/Miniseries.\nStan gained wide recognition for his role as Bucky Barnes / Winter Soldier in the Marvel Cinematic Universe, beginning with 2011's Captain America: The First Avenger and later also in Captain America: The Winter Soldier (2014), Ant-Man (2015), Captain America: Civil War (2016), Black Panther (2018), Avengers: Infinity War (2018), and Avengers: Endgame (2019). In 2015, he co-starred in Jonathan Demme's comedy-drama Ricki and the Flash and Ridley Scott's science fiction film The Martian. Two years later, he portrayed Jeff Gillooly in the biopic I, Tonya.", "Early life": "Stan was born in Constanța, Romania. He has stated that his parents divorced when he was two years old. When he was eight, Stan and his mother, Georgeta Orlovschi, moved to Vienna, Austria, where Georgeta was employed as a pianist, following the Romanian Revolution. Four years later, they moved to Rockland County, New York, after his mother married Anthony Fruhauf, the headmaster of Rockland Country Day School, where Stan was educated. He was raised Christian Orthodox.During Stan's years at the Rockland school, he starred in productions including Harvey, Cyrano de Bergerac, Little Shop of Horrors, Over Here!, and West Side Story. He also attended the Stagedoor Manor summer camp where he was cast in many camp productions. It was then that he decided to take acting seriously and began to apply for acting programs at several universities. He was accepted to and attended Rutgers University's Mason Gross School of the Arts, which also gave him the opportunity to spend a year abroad studying acting at Shakespeare's Globe Theatre in London, England. Stan became a United States citizen in 2002.", "Career": "After an appearance in the 1994 film 71 Fragments of a Chronology of Chance, Stan's career began in earnest in 2003 with a role on Law & Order. This was followed by several film appearances, including Tony n' Tina's Wedding, The Architect, and The Covenant, before he earned a recurring role on Gossip Girl as Carter Baizen, beginning in 2007. Stan performed a lead role in the 2009 series Kings as Jack Benjamin. In 2010, he appeared in Darren Aronofsky's ballet thriller, Black Swan and comedy Hot Tub Time Machine as antagonist Blaine. In July 2011, he portrayed Bucky Barnes in the film Captain America: The First Avenger, based on the Marvel Comics character. Although it was his first film in the franchise, it was not part of the nine-picture contract he has with Marvel Studios.\n\nIn 2012, he starred in the thriller Gone, the supernatural horror film The Apparition, and began a recurring role in Once Upon a Time as the Mad Hatter. The A.V. Club described his work in \"Hat Trick\", his premiere episode, as \"excellent\" and placed the episode in their list of the 30 best episodes of 2012 from series which did not make their top list. It was initially reported the role would be recast for the spin-off series Once Upon a Time in Wonderland, due to Stan's commitment to the Marvel Cinematic Universe, but Edward Kitsis later revealed the next month that due to fan backlash and respect for Stan's performance, the character would not be recast and the series would proceed without the character. The same year, he also appeared in the USA Network miniseries Political Animals as the troubled gay son of the former First Lady, for which he was nominated for the Critics' Choice Television Award for Best Supporting Actor in a Movie/Miniseries. In 2013, Stan played Hal Carter in the Roundabout Theater Company's production of William Inge's Picnic, at the American Airlines Theater in New York.In 2014, Stan reprised his role as Bucky Barnes, now called Winter Soldier, in the first film of his nine-movie contract, Captain America: The Winter Soldier. In 2015, he played Joshua Brummel in Ricki and the Flash, and co-starred in The Martian as NASA scientist Dr. Chris Beck and The Bronze as Lance Tucker. Stan then reprised his role as the Winter Soldier in 2015's Ant Man, by making a cameo appearance, and Captain America: Civil War in 2016. In 2017, Stan co-starred as a NASCAR driver, Dayton White, in Steven Soderbergh's comedy Logan Lucky, portrayed Jeff Gillooly, in Craig Gillespie's biopic I, Tonya, based on the life of Tonya Harding, and also starred in the drama I'm Not Here.In 2018, Stan again portrayed the Winter Soldier role in the Marvel Cinematic Universe in both Black Panther, as an uncredited cameo, and in Avengers: Infinity War. He then appeared opposite Nicole Kidman in the thriller film Destroyer. Stan portrayed Charles Blackwood in We Have Always Lived in the Castle, an adaptation of Shirley Jackson's novel of the same name. Stan's first film of 2019 was Avengers: Endgame, released in April, for which he reprised his role as Bucky Barnes / The Winter Soldier.\n\nHe will star as protagonist Scott Huffman in the Vietnam War drama film The Last Full Measure and will appear in Monday, which are both scheduled for release in 2019. In addition, he replaced his Marvel co-star Chris Evans in drama film The Devil All the Time in February 2019 and will feature in The Chain. In April 2019, Disney confirmed a Marvel television series starring Stan and Anthony Mackie, called The Falcon and the Winter Soldier, would be aired on their upcoming Disney+ streaming service in August 2020. In May 2019, Stan joined the cast of spy thriller 355, which began filming in July 2019.", "Personal life": "Stan is the godson of beauty mogul Anastasia Soare.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===\n\n\n=== Music videos ===", "Awards and nominations": "", "See also": "", "References": "", "External links": "Sebastian Stan on IMDb \nSebastian Stan at Rotten Tomatoes\nSebastian Stan at AllMovie\nSebastian Stan on Instagram\nSebastian Stan on Sina Weibo (in Chinese) (registration required)"}