{"_id": "17", "name": "Don Cheadle", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:31", "biography": "Donald Frank Cheadle Jr. (; born November 29, 1964) is an American actor, author, director, producer and writer. Following early roles in Hamburger Hill (1987), and as the gangster \"Rocket\" in the film Colors (1988), Cheadle built his career in the 1990s with roles in Devil in a Blue Dress (1995), Rosewood (1997) and Boogie Nights (1997). His collaboration with director Steven Soderbergh resulted in the films Out of Sight (1998), Traffic (2000) and Ocean's Eleven (2001).\nCheadle was nominated for an Academy Award for Best Actor for his lead role as Rwandan hotel manager Paul Rusesabagina in the historical genocide drama film Hotel Rwanda (2004). From 2012 to 2016, he starred as Marty Kaan on the Showtime comedy series House of Lies; he won a Golden Globe Award in 2013 for the role.\nCheadle extended his global recognition with his role of War Machine in the Marvel Cinematic Universe, replacing Terrence Howard. He appeared in  Iron Man 2 (2010), Iron Man 3 (2013), Avengers: Age of Ultron (2015), Captain America: Civil War (2016), Avengers: Infinity War (2018), Captain Marvel (2019) and Avengers: Endgame (2019).", "Early life": "Cheadle was born in Kansas City, Missouri, the son of Bettye Cheadle (née North), a teacher, and Donald Frank Cheadle Sr., a clinical psychologist. He has a sister, Cindy, and a brother, Colin. His family moved from city to city throughout his childhood. He attended Hartley Elementary School in Lincoln, Nebraska, from 1970 to 1974. Cheadle graduated in 1982 from East High School in Denver, Colorado. During high school, he played saxophone in the jazz band, sang in the choirs and was active in the theater department, performing in musicals, plays, and mime shows under the direction of Catherine Davis.", "Film and television work": "Cheadle became eligible for his Screen Actors Guild (SAG) card when he appeared as a burger joint employee in the 1985 comedy Moving Violations. In 1987 he received a small role in episode 19, season 7 of Hill Street Blues where he played a teenager with learning difficulties.  Followed by an appearance in Hamburger Hill the same year; Cheadle secured the role of Jack in the April 1, 1988, \"Jung and the Restless\" episode of Night Court. Although his character was 16 years old, Cheadle was 23 at the time.\nCheadle then played the role of Rocket in the 1988 movie Colors. In 1989, he appeared in a video for Angela Winbush's No. 2 hit single \"It's the Real Thing\", performing dance moves in an orange jumpsuit, working at a car wash. In 1990, he appeared in an episode of The Fresh Prince of Bel-Air titled \"Homeboy, Sweet Homeboy\", playing Will Smith's friend and Hilary's first love interest, Ice Tray. In 1992, he played a supporting role in The Golden Girls spin-off The Golden Palace. Cheadle subsequently played district attorney John Littleton on three seasons of Picket Fences.\nCheadle first received widespread notice for his portrayal of Mouse Alexander in the film Devil in a Blue Dress, for which he won Best Supporting Actor awards from the Los Angeles Film Critics Association and the National Society of Film Critics and was nominated for similar awards from the Screen Actors Guild and the NAACP Image Awards. Following soon thereafter was his performance in the title role of the 1996 HBO TV movie Rebound: The Legend of Earl \"The Goat\" Manigault. He also starred in the 1997 film Volcano, directed by Mick Jackson.Don Cheadle also starred in Rush Hour 2 (2001), with Jackie Chan and Chris Tucker..\nCheadle's television credits include Emmy-nominated performances in the movies The Rat Pack, A Lesson Before Dying, Things Behind the Sun and in a guest appearance on ER. The last of these spanned four episodes during the show's ninth season, in which he portrayed Paul Nathan, a medical student struggling to cope with Parkinson's disease. He has made appearances in films including Rosewood, The Family Man, Boogie Nights, Out of Sight, Traffic, and Ocean's Eleven. These last three were directed by Steven Soderbergh. He made a cameo appearance in the film Abby Singer. In 2005, Cheadle was nominated for the Academy Award for Best Actor for his portrayal of Paul Rusesabagina in the film Hotel Rwanda. He also starred in and co-produced Crash, which won the 2006 Academy Award for Best Picture. For his performance in Crash, Cheadle was nominated for the BAFTA and Screen Actors Guild Awards for Best Supporting Actor. He played the main character in the movie Traitor.\nIn March 2007, Cheadle starred with comedian Adam Sandler in Mike Binder's Reign Over Me, a comedy-drama about a man who has slipped away from reality after the death of his wife and three daughters in 9/11. The film was a box office flop, earning a domestic gross of $22.2 million. Cheadle later starred in the 2009 DreamWorks Pictures film Hotel for Dogs. Cheadle was to make his directorial debut with the adaptation of Elmore Leonard's Tishomingo Blues, but in July 2007 he stated, \"'Tishomingo' is dead...\"Cheadle appeared in NFL commercials promoting the Super Bowl from 2002 to 2005. He so regularly appeared for the NFL in its Super Bowl advertising that in 2006, in a drive to get fans to submit their own advertising ideas, the NFL sought his permission to reference his previous commercials to portray themselves as having no new ideas: \"he quickly signed off on the idea and found it funny.\" Abe Sutton (along with Etan Bednarsh), one of the finalists in this NFL contest, played on this commercial by proposing an ad where every player on a football team is Don Cheadle.In 2009, Cheadle and Boondocks creator Aaron McGruder worked on a potential comedy show on NBC. The \"project revolve[d] around mismatched brothers who reunite to open a private security company.\" Cheadle and McGruder were slated to serve as executive producers, while McGruder was expected to write the script.Also in 2009, Cheadle performed in The People Speak, a documentary feature film that uses dramatic and musical performances of the letters, diaries, and speeches of everyday Americans, based on historian Howard Zinn's A People's History of the United States.In 2010, Cheadle assumed the role of War Machine / James Rhodes in Iron Man 2 (2010), replacing Terrence Howard. Cheadle reprised this role in Iron Man 3 (2013), Avengers: Age of Ultron (2015), Captain America: Civil War (2016), Avengers: Infinity War (2018), and Avengers: Endgame (2019).\nFrom 2012 to 2016, Cheadle starred in the Showtime TV series House of Lies. In 2013, he won the Golden Globe as Best Actor in a Comedy Series for his role on the show.Cheadle spent ten years writing and producing the film Miles Ahead (2016) based on the life of jazz musician Miles Davis. Cheadle also directed and starred in the film. Locations for the movie were found in Cincinnati.In 2018, Cheadle guest-starred in the first-season finale of DuckTales, providing Donald Duck's new voice box.", "Activism": "Cheadle has campaigned to end the genocide in Darfur, Sudan. Cheadle and John Prendergast co-authored a book about this issue entitled Not On Our Watch: The Mission to End Genocide in Darfur and Beyond. With George Clooney, Brad Pitt, Matt Damon, David Pressman and Jerry Weintraub, Cheadle co-founded the Not On Our Watch Project, an organization focusing global attention and resources to stop and prevent mass atrocities. Cheadle was awarded the BET Humanitarian award of the year in 2007 for his humanitarian work for the people of Darfur and Rwanda.At the 2007 World Series of Poker, Cheadle and poker player Annie Duke organized an annual charity poker tournament, Ante Up for Africa.On December 13, 2007, Cheadle and fellow actor George Clooney were presented with the Summit Peace Award by the Nobel Peace Prize Laureates in Rome for their work to stop the genocide and relieve the suffering of the people of Darfur.Cheadle has worked with the United Nations on climate change concerns. He and Harrison Ford created a documentary event series entitled Years of Living Dangerously that provided first-hand reports on those affected by, and seeking solutions to climate change. He is also on the Advisory Board of Citizens' Climate Lobby.In 2010, Cheadle was named U.N. Environment Program Goodwill Ambassador. Also in 2010, he and Prendergast published their second book: The Enough Moment: Fighting to End Africa's Worst Human Rights Crimes.\nOn his 2019 Saturday Night Live appearance, he wore a T-shirt saying 'protect trans kids'.", "Personal life": "In 2008, Cheadle's family history was profiled on the PBS series African American Lives 2. A DNA test revealed that Cheadle is of Cameroonian descent. Another DNA test revealed that among his African ancestry, one-third comes from the region from Senegal to Liberia, just over one-quarter comes from the Congo-Angola region, and the rest comes from western Nigeria and Benin.Cheadle has two children with his long-term partner, actress and Rosewood co-star Bridgid Coulter.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== As producer ===\n\n\n=== Video games ===\n\n\n=== Theatre ===\n\n\n=== Internet ===\n\n\n=== Music videos ===", "Awards and nominations": "", "References": "", "External links": "Don Cheadle on IMDb \nDon Cheadle at Box Office Mojo\nDon Cheadle at the Internet Off-Broadway Database"}