{"_id": "69", "name": "Keanu Reeves", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:54", "biography": "Keanu Charles Reeves ( kee-AH-noo; born September 2, 1964) is a Canadian actor and musician. He gained fame for his starring roles in several blockbuster films, including comedies from the Bill and Ted franchise (1989–2020); action thrillers Point Break (1991), Speed (1994), the John Wick franchise (2014–present); psychological thriller The Devil's Advocate (1997); supernatural thriller Constantine (2005); and science fiction/action series The Matrix (1999–present). He has also appeared in dramatic films such as Dangerous Liaisons (1988), My Own Private Idaho (1991), and Little Buddha (1993), as well as the romantic horror Bram Stoker's Dracula (1992).\nReeves has earned critical acclaim for his acting. One New York Times critic praised Reeves' versatility, saying that he \"displays considerable discipline and range... he moves easily between the buttoned-down demeanor that suits a police procedural story and the loose-jointed manner of his comic roles.\" However, Reeves has spent much of his later career being typecast. Saving the world is a recurring character arc in many roles he has portrayed, as manifested in characters such as Ted \"Theodore\" Logan, Gautama Buddha, Neo, Johnny Mnemonic, John Constantine, and Klaatu. The John Wick franchise represented a return to critical praise and commercial success for Reeves. His acting has garnered several awards, and he has a star on the Hollywood Walk of Fame.\nOutside of film acting, Reeves has pursued other forms of artistry, including stage acting, music performing, and directing. Onstage, he performed as Prince Hamlet for the Manitoba Theatre Centre's production of Hamlet. He is a musician and played bass guitar for the bands Dogstar and Becky. He wrote the text for a picture book, Ode to Happiness, illustrated by Alexandra Grant. He has also produced a documentary, Side by Side, and directed the martial arts film Man of Tai Chi.", "Early life": "Keanu Charles Reeves was born in Beirut on September 2, 1964, as the son of Patricia (née Taylor), a costume designer and performer, and Samuel Nowlin Reeves, Jr. His mother is English and from Essex. His father, an American from Hawaii, is of Chinese-Hawaiian, English, Irish, and Portuguese descent. Reeves states that his grandmother is Chinese and Hawaiian and that he grew up around Chinese art, furniture, and cuisine. Regarding his English ancestry, Reeves mentioned watching comedy shows such as The Two Ronnies during his childhood; his mother imparted English manners that he has maintained into adulthood. Reeves' mother was working in Beirut as costume designer when she met his father.Reeves' father earned his GED while imprisoned in Hawaii for selling heroin at Hilo International Airport. He abandoned his wife and family when Reeves was three years old, but Reeves knew him until he was six. They last met on the island of Kauai when Reeves was 13. After his parents divorced in 1966, his mother became a costume designer and moved the family to Sydney, and then to New York City, where she married Paul Aaron, a Broadway and Hollywood director, in 1970. The couple moved to Toronto, Ontario, and divorced in 1971. When Reeves was 15, he worked as a production assistant on Aaron's films. Reeves' mother then married Robert Miller, a rock music promoter, in 1976; the couple divorced in 1980. She subsequently married her fourth husband, a hairdresser named Jack Bond. The marriage ended in 1994. Grandparents and nannies babysat Reeves and his sisters, and Reeves grew up primarily in the Yorkville neighbourhood of Toronto.Within five years, Reeves attended four high schools, including the Etobicoke School of the Arts, from which he was expelled. Reeves stated he was expelled because he was \"just a little too rambunctious and shot [his] mouth off once too often... [he] was not generally the most well-oiled machine in the school.\" He was a successful ice hockey goalkeeper at De La Salle College. He thought of playing hockey for the Canadian Olympic team but decided to become an actor when he was 15.  After leaving De La Salle College, he attended Avondale Secondary Alternative School, which allowed him to obtain an education while working as an actor. He later dropped out and did not obtain a high school diploma.", "Career": "=== Early career: 1980–1986 ===\nReeves began his acting career at the age of nine, appearing in a theatre production of Damn Yankees. At 15, he played Mercutio in a stage production of Romeo and Juliet at the Leah Posluns Theatre. Reeves dropped out of high school when he was 17. He obtained a green card through his American stepfather and moved to Los Angeles three years later. Reeves made his screen acting debut in an episode of Hangin' In. In the early 1980s, he appeared in commercials including one for Coca-Cola, short films including the NFB drama One Step Away, and stage work such as Brad Fraser's cult hit Wolfboy in Toronto. In 1984, he was a correspondent for the Canadian Broadcasting Corporation TV youth program Going Great.Reeves' first studio movie appearance was Youngblood (1986), in which he played a Québécois goalie. His stepfather had convinced Erwin Stoff in advance to be Reeves' manager and agent. Stoff has remained Reeves' manager and has co-produced many of his films.\n\n\n=== Breakthrough: 1986–1994 ===\nAfter a few minor roles, Reeves received a sizeable role in the 1986 drama film River's Edge, which depicted how a murder affected a group of teens. Following this film's critical success, he spent the late 1980s appearing in a number of movies aimed at teenage audiences, including the lead roles in Permanent Record and the unexpectedly successful 1989 comedy, Bill & Ted's Excellent Adventure, along with its 1991 sequel, Bill & Ted's Bogus Journey. The same year, he had a breakout role in the movie Parenthood.\nFrom 1991, Reeves played bass guitar in the alternative rock band Dogstar. During the early 1990s, Reeves started to break out of his teen-film period. He appeared in high-budget action films such as Point Break, for which he won MTV's \"Most Desirable Male\" award in 1992. He was involved in various lower-budget independent films, including the well-received 1991 film, My Own Private Idaho with River Phoenix. In 1992, he played Jonathan Harker in the Francis Ford Coppola-directed blockbuster Bram Stoker's Dracula.\n\n\n=== Rise of prominence in film: 1994–1999 ===\nIn 1994, Reeves' career reached a new high as a result of his starring role in the action film Speed. His casting in the film was controversial because he was primarily known for comedies and indie dramas with the exception of Point Break. He had never been the sole headliner on a film. The summer action film had a fairly large budget and was helmed by veteran cinematographer Jan de Bont in his directorial debut.\nReeves' career choices after Speed were eclectic: despite his successes, Reeves continued to accept supporting roles and appear in experimental films. He scored a hit with a romantic lead role in A Walk in the Clouds. He made news by refusing to take part in Speed 2: Cruise Control – despite the offered $11 million paycheque, which would have been his largest to date – in favour of touring with his band and playing the title role in a 1995 Manitoba Theatre Centre production of Hamlet in Winnipeg, Manitoba. Of Reeves' performance, Sunday Times theatre critic Roger Lewis wrote, he \"quite embodied the innocence, the splendid fury, the animal grace of the leaps and bounds, the emotional violence, that form the Prince of Denmark ... He is one of the top three Hamlets [Lewis has] seen, for a simple reason: he is Hamlet.\" However, according to Reeves, his decision to not do Speed 2 left him blacklisted by 20th Century Fox for a decade, until The Day the Earth Stood Still.Reeves' choices after A Walk in the Clouds failed with critics and audiences. Big-budget films such as the sci-fi action film Johnny Mnemonic and the action-thriller Chain Reaction were critically panned and failed at the box office, while indie films like Feeling Minnesota were also critical failures. Reeves finally started to climb out of his career low after starring in the horror-drama The Devil's Advocate alongside Al Pacino and Charlize Theron. Reeves took a pay cut of $1 million for The Devil's Advocate so that Pacino would be cast, and he later took a 90 percent pay cut for the less successful The Replacements to guarantee the casting of Gene Hackman. The Devil's Advocate did well at the box office and garnered good reviews.\n\n\n=== Hollywood stardom and The Matrix trilogy: 1999–2009 ===\nThe 1999 science fiction-action hit The Matrix, a film in which Reeves had a starring role, was a box office success and attracted positive reviews.\n\nIn between the first Matrix film and its sequels, Reeves received positive reviews for his portrayal of an abusive husband in The Gift. Aside from The Gift, Reeves appeared in several films that received mostly negative reviews and unimpressive box office grosses, including The Watcher, Sweet November, and The Replacements. However, the two Matrix sequels, The Matrix Reloaded and The Matrix Revolutions, along with Something's Gotta Give and the 2005 horror-action film, Constantine, were box office successes and brought Reeves back into the public spotlight. Reeves performed with the band Becky for a year, but he quit in 2005, citing his lack of interest in a serious music career.In early 2005, Reeves' accomplishments in Hollywood were recognized by the Hollywood Walk of Fame with a star located at 6801 Hollywood Boulevard.His appearance in A Scanner Darkly (2006), based on the dystopian science fiction novel by Philip K. Dick, received favourable reviews, and The Lake House, his romantic outing with Sandra Bullock, was a success at the box office. He went on to play the lead character in two 2008 films, Street Kings and The Day the Earth Stood Still. In February 2009, he starred in director Rebecca Miller's film The Private Lives of Pippa Lee, which premiered at Berlinale.\n\n\n=== Eclectic filmmaking and John Wick: 2009–present ===\nIn 2008, Reeves began pre-production on his directorial debut, Man of Tai Chi. The film is a multilingual narrative, partly inspired by the life of Reeves' friend, stuntman Tiger Chen. Filming occurred in mainland China and Hong Kong. During Man of Tai Chi's five years of scripting and production, Reeves acted in several B movies with lead roles as Henry in Henry's Crime (2010) and John in Generation Um... (2012). During that time, Reeves also played Kai in the critically panned 47 Ronin.In 2011, he returned to other artistic mediums of expression. Having played music earlier in his career, he forayed into literature by writing the text for a \"grown-up picture book\" entitled Ode to Happiness. The text was complemented by Alexandra Grant's illustrations. In 2011, Reeves produced the documentary Side by Side about the supplanting of photo-chemical film by digital camera technology; he interviewed several prominent directors including James Cameron, Martin Scorsese, and Christopher Nolan.\nReeves' first directorial film, Man of Tai Chi, premiered in 2013 with showings at the Beijing Film Festival and Cannes Film Festival. The work was awarded in Beijing and praised by John Woo, a recognized director of action genre films.\nReeves has continued acting while exploring other forms of artistry. In October 2014, he played the title role in the action thriller John Wick. The film, which stars Reeves as a retired hitman, opened to positive reviews and performed well at the box office. He reprised the role in John Wick: Chapter 2 (2017) and again in John Wick: Chapter 3 – Parabellum (2019). Both films were well-received.\nIn 2016, Reeves appeared in the horror thriller The Neon Demon and the dystopian romance The Bad Batch. Reeves had a cameo in the action-comedy film Keanu, in which he voiced the eponymous kitten.\nReeves paired up with Winona Ryder in the 2018 movie Destination Wedding about wedding guests who develop a mutual affection for each other. They had previously worked together in other movies including Bram Stoker's Dracula, A Scanner Darkly and The Private Lives of Pippa Lee.\nIn 2019, Reeves starred in John Wick: Chapter 3 – Parabellum, had a cameo in the Netflix original film Always Be My Maybe, and voiced a toy stuntman in Toy Story 4. His cameo in Always Be My Maybe was intended to reveal his Asian ancestry. Given the number of high profile roles Reeves had in one year, USA Today dubbed the time period \"The Summer of Keanu Reeves\". In addition, 2019 saw Europe's first Keanu Reeves film festival titled KeanuCon, hosted in Glasgow, Scotland. Originally scheduled on the birthday of Reeves in September 2018, the festival was postponed due to a fire at the Glasgow school of Art. The festival was held on 27 and 28 April 2019, featuring nine films over two days. The movies screened included My Own Private Idaho, Speed, The Matrix, Constantine, Reeves' directorial debut Man of Tai Chi, and John Wick.\n\n\n=== Future projects ===\nIn January 2009, it was announced that Reeves was to star in a live-action film adaptation of the anime series Cowboy Bebop, initially slated for release in 2011. Due to budgeting problems, the script was sent for a rewrite. The project's status is currently unknown.\nPlans for a third Bill & Ted film had been in the work since around 2011, and Reeves, along with his co-star Alex Winter had expressed interest in replaying their roles. After much work to gain production and distribution rights with the series' original directors and producers, Bill & Ted Face the Music was affirmed in May 2018, with both Reeves and Winter returning in their title roles, and a planned release in August 2020. Reeves has been linked to the maritime romance The Modern Ocean, directed by Shane Carruth, though Carruth noted that the film is unlikely to be realized.Reeves will return in the fourth John Wick film, scheduled for release on May 21, 2021.Reeves will portray the character Johnny Silverhand in the 2020 video game Cyberpunk 2077; he has completed motion capture and voice recordings for the role.In August 2019, Warner Bros announced the fourth installment of The Matrix, with Keanu Reeves and Carrie-Anne Moss set to reprise their roles.", "Personal life": "=== Family and views ===\n\nReeves is entitled to British citizenship through his English mother. He holds Canadian citizenship by naturalization and identifies as such.On December 24, 1999, Reeves' girlfriend, Jennifer Syme, gave birth eight months into her pregnancy to Ava Archer Syme-Reeves, who was stillborn. The strain put on their relationship by their grief resulted in their breakup several weeks later. On April 2, 2001, Syme was driving alone on Los Angeles' Cahuenga Boulevard when she sideswiped three parked cars, rolled over several times, and was thrown from the car. Authorities believed she died instantly. She was reportedly being treated for depression and taking two prescription drugs, which police found in her car. Reeves, who was scheduled to begin shooting back-to-back Matrix sequels during the subsequent spring, sought \"peace and time\" to deal with the incident, according to his friend Bret Domrose, a guitarist in Reeves' alternative rock band Dogstar.While often described as a Buddhist or atheist, including being mentioned on a \"Famous Atheists\" list, Reeves is non-religious and has occasionally expressed a belief in God or some other higher power, stating that he believes in God and the Devil, but \"they don't have to have pitchforks and a long white beard.\" He has clarified that he has a lot of interest in and respect for Buddhism, but has not \"taken refuge in the dharma\". In September 2013, when asked if he was a spiritual person, Reeves replied with a laugh that he believes \"in God, faith, inner faith, the self, passion, and things\" and that he is \"very spiritual\" and \"supremely bountiful\" Reeves has generally been reticent about his spiritual beliefs, saying that it is something \"personal and private.\" When asked by Stephen Colbert about his views on what happens after death, Reeves replied, \"I know that the ones who love us will miss us.\"In 2010, an image of Reeves became an internet meme after photos of him, seemingly depressed while sitting on a park bench eating alone, were posted to a 4chan board. The images were soon distributed via several blogs and news sites, leading to the \"Sad Keanu\" meme being spread on internet forums. An unofficial holiday was created when a Facebook fan page declared June 15 as \"Cheer-up Keanu Day\". On the first anniversary of \"Cheer-up Keanu Day\", Reeves was interviewed by The Guardian.In more recent years with his resurgence after the John Wick films, Reeves has gained additional fame from candid, impromptu real-life events he has done that end up shared virally on social media reflecting his kind and helpful personality, to the point of him sometimes being called the \"Internet's boyfriend\". In one case, Reeves had been flying into Los Angeles on a commercial plane in March 2019, but it was forced to land in Bakersfield, California. Rather than wait for repairs on the plane, Reeves arranged a van to take him and the other passengers continuing onto Los Angeles, casually chatting with them as they rode the rest of the way. In another instance, while filming for Bill & Ted Face the Music in July 2019, Reeves and other cast members passed a house with a banner reading \"You're Breathtaking\", a meme that had come out of Reeves' appearance at the Electronic Entertainment Expo 2019 for Cyberpunk 2077. Reeves jumped out of their car to sign the banner and briefly talked and took photos with the family.Reeves has stated that he is an Oxfordian and believes the works of William Shakespeare were written by Edward de Vere, 17th Earl of Oxford.\n\n\n=== Legal incidents ===\nIn 2008, Reeves was sued in Los Angeles Superior Court by paparazzo Alison Silva. The unsuccessful US$711,974 (equivalent to $828,509 in 2018) suit claimed that Reeves hit and injured Silva with a Porsche after concluding a family visit at a Los Angeles medical facility.  The lawsuit took a year and a half to make it to trial, during which time Silva continued to attack Reeves and demand payment. At the trial, all 12 jurors rejected the suit, needing only an hour of deliberation to reach their verdict.In 2014, two stalkers trespassed on Reeves' Hollywood Hills home. On September 12, 2014, Reeves awoke and found a stalker in his library, who told him that she was there to meet him. While Reeves calmly talked to the stalker, he called the police, who arrived and arrested her before taking her in for psychological evaluation. Three days later, a second stalker made her way into his home through a gate that was left unlocked by a cleaning company. The intruder undressed and took a shower in Reeves' bathroom before swimming naked in his pool. The cleaning crew became suspicious and alerted Reeves, who was not at home. He then notified the police and the stalker was remanded.\n\n\n=== Philanthropy and business ===\nReeves set up a cancer charity, choosing not to attach his name to the organization; he has also supported PETA, the SickKids Foundation, and Stand Up to Cancer. In 2014, he said in an interview that his sister Kim had battled leukemia for more than a decade.Reeves has stated \"Money is the last thing [he] think[s] about. [He] could live on what [he has] already made for the next few centuries.\" Reeves reportedly gave approximately $80 million of his $114 million earnings from The Matrix Reloaded and The Matrix Revolutions to the special effects and makeup staff. The story has been denied by the special effects staff themselves, deeming it as an urban legend. The story likely originated in a back-end deal Reeves made with the producers of The Matrix Reloaded, relinquishing his contractual right to a percentage of the earnings from the ticket sales. Reeves reportedly did so to allow producers the flexibility for an extensive special effects budget. The value of Reeves' forgone share of the ticket profits has been estimated at $38 million, which was added to the overall movie budget, rather than going directly to special effects.Reeves co-founded a production company called Company Films, which helped produce Henry's Crime, a film in which Reeves starred.An avid motorcyclist, Reeves co-founded Arch Motorcycle Company, which builds and sells custom motorcycles.", "Filmography": "", "Notes": "", "References": "", "Further reading": "", "External links": "Keanu Reeves on IMDb \nKeanu Reeves at Box Office Mojo\nKeanu Reeves at Rotten Tomatoes\nKeanu Reeves at People.com\nSide by Side : Q & A with Keanu Reeves, Le Royal Monceau, Paris, April 11–12, 2016."}