{"_id": "64", "name": "Mike Myers", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:49", "biography": "Michael John Myers  (born May 25, 1963) is a Canadian actor, comedian, screenwriter, and producer who holds Canadian, British, and American citizenship. He is known for his run as a performer on Saturday Night Live from 1989 to 1995, and for playing the title roles in the Wayne's World, Austin Powers, and Shrek film franchises. He made his directorial debut with the documentary Supermensch: The Legend of Shep Gordon (2013). He has mostly stepped away from acting since 2012, though he had supporting roles in Terminal and Bohemian Rhapsody (both 2018).", "Early life": "Myers was born in Scarborough, Ontario, on May 25, 1963, the son of an English couple from the Old Swan area of Liverpool. His father, Eric Myers (1922–1991), was an insurance agent, while his mother, Alice \"Bunny\" E. Myers (née Hind; born 1926), was an office supervisor and a veteran of the Royal Air Force. He has two older brothers: Paul, a musician, and Peter, who worked for Sears Canada. The family is of English, Irish, and Scottish descent. He grew up in suburban Toronto districts, both North York and Scarborough, where he attended Sir John A. Macdonald Collegiate Institute. He then graduated from Stephen Leacock Collegiate Institute in 1982.", "Career": "=== Early career ===\nMyers began performing in commercials at two years old. At the age of ten, he made a commercial for British Columbia Hydro, with Gilda Radner playing his mother. At 12, he made a guest appearance as Ari on the TV series King of Kensington.\nAfter graduating from high school, Myers was accepted into The Second City Canadian touring company. He moved to the United Kingdom, where in 1985 he was one of the founding members of The Comedy Store Players, an improvisational group based at The Comedy Store in London.\nThe next year, he starred in the British children's TV program Wide Awake Club, parodying the show's normal exuberance with his own \"Sound Asleep Club\", in partnership with Neil Mullarkey.\nHe returned to Toronto and The Second City in 1986 as a cast member in The Second City's Toronto main stage show, Second City Theatre. In 1988, he moved from Second City in Toronto to Chicago. In Chicago, he trained, performed, and taught at the Improv Olympic.\nMyers made many appearances, including as Wayne Campbell, on Toronto's Citytv in the early 1980s, on the alternative video show City Limits hosted by Christopher Ward. Myers also appeared as Wayne Campbell in the music video for Ward's Canadian hit \"Boys and Girls\".\nThe Wayne Campbell character was featured extensively in the 1986 summer series It's Only Rock & Roll, produced by Toronto's Insight Production Company for CBC Television. Wayne appeared both in studio and in a series of location sketches directed and edited by Allan Novak. Myers wrote another sketch, \"Kurt and Dieter\", co-starring with Second City's Dana Andersen and also directed by Novak, which would later turn into the popular \"Sprockets\" sketch on Saturday Night Live.\n\n\n=== Film ===\nMyers made his film debut when he and Dana Carvey adapted their Wayne's World Saturday Night Live (SNL) sketches into the feature Wayne's World (1992). It was among the most successful films of the year and was followed in 1993 by Wayne's World 2; Myers starred in So I Married an Axe Murderer the same year. He took a two-year hiatus from performing after the end of his time as an SNL regular.\nMyers returned to acting with the film Austin Powers: International Man of Mystery (1997), followed by the sequels Austin Powers: The Spy Who Shagged Me (1999) and Austin Powers in Goldmember (2002). Myers played the title role (Austin Powers), the villain (Dr. Evil), a henchman (Fat Bastard) and another villain (Goldmember) in all three films.\nOne of Myers' rare non-comedic roles came in the film 54 (1998), in which he portrayed Steve Rubell, proprietor of New York City's famous 1970s discotheque Studio 54. The film was not critically or commercially successful, though Myers received some positive notice.In June 2000, Myers was sued by Universal Pictures for US$3.8 million for backing out of a contract to make a feature film based on his SNL character Dieter. Myers said he refused to honor the US$20 million contract because he felt his script was not ready. Myers countersued, and a settlement was reached after several months where Myers agreed to make another film with Universal. That film, The Cat in the Hat, was released in November 2003 and starred Myers as the title character.In 2001, Myers provided the voice of Shrek in the DreamWorks animated film of the same name, having taken over the role after original planned voice actor Chris Farley died in December 1997. He reprised this role in Shrek 4-D (a theme park ride) in 2003, Shrek 2 (2004), Shrek the Third (2007), and the Christmas special Shrek the Halls (2007).\nMyers received the MTV Generation Award in June 2007, making him the second Canadian to win the award (following Jim Carrey in 2006).In 2008, Myers co-wrote, co-produced, and starred in The Love Guru. In 2009, he played the part of British general Ed Fenech, in Quentin Tarantino's Inglourious Basterds. In 2010 Myers returned for the latest film in the Shrek series, Shrek Forever After.\nIn 2018, Myers appeared in supporting roles in Terminal (2018) and Bohemian Rhapsody (2018).\n\n\n=== Other work ===\nMyers made a cameo appearance in Britney Spears' music video \"Boys\" as Austin Powers.In a 2005 poll to find The Comedian's Comedian, he was voted among the top 50 comedy acts by fellow comedians and comedy insiders.Myers is a member of the band Ming Tea along with The Bangles' guitarist and vocalist Susanna Hoffs and musician Matthew Sweet. They performed the songs \"BBC\" and \"Daddy Wasn't There\" from the Austin Powers films.In 2011 Myers returned to The Comedy Store in London to perform a one-time reprisal of his role with The Comedy Store Players. The UK comedy website Chortle praised his performance.Myers' 2013 directorial debut, Supermensch: The Legend of Shep Gordon, was selected to be screened in the Gala Presentation section at the 2013 Toronto International Film Festival. In 2017, Myers began hosting a reprised version of The Gong Show in heavy makeup as a fictional British host known as Tommy Maitland.A longtime fan of the Monty Python comedy troupe, in July 2014 Myers appeared on stage on the final night of their 10 date live show, Monty Python Live (Mostly), and also appears on the documentary telefilm Monty Python: The Meaning of Live.In April 2019, The Hollywood Reporter reported that Myers will be starring in and executive producing a comedy series for Netflix, with it to last for six episodes and him playing multiple characters.", "Personal life": "Myers began dating actress and comedy writer Robin Ruzan in the late 1980s after meeting at a hockey game in Chicago, during which Myers caught a puck and used the incident as an icebreaker to strike up a conversation with Ruzan. The couple married on May 22, 1993, and Myers later referred to Ruzan as \"his muse\". The couple filed for divorce in December 2005.In 2006, café owner Kelly Tisdale confirmed reports that she and Myers were dating. Myers and Tisdale wed in New York in a secret ceremony in the fall of 2010. They have three children: son Spike Alan (b. September 2011) and daughters, Sunday Molly (b. April 2014) and Paulina Kathleen (b. 2 November 2015).During a CBS interview in 2007, he noted that he normally takes three years between films. He spends one year \"living his life\" and then writes various screenplays, develops characters, practices them in front of live audiences, and then selects one of the screenplays to film.Myers is a Dungeons & Dragons player and was one of several celebrities to have participated in the Worldwide Dungeons & Dragons Game Day in 2006.He supports the Toronto Maple Leafs of the National Hockey League. He named two characters in the first Austin Powers movie Commander Gilmour and General Borschevsky, for then-Maple Leafs players Doug Gilmour and Nikolai Borschevsky.\nMyers has played for Hollywood United F.C., a celebrity soccer team. He played in the 2010 Soccer Aid for UNICEF UK football match, England vs. R.O.W (Rest of the World) and scored his penalty during a sudden death shootout after the game ended 2–2 (June 6, 2010). The Rest of the World team beat England for the first time since the tournament started. Myers is a fan of Liverpool F.C.In 2014, Myers starred in a commercial with his brother Peter for Sears Canada, using \"humorous banter to spread the message that, despite rumours, Sears wasn't shutting down\". Peter at the time was senior director of planning at Sears head office in Toronto, and he was laid off in 2017 after Sears Canada filed for bankruptcy.In 2016, Myers published a book, Canada, about the country's history and popular culture.As of 2016, Myers resides in New York City.Myers is also a member of the Canadian charity Artists Against Racism.", "Awards and honours": "In 2003, he was inducted into Canada's Walk of Fame.For contributions to the motion picture industry, Mike Myers was honoured with a star on the Hollywood Walk of Fame at 7042 Hollywood Boulevard.In 2015, his face was put on a stamp by the Canada Post.On June 30, 2017, he was named an Officer of the Order of Canada by Governor General David Johnston for \"his extensive and acclaimed body of comedic work as an actor, writer and producer.\"", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Theme parks ===\n\n\n=== Music Videos ===\nMadonna: \"Beautiful Stranger\" (1999) as Austin Powers.", "Career awards and nominations": "=== Accolades ===", "Notable Saturday Night Live characters": "Dieter – host of Sprockets\nLinda Richman – hostess of Coffee Talk\nJapanese Game Show Host\n\"Handsome Actor\" Lank Thompson\nSimon – a little boy who does drawings in the bath and complains about having \"prune hands\" (the theme song for this segment was a slightly modified version of the theme song from Simon in the Land of Chalk Drawings by Edward MacLachlan)\nWayne Campbell (SNL, the Wayne's World films)\nPat Arnold (SNL, Bill Swerski's Superfans)\nStuart Rankin – proprietor of \"All Things Scottish\"\nLothar (Of the Hill People)\nEd Miles (Middle-Aged Man) – An older man who helps young people with their problems\nPhillip – A child of the age of six who is hypoglycemic and hyperactive (quote: \"I'm a hyper hypo\"). Phillip appears in at least two sketches, one with Nicole Kidman and the other with Kim Basinger. The sketch centers on him at a playground while wearing a helmet and a harness tied to the monkey bars.\nKenneth Reese-Evans – host of \"Theatre Stories\"\nJohnny Letter – an Old West citizen who writes polite, well-written letters of complaint\nIn December 2014, Myers appeared in a cameo during the cold open as his character Dr. Evil, a super villain known for his appearances in the Austin Powers film series where he called out North Korea and Sony, in particular the logic of Kim Jong-un, and the 2014 Sony hack, as well as making comparisons between the Guardians of Peace and Grand Old Party.", "References": "", "External links": "Mike Myers at Curlie\nMike Myers on IMDb \nMike Myers on National Public Radio in 2008"}