{"_id": "79", "name": "Dustin Hoffman", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:04", "biography": "Dustin Lee Hoffman (born August 8, 1937) is an American actor and filmmaker. Hoffman has been called one of the greatest actors of all time. He is known for his versatile portrayals of antiheroes and emotionally vulnerable characters. He is the recipient of numerous accolades including two Academy Awards, six Golden Globe Awards\n(including the Cecil B. DeMille Award), four BAFTAs, three Drama Desk Awards and, two Emmy Awards. Hoffman received the AFI Life Achievement Award in 1999 and the Kennedy Center Honors Award in 2012.\nHoffman first drew critical praise for starring in the play Eh?, for which he won a Theatre World Award and a Drama Desk Award. His breakthrough film role was as Benjamin Braddock in critically acclaimed and iconic The Graduate (1967). Since that time, Hoffman's career has largely been focused on the cinema, with sporadic returns to television and to the stage. Hoffman's films include Midnight Cowboy, Little Big Man, Papillon, Lenny, Marathon Man, All the President's Men, Kramer vs. Kramer, Tootsie, Rain Man, Hook, and Wag the Dog. He made his directorial debut in 2012, with Quartet, and has done voice work for the Kung Fu Panda film series and The Tale of Despereaux.", "Early life": "Hoffman was born on August 8, 1937, in Los Angeles, California, the second son of Harry Hoffman (1908–87) and Lillian (née Gold; 1909–82). His father worked as a prop supervisor (set decorator) at Columbia Pictures before becoming a furniture salesman.Hoffman was named after stage and silent screen actor Dustin Farnum. His elder brother, Ronald, is a lawyer and economist. Hoffman is Jewish, from an Ashkenazi Jewish family of immigrants from Kiev, Russian Empire, and Iași, Romania (the family's surname was spelled \"Goikhman\" in the Russian Empire).His upbringing was nonreligious, and he has said, \"I don't have any memory of celebrating holidays growing up that were Jewish,\" and that he had \"realized\" he was Jewish at around the age of 10.Hoffman graduated from Los Angeles High School in 1955 and enrolled at Santa Monica College with the intention of studying medicine. He left after a year to join the Pasadena Playhouse, although when he told his family about his career goal, his Aunt Pearl warned him, \"You can't be an actor. You are not good-looking enough.\" He also took classes at the Neighborhood Playhouse in New York City.", "Career": "=== Early work ===\nHoffman initially hoped to become a classical pianist, having studied piano during much of his youth and in college. While at Santa Monica College, he also took an acting class, which he assumed would be easy, and \"caught the acting bug.\" He recalls: \"I just was not gifted in music. I did not have an ear.\" Now an aspiring actor, he spent the next ten years doing odd jobs, being unemployed, and struggling to get any available acting roles, a lifestyle he was later to portray in the film \"Tootsie\". He composed a song called \"Shooting the Breeze,\" and Bette Midler wrote the words.His first acting role was at the Pasadena Playhouse, alongside future Academy Award–winner Gene Hackman. After two years there, Hackman headed for New York City, with Hoffman soon following. Hoffman, Hackman, and Robert Duvall lived together in the 1960s, all three of them focused on finding acting jobs. Hackman remembers, \"The idea that any of us would do well in films simply didn't occur to us. We just wanted to work.\" During this period, Hoffman got occasional television bit parts, including commercials but, needing income, he briefly left acting to teach.\nIn 1960 Hoffman was cast in a role in an off-Broadway production and followed with a walk-on role in a Broadway production in 1961. Hoffman then studied at Actors Studio and became a dedicated method actor. Sidney W. Pink, a producer and 3D-movie pioneer, discovered him in one of his off-Broadway roles and cast him in Madigan's Millions. Through the early and mid-1960s, Hoffman made appearances in television shows and movies, including Naked City, The Defenders and Hallmark Hall of Fame. His first critical success was in the play Eh?, by Henry Livings, which had its U.S. premiere at the Circle in the Square Downtown on October 16, 1966.\nHoffman made his film debut in The Tiger Makes Out in 1967, alongside Eli Wallach. In 1967, immediately after wrapping up principal filming on The Tiger Makes Out, Hoffman flew from New York City to Fargo, North Dakota, where he directed productions of William Gibson's Two for the Seesaw and William Saroyan's The Time of Your Life for the Fargo-Moorhead Community Theatre. The $1,000 he received for the eight-week contract was all he had to hold him over until the funds from the movie materialized.\n\n\n=== 1960s: The Graduate, Midnight Cowboy, John and Mary ===\nIn 1966 director Mike Nichols auditioned Hoffman for a lead role in the Broadway musical The Apple Tree but rejected him because he could not sing well enough and gave Alan Alda the part. But Nichols was so impressed with Hoffman's overall audition he cast him as the male lead in the movie The Graduate (1967). Hoffman played the character of Benjamin Braddock, who returns to his wealthy parents' home in California after graduating from college. Confused about what to do with his life, he is seduced into having an affair with Mrs. Robinson, an alcoholic and a neurotic, and the wife of his father's law partner. This was Hoffman's first major role, and he received an Academy Award nomination for it but lost to Rod Steiger In the Heat of the Night.\n\nAlthough Life magazine joked that \"if Dustin Hoffman's face were his fortune, he'd be committed to a life of poverty\", The Graduate was a gigantic box-office hit for Embassy Pictures, making Hoffman a major new star at the same time. The film received near-unanimous good reviews. Time magazine called Hoffman \"a symbol of youth\" who represented \"a new breed of actors.\" The film's screenwriter, Buck Henry, notes that Hoffman's character made conventional good looks no longer necessary on screen:\n\nA whole generation changed its idea of what guys should look like. . . . I think Dustin's physical being brought a sort of social and visual change, in the same way people first thought of Bogart. They called him ugly.\nHoffman biographer Jeff Lenburg adds that \"newspapers across the country were deluged with thousands of letters from fans,\" with one example published in The New York Times: \"I identified with Ben....I thought of him as a spiritual brother. He was confused about his future and about his place in the world, as I am. It's a film one digs, rather than understands intellectually.\"Turner Classic Movies critic Rob Nixon notes that Hoffman represented \"a new generation of actors.\" He credits Hoffman with breaking \"the mold of the traditional movie star and brought to their roles a new candor, ethnicity, and eagerness to dive deep into complex, even unlikable characters.\" Nixon expands on the significance of the film to Hoffman's career: \"In The Graduate, he created a lasting resonance as Ben Braddock that made him an overnight sensation and set him on the road to becoming one of our biggest stars and most respected actors.\"\nHoffman, however, mostly credits director Mike Nichols for taking a great risk in giving him, a relative unknown, the starring role: \"I don't know of another instance of a director at the height of his powers who would take a chance and cast someone like me in that part. It took tremendous courage.\"Critic Sam Kashner observed strong similarities between Hoffman's character and that of Nichols when he previously acted with Elaine May in the comedy team of Nichols and May. \"Just close your eyes and you'll hear a Mike Nichols—Elaine May routine in any number of scenes.\" Buck Henry also noticed that \"Dustin picked up all these Nichols habits, which he used in the character. Those little noises he makes are straight from Mike,\" he says.After completing The Graduate, Hoffman turned down most of the film roles offered to him, preferring to go back to New York and continue performing in live theater. He returned to Broadway to appear in the title role of the musical Jimmy Shine. Hoffman won a Drama Desk Award for Outstanding Performance.\n\nI was a theater person. That's how my friends were, too, Gene Hackman and Bobby Duvall. I wasn't going to be a movie star. I wasn't going to sell out. We wanted to be really good actors. I told them, 'I'm going out to make this movie. Don't worry, I'm coming right back.'\nHe was then offered the lead in Midnight Cowboy (1969), which he accepted partly to prove many critics were wrong about his acting range and the variety of characters he could portray. As author and critic Peter Biskind explains, \"it was the very contrast between his preppy character in The Graduate, and Ratso Rizzo\" that appealed to Hoffman. \"I had become troubled,\" recalls Hoffman, \"by the reviews that I read of The Graduate, that I was not a character actor, which I like to think of myself as. It hurt me. Some of the stuff in the press was brutal.\" Critics assumed that director Mike Nichols got lucky by finding a typical actor with average acting ability to play the part of Benjamin Braddock.\nJohn Schlesinger, who would direct Midnight Cowboy and was seeking lead actors, held that same impression. Hoffman's performance as a button-down college graduate and track star was so convincing to Schlesinger, \"he seemed unable to comprehend the fact that he was acting,\" notes Biskind. To help the director, whom he had never met, overcome that false impression, Hoffman met him in Times Square dressed as a homeless person, wearing a dirty raincoat, his hair slicked back and with an unshaven face. Schlesinger was sold, admitting, \"I've only seen you in the context of The Graduate, but you'll do quite well.\"Midnight Cowboy premiered in theaters across the United States in May 1969. For his acting, Hoffman received his second Oscar nomination and the film won Best Picture. In 1994 the film was deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress and selected for preservation in the United States National Film Registry. Biskind considers Hoffman's acting a major accomplishment:\n\nMidnight Cowboy makes us a gift of one of the landmark performances of movie history: Dustin Hoffman's Ratso Rizzo, with Jon Voight's Joe Buck a close second. From a cesspool of dark, foul, even taboo material, . . . it rescues a true humanism that need not hide its name.\nAlso in 1969, Hoffman co-starred with Mia Farrow in John and Mary. He received a 1970 BAFTA Award as Best Actor, although the film received mixed reviews. He was also nominated for a Golden Globe Award as Best Actor.\n\n\n=== 1970s: Lenny, All the President's Men, Kramer vs. Kramer ===\nThis was followed by his role in Little Big Man (1970), where Jack Crabb, his character, ages from teenager to a 121-year-old man. The film was widely praised by critics, but was overlooked for an award except for a supporting nomination for Chief Dan George. Hoffman continued to appear in major films over the next few years. Who Is Harry Kellerman and Why Is He Saying Those Terrible Things About Me? (1971), Straw Dogs (also 1971), and Papillon (1973).\nHoffman next starred in Lenny (1974), for which he was again nominated for Best Actor. Lenny was based on the life of stand-up comedian Lenny Bruce, who died at the age of 40, and was known for his open, free-style and critical form of comedy which integrated politics, religion, sex, and vulgarity. Expectations were high that Hoffman would win an Oscar for his portrayal, especially after his similar role in Midnight Cowboy. Film critic Katharine Lowry speculates that director Bob Fosse \"never gave him a chance\" to go far enough into developing the character. \"We never understand what, besides the drugs he injected, made him tick like a time bomb,\" she says.\n\nHowever, notes author Paul Gardner, \"directing Lenny, his most ambitious project, exhausted Fosse emotionally and physically. It turned his life inside out,\" with shooting days often lasting 10 to 12 hours:\nThe Lenny Bruce project, based on Julian Barry's play, had gone through two studios and three scripts, and was a problem child, like Lenny himself. But Fosse wanted to do it, and he wanted Dustin Hoffman.\nHoffman initially turned the part down: \"I didn't think the script was strong enough and I wasn't sure I was the one to play the role.\" While considering the part, he read Lenny Bruce's autobiography and looked at films with Bruce performing stand-up to live audiences. \"I began to feel an affinity with him, a realization that there was a lot of Lenny Bruce in me. My wife felt it too.\" \"I realized that I'd have to make use of my own spontaneity because he was so spontaneous. And I admired his guts. . . . That intimacy is what an actor tries to get. . . . It occurred to me that if I had known him, I would have wanted us to be friends…and he was a provocateur, and I love to provoke.\" Movie critic Judith Crist gave Hoffman credit for the ultimate success of the film:\n\nWhat is important is that Bruce's routines are so artfully reconstructed, the juice of his creativity so carefully strained, that the claim to genius is justified. And for that Dustin Hoffman deserves full credit, vanishing into the Bruce persona to simply stunning effectiveness,… Hoffman captures the restlessness, the velocity of a man's mouth straining to keep pace with a jet-propelled intelligence…\nLenny was nominated for six Academy Awards, including Best Picture, Best Director, Best Actor, Best Actress, Best Adapted Screenplay, and Best Cinematography.All the President's Men (1976) was made less than two years after the Watergate scandal, and starred Hoffman and Robert Redford as the real-life journalists, Carl Bernstein and Bob Woodward, respectively. Based on actual events, Hoffman and Redford play Washington Post reporters who uncover a break-in at the Watergate Hotel and end up investigating a political scandal that reaches all the way to the presidency. The film, as earlier ones, had Hoffman take on a dramatically different character than his previous one (as Lenny Bruce). Author James Morrison compares the two roles: \"As Lenny Bruce in Lenny (1974), Hoffman plays a martyr to the cause of establishment oppression, while in All the President's Men, he plays a reporter exposing presidential malfeasance.\"\n\nVincent Canby of The New York Times described the film as \"a spellbinding detective story\". \"The strength of the movie\", he added, was \"the virtually day-to-day record of the way Bernstein and Woodward conducted their investigations.\" The characters portrayed by Hoffman and Redford shared the rank of No. 27 Hero on AFI's 100 Years... 100 Heroes and Villains list, while Entertainment Weekly ranked All the President's Men as one of the 25 \"Powerful Political Thrillers\".Hoffman next starred in Marathon Man (1976), a film based on William Goldman's novel of the same name, opposite Laurence Olivier and Roy Scheider. Its director, John Schlesinger also directed Hoffman in Midnight Cowboy in 1969. Described as \"Schlesinger's thriller,\" by author Gene D. Phillips, Hoffman plays the hero, Babe Levy, a part-time long-distance runner and graduate student, who suddenly finds himself being pursued by a fugitive Nazi. To put himself in the mindset of someone under severe emotional distress, rather than simply acting, Hoffman did not sleep for days at a time and let his body become disheveled and unhealthy.Goldman describes his inspiration for the novel: \"What if someone close to you was something totally different from what you thought? In the story, Hoffman thinks his brother (Roy Scheider) is a businessman where the reality is that the man is a spy, who has been involved with the Nazi, Szell.\" However, Hoffman remembers a serious disagreement he had with Goldman, who also wrote the screenplay, about how the story ends:\n\nI was called on, as the character, to fire point-blank at the Laurence Olivier character, Dr. Szell, and kill him in that last scene. And I said that I couldn't do it. Goldman was quite upset about it, because first of all, how dare I? He wrote the book. \"Your job isn't to rewrite — your job is to play it as written.\" . . . it got nasty. I said, \"Go hire someone else.\"I remember Goldman saying: \"Why can't you do this? Are you such a Jew?\" I said, \"No, but I won't play a Jew who cold-bloodedly kills another human being.\" . . . And that's important to me, that I didn't shoot him in the end. Being a Jew is not losing your humanity and not losing your soul.\n\nHoffman's next roles were also successful. He opted out of directing Straight Time (1978), but starred as a thief. His next film, Michael Apted's Agatha (1979), was with Vanessa Redgrave as Agatha Christie, focussing on the missing eleven days of the author's life. The part of Archie Christie was played by Timothy Dalton, then partner of Vanessa Redgrave, and later to star in James Bond movies. Dalton's depiction of cold indifference to his wife produced a perfect foil to Hoffman's portrayal of warm compassion, humour and sensitivity. The film had both romantic and comic moments whilst the overall plot cleverly mirrored one of Christie's detective novels. Agatha was generally very well received by critics, especially in the UK, and maintains an 82% rating on Rotten Tomatoes.\nHoffman next starred in Kramer vs. Kramer (1979) co-starring Meryl Streep and directed by Robert Benton. The film tells the story of a married couple's divorce and its impact on everyone involved, including the couple's young son. Hoffman won his first Academy Award, and the film also received the Best Picture honor, plus the awards for Best Supporting Actress (Streep) and Best Director.\nThe film required Hoffman to change his attitude, from being a \"desensitized advertising art director\" into becoming a \"responsive and concerned daddy\" after his wife (Streep) walks out on him and their six-year-old son, Billy. Hoffman, during the making of the movie, was also going through his own divorce after a ten-year first marriage. Hoffman has said, \"Giving myself permission not only to be present but to be a father was a kind of epiphany for me at that time, that I could get to through my work. . . . I got closer to being a father by playing a father. That's very painful to say.\" The role also reminded him of his own love of children in general:\n\nChildren are more interesting than anything. I walk my younger child to school every day and I don't like leaving the school. I would like to sit down on those little chairs, at those little tables, and play. And a child's love is like a drug. To have a child throw his arms about you—it's instant stoned. People talk about the rush heroin gives you: I would say children give you that rush.\nBenton's directing has been praised by Hoffman, who credits him for inspiring the emotional level supporting many scenes: \"Perfect directors make you emotional. On Kramer vs. Kramer, Robert Benton made me emotional. He was pulling so hard for me. When I didn't think I could do a scene again I'd say, \"I can't give it to you, I haven't got it.\" Then he'd just get this look on his face and roll the camera and I'd say, \"Okay, this is yours.\" That's what he made you want to do for him—to give him one.\"\n\n\n=== 1980s: Tootsie, Death of a Salesman, Rain Man ===\n\nIn Tootsie (1982), Hoffman portrays Michael Dorsey, a struggling actor who finds himself dressing up as a woman to land a role on a soap opera. His co-star was Jessica Lange. Tootsie earned ten Academy Award nominations, including Hoffman's fifth nomination.Under direction by Sydney Pollack, Hoffman's role demanded \"a steady bombardment of opposites—edgy then funny, romantic then realistic, soft then quivering.\" To film critic David Denby, Hoffman's character \"embodies vulnerability and drive in perfect proportion. He has the knack of making everything he does seem perilous, and so audiences feel protective of him and root for him.\" Hoffman's acting was made more difficult than necessary, however, as he was not given the rehearsal time Pollack promised:\n\nI like to be very prepared, and I feel that the success or failure of a film is many times determined before you start principal photography. I wanted rehearsal very much. I was promised two weeks and was grieved that I didn't get it. We also followed the risky course of starting to shoot with a screenplay that wasn't completed.\nFellow actor Gary Oldman reported that, during a telephone conversation with Hoffman, the latter recalled having made comments toward a \"very powerful\" industry figure who ensured that he was unable to find work in Hollywood for some time following Tootsie. In 1983, Hoffman became a Major Donor for The Mirror Theater Ltd, alongside Paul Newman and Al Pacino, matching a grant from Laurance Rockefeller. The men were inspired to invest by their connection with Lee Strasberg, as Lee's then daughter-in-law Sabra Jones was the Founder and Producing Artistic Director of The Mirror.In 1984, Hoffman starred as Willy Loman in the Broadway revival of Arthur Miller's play Death of a Salesman. He reprised his role in a TV movie of the same name, for which he won the 1985 Emmy Award for Outstanding Lead Actor along with a Golden Globe.Hoffman first read the play at the age of 16, but today considers the story much like his own: \"It was a blueprint of my family. I was the loser, the flunky, and my brother, a high-school varsity football player, was Biff.\" Author Marie Brenner notes that Hoffman \"has been obsessed with the play\" throughout his career: \"For years he has wanted to be Willy Loman; when he discovered that Arthur Miller was his neighbor in Connecticut, they began to talk about it in earnest.\" For Hoffman, the story also left a deep emotional impact from the time he first read it:\n\nI read that play, and I was just destroyed by it. It was like finding out something terrible about my family. I just shook. I felt like my family's privacy had been invaded. I couldn't even talk about it for weeks.\nHoffman rehearsed for three weeks with the play's original star, Lee J. Cobb, and remembers seeing his stage performance: \"I'll never forget that period in my life. It was so vivid, so intense, watching Lee J. Cobb and his sixteen-inch guns as Willy. God, how I think about what I saw on that stage!\" Brenner adds that Hoffman \"has been training like a boxer for the role that so exhausted Cobb he had to be replaced after four months.\" The original play was directed by Elia Kazan, who Hoffman considers \"the perfect director, the best there ever was. . . . God, I would have done anything to have worked with Kazan.\"Hoffman's worst film failure was Elaine May's Ishtar (1987), co-starring Warren Beatty, who also produced it. Hoffman and Beatty play two down-and-out singer-songwriters who travel to Morocco for a nightclub gig and get caught up in foreign intrigue. Much of the movie was filmed in Africa. The film faced severe production problems, mostly related to its $55 million cost, and received overwhelmingly negative reviews. However, Hoffman and Beatty liked the film's final cut and tried to defend it. Hoffman and Beatty were unaffected by the flop, and Ishtar became a cult film. Quentin Tarantino, for one, has called it one of his favorite movies, partly due to the humorous lyrics of the songs written by Paul Williams. Hoffman describes why he loves the film:\n\nThe thing I love about Ishtar, - and I love it with all of its flaws - is that it has a statement to make. And that is: It is far, far better to spend a life being second rate in something that you're passionate about, than to spend a life being first-rate at that which you are not passionate about. I thought that was worth making a movie about. These guys want to be Simon & Garfunkel, but they have no talent at all. They're middle-aged guys, and at the end of the movie they wind up singing \"That's Amore\" at a Holiday Inn in Morocco. It's fair. It's fair to make a movie about that.\nNext came director Barry Levinson's Rain Man (1988), where Hoffman starred as an autistic savant, opposite Tom Cruise. Levinson, Hoffman and Cruise worked for two years on the film, and Hoffman's performance gained him his second Academy Award. Behind Hoffman's motivation for doing the film, he has said, \"Deep inside, Rain Man is about how autistic we all are.\" In preparation for the part, Hoffman spent two years befriending autistic people, which included taking them bowling and to fast food restaurants. \"It fed my obsession,\" he has stated.Hoffman worked at the New York Psychiatric Institute, affiliated with Columbia University, when he was 21. \"It was a great experience for me,\" he said. \"All my life I had wanted to get inside a prison or a mental hospital. . . . I wanted to get inside where behavior, human behavior, was so exposed. All the things the rest of us were feeling and stopping up were coming out of these people.\" He used that experience to help him develop the character of Raymond Babbitt, a high-functioning autistic savant, yet a person who critic David Denby described as \"a strangely shuttered genius.\" Hoffman created certain character traits for Raymond. Denby noted: \"Hoffman, looking suddenly older and smaller, has developed a small shuffling walk for Raymond, with shoulder bent. His eyes don't make contact with anyone else's, and he flattens his voice to a dry nasal bark.\"Rain Man won four Academy Awards, including Best Picture, Best Actor for Hoffman, and Best Director for Barry Levinson. Having worked closely with Hoffman for two years on filming, Levinson offered some opinions about his skill as an actor:\n\nYou can't define Dustin Hoffman, because he's unique. He's one of a kind and he's not one character. There is no Dustin Hoffman. He is many, many people. . . . He can do comedy and he can do drama. He has an enormous range, and yet he's still Dustin somewhere in there. He's intelligent and has a great sense of how to connect with people, because he's very interesting. On a day-to-day basis, he's like an actor who's making his first movie, with the enthusiasm and energy to want to make things happen and try things and experiment.\nAfter Rain Man, Hoffman appeared with Sean Connery and Matthew Broderick in Family Business (1989), directed by Sidney Lumet. The story centers on the estrangement between Vito (Hoffman), a middle-aged man trying to succeed in a legitimate business, and his \"hopelessly corrupt but charming father,\" Jesse (Connery). Critics were mostly not impressed with the story, although the individual performances were praised, especially Connery's.Because of their different acting styles and nationalities, some industry writers thought Connery and Hoffman might not work well together as close family members. \"To the surprise of many,\" note Connery biographers Lee Pfeiffer and Lisa Philip, \"the two superstars developed an immediate rapport and chemistry that translates onto the screen.\" And Lumet remembered: \"Sean is extremely disciplined and Dustin is very improvisational, all over the place with his lines. I didn't know where it would end up, but Sean met Dustin improvisation for improvisation, and a great deal of richness and humor came out of it.\"\n\n\n=== 1990s: Dick Tracy, Hook, Outbreak, Sleepers, Wag the Dog ===\nIn 1991, Hoffman voiced substitute teacher Mr. Bergstrom in The Simpsons episode \"Lisa's Substitute\", under the pseudonym Sam Etic. As a reference to this episode, during the episode featuring the Itchy & Scratchy movie, Lisa claims that Dustin Hoffman had a cameo in that movie but didn't use his real name.\nThroughout the 1990s, Hoffman appeared in many large, studio films, such as Dick Tracy (1990) (where his Ishtar co-star Beatty plays the titular character), Hero (1992) and Billy Bathgate (1991) co-starring with Nicole Kidman (who was nominated for a Golden Globe). Hoffman also played the title role of Captain Hook in Steven Spielberg's Hook (also 1991), earning a Golden Globe nomination, and the narrator in Dr. Seuss Video Classics: Horton Hears a Who! (also 1992); in Hook, Hoffman's costume was so heavy that he had to wear an air-conditioned suit under it.\nHoffman played the lead role in Outbreak (1995), alongside Rene Russo, Kevin Spacey, Morgan Freeman, Cuba Gooding Jr. and Donald Sutherland. In the film, Hoffman is a medical doctor who uncovers a newly discovered Ebola-like virus which came to the U.S. from Africa in an infected monkey. Hoffman races to stop the virus's spread and find a vaccine before it becomes a worldwide pandemic with no cure. It was one of the films that was produced by his production banner, Punch Productions.The movie is described by critic Roger Ebert as \"one of the great scare stories of our time, the notion that deep in the uncharted rain forests, deadly diseases are lurking, and if they ever escape their jungle homes and enter the human bloodstream, there will be a new plague the likes of which we have never seen.\" Critic David Denby credits Hoffman with giving the movie much of its thriller-like quality:\n\nTanks and men pour in to herd the terrified population here and there, and Dustin Hoffman, as the supersleuth Army doctor, gives such a lip-biting, anguished performance he absolves the movie of slickness. Hoffman isn't good, exactly; he's tense, edgy, and righteous, like a B-movie actor from the fifties.\nFollowing that, he appeared in the 1996 revenge drama/legal thriller Sleepers (1996) with Robert De Niro, Brad Pitt, Jason Patric, and Kevin Bacon.\nIn the mid-1990s, Hoffman starred in—and was deeply involved in the production of—David Mamet's American Buffalo (also 1996), and an early effort of film editor Kate Sanford. In 1997, Hoffman starred opposite John Travolta in the Costa Gavras film Mad City.\nHoffman gained his seventh Academy Award nomination for his performance in Wag The Dog (1997), in a role that allowed Hoffman the chance to work with both Robert De Niro and Denis Leary. The movie is a black comedy film produced and directed by Barry Levinson, who also directed Hoffman in Rain Man in 1988.\nThe story takes place a few days before a presidential election, where a Washington, D.C. spin doctor (De Niro) distracts the electorate from a sex scandal by hiring a Hollywood film producer (Hoffman) to construct a fake war with Albania. Hoffman, as a caricature of real life producer Robert Evans, according to some, \"gives the kind of wonderfully funny performance that is liable to win prizes, especially since its mixture of affection and murderous parody is so precise. Stanley (Hoffman) conducts business meetings in tennis clothes or in robe and slippers,\" notes critic Janet Maslin.He next appeared in another Barry Levinson film, the science fiction psychological thriller, Sphere (1998), opposite Sharon Stone.\nIn 1999, Hoffman received the AFI Life Achievement Award and recalls the emotional impact that receiving the award had on him:\n\nThere was this reel of pictures, me playing all these different roles. I had my first—and only, thank God—panic attack. What followed was depression. . . . It had to do with a central core in me, which was that I never felt I deserved success.\n\n\n=== 2000s: Finding Neverland, Meet the Fockers, Mr. Magorium's Wonder Emporium ===\n\nHoffman next appeared in Moonlight Mile (2002), followed by Confidence (2003) opposite Edward Burns, Andy García and Rachel Weisz. Hoffman finally had a chance to work with Gene Hackman in Gary Fleder's Runaway Jury (also 2003), an adaptation of John Grisham's bestselling novel.\nHoffman played theater owner Charles Frohman in the J. M. Barrie historical fantasia Finding Neverland (2004), costarring Johnny Depp and Kate Winslet. In director David O. Russell's I Heart Huckabees (also 2004), Hoffman appeared opposite Lily Tomlin as an existential detective team member.\nSeven years after his nomination for Wag the Dog, Hoffman got another opportunity to perform again with Robert De Niro, co-starring with Barbra Streisand and Ben Stiller in the 2004 comedy Meet the Fockers, a sequel to Meet the Parents (2000). Hoffman won the 2005 MTV Movie Award for Best Comedic Performance. In 2005, he voiced a horse in Racing Stripes, and appeared in cameo roles in Andy García's The Lost City and on the final episode of HBO sitcom Curb Your Enthusiasm's fifth season. Hoffman appeared in Stranger than Fiction (2006), played the perfumer Giuseppe Baldini in Tom Tykwer's film Perfume: The Story of a Murderer (also 2006), and had a cameo in the same year's The Holiday.\nIn 2007, he was featured in an advertising campaign for Australian telecommunications company Telstra's Next G network, appeared in the 50 Cent video \"Follow My Lead\" as a psychiatrist, and played the title character in the family film Mr. Magorium's Wonder Emporium. In 2008, although he was reluctant to perform in an animated feature film (Although he had previously performed voices in a version of The Point! and in an episode of The Simpsons), Hoffman had a prominent role as Shifu in the film Kung Fu Panda, which was praised in part for his comedic chemistry with Jack Black (whom he tutored in acting for an important scene) and his character's poignantly complex relationship with the story's villain. He later won the Annie Award for Voice Acting in an Animated Feature for Kung Fu Panda and has continued into the role in the franchise's subsequent filmed productions outside of the franchise's television series. He next voiced Roscuro in The Tale of Despereaux.\nAs the title character in Last Chance Harvey, Hoffman acted with co-star Emma Thompson in the story of two lonely people who tentatively forge a relationship over the course of three days. Director Joel Hopkins notes that Hoffman was a perfectionist and self-critical: \"He often wanted to try things stripped down, because less is sometimes more. He worries about every little detail.\"\n\n\n=== 2010s: Barney's Version, Quartet, Kung Fu Panda Films, The Meyerowitz Stories ===\nHe appears in Little Fockers, the critically panned yet financially successful 2010 sequel to Meet the Fockers. However, his character plays a significantly smaller role than in the previous installment. \nIn 2011, Hoffman reprised his role as Master Shifu in the commercially and critically successful animated film Kung Fu Panda 2. On the review aggregator site Rotten Tomatoes, the film has an approval rating of 81% based on 169 reviews, and an average rating of 6.9/10. The site's critical consensus reads, \"The storyline arc may seem a tad familiar to fans of the original, but Kung Fu Panda 2 offers enough action, comedy, and visual sparkle to compensate.\" On Metacritic the film has a weighted average score of 67 out of 100 based on 31 critics, indicating \"generally favorable reviews\". The film was a financial success making more money than the previous film, Kung Fu Panda. The film made $666 Million dollars at the world wide Box Office. The film was also nominated for the Academy Award for Best Animated Feature.In 2012, Hoffman's audiobook recording of Jerzy Kosinski's Being There was released at Audible.com. His performance was nominated for a 2013 Audie Award for Best Solo Narration.Hoffman starred in the HBO horse racing drama Luck, as a man involved in bookmaking and casino operations. Luck was cancelled in March 2012 after three horses died on set.In 2012, Hoffman's directorial debut film Quartet starring Maggie Smith, Tom Courtenay, Pauline Collins, Billy Connolly, and Michael Gambon\nThe BBC comedy-drama premiered at the 2012 Toronto Film Festival where it earned respectable reviews from critics.\nThe film is certified fresh on Rotten Tomatoes earning a 80% with the critical consensus reading, \"It's sweet, gentle, and predictable to a fault, but Dustin Hoffman's affectionate direction and the talented cast's amiable charm make Quartet too difficult to resist.\" Smith was nominated for Golden Globe for her performance.In 2017, Hoffman starred Noah Baumbach's Netflix film The Meyerowitz Stories alongside Adam Sandler, Ben Stiller, Elizabeth Marvel and Emma Thompson. The film premiered at the Cannes Film Festival on May 21, 2017 where it received a four minute standing ovation.\nThe film received a 97% on Rotten Tomatoes with the consensus reading, \"The Meyerowitz Stories (New and Selected) observes the family dynamic through writer-director Noah Baumbach's bittersweet lens and the impressive efforts of a remarkable cast\".In 2017, Hoffman was honored with the Gotham Awards Tribute alongside Sofia Coppola, Nicole Kidman, Edward Lachman. Hoffman was introduced by Elizabeth Marvel.", "Selected filmography": "", "Awards and nominations": "=== Academy Awards ===\n\n\n=== Primetime Emmy Awards ===\n\n\n=== Tony Awards ===\n\n\n=== Drama Desk Award ===\n\n\n=== Golden Globe Awards ===\n\n\n=== Screen Actors Guild Award ===\n\n\n=== BAFTA Awards ===", "Personal life": "Hoffman married Anne Byrne in May 1969. He adopted Karina (b. 1966), Byrne's child from a previous marriage, and with Byrne had daughter Jenna (born October 15, 1970). In 1970 Hoffman and Byrne were living in Greenwich Village in a building next door to a townhouse occupied by members of the Weathermen, when a bomb was accidentally detonated in the townhouse's basement, killing three people. In the 2002 documentary The Weather Underground, Hoffman can be seen standing in the street during the aftermath of the explosion. The couple divorced in 1980.\nHe married businesswoman Lisa Gottsegen in October 1980; they have four children: Jacob Edward (born March 20, 1981), Rebecca Lillian (b. March 17, 1983), Maxwell Geoffrey (born August 30, 1984), and Alexandra Lydia \"Ali\" (born October 27, 1987). Hoffman has two grandchildren. In an interview, he said that all of his children from his second marriage had bar or bat mitzvahs and that he is a more observant Jew now than when he was younger. He has also lamented that he is not fluent in Hebrew.A liberal, Hoffman has long supported the Democratic Party and Ralph Nader. In 1997 he was one of a number of Hollywood stars and executives to sign an open letter to then–German chancellor Helmut Kohl protesting the treatment of Scientologists in Germany, which was published as a newspaper advertisement in the International Herald Tribune.In 2009 he received the freedom of the Italian city Ascoli Piceno for being there during 1972 to shoot the movie Alfredo, Alfredo by Pietro Germi, where he played the role of Alfredo Sbisà.Dustin Hoffman received Kennedy Center Honors in 2012, with the following commendation: \"Dustin Hoffman's unyielding commitment to the wide variety of roles he plays has made him one of the most versatile and iconoclastic actors of this or any other generation\".Hoffman was successfully treated for cancer in 2013.", "Sexual misconduct allegations": "Hoffman is one of 263 celebrities, politicians, CEOs, and others who have been accused of sexual misconduct since April 2017.In 2017, seven women accused Hoffman of sexual misconduct or assault, including Wendy Riss Gatsiounis, Cori Thomas, Melissa Kester, Kathryn Rossetter, and an anonymous woman. \nA woman who was 17 at the time alleged that Hoffman made inappropriate jokes and comments around her and forced her to give him foot massages in New York. Hoffman's daughter's friend who also was a minor at the time (16), alleged the actor took a shower and came out wearing only a towel, which she said he dropped and then put on a robe and asked Thomas to massage his feet, Hoffman released an apology to the 17 year-old intern who alleged harassment but denied wrongdoing, saying, \"I have the utmost respect for women and feel terrible that anything I might have done could have put her in an uncomfortable situation,\" continuing, \"I am sorry. It is not reflective of who I am.In December 2017, comedian John Oliver unexpectedly asked Hoffman about the allegations during the 20th anniversary screening of Wag the Dog at the 92nd Street Y. \"It's 'not reflective of who I am' — it's that kind of response to this stuff that pisses me off,\" Oliver said. \"It is reflective of who you were. If you've given no evidence to show it didn't [happen] then there was a period of time for a while when you were a creeper around women. It feels like a cop-out to say 'It wasn't me.' Do you understand how that feels like a dismissal?\" Hoffman said he felt blindsided by the line of questioning, remarking \"You've made the case better than anyone else can. I'm guilty. Because someone has alleged something, I'm guilty. You push a button. It's all over the world: I'm a predator. I'm this and that, and it's not true.\" Hoffman has not publicly responded to the other six allegations.Comedian Chevy Chase, a long-time friend of Hoffman, publicly stated that he does not believe the allegations. \"I knew him back then, it just didn't really happen,\" said Chase. \"He was explaining to me what they were talking about. I've known him forever, so I've never known him to be that way... groping or whatever the hell that is.\" Actor Liam Neeson was widely covered by the media in January 2018 for coming to Hoffman's defense, saying that touching a woman's breasts behind the scenes of a play every night was \"childhood stuff,\" and \"you do silly things and it becomes kind of superstitious; if you don't do it every night you think it's going to jinx the show.\" Comedian Bill Murray, who costarred with Hoffman in Tootsie and The Lost City has also defended him saying, \"I heard what happened to him, and Dustin Hoffman is a really decent person. He's a crazy, like a Borscht Belt flirt, he has been his whole life, but he's a really sweet man.\"", "References": "", "External links": "Dustin Hoffman at the Encyclopædia Britannica\nDustin Hoffman on IMDb \nDustin Hoffman at the Internet Broadway Database \nDustin Hoffman at Box Office Mojo\nDustin Hoffman at the Internet Off-Broadway Database"}