{"_id": "90", "name": "Idris Elba", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:16", "biography": "Idrissa Akuna Elba  (; born 6 September 1972) is an English actor, writer, producer, musician, DJ, rapper, and singer. He is known for roles including Stringer Bell in the HBO series The Wire, DCI John Luther in the BBC One series Luther, and Nelson Mandela in the biographical film Mandela: Long Walk to Freedom (2013). He has been nominated four times for a Golden Globe Award for Best Actor – Miniseries or Television Film, winning one, and was nominated five times for a Primetime Emmy Award.Elba appeared in Ridley Scott's American Gangster (2007) and Prometheus (2012). Elba portrayed Heimdall in Thor (2011) and its sequels Thor: The Dark World (2013) and Thor: Ragnarok (2017), as well as Avengers: Age of Ultron (2015) and Avengers: Infinity War (2018). He also starred in Pacific Rim (2013), Beasts of No Nation (2015), for which he received BAFTA and Golden Globe nominations for Best Supporting Actor, and Molly's Game (2017). In 2016, he voiced Chief Bogo in Zootopia, Shere Khan in the live action/CGI adaptation of The Jungle Book, Fluke in Finding Dory, and played the role of Krall in Star Trek Beyond. He made his directorial debut in 2018 with an adaptation of the 1992 novel Yardie by Victor Headley.In addition to his acting work, Elba performs as a DJ under the moniker DJ Big Driis (or Big Driis the Londoner) and as an R&B musician. In 2016, he was named in the Time 100 list of the Most Influential People in the World. As of May 2019, his films have grossed over $9.8 billion at the global box office, including over $3.6 billion in North America, where he is one of the top 20 highest-grossing actors.", "Early life": "Elba was born on 6 September 1972 at Forest Gate Hospital in Hackney, London, the son of Winston, a Sierra Leonean man who worked at the Ford Dagenham plant, and Eve, a Ghanaian woman. Elba's parents were married in Sierra Leone and later moved to London. Elba was brought up in Hackney and East Ham, and shortened his first name to \"Idris\" at school in Canning Town, where he first became involved in acting. He credits The Stage with giving him his first big break, having seen an advertisement for a play in it; he auditioned and met his first agent while performing in the role. In 1986, he began helping an uncle with his wedding DJ business; within a year, he had started his own DJ company with some of his friends. Elba left school in 1988, and won a place in the National Youth Music Theatre thanks to a £1,500 Prince's Trust grant. To support himself between roles in his early career, he worked in odd jobs including: tyre-fitting, cold-calling, and night shifts at Ford Dagenham. He was working in nightclubs under the DJ nickname \"Big Driis\" during his adolescence, but began auditioning for television roles in his early twenties.", "Acting career": "=== Television ===\nElba's first acting role was in Crimewatch murder reconstructions and in 1994 he appeared in a BBC children's drama called The Boot Street Band. In 1995, he landed his first significant role on a series called Bramwell, a medical drama set in 1890s England. He played a central character in an episode of Season 1, an African petty thief named Charlie Carter, who lost his (white) wife to childbirth and had to figure out how to support his newborn daughter. His first named role arrived earlier in 1995, when he was cast as a gigolo on the \"Sex\" episode of Absolutely Fabulous. Many supporting roles on British television followed, including series such as The Bill and The Ruth Rendell Mysteries. He joined the cast of the soap opera Family Affairs and went on to appear on the television serial Ultraviolet and later on Dangerfield. He decided to move to New York City soon after. He returned to England occasionally for a television role, such as a part in one of the Inspector Lynley Mysteries. In 2001, Elba played Achilles in a stage production of Troilus and Cressida in New York City.After a supporting turn on a 2001 episode of Law & Order, Elba landed a starring role on the 2002 HBO drama series The Wire. From 2002 to 2004, Elba portrayed Russell \"Stringer\" Bell in the series, perhaps his best-known role in the United States. In 2005, he portrayed Captain Augustin Muganza in Sometimes in April, an HBO film about the Rwandan Genocide. Elba appeared on the 2007 BET special Black Men: The Truth. He appeared as Charlie Gotso on The No. 1 Ladies' Detective Agency, filmed in Botswana. The series premiered on 23 March 2008, Easter Sunday, on BBC One, receiving a high 6.3 million viewers and 27% of the audience share.In January 2009, it was reported by Variety that Elba would portray Charles Miner, a new rival to Dunder Mifflin regional manager Michael Scott (Steve Carell) for NBC's The Office. Elba appeared in a six-episode story arc later in the 2009 season as well as the season finale.\nIn September 2009, he signed a deal to star as the lead role on the six-part BBC television series Luther, which aired in May 2010. He appeared on Showtime's The Big C in 2010. At the 69th Golden Globe Awards telecast on 15 January 2012, Elba won the Award for Best Actor in a Series, Mini-Series, or Motion Picture Made for Television for his role on the BBC crime thriller series Luther.In April 2018, it was announced that Elba was cast as Charlie in the Netflix comedy series, Turn Up Charlie. He also created and starred in the semi-autobiographical comedy In The Long Run.\n\n\n=== Film ===\n\nIn 2007, Elba signed on as the lead role of the film Daddy's Little Girls, playing Monty, a blue-collar mechanic who falls in love with an attorney helping him gain custody of his kids, and finds the relationship and his custody hopes threatened by the return of his former wife. He appeared in 28 Weeks Later (2007) and This Christmas (2007), which brought in nearly $50 million at the box office in 2007. In 2008, he starred in the horror film Prom Night and the Guy Ritchie London gangster film RocknRolla. In 2009, he starred in the horror film The Unborn and in Obsessed, a thriller that had him cast opposite Beyoncé. The latter was a box office success, taking $29 million in its opening weekend.Elba's next film was Legacy (2010), in which he portrayed a black ops soldier who returns to Brooklyn after a failed mission in Eastern Europe, where he has undertaken a journey looking for retribution. He starred in Dark Castle's adaptation of DC/Vertigo's The Losers, under the direction of Sylvain White, in the role of Roque, the second-in-command of a black-ops team out for revenge against a government that did them wrong. Filming took place in Puerto Rico and the movie was released in April 2010. Elba appeared in the thriller Takers (2010). He played Heimdall in Kenneth Branagh's film Thor (2011) (based on the Marvel Comics superhero of the same name).In August 2010, Elba signed up to portray the title character in a reboot of James Patterson's Alex Cross film franchise. However, in February 2011, he was replaced by Tyler Perry. In Ghost Rider: Spirit of Vengeance (2011), the sequel to Ghost Rider (2007), Elba played an alcoholic warrior monk tasked with finding the title character. In February 2012, Elba confirmed that he would portray Nelson Mandela in the film Mandela: Long Walk to Freedom, which is based on his autobiography. As part of his preparation for the role, Elba spent a night locked in a cell alone on Robben Island, where Mandela had been imprisoned. His performance earned him a nomination for the Golden Globe Award for Best Actor – Motion Picture Drama.\nIn June 2012, Elba portrayed Captain Janek in Ridley Scott's Prometheus. He joined the cast of the film Pacific Rim (2013) in the role of Stacker Pentecost. He reprised his role as Heimdall in Thor: The Dark World in 2013. In January 2014, he confirmed that he would be starring in a film adaptation of Luther. In 2014, he starred in No Good Deed as a vengeful psychopathic serial killer.\nIn 2015, Elba appeared as Heimdall in the superhero blockbuster Avengers: Age of Ultron, directed by Joss Whedon. Elba also starred alongside Abraham Attah in the film Beasts of No Nation which premiered in select theaters and on Netflix. He earned a Golden Globe Award nomination for Best Performance by an Actor in a Supporting Role in any Motion Picture as well as a BAFTA Award nomination for Supporting Actor in the Film category. In 2016, he had several voice roles: the cape buffalo chief of police, Chief Bogo, in Disney's Zootopia, alongside Ginnifer Goodwin and Jason Bateman; villainous tiger Shere Khan in The Jungle Book (2016), a live-action remake of the animated 1967 film of the same name; and sea lion Fluke in Pixar's Finding Dory, alongside Ellen DeGeneres and Albert Brooks, both reprising their roles from Finding Nemo (2003). Also that year, he played the main antagonist, Krall, in the sequel Star Trek Beyond. In 2017, he played Roland Deschain in the Stephen King film adaptation The Dark Tower, and starred in Aaron Sorkin's directorial debut Molly's Game, alongside Jessica Chastain. In 2019, Elba starred as the villain in Hobbs & Shaw, a spin-off of The Fast and the Furious franchise, and will play Macavity in Tom Hooper's film adaptation of Andrew Lloyd Webber’s musical, Cats.", "Music career": "Elba has appeared in music videos for Fat Joe (2002), Angie Stone (2004) and rapper Giggs (2010). In 2006, he recorded the four-song EP Big Man for Hevlar Records. He co-produced and performed on the intro to Jay-Z's album American Gangster (2007). He DJed at the 2007 NBA All Star parties at The Venetian and Ice House Lounge in Las Vegas.In July 2009, Elba was the DJ for BET's current series Rising Icons. Elba announced the release of his first single \"Please Be True.\" In the August 2009 issue of Essence magazine, he announced the name of his six-song EP as Kings Among Kings. He released his EP High Class Problems Vol. 1 in the United Kingdom in February 2010, for which he has won many prizes including a Billboard Music Awards nomination.In 2011, he performed on the intro to Pharoahe Monch's album W.A.R.. The following year, he co-directed and performed in the Mumford & Sons music video for \"Lover of the Light\".In 2014, he produced K. Michelle's \"The Rebellious Soul Musical\" which debuted on VH1 on 19 August 2014. In May, Elba featured on Mr Hudson's single \"Step Into the Shadows\". Mr Hudson also produced his album Idris Elba Presents mi Mandela, which was released in November 2014. He also featured on the remix of Ghanaian music group, VVIP's single \"Selfie\" together with Nigerian rapper Phyno released on 12 September 2014 and video released on YouTube on 11 April 2015.\nElba performed a rap for the second album by Noel Fielding and Sergio Pizzorno's band, the Loose Tapestries. Elba also rapped in a remix of Skepta's \"Shutdown\" which was uploaded on 1 June 2015 to SoundCloud. On 17 August, a song was released on which Elba appeared on Nigerian singer D'banj's single \"Confidential\", featuring Sierra Leonean rapper Shadow Boxer with the video uploaded to YouTube on 20 August. In November 2015, Elba opened for Madonna during her Rebel Heart Tour in Berlin, Germany. Elba is also featured on the Macklemore & Ryan Lewis album This Unruly Mess I've Made (2016).\nIn July 2018, he launched his record label, 7Wallace Music. Elba performed at Coachella Valley Music and Arts Festival in April 2019. In 2019 he featured on the track “Boasty” by British grime artist Wiley. Elba also appears in the “Boasty” music video, delivering his verse in a mansion that includes a film set. In 2019, Elba appears in Taylor Swift’s song \"London Boy\" from her seventh studio album Lover. The intro of the song samples a snippet from an interview by Elba.", "Other work": "In October 2014, Elba presented the series Journey Dot Africa with Idris Elba on BBC Radio 2, exploring all types of African music. Elba has also featured in various television commercials for Sky box-sets in 2013, 2014, 2015, and 2016. Elba has collaborated with the UK Parliament in their efforts to eradicate Ebola from West Africa, working alongside the UK Secretary of State for International Development Justine Greening in 2014. Elba has created a collaboration with British fashion label Superdry, which launched at the end of November 2015.Elba hosted The Best FIFA Football Awards 2017 at the London Palladium on 23 October 2017. During the show he took a selfie of \"the best team in the world\" which included Lionel Messi, Cristiano Ronaldo and Neymar.He had the idea to develop the music from his album Idris Elba Presents mi Mandela into a show, which ultimately resulted in a play called Tree which premiered at the Manchester International Festival in 2019. However, authorship of the piece was disputed. On 2 July 2019, The Guardian published a story describing how writers Tori Allen-Martin and Sarah Henley claimed to have been removed from the production under what they described as questionable circumstances. The two writers had worked on the project for four years following an approach from Elba asking them to develop his idea for a musical based on the album, on which Allen-Martin had also collaborated. Kwame Kwei-Armah joined the project in May 2018 and rewrote part of their material. At the time of its premiere Tree was billed as \"created by Idris Elba and Kwame Kwei-Armah\". Allen-Martin and Henley described their creative input as having included research and script-writing, as well as coming up with the play's title, and that after being removed they were threatened with legal action if they went public with the story. Elba and Kwei-Armah both published rebuttals of the writers' account of what happened on Twitter.", "Kickboxing career": "Discovery Channel produced a documentary, Idris Elba: Fighter, chronicling Elba's 12-month kickboxing and mixed martial arts training under Muay Thai coach Kieran Keddle, culminating in Elba's first professional kickboxing fight–and win–against Lionel Graves, a younger, more experienced Dutch opponent, at London's York Hall.\n\n\n=== Kickboxing record ===", "Personal life": "Elba has been married three times: first to Hanne \"Kim\" Nørgaard (from 1999 to 2003) and then to Sonya Nicole Hamlin (for four months in 2006). He has two children: a daughter with Kim named Isan (born 2002), who resides with Nørgaard in Atlanta, Georgia, and a son named Winston (born 2014) with ex-girlfriend Naiyana Garth.  Elba became engaged to Sabrina Dhowre on 10 February 2018, during a screening of his film Yardie at an East London cinema; the pair have been dating since early 2017. They wed on 26 April 2019, in Marrakesh.Elba states that he is spiritual but not religious. Elba is an avid supporter of Arsenal F.C. In 2015, as part of his Discovery Channel miniseries Idris Elba: No Limits, Elba broke the course record land speed \"Flying Mile\" for the Pendine Sands.The Prince's Trust, a UK youth charity founded by Prince Charles in 1976, which Elba credits with helping to start his career, appointed him as their anti-crime ambassador in April 2009. Elba voiced support for a vote to remain in the European Union for the 2016 United Kingdom European Union membership referendum.", "Awards and honours": "In May 2007, Elba was selected as one of People's annual 100 Most Beautiful People in the World. In 2013, he was named Essence's annual  Sexiest Man of the Year and was ranked No. 2 in People's annual Sexiest Man Alive. In October 2014, Elba was presented with a MOBO Inspiration Award.In 2015, he was named one of GQ magazine's 50 best-dressed British men. Elba was appointed an Officer of the Order of the British Empire (OBE) in the 2016 New Year Honours for services to drama. In 2017, Elba won the male title for the \"Rear of the Year\" award in Britain.In September 2018, he was one of 50 people named for \"making London awesome\" and helping to shape London's cultural landscape who were featured in Time Out to mark the magazine's 50th anniversary. On 5 November 2018, it was announced he had been named People's Sexiest Man alive via The Tonight Show Starring Jimmy Fallon.", "Filmography": "", "Discography": "Albums\n\n2015: Murdah Loves John (The John Luther Character Album)Extended plays\n\n2006: Big Man\n2009: Kings Among Kings\n2010: High Class Problems Vol. 1\n2014: Idris Elba Presents Mi MandelaRemixes\n\n\"Trust in Me\"\n\"The Bare Necessities\"Mixtapes\n\n2011: Merry DriisMas Holiday MixtapeOther appearances\n\n2019: \"London Boy\" by Taylor Swift — The intro of the song samples a snippet from an interview by Elba.Featured singles", "References": "", "External links": "Official website \nIdris Elba on IMDb \nIdris Elba at the TCM Movie Database \nIdris Elba at AllMovie"}