{"_id": "76", "name": "Paul Rudd", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:01", "biography": "Paul Rudd (born April 6, 1969) is an American actor, comedian, writer, and film producer. Rudd studied theater at the University of Kansas and the American Academy of Dramatic Arts, before making his acting debut in 1992 with NBC's drama series Sisters. \nHe is known for his roles in the films Clueless (1995), Romeo + Juliet (1996), Wet Hot American Summer (2001), Anchorman: The Legend of Ron Burgundy (2004), The 40-Year-Old Virgin (2005), Knocked Up (2007), Role Models (2008), I Love You, Man (2009), This Is 40 (2012), The Perks of Being a Wallflower (2012), Anchorman 2: The Legend Continues (2013), The Fundamentals of Caring (2016), Mute (2018), and Ideal Home (2018). Rudd also has a notable role as Scott Lang/Ant-Man in the Marvel Cinematic Universe, appearing in Ant-Man (2015), Captain America: Civil War (2016), Ant-Man and the Wasp (2018), and Avengers: Endgame (2019).\nIn addition to his film career, Rudd has appeared in numerous television shows, including the NBC sitcom Friends as Mike Hannigan, along with guest roles on Tim and Eric Awesome Show, Great Job! and Parks and Recreation, and has also hosted Saturday Night Live. Rudd received a star on the Hollywood Walk of Fame on July 1, 2015. He was part of Forbes Celebrity 100 in 2019.", "Early life": "Rudd was born in Passaic, New Jersey, to a Jewish family. His father, Michael Rudd, was a historical tour guide and former vice-president of Trans World Airlines who died of cancer in 2008. His mother, Gloria Irene (Granville), was a sales manager at the television station KCMO-TV in Kansas City, Missouri. His parents were born in England; his father was from Edgware and his mother from Surbiton, both in London. Rudd's parents were both descended from Ashkenazi Jewish immigrants who moved to Britain from Russia, Belarus, and Poland. His father's family's original surname, \"Rudnitsky\", was changed by his grandfather to \"Rudd\", and his mother's family's surname was originally \"Goldstein\". Rudd had a Bar Mitzvah service  in Ontario, Canada. Growing up, he loved reading British comics, The Beano and The Dandy, which his uncle in the U.K. would send to him.When he was ten, Rudd's family moved to Lenexa, Kansas. His family also spent three years living in Anaheim, California, because of his father's occupation. In the Kansas City metropolitan area, Rudd attended Broadmoor Junior High and graduated from Shawnee Mission West High School in the class of 1987. Rudd attended the University of Kansas, where he majored in theater. He was a member of the Sigma Nu fraternity's Nu Chapter there. He studied at the American Academy of Dramatic Arts/West in Los Angeles with fellow actor Matthew Lillard. Rudd spent three months studying Jacobean drama at the British American Drama Academy based in Oxford, England. While attending acting school, Rudd worked as a Bar Mitzvah disc jockey. After graduation he worked a variety of odd jobs, including glazing hams at the Holiday Ham Company in Overland Park, Kansas.", "Career": "=== 1992–1999: Early career ===\nRudd made his acting debut in 1992 with the television drama Sisters where he played Kirby Quimby Philby. In 1994, he appeared in Wild Oats for six episodes. Rudd left Sisters in 1995 to appear in the comedy film Clueless with Alicia Silverstone. He also appeared in Halloween: The Curse of Michael Myers, William Shakespeare's Romeo + Juliet, The Locusts, Overnight Delivery, The Object of My Affection, and 200 Cigarettes. He was part of the cast of the 1999 film The Cider House Rules that received a SAG nomination for Outstanding Performance by a Cast in a Motion Picture.\n\n\n=== 2000–2009: Success with leading roles ===\nHe played FBI Agent Ian Curtis in Benny Chan's 2000 Hong Kong action film Gen-Y Cops. In 2002, he was cast on the sitcom Friends as Mike Hannigan, who dates and then marries Phoebe Buffay, played by Lisa Kudrow. In 2006, he appeared in several episodes of Reno 911! as \"Guy Gerricault\" (pronounced \"jericho\"), the coach of a lamaze class, and then portrayed a drug lord in the Reno 911!: Miami film. He guest-starred as a has-been 1990s rock star, Desmond Fellows, on the television series Veronica Mars, in the 2007 episode \"Debasement Tapes\".\n\nThe year 2004 marked the start of his work with director/producer Judd Apatow, first on the film Anchorman: The Legend of Ron Burgundy as Brian Fantana with Steve Carell, David Koechner and Will Ferrell, produced by Apatow and again in 2005 in The 40-Year-Old Virgin with Carell and Seth Rogen, directed by Apatow. He subsequently worked with Apatow in 2007's Knocked Up, as frustrated husband Pete, married to Leslie Mann's character. In that film, he co-starred with Jason Segel, Jonah Hill, Seth Rogen, and Jay Baruchel. He also was the narrator for the 2007 edition of the sports documentary series Hard Knocks, focusing on his favorite team, the Kansas City Chiefs. (This is the only time someone other than Liev Schreiber has narrated a season of Hard Knocks.) \nRudd appeared as John Lennon in the comedy film Walk Hard: The Dewey Cox Story in 2007 and as the drug-addled surf instructor in Nicholas Stoller's Forgetting Sarah Marshall in 2008 with Jason Segel and Jonah Hill, both of which Apatow produced. Rudd appeared in uncredited cameos in Year One (2009) and Bridesmaids (2011). In 2012, he starred and also co-produced with Apatow on the film Wanderlust with Jennifer Aniston. He starred in the comedy film This Is 40 with Leslie Mann, a spinoff from Knocked Up, which was directed and produced by Apatow. He reprised his role as Brian Fantana in the 2013 sequel Anchorman 2: The Legend Continues.\nIn 2007, he starred in The Oh in Ohio and The Ten, which reunited him with David Wain and Michael Showalter, and then in Over Her Dead Body with Eva Longoria the next year. In his next comedy which he also wrote, Role Models, he and co-star Seann William Scott portray energy drink salesmen forced to perform community service in a child mentoring program.In 2009, Rudd again appeared with Jason Segel in I Love You Man where he and Segel play buddies who bond over their shared love for the rock band Rush. Both Rudd and Segel are themselves fans of the band. Also in 2009, Rudd co-created the TV series Party Down with John Embom, Rob Thomas and Dan Etheridge. He lent his voice to the DreamWorks computer-animated movie Monsters Vs. Aliens.\n\n\n=== 2010–present: Continued success and Ant-Man ===\nIn 2010, Rudd reunited with Steve Carell for the first time since The 40-Year-Old Virgin for the Jay Roach-directed comedy Dinner for Schmucks. In 2012, he had a supporting role in the teen drama The Perks of Being a Wallflower, playing Mr. Anderson, a teacher of Charlie, played by Logan Lerman. He starred in the 2011 comedy-drama film Our Idiot Brother with Elizabeth Banks, Zooey Deschanel, and Emily Mortimer. It was the fifth film that Rudd starred in with Elizabeth Banks. He had previously appeared with her in Wet Hot American Summer (2001), The Baxter (2005), The 40-Year-Old Virgin (2005) and Role Models (2008).\n\nIn 2012, Rudd signed to appear on four episodes of NBC's Parks and Recreation as Bobby Newport, a candidate for City Council and a rival of Amy Poehler's character Leslie Knope, a role for which he won the Critics' Choice Television Award for Best Guest Performer in a Comedy Series. In 2014, he began providing voiceovers for Hyundai television commercials. He has also voiced the audiobook recordings of John Hodgman's books The Areas of My Expertise (2005) and More Information Than You Require (2008).On December 19, 2013, Rudd was officially confirmed as cast in the 2015 Marvel film Ant-Man. He played lead character Scott Lang/Ant-Man. Rudd reprised his role in Captain America: Civil War (2016) as well as Ant-Man's 2018 sequel, Ant-Man and the Wasp; he also co-wrote the latter. Rudd returned alongside Evangeline Lilly in Avengers: Endgame (2019).\nRudd reprised his role as Andy from Wet Hot American Summer in the Netflix prequel Wet Hot American Summer: First Day of Camp, alongside an ensemble cast including Bradley Cooper, Amy Poehler and Elizabeth Banks, all reprising their roles from the 2001 film. In 2016, he appeared in the comedy-drama film The Fundamentals of Caring, alongside Selena Gomez, and lent his voice to the animated films The Little Prince and Sausage Party. Rudd was also cast as the lead in The Catcher Was a Spy (2018), playing Moe Berg, a catcher for the Boston Red Sox in the 1930s.  Nicknamed \"The Professor,\" Berg spoke several languages, avoided social contact with team members and joined the OSS during the Second World War.\n\n\n=== Theatre ===\nRudd has also appeared in Broadway plays, the first being The Last Night of Ballyhoo as Joe Farkas in 1997. The next year he appeared in Twelfth Night with Kyra Sedgwick and Max Wright at the Lincoln Center Theatre. In 2006, he appeared in the Broadway production of Richard Greenberg's Three Days of Rain with Bradley Cooper and Julia Roberts at the Bernard Jacobs Theater. In 2012, Rudd appeared in the Broadway production of Craig Wright's Grace at the Cort Theatre. Starring alongside Rudd was Academy Award nominee Michael Shannon, Kate Arrington, and seven-time Emmy Award winner Ed Asner.", "Personal life": "In 2003, Rudd married Julie Yaeger, whom he met shortly after working on Clueless in his publicist's office where Yaeger was employed. They have two children: a son, Jack Sullivan (b. 2004) and a daughter, Darby (b. 2009).Rudd is a fan of MLB's Kansas City Royals and of the NFL's Kansas City Chiefs, for whom he narrated the 2007 season of HBO's Hard Knocks.Rudd received a star on the Hollywood Walk of Fame on July 1, 2015. He unveiled the 2,554th star on the mile-long strip of plaques on Hollywood Boulevard. At the occasion Rudd said, \"I remember being a kid and walking this boulevard and reading the names and thinking about what so many other millions of people thought about, which is, you know, 'Who's that?'\"Rudd is a supporter of the Stuttering Association for the Young (SAY), a nonprofit organization dedicated to helping young people who stutter. He hosted the organization's 6th Annual All-Star Bowling Benefit on January 22, 2018. Rudd told Vanity Fair that he became an advocate for stuttering awareness after portraying a character who stutters in a play. Rudd is also a founder of the charity The Big Slick, a celebrity studded sports-focused event held in Kansas City every June to support the works of Kansas City's Children's Mercy Hospital.\nSince 2014, Rudd and fellow actor Jeffrey Dean Morgan have been co-owners of Samuel's Sweet Shop, a candy store in the town of Rhinebeck, New York, that they saved from being closed after the previous owner, a friend of theirs, died suddenly.", "Filmography and awards": "", "References": "", "External links": "Paul Rudd at the Internet Broadway Database \nPaul Rudd on IMDb \nPaul Rudd on National Public Radio"}