{"_id": "66", "name": "Christian Bale", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:51", "biography": "Christian Charles Philip Bale (born 30 January 1974) is a Welsh actor who is known for his intense method acting style, often transforming his body drastically for his roles. Bale is the recipient of many awards, including an Academy Award and two Golden Globes, and was featured in the Time 100 list of 2011.\nBorn in Haverfordwest, Wales, to English parents, Bale had his first starring role at age 13 in Steven Spielberg's war film Empire of the Sun (1987). Following a decade of leading and supporting roles, including in Little Women (1994), he gained wider recognition for portraying the serial killer Patrick Bateman in American Psycho (2000). In 2004, he lost 63 pounds for his role in the psychological thriller The Machinist (2004). Within six months, he gained 100 pounds to star as Batman in Christopher Nolan's superhero film Batman Begins (2005). He later reprised his role in the sequels The Dark Knight (2008) and The Dark Knight Rises (2012).\nBale continued to take on starring roles, including in Nolan's period drama The Prestige (2006), the western 3:10 to Yuma (2007), the science fiction film Terminator Salvation (2009), and the crime drama Public Enemies (2009). He won the Golden Globe and Academy Award for Best Supporting Actor for his portrayal of Dicky Eklund in the David O. Russell-directed biographical film The Fighter (2010). This acclaim continued with his Oscar-nominated roles in Russell's black comedy American Hustle (2013) and in Adam McKay's satires The Big Short (2015) and Vice (2018). For portraying Dick Cheney in the latter, he won a Golden Globe Award for Best Actor. \nBale's personal life and personality has been the subject of much public attention, despite his desire to keep a low profile. He is a supporter of Sea Shepherd Conservation Society, Greenpeace, and the World Wildlife Fund, and obtained American citizenship in 2014. Bale has been married to Sandra Blažić since 2000; they have two children.", "Early life": "Bale was born in Haverfordwest, Pembrokeshire, the son of Jenny (née James), a circus performer, and David Bale, an entrepreneur, commercial pilot and talent manager. Bale has three sisters. His mother is English and his father was born in South Africa, to English parents. Bale has remarked, \"I was born in Wales but I'm not Welsh – I'm English\". He spent his childhood in Wales, Surrey and Dorset in England, and Portugal. Bale acknowledged that the frequent relocation had a major influence on his career choice. He attended Bournemouth School, but left at age 16.Bale studied the work of actor Gary Oldman, citing him as \"the reason I'm acting\". His first role was a commercial for the fabric softener Lenor in 1982. A year later, he appeared in a Pac-Man cereal commercial, playing a child rock star. In 1984, he made his stage debut in The Nerd on London's West End with Rowan Atkinson.Bale's parents divorced in 1991. His mother and sister Sharon stayed in Bournemouth, and Bale moved with his father to Los Angeles, California at age seventeen.", "Career": "=== Debut and breakthrough: 1986–1998 ===\n\nBale made his film debut as Tsarevich Alexei Nikolaevich of Russia in the made for television film Anastasia: The Mystery of Anna in 1986, which was followed by leading roles in the miniseries Heart of the Country and the fantasy adventure Mio in the Land of Faraway, in which he appeared with Christopher Lee and Nick Pickard. His performance as the boy Jim Graham in Empire of the Sun (1987) earned him widespread critical praise and the first \"Best Performance by a Juvenile Actor\" award from the National Board of Review of Motion Pictures. The attention the press and his schoolmates lavished upon him after this took a toll on Bale, and he contemplated giving up acting. But Kenneth Branagh approached him and persuaded Bale to appear in Henry V in 1989, which he found to be a good experience. In 1990, he played the role of Jim Hawkins opposite Charlton Heston (as Long John Silver) in Treasure Island, a film adaptation of Robert Louis Stevenson's classic book.\nBale starred in the musical films Newsies and Swing Kids, the latter about teenagers who secretly listened to forbidden jazz during the rise of Nazi Germany. Bale was recommended by actress Winona Ryder to star in director Gillian Armstrong's 1994 film Little Women. Bale voiced Thomas, a young compatriot of Captain John Smith, in Disney's Pocahontas (1995). In 1997 he played Arthur Stuart in Velvet Goldmine, Todd Haynes' tribute to glam rock. In 1999, Bale contributed to an all-star cast, including Kevin Kline, Michelle Pfeiffer, Stanley Tucci, and Rupert Everett, portraying Demetrius in an updated version of William Shakespeare's A Midsummer Night's Dream.\n\n\n=== Rise to prominence: 1999–2004 ===\nIn 1999, Bale played serial killer Patrick Bateman in American Psycho, director Mary Harron's adaptation of Bret Easton Ellis' novel of the same title. Bale was briefly dropped from the project in favour of Leonardo DiCaprio, but DiCaprio eventually dropped out to star in The Beach. Bale was again cast in the role. He researched his character by studying the novel and prepared himself physically for the role by spending months tanning and exercising in order to achieve the \"Olympian physique\" of the character as described in the original novel. He distanced himself from the cast and crew in order to maintain the darker side of Bateman's character. American Psycho premiered at the 2000 Sundance Film Festival to much controversy. Roger Ebert condemned the film at first, calling it pornography and \"the most loathed film at Sundance.\" Nonetheless, he gave it a favorable review, writing that director Harron had \"transformed a novel about bloodlust into a film about men's vanity.\" Of Bale's performance, he wrote, \"Christian Bale is heroic in the way he allows the character to leap joyfully into despicability; there is no instinct for self-preservation here, and that is one mark of a good actor.\"On 14 April 2000, Lions Gate Films released American Psycho in cinemas. Bale was later approached to make a cameo appearance in another Bret Easton Ellis adaptation, The Rules of Attraction, a film loosely connected to American Psycho, but he declined out of loyalty to Harron's vision of Bateman. He believed that it could not be properly expressed by any other director. In 2000, he played a wealthy murderer in John Singleton's Shaft. Bale's first role after American Psycho was in the John Madden adaptation of the best-selling novel Captain Corelli's Mandolin. Bale played Mandras, a Greek fisherman who vied with Nicolas Cage's title character for the affections of Pelagia (Penélope Cruz). Captain Corelli's Mandolin was Bale's second time working with John Hurt, after All the Little Animals.\nFrom 2002 to 2003, Bale starred in three feature films, such as Laurel Canyon (2002), which was generally well received by critics. This film marked the second time he worked with actress Kate Beckinsale, his co-star in Prince of Jutland (1994). Critics generally focused on star Frances McDormand's performance over the rest of the cast, however.The post-apocalyptic action fantasy film, Reign of Fire, was Bale's first action vehicle. Compared to his previous work, it had an immense budget estimated at $95,000,000. Bale entered into negotiations about starring in the film with reservations, but director Rob Bowman convinced him to take the lead role. Bale played Quinn Abercromby with Matthew McConaughey's Denton Van Zan. They trained for their respective roles by boxing and working out.Equilibrium was Bale's third film of 2002, costing $20 million to produce but earning just more than $5 million worldwide. In Equilibrium, Bale played John Preston, an elite law enforcer in a dystopian society. Equilibrium featured a fictional martial art called Gun Kata that combined gunfighting with hand-to-hand combat. According to moviebodycounts.com, the character of John Preston has the third most on-screen kills in a single movie ever, with 118, exactly half of the movie's total of 236.After a year off, Bale returned in 2004 to play Trevor Reznik, the title character in the psychological thriller The Machinist. Bale gained attention for his devotion to the role; he went to great lengths to achieve Reznik's emaciated, skeletal appearance. He went without proper rest for prolonged periods, and placed himself on a crash diet of generally coffee and apples, which reduced his weight by 63 pounds (4 st 7 lb or 28.6 kg) in a matter of months. By the end of filming, Bale weighed only 121 pounds (8 st 9 lb or 55 kg), a transformation he described as \"very calming mentally\". His actions prompted comparisons to Robert De Niro's weight-gaining regimen for his role as Jake LaMotta in the 1980 film Raging Bull.Bale claimed that he had not worked for a period of time before he was cast in the film: \n\n\"[I] just hadn't found scripts that I'd really been interested in. So I was really dying for something to arrive. Then when this one did, I just didn't want to put it down. I finished it and, upon the kind of revelation that you get at the end, I immediately wanted to go back and re-visit it, to take a look at what clues I could have gotten throughout\".The Machinist was a low-budget production, costing about $5 million to produce, and was given a limited US release. It was well received, with the review aggregator website Rotten Tomatoes reporting that 77 percent of the critics' reviews tallied were positive.Bale was a fan of Hayao Miyazaki's Spirited Away. He was cast as the voice of title character Howl in the English-language dub of the Japanese director's fantasy anime adventure Howl's Moving Castle. This is an adaptation of Diana Wynne Jones's children's novel of the same name. Its gross in the US was $4,711,096, a fraction of its worldwide gross ($235,184,110).\n\n\n=== The Dark Knight trilogy: 2005–2012 ===\nIn 2004, after completing filming for The Machinist, Bale won the lead role of Batman and his alter ego Bruce Wayne in Christopher Nolan's Batman Begins, a reboot of the Batman film series. Still relatively unknown, Bale was picked over Jake Gyllenhaal, his closest competitor for the role.After having lost weight for the previous role, Bale had to gain weight and muscle to achieve Batman's muscular physique. He was given a deadline of six months to do this. Bale recalled it was not simple to achieve, \"when it actually came to building muscle, I was useless. I couldn't do one push up the first day. All of the muscles were gone, so I had a real tough time rebuilding all of that.\" With the help of a personal trainer, Bale succeeded in meeting the deadline, gaining a total of 100 lb (45 kg) in six months. He went from 121 lbs to 221 lbs. Discovering that he had gained more weight than the director desired, he dropped 30 pounds by the time filming began.Bale had concerns about playing Batman, as he felt ridiculous in the Batsuit. He decided to portray Batman as a savage beast. To attain a deeper understanding of the character, Bale read various Batman comic books. He explained his interpretation of the young boy: \n\n\"Batman is his hidden, demonic rage-filled side. The creature Batman creates is an absolutely sincere creature and one that he has to control but does so in a very haphazard way. He's capable of enacting violence — and to kill — so he's constantly having to rein himself in.\" For Bale, the most grueling part about playing Batman was the suit. \"You stick it on, you get hot, you sweat and you get a headache in the mask ... But I'm not going to bitch about it because I get to play Batman\", he said.Bale trained in Wing Chun Kung Fu under Eric Oram in preparation for the movie. When promoting the film in interviews and public events, Bale continued to use an American accent to avoid confusion.Batman Begins was released in the U.S. on 15 June 2005 and was a U.S. and international triumph for Warner Bros., costing approximately $135 million to produce and taking in more than $370 million in returns worldwide. Bale's performance was well received by critics and fans alike, earning him the Saturn Award for Best Actor and the Best Hero award at the 2006 MTV Movie Awards. He also provided his voice and likeness for the video game adaptation of the film.\n\nBale reprised the role of Batman in the sequel The Dark Knight. He trained in the Keysi Fighting Method, and performed many of his own stunts. The Dark Knight was released in the U.S. on 18 July 2008 and stormed through the box office, with a record-breaking $158.4 million in the U.S. in its first weekend. It broke the $300 million barrier in 10 days, the $400 million mark in 18 days and the $500 million mark in 43 days, three new U.S. box office records set by the film. The film went on to gross more than $1 billion at the box office worldwide, making it the fourth highest-grossing movie worldwide ever at that time, before adjusting for inflation. It also ranks as one of the most critically acclaimed superhero films ever made.Bale reprised the role again for the sequel The Dark Knight Rises, released on 20 July 2012. Bale became the actor to have portrayed Batman on film for the lengthiest period. Following the shooting at a midnight showing of The Dark Knight Rises, he visited survivors of the movie theater in an Aurora, Colorado hospital. The film garnered further critical praise and financial achievement, earning more than $1 billion worldwide. Currently, the film is the 27th highest-grossing film worldwide unadjusted for inflation, and the third highest-grossing film released in 2012. It was the most financially successful movie in which Bale has starred.\n\n\n=== Post-Batman Begins: 2006–2009 ===\nAfter Batman Begins, Bale returned to appearing in independent films. He was cast as one of the two lead roles in the South Central Los Angeles David Ayer-helmed crime drama Harsh Times, co-starring Freddy Rodriguez and Eva Longoria. Bale played Jim Luther Davis, an aloof Afghanistan War veteran afflicted with post-traumatic stress disorder, approached by the Department of Homeland Security and hired as a federal agent. Harsh Times premiered at the 2005 Toronto International Film Festival and had a wide release on 10 November 2006.Terrence Malick directed The New World, a period piece inspired by the stories of Pocahontas, and Bale was cast as John Rolfe. He shared the screen with Colin Farrell and Q'Orianka Kilcher, who played John Smith and Pocahontas. The majority of screen time was devoted to Farrell and Kilcher; Bale was a secondary character, and only appeared during the last third of the film. The film was a failure at the U.S. box office and its worldwide total of $29,506,437 fell short of turning a profit against the production budget of $30 million.In 2006, Bale took on four projects. Rescue Dawn, by German filmmaker Werner Herzog, had him playing U.S. Fighter pilot Dieter Dengler, who has to fight for his life after being shot down while on a mission during the Vietnam War. Bale left a strong impression on Herzog, with the director complimenting his acting abilities: \"I find him one of the greatest talents of his generation. We made up our own minds long before he did Batman.\"\n\nIn The Prestige, an adaptation of the Christopher Priest novel about a rivalry between two Victorian stage magicians, Bale was reunited with Batman Begins' Michael Caine and director Christopher Nolan. The cast of The Prestige also included Hugh Jackman, Scarlett Johansson, Piper Perabo, and David Bowie. I'm Not There, in which Bale again worked with Todd Haynes and Heath Ledger (who would go on to play The Joker in The Dark Knight), is an artistic reflection of the life of Bob Dylan. He starred with Russell Crowe in a commercially and critically successful western film, 3:10 to Yuma. Bale was originally cast to play George W. Bush in Oliver Stone's film, W., but dropped out due to the prosthetics involved. He played John Connor in Terminator Salvation and FBI agent Melvin Purvis in Michael Mann's Public Enemies.\n\n\n==== 2008 Terminator Salvation incident ====\nIn July 2008, Bale flew into an angry rant on the set of Terminator Salvation, while filming in New Mexico. In February 2009, the audio recording of the incident was released. The tirade was directed at Shane Hurlbut, director of photography for the film. According to Bale, Hurlbut had, for the second time, ruined his concentration by walking onto the set during a scene. The recording is of Bale directing profanities at Hurlbut, threatening and belittling him, and finally threatening to quit the film if Hurlbut repeated the offense without being fired for it. It was reported that Warner film executives sent the tape to the insurer of the film in case Bale decided to quit the movie.In an interview with E! Online, Bruce Franklin, assistant director and producer of Terminator Salvation, said it was an isolated incident. \"If you are working in a very intense scene and someone takes you out of your groove ... it was the most emotional scene in the movie ... and for him to get stopped in the middle of it. He is very intensely involved in his character. He didn't walk around like that all day long. It was just a moment and it passed\", Franklin said.Actors Whoopi Goldberg and Terry Crews, directors Darren Aronofsky and Ron Howard, as well as Ain't It Cool News website creator Harry Knowles have also publicly defended Bale's actions. Some have noted that it is customary for crew members to remain still while the camera is rolling. Experimental band The Mae Shi wrote the song, \"R U Professional\", which features samples from the recording; similarly, Lucian Piane's remix \"Bale Out\" is composed almost entirely of audio from the incident. Stephen Colbert parodied the incident on the 4 February 2009 episode of The Colbert Report, in which guest Steve Martin repeatedly walked in front of the camera and was berated by Colbert. The incident was re-enacted on Late Night with Conan O'Brien, with Inside the Actor's Studio host James Lipton portraying both Bale and the crew member. The \"Oh, goooood for you!\" sound bite has become a regular drop from Fred Norris of The Howard Stern Show.Bale made a public apology on 6 February 2009, to a Los Angeles radio station, KROQ, stating that the outburst was \"inexcusable\" and was motivated by the intensity of that day's shooting. Bale said he \"acted like a punk\", and that he and Hurlbut talked after the incident and \"resolved this completely\". Bale acknowledged that the two worked together for several hours after the incident. He said, \"at least a month after that... I've seen a rough cut of the movie and he has done a wonderful job. It looks fantastic.\"\n\n\n=== Continued success: 2010–present ===\n\nBale starred alongside Mark Wahlberg in David O. Russell's 2010 drama film The Fighter. Bale's portrayal of Dicky Eklund, for which he lost 30 pounds (14 kg), was universally acclaimed: he won the Golden Globe Award for Best Supporting Actor, the Academy Award for Best Supporting Actor and 30 other awards in 2011 for the performance. Near the end of his acceptance speech during the televised Golden Globes awards ceremony, Bale complimented Robert De Niro by saying he was \"the shit\". The comment was censored by NBC.In December 2010, it was announced that Bale would star in the historical drama war film, The Flowers of War, directed by Zhang Yimou. While filming The Flowers of War in January 2011, Bale and a CNN crew attempted to visit Chen Guangcheng, a blind \"barefoot lawyer\" under unofficial house arrest for his activism against China's One Child Policy. While on camera, Bale was punched, shoved, and denied access by dozens of Chinese security guards who failed to recognise him. Bale later added that he had wanted \"to meet the man, shake his hand and say what an inspiration he is\". Video footage also showed Bale and the CNN crew having stones thrown at them. A minivan chased their car for more than 40 minutes.In 2013, Bale portrayed Russell Baze in Scott Cooper's thriller Out of the Furnace. He starred as Moses in Ridley Scott's Biblical epic, Exodus: Gods and Kings, which was released on 12 December 2014.Bale starred in American Hustle, which reunited him with director David O. Russell, after their work on The Fighter. He was nominated for an Academy Award for Best Actor. Bale went to great lengths to play American Hustle's lead Irving Rosenfeld, a con man. He gained 43 pounds (20 kg), shaved his head to yield a realistic comb over, and affected a slouch, shortening his height by 3 inches (7.6 cm). This resulted in a herniated disc. De Niro, who had a cameo role in the film, reportedly did not recognize him when they were introduced.Bale starred in Adam McKay's biopic The Big Short (2015), a film based on the book of same name by Michael Lewis about the financial crisis of 2007–08. In the film, Bale played Michael Burry, a man with Asperger syndrome who becomes a neurologist and then a hedge fund manager. Bale used an ocular prosthesis. Writing for The Wall Street Journal, Joe Morgenstern found his performance \"scarily hilarious—or in one-liners and quick takes, deftly edited.\" The film earned Bale nominations for the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy and the Academy Award for Best Supporting Actor.Bale appeared in Knight of Cups, directed by Terrence Malick. He was cast to appear in Song to Song but his part was cut from the film. Bale was attached to star as the famed auto sport legend Enzo Ferrari in an untitled film to be directed by Michael Mann, but he dropped out after health concerns over the weight gain necessary to play the iconic carmaker. In the historical drama The Promise (2016), set during the Armenian Genocide, Bale played an American journalist who becomes involved in a love triangle among a woman (Charlotte Le Bon), an Armenian medical student (played by Oscar Isaac), and Bale. In the period western Hostiles (2017), directed by Scott Cooper, Bale starred as a U.S. Cavalry officer escorting a gravely ill Cheyenne war chief and his family, who have been released from prison, back to their home in Montana. The Hollywood Reporter critic Todd McCarthy praised his \"expertly judged lead performance\" in the film.Bale portrayed Dick Cheney in the biographical comedy-drama Vice (2018), written and directed by Adam McKay. For this role, Bale, once again, underwent a major body transformation and received widespread acclaim as well as a Golden Globe Award for Best Actor in a Motion Picture, Musical or Comedy and Critics' Choice Movie Award for Best Actor. His nomination for the Academy Award for Best Actor for his role in Vice was announced on 22 January 2019. Bale is set to portray Ken Miles in the action biographical drama Ford v Ferrari (2019), directed by James Mangold.", "Personal life": "On 29 January 2000, Bale married Sandra \"Sibi\" Blažić (born 1970), an American former model, make-up artist, and personal assistant to actress Winona Ryder. The couple have two children: a daughter, Emmaline (born 2005), and a son, Joseph (born 2014). In 2019, he jokingly referred to them as \"Banana and Burrito\" in his acceptance speech at the Golden Globes, a light-hearted dig aimed at celebrity couples giving their children unusual names.Bale has resided in Los Angeles since 1992. He applied for U.S. citizenship in 2010 and completed the naturalization process in 2014.In 2000, Bale became the stepson of feminist Gloria Steinem, who married his father David Bale that year. The senior Bale died in 2003 of a brain lymphoma.Bale actively supports environmental groups such as Sea Shepherd Conservation Society, Greenpeace, and the World Wildlife Fund. Along with his wife, Sibi, he is on the Board of Trustees of the Dian Fossey Gorilla Fund.On 22 July 2008, Bale was arrested in London after being accused of assault by his mother, Jenny, and sister, Sharon, at The Dorchester hotel. After his mother and sister called the authorities, Bale was held for more than four hours. He was released on bail, pending further investigation. On 14 August 2008, police declared that they would take no further action against him. Bale denied that any assault had occurred, and the charges were dismissed for lack of evidence.", "In the media": "Bale has been described in the media as one of the most versatile and talented actors of his generation. The media considers Bale a sex symbol, an image he has confessed to disliking: \"All you have to do is stand on this side of the red carpet and you're called a sex symbol. There's no more to it than that.\" In 2011, he was listed among the Time 100, a compilation of the 100 most influential people in the world selected annually by Time.", "Filmography": "", "See also": "List of awards and nominations received by Christian Bale", "References": "", "Further reading": "Holmstrom, John. The Moving Picture Boy: An International Encyclopaedia from 1895 to 1995, Norwich, Michael Russell, 1996, p. 394.", "External links": "Christian Bale on IMDb \nChristian Bale at Box Office Mojo\nChristian Bale at AllMovie\nChristian Bale   on Charlie Rose\n\"Christian Bale collected news and commentary\". The New York Times.\nWorks by or about Christian Bale in libraries (WorldCat catalog)\nChristian Bale at Curlie"}