{"_id": "39", "name": "Cameron Diaz", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:39", "biography": "Cameron Michelle Diaz (born August 30, 1972) is a retired American actress, writer and former model. She has frequently appeared in comedies throughout her career, while also earning critical recognition in dramatic films. Her accolades include four Golden Globe Award nominations, three Screen Actors Guild Award nominations, and a New York Film Critics Award. In 2013, she was named the highest-paid actress over 40 in Hollywood. As of 2018, the U.S. domestic box office grosses of Diaz's films total over U.S. $3 billion, with worldwide grosses surpassing $7 billion, making her the fifth highest-grossing U.S. domestic box office actress.Born in San Diego, California, Diaz was raised in Long Beach. While still in high school, she signed a modeling contract with Elite Model Management. She made her film debut at age 21 opposite Jim Carrey in the comedy The Mask (1994). She was subsequently cast in a supporting role in My Best Friend's Wedding (1997) before appearing as the titular Mary in the Farrelly brothers' hit comedy There's Something About Mary (1998), which brought her increased fame and a Golden Globe nomination for Best Actress in a Comedy or Musical. Her following two projects—the sports drama Any Given Sunday, and Spike Jonze's surrealist fantasy Being John Malkovich (both 1999)—lent Diaz a reputation as a dramatic actress, the latter earning her her second Golden Globe nomination.\nDiaz earned a third Golden Globe nomination for her supporting role in Vanilla Sky (2001), and appeared in numerous high-profile films in the early 2000s, including Charlie's Angels (2000) and its sequel Charlie's Angels: Full Throttle (2003), as well as voicing the character of Princess Fiona in the Shrek series (2001–2010). In 2003, she was cast in Martin Scorsese's period epic Gangs of New York, for which she earned her fourth Golden Globe nomination. Her subsequent films included the dramatic comedies In Her Shoes (2005) and The Holiday (2006), and the psychological thriller The Box (2009). Diaz appeared in supporting parts in The Green Hornet in 2011, followed by starring roles in the comedies The Other Woman and Sex Tape (both 2014).\nAfter appearing in Will Gluck's 2014 film adaptation of Annie, Diaz confirmed she was formally retiring from acting. Diaz is the author of two health books: The Body Book (2013), a New York Times bestseller, and The Longevity Book (2016).", "Life and career": "=== 1972–1993: Early life and modeling ===\nCameron Michelle Diaz was born August 30, 1972 in San Diego, California to Billie (née Early), an import/export agent, and Emilio Diaz (d. 2008), a foreman of the California oil company Unocal. Diaz has an elder sister, Chimene. Her father's family is Cuban, and Diaz's ancestors had originally moved from Spain to Cuba. Later they settled in Ybor City, Tampa, before moving to California, where her father was born. Her mother has predominantly English and German ancestry.Diaz was raised in Long Beach and attended Los Cerritos Elementary School, and then Long Beach Polytechnic High School, where she was a classmate of Snoop Dogg. She recalled her upbringing as frugal, stating: \"I had amazing parents, they were awesome. We weren't privileged—very much the opposite. My family would collect [soda] cans to turn in for extra money, because $20 meant something to us. But we were very happy.\"While still attending high school, Diaz signed a modeling contract with Elite Model Management at age 16, and appeared in advertisements for Calvin Klein and Levi's. The following year, at age 17, she was featured on the cover of the July 1990 issue of Seventeen magazine. Diaz also modeled for 2 to 3 months in Australia and shot a commercial for Coca-Cola in Sydney in 1991.In 1992, at age 19, she was photographed and videotaped topless for an S&M leather fashion lingerie editorial by John Rutter, photographer, and Clifford Wright, as producer for an editorial for Max Magazine Italy. They were never released. Rutter approached Diaz in 2003, ahead of the release of Charlie's Angels: Full Throttle, offering to sell the pictures and video to her for $3.5 million before attempting to sell them to prospective buyers. He stated that he was offering her first right of refusal to them; she saw it as attempted blackmail and sued him. In July 2004, the 30-minute video of the photoshoot, entitled She's No Angel, was released on a Russian website. Rutter denied releasing it. On July 26, 2005, Rutter was convicted of attempted grand theft, forgery, and perjury. On September 16, 2005, Rutter was sentenced to more than three years in prison.\n\n\n=== 1994–1998: Film debut and rise ===\n\nAt the age of 21, Diaz auditioned for The Mask playing the elegant jazz singer Tina Carlyle, based on the recommendation of an agent for Elite, who met the film's producers while they were searching for the lead actress. Having no previous acting experience, she started acting lessons after being cast. The Mask became one of the top ten highest-grossing films of 1994 and launched Diaz as a sex symbol. During this period, Diaz dated video producer Carlos de la Torre.Diaz subsequently starred in the independent black comedy The Last Supper (1995), playing one of several liberal graduate students who invite a group of extremist conservatives to a dinner to murder them. Roger Ebert deemed the film \"a brave effort in a timid time, a Swiftian attempt to slap us all in the face and get us to admit that our own freedoms depend precisely on those of our neighbors, our opponents and, yes, our enemies.\" She then had a lead role as an ex-stripper in the dramatic comedy Feeling Minnesota (1996), in which she co-starred opposite Keanu Reeves, Vincent D'Onofrio, and Courtney Love. Emanuel Levy of Variety noted: \"Sadly, with the notable exception of the attractive Diaz, who's well cast as the sexual aggressor and romantic manipulator, there are no exciting performances in the film.\" The same year, she was cast opposite Jennifer Aniston in the Edward Burns-directed comedy She's the One (1996), followed by a starring role in Head Above Water (1996), a crime-comedy in which she played an unfaithful wife implicated in her ex-lover's murder.She was scheduled to perform in the film Mortal Kombat, but had to resign after breaking her hand while training for the role. Besides a starring part in the little-seen A Life Less Ordinary, Diaz returned to mainstream in 1997 with the romantic comedy My Best Friend's Wedding. In it, she starred opposite Julia Roberts, playing the wealthy fiancée of a sportswriter who is the long-time friend of Roberts' character. The film was a global box-office hit and is considered as one of the best romantic comedy films of all time.In 1998, Diaz starred in There's Something About Mary, as the titular role of a woman living in Miami having several men vying for her affections. It was remarked in The Austin Chronicle: \"As the Mary at the center of it all, Diaz certainly exudes that irresistible \"something\" expressed in the title. In films such as My Best Friend's Wedding and A Life Less Ordinary, Diaz has shown herself to be a good comic sport who is game for just about anything. Here, it's no stretch to understand why, at the end of the movie, some half-dozen suitors have converged in her living room to throw themselves at her feet\". The sleeper hit was the highest-grossing comedy of 1998 in North America as well as the fourth-highest-grossing film of the year; it made US$176 million in the United States and US$369 million worldwide. She was nominated for a Golden Globe Award in the category of Best Actress – Musical or Comedy. Diaz also starred in the critically panned comedy Very Bad Things (1998).\nAfter appearing in There's Something About Mary, Diaz briefly dated her co-star Matt Dillon. The following year, she began a four-year relationship with actor Jared Leto, which ended in 2003.\n\n\n=== 1999–2004: Dramatic roles and critical success ===\n\nShe starred in Spike Jonze's directorial debut Being John Malkovich (1999), portraying the pet-obsessed wife of an unemployed puppeteer who, through a portal, finds himself in the mind of actor John Malkovich. The film received widespread acclaim and was an arthouse success. Janet Maslin of The New York Times concluded that Diaz \"does a hilarious turn\" in her \"frumpy wife\" role, and Roger Ebert felt that the actress, \"one of the best-looking women in movies, [...] here looks so dowdy we hardly recognize her [...] Diaz has fun with her talent by taking it incognito to strange places and making it work for a living\". For her role, Diaz earned Best Supporting Actress nominations at the Golden Globe, BAFTA, and SAG Awards. Her next film release in 1999 was Oliver Stone's sports drama Any Given Sunday, where she played a young team owner who a veteran coach (Al Pacino) has fallen out of favor with. While critical response was mixed, the film made US$100 million globally.In the film adaptation Charlie's Angels (2000), Diaz, Drew Barrymore and Lucy Liu played the trio of investigators in Los Angeles. The film was one of the highest-grossing films of the year, grossing US$264.1 million. In 2001, Diaz starred in the Sundance-premiered independent drama The Invisible Circus, as a young woman who commits suicide in Europe in the 1970s, and next in the year, she appeared in Vanilla Sky, as the former lover of a self-indulgent and vain publishing magnate (Tom Cruise). A wide critical response and commercial success greeted Vanilla Sky upon its release; Los Angeles Times called her \"compelling as the embodiment of crazed sensuality\" and The New York Times said she gives a \"ferociously emotional\" performance. San Francisco Chronicle similarly stated of the film, \"most impressive is Cameron Diaz, whose fatal-attraction stalker is both heartbreaking and terrifying.\" She earned nominations for Best Supporting Actress at the Golden Globe Awards, the SAG Awards, the Critics' Choice Awards, and the American Film Institute Awards for her performance in the film.\nAlso in 2001, she voiced Princess Fiona in the animated film Shrek. In the film, her character is plagued by a curse that transforms her into an ogress each and every sunset. Locked in a dragon-guarded castle for several years, she is rescued by the title character, whom she later comes to love. The film was a major commercial success, grossing US$484.4 million worldwide. In 2002, Diaz headlined the romantic comedy The Sweetest Thing, playing a single woman educating herself on wooing the opposite sex when she finally meets the man of her dreams. The film was a moderate commercial success with a global gross of US$68.6 million.\nAfter completing Shrek, Diaz starred in Martin Scorsese's epic period drama Gangs of New York, set in the mid-19th century in the Five Points district of New York City; she took on the role of a pickpocket-grifter and the love interest of Leonardo DiCaprio's character. Worldwide, the film grossed a total of US$193 million, while it was embraced by critics. A. O. Scott of The New York Times, agreeing with other top critics on co-star Daniel Day Lewis's presence overshadowing Diaz and DiCaprio, felt that the actress \"ends up with no outlet for her spitfire energies, since her character is more a structural necessity — the linchpin of male jealousy — than a fully imagined person. The limitations of her role point to a more serious lapse, which is the movie's lack of curiosity about what women's lives might have been like in Old New York\". Diaz next reprised her roles in the commercially successful sequels Charlie's Angels: Full Throttle (2003), and Shrek 2 (2004). Beginning in 2003, it was reported that Diaz began dating singer and actor Justin Timberlake.\n\n\n=== 2005–2011: Return to comedies ===\nDiaz received substantial defamation damages from suing American Media Incorporated, after the National Enquirer posted an article and pictures with the headline \"Cameron Caught Cheating\" on their website in May 2005. The photos claimed to show Diaz cheating on her boyfriend of the time, Timberlake, with the married MTV producer of her show Trippin', Shane Nickerson. After Diaz complained, the article and pictures were removed from the web and the hard copy did not contain any of the content. The magazine apologized to Diaz, Timberlake, Nickerson and his wife for the distress caused and said the story was untrue and the picture showed no more than a goodbye hug between friends.\nIn her following film, Diaz played opposite Toni Collette and Shirley MacLaine in In Her Shoes (2005), a comedy-drama film based on the novel of the same name by Jennifer Weiner, which focuses on the relationship between two sisters and their grandmother. The film received generally positive reviews from critics, and Diaz garnered acclaim for her performance of a dyslectic wild child engaged in a love-hate struggle with her plain, sensible sister (Collette), with USA Today calling it \"her best work\" at the time. She followed In Her Shoes with a role in Nancy Meyers' romantic comedy The Holiday (2006), also starring Kate Winslet, Jude Law and Jack Black. In it she played Amanda, an American movie trailer producer who arranges a home exchange with a British woman (Winslet). The film became one of the biggest commercial successes of the year, grossing more than $205 million worldwide.In January 2007, it was reported that Diaz and Timberlake had separated after four years together. Diaz's only film of 2007 was Shrek the Third, the third installment in the Shrek franchise. Although the film was met with mixed reviews from critics, it grossed $798 million worldwide. The same year, Diaz also voiced Princess Fiona in a thirty-minute Christmas special, directed by Gary Trousdale. Diaz earned an estimated $50 million during the period of a year ending June 2008, for her roles in the Shrek sequel and her next film What Happens in Vegas opposite Ashton Kutcher. A romantic comedy by Tom Vaughan, Diaz and Kutcher portrayed two strangers who awaken together to discover they have gotten married following a night in which they won a huge jackpot after playing the other's quarter. Critic reviews were negative but the film still grossed $219 million with a budget of $35 million.In 2009, she starred in My Sister's Keeper and The Box. Based on Jodi Picoult's novel of the same name, My Sister's Keeper was released to mixed reviews in June 2009. In the drama, Diaz plays a former lawyer and mother of three, one of whom is dying of leukemia. A moderate commercial success, it grossed $95 million worldwide, mostly from its domestic run. Set in 1976, The Box, written and directed by Richard Kelly, stars Diaz and James Marsden as a couple who receive a box from a mysterious man who offers them one million dollars if they press the button sealed within the dome on top of a box, knowing that someone, somewhere, will die from it. Critical response towards the psychological horror film was mixed, and, though having grossed its budget back, was considered a financial disappointment.\n\nIn 2010, Forbes ranked Diaz as the richest female celebrity, ranking her number 60 among the wealthiest 100. Also that year, Diaz reprised her voice role of Princess Fiona in Shrek Forever After, the fourth installment in the Shrek series. Although the film opened to mixed reviews from critics, it grossed a worldwide total of over $752 million and became the fifth top-grossing films released that year. Also in 2010, Diaz reunited with her Vanilla Sky co-star Tom Cruise in the action comedy film Knight and Day. In it, Diaz plays a classic car restorer who unwittingly gets caught up with the eccentric secret agent Roy Miller, played by Cruise, who is on the run from the Secret Service. Knight and Day received mixed reviews, and while the comedy performed poorly at the box office in its debut, it became a sleeper hit at the box office with a worldwide gross of US$262 million. Beginning in May 2010, Diaz began dating former New York Yankees player Alex Rodriguez. Their relationship ended in September 2011.In 2011, Diaz was cast as Lenore Case, a journalist, in the remake of the 1940s film The Green Hornet. Directed by Michel Gondry, Diaz starred alongside Seth Rogen, Jay Chou, and Christoph Waltz in the superhero action comedy film. Released to mixed to negative reviews from critics, who called it an \"overblown, interminable and unfunny update\", the film ended its theatrical run on April 21, 2011, with a worldwide gross total of $228 million. The same year, she played opposite Justin Timberlake and Jason Segel in Jake Kasdan's adult comedy Bad Teacher. In the film, Diaz plays an immoral, gold-digging Chicago-area middle school teacher at the fictional John Adams Middle School who curses at her students, drinks heavily, and smokes marijuana. Again, it received mostly negative reviews from critics who felt that \"in spite of a promising concept and a charmingly brazen performance from Diaz, Bad Teacher is never as funny as it should be.\" A commercial hit however, the R-rated comedy grossed US$216 million worldwide. Also in 2011, Diaz was listed among CEOWorld Magazine's Top Accomplished Women Entertainers.\n\n\n=== 2012–2016: Later roles and retirement from acting ===\nIn 2012, Diaz was cast in What to Expect When You're Expecting, directed by Kirk Jones and based on the pregnancy guide of the same name. Diaz, who filmed her scenes in a two-week period, portrays Jules Baxer, a contestant on a celebrity dance show and a host to a weight-loss fitness show, who becomes pregnant with her dance partner's baby. Upon release, the ensemble comedy received mostly negative reviews, but became a moderate commercial success with a worldwide gross of US$84.4 million. Diaz's other film that year was Gambit, a remake of the 1966 film of the same name directed by Michael Hoffman and scripted by Joel and Ethan Coen. The film received overwhelmingly negative reviews, and performed poorly at the box office, grossing only $10 million internationally. Diaz also voiced Sigmund Freud in A Liar's Autobiography (2012), a British animated comedy film that is a (deliberately) completely inaccurate portrayal of the life of Monty Python alumnus Graham Chapman.\n\nDiaz's only film project of 2013 was Ridley Scott's The Counselor, co-starring Michael Fassbender, Javier Bardem, Penélope Cruz and Brad Pitt. In the thriller about greed, death, the primal instincts of humans and their consequences, Diaz plays a pathological liar and a sociopath, an immigrant who is now living the high-life after escaping a sordid past as an exotic dancer. While the film's reception was negative, her performance was praised as one of her best in recent years.Diaz's first film of 2014 was the romantic revenge comedy The Other Woman opposite Nikolaj Coster-Waldau, Leslie Mann and Kate Upton. While The Other Woman received mostly negative reviews from critics, who felt that it settled for cheap laughs, it opened atop the US weekend box office with earnings of US$24.7 million across the three days; it eventually made US$83.9 million in North America and US$196.7 million globally.Her next film release in 2014 was the comedy Sex Tape, in which she starred with Jason Segel as a married couple waking up to discover that a sex tape they had made went missing, leading to a frantic search for its whereabouts. Although the negative-reviewed film \"flopped\" at the domestic box office, it ultimately became a moderate commercial success with a worldwide gross of US$126 million. The role required Diaz to perform multiple scenes of nudity. On her decision to appear nude, Diaz said: \"People have seen my butt. I've shown the top of my butt, the bottom of my butt. I'm not opposed to doing nudity, as long as it's part of the story. I'll do whatever has to get done if it's the right thing.\" Her last 2014 release was the film adaptation Annie, co-starring Quvenzhané Wallis, Jamie Foxx and Rose Byrne. She took on the role of Miss Colleen Hannigan, the cruel control freak of the foster home where the titular character resides. Upon its December premiere, Annie made US$133 million worldwide, with Diaz's performance garnering polarized reviews; critics praising her effort, but ultimately calling it too \"vampy\", as well as \"strident and obnoxious\". Peter Travers of Rolling Stone says that she \"overacts the role to the point of hysteria\". Diaz took a hiatus from film acting after the release of Annie, stating in July 2017 that she was tired of traveling for filming, and confirmed the following March she had retired from acting.In late 2013, she published a health book, The Body Book: Feed, Move, Understand and Love Your Amazing Body, co-written with Sandra Bark. It was no. 2 on The New York Times Best Seller list in March 2014. She then released The Longevity Book: The Science of Aging, the Biology of Strength, and the Privilege of Time in June 2016.", "Personal life": "Diaz's father died of liver cancer in 2008. She married musician Benji Madden at her home in Beverly Hills, California, on January 5, 2015 in a Jewish ceremony. It took place after an approximately three-month engagement she stated on broadcast host Andy Cohen's Sirius radio program \"Town Hall with Cameron Diaz\" in 2018, having been introduced seven months earlier by her close friend and now sister-in-law, Nicole Richie.\n\n\n=== Activism ===\nDiaz publicly endorsed Al Gore during the 2000 presidential election. Known for her environmental activism, she was an early adopter of the Toyota Prius hybrid and worked to promote Gore's Live Earth campaign, raising awareness of climate change. Diaz wore a T-shirt that read \"I won't vote for a son of a Bush!\" while making publicity visits for Charlie's Angels.Diaz has been involved with the Iraq and Afghanistan Veterans of America (IAVA), the first and largest non-profit organization for veterans of the wars in Iraq and Afghanistan, and has spoken as an advocate for military families.", "References": "", "External links": "Cameron Diaz on IMDb \nCameron Diaz at Box Office Mojo\nCameron Diaz at Rotten Tomatoes\nCameron Diaz at the TCM Movie Database"}