{"_id": "91", "name": "Martin Freeman", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:18", "biography": "Martin John Christopher Freeman (born 8 September 1971) is an English actor and comedian, known for portraying Bilbo Baggins in Peter Jackson's The Hobbit film trilogy (2012–2014), Tim Canterbury in the original UK version of sitcom mockumentary The Office (2001–2003), Dr. John Watson in the British crime drama Sherlock (2010–2017), and Lester Nygaard in the dark comedy-crime drama TV series Fargo (2014).\nHis other notable film roles include the romantic comedy Love Actually (2003), the comic science fiction film The Hitchhiker's Guide to the Galaxy (2005), the semi-improvised comedy Nativity! (2009), the comedic Three Flavours Cornetto trilogy (2004–2013), most prominently in the sci-fi comedy The World's End (2013), and his portrayal of Everett K. Ross in the Marvel films Captain America: Civil War (2016) and Black Panther (2018). Among other accolades, he has won an Emmy Award, a BAFTA Award, an Empire Award, and a Screen Actors Guild Award, with nominations including two other Emmy Awards, two other BAFTA Awards, a Saturn Award, and a Golden Globe Award.", "Early life": "Freeman was born in Aldershot, Hampshire, the youngest of five children. His parents, Philomena (née Norris) and Geoffrey Freeman, a naval officer, separated when Freeman was a child. When Freeman was 10 years old, his father died of a heart attack. Freeman attended the Salesian School, Chertsey before attending Brooklands College for media studies. His older brother Tim became a musician with the group Frazier Chorus.", "Career": "Freeman attended the Central School of Speech and Drama and has appeared in at least 18 TV shows, 14 theatre productions, and several radio productions. He is notable for his role as Tim Canterbury in The Office, a role which, he said in 2004, \"cast a very long shadow\" for him as an actor. He appeared in the sitcom Hardware. He also appeared in several films, including Ali G Indahouse (2002) and Love Actually (2003).He began to move into more serious dramatic roles on television with his appearance as Lord Shaftesbury in the 2003 BBC historical drama Charles II: The Power and The Passion. He can also be seen making a brief appearance in the first episode of the second series of This Life. Freeman also starred in the BBC television series The Robinsons and had a cameo in episode 1 of Black Books. In 2007, he appeared in The All Together written and directed by Gavin Claxton, as well as the Bill Kenwright theatre production of The Last Laugh. He is featured in the video for Faith No More's cover of \"I Started a Joke\". In May 2009, he starred in Boy Meets Girl, a four-part drama that charts the progress of characters Veronica and Danny after an accident which causes them to swap bodies.\n\nHe plays Dr. John Watson in Sherlock, the BBC contemporary adaptation of the Sherlock Holmes detective stories. The first episode of Sherlock, \"A Study in Pink\", was broadcast on 25 July 2010 to critical acclaim. For his performance in the role he won the BAFTA award for Best Supporting Actor, 2011 and the Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie.\nHe played Bilbo Baggins, the main character, in the three-part Peter Jackson film series The Hobbit. Accolades that his performance in the first part, The Hobbit: An Unexpected Journey, garnered him include Best Hero at the 2013 MTV Movie Awards and Best Actor at the 18th Empire Awards.\nFreeman appeared in all three of Simon Pegg and Edgar Wright's comedic Three Flavours Cornetto trilogy, commencing with a brief non-speaking role in Shaun of the Dead as Yvonne's boyfriend, Declan, followed by a brief cameo in Hot Fuzz as a police officer. He was a main cast member in the 2013 finale to the trilogy, The World's End. On 5 October 2013, he was presented with a fellowship bearing his name by the members of University College Dublin's Literary & Historical Society. In April 2014, Freeman began playing insurance salesman Lester Nygaard in the dark comedy-crime drama series Fargo. For his performance in this series, he was nominated for a Primetime Emmy Award, a Golden Globe Award, and a Critics' Choice Television Award. He opened in the title role in Shakespeare’s play Richard III in July 2014 at Trafalgar Studios.In 2015, Freeman starred as producer Milton Fruchtman in the television film The Eichmann Show, based on the filming, by blacklisted TV director Leo Hurwitz, of the 1961 trial of Nazi war criminal Adolf Eichmann. The film intercut dramatic scenes with historical footage from the trial. The Daily Telegraph described the film as \"absolutely enthralling\". He also played Everett Ross in Captain America: Civil War, which released in May 2016.In 2017, Freeman starred in Cargo, which premiered at the Adelaide Film Festival on 6 August 2017. The film is a feature-length remake of a 2013 short film of the same name. Later in the year he appeared opposite Tamsin Greig in Labour of Love, a political comedy by James Graham, at the Noël Coward Theatre. Labour of Love charts both the evolution of the UK Labour Party in recent decades, and its presence in a tight-knit Nottinghamshire community. Freeman portrays fictional Labour MP David Lyons, whose modernising ideas pit him against the traditional left-wing constituency agent Jean Whittaker (Greig).", "Personal life": "Freeman lived in Potters Bar in Hertfordshire with his partner, actress Amanda Abbington. The couple have two children together. They have appeared in other productions together, including Sherlock, Swinging with the Finkels, The Debt, The Robinsons, and The All Together. On 22 December 2016, Freeman announced in an article in the Financial Times that he and Abbington had separated.Freeman is a close friend of actor Simon Pegg, who is godfather to his son, Joe.In an edition of Who Do You Think You Are? aired on 19 August 2009, Freeman discovered that his grandfather, Leonard Freeman, was a medic who was killed a couple of days before the Dunkirk evacuation in May 1940 World War II. Leonard's father, Richard, born blind, was a piano tuner and organist at St Andrew's Church, West Tarring, and later a music teacher in Kingston upon Hull.Freeman is a vegetarian. He has said his Catholic faith remains intact. In 2011, Freeman umpired a charity cricket match to raise money for victims of the Christchurch earthquake.Freeman's personal style follows that of British mod subculture and he cites Paul Weller as one of his heroes and influences on his style. Freeman is a big fan of soul, motown and jazz music, presenting an episode of BBC Two's The Culture Show in 2009 entitled \"Martin Freeman Goes To Motown\". He has also selected music in the past for a motown compilation entitled Made To Measure and has recently worked on a jazz compilation with friend Eddie Piller entitled Jazz On The Corner, which was released on Acid Jazz Records on 23 March 2018, featuring tracks by musicians including Kamasi Washington and The Brand New Heavies. The pair presented Craig Charles' Funk and Soul Show on 31 March.  In 2019 a follow-up album to Jazz on the Corner was announced, entitled Soul on the Corner featuring tracks by artists including Leroy Hutson and Bobby Womack.In June 2018 Freeman was part of To Provide All People, a BBC Wales drama celebrating 70 years of the National Health Service.", "Political views": "Freeman is a supporter of the Labour Party. As a teenager, he supported Britain's now-defunct Militant political group and volunteered with the Labour Party Young Socialists.In 2015, Freeman appeared in a party political broadcast to endorse the Labour Party ahead of the 2015 UK general election. In August 2015, he was an outspoken supporter of Jeremy Corbyn's campaign in the Labour Party leadership election.", "Filmography": "=== Film ===\n\n\n=== Television ===", "Awards and nominations": "", "References": "", "External links": "Martin Freeman on IMDb \nMartin Freeman discography at Discogs"}