{"_id": "84", "name": "Jack Black", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:11", "biography": "Jack Black (born Thomas Jacob Black; August 28, 1969) is an American actor, comedian, musician, songwriter, and media personality. His acting career has been extensive, starring primarily in comedy films. Black is known for his roles in High Fidelity (2000), Shallow Hal (2001), School of Rock (2003), King Kong (2005), Tenacious D in the Pick of Destiny (2006), The Holiday (2006), the Kung Fu Panda franchise (2008–2016), Tropic Thunder (2008), Gulliver's Travels (2010), Bernie (2011), Goosebumps (2015), and Jumanji: Welcome to the Jungle (2017). For his work in School of Rock and Bernie, he gained Golden Globe nominations, and was inducted into Hollywood's Walk of Fame in 2018. Black is the lead vocalist of the Grammy Award-winning comedic rock duo Tenacious D which he formed in 1994 with friend Kyle Gass. They have released the albums Tenacious D, The Pick of Destiny, Rize of the Fenix, and Post-Apocalypto.", "Early life": "Thomas Jacob Black was born in Santa Monica, California, and raised in Hermosa Beach, California, the son of satellite engineers Thomas William Black and Judith Love Cohen, who worked on the Hubble Space Telescope and was also a writer. He has three older half-siblings through his mother; scientist Neil Siegel, Howard Siegel, and Rachel Siegel. His mother was born Jewish, while his father converted to Judaism. Black was raised Jewish, attending Hebrew school and having a bar mitzvah.Black's parents divorced when he was 10 (his father then stopped practicing Judaism); Black moved to Culver City with his father and frequently visited his mother's home. As a child, Black appeared in a commercial for the Activision game Pitfall! in 1982. \nFor high school, Black's parents enrolled him at the Poseidon School, a private secondary school designed specifically for students struggling in the traditional school system. Black also attended the Crossroads School, where he excelled in drama. He later attended UCLA but dropped out during his sophomore year to pursue a career in entertainment. Fellow UCLA student, Tim Robbins, later cast Black in Bob Roberts. In 1995 and 1996, Black gained recurring roles in the HBO sketch comedy series, Mr. Show.", "Career": "=== Early roles ===\nIn 1982, Black first acted in a television commercial at age 13 for the video game Pitfall!. In 1987, Black joined the Actors' Gang, a theater troupe founded by UCLA students including Tim Robbins, and he appeared in a variety of stage productions. Black's adult career began with small roles on prime time television, including Life Goes On, Northern Exposure, Mr. Show, Picket Fences, The Golden Palace, and The X-Files. Black appeared in the unaired TV pilot Heat Vision and Jack, directed by Ben Stiller, in which he played an ex-astronaut pursued by actor Ron Silver. He was accompanied by his friend who had merged with a motorcycle, voiced by Owen Wilson.After Robbins cast him in Bob Roberts, Black began appearing in small film roles such as Airborne (1993), Demolition Man, Waterworld, The Fan, The Cable Guy, Mars Attacks!, Dead Man Walking, The Jackal, Crossworlds, Enemy of the State, and others. He had a small role in True Romance as a security guard, but the scene was deleted.\n\n\n=== Leading roles ===\nIn 2000, Black co-starred in the film High Fidelity as a wild employee in John Cusack's character's record store, a role he considers his breakout. He soon gained leading roles in films such as Shallow Hal, Nacho Libre, Tenacious D in The Pick of Destiny, Year One, and Gulliver's Travels. He received particular praise for his starring role in the well-received School of Rock, earning critical acclaim and a Golden Globe nomination for Best Actor – Musical or Comedy.He starred in one of his few dramatic roles as the obsessed filmmaker Carl Denham in Peter Jackson's 2005 remake of King Kong, a performance he based on Orson Welles. He voiced the title role in Kung Fu Panda, which grossed US$20.3 million on its opening day, June 6, 2008, as well as Kung Fu Panda 2 and Kung Fu Panda 3; this is his favorite role and he praises the tutoring of co-star and two-time Academy Award winner Dustin Hoffman. His next film, The Big Year, a competitive birdwatching comedy co-starring Owen Wilson, Steve Martin, and JoBeth Williams, was released in October 2011.Jack garnered a second Golden Globe Award nomination, this time in the category Best Actor in a Comedy, for his 2011 starring role in Richard Linklater's black comedy, Bernie, as real-life murderer Bernie Tiede, a funeral director in a small East Texas town, who befriends and eventually murders a rich widow, played by Shirley MacLaine. Black's subdued portrayal, authentic East Texas accent, and musical talent – he sings several gospel hymns as well as \"Seventy-six Trombones\" – had Roger Ebert describing Black's work as \"one of the performances of the year.\"\n\n\n=== Later television roles ===\nIn 2004, Black guest-starred in the first episode of Cartoon Network's Adult Swim show Tom Goes to the Mayor. He appeared in the post-Super Bowl episode of The Office along with Cloris Leachman and Jessica Alba in a fake movie within the show. In 2010, Black made a guest appearance on Community and also guest-starred on Nickelodeon's TV show iCarly in an episode titled, \"iStart a Fan War\".Black has appeared numerous times on the \"untelevised TV network\" short film festival Channel 101, created by Dan Harmon and Rob Schrab, starring in the shows Computerman, Timebelt, and Laserfart. He also provided an introduction for the unaired sketch comedy Awesometown, donning a Colonial-era military uniform. In the introduction, he claims to be George Washington and takes credit for the accomplishments of other American Presidents such as Thomas Jefferson and Abraham Lincoln.\n\n\n=== Hosting work and appearances ===\nBlack took part in the Who Wants to Be a Millionaire? celebrity edition along with Denis Leary, Jimmy Kimmel, and others and was handed the prize of US$125,000 in October 2001. On December 14, he hosted the 2008 Spike Video Game Awards. Black has hosted the Nickelodeon Kids' Choice Awards and Acceptable.TV. He presented the tribute to rock legends Led Zeppelin when the band were named as 2012 recipients of Kennedy Center Honors. In 2016, Black joined the climate change documentary show Years of Living Dangerously as one of its celebrity correspondents. In 2018, Black appeared in the music video for Gorillaz song \"Humility\".\n\n\n=== Voice acting ===\n\nIn addition to Kung Fu Panda, Black has voice acted on other occasions, including \"Husbands and Knives\" from The Simpsons which aired November 18, 2007, portraying Milo, the friendly owner of the rival comic book store. He provided the voice of the main character, roadie Eddie Riggs, in the heavy metal-themed action-adventure video game Brütal Legend. In 2009, at the Spike Video Game Awards, he earned the Best Voice award for the voice of Eddie Riggs in Brütal Legend. In April 2009, Black starred in an episode of Yo Gabba Gabba!, in which he vocalized children songs, such as \"It's Not Fun to Get Lost\", \"Friends\", and \"The Goodbye Song\".Black voiced Darth Vader in Bad Lip Reading's parodies of the Star Wars original trilogy on YouTube. In 2015, Black played a fictional version of real-life author R. L. Stine for Goosebumps, and provided the voices of two of Stine's creations, Slappy the Dummy and The Invisible Boy. He reprised the Stine role in the film's 2018 sequel, Goosebumps 2: Haunted Halloween.\n\n\n=== Music career ===\n\nBlack is the lead singer and guitarist for the comedy rock/hard rock band Tenacious D. Along with Kyle Gass, they have released four albums, a self-titled debut, The Pick of Destiny, Rize of the Fenix, and Post-Apocalypto. One of their songs from their album The Pick of Destiny, titled \"The Metal\", was used in the music video games Guitar Hero III: Legends of Rock and Brütal Legend. \"Rock Your Socks\" from the album Tenacious D was played in the music video game Rock Band Unplugged as well, and \"Master Exploder\" from The Pick Of Destiny went on to be used in music video games Guitar Hero Van Halen, Rock Band 2, and Brütal Legend along with their song \"Tribute\" from Tenacious D. \"Master Exploder\" and \"The Metal\" featured in the comedy film Tenacious D in The Pick of Destiny. The film, directed by Tenacious D veteran Liam Lynch, featured recurring characters from Black's comedy such as Lee the super-fan and the Sasquatch. Several celebrities had roles in the film; actor Tim Robbins cameos as does Dave Grohl as Satan. Ben Stiller also makes an appearance as a worker at a Guitar Center, also having a role in the music video for \"Tribute\".\nTenacious D helped the United Mitochondrial Disease Foundation to raise awareness of these diseases and funds for the organization in Los Angeles on December 20, 2001, and in San Diego, California on June 16, 2007. Tenacious D can be seen performing in the 90s-era Pauly Shore film Bio-Dome where the duo is performing its song \"The Five Needs\" at a \"Save the Environment\" party. Black was also a guest star on an episode of The Ellen DeGeneres Show entitled \"Ellen the Musical\", alongside Broadway star Kristin Chenoweth and teenage singer-actress Olivia Olson. On the show, besides singing, he discussed his then-upcoming film Nacho Libre with the host.\nIn 2000, Jack Black (along with Kyle Gass) provided backing vocals to punk rock band The Vandals' song \"Fourteen\", which appears on their album Look What I Almost Stepped In.... Black has also appeared on Dave Grohl's Probot album, providing vocals for the hidden song \"I Am The Warlock\", and Lynch's Fake Songs album, providing vocals for the song \"Rock and Roll Whore\". Black performed a cover of Marvin Gaye's \"Let's Get It On\" in the last sequence of High Fidelity. He lent his musical abilities to the Queens of the Stone Age song \"Burn the Witch\" with rhythmic stomps and claps, some performed with his eyes closed. He also provided vocals for two tracks on the 2006 album Death by Sexy by Eagles of Death Metal and on The Lonely Island's track \"Sax Man\" from the album Incredibad.\nBlack also recorded a duet on Meat Loaf's album Hang Cool Teddy Bear, on the song \"Like a Rose\". Meat Loaf also played Black's father in the Pick of Destiny movie.\n\nBlack has appeared in music videos of Beck's \"Sexx Laws\"; Foo Fighters' \"Learn To Fly\", \"Low\", and \"The One\"; The Eagles of Death Metal's \"I Want You So Hard (Boy's Bad News)\"; Sum 41's \"Things I Want\"; Dio's \"Push\"; Weezer's \"Photograph\"; The Mooney Suzuki's \"In a Young Man's Mind\"; and \"Weird Al\" Yankovic's \"Tacky\". In October 2010, Tenacious D appeared at BlizzCon 2010, a convention hosted by the game designers, Blizzard Entertainment. In 2012, Jack Black joined up with other celebrities to record \"Book People Unite\", a song sponsored by the Library of Congress, and RIF.\nBlack did guest vocals and appears on the Dethklok soundtrack album The Doomstar Requiem. He sings the parts for Dethklok's original band manager as well as a blogger.\nBlack, as a member of Tenacious D, won the award for Best Metal Performance at the 57th Grammy Awards. The award was won for the song \"The Last in Line\", a cover of the song of the same name by Dio that appeared on the tribute album This Is Your Life.\n\n\n=== YouTube channel ===\nOn December 21, 2018, Black created a YouTube channel, Jablinski Games, which currently has more than four million subscribers and 51 million views. On July 21, 2019, Black took part in a Minecraft stream with popular YouTuber PewDiePie in order to raise money for the National Alliance on Mental Illness (NAMI), in the wake of the suicide of Etika in June 2019. After two days of streaming they raised $30,479 with the stream being broadcast live both on YouTube and on the streaming platform DLive. \n\n\n=== Awards and nominations ===\nBlack was nominated for two Golden Globes. On September 18, 2018, Black was inducted into Hollywood's Walk of Fame.", "Personal life": "As a boy, Black was a Cub Scout.\nAt the age of 14, he struggled with cocaine addiction, saying, \"I was having a lot of troubles with cocaine ... I was hanging out with some pretty rough characters. I was scared to go to school because one of them wanted to kill me. I wanted to get out of there.\"Black's 31-year-old brother, Howard, died of AIDS in 1989.In January 2006, Black became engaged to Tanya Haden, daughter of jazz bassist Charlie Haden. Both attended Crossroads School and, after graduation, met again 15 years later at a friend's birthday party. They married on March 14, 2006, in Big Sur, California. Black's first son, Samuel Jason, was born on June 10, 2006, at Cedars-Sinai Medical Center in Los Angeles. On May 23, 2008, Black and his wife had their second son, Thomas David. Although an atheist, Black identifies as a nominal Jew and fatherhood influenced his decision to raise his children in the Jewish faith.Black endorsed Barack Obama's re-election campaign in 2012. In 2015, Black visited Kampala in Uganda, Africa as part of Comic Relief USA's Red Nose Day.Black is an outspoken critic of President Donald Trump. On the day of Trump's inauguration, he and Tenacious D bandmate Kyle Gass performed the protest song \"The Government Totally Sucks\". Black said to the audience beforehand, \"We haven't played [this song] for years, because it just never felt appropriate - But now, we're happy to unleash the beast. The government totally sucks.\"", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===", "References": "", "External links": "Jack Black at AllMusic\nJack Black discography at Discogs\nJack Black on IMDb \nJack Black at AllMovie\nJack Black at Rotten Tomatoes"}