{"_id": "34", "name": "Hugh Jackman", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:37", "biography": "Hugh Michael Jackman  (born 12 October 1968) is an Australian actor, singer, and producer. He is best known for playing Wolverine in the X-Men film series from 2000 to 2018, a role for which he holds the Guinness World Record for \"longest career as a live-action Marvel superhero\". Jackman is also recognised for his lead roles in films such as the romantic comedy Kate & Leopold (2001), the action film Van Helsing (2004), the drama The Prestige (2006), the fantasy drama The Fountain (2006), the period romance Australia (2008), the film version of Les Misérables (2012), the thriller Prisoners (2013), and the musical The Greatest Showman (2017), for which he received a Grammy Award for Best Soundtrack Album. For playing Jean Valjean in Les Misérables, he was nominated for the Academy Award for Best Actor and won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy.\nIn Broadway theatre, Jackman won the 2004 Tony Award for Best Actor in a Musical for his role in The Boy from Oz. A four-time host of the Tony Awards, he won an Emmy Award for hosting the 2005 ceremony. He also hosted the 81st Academy Awards in 2009. Jackman was appointed a Companion of the Order of Australia in the 2019 Queen's Birthday Honours for services to performing arts and to the global community.", "Early life": "Jackman was born in Sydney, New South Wales, to Grace McNeil (née Greenwood) and Christopher John Jackman, a Cambridge-educated accountant. His parents were English and had come to Australia in 1967 as part of the \"Ten Pound Poms\" immigration. Thus, in addition to his Australian citizenship, Jackman holds British citizenship by virtue of being born to UK-born parents. One of his paternal great-grandfathers, Nicholas Isidor Bellas, was Greek, from the Ottoman Empire (now in Greece). His parents were devout Christians, having been converted by Evangelist Billy Graham after their marriage. Jackman has four older siblings and was the second of his parents' children to be born in Australia. He also has a younger half-sister, from his mother's remarriage. His parents divorced when he was eight, and Jackman remained in Australia with his father and two brothers, while his mother moved back to England with Jackman's two sisters. As a child, Jackman liked the outdoors, spending a lot of time at the beach and on camping trips and school holidays all over Australia. He wanted to see the world saying, \"I used to spend nights looking at atlases. I decided I wanted to be a chef on a plane. Because I'd been on a plane and there was food on board, I presumed there was a chef. I thought that would be an ideal job.\"Jackman went to primary school at Pymble Public School and later attended the all-boys Knox Grammar School on Sydney's Upper North Shore, where he starred in its production of My Fair Lady in 1985 and became the school captain in 1986. Following graduation, he spent a gap year working at Uppingham School in England as a Physical Education teacher. On his return, he studied at the University of Technology, Sydney, graduating in 1991 with a BA in Communications. In his final year of university, he took a drama course to make up additional credits. The class did Václav Havel's The Memorandum with Jackman as the lead. He later commented, \"In that week I felt more at home with those people than I did in the entire three years [at university]\".After obtaining his BA, Jackman completed the one-year course \"The Journey\" at the Actors' Centre in Sydney. About studying acting full-time, he stated, \"It wasn't until I was 22 that I ever thought about my hobby being something I could make a living out of. As a boy, I'd always had an interest in theatre. But the idea at my school was that drama and music were to round out the man. It wasn't what one did for a living. I got over that. I found the courage to stand up and say, 'I want to do it'.\" After completing \"The Journey\", he was offered a role on the popular soap opera Neighbours but turned it down to attend the Western Australian Academy of Performing Arts of Edith Cowan University in Perth, Western Australia, from which he graduated in 1994.Jackman has said he \"always loved acting but when I started at drama school I was like the dunce of the class. It just wasn't coming right to me. Everyone was cooler, everyone seemed more likely to succeed, everyone seemed more natural at it and in retrospect, I think that is good. I think it is good to come from behind as an actor. I think it is good to go into an audition thinking, 'Man I've got to be at my best to get this gig.'\" He has cited actor Gary Oldman as an inspiration, personally thanking him on a 2017 edition of The Graham Norton Show.", "Career": "=== 1995–1999: Early career in theatre ===\nOn the night of his final Academy graduation performance, Jackman received a phone call offering him a role on Correlli: \"I was technically unemployed for thirteen seconds.\" Correlli, devised by Australian actress Denise Roberts, was a 10-part drama series on ABC, Jackman's first major professional job, and where he met his future wife Deborra-Lee Furness. \"Meeting my wife was the greatest thing to come out of it,\" he said, as the show lasted only one season. After Correlli Jackman went on the stage in Melbourne. In 1996, Jackman played Gaston in the local Walt Disney production of Beauty and the Beast, and Joe Gillis in Sunset Boulevard. During his stage musical career in Melbourne, he starred in the 1998 Midsumma festival cabaret production Summa Cabaret. He also hosted Melbourne's Carols by Candlelight and Sydney's Carols in the Domain. Jackman's early film works include Erskineville Kings and Paperback Hero (1999), and his television work includes Law of the Land, Halifax f.p., Blue Heelers, and Banjo Paterson's The Man from Snowy River.\nJackman became known outside Australia in 1998, when he played the leading role of Curly in the Royal National Theatre's acclaimed stage production of Oklahoma!, in London's West End. The performance earned him an Olivier Award nomination for Best Actor in a Musical. Jackman said, \"I totally felt like it can't get any better than this. On some level that production will be one of the highlights of my career.\" He also starred in the 1999 film version of the same stage musical, which has been screened in many countries.\n\n\n=== 2000–2004: Breakthrough with X-Men ===\nJackman had his breakthrough role playing Wolverine in Bryan Singer's X-Men (2000)—a superhero film based on the Marvel Comics team of the same name. Co-starring Patrick Stewart, James Marsden, Famke Janssen and Ian McKellen, the film tells the story of a group of mutants, whose superhuman powers make them distrusted by normal humans. The role was originally written for Russell Crowe who instead suggested Jackman for the part. Jackman says that his wife advised him against taking on the role, as she found it \"ridiculous\". He initially studied wolves to develop his character, as he thought that Wolverine alluded to wolves. X-Men was successful at the box-office, earning US$296 million. The role earned him a Saturn Award for Best Actor.Wolverine was tough for Jackman to portray because he had few lines, but a lot of emotion to convey in them. To prepare, he watched Clint Eastwood in the Dirty Harry movies and Mel Gibson in Mad Max 2. \"There were guys who had relatively little dialogue, like Wolverine had, but you knew and felt everything. I'm not normally one to copy, but I wanted to see how these guys achieved it.\" Jackman was adamant about doing his own stunts for the movie. \"We worked a lot on the movement style of Wolverine, and I studied some martial arts. I watched a lot of Mike Tyson fights, especially his early fights. There's something about his style, the animal rage, that seemed right for Wolverine. I kept saying to the writers, 'Don't give me long, choreographed fights for the sake of it. Don't make the fights pretty.\" Jackman also had to get used to wearing Wolverine's claws. He said, \"Every day in my living room, I'd just walk around with those claws, to get used to them. I've got scars on one leg, punctures straight through the cheek, on my forehead. I'm a bit clumsy. I'm lucky I didn't tell them that when I auditioned.\"\n\nJackman, at 1.9 m (6 ft 3 in) stands 30 cm taller than Wolverine, who is said in the original comic book to be 5 feet 3 inches (1.60 m). Hence, the filmmakers were frequently forced to shoot Jackman at unusual angles or only from the waist up to make him appear shorter than he actually is, and his co-stars wore platform soles. Jackman was also required to add a great deal of muscle for the role, and in preparing for the fourth film in the series, he bench-pressed over 136 kg (300 lb).Jackman reprised his role in 2003's X2, 2006's X-Men: The Last Stand, and the 2009 prequel X-Men Origins: Wolverine, where Troye Sivan played the younger version of James Howlett. He also cameoed as Wolverine in 2011's X-Men: First Class. He returned for the role of Wolverine again in 2013's The Wolverine, a stand-alone sequel taking place after the events of X-Men: The Last Stand, and reprised the character in the 2014 sequel X-Men: Days of Future Past and briefly in the 2016 follow-up X-Men: Apocalypse. In 2015, Jackman announced that the 2017 sequel to The Wolverine, Logan, was the final time that he would play the role. It earned him the Guinness World Record of 'longest career as a live-action Marvel superhero'.Jackman starred as Leopold in the 2001 romantic comedy film Kate & Leopold, a role for which he received a Best Actor Golden Globe nomination. Jackman plays a Victorian English duke who accidentally time-travels to 21st-century Manhattan, where he meets Kate (Meg Ryan), a cynical advertising executive. In 2001, Jackman also starred in the action/drama Swordfish with John Travolta and Halle Berry. This was the second time Jackman worked with Berry, and the two have worked together thrice more in the X-Men movies. He hosted an episode of Saturday Night Live in 2001.\nIn 2002, Jackman sang the role of Billy Bigelow in the musical Carousel in a special concert performance at Carnegie Hall with the Orchestra of St. Luke's. In 2004, Jackman won the Tony Award and the Drama Desk Award for Outstanding Actor in a Musical for his 2003–2004 Broadway portrayal of Australian songwriter and performer Peter Allen in the hit musical The Boy from Oz, which he also performed in Australia in 2006. In addition, Jackman hosted the Tony Awards in 2003, 2004, and 2005, garnering positive reviews. His hosting of the 2004 Tony Awards earned him an Emmy Award for Outstanding Individual Performer in a Variety, Musical or Comedy program.\nAfter 2003's X2, Jackman played the title role of monster killer Gabriel Van Helsing in the 2004 film Van Helsing. Jackman and the film were noted in Bruce A. McClelland's book Slayers and Their Vampires: A Cultural History of Killing the Dead.\n\n\n=== 2005–2007: Success and more major roles ===\n\nJackman was asked to consider taking on the role as James Bond before Daniel Craig was chosen to play the character, but turned it down due to other commitments. Speaking to the British Press Association in 2011, Jackman said: 'I was about to shoot X-Men 2 and Wolverine had become this thing in my life and I didn't want to be doing two such iconic characters at once.'Alongside Christian Bale, Michael Caine, and Scarlett Johansson, Jackman starred in The Prestige (2006), a mystery thriller from Christopher Nolan. Jackman portrayed Robert Angier, an aristocratic magician who builds up a rivalry with contemporary Alfred Borden (Bale) in attempt to one-up each other in the art of deception. After reading the script, Jackman expressed interest in starring in the film, and Nolan believed that the actor had the qualities of the character. Jackman based his portrayal of Angier on 1950s-era American magician Channing Pollock. The Prestige was acclaimed and a box-office success.Jackman portrayed three different characters in Darren Aronofsky's science-fiction film The Fountain: Tommy Creo, a neuroscientist, who is torn between his wife, Izzi (Rachel Weisz), who is dying of a brain tumor, and his work at trying to cure her; Captain Tomas Creo, a Spanish conquistador in 1532 Seville; and a future astronaut, Tom, travelling to a golden nebula in an eco-spacecraft seeking to be reunited with Izzi. Jackman said The Fountain was his most difficult film thus far due to the physical and emotional demands of the part.\nJackman also starred in Woody Allen's 2006 film Scoop opposite Scarlett Johansson. That year he also reprised the role of Wolverine in X-Men: The Last Stand. He rounded out 2006 with two animated films: Happy Feet, directed by George Miller, in which he voiced the part of Memphis, an emperor penguin; and Flushed Away, where Jackman supplied the voice of a rat named Roddy who ends up being flushed down a family's toilet into the London sewer system. Flushed Away co-starred Kate Winslet and Ian McKellen (Jackman's fourth time working with him).\nIn 2007, Jackman produced and guest-starred in the television musical-dramedy series Viva Laughlin, which was cancelled by CBS after two episodes.\n\n\n=== 2008–2011: Return to musical performance alongside acting ===\n\nIn 2008, director Baz Luhrmann cast Jackman to replace Russell Crowe as the male lead in his much-publicized epic film, Australia, which co-starred Nicole Kidman. The movie was released in late November 2008 in Australia and the U.S. Jackman played a tough, independent cattle drover, who reluctantly helps an English noblewoman in her quest to save both her philandering husband's Australian cattle station and the mixed race Aboriginal child she finds there. Of the movie, Jackman said, \"This is pretty much one of those roles that had me pinching myself all the way through the shoot. I got to shoot a big-budget, shamelessly old-fashioned romantic epic set against one of the most turbulent times in my native country's history, while, at the same time, celebrating that country's natural beauty, its people, its cultures... I'll die a happy man knowing I've got this film on my CV.\" That year, People Magazine named Jackman its 2008 \"Sexiest Man Alive.Jackman co-starred with Daniel Craig on Broadway at the Schoenfeld Theatre in a limited engagement of the play A Steady Rain, which ran from 10 September 2009, to 6 December 2009.Jackman has reprised his role as the Wolverine in X-Men spin-off films. Jackman starred in X-Men Origins: Wolverine which opened in 2009 and later starred in 2013's The Wolverine. Jackman made a cameo appearance as Wolverine in X-Men: First Class in 2011. Jackman had a one-man show at the Curran Theatre in San Francisco from 3–15 May 2011. The production was a mixture of his favourite Broadway and Hollywood musical numbers, backed by a 17-piece orchestra, from shows including Oklahoma and The Boy from Oz. The show had a run-time of approximately 100 minutes, and also included slide shows of Jackman's youth, family, and work, as well as some one-on-one interaction with the audience. Jackman was backed by fellow musical theatre veterans Merle Dandridge and Angel Reda. He later returned to Broadway in a new show, Hugh Jackman: Back on Broadway at the Broadhurst Theatre, which began performances on 25 October 2011 and concluded on 1 January 2012.\n\n\n=== 2012–2018: More success with major grossing films ===\n\nIn a November 2012 release, Jackman voiced the role of E.Aster Bunnymund (the Easter Bunny) in the animated film Rise of the Guardians. Jackman starred as Jean Valjean in the film Les Misérables, an adaptation of the musical. The film opened on 25 December 2012. For the role, he lost 15 pounds and later had to regain 30 pounds to mirror his character's newfound success. He won the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy in January 2013 for this performance and received his first Academy Award nomination for Best Actor. Jackman appeared alongside Kate Winslet in Movie 43, an ensemble comedy, in January 2013. Jackman (along with actress Kristen Wiig) was featured on \"You've Got the Look\", a song by comedy hip hop group The Lonely Island on their third album, The Wack Album, released in June 2013. Jackman returned to Broadway in the new play, The River, which ran at the Circle in the Square Theatre from October 2014 to February 2015.\n\nIn November and December 2015, Jackman made a national tour of Australia with his show Broadway to Oz. He performed a range of songs from Broadway musicals, from Les Misérables to a Peter Allen tribute (including classics such as \"I Still Call Australia Home\"), with his 150-piece orchestra, choir, and backup dancers. The show began at Melbourne's Rod Laver Arena and proceeded to Qantas Credit Union Arena, Brisbane Entertainment Centre, the Adelaide Entertainment Centre, and the Perth Arena. \nJackman then portrayed the villain Blackbeard in the film Pan, which revolved around the backstories of J.M. Barrie's characters Peter Pan and Captain Hook. The movie received generally negative reviews and was a failure at the box office. In 2016, Jackman played fictional ski coach, Bronson Peary, in Eddie the Eagle, which portrayed how Eddie \"The Eagle\" Edwards became the first competitor to represent Great Britain in Olympic ski jumping in 1988.Jackman had an uncredited cameo as Wolverine in the 2016 film X-Men: Apocalypse. In 2017, he reprised the character for the final time in the third Wolverine film, Logan. Jackman's performance and the film were critically acclaimed and it is regarded as one of the greatest superhero films of all-time. For his 17-year spanning long performance as Wolverine, Jackman topped The Hollywood Reporter's Greatest Superhero Movie Performances of All Time list. That year, he also starred as P. T. Barnum in the musical The Greatest Showman. He received a Golden Globe Award for Best Actor – Motion Picture Musical or Comedy nomination for the film, his third Golden Globe nomination, and also received a Grammy Award for Best Soundtrack Album.In 2018, he starred as American senator, Gary Hart, in Jason Reitman's political drama film, The Front Runner, which chronicled the rise of Hart, a Democratic presidential candidate in 1988, and his subsequent fall from grace when media reports surfaced of his extramarital affair. In 2019, he voiced the character, Sir Lionel Frost, in the animated film, Missing Link. \nHe will return to Broadway in a revival of The Music Man, playing Harold Hill, which is set to begin previews in September 2020 and open in October 2020. He will also star in the comedy drama, Bad Education.\n\n\n=== 2019–present: Concert tour ===\n\nIn 2019 Jackman went on his first world tour called, The Man. The Music. The Show., to perform songs from the album, The Greatest Showman: Original Motion Picture Soundtrack, and Broadway/Hollywood musical numbers. Comprising 88 shows, the tour visits North America, Europe, and Oceania. It began on May 7, 2019, in Glasgow, Scotland and concludes on October 15, 2019, in San Antonio, United States.\nIn the 2019 Queen's Birthday Honours, Jackman was appointed a Companion of the Order of Australia, for \"eminent service to the performing arts as an acclaimed actor and performer, and to the global community, particularly as an advocate for poverty eradication.\"", "Production company": "In 2005, Jackman joined with longtime assistant John Palermo to form a production company, Seed Productions, whose first project was Viva Laughlin in 2007. Jackman's wife Deborra-Lee Furness is also involved in the company, and Palermo had three rings made with a \"unity\" inscription for himself, Furness, and Jackman. Jackman said, \"I'm very lucky in the partners I work with in my life, Deb and John Palermo. It really works. We all have different strengths. I love it. It's very exciting.\"", "Personal life": "Jackman married Deborra-Lee Furness on 11 April 1996, at St. John's in Toorak, Victoria, a suburb of Melbourne. They met on the set of Australian TV show Correlli. Jackman personally designed an engagement ring for Furness, and their wedding rings bore the Sanskrit inscription \"Om paramar mainamar\", translated as \"we dedicate our union to a greater source\". Furness had two miscarriages, following which she and Jackman adopted two children, Oscar and Ava.Jackman has described himself as a Christian and a \"religious person\". He meditates daily and follows the spiritually eclectic School of Practical Philosophy.In November 2013, Jackman announced he had basal-cell carcinoma removed from his nose. He had a second carcinoma removed from his nose in May 2014, telling Associated Press that he expects to have future recurrences. This resulted in Jackman attending the various worldwide premieres of X-Men: Days of Future Past with a bandage on his nose, and urging his followers on Instagram to \"wear sunscreen\".On 18 March 2015, Jackman revealed that he had to cancel stage performances in Turkey because he had a left vocal cord hemorrhage.\n\n\n=== Philanthropy ===\nAs a philanthropist, Jackman is a longtime proponent of microcredit – the extension of very small loans to prospective entrepreneurs in impoverished countries. He is a vocal supporter of Muhammad Yunus, microcredit pioneer and the 2006 Nobel Peace Prize winner. Jackman also uses his Twitter account for charity. On 14 April 2009, Jackman posted on his Twitter page that he would donate $100,000 to one individual's favourite non-profit organisation. On 21 April 2009, he revealed his decision to donate $50,000 to Charity:Water and $50,000 to Operation of Hope.Jackman is a global advisor of the Global Poverty Project, for which he narrated a documentary; and he and the project's founder Hugh Evans visited the UN for the cause in 2009. Jackman hosted a preview of the Global Poverty Project Presentation in New York together with Donna Karan, Lisa Fox, and his wife Deborra-Lee Furness. Jackman supports The Art of Elysium and the MPTV Fund Foundation, and he and Furness are patrons of the Bone Marrow Institute in Australia.Jackman and fellow actor Daniel Craig made a unique place for themselves in the history of Broadway Cares/Equity Fights AIDS fundraising 8 December 2009, when it was announced that they had raised $1,549,953 in the 21st annual Gypsy of the Year competition, from six weeks of curtain appeals at their hit Broadway drama, A Steady Rain. Jackman continued his support of Broadway Cares in 2011, raising nearly $1 million during his run of Hugh Jackman: Back on Broadway.Jackman also narrated the 2008 documentary about global warming, The Burning Season. He is also a World Vision ambassador and participated in the climate week NYC ceremony on 21 September 2009.Jackman launched the Laughing Man Coffee company in 2011. He founded two cafés in Lower Manhattan, and also sold the coffee online, before it also became a brand for Keurig. Jackman founded the company after a trip to Ethiopia in 2009 for World Vision, where he met a fair trade coffee farmer named Dukale. All profits from Laughing Man Coffee go to the Laughing Man Foundation, which supports educational programs, community development, and social entrepreneurs around the world.\n\n\n=== Other interests ===\nJackman has shown keen interest in sport. In high school, he played rugby union and cricket, took part in high jumping and was on the swimming team. He enjoys basketball and kayaking. He has expressed an interest in football, committing his support to Norwich City F.C. In the United States, Jackman supports the Philadelphia Union of Major League Soccer, attending a match at PPL Park in June 2010.Jackman supports the Port Adelaide Football Club in the Australian Football League and once gave the team a pep talk prior to a Showdown clash. He is also a long-time fan and supporter of the Manly-Warringah Sea Eagles, a National Rugby League (NRL) club based in Sydney's north. He sang the Australian national anthem at the 1999 NRL Grand Final.Jackman also guest starred on 19 September 2011 edition of WWE Monday Night Raw, assisting Zack Ryder in a win over WWE United States Champion Dolph Ziggler by punching the champion in the jaw whilst the referee was not looking.Jackman is a multi-instrumentalist. He plays the guitar, piano and violin. He also does yoga and has been a member of the School of Practical Philosophy since 1992.Jackman has been an avid practitioner of Transcendental Meditation since the age of twenty. He said \"Nothing has ever opened my eyes like Transcendental Meditation has. It makes me calm and happy, and, well, it gives me some peace and quiet in what's a pretty chaotic life!\". He now helps the David Lynch Foundation to \"bring meditation to everyone from PTSD sufferers to inner-city kids\".Jackman has been the face of several high-profile brands. He is a global ambassador for Montblanc. He is also the brand ambassador of R. M. Williams since March 2019.", "Work and accolades": "", "References": "", "External links": "Hugh Jackman on IMDb \nHugh Jackman at the Internet Broadway Database \nHugh Jackman Australian theatre credits at AusStage"}