{"_id": "15", "name": "Vin Diesel", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:30", "biography": "Mark Sinclair (born July 18, 1967), better known by his stage name Vin Diesel, is an American actor, producer, director, and screenwriter. After featuring in the war film Saving Private Ryan (1998), he rose to international fame with his role as Dominic Toretto in The Fast and the Furious franchise. \nDiesel began his career in 1990, but initially struggled to gain roles until he wrote and produced the short film Multi-Facial (1995), which attracted the attention of director Steven Spielberg, who was developing Saving Private Ryan. Spielberg re-wrote elements of the film to allow Diesel to feature, which helped kickstart his career. He subsequently voiced the title character in The Iron Giant (1999), and gained a reputation as an action star after starring in The Fast and the Furious, The Chronicles of Riddick, and in the XXX series.\nLater in his career, Diesel also gained notoriety for lending his voice to the character of Groot in Guardians of the Galaxy, as well as in the Marvel Cinematic Universe, and for the animated film Ralph Breaks the Internet (2018). He also founded the production company One Race Films, which has produced a number of his star vehicles. Away from action films, Diesel has enjoyed commercial success in a number of other genres, such as in the comedy film The Pacifier (2005), while his performance in Find Me Guilty (2006) was praised.\nHe is attached to portray the comic book character Bloodshot in its film adaptation, and is slated to appear in the Avatar sequels.", "Early life": "Diesel was born Mark Sinclair in Alameda County, California, with his fraternal twin brother, Paul. His mother, Delora Sherleen (Sinclair) Vincent, is an astrologer. Diesel has stated that he is \"of ambiguous ethnicity\". His mother's background includes English, German, and Scottish. He has never met his biological father, and has stated that \"all I know from my mother is that I have connections to many different cultures\". Diesel has self-identified as \"definitely a person of color\", and has stated that his parents' relationship would have been illegal in parts of the United States due to anti-miscegenation laws. He was raised in New York City by his Caucasian mother and African-American stepfather, Irving H. Vincent, an acting instructor and theater manager.Diesel made his stage debut at age seven when he appeared in the children's play Dinosaur Door, written by Barbara Garson. The play was produced at Theater for the New City in New York's Greenwich Village. His involvement in the play came about when he, his brother and some friends had broken into the Theater for the New City space on Jane Street with the intent to vandalize it. They were confronted by the theater's artistic director, Crystal Field, who offered them roles in the upcoming show instead of calling the police. Diesel remained involved with the theater throughout adolescence, going on to attend NYC's Hunter College, where studies in creative writing led him to begin screenwriting. He has identified himself as a \"multi-faceted\" actor", "Career": "=== 1990s ===\n\nDiesel's first film role was a brief uncredited appearance in the drama film Awakenings (1990). In 1994, he wrote, directed, produced, and starred in the short drama film Multi-Facial, a semi-autobiographical film which follows a struggling multiracial actor stuck in the audition process. The film was selected for screening at the 1995 Cannes Festival.\nIn 1997, Diesel made his first feature-length film, Strays, an urban drama in which he played a gang leader whose love for a woman inspires him to try to change his ways. Written, directed, and produced by Diesel, the film was selected for competition at the 1997 Sundance Festival, leading to an MTV deal to turn it into a series. Director Steven Spielberg took notice of Diesel after seeing him in Multi-Facial and cast him in a small role as a soldier in his 1998 Oscar-winning war film Saving Private Ryan. In 1999, he provided the voice of the title character in the animated film The Iron Giant.\n\n\n=== 2000s ===\nIn 2000, Diesel had a supporting role in the drama thriller Boiler Room, where he appeared alongside Giovanni Ribisi and Ben Affleck. He got his breakthrough leading role as the anti-hero Riddick in the science-fiction film Pitch Black later that year. Diesel attained action hero stardom with two box office hits: the street racing action film The Fast and the Furious (2001), and the action thriller XXX (2002). He turned down the chance to reprise his roles in the sequels 2 Fast 2 Furious (2003) and XXX: State of the Union (2005). Instead he chose to reprise his role as Riddick in The Chronicles of Riddick, which was a box office failure considering the large budget. He also voiced the character in two spin-off video games and the anime film The Chronicles of Riddick: Dark Fury. In a change from his previous action hero roles, in 2005, he played a lighthearted role in the comedy film The Pacifier, which was a box office success.In 2006, he chose a dramatic role playing real-life mobster Jack DiNorscio in Find Me Guilty. Although he received critical acclaim for his performance, the film did poorly at the box office grossing only $2 million against a budget of $13 million. Later that year, Diesel made a cameo appearance in The Fast and the Furious: Tokyo Drift, reprising his role from The Fast and the Furious.\nIn 2007, Diesel was set to produce and star as Agent 47 in the film adaptation of the video game Hitman, but eventually pulled back and served as executive producer on the film instead. In 2008, he starred in the science-fiction action thriller Babylon A.D. which was a critical and box office failure. Diesel returned to The Fast and the Furious series, alongside most of the principal cast from the original 2001 film, in Fast & Furious, which was released in April 2009.\n\n\n=== 2010s ===\n\nDiesel reprised his role as Dominic Toretto in installments five through eight of The Fast and the Furious franchise, Fast Five (2011), Fast & Furious 6 (2013), Furious 7 (2015), and The Fate of the Furious (2017). He reprised his role as Riddick in the third film of The Chronicles of Riddick series, simply titled Riddick (2013). In August 2013, Diesel received a star on the Hollywood Walk of Fame. He voiced Groot in the 2014 Marvel Cinematic Universe film Guardians of the Galaxy. He starred in the supernatural action film The Last Witch Hunter (2015). In 2016, Diesel appeared as a supporting character in Ang Lee's war drama Billy Lynn's Long Halftime Walk.\nIn 2017, Diesel also reprised his roles as Xander Cage in XXX: Return of Xander Cage, and Groot in Guardians of the Galaxy Vol. 2. Over the course of several years, Diesel has discussed playing two separate roles within the Marvel Cinematic Universe. In November 2016 director of Guardians of the Galaxy, James Gunn, confirmed that Diesel had been in talks to play Blackagar Boltagon / Black Bolt for the planned Inhumans film, but it was turned into a television series instead without Diesel involved.\nDiesel reprised his role of Groot once again in the crossover films Avengers: Infinity War (2018) and Avengers: Endgame (2019) which combined the superhero teams of Guardians of the Galaxy and The Avengers. He has said, \"[I] think there's gonna be a moment that we're all waiting for, and whether you know it or not, you are waiting to see [Groot] and [the Hulk] get down.\"Diesel is set to portray the Valiant Comics character Bloodshot in the film of the same name which is set for release in 2020. He is also joining the cast of James Cameron's Avatar 2.", "Personal life": "Diesel is noted for his recognizably deep voice; he has said that his voice broke around age 15, giving him a mature-sounding voice on the telephone.Around 2001, he dated his Fast and the Furious co-star, Michelle Rodriguez.Diesel and his current partner, Mexican model Paloma Jimenez, have three children: daughter Hania Riley (born April 2008), son Vincent Sinclair (born 2010), and daughter Pauline, whose arrival he announced in March 2015. She is named in honor of his friend and Fast & Furious franchise co-star, Paul Walker, who died in November 2013. He is also the godfather of Walker's daughter, Meadow Rain Walker. His daughter Hania studies Brazilian jiu-jitsu and judo.Diesel said in 2006 that he prefers to maintain his privacy regarding his personal life, stating: \"I'm not gonna put it out there on a magazine cover like some other actors ... I come from the Harrison Ford, Marlon Brando, Robert De Niro, Al Pacino code of silence.\" He has expressed his love for the Dominican Republic, and how he relates to its multicultural facets. He is acquainted with its former president, Leonel Fernández, and appeared in one of Fernández's earlier campaign ads. Los Bandoleros, a short film directed by Diesel, was filmed in the Dominican Republic.Diesel has played Dungeons & Dragons for over 20 years, and wrote the foreword for the commemorative book 30 Years of Adventure: A Celebration of Dungeons & Dragons. In the 30th anniversary issue of Dragon magazine, it was revealed that Diesel had a fake tattoo of his character's name, Melkor, on his stomach while filming XXX. Canadian video game designer and developer Merritt k created the 2015 Twine game (ASMR) Vin Diesel DMing a Game of D&D Just For You based on his D&D fandom.", "Filmography": "", "Awards and nominations": "", "References": "", "External links": "Vin Diesel on IMDb \nVin Diesel at Box Office Mojo\nVin Diesel at Rotten Tomatoes\nVin Diesel at Curlie"}