{"_id": "21", "name": "Adam Sandler", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:32", "biography": "Adam Richard Sandler (born September 9, 1966) is an American actor, comedian, screenwriter, film producer, and musician. After becoming a Saturday Night Live cast member, Sandler went on to star in many Hollywood feature films that combined have grossed over $2 billion at the box office.His film roles include Billy Madison (1995), the sports comedies Happy Gilmore (1996) and The Waterboy (1998), the romantic comedy The Wedding Singer (1998), Big Daddy (1999), Mr. Deeds (2002), Grown Ups (2010), Grown Ups 2 (2013) and voicing Dracula in the Hotel Transylvania franchise (2012-2018).\nSome of his films, such as the widely panned Jack and Jill, have been heavily criticized, culminating in a shared second place in the number of Raspberry Awards (3) and Raspberry Award nominations (11), in both cases second only to Sylvester Stallone.\nHe has ventured into more dramatic territory with his roles in Punch-Drunk Love (2002), Spanglish (2004), Reign Over Me (2007), Funny People (2009), and The Meyerowitz Stories (New and Selected) (2017), all of which earned him critical praise.", "Early life": "Sandler was born in Brooklyn, New York, on September 9, 1966, to Judith \"Judy\" (née Levine), a nursery school teacher, and Stanley Sandler, an electrical engineer. His family is Jewish and descends from Russian Jewish immigrants on both sides. His patrilineal great-grandfather, Joseph Jacob Sandler, was born in  Pagėgiai Municipality, Tauragė County, Lithuania. Adam grew up in Manchester, New Hampshire, after moving there at the age of six. He attended Manchester Central High School. As a teen, Sandler was in BBYO, a Jewish youth group. Sandler graduated from New York University's Tisch School of the Arts in 1988.", "Career": "=== Acting career ===\n\nEarly in his career, in 1987, Sandler played Theo Huxtable's friend, Smitty, in The Cosby Show and the Stud Boy or Trivia Delinquent in the MTV game show Remote Control. After his film debut Going Overboard in 1989, Sandler performed in comedy clubs, having first taken the stage at his brother's urging when he was 17. He was discovered by comedian Dennis Miller, who caught Sandler's act in Los Angeles and recommended him to Saturday Night Live producer Lorne Michaels. Sandler was hired as a writer for SNL in 1990 and became a featured player the following year, making a name for himself by performing amusing original songs on the show, including \"The Thanksgiving Song\" and \"The Chanukah Song\". Sandler told Conan O'Brien on The Tonight Show that NBC fired him and Chris Farley from the show in 1995, and played this up in his return to the show as a host in 2019.In 1993, Adam Sandler appeared in the film Coneheads with Chris Farley, David Spade, Dan Aykroyd, Phil Hartman, and Jane Curtin. In 1994, he co-starred in Airheads with Brendan Fraser and Steve Buscemi. He starred in Billy Madison (1995) playing a grown man repeating grades 1–12 to earn back his father's respect and the right to inherit his father's multimillion-dollar hotel empire. The film was successful at the box office despite negative reviews. He followed this film with Bulletproof (1996), and the financially successful comedies Happy Gilmore (1996) and The Wedding Singer (1998). He was initially cast in the bachelor party–themed comedy/thriller Very Bad Things (1998) but had to back out due to his involvement in The Waterboy (1998), one of his first hits.\nAlthough his earliest films did not receive favorable critical attention, he started to receive more positive reviews, beginning with Punch-Drunk Love in 2002. Roger Ebert's review of Punch-Drunk Love concluded that Sandler had been wasted in earlier films with poorly written scripts and characters with no development. Sandler has moved outside the genre of slapstick comedy to take on more serious roles, such as the aforementioned Punch-Drunk Love, for which he was nominated for a Golden Globe, and Mike Binder's Reign Over Me (2007), a drama about a man who loses his entire family in 9/11, and then struggles to rekindle a friendship with his old college roommate (Don Cheadle).\nHe starred alongside friend Kevin James in the film I Now Pronounce You Chuck and Larry (2007), and headlined You Don't Mess with the Zohan (2008). The latter film was written by Sandler, Judd Apatow, and Robert Smigel, and directed by Dennis Dugan.\n\nSandler starred along with Keri Russell and English comedian Russell Brand in Adam Shankman's fantasy film Bedtime Stories (2008), as a stressed hotel maintenance worker whose bedtime stories he reads to his niece and nephew begin to come true. It marked as Sandler's first family film and first film under the Walt Disney banner.In 2009, Sandler starred in Judd Apatow's third directorial feature Funny People. The film was released on July 31, 2009. Following the release of Funny People, it, along with Punch-Drunk Love were cited in the June 2010 announcement that Sandler was one of 135 people (including 20 actors) invited to join the Academy of Motion Picture Arts and Sciences.Sandler appeared in Grown Ups, alongside Kevin James, Chris Rock, Rob Schneider, and David Spade. Sandler and Dickie Roberts scribe Fred Wolf wrote the script and Dennis Dugan directed the film.Sandler starred with Jennifer Aniston in the 2011 romantic comedy film Just Go with It. Sandler also voiced a capuchin monkey in Kevin James's Zookeeper, released on July 8, 2011. In 2012, he starred in That's My Boy, as a man who fathered a son (Andy Samberg) with his teacher in high school.\nSandler starred with Drew Barrymore in the Warner Bros. romantic comedy Blended, which was filmed in South Africa, and was released on May 23, 2014.\nIn 2013, he guest starred in the Disney Channel Original Series Jessie as himself. He and Cameron Boyce previously worked together in Grown Ups and Grown Ups 2. The episode is titled \"Punched Dumped Love\". Sandler co-starred in the drama film Men, Women & Children (2014), directed by Jason Reitman. He was considered for the voice of Rocket Raccoon in Marvel's Guardians of the Galaxy but Bradley Cooper was cast instead.Sandler's recent comedy films, including Grown Ups and Grown Ups 2, have received strongly negative reviews. In reviewing the latter, critic Mark Olsen of The Los Angeles Times remarked that Sandler had become the antithesis of Judd Apatow; he was instead \"the white Tyler Perry: smart enough to know better, savvy enough to do it anyway, lazy enough not to care.\"In 2015, Sandler released his last theatrical film Pixels, based on French director Patrick Jean's 2010 short film of the same name, before transitioning into a distribution deal with Netflix. His first original film for Netflix was the Western comedy film The Ridiculous 6. Despite being universally panned by critics, on January 6, 2016, it was announced by Netflix that the film had been viewed more times in 30 days than any other movie in Netflix history. He released three additional films on Netflix between 2016 and 2018: The Do-Over, Sandy Wexler and The Week Of.\nHe returned to dramatic territory in 2017 with The Meyerowitz Stories, with his performance receiving favorable notices from critics.On May 4th 2019, Sandler made his first appearance as host of SNL, ending the episode with a tribute to his friend and fellow former cast member Chris Farley. \n\n\n=== Happy Madison Productions ===\n\nSandler formed his film production company, Happy Madison Productions, in 1999, first producing fellow SNL alumnus Rob Schneider's film Deuce Bigalow: Male Gigolo. The company has produced most of Sandler's subsequent films to date. The majority of the company's films have received negative reviews from critics, with three considered to be among the worst ever made yet most have performed well at box office.\nOthers who frequently appear in Sandler films include David Spade, Kevin James, Steve Buscemi, Chris Rock, John Turturro, Peter Dante, Allen Covert, Jonathan Loughran, and Jon Lovitz.\nIn 2014, Netflix announced a four-movie deal with Adam Sandler and Happy Madison Productions.The company is located on the Sony/Columbia Pictures lot in Culver City, California.", "Public image": "Sandler has been referenced multiple times in various media, including in the TV shows The Simpsons in the episode \"Monty Can't Buy Me Love\", in Family Guy in the episode \"Stew-Roids\", and in South Park in the episode \"You're Getting Old\". He was also referenced in the video game Half-Life: Opposing Force. The HBO series Animals episode \"The Trial\" features a mock court case to decide whether Sandler or Jim Carrey is a better comedian.", "Personal life": "On  June 22, 2003, Sandler married model-actress Jacqueline Titone. Titone had converted to Sandler's religion, Judaism. She makes frequent appearances in her husband's films. The couple have two daughters, born in May 2006,and November 2008, who also make frequent appearances in his films.\nIn 2007, Sandler made a $1 million donation to the Boys & Girls Clubs of America in his hometown, Manchester, New Hampshire. The same year, he donated $2,100 to former New York City Republican mayor Rudy Giuliani's presidential campaign.", "Filmography": "This is a partial list of Sandler's film work. For the complete list, see Adam Sandler filmography.", "Discography": "=== Albums ===\nIn 2009 Sandler contributed the Neil Young cover \"Like a Hurricane\" to Covered, A Revolution in Sound as part of Warner Brothers 50th Anniversary celebrations; the song was performed on the David Letterman Show with a band that included, among others, Waddy Wachtel, who has appeared with Sandler on a number of occasions.\n\n\n=== Singles ===", "Awards and nominations": "", "References": "", "External links": "Official website\nAdam Sandler on IMDb \nAdam Sandler at Box Office Mojo"}