{"_id": "41", "name": "Gwyneth Paltrow", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:40", "biography": "Gwyneth Kate Paltrow () (born September 27, 1972) is an American actress, singer, author, and businesswoman. She has won an Academy Award, a Golden Globe Award, a Primetime Emmy Award and two Screen Actors Guild Awards. Her films have grossed US$3.2 billion at the U.S. box office and US$8.2 billion worldwide.Paltrow gained very early notice for her work in films such as Seven (1995), Emma (1996), Sliding Doors (1998), and A Perfect Murder (1998). She garnered wider critical acclaim for her performance as Viola De Lesseps in the historical romance film Shakespeare in Love (1998) which won her several awards, including the Academy Award for Best Actress. This was followed by roles in The Talented Mr. Ripley (1999), The Royal Tenenbaums (2001), Shallow Hal (2001), and Sky Captain and the World of Tomorrow (2004). \nAfter becoming a mother, Paltrow significantly reduced her film workload, making occasional appearances in films like  Proof (2005), earning a nomination for the Golden Globe Award for Best Actress in a Motion Picture – Drama. In 2009, Paltrow received a Grammy Award nomination for the Best Spoken Word Album for Children for the children's audiobook Brown Bear and Friends, and in 2011, she won the Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series for her guest role of Holly Holliday on the Fox television series Glee. Since 2008, Paltrow has portrayed Pepper Potts in the Marvel Cinematic Universe.\nPaltrow has been the face of Estée Lauder's Pleasures perfume since 2005. She is also the face of American fashion brand Coach, owner of a controversial lifestyle company, Goop, and author of several cookbooks.", "Early life": "Paltrow was born the daughter of actress Blythe Danner and film producer-director Bruce Paltrow. She has a younger brother, Jake Paltrow, who is a director and screenwriter. Paltrow's father was Jewish, while her mother is from a Christian background. She was raised celebrating \"both Jewish and Christian holidays.\" Her brother had a traditional Bar Mitzvah when he turned 13. Her father's Ashkenazi Jewish family emigrated from Belarus and Poland, while her mother has Pennsylvania Dutch (German), Irish, and some English ancestry. Paltrow's paternal great-great-grandfather was a rabbi in Nowogród, Poland, and a descendant of the well known \"Paltrowicz\" family of rabbis from Kraków. She is a half-cousin of actress Katherine Moennig, through her mother, and a second cousin of former U.S. Congresswoman Gabrielle Giffords (AZ-08), through her father. Her uncle is opera singer and actor Harry Danner, whose daughter, actress Hillary Danner, is Paltrow's cousin and close friend. Paltrow recalls their family gatherings: \"Hillary and I always had this in common, and do to this day [...] cooking for people we love, eating, hanging out as a family. It's how we were raised. It's what we do.\" Another cousin is Rebekah Paltrow Neumann, whose spouse is the Israeli-American billionaire Adam Neumann, founder of WeWork.\nHer godfather is director Steven Spielberg.Paltrow was raised in Santa Monica, California, where she attended Crossroads School, before enrolling in the Spence School, a private girls' school in New York City. Later, she briefly studied anthropology at the University of California, Santa Barbara, before dropping out to act. She is an \"adopted daughter\" of Talavera de la Reina (Spain), where at 15, she spent a year as an exchange student and learned to speak Spanish. She is also conversant in French.", "Career": "=== 1989–1995: Early acting work ===\nHer acting debut was in High (1989), a TV film her father directed, and after spending several summers watching her mother perform at the Williamstown Theatre Festival in Massachusetts, Paltrow made her professional stage debut there in 1990. Her film debut followed with the musical romance film Shout (1991), starring John Travolta, and she was cast by Steven Spielberg in the commercially successful adventure feature Hook (1991) as the young Wendy Darling. Paltrow's next roles were in the made-for-television movies Cruel Doubt (1992) and Deadly Relations (1993). Her first plum feature film role was in the noir drama Flesh and Bone (1993) as the much-younger girlfriend of James Caan. Janet Maslin of The New York Times described Paltrow as a scene-stealer \"who is Blythe Danner's daughter and has her mother's way of making a camera fall in love with her.\" In 1995, she starred in the thriller Se7en, as the wife of a young detective (Brad Pitt), who is partnered with the retiring William Somerset (Morgan Freeman) and soon tasked with tracking down a serial killer who uses the seven deadly sins as tropes in his murders. The seventh-highest-grossing film of the year, Seven also earned her a Satellite Award nomination. She appeared in Moonlight and Valentino, as a grieving chain-smoker, and in Jefferson in Paris, portraying Martha Jefferson Randolph.\n\n\n=== 1996–2001: Breakthrough and film stardom ===\nIn 1996, Paltrow played the title character in the period film adaptation Emma, based on the 1815 novel of the same name by Jane Austen. Director Douglas McGrath decided to bring in Paltrow to audition for the part of Emma Woodhouse, after a suggestion from his agent and after seeing her performance in Flesh and Bone. On his decision to cast the actress, McGrath revealed: \"The thing that actually sold me on her playing a young English girl was that she did a perfect Texas accent. I know that wouldn't recommend her to most people [...] I knew she had theater training, so she could carry herself. We had many actresses, big and small, who wanted to play this part. The minute she started the read-through, the very first line, I thought, 'Everything is going to be fine; she's going to be brilliant.'\" While she recovered from wisdom-tooth surgery, Paltrow had a month to herself do her own research for the part; she studied horsemanship, dancing, singing, archery and the \"highly stylized\" manners and dialect during a three-week rehearsal period. The film was released to critical acclaim and commercial success through arthouse cinemas. Variety proclaimed: \"Gwyneth Paltrow shines brightly as Jane Austen's most endearing character, the disastrously self-assured matchmaker Emma Woodhouse. A fine cast, speedy pacing and playful direction make this a solid contender for the Austen sweepstakes.\"1998 marked a turning point in Paltrow's career as she took on leading roles in five high-profile film releases in the year—Great Expectations, Sliding Doors, Hush, A Perfect Murder and Shakespeare in Love. In the adaptation of the Charles Dickens novel Great Expectations, also starring Ethan Hawke, Robert De Niro, Anne Bancroft and Chris Cooper, she played the unrequited and haughty childhood love of a New York City painter. The British drama Sliding Doors saw her star as a woman whose life could take two central paths depending on whether or not she catches a train, causing different outcomes. Great Expectations and Sliding Doors both grossed over US$55 million worldwide. Paltrow starred opposite Jessica Lange in the thriller Hush, as an unsuspecting woman living with her psychotic mother-in-law. The film made US$13.5 million domestically and was generally panned by critics. In another thriller, A Perfect Murder, inspired by Alfred Hitchcock's 1954 film, Dial M for Murder, Paltrow starred alongside Michael Douglas, playing Emily Taylor, who was based on Grace Kelly's character from the original film. Despite a mixed critical response towards A Perfect Murder, the film grossed US$128 million globally. She was also considered for the role of Rose DeWitt Bukater in the 1997 film Titanic.\n\nHer most critically acclaimed role in the year was that of the fictional lover of William Shakespeare in Shakespeare in Love, opposite Joseph Fiennes in the titular part. Entertainment Weekly commented, \"Best of all is Gwyneth Paltrow, who, at long last, has a movie to star in that's as radiant as she is.\" The New York Times summed up her performance as Viola thus: \"Gwyneth Paltrow, in her first great, fully realized starring performance, makes a heroine so breathtaking that she seems utterly plausible as the playwright's guiding light.\" Shakespeare in Love made US$289 million in box office receipts, and earned Paltrow the award for Outstanding Performance by a Female Actor in a Leading Role from the Screen Actors Guild, the Golden Globe Award for Best Actress and the Academy Award for Best Actress, among other honors. Her pink Ralph Lauren dress worn at the 71st Academy Awards in collecting her Oscar was extremely popular and was credited for bringing pink back into fashion.In 1999, Paltrow co-starred alongside Jude Law, Matt Damon and Cate Blanchett in the psychological thriller The Talented Mr. Ripley, as the fiancée of a rich and spoiled millionaire playboy (Law) whose identity is adopted by a con artist (Damon). While The Guardian, noting the \"very underwritten\" female roles in the story, found her to be \"peaky and pallid\", the film received positive reviews and earned $80 million in North America. She showcased her singing ability in 2000s Duets, which was directed by her father and co-starred singer Huey Lewis. In the film, about \"the little known world of karaoke competitions and the wayward characters who inhabit it\", she portrayed the estranged daughter of a hustler (Lewis). She performed a cover version of Smokey Robinson's \"Cruisin', which was released as a single and went to number one in Australia, while her rendition of the Kim Carnes classic \"Bette Davis Eyes\" reached number three. Also in 2000, Paltrow co-starred with Ben Affleck in the moderately successful romantic drama Bounce as Abby Janello.\nShe starred with Jack Black in the comedy Shallow Hal (2001), about a shallow man falling in love with an overweight woman. To play her role, she had to wear a specially designed 25-pound fatsuit and heavy make-up. Shallow Hal opened with US$22.5 million and grossed US$70.7 million in North America and US$141.1 million around the globe. Roger Ebert remarked that she was \"truly touching\" in the film, which he described as \"often very funny, but [...] also surprisingly moving at times.\" In the Wes Anderson dramedy The Royal Tenenbaums (2001), co-starring Gene Hackman, Anjelica Huston, Ben Stiller and Luke Wilson, Paltrow took on the role of the adopted daughter in an estranged family of former child prodigies reuniting with their father. A positive critical response greeted the film upon its release, and it made US$71.4 million worldwide.\n\n\n=== 2002–2007: Mixed critical work and hiatus ===\nBy 2004, it was observed that since the Oscar for Shakespeare in Love, Paltrow's film career had been less noteworthy and critical acclaim had waned. She said she was unequipped for the pressure, leading to several bad movie choices, agreeing with peers who believe the win is, in some ways, a curse. During this time, Paltrow rarely appeared in films, having taken a hiatus to raise her two children. In The Guardian, she said she divided her career into movies for love and films for money: The Royal Tenenbaums, Proof, and Sylvia fell into the former category, while she signed on to View from the Top and Shallow Hal for the latter.In 2002, Paltrow made small appearances in the documentary Searching for Debra Winger and the action satire comedy Austin Powers in Goldmember, while she starred in the thriller-drama Possession with Aaron Eckhart as a couple of literary scholars who unearth the amorous secret of two Victorian poets as they find themselves falling under a deepening connection. Critically panned, the film made a lukewarm US$14.8 million worldwide. In the following year, she headlined the romantic comedy View from the Top, where she obtained the part of woman from a small town who sets out to fulfill her dream of becoming a flight attendant. Budgeted at US$30 million, the film only earned US$7 million in its opening weekend; it eventually grossed US$15.6 domestically and US$19,526,014 worldwide. She herself later disparaged the film, calling it \"terrible.\" Paltrow starred as the titular role in Sylvia (2003), a British biographical drama directed by Christine Jeffs and co-starring Daniel Craig chronicling the romance between prominent poets Sylvia Plath and Ted Hughes. Distributed for a limited release in most markets, Sylvia made US$2.9 million internationally. The New York Times, in its review for the film, wrote that \"her performance goes well beyond mimicry. She has a vivid, passionate presence, even when her lively features have gone slack with depression and her bright blue eyes have glazed over.\"In 2004, she starred with her The Talented Mr. Ripley co-star Jude Law and Angelina Jolie in the science-fiction film Sky Captain and the World of Tomorrow. Her role in the film was Polly Perkins, a reporter for the fictional New York Chronicle. Law became one of the producers of the film and used his clout to get Paltrow involved. Once she had been suggested for the role, Law did not remember \"any other name coming up. It just seems that she was perfect. She was as enthusiastic about the script and about the visual references that were sort of put to her, and jumped on board.\" She said in an interview, \"I thought that this is the time to do a movie like this where it's kind of breaking into new territory and it's not your basic formulaic action-adventure movie.\" While critical response was positive, with a budget of US$70 million, Sky Captain only grossed US$58 million at the international box office. Also in 2004, she was recognized as an outstanding woman in entertainment by Women in Film Los Angeles with the Crystal Award.In the drama Proof (2005), she starred as the depressed daughter of a brilliant, eccentric mathematician (played by Anthony Hopkins). The film was based on the play of the same name, in which Paltrow also played the same character at London's Donmar Warehouse between May and June 2002. On her portrayal in the film version, Eye for Film remarked: \"As she has already shown in Sylvia, The Royal Tenenbaums and even Sliding Doors, Paltrow has an uncanny talent for playing women who are coming apart at the seams and her [character] veers from lovably eccentric to more disturbingly unhinged and back again with fluent ease. The scenes, which she and Hopkins share, as two difficult people bound together by affection, dependency and mutual respect, are entirely believable and all the more touching for it.\" For her performance, Paltrow earned her second Golden Globe nomination for Best Actress – Motion Picture Drama.\nPaltrow filmed small roles for the 2006 films Love and Other Disasters, Running With Scissors and Infamous, where she sang Cole Porter's \"What Is This Thing Called Love?\" Her brother Jake Paltrow directed her in his feature debut, the romantic comedy The Good Night (2007), in which she starred opposite Penélope Cruz, Martin Freeman, Danny DeVito and Simon Pegg as the wife of a former keyboard player (Freeman). The film received a two-theater run in North America and garnered mixed reviews from critics. View London felt the actress was \"clearly only playing her part as a courtesy to her director brother and it just makes you wish she'd go back to playing lead roles again.\"\n\n\n=== 2008–2013: Iron Man and return to prominence ===\nPaltrow saw a resurgence in her career in 2008, when she was cast in Iron Man as Pepper Potts, Tony Stark's personal assistant, closest friend, and budding love interest. First hesitant to appear in a big-budget project, Paltrow asked Marvel to send her any comics they would consider relevant to her understanding of the character, who she considered to be very smart, levelheaded, and grounded. She said she liked \"the fact that there's a sexuality that's not blatant.\" Director Jon Favreau wanted Potts' and Stark's relationship to be reminiscent of a 1940s screwball comedy, something which Paltrow considered to be fun in an \"innocent yet sexy\" way. Iron Man was favorably received by critics, and with a worldwide gross of US$585 million, it became Paltrow's highest-grossing film until The Avengers (2012). She reprised her role in the sequels Iron Man 2 (2010) and Iron Man 3 (2013). While the second film made US$623.9 million internationally, the third entry went on to gross US$1.215 billion. She also reprised the role in Spider-Man: Homecoming (2017), Avengers: Infinity War (2018) and Avengers: Endgame (2019).\nPaltrow starred with Joaquin Phoenix in the romantic drama Two Lovers (2008), playing the beautiful but volatile new neighbor of a depressed bachelor. Two Lovers premiered in competition at the 2008 Cannes Film Festival in May, receiving largely positive reviews, especially for Phoenix and Paltrow's performances; Los Angeles Times felt that \"Phoenix is at his best with Paltrow's bruised sparrow of a girl; he's desperate to take care of her when he can't even take care of himself. She is one of those actresses who understands the power of a look, and the one of regret and then resignation that overtakes her when Leonard professes his love is steeped in sadness.\" The film was an arthouse success, grossing US$16 million worldwide.\n\nIn the musical drama Country Strong (2010), she starred as an emotionally unstable country music star who attempts to resurrect her career. She recorded the song \"Country Strong\" for the film's soundtrack, and it was released to country radio stations in August 2010. The film received mediocre reviews and grossed a modest US$20.2 million in North America. The consensus of review-aggregation website Rotten Tomatoes was: \"The cast gives it their all, and Paltrow handles her songs with aplomb, but Country Strong's cliched, disjointed screenplay hits too many bum notes.\" At the 83rd Academy Awards, Paltrow performed another song from the movie, \"Coming Home,\" which was nominated for Best Original Song.Paltrow made her first scripted television appearance on Fox's Glee, as substitute teacher Holly Holliday, who fills in for Matthew Morrison's character when he falls ill. Her role was developed by co-creator Ryan Murphy, a personal friend of Paltrow's, who suggested that she showcase her vocal and dancing abilities ahead of the release of Country Strong. In her first episode, \"The Substitute,\" she sang \"Nowadays\" from the musical Chicago with Lea Michele, CeeLo Green's \"Forget You\", and a mash-up of \"Singin' In the Rain\" and Rihanna's \"Umbrella\" with Morrison and the rest of the cast. Her debut in Glee attracted significant buzz and positive commentary from critics; she earned a Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series. Indeed, at the time, Entertainment Weekly's Tim Stack and E! Online's Kristin dos Santos called her appearance Emmy-worthy, with the former rating it among her best performances, and the latter stating that Holly received \"some of Glee's best-ever one-liners.\"She later performed \"Forget You\" with CeeLo Green himself and several puppet characters provided by The Jim Henson Company at the 2011 Grammy Awards. She reprised her role twice more that season, performing \"Do You Wanna Touch Me (Oh Yeah)\" by Gary Glitter, an acoustic version of \"Landslide\" by Fleetwood Mac, \"Kiss\" by Prince, and Adele's \"Turning Tables.\" Paltrow was briefly featured in Glee: The 3D Concert Movie after being filmed while she performed \"Forget You\" as Holly in the 2011 Glee Live! In Concert! tour performances of June 16 and 17, 2011. Afterwards in the year, Paltrow appeared in Steven Soderbergh's film Contagion, featuring an ensemble cast consisting of Marion Cotillard, Kate Winslet and her The Talented Mr. Ripley co-stars Matt Damon and Jude Law. The thriller follows the rapid progress of a lethal indirect contact transmission virus that kills within days. Paltrow portrayed Elizabeth Emhoff, a \"working mom\" and one of the virus' first victims. Contagion received positive reviews and opened atop at the North American box office with US$23.1 million; it went on to gross US$75.6 million domestically and US$135.4 million worldwide.She reprised her role of Pepper Potts in The Avengers (2012), which set numerous box office records, including the biggest opening weekend in North America; it grossed over $1.5 billion worldwide, becoming Paltrow's most widely seen film. Also in 2012, she starred in the independent romantic dramedy Thanks for Sharing, opposite Mark Ruffalo as people learning to face a challenging and confusing road as they struggle together against sex addiction. Distributed for a limited release in certain parts of the United States, the film garnered mixed reviews and grossed US$1 million domestically. Paste magazine noted that her role \"exhibits some of the same obsessive diet and exercise habits that Paltrow herself has been accused of—a kind of meta character trait that balances the power in [the main roles'] budding relationship.\" In April 2013, Paltrow was named People magazine's annual \"Most Beautiful Woman.\"\n\n\n=== 2014–present ===\nIn 2014, she had a two-episode arc in the improvised online series Web Therapy, as Maya Ganesh, \"a new-age caricature.\" In 2015, she starred in Mortdecai, alongside Johnny Depp, Olivia Munn, and Paul Bettany. In it, she portrayed the wife of an unscrupulous art dealer and swindler (Depp). Budgeted at US$60 million, the film only grossed US$7.7 million in North America and US$47.3 million internationally. Paltrow was featured on the track \"Everglow\", which was included in Coldplay's seventh studio album A Head Full of Dreams (2015). In June 2017, Paltrow announced that she would take a break from acting to focus on her business Goop, stating: \"I'm still going to do a little bit here and there, but [the company] really requires almost all of my time.\"", "Other projects": "=== Activism ===\n\nPaltrow is a Save the Children artist ambassador, raising awareness about World Pneumonia Day. She is on the board of the Robin Hood Foundation, a charitable organization that works to alleviate poverty in New York City. In October 2014, she hosted a Democratic fundraiser attended by President Barack Obama at her private residence in Los Angeles.In May 2019, Paltrow and actor Bradley Whitford hosted a fundraiser for Democratic Presidential candidate Mayor Pete Buttgieg.\n\n\n=== Audiobooks ===\nIn 2009, Paltrow narrated the audiobook The Brown Bear & Friends by Bill Martin Jr., the first of a series of children's audiobooks that she narrated. The Brown Bear & Friends audiobook earned Paltrow a Grammy Award nomination for Best Spoken Word Album for Children. Since, she has also narrated Bill Martin's Brown Bear, Brown Bear, What Do You See?, Baby Bear, Baby Bear, What Do You See?, Panda Bear, Panda Bear, What Do You See?, and Polar Bear, Polar Bear, What Do You Hear?.\n\n\n=== Fashion ===\nIn May 2005, Paltrow became the face of Estée Lauder's Pleasures perfume. She appeared in Chicago on August 17, 2007, to sign bottles of the perfume, and on July 8, 2008, she promoted Lauder's Sensuous perfume in New York with the company's three other models. Estée Lauder donates a minimum of $500,000 of sales of items from the 'Pleasures Gwyneth Paltrow' collection to breast cancer research. In 2006, she became the face for Bean Pole International, a Korean fashion brand and in 2014, she partnered with Blo Blow Bar, teaming up with the brand's creative branch.\n\n\n=== Goop ===\n\nIn September 2008, Paltrow launched the weekly lifestyle newsletter Goop, encouraging readers to 'nourish the inner aspect'. Goop has expanded into a web-based company, Goop.com. According to Paltrow, the company's name came from someone telling her successful internet companies have double O's in their name, and \"is a nickname, like my name is G.P., so that is really where it came from. And I wanted it to be a word that means nothing and could mean anything.\" Goop has expanded into e-commerce, collaborating with fashion brands, launching pop-up shops, launching a wellness summit, a print magazine, a podcast, and a documentary series to be streamed on Netflix.Goop, and by extension Paltrow, have drawn criticism by showcasing expensive products and promoting medically and scientifically impossible treatments, many of which have harmful consequences. The controversies have included vaginal steaming, the use of jade eggs, a dangerous coffee enema device, and \"Body Vibes\", wearable stickers that were claimed to \"rebalance the energy frequency in our bodies\" and which Goop falsely claimed were made of a NASA-developed material. Goop settled a lawsuit regarding the health claims it made over the jade eggs.Jill Avery, a brand analyst, has noted how Goop's response to criticisms seems designed to \"strengthen their brand and draw their customers closer\", noting Goop's references to feminism, traditional Asian medicines and Eastern philosophies, and anti-establishment politics to do so.\n\n\n=== Food ===\nIn October 2007, Paltrow signed for the PBS television series Spain... on the Road Again, which showcases the food and culture of Spain. In 2008, Paltrow co-wrote the book Spain... A Culinary Road Trip with Mario Batali. In 2011, she wrote a book titled My Father's Daughter: Delicious, Easy Recipes Celebrating Family and Togetherness. That same year she penned the book Notes From the Kitchen Table. Two years later she published a book titled It's All Good: Delicious Easy Recipes That Will Make You Look Good and Feel Great, which promoted an elimination diet that is unsupported by medical evidence. Included in that book was a recipe for avocado toast which was widely copied and adapted as part of a 2010s food trend. Also in 2013, Paltrow wrote a foreword for a book by Ross Matthews, Man Up! Tales of My Delusional Self-Confidence. In 2016, Paltrow published a cookbook: It's All Easy: Delicious Weekday Recipes for the Super-Busy Home Cook.Negative reaction by a group of scientist and science communication mothers to Paltrow's 2015 video pushing for mandatory labelling of food containing genetically modified organisms led to the creation of a documentary, Science Moms. The film is about mothers who advocate for science-based decision-making concerning the health and nutrition of children.", "Personal life": "At the age of 24, Paltrow was engaged to actor Brad Pitt, whom she dated from 1994 to 1997. The engagement was called off, according to Paltrow, because she was not ready for marriage. Paltrow has since said that, as this was her first high-profile relationship with another celebrity, it taught her the need for public discretion about her romantic life.\n\nPaltrow had an on-and-off three-year relationship with actor Ben Affleck from 1997 to late 2000. They first broke up in early 1999; soon afterward, Paltrow persuaded Affleck to star in the film Bounce with her. During the making of the film, the couple started dating again and eventually broke up in October 2000, after Affleck moved on to Jennifer Garner.In October 2002, Paltrow met Chris Martin of the British band Coldplay backstage three weeks after the death of her father, Bruce Paltrow. Pregnant with Martin's child, they married in December 2003 in a ceremony at a hotel in Southern California. Paltrow and Martin have two children together: a daughter named Apple, born in May 2004, and a son named Moses, born in April 2006. Moses' name was inspired by a song Chris Martin wrote for Paltrow. Simon Pegg and Martin's bandmate Jonny Buckland are Apple's godfathers.Paltrow cut down on work after becoming a mother. She also suffered from postpartum depression after the 2006 birth of her son. In March 2014, Paltrow announced that she and Martin had separated after ten years of marriage, describing the process as \"conscious uncoupling.\" In her official announcement, Gwyneth had her doctors Dr. Habib Sadeghi (whose guidance she closely followed through the uncoupling process) and his wife, Dr. Sherry Sami, explain the Conscious Uncoupling. A \"conscious uncoupling is the ability to understand that every irritation and argument [within a marriage] was a signal to look inside ourselves and identify a negative internal object that needed healing,\" Habib Sadeghi explained. \"From this perspective, there are no bad guys, just two people, it's about people as individuals, not just the relationship\".In April 2015, Paltrow filed for divorce, which was finalized on July 14, 2016.In 2014, Paltrow began dating producer Brad Falchuk, whom she met on the set of Glee in 2010. The couple went public with their relationship in April 2015. They announced their engagement on January 8, 2018 and the following July, that they would have a \"private and small\" wedding.\nThe marriage ceremony was held in September 2018 in The Hamptons on Long Island, New York. Falchuk had been married since 1994 to Suzanne Bukinik Falchuk who filed for divorce in 2013.\nIn 2004, Paltrow practiced cupping therapy, attending a film premiere with bruises on her back. As of 2013, Paltrow practices Transcendental Meditation. While Paltrow had previously smoked one cigarette a week, as of 2018 she had cut down.In 2017, Paltrow said that during the filming of the 1996 movie Emma, producer Harvey Weinstein made unwarranted sexual advances toward her. She confided in her then-fiancé Brad Pitt, who confronted Weinstein at an industry event. Weinstein later warned Paltrow not to tell anyone else.In January 2019, retired optometrist Terry Sanderson sued Paltrow for $3.1 million, claiming that three years earlier she collided with him on a ski slope at Deer Valley Resort in Park City, Utah, causing him permanent traumatic brain injury. Paltrow counter-sued Sanderson in February, claiming that he was the one who crashed into her. She sought a symbolic $1 in damages, as well as repayment of her legal fees.", "Filmography": "=== Film ===\n\n\n=== Television ===", "Discography": "=== Singles ===\n\n\n==== As lead artist ====\n\n\n==== As featured artist ====\n\n\n=== Other album appearances ===\n\n\n=== Music videos ===", "Published works": "Paltrow, Gwyneth (2011). My Father's Daughter: Delicious, Easy Recipes Celebrating Family & Togetherness. Grand Central Life & Style. ISBN 978-0446557313.\nPaltrow, Gwyneth (2011). Notes from My Kitchen Table. Grand Central Life & Style. ISBN 978-0752227894.\nPaltrow, Gwyneth (2013). It's All Good: Delicious, Easy Recipes That Will Make You Look Good and Feel Great. Grand Central Life & Style. ISBN 978-1455522712.\nPaltrow, Gwyneth (2019). The Clean Plate: Eat, Reset, Heal. Grand Central Life & Style.\nSadeghi Habib - Author, Paltrow, Gwyneth - Foreword (2017). The Clarity Cleanse: 12 Steps to Finding Renewed Energy, Spiritual Fulfillment and Emotional Healing. ISBN 1455542245.", "Awards and nominations": "", "References": "", "External links": "Gwyneth Paltrow on Twitter \nGwyneth Paltrow's newsletter, Goop\nGwyneth Paltrow at the Encyclopædia Britannica\nGwyneth Paltrow on IMDb \nGwyneth Paltrow at Box Office Mojo\nGwyneth Paltrow at Rotten Tomatoes"}