{"_id": "18", "name": "Will Smith", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:31", "biography": "Willard Carroll  Smith Jr. (born September 25, 1968) is an American actor, rapper and media personality. In April 2007, Newsweek called him \"the most powerful actor in Hollywood\". Smith has been nominated for five Golden Globe Awards and two Academy Awards, and has won four Grammy Awards.\nIn the late 1980s, Smith achieved modest fame as a rapper under the name The Fresh Prince. In 1990, his popularity increased dramatically when he starred in the NBC television series The Fresh Prince of Bel-Air, which ran for six seasons until 1996. After the series ended, Smith transitioned from television to film and went on to star in numerous blockbuster films. He is the only actor to have eight consecutive films gross over $100 million in the domestic box office, eleven consecutive films gross over $150 million internationally, and eight consecutive films in which he starred open at the number one spot in the domestic box office tally.Smith has been ranked as the most bankable star worldwide by Forbes. As of 2014, 17 of the 21 films in which he has had leading roles have accumulated worldwide gross earnings of over $100 million each, with five taking in over $500 million each in global box office receipts. As of 2016, his films have grossed $7.5 billion at the global box office. \nFor his performances as boxer Muhammad Ali in Ali (2001) and stockbroker Chris Gardner in The Pursuit of Happyness (2006), Smith received nominations for the Academy Award for Best Actor.", "Early life": "Smith was born on September 25, 1968 in Philadelphia, Pennsylvania to Caroline (née Bright), a Philadelphia school board administrator, and Willard Carroll Smith Sr., a U.S. Air Force veteran and refrigeration engineer. He grew up in West Philadelphia's Wynnefield neighborhood, and was raised Baptist. He has an elder sister named Pamela and two younger siblings, twins Harry and Ellen. Smith attended Our Lady of Lourdes, a private Catholic elementary school in Philadelphia. His parents separated when he was 13, but did not actually divorce until around 2000.Smith attended Overbrook High School. While it has been widely reported that Smith turned down a scholarship to attend the Massachusetts Institute of Technology (MIT), he never applied to college because he \"wanted to rap.\" Smith says he was admitted to a \"pre-engineering [summer] program\" at MIT for high school students, but he did not attend. According to Smith, \"My mother, who worked for the School Board of Philadelphia, had a friend who was the admissions officer at MIT. I had pretty high SAT scores and they needed black kids, so I probably could have gotten in. But I had no intention of going to college.\"", "Career": "=== 1985–1992: The Fresh Prince ===\n\nSmith started as the MC of the hip-hop duo DJ Jazzy Jeff & The Fresh Prince, with his childhood friend Jeffrey \"DJ Jazzy Jeff\" Townes as turntablist and producer. Townes and Smith were introduced to each other by chance in 1985, as Townes was performing at a house party only a few doors down from Smith's residence, and he was missing his hype man. Smith decided to fill in. They both felt strong chemistry, and Townes was upset when his hype man finally made it to the party.Soon after, the two decided to join forces. Smith enlisted a friend to join as the beatboxer of the group, Clarence Holmes (Ready Rock C), making them a trio. Philadelphia-based Word Up Records released their first single in late 1985 to 1986 when A&R man Paul Oakenfold introduced them to Word Up with their single \"Girls Ain't Nothing but Trouble,\" a tale of funny misadventures that landed Smith and his former DJ and rap partner Mark Forrest (Lord Supreme) in trouble. The song sampled the theme song of \"I Dream of Jeannie.\" Smith became known for light-hearted story-telling raps and capable, though profanity-free, \"battle\" rhymes. The single became a hit a month before Smith graduated from high school.Based on this success, the duo were brought to the attention of Jive Records and Russell Simmons. The duo's first album, Rock the House, which was first released on Word Up in 1986 debuted on Jive in March 1987. The group received the first Grammy Award for Best Rap Performance in 1989 for \"Parents Just Don't Understand\" (1988), though their most successful single was \"Summertime\" (1991), which earned the group their second Grammy and peaked at number 4 on the Billboard Hot 100. Smith and Townes are still friends and claim that they never split up, having made songs under Smith's solo performer credit.Smith spent money freely around 1988 and 1989 and underpaid his income taxes. The Internal Revenue Service eventually assessed a $2.8 million tax debt against Smith, took many of his possessions, and garnished his income. \nSmith was struggling financially in 1990, when the NBC television network signed him to a contract and built a sitcom, The Fresh Prince of Bel-Air, around him. The show was successful and began his acting career. Smith set for himself the goal of becoming \"the biggest movie star in the world\", studying box office successes' common characteristics.In 1989, Smith was arrested in relation to an assault on his record promoter William Hendricks which had left him almost blind in one eye.\n\n\n=== 1993–1997: Solo music and film breakthrough ===\nSmith's first major roles were in the drama Six Degrees of Separation (1993) and the action film Bad Boys (1995) in which he starred opposite Martin Lawrence. The latter film was commercially successful, grossing $141,407,024 worldwide — $65,807,024 in North America and $75,600,000 overseas. However, critical reception was generally mixed. In 1996, Smith starred as part of an ensemble cast in Roland Emmerich's Independence Day. The film was a massive blockbuster, becoming the second highest-grossing film in history at the time and establishing Smith as a prime box office draw.In the summer of 1997, he starred alongside Tommy Lee Jones in the hit Men in Black, playing Agent J. The film was released on July 2 by Columbia Pictures, and grossed over $589.3 million worldwide against a $90 million budget, becoming the year's third highest-grossing film, with an estimated 54,616,700 tickets sold in the US. It received worldwide acclaim, with critics highly praising its humor, as well as Jones and Smith's performances.\nDuring the summer of 1997, Smith also began his solo music career with the release of \"Men in Black\", the theme song for the film, which topped singles charts in several regions across the world, including the UK. \"Men in Black\" (and second single \"Just Cruisin'\") was later included on Smith's debut solo album Big Willie Style, which reached the top ten of the US Billboard 200 and was certified nine times platinum by the Recording Industry Association of America (RIAA). The third single from the album, \"Gettin' Jiggy wit It\", became Smith's first Billboard Hot 100 number one when it was released in 1998.\n\n\n=== 1998–2013: Leading man status ===\nIn 1998, Smith starred with Gene Hackman in Enemy of the State. The following year he turned down the role of Neo in The Matrix in favor of Wild Wild West (1999). Despite the disappointment of Wild Wild West, Smith has said that he harbors no regrets about his decision, asserting that Keanu Reeves's performance as Neo was superior to what Smith himself would have achieved, although in interviews subsequent to the release of Wild Wild West he stated that he \"made a mistake on Wild Wild West. That could have been better.\"Smith's second album was again supported by the release of a film theme song as the lead single: \"Wild Wild West\", featuring Dru Hill and Kool Moe Dee, topped the Billboard Hot 100 and was certified gold by the RIAA. The album in question, Willennium, reached number five on the Billboard 200 and was certified double platinum by the RIAA. \"Will 2K\", the second single from the album, reached number 25 on the Billboard Hot 100. Before the end of 1999, a video album was released featuring Smith's seven music videos released to date, which reached number 25 on the UK Music Video Chart. The same year, the rapper was also featured on The Fresh Prince of Bel-Air co-star Tatyana Ali's single \"Boy You Knock Me Out\", which reached number three on the UK Singles Chart and topped the UK R&B Singles Chart.Smith portrayed heavyweight boxer Muhammad Ali in the 2001 biopic Ali. For his performance he was nominated for the Academy Award for Best Actor, and the Golden Globe Award for Best Actor – Motion Picture Drama.\nIn 2002, following a four-year musical hiatus, Smith returned with his third album Born to Reign, which reached number 13 on the Billboard 200 and was certified gold by the RIAA. The album's lead single was the theme song from Smith's film Men in Black II, called \"Black Suits Comin' (Nod Ya Head)\", which reached number three on the UK Singles Chart. Later in the year, Smith's first compilation album Greatest Hits was released, featuring songs from his three solo albums as well as those produced with DJ Jazzy Jeff.2003 saw Smith return for Bad Boys II, the sequel to the 1995 film Bad Boys; the film follows detectives Burnett and Lowrey investigating the flow of ecstasy into Miami. Despite receiving generally negative reviews, the film was a box office success, grossing $270 million worldwide.Smith's latest album Lost and Found was released in 2005, peaking at number six on the Billboard 200. Lead single \"Switch\" reached the top ten of both the Billboard Hot 100 and the UK Singles Chart. In 2005, Smith was entered into the Guinness Book of World Records for attending three premieres in a 24-hour time span.Smith and his son Jaden played father and son in the 2006 biographical drama The Pursuit of Happyness In the film Smith portrays Chris Gardner. Smith first became interested in making a film about Gardner after seeing him on 20/20 and connected with him during production. The film, along with Smith's performance, received praise.\n\nOn December 10, 2007, Smith was honored at Grauman's Chinese Theatre on Hollywood Boulevard. Smith left an imprint of his hands and feet outside the theater in front of many fans. Later that month, Smith starred in the film I Am Legend, released December 14, 2007. Alongside marginally positive reviews, its opening was the largest ever for a film released in the United States during December. Smith himself has said that he considers the film to be \"aggressively unique\". A reviewer said that the film's commercial success \"cemented [Smith's] standing as the number one box office draw in Hollywood.\" On December 1, 2008, TV Guide reported that Smith was selected as one of America's top ten most fascinating people of 2008 for a Barbara Walters ABC special that aired on December 4, 2008.In 2008 Smith was reported to be developing a film entitled The Last Pharaoh, in which he would be starring as Taharqa. It was in 2008 that Smith starred in the superhero movie Hancock. Hancock has grossed $227,946,274 in the United States and Canada and $396,440,472 in other territories for a worldwide total of $624,386,746.On August 19, 2011, it was announced that Smith had returned to the studio with producer La Mar Edwards to work on his fifth studio album.Smith again reprised his role as Agent J with Men in Black 3, which opened on May 25, 2012, his first major starring role in four years. After the release of the film, Smith was content with ending his work with the franchise, saying, \"I think three is enough for me. Three of anything is enough for me. We'll look at it and we'll consider it, but it feels like that it might be time to let someone else do that.\" Men in Black 3, released ten years after Men in Black II (2002), grossed over $624 million worldwide. Unadjusted for inflation, it is the highest-grossing film in the series.In 2013 Smith starred in After Earth with his son Jaden. The film was a disappointment at the domestic box office and was panned critically. Calling the film \"the most painful failure in my career\", Smith ended up taking a year and a half break as a result.\n\n\n=== 2015–present ===\nSmith starred opposite Margot Robbie in the romance drama Focus. He played Nicky Spurgeon, a veteran con artist who takes a young, attractive woman under his wing. Focus was released on February 27, 2015. Smith was set to star in the sci-fi thriller Brilliance, an adaptation of Marcus Sakey's novel of the same name scripted by Jurassic Park writer David Koepp, but he left the project to work on the Ridley Scott-produced sports drama Concussion.In Concussion, Smith played Dr. Bennet Omalu of the Brain Injury Research Institute, the first to discover chronic traumatic encephalopathy. Smith reported he had doubts about the film early in the production, saying, \"some of my happiest memories are of watching my son catch and throw a football. I didn’t want to be the guy who did a movie saying football could be dangerous.\" These views subsided when he met Omalu, whose words about American ideals resonated with Smith. Smith's performance was praised for being \"sensitive [and] understated\".In 2016, Smith played Deadshot in the supervillain team-up action film Suicide Squad. Smith's participation in the film meant choosing it over a role in Independence Day: Resurgence, which he said would be like \"clinging and clawing backwards.\" Later that year, Smith starred in director David Frankel's drama Collateral Beauty, playing a New York advertising executive who succumbs to a deep depression after a personal tragedy. Weeks after signing Smith onto the film, his father was diagnosed with cancer, from which he died in 2016. As part of his role required him to read about religion and the afterlife, he was brought closer to the elder Smith, calling the experience \"a beautiful way to prepare for a movie and an even more majestic way to say goodbye to my father.\"\n\nHis film, Bright was distributed via Netflix on December 22, 2017. An urban fantasy, it was the most expensive film for Netflix to date. Smith collaborated with his director from Suicide Squad, David Ayer. That month, Smith launched his own YouTube channel, which as of July 2019 has over 6 million subscribers and 294 million total views. Also in 2017, Smith released the song \"Get Lit\" a collaboration between him and his former group mate Jazzy Jeff.Smith performed the official song \"Live It Up\" alongside American singer Nicky Jam and Kosovar singer Era Istrefi at the closing ceremony of the 2018 FIFA World Cup in Moscow, Russia. That September Smith appeared, alongside, Bad Bunny, on the Marc Anthony song Está Rico.Smith portrayed The Genie (originally played by Robin Williams) in the live action adaptation of Disney's Aladdin, directed by Guy Ritchie. He also participated in the soundtracks by recording singles: \"Arabian Nights (2019)\", \"Friend Like Me\" and \"Prince Ali\". The film was released on May 24, 2019. Aladdin grossed over $1 billion worldwide to become Smith's highest grossing film, surpassing Independence Day. Smith was also featured on rapper Logic's song \"Don't Be Afraid To Be Different\" (2019), from his fifth studio album Confessions of a Dangerous Mind.\n\n\n==== Upcoming projects ====\nSmith will appear as an assassin who faces off against himself, a clone who is younger and in his prime in Ang Lee's Gemini Man, scheduled for release on October 4, 2019. Next, Smith will voice Lance Sterling, a spy, in Spies in Disguise, which sees Lance having to team up with the nerdy inventor who creates Lance's gadgets, voiced by Tom Holland. The film is scheduled to be released on December 25, 2019.", "Personal life": "Smith married Sheree Zampino in 1992. Their son Willard Carroll \"Trey\" Smith III was born on November 11, 1992.\n They divorced in 1995. Trey appeared in his father's music video for the 1998 single \"Just the Two of Us\". He also acted in two episodes of the sitcom All of Us, and has appeared on The Oprah Winfrey Show and the David Blaine: Real or Magic TV special.Smith married actress Jada Koren Pinkett in 1997. Together they have two children: Jaden Christopher Syre Smith (born 1998), his co-star in The Pursuit of Happyness and After Earth; and Willow Camille Reign Smith (born 2000), who appeared as his daughter in I Am Legend. Smith and his brother Harry own Treyball Development Inc., a Beverly Hills-based company named after Trey. Smith and his family reside in Los Angeles, California.\n\n\n=== Religious views ===\nSmith was raised in a Baptist household and attended a Catholic school. In a 2013 interview, he did not identify as religious; however, in 2015 Smith said in an interview with The Christian Post that his Christian faith which was instilled in him by his grandmother, helped him to accurately portray his role as Bennet Omalu in Concussion saying, \"She was my spiritual teacher, she was that grandmother at the church, the one having the kids doing the Easter presentations and putting on the Christmas plays and her kids and grandkids had to be first. She was the most spiritually certain person that I had ever met in my entire life. Even to the point that when she was dying she was happy, like she was really excited about going to heaven.\" He is not a Scientologist and has denied rumors claiming him as a member of the Church of Scientology, but he has spoken favorably about it: \"I just think a lot of the ideas in Scientology are brilliant and revolutionary and non-religious.\"Smith gave $1.3 million to charities in 2007, of which $450,000 went to two Christian ministries, and $122,500 went to three Scientology organizations; the remaining beneficiaries included \"a Los Angeles mosque, other Christian-based schools and churches, and ... the Yitzhak Rabin Memorial Center in Israel.\" Smith and his wife have also founded a private elementary school in Calabasas, California, the New Village Leadership Academy. Federal tax filing showed that Smith donated $1.2 million to the school in 2010.In 2018, Smith performed the Hindu rite of Abhisheka of Lord Shiva at Haridwar, India. He also performed an Aarti of the holy river Ganga. He said that he felt a deep connection with Hindu spirituality and Indian astrology.\n\n\n=== Political views ===\nSmith donated $4,600 to the 2008 presidential campaign of Democrat Barack Obama. On December 11, 2009, Smith and his wife hosted the Nobel Peace Prize Concert in Oslo, Norway to celebrate Obama's winning of the prize.In 2012, Smith stated he supported legalizing same-sex marriage.\n\n\n=== Philanthropy ===\nIn 2018, Smith celebrated his 50th birthday by performing a bungee jump from a helicopter in the Grand Canyon. Smith was insured by Lloyd's of London for $200 million for the jump which raised money for the charity Global Citizen.", "Discography": "=== With DJ Jazzy Jeff ===\nRock the House (1987)\nHe's the DJ, I'm the Rapper (1988)\nAnd in This Corner... (1989)\nHomebase (1991)\nCode Red (1993)\n\n\n=== Solo albums ===\nBig Willie Style (1997)\nWillennium (1999)\nBorn to Reign (2002)\nLost and Found (2005)", "References": "", "Further reading": "Iannucci, Lisa (2009). Will Smith: A Biography. Greenwood. ISBN 0-313-37610-7.", "External links": "Official website \nWill Smith on IMDb \nWill Smith at Box Office Mojo\nWill Smith   on Charlie Rose\nWill Smith discography at MusicBrainz"}