{"_id": "16", "name": "Jeremy Renner", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:30", "biography": "Jeremy Lee Renner (born January 7, 1971) is an American actor, singer and songwriter. He began his career by appearing in independent films such as Dahmer (2002) and Neo Ned (2005). Renner earned supporting roles in bigger films, such as S.W.A.T. (2003) and 28 Weeks Later (2007). Renner was nominated for the Academy Award for Best Actor for his performance in The Hurt Locker (2008) and for the Academy Award for Best Supporting Actor for his much-praised performance in The Town (2010). \nRenner played Hawkeye in the Marvel Cinematic Universe films Thor (2011), The Avengers (2012), Avengers: Age of Ultron (2015), Captain America: Civil War (2016) and Avengers: Endgame (2019). He also appeared in Mission: Impossible – Ghost Protocol (2011), The Bourne Legacy (2012), Hansel and Gretel: Witch Hunters (2013), American Hustle (2013), Mission: Impossible – Rogue Nation (2015), and Arrival (2016). Renner is also a rock musician, whose single \"Main Attraction\" was released in 2019.", "Early life": "Renner was born in Modesto, California, to mother Valerie Cearley (née Tague) and father Lee Renner, who managed McHenry Bowl, a Modesto bowling alley, in the 1980s. His parents married as teenagers and divorced when he was ten. He is the oldest of seven siblings. His ancestry includes German, English, Scottish, Swedish, Irish and Panamanian.Renner graduated from Fred C. Beyer High School in Modesto in 1989. He attended Modesto Junior College, where he studied computer science and criminology, before he took a drama class as an elective and decided to pursue acting.", "Career": "=== Early work ===\nRenner's made his film debut as an underachieving student in the 1995 comedy National Lampoon's Senior Trip. Although the film was critically panned, he went on to guest star on two television shows, Deadly Games and Strange Luck, and had a minor role in the television film A Friend's Betrayal as the friend of Paul Hewitt (Brian Austin Green). Over the next few years, Renner had guest roles in Zoe, Duncan, Jack and Jane (1999), The Net (1999), The Time of Your Life (1999), and Angel (2000). Renner had a small role in an episode of CSI: Crime Scene Investigation in 2001. Renner worked as a makeup artist during this period to help make ends meet.\n\n\n=== Early success: 2002–2008 ===\nIn 2002, Renner starred in Dahmer as the eponymous serial killer Jeffrey Dahmer. He found the non-fiction role a challenge to cope with after he had finished shooting the film, knowing that Dahmer murdered seventeen victims. His performance was well received, and he gained a nomination for the Independent Spirit Award for Best Lead Male. He also appeared in Pink's 2003 music video for her song \"Trouble\" as a Bad Boy Sheriff. Renner went on to appear in S.W.A.T. as the former police partner of Colin Farrell's character in 2003 and The Heart Is Deceitful Above All Things in 2004.In 2005, Renner starred with Julia Stiles and Forest Whitaker in A Little Trip to Heaven, with roles in North Country and 12 and Holding. He next starred as a neo-Nazi skinhead who is admitted into a psychiatric hospital in Neo Ned with Gabrielle Union. The film won all numerous awards that it was nominated for at multiple film festivals, including the Palm Beach International Film Festival Award for Best Actor. Renner also had a small (though uncredited) role in skateboard film Lords of Dogtown as the manager of Emile Hirsch's character. In 2006, he starred with Ginnifer Goodwin in Love Comes to the Executioner.\nRenner had supporting roles in 2007 in the critically acclaimed The Assassination of Jesse James by the Coward Robert Ford as Wood Hite, the cousin of outlaw Jesse James (portrayed by Brad Pitt), and as Sergeant Doyle in 28 Weeks Later. He starred with Minnie Driver in Take and guest starred as a patient in an episode of House as a reckless rock musician. Renner had a role in the pilot of The Oaks but the series was not picked up.\n\n\n=== 2009–present ===\nAfter starring with Dallas Roberts in the comedy-drama Ingenious and starring in the short-lived television series The Unusuals, Renner went on to achieve critical success for his portrayal of bomb disposal expert, Sergeant William James in the 2009 Iraq war thriller The Hurt Locker (directed by Kathryn Bigelow). The role earned him several awards in the Best Actor category and his first Academy Award nomination for Best Actor as well a Screen Actors Guild Award nomination.\n\nIn 2010, Renner's performance in Ben Affleck's The Town alongside Jon Hamm, Blake Lively, Slaine and Michael Yebba garnered him rave reviews and his second Academy Award nomination for Best Supporting Actor. He also gained his first Golden Globe nomination for Best Supporting Actor and his second Screen Actors Guild nomination. The Hollywood Reporter named Renner as one of the young male actors who are \"pushing – or being pushed\" into taking over Hollywood as the new \"A-List\".In 2011, Renner had an uncredited cameo appearance as Hawkeye in Thor for familiarity with his character for The Avengers, which was released in May 2012.\nIn 2012, Renner starred as Hawkeye in the Marvel film The Avengers. The same year, he also starred in the fourth film in the Bourne franchise, The Bourne Legacy, which was written and directed by Tony Gilroy. Renner played a new lead character, Aaron Cross, in place of Jason Bourne, who was played by Matt Damon in the first three films. Renner has expressed interest in doing a Bourne film with Damon in the future, stating that \"[it] would be kick-ass. I love Matt\".\n\nRenner starred in the action horror film Hansel & Gretel: Witch Hunters (released in January 2013), in which he and Gemma Arterton played Hansel and Gretel, respectively. The 3-D film was set 15 years after Hansel and Gretel killed the witch who kidnapped them.Renner was also featured in the ensemble cast of David O. Russell's dramedy American Hustle based on the controversial FBI ABSCAM operation of the late 1970s and early 1980s. The film, which was released in December 2013, also starred Christian Bale, Bradley Cooper, Amy Adams and Jennifer Lawrence in principal roles. The film earned much critical acclaim, including the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture and a nomination for the Academy Award for Best Picture. In October 2014, Renner starred as journalist Gary Webb in the Focus Features film Kill the Messenger, based on Webb's book Dark Alliance. Renner also co-produced the film. In December 2014, Crackle aired The Throwaways, a film for which he served as executive producer.In 2015, Renner reprised his role as Hawkeye in Avengers: Age of Ultron, the sequel to The Avengers. He returned to the Mission: Impossible franchise in Mission: Impossible – Rogue Nation, released in July 2015. In 2016, Renner played Hawkeye again in the summer blockbuster film Captain America: Civil War, and starred with Amy Adams in the sci-fi film Arrival. Renner is a producer of the 2016 film The Founder starring Michael Keaton as Ray Kroc, the man who turned McDonald's into one of the world's largest restaurant chains.In 2016, History announced their historical drama Knightfall, executive produced by Renner, who is expected to guest star. In 2017, while working on the film Tag (2018), Renner fractured his right elbow and his left wrist. He also appeared in the film Wind River with his MCU co-star Elizabeth Olsen.Renner filmed scenes as Hawkeye for Avengers: Infinity War and Avengers: Endgame. Despite this, he did not appear in Infinity War. Because of resulting scheduling conflicts, he was unable to reprise the role of William Brandt in Mission: Impossible – Fallout (2018). In July, Jeremy Renner was announced to play Twitch Williams in Todd McFarlane's Spawn reboot.\n\n\n=== Music ===\nRenner is also a singer-songwriter, guitarist, keyboardist, and drummer. Early in his acting career, he performed in the Sons of Ben. He has performed songs on several film soundtracks: \"I Drink Alone\" for North Country, \"American Pie\" for Love Comes to the Executioner, and \"Good Ole Rebel\" for The Assassination of Jesse James by the Coward Robert Ford. He also appeared in music videos for \"Trouble\" by P!nk and \"Scenes on Sunset\" by Brother Sal.\nHe was featured in Sam Feldt's 2018 single, \"Heaven (Don't Have a Name)\".", "Personal life": "Renner married Canadian model Sonni Pacheco on January 13, 2014. Renner and Pacheco have a daughter, Ava Berlin (born March 28, 2013). On December 30, 2014, Pacheco filed for divorce from Renner, citing irreconcilable differences. They share custody of their daughter.Renner lives in Washoe County, Nevada.Renner also runs a house-renovating business with his best friend and fellow actor, Kristoffer Winters. In addition to acting, he studied Arnis (Filipino martial arts) and Muay Thai martial arts, mainly as preparation for his roles in the Mission: Impossible and Avengers franchises.Renner is a fan of the San Francisco 49ers. He narrated the NFL Network documentary series The Timeline episode \"A Tale of Two Cities\", which chronicles the history of the team's rivalry with the Dallas Cowboys, and the introductory video for the grand opening of Levi's Stadium.", "Filmography": "=== Film ===\n\n\n=== Television ===", "Discography": "\"Main Attraction\" - 2019", "Awards and nominations": "", "References": "", "Further reading": "Peter Howell (September 9, 2008). \"Iraq War Movie Put Hurt on Actor\". The Toronto Star. Retrieved April 4, 2016.", "External links": "Jeremy Renner on IMDb \nJeremy Renner at Box Office Mojo"}