{"_id": "83", "name": "Adam Driver", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:09", "biography": "Adam Douglas Driver (born November 19, 1983) is an American actor. He rose to prominence in the supporting role of Adam Sackler in the HBO comedy-drama series Girls (2012–2017), for which he received three consecutive nominations for the Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series. He made his Broadway debut in Mrs. Warren's Profession (2010) and subsequently appeared in Man and Boy (2011). Driver went on to play supporting roles in such films as Lincoln (2012), Frances Ha (2012), Inside Llewyn Davis (2013), and Silence (2016). \nDriver won the Volpi Cup for Best Actor for his lead role in the drama Hungry Hearts (2014) and the Los Angeles Film Critics Association Award for Best Actor for playing a poet in Jim Jarmusch's Paterson (2016). He earned nominations for the Golden Globe and the Academy Award for Best Supporting Actor for playing a police detective in the black comedy film BlacKkKlansman (2018). Driver gained wider recognition for playing Kylo Ren in the Star Wars sequel trilogy films The Force Awakens (2015), The Last Jedi (2017), and the upcoming The Rise of Skywalker (2019). He returned to Broadway in 2019 with Burn This, for which he was nominated for the Tony Award for Best Actor in a Play.\nDriver is the co-founder of Arts in the Armed Forces, a non-profit that brings high-quality arts programming to active-duty service members, veterans, military support staff and their families around the world free of charge. He founded the organization with his wife Joanne Tucker in 2006.", "Early life": "Driver was born in San Diego, California, the son of Nancy Wright (née Sneedham), a paralegal, and Joe Douglas Driver. His father's family is from Arkansas and his mother's family is from Indiana. His stepfather, Rodney G. Wright, is a minister at a Baptist church. He has English, Irish, Scottish, German, and Dutch ancestry. When Driver was seven years old, he moved with his older sister and mother to her hometown of Mishawaka, Indiana, and attended Mishawaka High School, where he graduated in 2001. Driver was raised Baptist; he had a religious upbringing and sang in the choir at church.As a teenager, Driver described himself as a \"misfit,\" telling M Magazine that he climbed radio towers, set objects on fire, and co-founded a fight club with his friends after being inspired by the film Fight Club. After high school, and before his military service, Driver worked as a door-to-door salesman selling Kirby vacuum cleaners and as a telemarketer for a basement waterproofing company and Ben Franklin Construction. After high school, Driver applied to the Juilliard School for drama, but was rejected. \n\n\n=== Military service and education ===\nShortly after the September 11 attacks, Driver joined the United States Marine Corps and was assigned to Weapons Company, 1st Battalion, 1st Marines as an 81mm mortar man. He served for two years and eight months with no deployments before breaking his sternum while mountain biking. He was medically discharged with the rank of Lance Corporal. After leaving the Marine Corps, Driver attended the University of Indianapolis for a year, then auditioned again and was accepted into Julliard to study drama. Driver said that he was seen as an intimidating and volatile figure by his classmates, and struggled to fit into a lifestyle so different from the Marines. He was a member of the Drama Division's Group 38 (2005–2009), where he met his wife Joanne Tucker. He graduated with a Bachelor of Fine Arts degree in 2009.", "Career": "=== Early career, Girls, and breakthrough (2009–2014) ===\nAfter graduating from Juilliard, Driver began his acting career in New York City, appearing in both Broadway and off-Broadway productions. Like many aspiring actors, he occasionally worked as a busboy and waiter. Driver also appeared in several television shows and short films. His first on-screen appearance was in the series finale of The Unusuals in 2009 as a repentant witness and reluctant accomplice to an unsolved assault. He made his feature film debut in Clint Eastwood's biographical drama J. Edgar in 2011.\nIn 2012, Driver was cast in the HBO comedy-drama series Girls, as the emotionally unstable Adam Sackler, the boyfriend of the lead character Hannah Horvath (Lena Dunham). During the show's run he received three nominations for the Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series for his role. The same year, Driver played supporting roles in two critically acclaimed films, as telegraph and cipher officer Samuel Beckwith in Steven Spielberg's historical drama Lincoln, and Lev Shapiro in Noah Baumbach's comedy-drama Frances Ha. He also appeared in the drama Not Waving But Drowning and the romantic-comedy Gayby. Additionally, he garnered major off-Broadway recognition for playing Cliff, a working-class Welsh houseguest in Look Back in Anger, winning the Lucille Lortel Award for Outstanding Featured Actor in a Play.In 2013, Driver appeared in the drama Bluebird and the romantic-comedy What If. He played Al Cody, a musician, in the Coen Brothers' black comedy tragedy Inside Llewyn Davis, and photographer Rick Smolan in the drama Tracks. In 2014, he played Jude, a despairing father, in the drama Hungry Hearts; Jaime, an aspiring filmmaker, in Noah Baumbach's comedy While We're Young; and Philip, the black sheep of a dysfunctional Jewish family, in the comedy-drama This Is Where I Leave You. For his performance in Hungry Hearts, Driver won the Volpi Cup for Best Actor at the 71st Venice International Film Festival.\n\n\n=== Mainstream and critical success (2015–present) ===\n\nIn February 2014, Variety reported that Driver would play the villain, Kylo Ren, in J. J. Abrams' Star Wars: The Force Awakens (2015). On April 29, 2014, he was confirmed as a cast member. The Force Awakens was released on December 18, 2015 to commercial and critical success. Peter Bradshaw of The Guardian highlighted Driver's performance in his review of the film calling him \"gorgeously cruel, spiteful and capricious... very suited to Kylo Ren's fastidious and amused contempt for his enemies' weakness and compassion.\"In 2016, Driver played a supporting role in Jeff Nichols' sci-fi thriller Midnight Special, which was released on March 18, 2016. He also co-starred in Martin Scorsese's historical drama Silence (2016) as Father Francisco Garupe, a 17th-century Portuguese Jesuit priest, alongside Andrew Garfield. In preparation for the role, Driver lost almost 50 pounds. Jim Jarmusch's drama Paterson was Driver's final film of 2016, in which he played Paterson, a bus driver who writes poetry. The film premiered at Cannes Film Festival and was released on December 28, 2016. Driver's performance was acclaimed and he received multiple nominations for Best Actor from critics associations, winning several, including the Los Angeles Film Critics Association Award for Best Actor. Peter Travers of Rolling Stone wrote \"Driver's indelibly moving portrayal is so lived-in and lyrical you hardly recognize it as acting.\" Paterson was included in many critics' top ten lists of best films of 2016.In 2017, Driver played a cameo in Noah Baumbach's The Meyerowitz Stories as Randy, marking his third appearance in one of Baumbach's films. The film premiered at Cannes Film Festival and was released on October 13, 2017 on Netflix. He also portrayed Clyde, a one-armed redneck veteran, in Steven Soderbergh's Logan Lucky, which was released on August 18, 2017. He reprised his role as Kylo Ren in Star Wars: The Last Jedi, which was released on December 15, 2017. His performance was positively received, with his character lauded as the best in the series: David Edelstein of Vulture wrote, \"the core of The Last Jedi — of this whole trilogy, it seems — is Driver's Kylo Ren, who ranks with cinema's most fascinating human monsters.\"In 2018, Driver portrayed a Jewish police detective, Phillip \"Flip\" Zimmerman, who helps infiltrate the Ku Klux Klan in Spike Lee's comedy-drama BlacKkKlansman. The film premiered at Cannes Film Festival and was theatrically released on August 10. He received critical acclaim for his performance in the film and was nominated for the Academy Award for Best Actor in a Supporting Role and the Golden Globe Award for Best Supporting Actor. Driver also starred as the lead character Toby Grisoni in Terry Gilliam's adventure-comedy The Man Who Killed Don Quixote, which also premiered at Cannes. In 2019, he starred as Daniel Jones in Scott Z. Burns' political drama The Report, which premiered at the Sundance Film Festival in Utah. Driver returned to Broadway to play Pale against Keri Russell in a Michael Mayer-directed production of Lanford Wilson's Burn This. He received acclaim for his explosive performance and was nominated for Tony Award for Best Actor in a Play.\nIn 2019, Driver was part of the ensemble cast of the Jim Jarmusch zombie comedy movie The Dead Don't Die.\n\n\n==== Upcoming projects ====\nDriver will co-star with Scarlett Johansson in the upcoming Marriage Story. He is set to star in Sylvester Stallone's Tough As They Come and Leos Carax's upcoming music drama Annette. He will reprise his role as Kylo Ren in Star Wars: The Rise of Skywalker.", "Personal life": "Driver married actress Joanne Tucker in June 2013. They live together in Brooklyn Heights with dog Moose, a Rottweiler-Pitbull mix.He is the co-founder of Arts in the Armed Forces (AITAF), a non-profit that performs theatre for all branches of the military, both in the United States and abroad.Indie-rock band Sipper has a song dedicated to Driver.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===\n\n\n=== Stage ===", "Awards and nominations": "", "References": "", "External links": "Adam Driver on IMDb  \nAdam Driver at the Internet Broadway Database\nAdam Driver at the Internet Off-Broadway Database\nAdam Driver at the TCM Movie Database\nAdam Driver at AllMovie\nAdam Driver at Rotten Tomatoes\nAdam Driver: Theatre Credits on Broadwayworld.com"}