{"_id": "75", "name": "Channing Tatum", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:00", "biography": "Channing Matthew Tatum (born April 26, 1980) is an American actor and singer. Tatum made his film debut in the drama film Coach Carter (2005). His breakthrough role was in the 2006 dance film Step Up, which introduced him to a wider audience. He is known for his portrayal of the character Duke in the 2009 action film G.I. Joe: The Rise of Cobra and its 2013 sequel G.I. Joe: Retaliation. Although both G.I. Joe films received negative reviews from critics, they were commercially successful, grossing more than $300 million each at the box office.\nTatum is also known for his leading role in Magic Mike (2012), and its sequel, Magic Mike XXL (2015) which he produced; he also starred in the action-comedy film 21 Jump Street and its 2014 sequel, 22 Jump Street. He appeared in romantic films such as Dear John (2010) and The Vow (2012). His other films include She's the Man (2006), The Dilemma (2011), White House Down (2013), the drama Foxcatcher (2014), The Hateful Eight (2015), Hail, Caesar! (2016), and Logan Lucky (2017).", "Early life": "Tatum was born in Cullman, Alabama, the son of Kay Tatum (née Faust), an airline worker, and Glenn Tatum, who worked in construction. He has a sister named Paige. He is mostly of English ancestry.His family moved to the Pascagoula, Mississippi area when he was six. He grew up in the bayous near the Pascagoula River, where he lived in a rural setting.Tatum has discussed having dealt with attention deficit disorder (ADD) and dyslexia while growing up, which affected his ability to do well in school. Growing up, Tatum played football, soccer, track, baseball, and performing martial arts; he has said that \"girls were always [his] biggest distraction in school.\" As a child, he practiced wuzuquan kung fu.Tatum spent most of his teenage years in the Tampa area, and initially attended Gaither High School. His parents wanted more effort and gave him the option of selecting a private high school or attending a military school; he chose Tampa Catholic High School, where he graduated in 1998 and was voted most athletic. He later attended Glenville State College in Glenville, West Virginia on a football scholarship, but dropped out. He returned home and started working odd jobs.\nUs Weekly reported that around this time Tatum left his job as a roofer and began working as a stripper at a local nightclub, under the name \"Chan Crawford\". In 2010, he told an Australian newspaper that he wanted to make a movie about his experiences as a stripper. That idea led to the movie Magic Mike. Tatum moved to Miami, where he was discovered by a model talent scout.", "Career": "=== Early work ===\nIn 2000, Tatum was first cast as a dancer in Ricky Martin's \"She Bangs\" music video, after an audition in Orlando, Florida; he was paid $400 for the job. His experience in the fashion industry began as a model working for noted clients such as Armani and Abercrombie & Fitch. He soon moved into television commercials, landing national spots for Mountain Dew and Pepsi in 2002. He subsequently signed with Page 305 (Page Parkes Modeling Agency), a modeling agency in Miami. He was cast by Al David for Vogue magazine and soon after appeared in campaigns for Abercrombie & Fitch, Nautica, Dolce & Gabbana, American Eagle Outfitters, and Emporio Armani. He was picked as one of Tear Sheet magazine's \"50 Most Beautiful Faces\" of October 2001. Tatum signed with Ford Models in New York City.\n\n\n=== 2006–2012 ===\n\nIn 2006, Tatum starred in She's The Man opposite Amanda Bynes, which was named the greatest modern Shakespearean remake by Business Insider. Later that year, Tatum starred opposite his now wife Jenna Dewan in Step Up, which was his breakout role. Although it was widely panned, it has earned $115 million worldwide.In 2008, Tatum co-starred in director Kimberly Peirce's film Stop-Loss, about soldiers returning home from the Iraq War, and in director Stuart Townsend's film Battle in Seattle, about the 1999 protest of the World Trade Organization meeting in Seattle. Tatum played in the short film The Trap, directed by Rita Wilson.Tatum and Dito Montiel, who worked together on A Guide to Recognizing Your Saints, reteamed on the action drama Fighting for Rogue Pictures. Tatum starred as Sean McArthur, a young man who scrapes up a living scalping tickets in New York City. Tatum next appeared in writer/director/producer Michael Mann's 2009 crime drama Public Enemies, playing the 1930s American gangster Pretty Boy Floyd. The same year, Tatum starred as Duke in G.I. Joe: The Rise of Cobra, Paramount Pictures' live-action film based on the popular Hasbro action figures. He was initially reluctant to take the role as he feared the movie would glorify war; however, he overcame his reluctance after reading the script. He played a soldier in Dear John, a film based on the popular Nicholas Sparks bestseller. He later stated that he had accepted the role to learn from director Lasse Hallström because he had never studied at an acting school.\n\nIn an interview with Details magazine, published in early 2012, Tatum said he wants to produce all the films he stars in, \"I really don't want to be in any more movies that I don't produce. Unless it's with one of the 10 directors that I really want to work with, I don't have any interest in not being on the ground floor of creating it.\" He, his wife Jenna Dewan, and their production partner Reid Carolin signed a two-year production deal in 2010 with Relativity Media for any movies they may develop during that time. In 2012, Tatum hosted Saturday Night Live and appeared in four films. He co-starred in Steven Soderbergh's action-thriller Haywire, The Vow with Rachel McAdams, and 21 Jump Street (the film adaptation of TV series of the same name) with Jonah Hill.He also starred in Magic Mike, a film about his eight-month experience as a male stripper in Florida. The film was directed by Steven Soderbergh, was co-produced by Tatum and Soderbergh, and starred Tatum as Mike. He is a featured performer at a Tampa, Florida, male strip club who takes a younger dancer (Alex Pettyfer) under his wing to show him how to hustle \"on and off stage\". The film's cast also included Matt Bomer, Joe Manganiello, and Matthew McConaughey.In November 2012 Tatum was named People magazine's annual Sexiest Man Alive.\n\n\n=== 2013–present ===\n\nTatum appeared in Steven Soderbergh's Side Effects, with Rooney Mara and Jude Law.He reprised his role as Conrad S. Hauser/Duke in G.I. Joe: Retaliation, the sequel to 2009's G.I. Joe: The Rise of Cobra, in an ensemble cast that included Dwayne Johnson and Bruce Willis. Originally scheduled for release on June 29, 2012, the film was pushed back to March 2013, in order to convert it to 3D and to add more scenes for his character, who was killed at the beginning of the movie. Tatum later said he had not wanted to appear in the sequel and was happy his character had been killed off. Also in 2013, he appeared in another action movie, White House Down.Tatum reprised his role from 21 Jump Street in its sequel, 22 Jump Street, which was released on June 13, 2014.Also in 2014, he co-starred with Steve Carell in Foxcatcher, the story of John du Pont, who suffered from paranoid schizophrenia and killed Olympic wrestler Dave Schultz, the brother of the character played by Tatum, who also had won Olympic gold. Tatum was set to star as X-Men character Remy LeBeau / Gambit in a solo film, set within the X-Men film universe, which he would have produced, but the film was cancelled in May 2019 after languishing in development hell since 2014.", "33andOut Productions": "Tatum started two production companies, 33andOut Productions and Iron Horse Entertainment. Their first production was the documentary Earth Made of Glass.", "Personal life": "In 2006, Tatum met actress Jenna Dewan on the set of their movie Step Up; they married on July 11, 2009, at Church Estates Vineyards in Malibu, California. They have a daughter who was born in May 2013 in London. On April 2, 2018, after nearly nine years of marriage, the couple announced they were separating. Six months later, Dewan filed for divorce from Tatum.He has been dating English singer Jessie J since October 2018.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===\n\n\n=== Producer ===\n\n\n=== Music videos ===", "Awards and nominations": "Critics' Choice Movie AwardsGolden Raspberry AwardsIndependent Spirit AwardsMTV Movie & TV AwardsPeople's Choice AwardsSundance Film FestivalTeen Choice Awards", "References": "", "External links": "Channing Tatum on IMDb \nChanning Tatum at Box Office Mojo"}