{"_id": "19", "name": "Matt Damon", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:31", "biography": "Matthew Paige Damon (; born October 8, 1970) is an American actor, film producer and screenwriter. He is ranked among Forbes magazine's most bankable stars and is one of the highest-grossing actors of all time. Damon has received various accolades, including an Academy Award from five nominations, two Golden Globe Awards from eight nominations, and has been nominated for three British Academy Film Awards and seven Emmy Awards.\nBorn and raised in Cambridge, Massachusetts, Damon began his acting career by appearing in high school theater productions. He made his professional acting debut in the film Mystic Pizza (1988). He came to prominence in 1997, when he wrote and starred in Good Will Hunting, alongside Ben Affleck, which won them the Academy and Golden Globe awards for Best Screenplay and earned Damon a nomination for the Academy Award for Best Actor. He continued to garner praise from critics for his roles as the eponymous character in Saving Private Ryan (1998), the antihero in The Talented Mr. Ripley (1999), a fallen angel in Dogma (1999), an energy analyst in Syriana (2005), and a corrupt Irish-American police officer in The Departed (2006).\nDamon is also known for his starring roles as Jason Bourne in the Bourne franchise (2002–2016) and as a con man in the Ocean's trilogy (2001–2007). For his supporting role as the rugby player Francois Pienaar in Invictus (2009) and his leading role as an astronaut stranded on Mars in The Martian (2015), Damon received Academy Award nominations for Best Supporting Actor and Best Actor, respectively. The latter also won him a Golden Globe Award for Best Actor. Damon has received Emmy Award nominations for his portrayal of Scott Thorson in the biopic Behind the Candelabra (2013) and for producing the reality series Project Greenlight. He also received an Academy Award nomination for producing Manchester by the Sea (2016).\nIn addition to acting in films, Damon has performed voice-over work in both animated and documentary films and has established two production companies with Affleck. He has been involved in charitable work, including the ONE Campaign, H2O Africa Foundation, Feeding America, and Water.org. Damon is married to Luciana Bozán Barroso, and they have three daughters together.", "Early life and education": "Damon was born in Cambridge, Massachusetts, the second son of stockbroker Kent Telfer Damon and Nancy Carlsson-Paige, an early childhood education professor at Lesley University. His father had English and Scottish ancestry, and his mother is of five-eighths Finnish and three-eighths Swedish descent (his mother's family surname had been changed from the Finnish \"Pajari\" to \"Paige\"). Damon and his family moved to Newton for two years. His parents divorced when he was two years old, and Damon and his brother returned with their mother to Cambridge, where they lived in a six-family communal house. His brother Kyle is now an accomplished sculptor and artist.As a lonely teenager, Damon has said that he felt that he did not belong. Due to his mother's \"by the book\" approach to child-rearing, he had a hard time defining a self identity. He attended Cambridge Alternative School (now Graham and Parks) and then Cambridge Rindge and Latin School, where he was a good student. Damon performed as an actor in several high school theater productions. He credited his drama teacher, Gerry Speca, as an important artistic influence, though Ben Affleck, his good friend and schoolmate, got the \"biggest roles and longest speeches\".Damon attended Harvard University, where he was a resident of Lowell House and a member of the class of 1992, but left before receiving his degree to take a lead role in the film Geronimo: An American Legend. While at Harvard, he wrote an early treatment of the screenplay for Good Will Hunting as an exercise for an English class. Damon was a member of the Delphic Club, one of the University's select Final Clubs. In 2013, he was awarded the Harvard Arts Medal. Damon received an Academy Award for the screenplay of Good Will Hunting in 1998.", "Acting career": "=== Early years: 1988–1996 ===\nDamon entered Harvard in 1988, where he appeared in student theater plays, such as Burn This and A... My Name is Alice. Later, he made his film debut at the age of 18, with a single line of dialogue in the romantic comedy Mystic Pizza. As a student at Harvard, he acted in small roles such as in the TNT original film Rising Son and the ensemble prep-school drama School Ties. He left the university in 1992, a semester - 12 credits - shy of completion of his Bachelor of Arts in English to feature in Geronimo: An American Legend in Los Angeles, erroneously expecting the movie to become a big success. Damon next appeared as an opiate-addicted soldier in 1996's Courage Under Fire, for which he lost 40 pounds (18 kg) in 100 days on a self-prescribed diet and fitness regimen. Courage Under Fire gained him critical notice, when The Washington Post labeled his performance \"impressive\".\n\n\n=== Breakthrough roles: 1997–2000 ===\nDuring the early 1990s, Damon and Affleck wrote Good Will Hunting (1997), a screenplay about a young mathematics genius, an extension of a screenplay he wrote for an assignment at Harvard, having integrated advice from director Rob Reiner, screenwriter William Goldman, and writer/director Kevin Smith. He asked Affleck to perform the scenes with him in front of the class and, when Damon later moved into Affleck's Los Angeles apartment, they began working on the script more seriously. The film, which they wrote mainly during improvisation sessions, was set partly in their hometown of Cambridge, and drew from their own experiences. They sold the screenplay to Castle Rock in 1994, but after a conflict with the company, they convinced Miramax to purchase the script. The film received critical praise; Quentin Curtis of The Daily Telegraph found \"real wit and vigour, and some depth\" in their writing and Emanuel Levy of Variety wrote of Damon's acting, \"[he] gives a charismatic performance in a demanding role that's bound to catapult him to stardom. Perfectly cast, he makes the aching, step-by-step transformation of Will realistic and credible.\" It received nine Academy Awards nominations, including Best Actor for Damon; he and Affleck won Oscars and Golden Globe Award for Best Screenplay. He and Affleck were each paid salaries of $600,000, while the film grossed over $225 million at the worldwide box office. The two later parodied their roles from the film in Kevin Smith's 2001 movie Jay and Silent Bob Strike Back.\n\nSpeaking of his \"overnight success\" through Good Will Hunting, Damon said by that time he had been working in the cinema for 11 years, but still found the change \"nearly indescribable—going from total obscurity to walking down a street in New York and having everybody turn and look\". Before the film, Damon played the lead in the critically acclaimed drama, The Rainmaker (1997), where he was recognized by the Los Angeles Times as \"a talented young actor on the brink of stardom.\" For the role, Damon gained most of the weight he had lost for Courage Under Fire. After meeting Damon on the set of Good Will Hunting, director Steven Spielberg cast him in the brief title role in the 1998 World War II film Saving Private Ryan. He co-starred with Edward Norton in the 1998 poker film Rounders, where he plays a reformed gambler in law school who must return to playing big stakes poker to help a friend pay off loan sharks. Despite meager earnings at the box-office, the film has developed a cult status over the years.Damon then portrayed antihero Tom Ripley in The Talented Mr. Ripley (1999), a role for which he lost 25 pounds (11 kg). Damon said that he wanted to display his character's humanity and honesty on screen despite his criminal actions. An adaptation of Patricia Highsmith's 1955 novel of same name, the film costarred Jude Law, Gwyneth Paltrow and Cate Blanchett, and received praise from critics. \"Damon outstandingly conveys his character's slide from innocent enthusiasm into cold calculation\", according to Variety magazine. He played a fallen angel who discusses pop culture as intellectual subject matter with Affleck in Dogma (1999). The film received generally positive reviews, but proved controversial among religious groups who deemed it blasphemous.Damon's attempts at essaying leading characters in romantic dramas such as 2000's All the Pretty Horses and The Legend of Bagger Vance were commercially and critically unsuccessful. Variety said of his work in All the Pretty Horses: \"[Damon] just doesn't quite seem like a young man who's spent his life amidst the dust and dung of a Texas cattle ranch. Nor does he strike any sparks with [Penelope] Cruz.\" He was similarly deemed \"uncomfortable being the center\" of Robert Redford's The Legend of Bagger Vance by Peter Rainer of New York magazine.\n\n\n=== Hollywood star: 2001–2007 ===\nDuring this period, Damon joined two lucrative film series—Ocean's Trilogy (2001–2007) and Bourne (2002–2016)—and produced the television series Project Greenlight (2001–2005, 2015). In the former's first installment, Steven Soderbergh's 2001 ensemble film Ocean's Eleven, which is a remake of the Rat Pack's Ocean's 11 (1960), he co-starred as thief Linus Caldwell. The role was originally meant for Mark Wahlberg, who refused it in favor of other projects. The film was successful at the box-office, grossing $450 million from a budget of $83 million. Damon, alongside Affleck and others, produced the documentary series Project Greenlight, aired on HBO and later Bravo, which helps newcomers develop their first film. The series was nominated for the Primetime Emmy Award for Outstanding Reality Program in 2002, 2004 and 2005. Damon later said that he and Affleck felt proud that the show helped launch the careers of several directors; Damon later served as the executive producer of a number of projects directed by the winners of the show.\n\nDamon began 2002 with writing and starring in Gerry, a drama about two friends who forget to bring water and food when they go hiking in a desert. The reviews for the film were generally positive, but it was a box-office failure. He then played amnesiac assassin Jason Bourne in Doug Liman's action thriller The Bourne Identity (2002). Liman considered several actors for the role, before he finalized Damon. Damon insisted on performing many of the stunts himself, undergoing three months of extensive training in stunt work, the use of weapons, boxing, and eskrima. Damon said that before The Bourne Identity he was jobless for six months, and many of his films during that period under-performed at the box-office. He doubted on the film's financial prospects, but it proved a commercial success. Reviews for the film were also positive; Roger Ebert praised it for its ability to absorb the viewer in its \"spycraft\" and \"Damon's ability to be focused and sincere\". For his role, Entertainment Weekly named Damon among \"the decade's best mixer of brawn and brains.\"Damon voiced the role of Spirit in the animated film Spirit: Stallion of the Cimarron (2002) and later played a conjoined twin in Stuck on You (2003), which received a mixed critical reception. His major releases in 2004 included starring roles in the sequels The Bourne Supremacy and Ocean's Twelve. Both films earned more than $280 million at the box-office. In a review for The Bourne Supremacy, BBC's Nev Pierce called the film \"a brisk, engrossing and intelligent thriller\", adding, \"Damon is one hell of an action hero. He does a lot with very little, imbuing his limited dialogue with both rage and sorrow, looking harder and more haunted as the picture progresses\". For the film, he earned an Empire Award for Best Actor; the award's presenter Empire attributed Damon's win to his \"astute, underplayed performance, through which he totally eschews movie star vanity\". He played a fictionalized version of Wilhelm Grimm alongside Heath Ledger in Terry Gilliam's fantasy adventure The Brothers Grimm (2005), which was a critically panned commercial failure; The Washington Post concluded, \"Damon, constantly flashing his newscaster's teeth and flaunting a fake, 'Masterpiece Theatre' dialect, comes across like someone who got lost on the way to an audition for a high school production of The Pirates of Penzance.\"Later in 2005, he appeared as an energy analyst in the geopolitical thriller Syriana alongside George Clooney and Jeffrey Wright. The film focuses on petroleum politics and the global influence of the oil industry. Damon says starring in the film broadened his understanding of the oil industry and that he hoped the people would talk about the film afterward. Peter Travers of Rolling Stone was mainly impressed \nwith Clooney's acting, but also found Damon's performance \"whiplash\". In 2006, Damon joined Robert De Niro in The Good Shepherd as a career CIA officer, and played an undercover mobster working for the Massachusetts State Police in Martin Scorsese's The Departed, a remake of the Hong Kong police thriller Infernal Affairs. Assessing his work in the two films, Manohla Dargis of The New York Times wrote that Damon has the unique \"ability to recede into a film while also being fully present, a recessed intensity, that distinguishes how he holds the screen.\" The Departed received critical acclaim and won the Academy Award for Best Picture.\nAccording to Forbes in August 2007, Damon was the most bankable star of the actors reviewed, his last three films at that time averaged US$29 at the box office for every dollar he earned. Damon had an uncredited cameo in Francis Ford Coppola's Youth Without Youth (2007) and another cameo in the 2008 Che Guevara biopic Che.\n\n\n=== Critically acclaimed roles: 2009–present ===\nHe made a guest appearance in 2009 on the sixth-season finale of Entourage as himself, where he tries to pressure Vincent Chase (Adrian Grenier) into donating to his real foundation ONEXONE. His next role was Steven Soderbergh's dark comedy The Informant! (2009), in which his Golden Globe-nominated work was described by Entertainment Weekly as such: \"The star – who has quietly and steadily turned into a great Everyman actor – is in nimble control as he reveals his character's deep crazies.\" Also in 2009, Damon portrayed South Africa national rugby union team captain François Pienaar in the Clint Eastwood-directed film Invictus, which is based on the 2008 John Carlin book Playing the Enemy: Nelson Mandela and the Game That Changed a Nation and features Morgan Freeman as Nelson Mandela. Invictus earned Damon an Academy Award nomination for Best Supporting Actor. The New Republic observed that he brought \"it off with low-key charm and integrity.\"In 2010, he reteamed with director Paul Greengrass, who directed him in the Bourne Supremacy and Bourne Ultimatum, for the action thriller Green Zone, which flopped commercially and received a score of 53% on Rotten Tomatoes and ambivalent reception from critics. He has appeared as a guest star in an episode of Arthur, titled \"The Making of Arthur\", as himself. During season 5 of 30 Rock, he appeared as guest star in the role of Liz Lemon's boyfriend in the episodes \"I Do Do\", \"The Fabian Strategy\", \"Live Show\", and \"Double-edged Sword\". Damon's 2010 projects included Clint Eastwood's Hereafter and the Coen brothers' remake of the 1969 John Wayne-starring Western True Grit.In 2011, he starred in The Adjustment Bureau, Contagion, and We Bought a Zoo. In April 2012, Damon filmed Promised Land, directed by Gus Van Sant, which he co-wrote with John Krasinski. Damon's next film with frequent collaborator Steven Soderbergh was Behind the Candelabra, a drama about the life of pianist/entertainer Liberace (played by Michael Douglas) with Damon playing Liberace's longtime partner Scott Thorson. The film premiered on HBO on May 26, 2013.Damon starred in the science fiction film Elysium (2013), where he played former car-thief-turned-factory-worker Max DeCosta. He also appeared in the science fiction movie The Zero Theorem by Terry Gilliam in 2013. In 2014, he starred in George Clooney's The Monuments Men, and played the minor role of scientist Dr. Mann, in Christopher Nolan's Interstellar. In 2014, Damon appeared as a celebrity correspondent for Years of Living Dangerously.He played the main character, astronaut Mark Watney, in Ridley Scott's The Martian (2015), based on Andy Weir's best-selling novel of the same name, a role that earned him the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy and his second Academy Award nomination for Best Actor. Having not returned for the fourth film in the Bourne film series, Damon reprised his role in 2016's Jason Bourne, reuniting with Paul Greengrass. In 2017, Damon played the lead role in Zhang Yimou's The Great Wall, a hit internationally and a disappointment at the domestic box office. The film, and Damon's casting, were not well received by critics. Later in 2017, he starred in two satires, George Clooney's 1950s-set Suburbicon, which was released in October, and Alexander Payne's comedy Downsizing, which was released in December. Damon is set to portray Carroll Shelby in the action biographical drama Ford v Ferrari (2019), directed by James Mangold.", "Producing career": "Along with Ben Affleck and producers Chris Moore and Sean Bailey, Damon founded the production company LivePlanet, through which the four created the Emmy-nominated documentary series Project Greenlight to find and fund worthwhile film projects from novice filmmakers. The company produced and founded the short-lived mystery-hybrid series Push, Nevada, as well as other projects. In March 2010, Damon and Affleck teamed up again to create Pearl Street Films, a Warner Bros. based production company.", "Voice-over career": "He lent his voice to the English version of the animated film Ponyo, which was released in the United States in August 2009. The documentary which he narrated, American Teacher, opened in New York in 2011 prior to national screening. He also voiced the lead character Cale Tucker in Titan A.E., took the narrative voice of the Stallion Spirit in Spirit: Stallion of the Cimarron, and voiced a krill named Bill in Happy Feet Two.In January 2012, it was announced that Damon had signed a multiyear deal to be the voice of TD Ameritrade advertisements, replacing Sam Waterston as the discount brokerage's spokesman. Damon donates all fees from the advertisements to charity.\nIn 2013, Damon appeared in a 20-second advertisement for Nespresso, directed by Grant Heslov, with whom he worked on The Monuments Men. The deal earned Damon $3 million.Damon also provided voice-over for United Airlines's resurrected \"Fly the Friendly Skies\" advertisement campaign in 2013.", "Humanitarian work": "Damon was the founder of H2O Africa Foundation, the charitable arm of the Running the Sahara expedition, which merged with WaterPartners to create Water.org in July 2009. He, along with George Clooney, Brad Pitt, Don Cheadle, David Pressman, and Jerry Weintraub, is one of the founders of Not On Our Watch Project, an organization that focuses global attention and resources to stop and prevent mass atrocities such as in Darfur. Damon supports the ONE Campaign, which is aimed at fighting AIDS and poverty in Third World countries. He has appeared in their print and television advertising.\nDamon is also an ambassador for ONEXONE, a nonprofit foundation committed to supporting, preserving and improving the lives of children at home in Canada, the United States, and around the world. Damon is also a spokesperson for Feeding America, a hunger-relief organization, and a member of their Entertainment Council, participating in their Ad Council public service announcements. Damon is a board member of Tonic Mailstopper (formerly GreenDimes), a company that attempts to halt junk mail delivered to American homes each day.", "In the media": "=== Jimmy Kimmel Live! ===\nComedian Jimmy Kimmel had a running gag at the end of his ABC television show, Jimmy Kimmel Live!, where he apologized for not being able to interview Damon at the end of each show. It culminated in a planned skit on September 12, 2006, when Damon stormed off after having his interview cut short. Damon appeared in several of E! Entertainment's top ten Jimmy Kimmel Live! spoofs. On January 24, 2013, Damon took over his show and mentioned the long-standing feud and having been bumped from years of shows. It involved celebrities who were previously involved in the \"feud\", including Robin Williams, Ben Affleck, and Sarah Silverman.\n\n\n=== Political views ===\nDamon appeared on Hardball with Chris Matthews in December 2006, and while discussing the ongoing war in Iraq, expressed concern about inequities across socioeconomic classes with regard to who in the United States is tasked with the responsibility of fighting wars. Damon is a supporter of the Democratic Party, and has made several critical attacks against Republican Party figures, but has also expressed his disillusionment with the policies of President Barack Obama. In 2012, Damon, Ben Affleck, and John Krasinski hosted a fundraiser for Democratic Senate nominee Elizabeth Warren.Damon had a working relationship with the Obama administration, primarily due to his friendship with former Harvard roommate and Chairman of the Council of Economic Advisors to President Obama, Jason Furman. In 2010, Matt Damon narrated the documentary film Inside Job about the part played by financial deregulation in the late-2000s financial crisis.\nOn March 13, 2018, Matt Damon and Ben Affleck announced they will adopt the inclusion rider agreement in all their future production deals through their Pearl Street Films.\n\n\n=== Social views ===\nIn October and December 2017, Damon made headlines when he made a series of comments regarding a large movement of backlash against sexual harassment and misconduct. On October 10, Sharon Waxman, a former reporter for The New York Times, mentioned that Damon, along with Russell Crowe, made direct phone calls to her to vouch for the head of Miramax Italy, Fabrizio Lombardo. In her report, she suspected Lombardo of facilitating incidents of Harvey Weinstein's sexual misconduct in Europe. However, Damon clarified later that the calls were solely to reassure her of Lombardo's professional qualifications in the film industry. Waxman endorsed Damon's statement on Twitter hours later. Also during this time, Damon said that he had heard a story from Ben Affleck that Gwyneth Paltrow, a co-worker on a feature film of his, had been harassed by Weinstein in 1996, but thought \"she had handled it\" because they continued to work together, and Weinstein \"treated her incredibly respectfully.\"In another series of interviews during December 2017, Damon advocated for a \"spectrum of behavior\" analysis of sexual misconduct cases, noting that some are more serious than others. The comment caused offense to prominent members of the #MeToo movement and the public for being tone-deaf in \"understand[ing] what abuse is like\". On January 17, 2018, Damon apologized on The Today Show for his social commentary stating: \"I should get in the back seat and close my mouth for a while.\"", "Personal life": "Damon met Argentine Luciana Bozán Barroso in April 2003 while filming Stuck on You in Miami. They became engaged in September 2005 and married in a private civil ceremony on December 9, 2005, at the Manhattan Marriage Bureau. The couple has three daughters: Isabella (b. June 2006), Gia Zavala (b. August 2008), and Stella Zavala (b. October 2010). He also has a stepdaughter, Alexia Barroso (b. 1998), from Barroso's previous marriage. Since 2012, they have lived in Pacific Palisades, Los Angeles; they previously lived in Miami and New York.In 2018, he bought a luxury penthouse in Brooklyn Heights.Damon is a fan of the Boston Red Sox. After the team won the 2007 World Series, he narrated the commemorative DVD release of the event. He has competed in several World Series of Poker (WSOP) events, including the 2010 World Series of Poker main event. He was eliminated from the 1998 WSOP by poker professional Doyle Brunson.", "Awards and honors": "Aside from awards he has garnered for his role as actor and producer, Damon became the 2,343rd person to receive a star on the Hollywood Walk of Fame on July 25, 2007. He reacted to the award by stating: \"A few times in my life, I've had these experiences that are just kind of too big to process and this looks like it's going to be one of those times.\"", "Filmography": "", "Notes": "", "References": "", "Further reading": "Altman, Sheryl and Berk, Sheryl. Matt Damon and Ben Affleck: On and Off Screen. HarperCollins Publishers, 1998. ISBN 0-06-107145-5.\nBego, Mark. Matt Damon: Chasing a Dream. Andrews Mcmeel Pub, 1998. ISBN 0-8362-7131-9.\nDiamond, Maxine and Hemmings, Harriet. Matt Damon a Biography. Simon Spotlight Entertainment, 1998. ISBN 0-671-02649-6.\nNickson, Chris. Matt Damon: An Unauthorized Biography. Renaissance Books, 1999. ISBN 1-58063-072-3.", "External links": "Matt Damon on IMDb \nMatt Damon at Box Office Mojo\nMatt Damon at People.com"}