{"_id": "97", "name": "Jon Favreau", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:24", "biography": "Jonathan Favreau (; born October 19, 1966) is an American actor, director, producer, and screenwriter. He is known for his work with the Marvel Cinematic Universe, directing and starring as Happy Hogan in the films Iron Man (2008) and Iron Man 2 (2010), as well as serving as an executive producer and/or starring in The Avengers (2012), Iron Man 3 (2013), Avengers: Age of Ultron (2015), Spider-Man: Homecoming (2017), Avengers: Infinity War (2018), Avengers: Endgame, and Spider-Man: Far From Home (both 2019) and also directing and starring as Carl Casper in  Chef (2014).\nFavreau is further known for directing the films Elf (2003), Zathura: A Space Adventure (2005), Cowboys & Aliens (2011), The Jungle Book (2016), and The Lion King (2019). He produces films under his production company banner, Fairview Entertainment.\nFavreau has starred in the films Rudy (1993), Swingers (1996, which he also wrote), Very Bad Things (1998), The Replacements (2000), Daredevil (2003), The Break-Up (2006), Couples Retreat (2009), and Chef (2014), which he also wrote and directed. He also portrayed Pete Becker on the television sitcom Friends.", "Early life": "Favreau was born in Flushing, Queens, New York, the son of Madeleine, an elementary school teacher who died of leukemia in 1979, and Charles Favreau, a special education teacher. His mother was Jewish (of Russian Jewish descent), and his father is a Catholic of Italian and French-Canadian ancestry. Favreau attended Hebrew school and had a Bar Mitzvah ceremony.Favreau graduated from The Bronx High School of Science, a school for gifted students, in 1984 and attended Queens College from 1984 to 1987, before dropping out. His friend from college, Mitchell Pollack, said that Favreau went by the nickname \"Johnny Hack\" because of his talent in the game Hacky Sack. He briefly worked for Bear Stearns on Wall Street before returning to Queens College for a semester in early 1988. He dropped out of college for good (a few credits shy of completing his degree), and in the summer of 1988, moved to Chicago to pursue a career in comedy. He performed at several Chicago improvisational theaters, including the ImprovOlympic and the Improv Institute.", "Career": "=== 1992–2000: Early career ===\nWhile in Chicago, Favreau landed his first film role alongside Sean Astin as football tutor D-Bob in the sleeper hit Rudy (1993). Favreau met Vince Vaughn – who played a small role in this film – during shooting. The next year, he appeared in the college film PCU alongside Jeremy Piven, in the 1994 episode of Seinfeld titled \"The Fire\" he appeared as Eric the Clown.Favreau then moved to Los Angeles, where he made his breakthrough in 1996 as an actor-screenwriter with the film Swingers, which was also Vaughn's breakthrough role as the character Trent Walker, a foil to Favreau's heartbroken Mike Peters. In 1997, he appeared on the television sitcom Friends, portraying Pete Becker – Monica Geller's millionaire boyfriend who competes in the Ultimate Fighting Championship (UFC) – for several episodes. Favreau made appearances in the sketch-comedy series, Tracey Takes On... in both 1996 and 1997.He rejoined Piven in 1998 as part of Very Bad Things (1998). In 1999, he starred in the television film Rocky Marciano, based on the life of world heavyweight champion, Rocky Marciano. He later appeared in Love & Sex (2000), co-starring Famke Janssen. Favreau appeared in 2000's The Replacements as maniacal linebacker Daniel Bateman, and that same year he played himself in The Sopranos episode \"D-Girl\", as a Hollywood director who feigns interest in developing mob associate Christopher Moltisanti's screenplay in order to collect material for his own screenplay.\n\n\n=== 2001–2015: Actor–director ===\n\nIn 2001, he made his film directorial debut with another self-penned screenplay, Made. Made once again teamed him up with his Swingers co-star Vince Vaughn.\nHe was a guest-director for an episode of the college dramedy Undeclared in 2001, and Favreau got some screen time as lawyer Foggy Nelson in the 2003 movie Daredevil (2003) (considerably more in the Director's Cut version). He also starred in The Big Empty (2003), directed by Steve Anderson. His character was John Person, an out of work actor given a strange mission to deliver a blue suitcase to a man named Cowboy in the desert.In the fall of 2003, he scored his first financial success as a director of the hit comedy Elf starring Will Ferrell, Zooey Deschanel, James Caan, and Peter Dinklage. Also in 2003, Favreau had a small part in Something's Gotta Give (a film starring Diane Keaton and Jack Nicholson); Favreau played Leo, Harry Sanborn's (Nicholson) personal assistant, who visited Harry in the hospital. In 2005, Favreau directed the film adaptation of Zathura. Favreau continued to make regular appearances in film and television. He reunited with friend Vince Vaughn in the romantic comedy The Break-Up and appeared in My Name Is Earl as a reprehensible fast food manager. Favreau also made a guest appearance in Vaughn's Wild West Comedy Show.Also in 2005, Favreau appeared as a guest judge and executive representative of Sony Corporation in week five of NBC primetime reality TV business show, The Apprentice. He was called upon to judge the efforts of the show's two teams of contestants, who were assigned the task of designing and building a float to publicize his 2005 Sony Pictures movie, Zathura: A Space Adventure.Favreau also has a TV series called Dinner for Five, which airs on the cable TV channel IFC. On April 28, 2006, it was announced that Favreau was signed to direct the long-awaited Iron Man movie. Released on May 2, 2008, the film was a huge critical and commercial success, solidifying Favreau's reputation as a director.Iron Man was the first Marvel-produced movie under their alliance with Paramount, and Favreau served as the director and an executive producer. During early scenes in Iron Man, Favreau appears as Tony Stark's driver, Happy Hogan. He also wrote two issues of a planned mini-series for Marvel Knights titled Iron Man: Viva Las Vegas, that debuted in September 2008 before being canceled in November 2008. Favreau also directed the film's sequel, Iron Man 2. in 2008 he played Denver, a bully-type bigger brother to Vince Vaughn in Four Christmases.\n\nFavreau was the third director attached to John Carter, the film adaptation of Edgar Rice Burroughs' swashbuckling space hero. While he did not ultimately direct it, he did appear in a cameo in the film, as a bookie.\nFavreau co-starred in 2009's Couples Retreat, a comedy chronicling four couples who partake in therapy sessions at a tropical island resort, which he also wrote. The film saw him reunited with co-star Vince Vaughn, and Kristin Davis played his wife.He voices the character Pre Vizsla, the leader of the Mandalorian Death Watch, in the episodes of the animated series Star Wars: The Clone Wars.Favreau said in December 2010 that he would not direct Iron Man 3. He also remained an executive producer of director Joss Whedon's The Avengers.In July 2011, Favreau was featured in a YouTube video by visual effects artists Freddie Wong and Brandon Laatsch (known on YouTube as the popular channel, \"freddiew\"), in a spoof of his then-upcoming summer film, Cowboys & Aliens. He lent the movie's gauntlet prop to Wong & Laatsch for use in the short.\n\nFavreau directed the pilot for the NBC show Revolution, and also served as one of the show's executive producers, alongside J. J. Abrams.In 2013, he filmed a pilot for a TV series based on the novel About a Boy, but set in San Francisco. He also directed the Destiny trailer \"The Law of the Jungle\".\n\n\n=== 2016–present: Continued success ===\nIn 2016, Favreau directed and produced the live-action adaptation of The Jungle Book, for Walt Disney Pictures, which was released on April 15, 2016 to critical and commercial acclaim. He returned as Happy Hogan in the film Spider-Man: Homecoming (2017), and co-executive produced Avengers: Infinity War (2018). Favreau filmed a scene for Avengers: Infinity War, but was cut, ending up on the Blu-Ray release. In 2017, Favreau directed the pilot episode of CBS' Young Sheldon.In the 2019 film Avengers: Endgame, Favreau reprised his role as Happy Hogan in a cameo near the end of the film. The film, directed by the Russo brothers, was executive-produced by Favreau. Avengers: Endgame was released on April 26, 2019.\nFavreau also appeared in the sequel to Homecoming, Spider-Man: Far From Home.In September 2016, it was reported that Favreau would direct a CGI adaptation of Disney's The Lion King, marking his first time directing a musical. Donald Glover voiced Simba, and James Earl Jones reprised his role as Mufasa from the original film. The film was released in July 2019. On July 29, The Lion King surpassed The Jungle Book to become the highest-grossing film of Favreau's career, while also surpassing the original film.In May 2019, it was also announced that Favreau would co-host and executive produce a cooking show for Netflix along with co-host Roy Choi, called The Chef Show. It premiered in June 2019.\n\n\n=== Future projects ===\nOn March 8, 2018, Lucasfilm announced that Favreau will executive produce and write a live-action Star Wars television series, titled The Mandalorian, for Disney+.In April 2016, it was reported that Favreau will return to direct the sequel to The Jungle Book, his critically acclaimed live-action adaptation of the animated film of the same name. Early pre-production of the sequel had begun by June 12, 2018, with Justin Marks, who wrote the previous film, having ended an early draft for the film.In May 2019, it was announced that Favreau would produce the documentary series Prehistoric Planet alongside the BBC Natural History Unit for Apple TV+.", "Unreleased projects": "A motion-captured animated film titled Neanderthals was in development at Sony Pictures Animation in the mid-2000s that Favreau would've wrote and produce, but the project was cancelled sometime in 2008 after four years in development.\nIn November 2010, it was reported that Favreau will direct a film entitled Magic Kingdom, based on The Walt Disney Company's theme park of the same name. In July 2012, Favreau reported officially that he was working on the film. In 2014, he stated that he still had interest in the project, and that he could direct it after finishing filming The Jungle Book.In November 2012, it was said that Favreau was being considered to direct Star Wars: The Force Awakens, along with David Fincher, Matthew Vaughn and Ben Affleck; but J.J. Abrams was selected to direct the film. However, in June 2015, Favreau stated that although he would not be working on the Star Wars anthology films, he could work on future Star Wars movies at some point.On September 28, 2013, Mental Floss reported that at one moment, Favreau tried to direct a sequel to his famous film Elf, entitled Elf 2: Buddy Saves Christmas, but it was later cancelled. In December 2013, Will Ferrell stated that he didn't want to make a sequel to Elf. Despite this, during an interview in January 2016, Favreau stated that a sequel could possibly be made. The next month however, Ferrell reiterated that it's unlikely that the sequel will happen and that he still didn't want to return to the role.", "Personal life": "Favreau married physician Joya Tillem on November 24, 2000. The couple has a son (Max Favreau, who appears in Iron Man 2) and two daughters. Tillem is the niece of lawyer/talk show host Len Tillem.Favreau credits the role-playing game Dungeons & Dragons with giving him \"a really strong background in imagination, storytelling, understanding how to create tone and a sense of balance.\"", "Filmography": "", "Awards and recognition": "In May 2019, it was announced that Favreau will be named a Disney Legend at the 2019 D23 Expo for his outstanding contributions to The Walt Disney Company.", "References": "", "External links": "Jon Favreau on IMDb \nJon Favreau's Guest DJ Project on KCRW KCRW Guest DJ set"}