{"_id": "30", "name": "Josh Brolin", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:36", "biography": "Joshua James Brolin (; born February 12, 1968) is an American actor. Brolin has appeared in films such as The Goonies (1985), Mimic (1997), Hollow Man (2000), Grindhouse (2007), No Country for Old Men (2007), American Gangster (2007), W. (2008), Milk (2008), True Grit (2010), Men in Black 3 (2012), Inherent Vice (2014), Sicario (2015), Hail, Caesar! (2016), and Deadpool 2 (2018).\nBrolin began portraying the role of Marvel Comics super villain Thanos in the Marvel Cinematic Universe, making his first appearance in Guardians of the Galaxy (2014). He appears in another mid-credits scene in Avengers: Age of Ultron (2015). He reprised the role in both Avengers: Infinity War (2018) and Avengers: Endgame (2019).\nBrolin has been nominated for the Academy Award, Screen Actors Guild Award, Critics' Choice Movie Awards and Independent Spirit Awards.", "Early life": "Brolin was born in Santa Monica, California, the son of Jane Cameron (Agee), a wildlife activist who was a native of Corpus Christi, Texas, and actor James Brolin. Brolin was raised on a ranch in Templeton, California, with little exposure to his father's acting career. His parents divorced in 1984, when he was 16 years old.\nBrolin said in a 2014 interview that during his teenage years, he was a member of a surfing friendship group who called themselves the \"Cito Rats\". In his description of the group, he stated: \"It was Santa Barbara. It was the '80s. It was punk rock. You either had the children of rich, neglectful parents or children of poor, neglectful parents, so it was a mix. But we basically grew up the same way. I've never seen a group like that before or since.\" He admitted to stealing cars to pay for his drug use, which included heroin, a drug that he explained he did not like: \"I mean, I never got into it and I never died from it, which is a good thing. I've had 19 friends who died. Most of those guys I grew up with, they're all dead now.\"", "Career": "=== Acting ===\n\nBrolin started his career in TV films and guest roles on TV shows before getting a more notable role as Brand Walsh in the Richard Donner-directed film The Goonies (1985). He was considered for the role of Tom Hanson in the series 21 Jump Street; he and Johnny Depp were the finalists for the role, and at that time the two became close and remained friends. The role was ultimately awarded to Depp. Brolin guest-starred in an episode of the show in its first season.Brolin implied that he turned away from film acting for years after the premiere of his second film, Thrashin', where he witnessed what he called \"horrendous\" acting on his part. For several years, he appeared in stage roles in Rochester, New York, often alongside mentor and friend Anthony Zerbe. One of Brolin's more prominent roles early in his career was that of \"Wild Bill\" Hickok in the ABC western TV series The Young Riders, which lasted three seasons (1989–92). Two other TV series he was involved in include the Aaron Spelling production Winnetka Road (1994) and Mister Sterling (2003), both of which were cancelled after a few episodes.\n\nBrolin's extensive film work consists of many villainous roles in late-2000s/early-2010s films, including Planet Terror (one of two feature-length segments of the Quentin Tarantino/Robert Rodriguez collaboration Grindhouse), Gus Van Sant's Milk, American Gangster, and Oliver Stone's Wall Street: Money Never Sleeps. He also played the lead role in the Coen brothers' Academy Award-winning film No Country for Old Men.\nBrolin also starred in another Oliver Stone film in 2008 called W., a biopic about key events in the life of President George W. Bush. Stone pursued an initially hesitant Brolin for the role. He said of his decision to cast Brolin in the leading role:\nBrolin received an Oscar nomination for Best Supporting Actor for his role in Gus Van Sant's biopic Milk as city supervisor Dan White, who assassinated San Francisco Supervisor Harvey Milk and Mayor George Moscone. He made news by wearing a White Knot to the Academy Awards ceremony to demonstrate solidarity with the marriage equality movement. Brolin told an interviewer that co-star Sean Penn, who portrayed Milk, decided to dispel any nerves the actors had about playing gay men by grabbing the bull by the horns. At the first cast dinner, which included castmates James Franco, Emile Hirsch and Diego Luna, Brolin said, \"[Penn] walked right up and grabbed me and planted a huge one right on my lips.\" Brolin has received critical acclaim for his performance and, in addition to his Oscar nomination, received NYFCC and NBR Awards for Best Supporting Actor and a nomination for a SAG Award for Outstanding Performance by a Male Actor in a Supporting Role.\nIn 2010, Brolin portrayed the titular character in Jonah Hex, based on the DC Comics' character with the same name. Brolin later played the younger version of Tommy Lee Jones's character Kevin Brown / Agent K in Men in Black 3 (2012), and in 2013 starred in the film Gangster Squad, portraying a fictional WWII Veteran named John O'Mara.Brolin was one of the actors who was considered for the role of Bruce Wayne / Batman in the DC Extended Universe, a deal which would have begun with Zack Snyder's Batman v Superman: Dawn of Justice, but Ben Affleck was chosen for the role instead. The following year, it was announced that Brolin would play Thanos within the Marvel Cinematic Universe. He portrays the character through motion capture performance, as well as voice acting. He cameoed as the character in Guardians of the Galaxy (2014) and Avengers: Age of Ultron (2015), and then reprised Thanos in a starring role in Avengers: Infinity War (2018) and 2019's Avengers: Endgame, which were filmed back-to-back.In April 2017, Brolin signed a four-film contract with 20th Century Fox studios to portray the Marvel Comics character Nathan Summers / Cable in the X-Men film series. 2018's Deadpool 2 is his first installment within that contract. He is set to reprise his role in Fox's planned X-Force movie.\n\n\n=== Writing and directing ===\nIn 2009, Brolin executive produced and performed in The People Speak, a documentary feature film that uses dramatic and musical performances of the letters, diaries, and speeches of everyday Americans, based on historian Howard Zinn's A People's History of the United States.Brolin wrote and directed the short film X, as his directorial debut. The film, about an inmate who escapes prison to reunite with his daughter and search for her murdered mother, was the opening film at the first annual Union City International Film Festival in Union City, New Jersey in December 2010.", "Personal life": "=== Marriages and family ===\n\nBrolin was married to actress Alice Adair from 1988 until 1994; they have two children. He was engaged to actress Minnie Driver for six months. He married actress Diane Lane on August 15, 2004. Brolin and Lane divorced in 2013. In March 2015, Brolin became engaged to his former assistant and model Kathryn Boyd. The couple married on September 24, 2016 and announced on May 29, 2018 that they are expecting their first child together. Brolin announced through Instagram on November 4, 2018 that Boyd had given birth to their daughter and first child together, Westlyn Reign Brolin.\n\n\n=== Legal issues ===\nOn December 20, 2004, Brolin's wife at the time, Diane Lane, called the police after an altercation with him, and he was arrested on a misdemeanor charge of domestic battery. Lane declined to press charges and the couple's spokesman characterized the incident as a misunderstanding.On July 12, 2008, Brolin was arrested after an altercation at the Stray Cat Bar in Shreveport, Louisiana, along with actor Jeffrey Wright and five other men who were crew members of W. Brolin was released after posting a cash bond of $334. Brolin said to a reporter, \"It was nice to be in jail knowing that I hadn't done anything wrong. And it was maddening to be in jail knowing that I hadn't done anything wrong.\" Charges against all seven men were later dropped by Shreveport prosecutors.Brolin was arrested for public intoxication on New Year's Day, 2013 in Santa Monica, California. The remainder of 2013 proved very difficult for him, and he later explained: \"Well, it was another turning point. It made me think of a lot of things. My mom dying when I was in my 20s. All the impact that had on me that I hadn't moved past; I was always such a momma's boy. But I realized that I was on a destructive path. I knew that I had to change and mature.\"\n\n\n=== Business interests ===\nBrolin commenced in stock trading in his mid-20s and briefly considered quitting acting. In 2014, he explained he made a large amount of money over a three-year period: \"Fear and greed, that's all that there is. And I traded very specifically. I found momentum stocks that had room to breathe and I just grab a little of the breath.\" He was also co-founder of a now defunct stock trading website.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Stage ===", "Awards and nominations": "", "Notes": "", "References": "", "External links": "Josh-Brolin.com\nJosh Brolin on IMDb \nJosh Brolin at AllMovie"}