{"_id": "81", "name": "Benedict Wong", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:06", "biography": "Benedict Wong (born 3 July 1971) is an English actor who has appeared on film, television, and stage. Wong is known for portraying Kublai Khan in Netflix's Marco Polo (2014–2016) and Bruce Ng in The Martian (2015).\nWong portrays Wong in the Marvel Cinematic Universe, making his first appearance in Doctor Strange (2016) and later in Avengers: Infinity War (2018) and Avengers: Endgame (2019).", "Early life and education": "Wong was born in Eccles, Lancashire, England, to parents who had emigrated from Hong Kong to the United Kingdom via Ireland. He was brought up in Salford and is a supporter of Manchester United. He attended De La Salle 6th form college on Weaste Lane, Salford after leaving high school. He took a two-year performing arts course at Salford City College.", "Career": "His first role was in a 1993 BBC Radio play called Kai Mei Sauce, written by Kevin Wong. He appeared as Errol Spears alongside Sean Lock in the situation comedy 15 Storeys High, and as Franklin Fu in the second series of Look Around You.In 2007, Wong starred in the feature film Grow Your Own.Wong went on to appear in the second episode of Series 4 of the Channel 4 comedy The IT Crowd, playing the character Prime, a previous Countdown contestant who had won the sixteenth Countdown teapot when he was known as Harold Tong. Wong also appeared in the film Shanghai playing the character Juso Kita and the BBC series Spirit Warriors in the role of Li.In 2012, Wong appeared in the Ridley Scott film Prometheus as ship's pilot Ravel.In 2013, Wong was cast in the lead role of #aww: The Arrest of Ai WeiWei at the Hampstead Theatre. Shortly after, the Almeida Theatre announced that Wong had joined the cast of the play Chimerica.Also in 2013, Wong played the role of gangster Lau in the BBC Two comedy-drama The Wrong Mans.In 2014, Wong played the role of Kublai Khan in the Netflix series Marco Polo, which on 7 January 2015 was renewed by Netflix for a 10-episode second series.\nThe next year, he appeared in another Ridley Scott science fiction film, playing the director of the Jet Propulsion Lab, Bruce Ng in The Martian. In 2016, he co-starred as Wong in the superhero film Doctor Strange and reprised the role in the crossover film Avengers: Infinity War. He again reprised his role in Avengers: Endgame.In 2016, he appeared in \"Hated in the Nation\", an episode of the anthology series Black Mirror, playing Shaun Li, an agent with the National Crime Agency.\nIn 2017, he voiced the character of Alex Yu in Arkane Studios's game, Prey. He also starred in \"2036: Nexus Dawn\", a promotional short film prequel to Blade Runner 2049 directed by Luke Scott and co-starring Jared Leto.\nHe appeared as the scientist Lomax in the 2018 science fiction horror film Annihilation.", "Awards": "In 2003, Wong was nominated at the British Independent Film Awards for Best Supporting Actor for his role as Guo Yi in Dirty Pretty Things.In 2013, Wong was nominated for the West End Frame award for Best Dramatic Performance 2013, for his role as Zhang Lin in Chimerica.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===\n\n\n=== Theatre ===", "References": "", "External links": "Benedict Wong on IMDb"}