{"_id": "31", "name": "Jim Carrey", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:36", "biography": "James Eugene Carrey (born January 17, 1962) is a Canadian-American actor, comedian, writer, musician, and artist. He is known for his energetic slapstick performances.Carrey first gained recognition in America in 1990 after landing a recurring role in the sketch comedy television series In Living Color. His first leading roles in motion pictures came with Ace Ventura: Pet Detective (1994), Dumb and Dumber (1994), The Mask (1994), and Ace Ventura: When Nature Calls (1995), as well portraying the Riddler in Batman Forever (1995) and the lead role in Liar Liar (1997). He gained attention starring in serious roles in The Truman Show (1998) and Man on the Moon (1999), with each garnering him a Golden Globe Award for Best Actor.\nIn the 2000s, he gained further notice for his portrayal of the Grinch in How the Grinch Stole Christmas and for the comedy Me, Myself & Irene (both in 2000), as well as Bruce Almighty (2003), Eternal Sunshine of the Spotless Mind (2004) for which he was nominated for the BAFTA Award for Best Actor in a Leading Role, Lemony Snicket's A Series of Unfortunate Events (2004), Fun with Dick and Jane (2005), Yes Man (2008), Horton Hears a Who! (2008) and A Christmas Carol (2009).\nIn the 2010s, he starred in Mr. Popper's Penguins (2011), The Incredible Burt Wonderstone (2013), Kick-Ass 2 (2013), and reprised his role as Lloyd Christmas in Dumb and Dumber To (2014). Since 2018, he has portrayed Jeff Piccirillo in the Showtime series Kidding, and is set to portray Dr. Robotnik in the live action Sonic the Hedgehog (2020) film.", "Early life": "Carrey was born in the Toronto suburb of Newmarket, Ontario, Canada, to Kathleen (née Oram), a homemaker, and Percy Carrey, a musician and accountant. He was raised a Roman Catholic and has three older siblings: John, Patricia, and Rita. His mother was of French, Irish, and Scottish descent and his father was of French-Canadian ancestry (the family's original surname was Carré).At age 10, Carrey wrote a letter to Carol Burnett of the Carol Burnett Show pointing out that he was already a master of impressions and should be considered for a role on the show; he was overjoyed when he received a form letter reply.Carrey lived in Scarborough, Ontario, in a small building next to a wheel factory and attended Grade 10 at Agincourt Collegiate Institute, North York (attended Blessed Trinity Catholic Elementary School) and Burlington, Ontario for eight years, and attended Aldershot High School. In a Hamilton Spectator interview (February 2007), Carrey said, \"If my career in show business hadn't panned out I would probably be working today in Hamilton, Ontario, at the Dofasco steel mill.\" When looking across the Burlington Bay toward Hamilton, he could see the mills and thought, \"Those were where the great jobs were.\"", "Career": "=== Early work ===\nWhile Carrey was struggling to obtain work and make a name for himself, his father tried to help the young comedian put together a stage act, driving him to Toronto to debut at comedy club Yuk Yuk's. Carrey's impersonations bombed and this gave him doubts about his capabilities as a professional entertainer. His family's financial struggles made it difficult for them to support Carrey's ambitions.Eventually, the family's financial problems were resolved and they moved into a new home. With more domestic stability, Carrey returned to the stage with a more polished act. In a short period of time, he went from open-mic nights to regular paid shows, building his reputation in the process. A reviewer in the Toronto Star raved that Carrey was \"a genuine star coming to life\". Carrey was soon noticed by comedian Rodney Dangerfield, who signed the young comic to open his tour performances. Dangerfield eventually brought Carrey to Las Vegas. However, Carrey soon decided to move to Hollywood, where he began performing at The Comedy Store and, in 1982, appeared on the televised stand-up show An Evening at the Improv. The following year, he debuted his act on The Tonight Show.Despite his increasing popularity as a stand-up comic, Carrey turned his attention to the film and television industries, auditioning to be a cast member for the 1980–81 season of NBC's Saturday Night Live. Carrey was not selected for the position, although he later hosted the show in May 1996, January 2011, and October 2014. In 1984, Carrey was in the short-lived sitcom The Duck Factory.From 1990 to 1994, Carrey was a regular cast member of the ensemble comedy television series In Living Color.\n\n\n=== 1994–1997: Rise to fame ===\nCarrey played the lead roles in Ace Ventura: Pet Detective, The Mask, and Dumb and Dumber (all 1994). Dumb and Dumber was a commercial success, grossing over $270 million worldwide, He received his first Golden Globe Award nomination for Best Actor for his work in The Mask.\n\nCarrey portrayed the Batman villain The Riddler in the Joel Schumacher-directed superhero film Batman Forever (1995). The film received mixed reviews, but was a box office success. He reprised his role as Ace Ventura in Ace Ventura: When Nature Calls which was also released in 1995. Like the original film, it was well received by the public, but poorly received by critics. It was a huge box-office success, earning $212 million worldwide in addition to breaking records, with a $40 million opening weekend.Carrey earned $20 million for his next film, The Cable Guy (1996). Directed by Ben Stiller, the film was a satirical black comedy, in which Carrey played a lonely, menacing cable TV installer who infiltrates the life of one of his customers (played by Matthew Broderick). The role was a departure from the \"hapless, hyper, overconfident\" characters he had been known for. However, it did not fare well with most critics, many reacting to Carrey's change of tone from previous films. Carrey also starred in the music video of the film's closing song, \"Leave Me Alone\" by Jerry Cantrell. Despite the reviews, The Cable Guy grossed $102 million worldwide.He soon bounced back with the critically acclaimed comedy Liar Liar (1997), playing Fletcher Reede, an unethical lawyer rendered unable to lie by his young son's birthday wish. Carrey was praised for his performance, earning a second Golden Globe Award nomination for Best Actor. Janet Maslin of The New York Times said: \"Well into his tumultuous career, Mr. Carrey finally turns up in a straightforward comic vehicle, and the results are much wilder and funnier than this mundane material should have allowed.\"\n\n\n=== 1998–2006: Critical acclaim ===\nThe following year he decided to take a pay cut to play the serious role of Truman Burbank in the satirical comedy-drama film The Truman Show (1998). The film was highly praised and brought Carrey further international acclaim, leading many to believe he would be nominated for an Oscar. Eventually, he did pick up his first Golden Globe Award for Best Actor in a Motion Picture Drama. The Truman Show was a commercial success also, earning $264 million worldwide against a budget of $60 million.A Film4 critic stated that the film \"allows Carrey to edge away from broad comedy\", adding that it was \"a hilarious and breathtakingly conceived satire\".That same year, Carrey appeared as a fictionalized version of himself on the final episode of Garry Shandling's The Larry Sanders Show, in which he deliberately ripped into Shandling's character. In 1999, Carrey had the lead role in Man on the Moon. He portrayed comedian Andy Kaufman to critical acclaim and received his second Golden Globe in a row. In addition, he received his first Screen Actors Guild Award nomination for Best Actor.In 2000, Carrey reteamed with the Farrelly brothers, who had previously directed him in Dumb and Dumber, for the black comedy film Me, Myself & Irene, a film that received mixed reviews but enjoyed box office success. Carrey played the role of state trooper Charlie Baileygates, who has multiple personalities and romances a woman portrayed by Renée Zellweger. That same year, Carrey starred in the second highest-grossing Christmas film of all time, How the Grinch Stole Christmas, playing the title character, for which he received both praise and criticism from critics alongside a Golden Globe nomination.For his next feature film, Carrey starred opposite Jennifer Aniston and Morgan Freeman in Tom Shadyac's international hit comedy Bruce Almighty (2003). Carrey played a TV newsman who unexpectedly receives God's omnipotent abilities when the deity decides to take a vacation. The film received mixed reviews upon release but despite this still became a financial success, earning over $484 million worldwide, and going on to become the seventeenth highest-grossing live action comedy of all time.In 2004, Carrey starred in Eternal Sunshine of the Spotless Mind. The film received overwhelming acclaim upon release. Critics highly praised Carrey's portrayal of Joel Barish, in addition to the performance of his co-star Kate Winslet, who received an Oscar nomination. According to CNN's reviewer Paul Clinton, Carrey's performance was the actor's \"best, most mature and sharply focused performance ever\". Carrey received another Golden Globe nomination and his first BAFTA Award nomination for Best Actor.\n\nCarrey's next appearance was in the 2004 black comedy fantasy film Lemony Snicket's A Series of Unfortunate Events, which was based on the popular children's novels of the same name. The film was positively received; Desson Thomson from The Washington Post said of Carrey's approach to the character of Count Olaf,Olaf is a humorless villain in the book. He's not amusing like Carrey at all. To which I would counter: If you can't let Carrey be Carrey, put someone boring and less expensive in the role. In his various disguises he's rubbery, inventive and improvisationally inspired. I particularly liked his passing imitation of a dinosaur. That same year, Carrey was inducted into the Canadian Walk of Fame.\n\n\n=== 2007–present ===\nCarrey reunited with Joel Schumacher, director of Batman Forever, for The Number 23 (2007), a psychological thriller co-starring Virginia Madsen and Danny Huston. In the film, Carrey plays a man who becomes obsessed with the number 23, after finding a book about a man with the same obsession. The film was panned by critics. The following year Carrey provided his voice for Dr. Seuss' Horton Hears a Who! (2008). Carrey voiced the beloved elephant for the CGI-animated feature, which received overwhelmingly positive reviews and delivered family crowds en masse. The film was also a box office success, raking in over $290 million worldwide.Carrey returned to live-action comedy, starring opposite Zooey Deschanel and Bradley Cooper in Yes Man (also 2008). Carrey played a man who signs up for a self-help program that teaches him to say yes to everything. Despite reviews being mixed, Rene Rodriquez of The Miami Herald stated, \"Yes Man is fine as far as Jim Carrey comedies go, but it's even better as a love story that just happens to make you laugh.\" The film had a decent performance at the box office, earning $225 million worldwide.Since 2009, Carrey's work has included a leading role in Glenn Ficarra and John Requa's I Love You Phillip Morris, premiering in January 2009 at the Sundance Film Festival before receiving a wide release in February 2010. Carrey portrayed Steven Jay Russell, a con artist, imposter, and multiple prison escapee who falls in love with his fellow inmate, Phillip Morris (played by Ewan McGregor). The film received largely positive reviews, with Damon Wise of The Times giving the film four stars out of five, stating, \"I Love You Phillip Morris is an extraordinary film that serves as a reminder of just how good Carrey can be when he's not tied into a generic Hollywood crowd-pleaser. His comic timing remains as exquisite as ever.\"\n\nFor the first time in his career, Carrey portrayed multiple characters in Disney's 3D animated take on the classic Charles Dickens tale, A Christmas Carol (2009), voicing Ebenezer Scrooge and the Ghosts of Christmas Past, Present, and Future. Directed by Robert Zemeckis, the film also starred Robin Wright Penn, Bob Hoskins, Colin Firth, Gary Oldman, and Cary Elwes. The film received decent reviews and was a financial success. Carrey landed the lead role in Mr. Popper's Penguins (2011), playing Thomas \"Tom\" Popper Jr. a realtor who becomes the caretaker of a family of penguins. The film received a mixed reception upon release.He starred alongside former co-star Steve Carell in the Don Scardino-directed comedy film The Incredible Burt Wonderstone (2013). Carrey played Steve Gray, a dangerous street magician who overshadows the formerly successful magician Burt Wonderstone (played by Carell). The film was released in March 2013 to mixed reviews and underperformed significantly at the box office, grossing just over $27 million on a $30 million budget.Around the same time, he appeared in Kick-Ass 2 (also 2013) as Colonel Stars and Stripes. He retracted support for the film two months prior to its release. He issued a statement via his Twitter account that, in light of the shootings at Sandy Hook Elementary, \"Now in all good conscience I cannot support that level of violence.\"Peter Farrelly said in April 2012 that Carrey and Jeff Daniels would return for a Dumb and Dumber sequel, Dumb and Dumber To, with the Farrelly brothers writing and directing and a planned September 2012 production start. In June, however, Carrey's representative said Carrey had left the project because the comedian felt New Line and Warner Bros. were unenthusiastic toward it. However, on October 1, 2012, Yahoo!'s \"The Yo Show\" carried the news item that the script was complete and that the original actors, Carrey and Daniels, would be reprising their roles. The plot involved one of the characters having sired a child and needing to find them in order to obtain a kidney. Dumb and Dumber To was released in November 2014.\nIn March 2013, Carrey announced that he had written a children's book titled How Roland Rolls, about a scared wave named Roland. He described it as \"kind of a metaphysical children's story, which deals with a lot of heavy stuff in a really childish way.\" Carrey self-published the book, which was released in September 2013.On March 25, 2013, Carrey released a parody music video with Eels through Funny or Die, with Carrey replacing Mark Oliver Everett on vocals. The song and video, titled \"Cold Dead Hand\" and set as a musical act during the variety program Hee Haw, lampoons American gun culture, and specifically former NRA spokesperson Charlton Heston.Carrey delivered the commencement address at Maharishi University of Management in Fairfield, Iowa, in May 2014 and received an honorary doctorate for his achievements as a comedian, artist, author, and philanthropist.Carrey was a producer on Rubble Kings, a 2015 documentary film that depicts events preceding and following the Hoe Avenue peace meeting.On August 29, 2014, Carrey was honoured by Canada Post with a limited-edition postage stamp with his portrait on it.In June 2017 Showtime began airing the dramedy I'm Dying Up Here, for which Carrey served as the executive producer. The show, which chronicles a group of stand-up comics in 1970s Los Angeles, incorporates aspects of Carrey's own experience. In September of that year, that same network announced that he would be starring in a comedy series titled Kidding, which will reunite Carrey and director Michel Gondry. By the end of 2017, it was announced that Catherine Keener would star opposite Carrey in Kidding.Carrey was also the subject of two documentaries in 2017. The first, a short subject entitled I Needed Color about his lifelong passion for art, was released online in the summer. Later that year another documentary, Jim & Andy: The Great Beyond — Featuring a Very Special, Contractually Obligated Mention of Tony Clifton, premiered at The Venice Film Festival and was later picked up by Netflix. The film chronicles the behind-the-scenes drama during the shooting of Man on the Moon, when he never broke character as Andy Kaufman. It incorporates footage that was shot for the film's electronic press kit but ultimately pulled by Universal as they felt that it was too damaging.", "Personal life": "Carrey suffers from depression and has taken Prozac to combat the symptoms. He has stated that he no longer takes medications or stimulants of any kind, including coffee.Carrey received U.S. citizenship in October 2004 and remains a dual citizen of the United States and his native Canada.\n\n\n=== Relationships ===\n\nCarrey has been married twice. His first marriage was to former actress and Comedy Store waitress Melissa Womer, whom he married on March 28, 1987. Their daughter, Jane Erin Carrey, was born September 6, 1987. Jane was a 2012 contestant on American Idol. Carrey and Womer divorced in 1995.A year later, on September 23, 1996, Carrey married his Dumb and Dumber co-star Lauren Holly; the marriage lasted less than a year. In the late 1990s and early 2000s, Carrey had a much-publicized, short-lived romance with his Me, Myself and Irene co-star Renée Zellweger, to whom he was engaged from 1999 to 2000.Carrey met model and actress Jenny McCarthy in 2005 and made their relationship public in June 2006. In April 2010, the two ended their relationship. Despite the split and media circulations, in October 2010 McCarthy said, \"Jim and I are still good friends\".On September 28, 2015, Carrey's former girlfriend Cathriona White, a native of County Tipperary, Ireland, was found dead from a prescription drug overdose in a suspected suicide. The couple first met in 2012. Carrey was a pallbearer at her funeral in Cappawhite.Almost a year later, Carrey attended Golden Globes 2019 Party with his new girlfriend Ginger Gonzaga in January 2019.\n\n\n=== Wrongful death lawsuits ===\nOn September 19, 2016, Mark Burton, Carrey's ex-girlfriend Cathriona White's husband from 2013 until her death, filed a wrongful death lawsuit against Carrey, claiming that he had used his \"immense wealth and celebrity status\" to illegally obtain and distribute prescription drugs involved in her death. Carrey released a statement the following day: What a terrible shame. It would be easy for me to get in a back room with this man's lawyer and make this go away, but there are some moments in life when you have to stand up and defend your honor against the evil in this world. I will not tolerate this heartless attempt to exploit me or the woman I loved. Cat's troubles were born long before I met her and sadly her tragic end was beyond anyone's control. I really hope that some day soon people will stop trying to profit from this and let her rest in peace.\nIn October 2016, White's mother, Brigid Sweetman, also filed a wrongful death lawsuit against Carrey. In this suit, Sweetman's attorney states that Carrey underwent a test for sexually transmitted infections and \"purposely hid the results from Ms. White, whom he was intimately involved with, and failed to inform her that he had tested positive for hepatitis A, HSV (Herpes) I and II, and chlamydia. To make matters worse, Carrey then proceeded to have unprotected sex with Ms. White with full knowledge that he was STD positive.\" Sweetman herself later issued a statement: \"These documents show that Jim Carrey has lied to the media, the public and the court. Carrey has now been shown for what he is — a dishonest Hollywood celebrity who thinks he can say anything and fool people just because he is famous.\" The lawsuit was dismissed on January 25, 2018, and attorneys for both sides confirmed there would be no further legal proceedings.\n\n\n=== Anti-vaccine views ===\nCarrey believes the MMR vaccine causes autism. In 2009, Carrey wrote an article questioning the merits of vaccination and vaccine research for The Huffington Post. With former partner Jenny McCarthy, Carrey led a \"Green Our Vaccines\" march in Washington, D.C., to advocate for the removal of toxic substances from children's vaccines, out of a belief that children had received \"too many vaccines, too soon, many of which are toxic\". The rally was criticized by David Gorski, an American surgical oncologist on Science-Based Medicine blog for being anti-vaccine, not \"pro-safe vaccine\" and by Steven Parker on WebMD website for being \"irresponsible\".On July 1, 2015, after the signing of a new vaccination law, Carrey called California Governor Jerry Brown a \"corporate fascist\" who was \"poisoning\" children by enacting the vaccination requirements. The law disallowed religious and philosophical reasons for exemption from vaccination. Carrey was criticized for being \"ignorant when it comes to vaccines\" by Arthur Caplan, head of the Division of Medical Ethics, at New York University, and by Jeffrey Kluger, senior writer at Time, who described his anti-vaccination statements as \"angry, dense and immune to reason\".\n\n\n=== Political and spiritual views ===\nCarrey believes in and advocates for the so-called \"law of attraction\". In an interview with Oprah Winfrey on February 17, 1997, he revealed that as a struggling actor he would use visualization techniques to get work. He also stated that he visualized a $10,000,000 check given to him for \"acting services rendered\", placed the check in his pocket, and seven years later received a $10,000,000 check for his role in Dumb and Dumber.Carrey practices Transcendental Meditation.Carrey has been showing his own political cartoon drawings since August 2017, including controversial renderings of White House Press Secretary Sarah Huckabee Sanders and President Donald Trump. His show titled \"IndigNation\" opened on October 23, 2018 at the Maccarone Gallery in Los Angeles and features 108 pen-and-ink drawings from Carrey's Twitter feed from 2016–2018.", "Awards and nominations": "", "Filmography": "", "Discography": "=== Singles ===\n\"Cuban Pete\" (1995) – AUS No. 88, UK No. 31\n\"Somebody to Love\" (1996) – AUS No. 62\n\"Cold Dead Hand\" (2013) (as Lonesome Earl and the Clutterbusters)\n\n\n=== Other ===\n\"I Am The Walrus\" (1998)", "Bibliography": "=== Books ===\nCarrey, Jim (2013). How Roland Rolls. Illustrated by Rob Nason. Some Kind of Garden Media. ISBN 978-0-9893680-0-1.\n\n\n=== Forewords ===\nCarrey, Jim (2004). Foreword. It's Not Easy Bein' Me: A Lifetime of No Respect but Plenty of Sex and Drugs. By Dangerfield, Rodney. HarperCollins. ISBN 978-0-06-621107-7.", "See also": "", "References": "", "Further reading": "Krulik, Nancy (2001). Jim Carrey: Fun and Funnier. Simon & Schuster. ISBN 0-7434-2219-8", "External links": "Jim Carrey on IMDb \nJim Carrey at the TCM Movie Database\nJim Carrey at Box Office Mojo"}