{"_id": "42", "name": "Elizabeth Olsen", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:40", "biography": "Elizabeth Chase Olsen (born February 16, 1989) is an American actress. Her breakthrough came in 2011 when she starred in the independent thriller drama Martha Marcy May Marlene, for which she was nominated for the Critics' Choice Movie Award for Best Actress and Independent Spirit Award for Best Female Lead, among other awards. \nShe subsequently starred in the films Silent House (2011), Liberal Arts (2012), Oldboy (2013), Godzilla (2014), I Saw the Light (2015), Ingrid Goes West (2017), and Wind River (2017). Olsen went on to star in the web television drama series Sorry for Your Loss (2018–present), on which she was also executive producer.She achieved global recognition when she appeared in the Marvel Cinematic Universe as Wanda Maximoff / Scarlet Witch, with her first appearance in Captain America: The Winter Soldier (2014) in the end credit scene, then a lead in Avengers: Age of Ultron (2015), Captain America: Civil War (2016), Avengers: Infinity War (2018) and Avengers: Endgame (2019).", "Early life": "Olsen was born in Sherman Oaks, California, to Jarnette \"Jarnie\", a personal manager, and David \"Dave\" Olsen, a real estate developer and mortgage banker. She is the younger sister of twins Mary-Kate and Ashley Olsen, who became noted at an early age as TV and film stars. Olsen also has an older brother, Trent, and two younger half-siblings. In 1996, her parents divorced. The Olsens have Norwegian and English ancestry.As a child, Olsen received ballet and singing lessons. She began acting at a young age, with appearances in her sisters' films. Before the age of 11, Olsen had small roles in How the West Was Fun and the straight-to-video series The Adventures of Mary-Kate & Ashley. Having appeared in her sisters' videos, when she was in the fourth grade, Olsen began to go on auditions for other projects. She attended Campbell Hall School in North Hollywood, California, from kindergarten through grade 12.After graduation, she enrolled at New York University's Tisch School of the Arts. In 2009, Olsen spent a semester studying in Moscow at the Moscow Art Theatre School through the MATS program at the Eugene O'Neill Theater Center.", "Career": "Olsen began acting when she was four years old and co-starred in six of Mary-Kate and Ashley's productions; she also auditioned for the film Spy Kids. She almost quit acting in 2004 due to the media frenzy surrounding Mary-Kate's eating disorder. Olsen's breakout role came in 2011, in the film Martha Marcy May Marlene. The film, along with Olsen's performance, received critical acclaim. Olsen was nominated for and won numerous critics awards for her portrayal of the titular character Martha, a girl suffering from delusions and paranoia after fleeing her life in a cult and returning to her family. She next appeared in the horror film remake Silent House, in which she played the role of Sarah. The film received mixed reviews, but Olsen's performance was praised. Olsen also appeared in the music video \"The Queen\" by Carlotta. Olsen filmed the movie Red Lights in mid-2011, and it was released in the U.S. on July 13, 2012. She starred in Josh Radnor's film Liberal Arts, which was released on January 22, 2012. She and Dakota Fanning starred in Very Good Girls, a 2013 release.\n\nIn January 2013, Olsen was nominated for the BAFTA Rising Star Award. She co-starred in the 2013 American remake of the 2003 South Korean film Oldboy; she played Marie, a young social worker who developed a relationship with the protagonist, played by Josh Brolin. She played Edie Parker, Jack Kerouac's first wife and the author of the Beat Generation memoir You'll Be Okay, in Kill Your Darlings. Also in 2013, she portrayed the leading role in In Secret, an adaptation of Émile Zola's 1867 classic novel Thérèse Raquin.In 2014, Olsen starred in Legendary's reboot of Godzilla, opposite Bryan Cranston and Aaron Taylor-Johnson. Olsen joined the Marvel Cinematic Universe playing the character of Scarlet Witch in Avengers: Age of Ultron, the 2015 sequel to The Avengers. She first appeared as the character in a mid-credits scene of the film Captain America: The Winter Soldier, alongside her Godzilla co-star Taylor-Johnson, who portrayed her brother Quicksilver. She reprised the role in the 2016 film Captain America: Civil War, the 2018 sequel Avengers: Infinity War and the 2019 sequel Avengers: Endgame, which ended up becoming the highest grossing film of all time. \nOlsen portrayed Audrey Williams, Hank Williams's wife, manager, and duet partner in the 2015 biopic film I Saw the Light directed by Marc Abraham and starring Tom Hiddleston as Hank Williams.Olsen starred alongside her Avengers: Age of Ultron co-star Jeremy Renner in Taylor Sheridan's directorial feature film debut, Wind River. Later that year she starred in Matt Spicer's Ingrid Goes West opposite Aubrey Plaza. Both films were released in August 2017.In late 2018, Disney confirmed a Marvel television series starring Olsen and Paul Bettany would be aired on their upcoming Disney+ streaming service; the title of the show, WandaVision, was confirmed in April 2019. The series will be a direct tie-in to the upcoming film Doctor Strange in the Multiverse of Madness, where Olsen was confirmed to be a part of the cast.", "Personal life": "Olsen attended New York University's Tisch School of the Arts and Atlantic Theater Company and graduated in March 2013 after six years of intermittent study. Her sisters' clothing line \"Elizabeth and James\" was named after her and her older brother.Olsen and actor Boyd Holbrook became engaged in March 2014, but later ended their engagement in January 2015. Olsen became engaged to musician Robbie Arnett of Milo Greene in 2019 after three years of dating.Olsen has been an atheist since the age of 13.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video shorts ===\n\n\n=== Commercials ===", "Awards and nominations": "", "References": "", "External links": "Elizabeth Olsen on IMDb \nElizabeth Olsen on Twitter\nElizabeth Olsen on Instagram\nElizabeth Olsen at AllMovie\nElizabeth Olsen at the TCM Movie Database"}