{"_id": "50", "name": "Paul Bettany", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:43", "biography": "Paul Bettany (born 27 May 1971) is an English-American actor. He is known for his voice role as J.A.R.V.I.S. and Vision in the Marvel Cinematic Universe, specifically the films Iron Man (2008), Iron Man 2 (2010), The Avengers (2012), Iron Man 3 (2013), Avengers: Age of Ultron (2015), Captain America: Civil War (2016) and Avengers: Infinity War (2018). He first came to the attention of mainstream audiences when he appeared in the British film Gangster No. 1 (2000), and director Brian Helgeland's film A Knight's Tale (2001). He has gone on to appear in a wide variety of films, including A Beautiful Mind (2001), Master and Commander: The Far Side of the World (2003), Dogville (2003), Wimbledon (2004), the adaptation of the novel The Da Vinci Code (2006) and Margin Call (2011). He also portrayed Dryden Vos in Solo: A Star Wars Story (2018).\nHe has been nominated for various awards, including BAFTA Award for Best Actor in a Supporting Role and a Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture. Bettany is married to American actress Jennifer Connelly, with whom he has two children.", "Early life": "Bettany was born in London, the son of Anne (née Kettle), a stage singer, theatre teacher, and stage manager, and Thane Bettany, a dancer, actor, and drama teacher. Bettany was raised Roman Catholic, although his church attendance drifted after his confirmation. He later attended Methodist and Church of England congregations with his father, as the latter experimented with different Christian branches. Bettany later became an atheist. While his father taught at the all-girls boarding school Queenswood School, near Hatfield, Hertfordshire, the family lived on the campus.When Bettany was 16, his brother Matthew died at age 8 after falling onto concrete from a tennis pavilion roof at Queenswood. Soon after, Bettany dropped out of school, left home, and became a street performer in London. He lived in a small flat and earned money by playing his guitar in the streets as a busker. His parents later divorced. After two years, he found a new job in a home for the elderly. After working there for a year, Bettany enrolled at the Drama Centre in London. He had dyslexia prior to it being recognised as a learning disability.", "Career": "In 1990 at the age of 19, Bettany began a three-year course at the Drama Centre London in Chalk Farm. He made his stage debut in Stephen Daldry's acclaimed West End revival of An Inspector Calls at the Aldwych Theatre, playing the part of Eric Birling. He also appeared in the Royal Shakespeare Company's productions of Richard III, Romeo and Juliet, and Julius Caesar (for which he received a Charleson Award nomination). When Bettany was 21 he appeared in a BBC production of Oliver Twist, playing Bill Sikes.\nAfter appearing in the finale of Sean Bean's series Sharpe as William II of the Netherlands at the Battle of Waterloo, he made his film debut with a small part in Bent, a Holocaust drama which also featured Clive Owen, Jude Law, and Ian McKellen. He continued doing work in stage and television: these included Joe Penhall's Love and Understanding, which played at London's Bush Theatre and then ran in Connecticut. He had roles in the television productions Killer Net and Coming Home, during which he met and dated Emily Mortimer. His last stage work was in One More Wasted Year and Stranger's House at the Royal Court Theatre. He filmed several more movies, including his first leading role in Gangster No. 1. The British Independent Film Awards nominated him for Best Actor, and the London Film Critics' Circle nominated him for British Newcomer of the Year.Back in Hollywood, writer/director Brian Helgeland (L.A. Confidential) was planning a new film called The Sin Eater (also known as The Order). He was impressed by Bettany's audition tape, though Helgeland eventually decided to film A Knight's Tale instead. The studio executives were not impressed, but Helgeland was determined to cast him, even writing the part of Chaucer for him. A Knight's Tale would be Bettany's first big Hollywood production. He received critical acclaim for A Knight's Tale, including winning the London Film Critics Circle Award for Best British Supporting Actor. After the movie wrapped, Helgeland, determined that Hollywood should recognize Bettany's talent, showed the audition tape to many of his peers, including Ron Howard, who promptly cast Bettany in A Beautiful Mind. After A Beautiful Mind, Bettany was offered the role of serial killer Francis Dolarhyde in Red Dragon, opposite Edward Norton and Anthony Hopkins. He turned down the role in favour of accepting a part with Stellan Skarsgård and Nicole Kidman in Lars von Trier's Dogville.Bettany's next major project saw him starring again alongside Russell Crowe in Peter Weir's Master and Commander: The Far Side of the World. His portrayal of surgeon and naturalist Stephen Maturin brought him a BAFTA nomination, and he was named British Actor of the Year (London Film Critics' Circle), and Best Actor (Evening Standard).\nOn 28 June 2004, Bettany and 13 other actors were included in the 2004 invitation to join the Academy of Motion Picture Arts and Sciences. Dogville and The Reckoning were released in limited cinemas in 2004. In September of that year, Bettany made his leading-man debut in Wimbledon, a romantic comedy with Kirsten Dunst. The film's cast would also introduce him to Jon Favreau, playing his manager, a relationship that would return when Favreau cast him as the voice of J.A.R.V.I.S. in Iron Man. In mid-2005, Bettany filmed Firewall in Vancouver, Canada, a thriller also starring Harrison Ford and Virginia Madsen, which reunited him with Wimbledon director Richard Loncraine. He spent the autumn of 2005 filming The Da Vinci Code, based on Dan Brown's best-selling novel and starring Tom Hanks, Audrey Tautou and Ian McKellen. In the film, he played an Opus Dei monk named Silas.\nIn 2007, Bettany went to London to star in There For Me, written by his friends Dan Fredenburgh and Doraly Rosen. In 2008, he appeared in the New Line Cinema family fantasy Inkheart, playing the part of a fire-eater named Dustfinger. In 2009, he appeared as Charles Darwin in Creation, starring opposite wife Jennifer Connelly. In 2010, Bettany appeared alongside Johnny Depp and Angelina Jolie in The Tourist and portrayed the archangel Michael in Legion, a movie based on God's vengeance against humanity. He starred in the films Priest and Margin Call, both released in 2011.\nBettany reprised his voice role as J.A.R.V.I.S. in 2010's Iron Man 2, 2012's The Avengers, 2013's Iron Man 3, and Disneyland's Innoventions attraction. In 2014, Bettany starred alongside Johnny Depp and fellow British actor Rebecca Hall in the feature film Transcendence. He was once again paired with Depp in Mortdecai, a 2015 motion picture also starring Gwyneth Paltrow and Ewan McGregor. He played the Vision in the 2015 film Avengers: Age of Ultron, and reprised his voice role as J.A.R.V.I.S. again in the same film. Bettany portrayed The Vision again in the sequels Captain America: Civil War and Avengers: Infinity War.\nBettany also stars as Ted Kaczynski in the Discovery Channel television show, Manhunt: Unabomber. Bettany replaced Michael K. Williams in Solo: A Star Wars Story, after Williams was removed from the final film, as he was unable to return to set during the film's reshoots. Bettany was cast in his place, with the character being reworked from a motion-capture alien, to a human.On 20 January 2018, it was reported that Bettany was nearing a deal to play Prince Philip, Duke of Edinburgh on the Netflix series The Crown succeeding Matt Smith. Days later on 25 January, it was reported by TVLine that Bettany was ultimately unable to sign on due to scheduling conflicts.In late 2018, Disney confirmed a Marvel television series starring Bettany and Elizabeth Olsen would be aired on their upcoming Disney+ streaming service; the title of the show, WandaVision, was confirmed in April 2019.", "Personal life": "On 1 January 2003, Bettany married American actress Jennifer Connelly in Scotland; they met when they starred together in A Beautiful Mind. They did not become a couple until some time after the film, as both were in other relationships during filming. She was his childhood crush since he first saw her as a teenager in the film Labyrinth. The September 11 attacks motivated him to act on his feelings for her, and after two days of attempting to contact her, he proposed. Soon after, they moved to Brooklyn Heights after having lived together in Tribeca. The couple have also had two children together, a son and a daughter.Bettany is an atheist.", "Filmography": "=== Film ===\n\n\n=== Television ===", "Awards and nominations": "", "Notes": "", "References": "", "External links": "Paul Bettany on IMDb \nPaul Bettany biography and credits at the BFI's Screenonline"}