{"_id": "37", "name": "Benedict Cumberbatch", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:38", "biography": "Benedict Timothy Carlton Cumberbatch  (born 19 July 1976) is an English actor who has performed in film, television, theatre and radio. A graduate of the Victoria University of Manchester, he continued his training at the London Academy of Music and Dramatic Art, obtaining a Master of Arts in Classical Acting. He first performed at the Open Air Theatre, Regent's Park in Shakespearean productions and made his West End debut in Richard Eyre's revival of Hedda Gabler in 2005. Since then he has starred in the Royal National Theatre productions After the Dance (2010) and Frankenstein (2011). In 2015, he played William Shakespeare's Hamlet at the Barbican Theatre.\nCumberbatch's television work includes appearances in Silent Witness (2002) and Fortysomething (2003) before playing Stephen Hawking in the television film Hawking in 2004. He has starred as Sherlock Holmes in the series Sherlock since 2010. He has also headlined Tom Stoppard's adaptation of Parade's End (2012), The Hollow Crown: The Wars of the Roses (2016) and Patrick Melrose (2018). In film, Cumberbatch has starred in Amazing Grace (2006) as William Pitt the Younger, Star Trek Into Darkness (2013) as Khan, 12 Years a Slave (2013) as William Prince Ford, The Fifth Estate (2013) as Julian Assange and The Imitation Game (2014) as Alan Turing. From 2012 to 2014, through voice and motion capture, he played the characters of Smaug and the Necromancer in The Hobbit film series. In superhero films set in the Marvel Cinematic Universe, he has played Dr. Stephen Strange in Doctor Strange (2016), Thor: Ragnarok (2017), Avengers: Infinity War (2018) and Avengers: Endgame (2019).\nCumberbatch has received numerous accolades, including the Laurence Olivier Award for Best Actor for Frankenstein and the Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie for Sherlock. His performance in The Imitation Game earned him a nomination for the Academy Award for Best Actor. In 2014 Time magazine included him in its annual list of the 100 most influential people in the world, and in 2015 he was appointed Commander of the Order of the British Empire.", "Early life": "Cumberbatch was born at Queen Charlotte's and Chelsea Hospital in the district of West London's Hammersmith and Fulham borough, to actors Timothy Carlton (born Timothy Carlton Congdon Cumberbatch) and Wanda Ventham. He grew up in the Royal Borough of Kensington and Chelsea. He has a half-sister, Tracy Peacock, from his mother's first marriage. His grandfather, Henry Carlton Cumberbatch, was a submarine officer of both World Wars, and a prominent figure of London high society. His great-grandfather, Henry Arnold Cumberbatch, was a diplomat who served as consul in Turkey and Lebanon, and his great-great-grandfather, Robert William Cumberbatch, also was a British consul in Turkey and the Russian Empire. Cumberbatch is third cousin 16 times removed of King Richard III, whom he portrayed in The Hollow Crown. Motivated by this connection, he attended Richard III's 2015 reburial and read a poem.\n\n\n=== Education ===\n\nCumberbatch attended boarding schools from the age of 8; he was educated at Brambletye School in West Sussex and was an arts scholar at Harrow School. He was a member of The Rattigan Society, Harrow's principal club for the dramatic arts, which was named after Old Harrovian and playwright Terence Rattigan. He was involved in numerous Shakespearean works at school and made his acting debut as Titania, Queen of the Fairies, in A Midsummer Night's Dream when he was 12. Cumberbatch's drama teacher, Martin Tyrell, called him \"the best schoolboy actor\" he had ever worked with.After leaving Harrow, Cumberbatch took a gap year to volunteer as an English teacher at a Tibetan monastery in Darjeeling, India. He then attended the Victoria University of Manchester (now the University of Manchester), where he studied Drama. He continued his training as an actor at the London Academy of Music and Dramatic Art (LAMDA) graduating with an MA in Classical Acting. On 16 January 2018, it was announced that Cumberbatch would succeed Timothy West as President of LAMDA. On being appointed Cumberbatch stated it would be \"an honour to watch the next generation of actors, directors and technicians blossom\".", "Career": "=== Theatre ===\n\nSince 2001, Cumberbatch has had major roles in a dozen classic plays at the Regent's Park Open Air, Almeida, Royal Court and Royal National Theatres. He was nominated for an Olivier Award for Best Performance in a Supporting Role for his role as George Tesman in Hedda Gabler, which he performed at the Almeida Theatre on 16 March 2005 and at the Duke of York's Theatre when it transferred to the West End on 19 May 2005. This transfer marked his first West End appearance.In June 2010, Cumberbatch led the revival of Terence Rattigan's After the Dance directed by Thea Sharrock at the Royal National Theatre. He played 1920s aristocrat David Scott-Fowler to commercial and critical success. The play eventually won four Olivier Awards including Best Revival.Cumberbatch acted in Danny Boyle's The Children's Monologues, a theatrical charity event at London's Old Vic Theatre, on 14 November 2010. The show was produced by Dramatic Need.In February 2011, Cumberbatch began playing, on alternate nights, both Victor Frankenstein and his creature, opposite Jonny Lee Miller, in Danny Boyle's stage production of Mary Shelley's Frankenstein at the Royal National Theatre. Frankenstein was broadcast to cinemas as a part of National Theatre Live in March 2011. Cumberbatch achieved the \"Triple Crown of London Theatre\" in 2011 when he received the Olivier Award, Evening Standard Award and Critics' Circle Theatre Award for his performance in Frankenstein.Cumberbatch was a part of a cast featuring members of the Royal National Theatre Company in 50 Years on Stage, the Royal National Theatre's landmark event for its 50th anniversary on 2 November 2013. He played Rosencrantz in a selected scene from Tom Stoppard's play Rosencrantz and Guildenstern Are Dead. The show was directed by Sir Nicholas Hytner and was broadcast on BBC Two and in cinemas worldwide as a part of National Theatre Live.Cumberbatch returned to theatre to play Shakespeare's Hamlet at London's Barbican Theatre. The production was directed by Lyndsey Turner and produced by Sonia Friedman, which started its 12-week run in August 2015. The performance, co-starring Sian Brooke, was broadcast by the National Theatre Company by satellite internationally as Hamlet in Rehearsal. He earned his third Laurence Olivier Awards nomination for the role.\n\n\n=== Television ===\n\nCumberbatch's early television roles include two separate guest roles in Heartbeat (2000, 2004), Freddy in Tipping the Velvet (2002), Edward Hand in Cambridge Spies (2003) and Rory in the ITV comedy drama series Fortysomething (2003). He also featured in Spooks and Silent Witness. In 2004, he landed his first main part in television as Stephen Hawking in Hawking. He was nominated for the BAFTA TV Award for Best Actor and won the Golden Nymph for Television Films – Best Performance by an Actor. He later provided Hawking's voice in the first episode of the television series Curiosity. He also appeared in the BBC miniseries Dunkirk as Lieutenant Jimmy Langley.In 2005, Cumberbatch portrayed protagonist Edmund Talbot in the miniseries To the Ends of the Earth, based on William Golding's trilogy; during filming he experienced a terrifying carjacking in South Africa, managing to escape. He made brief appearances in the comedy sketch show Broken News and the Channel 4 sitcom Nathan Barley in 2005 and featured alongside Tom Hardy in the television adaptation of Stuart: A Life Backwards, which aired on the BBC in September 2007.In 2008, Cumberbatch played the lead character in the BBC miniseries drama The Last Enemy, earning a Satellite Award nomination for Best Actor in a Miniseries or TV Film. In 2009, he appeared in Marple: Murder Is Easy as Luke Fitzwilliam. He played Bernard in the TV adaptation of Small Island, earning him a nomination for BAFTA Television Award for Best Supporting Actor. Cumberbatch featured in Michael Dobbs' play, The Turning Point, which aired as one of a series of TV plays broadcast live on Sky Arts. The play depicted an October 1938 meeting between Soviet spy Guy Burgess, then a young man working for the BBC, and Winston Churchill. Cumberbatch portrayed Burgess; Churchill was played by Matthew Marsh, who had played a supporting role in Hawking. He narrated the 6-part series South Pacific (US title: Wild Pacific), which aired from May to June 2009 on BBC 2.In 2010, Cumberbatch portrayed Vincent van Gogh in Van Gogh: Painted with Words. The Telegraph called his performance \"[a] treat ... vividly bringing Van Gogh to impassioned, blue-eyed life.\" In the same year, Cumberbatch began playing Sherlock Holmes in the joint BBC/PBS television series Sherlock, to critical acclaim. The second series began on New Years Day 2012 in the United Kingdom and was broadcast on PBS in the United States in May 2012. The third series aired on PBS over a period of three weeks in January to February 2014. Cumberbatch won an Outstanding Lead Actor in a Miniseries or a Movie for the third episode of the third series of the show entitled His Last Vow. In April 2015, Cumberbatch was nominated for his sixth British Academy Television Award for Best Leading Actor for the third series of the Sherlock. In 2016, he was once again nominated for a Outstanding Lead Actor in a Miniseries or a Movie, this time for Sherlock: The Abominable Bride.In 2012, Cumberbatch led the BBC and HBO co-produced miniseries Parade's End with Rebecca Hall. An adaptation of the tetralogy of novels of the same name by Ford Madox Ford, it was filmed as five episodes, directed by Susanna White and adapted by Tom Stoppard. His performance earned Cumberbatch his second Emmy Award nomination for Best Actor in Miniseries or TV Movie. In February 2014, Cumberbatch appeared with Sesame Street characters Murray and Count von Count for PBS. In April that same year, it was announced that Cumberbatch would portray Richard III in Shakespeare's play of the same name in the second series of films for The Hollow Crown which aired in both Britain and the United States. Cumberbatch has also been a brand ambassador for Dunlop and Jaguar luxury cars since 2014.Cumberbatch was cast in February 2017 to star in Patrick Melrose, a miniseries adaptation of the Edward St Aubyn novels, which began airing on Showtime on 12 May 2018. In 2019 Cumberbatch appeared as British political strategist Dominic Cummings (who served as the campaign director of Vote Leave, the official campaign in favour of the UK leaving the European Union) in HBO and Channel 4's television film Brexit: The Uncivil War.\n\n\n=== Film ===\nIn 2006, Cumberbatch played William Pitt the Younger in Amazing Grace. The role garnered him a nomination for the London Film Critics Circle \"British Breakthrough Acting Award\". He subsequently appeared in supporting roles in Atonement (2007) and The Other Boleyn Girl (2008). In 2009, he appeared in the Charles Darwin biographical film Creation as Darwin's friend Joseph Hooker. In 2010, he appeared in The Whistleblower as well as Four Lions. He portrayed Peter Guillam, George Smiley's right-hand man, in the 2011 adaptation of the John le Carré novel Tinker Tailor Soldier Spy. The film was directed by Tomas Alfredson and featured Gary Oldman and Colin Firth. Cumberbatch played Major Jamie Stewart in Steven Spielberg's War Horse in 2011.\n\nIn 2012, Cumberbatch provided the voice and motion-capture for both Smaug the Dragon and the Necromancer in An Unexpected Journey, the first instalment of The Hobbit film series based on the novel by J. R. R. Tolkien. He reprised his roles as Smaug and the Necromancer for The Desolation of Smaug (2013) and The Battle of the Five Armies (2014). For the motion-capture aspect of the films, he used a suit and facial markers to highlight the dragon's expressions and movements. Cumberbatch told Total Film \"You just have to lose your shit on a carpeted floor, in a place that looks a little bit like a mundane government building. It was just me as well, with four static cameras and all the sensors.\"\n\nIn 2013, Cumberbatch appeared in J.J. Abrams' sequel, Star Trek Into Darkness, as Khan, the film's antagonist. Three of the four films he featured in during the second half of 2013 premiered at the Toronto International Film Festival: The Fifth Estate, in which he played WikiLeaks founder Julian Assange, 12 Years a Slave, in which he played William Prince Ford, a slave owner, and August: Osage County, in which he played Charles Aiken. For the official soundtrack of the latter film, he recorded a song titled \"Can't Keep it Inside\".Cumberbatch had a voice role in DreamWorks Animation's feature film Penguins of Madagascar, which was released in November 2014. He then starred in the historical drama The Imitation Game as British cryptographer Alan Turing, also released in November 2014. The role earned him nominations for the Golden Globe, BAFTA, SAG, and Academy Award for Best Actor. In May 2014, he joined the cast of the film Black Mass opposite Johnny Depp which was distributed by Warner Bros. Pictures.Cumberbatch starred as Doctor Strange in both the eponymous film released in November 2016,  in Avengers: Infinity War in April 2018., and in Avengers: Endgame in April 2019. He starred as electricity titan Thomas Edison in the film The Current War in September 2017. In 2018, Cumberbatch voiced the title character in the film The Grinch, and provided the voice and did performance capture for the tiger Shere Khan in Mowgli: Legend of the Jungle, Netflix's film adaptation of Rudyard Kipling's The Jungle Book, starring alongside Christian Bale and Cate Blanchett.\n\n\n=== Radio ===\nCumberbatch has repeatedly expressed his affection for radio and has done numerous productions for the BBC. Among his best-known radio work is the adaptation of John Mortimer's novel Rumpole and the Penge Bungalow Murders in 2009. He played Young Rumpole, and went on to play the part in nine more adaptations of Mortimer's works. Between 2008 and 2014, he played Captain Martin Crieff in the BBC's sitcom Cabin Pressure. He then went on to play the Angel Islington in the 2013 BBC Radio 4 adaptation of Neil Gaiman's Neverwhere. In the same year, he led the BBC Radio 3 adaptation of Michael Frayn's play Copenhagen wherein he played theoretical physicist Werner Heisenberg.For the 70th anniversary of the Normandy landings, on 6 June 2014 Cumberbatch read the original BBC radio bulletins from June 1944 for BBC Radio 4.\n\n\n=== Narration ===\nCumberbatch has narrated numerous documentaries for the National Geographic and Discovery channels. He has also read for several audiobooks, including Casanova, The Tempest, The Making of Music, Death in a White Tie, Artists in Crime, and Sherlock Holmes: The Rediscovered Railway Mysteries and Other Stories. He has done voice-overs for several commercials, including for major names Jaguar, Sony, Pimms, and Google+, performing the Seven Ages of Man monologue. For the 2012 London Olympics, he featured in a short film on the history of London, which began the BBC coverage of the opening ceremony. He made appearances for two Cheltenham Festivals, in July 2012 for Music when he read World War I poetry and prose accompanied by piano pieces and in October 2012 for Literature when he discussed Sherlock and Parade's End at The Centaur. In 2012, he lent his voice to a four-part, spoken-word track titled \"Flat of Angles\" for Late Night Tales based on a story written by author and poet Simon Cleary, the final instalment of which was released on 9 May 2014.In 2012, he provided the voice of Dante Alighieri in the documentary Girlfriend in a Coma. In 2013, Cumberbatch narrated the documentary film Jerusalem about the ancient city. It was distributed by National Geographic Cinema Ventures in IMAX 3D theatres worldwide. The same year, he appeared as a special guest in a recording of Gordon Getty's opera Usher House, where he voiced the role of \"the visitor\", recorded and released by PENTATONE.He narrated the documentary Cristiano Ronaldo: The World at His Feet about the Portuguese footballer for Vimeo and Vision Films in 2014. In August 2014, he recorded the first ever unabridged audiobook of William Golding's 1964 novel, The Spire, for Canongate Books.\n\n\n=== Music ===\nOn 28 September 2016, Cumberbatch appeared on stage with Pink Floyd member David Gilmour during one of the musician's shows in London held at the Royal Albert Hall. He sang lead vocals on the song \"Comfortably Numb\", singing the verse sections originally sung by Roger Waters.\n\n\n=== Production company ===\nCumberbatch, Adam Ackland, writer-director Patrick Monroe, action coordinator Ben Dillon, and production manager Adam Selves launched a production company, SunnyMarch Ltd., in late 2013.Their first project under the company's banner was the £87,000 crowd-funded short film Little Favour, written and directed by Monroe with Cumberbatch in the lead role. The 30-minute action-thriller became internationally available on iTunes on 5 November 2013.", "Public image": "Cumberbatch did not achieve international recognition until the first series of Sherlock in 2010. He has since been called \"The Thinking Woman's Crumpet\" and has been a mainstay in numerous \"Sexiest Man Alive\" lists including those of Empire and People.\n\nTatler listed Cumberbatch in the \"Most Eligible Bachelors in the United Kingdom\" in 2012. In the same year, Cumberbatch described a cyberstalking incident in which he discovered that someone had been live-tweeting his movements in his London home. Coming to terms with it, he said, it is \"an ongoing process. To think that somebody knew everything I'd done in a day and told the rest of the world in real time!\" His photograph taken at the Garrick Club by Derry Moore, 12th Earl of Drogheda was the cover of Moore's 2012 book An English Room.In 2013, Cumberbatch was ranked fifth in the Tatler's \"Most Fascinating People in Britain\" list, higher than the Duchess of Cambridge and just below Queen Elizabeth II. Entertainment Weekly identified Cumberbatch as one of the \"50 Coolest and Most Creative Entertainers\" in Hollywood. He has also appeared on the covers of GQ, Time and The Hollywood Reporter's \"New A-list\" issue.In 2014, Cumberbatch was included in The Sunday Times \"100 Makers of the 21st Century\", cited as this generation's Laurence Olivier.\" Film critic Roger Friedman stated that \"Cumberbatch may be the closest thing to a real descendant of Sir Laurence Olivier.\" GQ identified him as one of the \"100 Most Connected Men\" in the UK in 2014. In the same year, Country Life magazine labelled him as one of its \"Gentlemen of the Year\".In April 2014, Cumberbatch was regarded as a British cultural icon, with young adults from abroad naming him among a group of people that they most associated with UK culture, which included William Shakespeare, Queen Elizabeth II, David Beckham, J. K. Rowling, The Beatles, Charlie Chaplin, Elton John and Adele. The same month, Time magazine included him in its annual TIME 100 as one of the Most Influential People in the World. Cumberbatch was the inspiration and focus of the play Benedict Cumberbatch Must Die which, despite its title, was a \"love letter\" and portrait of the fan obsession surrounding the actor. It premiered in June 2014 at BATS Theatre in New Zealand. The Tennessee Aquarium named one of its otters \"Benny\" in reference to Cumberbatch's first name after a naming contest on the zoo's website.A wax figure of Cumberbatch has been on display at Madame Tussauds London since October 2014. In 2015, he was named one of GQ's 50 best dressed British men. In 2018, PETA declared Cumberbatch and director Ava DuVernay to be the Most Beautiful Vegan Celebs of 2018.", "Personal life": "While in KwaZulu-Natal, South Africa, in 2005, Cumberbatch and two friends (\"Theo and Denise [Black])  were abducted, after bursting a tyre, and held at gunpoint by a group of locals. Eventually their abductors drove them into unsettled territory and set them free without explanation. Cumberbatch said of the incident: \"It taught me that you come into this world as you leave it, on your own. It's made me want to live a life less ordinary.\" Before the burst tyre, they had been listening to “How to Disappear Completely” from Radiohead. Following this experience, whenever Cumberbatch hears the song it \"reminds [him] of a sense of reality [... and] a reason for hope\".He subscribes to Buddhist philosophy and has expressed affinity for meditation and mindfulness. Cumberbatch also follows a vegan diet.Cumberbatch is married to English theatre and opera director Sophie Hunter. Their engagement was announced in the \"Forthcoming Marriages\" section of The Times on 5 November 2014, after a 17-year friendship. On 14 February 2015, the couple married at the 12th-century Church of St. Peter and St. Paul in Mottistone on the Isle of Wight followed by a reception at Mottistone Manor. They have two sons, Christopher Carlton (b. 2015) and Hal Auden (b. 2017).\n\n\n=== Charity ===\nCumberbatch is an ambassador for The Prince's Trust. He is a supporter and patron of organisations focused on using the arts to help disadvantaged young people including Odd Arts, Anno's Africa and Dramatic Need. Since portraying Stephen Hawking in 2004, he has been an ambassador, and in 2015 patron, for the Motor Neurone Disease Association and in 2014 did the Ice Bucket Challenge for the organisation. He also set up a recovery fund for the benefit of Amyotrophic Lateral Sclerosis Association. Cumberbatch has donated artworks for charities and fundraisers including the Willow Foundation, and Thomas Coram Foundation for Children.\n\nTogether with Prince Philip, Cumberbatch presented 85 young people with the Duke of Edinburgh's Award at St James's Palace on 19 March 2014. \"Our ambition is to extend this opportunity to hundreds of thousands across the UK\", Cumberbatch said on behalf of the youth awards programme.In May 2014, he joined Prince William and Ralph Lauren at Windsor Castle for a cancer awareness and fundraising gala for the benefit of The Royal Marsden NHS Foundation Trust. Cumberbatch stated, \"Cancer isn't a disease that needs much awareness, but it does need continued funding for research.\" In September 2014, he participated in a video campaign for Stand Up To Cancer. Cumberbatch posed for photographer Jason Bell for an exhibition at Pall Mall, London from 16–20 September 2014 to mark 10 years of the \"Give Up Clothes For Good\" charity campaign, which has raised £17 million for Cancer Research UK.In 2014, Cumberbatch publicly backed \"Hacked Off\" and its campaign for UK press self-regulation by \"safeguarding the press from political interference while also giving vital protection to the vulnerable.\"In a November 2014 cover story for Out promoting The Imitation Game, Cumberbatch opened up about sexual experimentation during his time in boarding schools stating, \"While there was experimentation, it had never occurred to me as, 'Oh, this is that!' It was just boys and their penises, the same way with girls and vaginas and boobs. It wasn't out of desire.\" LGBT group Stonewall released a statement praising Cumberbatch's comments, saying, \"Seeing someone in the public eye – especially somebody as influential as Benedict – talking positively around gay issues, is powerful for young lesbian, gay and bisexual people. It is often difficult for those growing up to find role models who demonstrate that it is equally okay to be gay or straight.\"Cumberbatch is a founding member of the \"Save Soho\" campaign which aims \"to protect and nurture iconic music and performing arts venues in Soho.\" In an open letter published in The Guardian on 31 January 2015, Cumberbatch, amongst others, asked for pardons of all gay and bisexual men who were convicted under the same now-defunct \"indecency\" laws as Alan Turing was (whom Cumberbatch portrayed in The Imitation Game).In September 2015, Cumberbatch condemned the UK government's response to the migrant crisis in a speech to theatregoers during a curtain call at a performance of Hamlet, for which he stars. He also fronted a video campaign to help the charity Save The Children in its mission to aid young Syrian refugees. He was one of the signatories of an open letter, published in The Guardian, criticising the government for its actions regarding the refugee problem. He also gave nightly speeches after his curtain call as Hamlet at the Barbican in London, asking for donations to help Syrian refugees. At the end of the run, the audience contributed more than £150,000 for Save the Children.Cumberbatch was appointed a Commander of the Order of the British Empire (CBE) in the 2015 Birthday Honours for services to the performing arts and to charity. He received the honour from the Queen at an investiture ceremony at Buckingham Palace on 10 November 2015. In February 2016, Cumberbatch was appointed visiting fellow at Lady Margaret Hall, Oxford University.\n\n\n=== Politics ===\nIn 2003, Cumberbatch joined the Stop the War Coalition protest in London against the Iraq War. He addressed activists in a 2010 protest sponsored by the Trade Union Congress in Westminster on the suggested risks to the arts due to spending cuts expected in the Spending Review. In 2013, he protested against what he perceived were civil liberties violations by the UK Government.Cumberbatch is a straight ally and in July 2013 officiated at the same-sex marriage of friends. For International Women's Day 2014, he was a signatory of Amnesty International's letter to the Prime Minister David Cameron for women's rights in Afghanistan. Cumberbatch identifies as a feminist.In 2016, Cumberbatch, along with Sir Patrick Stewart, led more than 280 figures from the arts world who backed a vote for the United Kingdom to stay in the European Union in regards to the June 2016 referendum on that issue.", "Filmography": "", "Awards and nominations": "", "References": "", "External links": "Benedict Cumberbatch on IMDb \nBenedict Cumberbatch at AllMovie"}