{"_id": "92", "name": "Kristen Stewart", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:19", "biography": "Kristen Jaymes Stewart (born April 9, 1990) is an American actress and director. She is the recipient of several accolades, including a César Award, which she was the first American actress to win. Her films have grossed over $4.3 billion worldwide, and she was the highest-paid actress in the world in 2010 and 2012.\nBorn and raised in Los Angeles to an American father and Australian mother, both of whom worked in show business, Stewart began her career as a child actress in 1999. She gained notice in 2002 for playing Jodie Foster's daughter in the thriller Panic Room, which garnered her a Young Artist Award nomination for Best Leading Actress in a Feature Film. She subsequently starred in Speak (2004), Catch That Kid (2004), Zathura: A Space Adventure (2005), and Into the Wild (2007). In 2010, she was awarded the BAFTA Rising Star Award. Stewart went on to gain wide recognition for playing Bella Swan in The Twilight Saga film series (2008–2012), which collectively grossed over $3.3 billion worldwide. Her work in the series established her as one of the highest-paid actresses in the world.\nFollowing the starring role in the fantasy film Snow White and the Huntsman (2012), Stewart eschewed parts in big-budget films in favour of independent productions. She starred in the dramas Camp X-Ray and Still Alice (both 2014), and the science fiction romance Equals (2016). In 2015, she received critical acclaim for her role opposite Juliette Binoche in Olivier Assayas's French film Clouds of Sils Maria, for which she won the César Award for Best Supporting Actress. Stewart reunited with Assayas the following year in the supernatural thriller for her critically acclaimed role in Personal Shopper (2016) and made her directorial debut with the 2017 short film Come Swim.", "Early life": "Stewart was born in Los Angeles, California, on April 9, 1990. Both of her parents work in the entertainment industry. Her American father, John Stewart, is a stage manager and television producer who has worked for Fox and on the Comedy Central show @midnight. Her Australian mother, Jules Mann-Stewart, is originally from Maroochydore, Queensland. She is a script supervisor and also directed the 2012 film K-11. Stewart has an older brother, Cameron B. Stewart, and two adopted brothers, Dana and Taylor. Stewart attended local schools until the seventh grade. As she became more involved in acting, she continued her education by distance until completing high school.", "Career": "=== 1999–2003: Career beginnings ===\nAs she grew up with a family who worked behind the camera, Stewart thought she would become a screenwriter/director, but never considered being an actor. She recalled, \"I never wanted to be the center of attention—I wasn't that 'I want to be famous, I want to be an actor' kid. I never sought out acting, but I always practiced my autograph because I love pens. I'd write my name on everything.\"She began acting at 8, after an agent saw her perform in her elementary school's Christmas play. After auditioning for a year, Stewart gained her first role with a small, nonspeaking part in the Disney Channel television film The Thirteenth Year. Her next film was The Flintstones in Viva Rock Vegas, where she played the \"ring toss girl\". She also appeared in the independent film The Safety of Objects (2001), as the tomboy daughter of a troubled single mother (Patricia Clarkson). Stewart also played a tomboy, diabetic daughter of a divorced mother (Jodie Foster) in the film Panic Room (2002). She was nominated for a Young Artist Award for her performance.After Panic Room's success, Stewart was cast in another thriller, Cold Creek Manor (2003), playing the daughter of characters played by Dennis Quaid and Sharon Stone. She was nominated again for a Young Artist Award for her performance. About this time in her career, she started homeschooling because of her irregular schedule.\n\n\n=== 2004–2007: Breakthrough ===\n\nStewart's first starring role was at age 14 in the children's action-comedy Catch That Kid (2004), opposite Max Thieriot and Corbin Bleu. That year Stewart also played the role of Lila in the thriller, Undertow (2004). Stewart starred in the Lifetime/Showtime television film Speak (2004), based on the novel by the same name by Laurie Halse Anderson. Stewart, 13 at the time of filming, played a high school freshman, Melinda Sordino, who nearly stops speaking after being raped. Her performance was widely praised, with The New York Times stating \"Ms. Stewart creates a convincing character full of pain and turmoil.\"Stewart appeared in the fantasy-adventure film Zathura: A Space Adventure (2005), playing the role of Lisa Budwing, the irresponsible older sister of two little boys. During their playing a board game, they turn their house into a spacecraft hurtling uncontrollably in outer space. The film was praised by critics, but Stewart's performance did not garner much media attention. Her character is immobilized during most of the film. The next year, she played the character Maya in Fierce People (2006), directed by Griffin Dunne. After that film, she received the lead role of Jess Solomon in the supernatural thriller film The Messengers.\nStewart appeared as teenager Lucy Hardwicke in In the Land of Women (2007), a romantic drama starring Meg Ryan and Adam Brody. The film, as well as Stewart's performance, received mixed reviews. That same year, Stewart had a small role in the Sean Penn-directed adaptation Into the Wild. For her portrayal of Tracy – a teenage singer who has a crush on young adventurer Christopher McCandless (played by Emile Hirsch) – Stewart received mixed reviews. While Salon.com considered her work a \"sturdy, sensitive performance\", and the Chicago Tribune noted that she did \"vividly well with a sketch of a role\", Variety's critic Dennis Harvey said, \"It's unclear whether Stewart means to be playing hippie-chick Tracy as vapid, or whether it just comes off that way.\" The film received Screen Actors Guild nomination for Outstanding Performance by a Cast in a Motion Picture. After Into the Wild, Stewart had a cameo appearance in Jumper and also appeared in What Just Happened, which was released in October 2008. She co-starred in The Cake Eaters, an independent film that has been screened only at film festivals. Both the film and Stewart's performance received many positive reviews. Critic Bill Goodykoontz from The Arizona Republic said that Stewart \"really shines.... She excels at both aspects of the performance, giving Georgia a strength that defies any sort of pity one might feel for her, without letting us forget her vulnerability\".\n\n\n=== 2008–2012: International success and The Twilight Saga ===\n\nOn November 16, 2007, Summit Entertainment announced that Stewart would play main character Isabella \"Bella\" Swan in the film Twilight, based on Stephenie Meyer's bestselling vampire romance novel of the same name. Stewart was on the set of Adventureland when director Catherine Hardwicke visited her for an informal screen test, which \"captivated\" the director. She starred alongside Robert Pattinson, who plays Edward Cullen, her vampire boyfriend. The film began production in February 2008 and finished filming in May 2008.\nTwilight was released domestically on November 21, 2008. Stewart's performance garnered mixed reviews with some critics describing her as \"the ideal casting choice\" and praising her for conveying \"Bella's detachment, as well as her need to bust through it;\" others criticized her acting for being \"wooden\" and lacking variety in her facial expressions, which they described as \"blank\".She has been nominated four times, three consecutive years (2003–2005) and in 2008 for the Young Artist Award.\nShe received praise for her role in Adventureland (2009), a comedy-drama film written and directed by Greg Mottola, and co-starring Jesse Eisenberg. Critic James Berardinelli of Reelviews said, \"Stewart is more than merely appealing in this role – she makes Em a fully realized woman, and some of the most intricate development results from what the camera observes in Stewart's eyes.\" Kenneth Turan of the Los Angeles Times said Stewart was \"beautiful, enigmatic and very experienced\". and MSN Movies' James Rocchi stated, \"Stewart's vulnerable, spooky power is used to nice effect.\"  Stewart reappeared as Bella in the sequel, The Twilight Saga: New Moon, once again receiving mixed reviews for her performance. Jordan Mintzer from Variety called Stewart \"the heart and soul of the film\" and praised her for giving \"both weight and depth to dialogue...she makes Bella's psychological wounds seem like the real deal.\"\n\nOn the other hand, Manohla Dargis from The New York Times said Stewart's \"lonely-girl blues soon grow wearisome,\" and Billy Goodykoontz from The Arizona Republic stated \"Stewart is a huge disappointment... She sucks the energy right out of the film\". She reprised this role in The Twilight Saga: Eclipse.\nAt the 2010 82nd Annual Academy Awards, Stewart and Twilight co-star Taylor Lautner presented a tribute in honor of the horror movie genre.In 2009, Stewart starred in The Yellow Handkerchief, which debuted at the Sundance Film Festival and was released into theaters in 2010 by Samuel Goldwyn Films. She also starred alongside James Gandolfini in Welcome to the Rileys, which premiered at the Sundance Film Festival in January 2010.\nIn 2010, Stewart portrayed rock star Joan Jett in The Runaways, a biographical film of the titular band from writer-director Floria Sigismondi. Stewart met with Jett over the 2008–2009 New Year to prepare for the role; she prerecorded songs in a studio for the film. She received praise for her performance: the Metro Times wrote, \"It turns out that Stewart is actually really good at capturing Jett's icy, tough-but-cool girl swagger, adding the needed touches of vulnerability that transform it into a pretty terrific performance... Stewart is a genuine rock star here.\" Also, A. O. Scott of The New York Times noted \"Ms. Stewart, watchful and unassuming, gives the movie its spine and soul.\" The same year, Stewart was listed as the highest-earning actress in Vanity Fair's \"2010's Top Hollywood Top Earners List\", with an estimated earning of $28.5 million for her movie roles in 2010. She won the BAFTA Rising Star Award in 2010 and was awarded the Milan International Film Festival Award for Best Actress in 2011 for Welcome to the Rileys (2010).\nShe was named \"Stonette of the Year\" by High Times in 2010. \n\nThe fourth Twilight film, The Twilight Saga: Breaking Dawn – Part 1, was released on November 18, 2011. Though it received mixed to negative reviews, Stewart's performance was praised. Gabriel Chong called Stewart's work \"mesmerising\" and said that she \"makes [Bella's] every emotion keenly felt that runs the gamut from joy, trepidation, anxiety, distress and above all quiet and resolute determination.\" The Village Voice's Dan Konis said Stewart \"beautifully underplays\" the role. Some critics found Pattinson and Stewart's chemistry lacking and said that the relationship between their characters came off like a \"charade\" onscreen, or that none of the three leads was convincing in his or her role.She concluded the role of Bella Swan in the final film in the series, The Twilight Saga: Breaking Dawn – Part 2, in November 2012. The film, despite mixed critical reception, was a box office success, grossing nearly $830 million worldwide, becoming the 40th highest-grossing film, and the highest-grossing film of the Twilight series. At Rotten Tomatoes, the film currently holds a 48% rotten rating, based on 174 reviews with the consensus stating: \"It is the most enjoyable chapter in The Twilight Saga, but that's not enough to make Breaking Dawn Part 2 worth watching for filmgoers who don't already count themselves among the franchise converts.\"On December 6, 2011, Stewart was named number one on Forbes magazine's list of \"Hollywood's Best Actors for the Buck\". On January 13, 2012, she became the face of a new unnamed Balenciaga perfume; in June, its name was promoted as \"Florabotanica\".Stewart starred as Snow White in the film Snow White and the Huntsman (2012). Stewart appears as Mary Lou in On the Road, the film adaptation of Jack Kerouac's novel of the same name.According to Forbes, Stewart was the highest-paid actress in 2012, with total earnings of $34.5 million. She earned $12.5 million each for the last two installments in the Twilight series, including royalties.\n\n\n=== 2013–present: César Award and new projects ===\nOn February 24, 2013, she presented at the 85th Academy Awards with actor Daniel Radcliffe. On December 11, 2013, Chanel announced that Stewart was its \"new face\" for a Western-inspired fashion collection. The campaign has been shot by Karl Lagerfeld and was released online in May 2014. In 2014, Balenciaga released a new fragrance, Rosabotanica, with Stewart remaining the face of the brand. She was ranked #3 on Forbes' highest-paid actress in 2013, with a total earning of $22 million, #10 in 2014 with $12 million, and #9 in 2015 with $12 million.\n\nCamp X-Ray, her first film of 2014, was premiered at the 2014 Sundance Film Festival on January 17. Her portrayal of a young soldier stationed at Guantanamo Bay detention camp won positive reviews from the critics. David Rooney of The Hollywood Reporter called it \"her best screen work to date [playing the role of] an inexperienced military guard\", while Xan Brooks of The Guardian said, \"It's a role that reminds us what a fine performer she was in the likes of Into the Wild and Adventureland.\". In 2014 she appeared in the music video for Jenny Lewis' \"One of The Guys\", and in The New York Times short movie 9 Kisses.\nStewart next appeared alongside Juliette Binoche and Chloë Grace Moretz in Clouds of Sils Maria. The film had its premiere at 2014 Cannes Film Festival. Her performance in the film earned her critical acclaim. Todd McCarthy of The Hollywood Reporter said that \"Stewart's habitual low-keyed style, which can border on the monotone, functions as effectively underplayed contrast.\" Peter Debruge of Variety praised her, saying that \"Stewart is the one who actually embodies what Binoche's character most fears, countering the older actress’ more studied technique with the same spontaneous, agitated energy that makes her the most compellingly watchable American actress of her generation.\" Robbie Collin of the Daily Telegraph praised her, saying \"...it's Stewart who really shines here. Valentine is probably her best role to date: she's sharp and subtle, knowable and then suddenly distant, and a late, surprising twist is handled with a brilliant lightness of touch.\"For the role Stewart won a César Award for Best Supporting Actress, becoming the first American actress to receive a nomination in thirty years. She is the second American winner after Adrien Brody, who won César Award for Best Actor in 2003.\n\nStewart appeared alongside Julianne Moore in Still Alice, a drama film that had its world premiere at the 2014 Toronto International Film Festival. Her performance received praise from critics. Peter Travers of Rolling Stone called her \"wonderfully vibrant and contentious\" and said: \"Even when Still Alice sometimes slips into sentiment, Moore and Stewart are funny, fierce and glorious.In 2015, she was named #1 on Glamour's list of \"Best Dressed Women\". She appeared in Tim Blake Nelson's Anesthesia, an indie drama about a group of New Yorkers, which was released on January 8, 2016 by IFC Films. She costarred with Jesse Eisenberg again in American Ultra, which was filmed from April to June 2014, and was released on August 21, 2015. In December 2015 she starred in Once and Forever, which was directed by Karl Lagerfeld.\nStewart co-starred along with Nicholas Hoult in Drake Doremus' futuristic love story Equals which was released on July 15, 2016. The filming took place in Japan and Singapore from August to September 2014. In 2015, Stewart was confirmed to join Certain Women directed by Kelly Reichardt; the film was released on October 14, 2016. In 2016, she starred in the Woody Allen movie Café Society, opposite Steve Carell and Jesse Eisenberg, marking her third collaboration with the latter. it was released on July 15, 2016. She also co-starred in Ang Lee's war drama Billy Lynn's Long Halftime Walk, which was released on November 11, 2016. In December 2016, Stewart appeared in the music video for the Rolling Stones' single \"Ride 'Em on Down\".Stewart reunited with Clouds of Sils Maria director Olivier Assayas to lead his film Personal Shopper, a ghost story that takes place in the fashion industry.Stewart wants to direct a film. She told Vanity Fair, \"I think that I'd be pretty good at getting people on the same plane and on the sort of train.\"In 2016 Stewart became the youngest actress to be an honoree at the New York Film Festival. In the same year, Stewart was also an honoree at Elle's Women in Hollywood Awards alongside Amy Adams, Felicity Jones, Anna Kendrick, Aja Naomi King, Helen Mirren, and Lupita Nyong'o.On May 2, 2016, it was announced that Stewart will make her directorial debut with a short film titled Water for female-focused digital publisher Refinery29. The short will be part of their ShatterBox Anthology. In July 2016, it was confirmed that Stewart's short film will be titled Come Swim in an interview with Philippine Daily Inquirer. It had its world premiere at the Sundance Film Festival in January 2017. During the 2017 Sundance Film Festival, Stewart revealed that her next short film will be about gun control. In December 2016, Stewart starred in the official music video for \"Ride 'Em On Down\" by The Rolling Stones.\n\nIn 2017 Stewart coauthored a computer science preprint about the use of Neural net techniques in the making of her short film Come Swim. In 2018, she was a member of the jury for the official competition of the 71st Cannes Film Festival.In February 2017, Stewart hosted Saturday Night Live for the first time with musical guest Alessia Cara.\nStewart was invited to join the Academy of Motion Picture Arts and Sciences in 2017.In 2018, Stewart appeared in Lizzie, opposite Chloë Sevigny, revolving around Lizzie Borden, directed by Craig William Macneill, which had its world premiere at the Sundance Film Festival in January 2018. It is scheduled to be released on September 14, 2018, by Saban Films and Roadside Attractions. She will next appear in JT LeRoy, a biopic revolving around Laura Albert, alongside Laura Dern and Diane Kruger. Underwater, an adventure-thriller film directed and co-written by William Eubank scheduled to be releasedon January 10th, 2020 by 20th Century Fox. She will also appear in Seberg, as actress Jean Seberg, directed by Benedict Andrews. and in Charlie's Angels, alongside Naomi Scott and Ella Balinska, directed by Elizabeth Banks, which is scheduled to be released on November 15, 2019, by Columbia Pictures.In August 2018 it was announced that Stewart would star alongside Riley Keough in a Netflix TV series adaptation of Gina Frangello's novel A Life in Men, which would also be produced by Charlize Theron.Stewart revealed she is working on her feature film directorial debut, which will be an adaptation of writer Lidia Yuknavitch's memoir The Chronology of Water, which she will also write.Stewart appeared in the music video for Interpol's \"If You Really Love Nothing\", which was released on 23 August, 2018.In November 2018, it was reported that Stewart will star in Clea DuVall’s LGBT holiday romance movie Happiest Season.In May 2019, it was announced Stewart is set to play Joan Vollmer, the most prominent female member of the Beat Generation, alongside Ben Foster in his directorial debut. The untitled movie is an adaptation of William S. Burroughs' early works and letters.", "Personal life": "Stewart lives in Los Angeles. She dated her Speak co-star Michael Angarano until early 2009.In summer 2009, she started dating Twilight co-star Robert Pattinson. In July 2012, she was photographed having an affair with her Snow White and the Huntsman director Rupert Sanders. Sanders, who was 19 years older than Stewart and married at the time, issued a public apology for the affair, as did Stewart. Pattinson and Stewart reconciled in October 2012, but eventually split in May 2013.\nIn fall 2016, she briefly dated musician Annie Clark, known professionally as St. Vincent. From late 2016, she was in a relationship with New Zealand model Stella Maxwell until their breakup in fall 2018. She dated stylist Sara Dinkin from December 2018 until May 2019. She resumed dating Maxwell in May 2019.In her February 2017 appearance on Saturday Night Live, Stewart described herself as \"so gay\", and in an interview with The Guardian she clarified that she was bisexual, saying, \"You're not confused if you're bisexual. It's not confusing at all. For me, it's quite the opposite.\" Similarly in an interview with Harper's Bazaar in August 2017, Stewart stated that she was open to dating men again, saying, \"I want to try everything\".She signed her Breaking Dawn Part 2 dress and gave it to a CharityBuzz auction benefiting the Robin Hood Foundation's Sandy Relief Fund, which provides long-term support to those affected by Hurricane Sandy. In 2013, she reportedly raised $500,000 for the Sandy relief effort by meeting with an unnamed \"Middle Eastern Prince\" for 15 minutes.", "In the media": "Stewart was listed as the highest-earning female actress in the Vanity Fair \"Hollywood Top Earners List of 2010\", with estimated earnings of $28.5 million. In 2011, she was named number one on Forbes' list of \"Hollywood's Best Actors for the Buck\". Forbes also named her as the highest-paid actress in 2012, with total earnings of $34.5 million.In 2008 she ranked #17 on Entertainment Weekly's \"30 Under 30\" the actress list, and she was also named the Movie Fanatic's Hottest Young Actress, and she also was ranked #9 on Moviefone’s “The 25 Hottest Actors Under 25\".\nShe was ranked #3 in FHM Online's \"Sexiest Women in the World\", and ranked #13 in the magazine's list of \"Sexiest Women in the World\".She ranked #7 on AskMen's list of Top 99 Women for 2013.Stewart is the brand ambassador of Chanel and Balenciaga fashion brands.", "Filmography": "=== Film ===\n\n\n==== As actress ====\n\n\n==== As director ====\n\n\n=== Television ===\n\n\n=== Music videos ===", "Awards and nominations": "Stewart has received a César Award, a Milano Film Festival award, a Young Artist Award and the BAFTA Rising Star Award. She won the National Society of Film Critics, New York Film Critics Circle, and Boston Society of Film Critics Award for Best Supporting Actress for her performance in Clouds of Sils Maria.", "References": "", "External links": "Kristen Stewart on IMDb \nKristen Stewart at Box Office Mojo"}