{"_id": "96", "name": "Chris Pine", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:23", "biography": "Christopher Whitelaw Pine (born August 26, 1980) is an American actor. Pine made his feature debut as Lord Devereaux in The Princess Diaries 2: Royal Engagement (2004), and is known for playing James T. Kirk in the Star Trek reboot film series (2009–2016), Will Colson in Unstoppable (2010), Cinderella's Prince in Into the Woods (2014), Jack Ryan in Jack Ryan: Shadow Recruit (2014), Toby Howard in Hell or High Water (2016), Bernie Webber in The Finest Hours (2016), Steve Trevor in Wonder Woman (2017), Dr. Alexander Murry in A Wrinkle in Time (2018), and Robert the Bruce in Outlaw King (2018).", "Early life": "Pine was born at Cedars Sinai Hospital in Los Angeles, California. His father, Robert Pine, is an actor who co-starred on CHiPs as Sergeant Joseph Getraer, and his mother, Gwynne Gilford, is a former actress who became a practicing psychotherapist. He has an older sister, Katie. His maternal grandmother, Anne Gwynne, was a Hollywood actress, and his maternal grandfather, Max M. Gilford, was an attorney who was elected president of the Hollywood Bar Association. Pine's maternal grandfather was from a Russian Jewish family.Pine graduated from the University of California, Berkeley in 2002 with a B.A. in English. When he got to Berkeley, Pine was initially scared of looking for a place to fit in and had a hard time making friends. As he was not interested in joining a fraternity, he got into theater. As a member of the UC Berkeley Theater Department, Pine performed in a Caryl Churchill play in La Val's Pizza's Subterranean Theater and performed Orestes and Shakespeare at Zellerbach Hall.He was an exchange student at the University of Leeds in England for one year. After graduating from Berkeley, he attended the Williamstown Theatre Festival, and he studied at the American Conservatory Theater in San Francisco.", "Career": "=== 2003–2010 ===\n\nPine's first acting role was in a 2003 episode of ER; the same year, he also appeared in episodes of The Guardian and CSI: Miami.In 2004, he appeared in Why Germany?, a short film; and in The Princess Diaries 2: Royal Engagement. Pine played the part of Nicholas Devereaux, the love interest of Anne Hathaway's leading character. In 2005, Pine appeared in an episode of the series Six Feet Under, as well as in Confession, an independent film that was released directly to video, and The Bulls, another short film.Pine appeared in the made-for-television film Surrender, Dorothy which aired in early 2006. He played Jake Hardin in the American film Just My Luck, a romantic comedy in which he starred opposite Lindsay Lohan. The film was released on May 12, 2006. Later that year, Pine appeared in the comedy Blind Dating, and in the action film Smokin' Aces. Pine did the one-man play The Atheist, at Center Stage, New York, in late 2006. In 2007, he starred opposite Scott Wolf in the Los Angeles production of Neil LaBute's play Fat Pig, winning positive reviews for his depiction of a competitive, alpha-male friend. He portrayed real-life Napa Valley vintner Bo Barrett in the 2008 film Bottle Shock.In 2007, Pine turned down a role in a film adaptation of White Jazz, to accept the part of James T. Kirk in the 2009 Star Trek film, which was released to critical and viewer acclaim in May of that year. That same month, he made a brief appearance promoting the film on Saturday Night Live, with co-stars Zachary Quinto and Leonard Nimoy.During the rest of the summer of 2009, he appeared in the Los Angeles production of the Beau Willimon play Farragut North. Pine appeared in the Los Angeles production of The Lieutenant of Inishmore during the summer of 2010, for which he won the Los Angeles Drama Critics Circle's lead appearance award.In the fall of 2009, Pine began filming the action film Unstoppable, directed by Tony Scott and written by Mark Bomback, which was released in November 2010. In the film, he played a young train conductor who helped a veteran railroad engineer (Denzel Washington) stop an unmanned, half mile long runaway freight train carrying toxic liquids and poisonous gases from wiping out a nearby city. The Hollywood Reporter named Pine as one of the young male actors who are \"pushing—or being pushed\" into taking over Hollywood as the new \"A-List\".\n\n\n=== 2011–present ===\nIn 2011, Pine sat down with the actor who originated the role of Captain Kirk more than forty years earlier, William Shatner, for the feature length documentary The Captains, which Shatner wrote and directed. The film sees Shatner interview Pine about his career and how it felt to take the role of Kirk for the 2009 movie. Their interview features a scene where the pair arm wrestles; pictures of this incident \"went viral\" leading to Internet headlines such as \"Kirk v. Kirk\" and others.Pine filmed the romantic comedy This Means War, with Reese Witherspoon and Tom Hardy, during the fall of 2010, in Vancouver. This Means War was released in February 2012. Pine voiced the character of Jack Frost in Rise of the Guardians. Pine co-starred with Elizabeth Banks, Olivia Wilde and Michelle Pfeiffer in the family drama People Like Us, which was filmed in early 2011 and released in June 2012. He reprised the role of Captain Kirk in the sequel to 2009's Star Trek, Star Trek Into Darkness, released in the US on May 15, 2013.In 2009, Pine entered talks to play CIA analyst Jack Ryan in a reboot of Tom Clancy's novels. He starred in Jack Ryan: Shadow Recruit, which was released in 2014. Pine was the fourth actor to play the character, after Alec Baldwin, Harrison Ford, and Ben Affleck.In 2014, Pine was in talks to star in a thriller about the United States Coast Guard, The Finest Hours, released in January 2016. He guest-starred in Netflix's Wet Hot American Summer: First Day of Camp and lent his voice for SuperMansion in 2015.In May 2015, Pine was confirmed to play one of the Howard brothers, along with Ben Foster, in Hell or High Water (originally called Comancheria). Filming started on May 26, 2015 in New Mexico. The film premiered at the 69th annual Cannes Film Festival in May 2016 and was released in August 2016. He reprised the role of Captain Kirk in Star Trek Beyond. Filming began in June 2015 in Canada, and it was released in the US on July 22, 2016.\n\nOn July 14, 2016, he received his first Emmy Award nomination in \"Outstanding Character Voice-Over Performance\" for his work on the series SuperMansion.Pine was invited by Barbra Streisand to duet with her on her album, Encore: Movie Partners Sing Broadway, along with other stars.In 2015, Pine was cast as Steve Trevor, opposite Gal Gadot, in the superhero film Wonder Woman, which was released in June 2017. Also in 2017, he reprised his roles in SuperMansion season 2 and Wet Hot American Summer: Ten Years Later, guest-starred in Angie Tribeca season 3 (including an episode where his father was also a guest star), and narrated the final episode of National Geographic Channel's Breakthrough season 2.In 2018, Pine played Dr. Alexander Murry in the fantasy film A Wrinkle in Time, based on the novel of the same name, and starred as Robert the Bruce in Outlaw King. The latter project began filming on August 21, 2017 in Scotland, and was released on Netflix on 9 November 2018. Also that year, Pine voiced a version of Peter Parker / Spider-Man in the animated film Spider-Man: Into the Spider-Verse. In August 2018, it was reported that Pine would not be reprising his role as Captain Kirk in the fourth film of the Star Trek film series after contract negotiations fell through.In July 2017, the US cable network TNT announced Pine would play the role of Jay Singletary in a six-episode television drama, One Day She'll Darken. He also served as an executive producer alongside director Patty Jenkins and writer Sam Sheridan. The show, ultimately titled I Am the Night, began airing in January 2019.\n\n\n=== Upcoming roles ===\nIn May 2017, Pine was in negotiations to star in a film adaptation of the novel, All the Old Knives, opposite Michelle Williams. On September 5, 2017, it was announced that Pine is set to star as Robert F. Kennedy in a limited series on Hulu, produced by Sony Pictures Television. He will also serve as an executive producer for the series, based on the Larry Tye biography Bobby Kennedy: The Making Of A Liberal Icon.On June 13, 2018, director Patty Jenkins announced through Twitter that Pine will appear in the Wonder Woman sequel Wonder Woman 1984 as Steve Trevor.  In May 2019, it is announced that Pine will star in action-thriller “Violence of Action”. In August 2019, it is reported that Pine will play Walter Cronkite in Newsflash, a drama movie about how media reported the Assassination of  JFK.", "Personal life": "Pine has stated, \"I definitely have a spiritual outlook... I am not a religious guy, I am probably agnostic.\"On March 1, 2014, while filming Z for Zachariah in New Zealand, Pine was arrested by police near Methven after failing to pass a routine roadside breath alcohol test. He pleaded guilty to drunk driving on March 17, stating that he drank four vodkas at a local pub. Pine was disqualified from driving in New Zealand for six months and ordered to pay NZ$93 in reparation. He had a clean record, and the judge said that \"the incident was out of character.\"Politically, Pine has called himself a \"left-leaning liberal.\" He has stated that both Democrats and Republicans tend to be interchangeable when it comes to certain actions, citing President Obama's strengthening of the Patriot Act.During the 2016 presidential campaign, Pine along with fellow Star Trek coworkers J.J. Abrams, John Cho, Simon Pegg, Zachary Quinto, Zoe Saldana, Karl Urban, George Takei, Justin Lin, Bryan Fuller, and Adam Nimoy, endorsed a movement called Trek Against Trump. The movement endorsed Hillary Clinton.On November 1, 2016, Pine, along with director Joss Whedon, released a video urging people to vote in the upcoming elections. While the video was a parody of Congress in general, certain commentators took the video to represent the Republican Congress.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===\n\n\n=== Music videos ===\n\n\n=== Theater ===", "Discography": "=== Soundtracks ===\n\n\n=== Miscellaneous ===", "Awards and nominations": "", "References": "", "External links": "Chris Pine on IMDb \nChris Pine at the TCM Movie Database \nChris Pine at AllMovie"}