{"_id": "78", "name": "Kevin Costner", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:03", "biography": "Kevin Michael Costner (born January 18, 1955) is an American actor, director, producer, and musician. His accolades include two Academy Awards, three Golden Globe Awards, one Primetime Emmy Award, and two Screen Actors Guild Awards.\nCostner began his acting career with Sizzle Beach, U.S.A. (1981). Following a few minor supporting parts, he rose to prominence with his  portrayal of Eliot Ness in The Untouchables (1987). This was followed by a successful period in his career with starring roles in No Way Out (1987), Bull Durham (1988), Field of Dreams (1989), Dances with Wolves (1990), for which he won two Academy Awards, JFK (1991), Robin Hood: Prince of Thieves (1991), The Bodyguard (1992), and A Perfect World (1993). In 1995, Costner starred in and co-produced Waterworld. The most expensive film ever made at the time, it was a major box office disappointment which marked a downturn in his career. His second directorial feature The Postman (1997) was another disappointment. He has since starred in numerous less-successful films including Message in a Bottle (1999), For Love of the Game (1999), Thirteen Days (2000), 3000 Miles to Graceland (2001), Dragonfly (2002),  Rumor Has It (2005), The Guardian (2006), Mr. Brooks (2007), 3 Days to Kill (2014), McFarland, USA (2015), Draft Day (2014), and Criminal (2016). Nevertheless in recent years he has had supporting parts in critically favored films including The Upside of Anger (2005), Man of Steel (2013), Hidden Figures (2016), Molly's Game (2017), and  The Art of Racing in the Rain (2019).\nOn television, Costner portrayed Devil Anse Hatfield in \nthe miniseries Hatfields & McCoys (2012), winning the Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie. Since 2018, he stars as John Dutton on drama series Yellowstone.", "Early life": "Costner was born on January 18, 1955 in Lynwood, California, and grew up in Compton, California. He is the youngest of three boys, the middle of whom died at birth. His mother, Sharon Rae (Tedrick), was a welfare worker, and his father, William Costner, was an electrician and later utilities executive at Southern California Edison. His father's heritage originates with German immigrants to North Carolina in the 1700s, and Costner also has English, Irish, Scottish, and Welsh ancestry. Costner was raised Baptist. He was not academically inclined. He enjoyed sports (especially football), took piano lessons, wrote poetry, and sang in the First Baptist Choir. He has stated that a viewing of the 1962 film How the West Was Won at the age of seven had \"formed\" his childhood.He has described spending his teenage years in various parts of California as his father's career progressed, as a period when he \"lost a lot of confidence\", having to make new friends often. Costner lived in Ventura, then in Visalia; he attended Mt. Whitney High School and moved to Orange County, where he graduated from Villa Park High School in 1973. He earned a BA in marketing and finance from California State University, Fullerton (CSUF) in 1978. While at CSUF, he became a brother in the Delta Chi Fraternity.Costner became interested in acting and dancing while in his last year of college, and upon graduation he married Cindy Silva, who worked at Disneyland as Cinderella. The couple honeymooned in Puerto Vallarta; on the return plane journey, they had a chance encounter with actor Richard Burton, who had purchased all the seats around him for solitude. Burton agreed to speak to Costner after he finished reading his book. Costner, who had been taking acting classes but had not told his wife about his desire to be an actor, watched Burton closely and approached when Burton gestured. Costner told Burton that he would prefer to avoid the drama that followed Burton and asked if he would have to tolerate that if he became an actor. Burton replied, \"You have blue eyes, I have blue eyes. I think you'll be fine.\" After the plane landed, Burton's limousine pulled up to the curb where Costner and his wife were waiting for a taxi. Burton wished Costner good luck, and the two never met again. Costner credits Burton with partially contributing to his career. \nHaving agreed to undertake a job as a marketing executive, Costner began taking acting lessons five nights a week, with the support of his wife. His marketing job lasted 30 days. He took work which allowed him to develop his acting skills via tuition, including working on fishing boats, as a truck driver, and giving tours of stars' Hollywood homes to support the couple while he also attended auditions", "Career": "Costner made his film debut in the film Sizzle Beach, U.S.A. (known originally as Hot Malibu Summer). Filmed in the winter of 1978–79, the film was not released until 1981 and re-released in 1986. The release complications and lack of documentation lead many to believe that Costner's debut was in The Touch also known as (Stacy's Knights), in 1983 with Eve Lilith and Andra Millian. Costner made a brief appearance in the Ron Howard film Night Shift (1982). He is listed in the credits as 'Frat Boy No. 1' and appears at the climax of a frat-style, blow-out party in the New York City morgue, when the music is suddenly stopped by a frantic Henry Winkler. Costner can be seen holding a beer and looking surprised at the sudden halt of celebration.\n\nCostner appeared in a commercial for the Apple Lisa and Table for Five in 1983, and, the same year, had a small role in the nuclear holocaust film Testament. Later, he was cast in The Big Chill and filmed several scenes that were planned as flashbacks, but they were removed from the final cut. His role was that of Alex, the friend who committed suicide, the event that brings the rest of the cast together.  Costner was a friend of director Lawrence Kasdan, who promised the actor a role in a future project. That became Silverado (1985) and a breakout role for Costner. He also starred that year in the smaller films Fandango and American Flyers and appeared alongside Kiefer Sutherland in an hour-long special episode of Steven Spielberg's Amazing Stories.\nCostner achieved movie star status in 1987, when he starred as federal agent Eliot Ness in The Untouchables and in the leading role of the thriller No Way Out. He solidified his A-list status in the baseball-themed films Bull Durham (1988) and Field of Dreams (1989). In 1990, he partnered with producer Jim Wilson to form the production company Tig Productions. Tig's first film was the epic Dances with Wolves which Costner directed and starred in. This film was nominated for 12 Academy Awards and won seven, including two for him personally (Best Picture and Best Director). The same year saw the release of Revenge, in which he starred along with Anthony Quinn and Madeleine Stowe, directed by Tony Scott; Costner had wanted to direct it himself.\nCostner followed with Robin Hood: Prince of Thieves (1991); the Oliver Stone-directed JFK (1991); The Bodyguard (1992); and Clint Eastwood's A Perfect World (1993); all of which provided box office or critical acclaim. He took the title role in the biopic Wyatt Earp (1994), directed by Kasdan. The War, also made in 1994, seemed to gain little attention. The science fiction-post-apocalyptic epics Waterworld (1995) and The Postman (1997), the latter of which Costner also directed, were both commercial disappointments and both largely regarded by critics as artistic failures. However, results for The Postman were worse than Waterworld and it ended up \"winning\" five Golden Raspberry Awards, including Worst Picture, Worst Actor and Worst Director for Costner. Costner starred in the golf comedy Tin Cup (1996) for Ron Shelton, who had previously directed him in Bull Durham. He developed the film Air Force One and was set to play the lead role of the President, but ultimately decided to concentrate on finishing The Postman instead. He personally offered the project to Harrison Ford. In 1999, he starred in Message in a Bottle  with Robin Wright, based on the novel of the same name by Nicholas Sparks.\n\nHis career revived somewhat in 2000 with Thirteen Days, in which he portrayed Kenneth O'Donnell, a top adviser to John F. Kennedy. The western Open Range, which he directed and starred in, received critical acclaim in 2003, and was a surprise success commercially. He received some of his best reviews for his supporting role as retired professional baseball player Denny Davies in The Upside of Anger, for which he received a nomination from the Broadcast Film Critics Association and won the San Francisco Film Critics Circle Award for Best Supporting Actor. After that, Costner starred in The Guardian and in Mr. Brooks, in which he portrayed a serial killer. In 2008, his Tig Productions company closed and was changed to Tree House Films. In 2008, Costner starred in Swing Vote. He starred opposite Jennifer Aniston in the 2005 movie Rumour Has It. Costner was honored on September 6, 2006, when his hand and foot prints were set in concrete in front of Grauman's Chinese Theatre alongside those of other celebrated actors and entertainers. In 2010, he appeared in The Company Men alongside Ben Affleck, Tommy Lee Jones and Chris Cooper. It debuted at the Sundance Film Festival, and received good reviews. It was released in cinemas worldwide in January 2011. The film was considered to be an Oscar contender, but did not get a nomination.\nCostner announced that he would be returning to the director's chair for the first time in seven years, in 2011, with A Little War of Our Own. He was also about to team up again with director Kevin Reynolds in Learning Italian. Neither film has been made as of February 2017.\nHe also appears, as a special cameo, in Funny or Die's \"Field of Dreams 2: Lockout\". Costner portrayed Jonathan Kent in the rebooted Superman film Man of Steel, directed by Zack Snyder. Costner was going to have a role in Quentin Tarantino's Django Unchained, but had to drop out due to scheduling conflicts.\nCostner starred in the three-part miniseries Hatfields & McCoys, which premiered on May 28, 2012, on the History Channel. It broke a record by pulling 13.9 million viewers. The miniseries tells the true American story of a legendary family feud – one that spanned decades and nearly launched a war between Kentucky and West Virginia. The role earned Costner the 2012 Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie, the 2013 Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Miniseries or Television Movie, and the 2013 Golden Globe Award for Best Performance by an Actor in a Limited Series or a Motion Picture Made for Television.In 2014, Costner appeared in the spy movie Jack Ryan: Shadow Recruit, as Thomas Harper, a mentor for the series' title character. The same year, he starred in the thriller 3 Days to Kill and the drama Draft Day and produced and starred in Black or White. Black or White premiered at the 2014 Toronto International Film Festival and opened in the United States in 2015. In 2015, Costner played coach Jim White in the drama film McFarland, USA, about cross-country running. In 2016, he played the fictional character Al Harrison, a NASA Space Task Group supervisor, in Hidden Figures, and in 2017, he starred with Jessica Chastain in Aaron Sorkin's directorial debut film Molly's Game. In 2018, he has appeared in the television series Yellowstone, marking the first regular TV series role of his career.", "Other ventures": "=== Country music ===\n\nCostner is the singer in Kevin Costner & Modern West, a country rock band which he founded with the encouragement of his wife Christine. In October 2007, they began a worldwide tour which included shows in Istanbul and Rome. The group also performed at NASCAR Sprint Cup Series races at Daytona International Speedway and Charlotte Motor Speedway in Concord, North Carolina.\nThe band released a country album, Untold Truths, on November 11, 2008, on Universal South Records. The album peaked at No. 61 on the Billboard Top Country Albums and No. 35 on the Top Heatseekers chart. Three singles (\"Superman 14\", \"Long Hot Night\" and \"Backyard\") have been released to radio, although none have charted. For the single \"Superman 14\" a live music video was made.\nIn 2009, they went on tour with opening act The Alternate Routes. In August, at the Big Valley Jamboree in Camrose, Alberta, Costner and the band were scheduled next on stage when a severe thunderstorm struck, collapsing the stage and stands on the main stage. One person was reported dead and forty injured. Later, an auction was held to raise money for the two young sons of the woman killed. A dinner with Costner was auctioned off for $41,000. Two guitars, one autographed by Costner, helped raise another $10,000 each.A second Kevin Costner and Modern West album, Turn It On, was released in February 2010 in Europe and was supported by a European tour. In July 2012, the band performed in Halifax, Nova Scotia, at the 20th annual Telus World Skins Game in support of the IWK Health Centre Foundation, donating a guitar personally autographed by Costner.Kevin Costner has also appeared in the documentary film Country Roads by Marieke Schröder.\n\n\n=== Baseball ===\nSeveral of Costner's films have included a baseball theme: Chasing Dreams, Bull Durham, Field of Dreams, For Love of the Game, and The Upside of Anger, in three of which his character is a pro baseball player and one a former pro baseball player.\nCostner has a home in Austin, Texas, and sometimes appears at Texas Longhorns baseball practices and games. He was a close friend of former Longhorns baseball coach Augie Garrido from Garrido's days coaching at Cal State Fullerton, Costner's alma mater. He cast Garrido to play the role of the Yankee manager in For Love of the Game. He tries to attend every College World Series game that CSUF Titans plays in Omaha, Nebraska. Costner walked-on for a try-out, but did not make the team early in his time at the university.\nCostner was a partial owner of the Zion, Illinois-based Lake County Fielders independent baseball team in the North American League. The Fielders name was an homage to Field of Dreams, with the logo showing a ballplayer standing amid a field of corn.\n\n\n=== Business interests ===\n\nIn 1995, Costner began developing oil separation machines based on a patent he purchased from the US government. The machines developed by the company were of little commercial interest until the Deepwater Horizon oil spill, when BP took six of the machines from a company in which Costner owned an interest, Ocean Therapy Solutions, for testing in late May 2010. On June 16, 2010, BP entered into a lease with Ocean Therapy Solutions for 32 of the oil-water separation devices. Although Spyron Contoguris and Stephen Baldwin previously sold their interests in Ocean Therapy Solutions in mid-June to another investor in the company, they filed a lawsuit in Louisiana District Court claiming $10.64 million for securities fraud and misrepresentation. The suit claimed that Costner kept a meeting with BP secret from them, and the secret meeting resulted in an $18-million down payment on a $52 million purchase, and that after the down payment, but before any announcement, another investor used part of the downpayment to buy out their shares, thus excluding them from their share of the profits from the total sale. The suit claimed that, despite public statements by Costner, Ocean Therapy Solutions, BP and others to the contrary, Baldwin and Contogouris were told that BP was still testing the machines and had not yet committed to lease the machines from Ocean Therapy Solutions and that the other investor in Ocean Therapy Solutions purchased their shares for $1.4 million to Baldwin and $500,000, to Contogouris. In June 2012, a federal jury in Louisiana deliberated for less than 2 hours before rejecting Baldwin's and Contogouris' claims in the multimillion-dollar oil-clean-up case, and the court ordered Baldwin and Contogouris to reimburse Costner and the other defendants in the case for their costs.On June 6, 2004, Costner opened Tatanka: The Story of the Bison one mile south of Deadwood, South Dakota, on U.S. Route 85, for what he hoped would be an educational and emotional place for people to learn about America's westward expansion. Promoters stated in a news release that the $5-million attraction had a new, 3,800-square-foot interactive center featuring exhibit, retail, and food and beverage areas, as well as offices and a small orientation theater. The visitor center features graphics, photographs, and text describing how bison came to North America and how Native American tribes used the animals for food, clothing, shelter, and other needs. The centerpiece is a bronze sculpture depicting a buffalo jump commonly used by Plains Indians to kill and process large numbers of animals on which they depended for survival. Hill City artist Peggy Detmers created 14 bronze bison in the act of running from their pursuers and three bronze Lakota riders on horseback. Three of the massive bison are posed in midair, cascading over the face of a cliff. Costner commissioned the work in 1994 from Detmers. The five-fourths-scale bronzes, each weighing between 2,500 and 8,000 pounds, were cast at Eagle Bronze Foundry in Lander, Wyoming. The encampment features living Lakota interpreters of history, dressed in period attire and settled among their tipis.In July 2004, Costner fired Francis and Carla Caneva, who managed the Midnight Star casino in Deadwood. A judge subsequently ordered Costner to pay a percentage of $6.1 million to buy out the Canevas as his business partners. In October 2006, Costner asked the South Dakota Supreme Court to re-examine the ruling, as an accountant hired by the actor had determined the market value of the casino to be $3.1 million.\n\n\n=== Philanthropy ===\nCostner serves on an honorary board for the National World War I Museum in Kansas City, Missouri. In spring 2011, he recorded two radio spots for the museum that were aired on Kansas City Royals Radio Network.\n\n\n=== NASCAR ===\nCostner was named ceremonial Grand Marshal of the NASCAR Cup Series' Auto Club 500 which took place on February 25, 2007, at the California Speedway. In 2008, he worked with the NASCAR Media Group and CMT Films to help produce the NASCAR Documentary The Ride of Their Lives which would be released in 2009. Costner would be the narrator for that documentary. Also in 2009, he was named the spokesman for NASCAR Day which took place on 15 May. The next day, 16 May, he and his country music band would perform in the infield of Charlotte Motor Speedway as well as participate as a judge in the 2nd annual Victory Challenge before the 25th Running of the NASCAR Sprint All-Star Race.", "Personal life": "While in college, Costner started dating fellow student Cindy Silva in March 1975, and in their subsequent marriage three years later they had  three children. The couple divorced in 1994 after 16 years of marriage. He has a son with Bridget Rooney, with whom he had a brief relationship following his divorce, and then dated Birgit Cunningham. In 1996, he lived with supermodel Elle Macpherson.On September 25, 2004, Costner married his girlfriend of four years, model and handbag designer Christine Baumgartner, at his ranch in Aspen, Colorado. They have three children.", "Political activism": "Early in his life, Costner was a Republican. He was a supporter and good friend of Ronald Reagan, frequently playing golf with the former President. He later grew disillusioned with the direction of the party, eventually switching his affiliation in the early 1990s. Since 1992, Costner has financially supported a variety of Democratic politicians, including Al Gore and Tom Daschle, but also made contributions to Republican Phil Gramm as late as 1995. He said publicly in 2008 that he has no ambition to run for political office, adding \"I've lived quite a colorful life\".In the final days before the 2008 election, Costner campaigned for Barack Obama, visiting various places in Colorado, where he has a home. In his speech, Costner stated the need for young voters to get to the polls, early and with enthusiasm. \"We were going to change the world and we haven't\", Costner said at a Colorado State University rally. \"My generation didn't get it done, and we need you to help us\".In October 2014, Costner sent a tribute to British troops serving around the world thanking them for their work.", "Awards and nominations": "", "References": "", "External links": "Official website \nKevin Costner at the Encyclopædia Britannica\nKevin Costner on IMDb \nKevin Costner at Box Office Mojo\nKevin Costner at AllMovie\nKevin Costner at the TCM Movie Database \nKevin Costner in the Hollywood Walk of Fame Directory"}