{"_id": "87", "name": "Daisy Ridley", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:30:13", "biography": "Daisy Jazz Isobel Ridley (born 10 April 1992) is an English actress. Born in Westminster and brought up in Maida Vale, Ridley trained in drama at the Tring Park School for the Performing Arts. She began acting in minor guest roles on television and in short films, making her film debut in the independent horror film Scrawl (2015). \nRidley rose to international prominence for playing the lead role of Rey in the Star Wars sequel trilogy, starring in Star Wars: The Force Awakens (2015), Star Wars: The Last Jedi (2017), and the upcoming Star Wars: The Rise of Skywalker (2019). She has also appeared in the mystery film Murder on the Orient Express (2017) and provided her voice to the animated film Peter Rabbit (2018).", "Early life": "Daisy Ridley was born on 10 April 1992 in Westminster, London, and grew up in Maida Vale. She is the youngest of three daughters born to Louise Fawkner-Corbett, a banker, and Christopher Ridley, a photographer. She has two older sisters, Kika Rose and Poppy Sophia. Her mother's family, the Fawkner-Corbetts, were landed gentry with a military and medical background. Her great-uncle was Dad's Army actor and playwright Arnold Ridley; his brother, Daisy's grandfather, John Harry Dunn Ridley, O.B.E., was head of the Engineering Secretariat at the B.B.C. from 1950 to 1965. While growing up, her favourite film was Matilda (1996), an adaptation of Roald Dahl's children's story, with the title character (played by Mara Wilson in the film) a role model to her. Ridley won a scholarship to Tring Park School for the Performing Arts in Hertfordshire, which she attended between the ages of 9 and 18. She then began reading classical civilisation at Birkbeck, University of London, before dropping out to concentrate on her acting career. Prior to being cast in The Force Awakens, Ridley worked as a barmaid in two different pubs in London for nearly two years. In 2016 Ridley began studying for a Bachelor of Arts in social science through online courses with the Open University.", "Career": "=== 2013–2015: Early roles and Star Wars breakthrough ===\nRidley began her career with minor roles in the television programmes Youngers, Toast of London, Silent Witness, Mr Selfridge, and Casualty. She appeared in the short film Blue Season, which was entered into the Sci-Fi-London 48-Hour Film Challenge. Ridley played the lead in film three of Lifesaver, an interactive film which was nominated for a BAFTA Award. She also appeared in the music video for Wiley's song \"Lights On\", playing the character of Kim. Ridley made her film debut in the 2015 British independent horror film Scrawl, after her scenes from the British comedy film The Inbetweeners 2 were removed in the final cut.\n\nIn April 2014, Ridley's casting as Rey, one of the lead characters in Star Wars: The Force Awakens, was announced. She was chosen for the film in February 2014. At the time of her casting she was, according to Rolling Stone, a \"total unknown.\" Her choice by director J. J. Abrams was seen as a repeat of George Lucas's move of casting relatively unknown actors for the lead roles in the first Star Wars film in 1977. Ridley began filming her scenes in May 2014 at Pinewood Studios in Buckinghamshire, and prior to the film's release in December 2015, she appeared at the launch of a set of Star Wars postage stamps issued by the UK postal service Royal Mail, with her character Rey featuring on a stamp along with the droid BB-8. With international revenues of over $2 billion, The Force Awakens was a major box-office hit and the highest-grossing film of 2015. After an early screening of the film, Brian Viner of the Daily Mail called Ridley the \"real star of the show\", adding that her performance as Rey should \"send her career into orbit.\" Her performance received critical acclaim, with Richard Roeper describing her portrayal as \"a breakout performance\" and adding \"Ford has a terrific father figure chemistry [shared] with Ridley and [John] Boyega\".\n\n\n=== 2016–present: After The Force Awakens ===\nRidley became executive producer of the documentary The Eagle Huntress in January 2016. Director Otto Bell said of her commitment, \"Like so many other theatergoers around the world, I was blown away by Daisy's recent portrayal of an empowered female protagonist. I'm thrilled she'll be bringing that same energy to supporting a real-world heroine who is also on an epic journey to win victory in a far away land.\" The movie premiered at the Sundance Film Festival on 24 January 2016, with Ridley narrating. She was one of several actors featured on Barbra Streisand's 2016 album Encore: Movie Partners Sing Broadway. Along with Anne Hathaway, Ridley and Streisand perform the song \"At the Ballet\" from A Chorus Line, with Ridley performing the role of Bebe, one of a trio of dancers hoping to be cast in an upcoming show.In 2017, Ridley portrayed Mary Debenham in Murder on the Orient Express, an adaptation of Agatha Christie's detective novel of the same name. Directed by and starring Kenneth Branagh, production began in London in November 2016. She also reprised her role as Rey, opposite Mark Hamill as Luke Skywalker, in Star Wars: The Last Jedi, which was released in December 2017.In January 2018, Ridley starred in the titular role in Ophelia, a reimagining of the Hamlet tale, alongside Naomi Watts and Clive Owen. The project was filmed from April to July 2017 and debuted at the 2018 Sundance Film Festival. In February 2018, Ridley voiced the role of Cottontail in Peter Rabbit, an adaptation of the children's stories of the same name by Beatrix Potter.\n\n\n==== Upcoming roles ====\nIn March 2019, Ridley will co-star in the Chaos Walking, an adaptation of the young adult novel by Patrick Ness, as Viola Eade opposite Tom Holland as Todd Hewitt. The project was filmed from August to November 2017. In December 2019, Ridley will reprise her role as Rey in Star Wars: The Rise of Skywalker, the last film in the sequel trilogy, filming in the summer of 2018. She won't reprise Rey any more after this film.Also in 2018, Ridley will film Daddio, a film that follows a woman who is picked up by a cab at JFK airport and driven to her apartment in Manhattan. On the way there, the woman and cabdriver begin discussing their past and current relationships and the effects those relationships have had on their lives. Additionally, Ridley will reteam with director J. J. Abrams for Kolma, which Abrams will also produce, a supernatural drama that finds a young woman who has suffered from a car crash that killed her boyfriend. When she dies decades later, she is given the choice of returning to the day of the accident to live her life again or being reunited with her love. Ridley will star in The Lost Wife as Lanka, a Polish art student who has a love affair with her best friend's older brother that is torn apart by the German invasion during the onset of World War II. Ridley has also signed on to star in A Woman of No Importance, another Abrams-produced biographical political-thriller film based on Sonia Purnell's book of the same name. Ridley will portray American heiress and super-spy Virginia Hall, who attempted to break into the ranks of the American Foreign Service in the years before World War II. Ridley will reteam with actor Josh Gad in the superhero-comedy Super-Normal, to be released by Netflix. Ridley will also star in Piece of Mind.", "Personal life": "Ridley has a tattoo of three stars on her left foot that she got when she was 15, a tattoo of the alchemical symbol of air on her right hip, and a peace symbol tattoo behind her right ear. As of April 2016, Ridley has a dog named Muffin. Ridley supports Premier League football club Arsenal F.C. Ridley has appeared in People magazine's World's Most Beautiful 2016 list. Her rise to stardom saw Ridley appear on Debrett's 2016 list of the most influential people in the UK.Ridley suffers from endometriosis and polycystic ovaries, which required her to undergo multiple laparoscopic surgeries. She said on Instagram that she was diagnosed with the condition at the age of 15, and said it caused acne that lowered her self-esteem.In August 2016, after receiving criticism for posting an anti-gun violence message on her Instagram account, Ridley deleted her Instagram account. The actress briefly returned to Instagram and said that the reason behind the deletion was because she had \"a busy few months ahead and [so] wanted less distractions.\"", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Theatre ===\n\n\n=== Music videos ===\n\n\n=== Video games ===", "Awards and nominations": "", "References": "", "External links": "Daisy Ridley on IMDb"}