{"_id": "57", "name": "Letitia Wright", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:46", "biography": "Letitia Michelle Wright (October 31, 1993), is a Guyanese-English actress. Beginning her professional career in 2011, she has played roles in several British TV series, including Top Boy, Coming Up, Chasing Shadows, Humans, the Doctor Who episode \"Face the Raven\" and the Black Mirror episode \"Black Museum\"; for the latter she received a Primetime Emmy Award nomination for Outstanding Supporting Actress in a Limited Series or Movie.\nThe British Academy of Film and Television Arts named Wright among the 2015 group of BAFTA Breakthrough Brits for her role in the award-winning film Urban Hymn. In 2018, she achieved global recognition for her portrayal of Shuri in the Marvel Cinematic Universe films Black Panther (2018), Avengers: Infinity War (2018) and Avengers: Endgame (2019), with the latter becoming the highest-grossing film of all time. In 2019, she received the BAFTA Rising Star Award.", "Early life": "Wright was born in Georgetown, Guyana. Her family moved to London when she was seven years old and she attended school there. Having been brought up in Tottenham and attending Duke's Aldridge Academy, she has stated, \"I'll always be a north London girl.\"", "Career": "Wright performed in school plays as a child, but credits her desire to be a professional actress to the 2006 film Akeelah and the Bee. She found Keke Palmer's performance inspiring, remarking that the role \"resonated. It's one of the reasons why I'm here\". She attended the Identity School of Acting, enrolling at the age of 16. She appeared in two episodes of Holby City and Top Boy in 2011. She had a small role in My Brother the Devil in 2012, where she was recognized by Screen International as one of its 2012 Stars of Tomorrow. Michael Caton-Jones cast Wright in her first leading role in Urban Hymn (2015), which brought her to the attention of Hollywood. The same year, she appeared in an episode of Doctor Who, and the following year, she began a recurring role as Renie on Humans. During this time, she also appeared in the play Eclipsed on the West End. In 2017, Wright starred in the Black Mirror episode \"Black Museum\"; her performance earned her a Primetime Emmy Award nomination for Outstanding Supporting Actress in a Limited Series or Movie.Wright co-starred in the 2018 film Black Panther, playing the role of Shuri, King T'Challa's sister and princess of Wakanda. Part of the Marvel Cinematic Universe, the film also starred Chadwick Boseman, Michael B. Jordan, Lupita Nyong'o, and Danai Gurira. Wright won the NAACP Image Award for Outstanding Breakthrough Performance in a Motion Picture for her work in the film, and reprised the role in Avengers: Infinity War, which was released later that year. Also in 2018, Wright appeared as Reb in Steven Spielberg's film adaptation of the 2011 science-fiction novel Ready Player One. Wright features as one of the cameos in Drake's music video for \"Nice for What\".In 2019, Wright won the BAFTA Rising Star Award. In April 2019, Wright appeared alongside Donald Glover and Rihanna in Guava Island, a short musical film released by Amazon Studios, before reprising her role as Shuri in Avengers: Endgame.\nIn November 2018 it was announced that Wright would be starring alongside John Boyega in a novel adaption of Hold Back The Stars. Wright will appear in 2020's Death on the Nile.", "Personal life": "Wright has been vocal about her struggles with depression. In 2018, she told Vanity Fair that when she first experienced depression at the age of 20, she \"was in the dark going through so many bad things\". Wright credits her faith for helping her overcome her depression, which she discovered after attending a London actors' Bible study meeting. To focus on her recovery and her faith, she declined film roles. She later explained she \"needed to take a break from acting\" and \"went on a journey to discover my relationship with God, and I became a Christian.\"", "Filmography": "=== Film ===\n\n\n=== Television ===", "Awards and nominations": "", "References": "", "External links": "Letitia Wright on IMDb"}