{"_id": "14", "name": "Mark Ruffalo", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:29", "biography": "Mark Ruffalo (; born November 22, 1967) is an American actor and producer. He began acting in the early 1990s and first gained recognition for his work in Kenneth Lonergan's play This Is Our Youth (1998) and drama film You Can Count On Me (2000). He went on to star in the romantic comedies 13 Going on 30 (2004) and Just like Heaven (2005) and the thrillers Zodiac (2007) and Shutter Island (2010). He gained wider recognition for his role as Bruce Banner / Hulk in the Marvel Cinematic Universe superhero films, including The Avengers (2012), Avengers: Age of Ultron (2015), Thor: Ragnarok (2017), Avengers: Infinity War (2018), and Avengers: Endgame (2019).\nRuffalo gained nominations for the Academy Award for Best Supporting Actor for playing a sperm donor in the comedy-drama The Kids Are All Right (2010), Dave Schultz in the biopic Foxcatcher (2014), and Michael Rezendes in the drama Spotlight (2015). He also won the Screen Actors Guild Award for Best Actor in a TV Movie for playing a gay writer in the television drama film The Normal Heart (2015).", "Early life": "Ruffalo was born in Kenosha, Wisconsin. His mother, Marie Rose (née Hébert), is a hairdresser and stylist and his father, Frank Lawrence Ruffalo Jr., worked as a construction painter. He has two sisters, Tania and Nicole, and a brother, Scott (died 2008). His father is of Italian descent, from Girifalco and his mother is of half French Canadian and half Italian ancestry.Ruffalo attended both Catholic and progressive schools throughout his education. Ruffalo has described himself as having been a \"happy kid\", although he struggled with undiagnosed dyslexia and ADD as a child and a young adult.Ruffalo spent his teen years in Virginia Beach, Virginia, where his father worked. He competed in wrestling in junior high and high school in Wisconsin and Virginia. Ruffalo graduated from First Colonial High School in Virginia Beach, where he acted for the Patriot Playhouse taught by Nancy P. Curtis. He moved with his family to San Diego, California and later to Los Angeles, where he took classes at the Stella Adler Conservatory and co-founded the Orpheus Theatre Company. With the theater company, he wrote, directed and starred in a number of plays and spent close to a decade working as a bartender.", "Career": "=== Acting ===\nHe made his screen debut in an episode of CBS Summer Playhouse (1989), followed by minor film roles, and was part of the original cast of This Is Our Youth (1996). Following roles were in 13 Going on 30 (2004), Eternal Sunshine of the Spotless Mind (2004), Zodiac (2007), and What Doesn't Kill You (2008). In 2010, he starred in the psychological thriller Shutter Island and the comedy-drama The Kids Are All Right. For the latter, he received nominations for the SAG Award, BAFTA Award, and the Academy Award for Best Supporting Actor. He also co-starred in the mystery films Now You See Me and Now You See Me 2 as FBI Special Agent Dylan Rhodes.Ruffalo had minor roles in films including The Dentist (1996), the low-key crime comedy Safe Men (1998) and Ang Lee's Civil War Western Ride with the Devil (1999). Through a chance meeting with writer Kenneth Lonergan, he began collaborating with Lonergan and appeared in several of his plays, including the original cast of This is Our Youth (1996), which led to Ruffalo's role as Laura Linney's character's brother in Lonergan's Academy Award-nominated 2000 film You Can Count On Me. He received favorable reviews for his performance in this film, often earning comparisons to the young Marlon Brando, and won awards from the Los Angeles Film Critics Association and Montreal World Film Festival.\nHis next role was in 2001 in Rod Lurie's The Last Castle playing a bookie in a military prison alongside Robert Redford. \nThis led to other significant roles, including the films XX/XY (2002), Isabel Coixet's My Life Without Me (2003), Jane Campion's In the Cut (2003), Michel Gondry's Eternal Sunshine of the Spotless Mind (2004), and We Don't Live Here Anymore (2004), which is based on two short stories written by Andre Dubus. He appeared opposite Tom Cruise as a narcotics detective in Michael Mann's crime thriller Collateral (2004).\n\nIn the mid-2000s, Ruffalo appeared as a romantic lead in View From the Top (2002), 13 Going on 30 (2004), Just Like Heaven (2005) and Rumor Has It (2005). In 2006, Ruffalo starred in Clifford Odets' Awake and Sing! at the Belasco Theatre in New York, for which he was nominated for a Tony Award for Best Featured Actor in a Play. In March 2007, he appeared in Zodiac as SFPD homicide inspector Dave Toschi, who ran the investigation to find and apprehend the Zodiac killer from 1969 through most of the 1970s. In 2007, Ruffalo played divorced lawyer Dwight Arno, who accidentally kills a child and speeds away, in Terry George's film Reservation Road, based on the novel by John Burnham Schwartz.In 2008, Ruffalo starred as a con man in The Brothers Bloom with Adrien Brody and Rachel Weisz and co-starred with Julianne Moore in Blindness. 2008 also saw Ruffalo in Brian Goodman's What Doesn't Kill You with Ethan Hawke and Amanda Peet, which was shown at the Toronto International Film Festival. In 2009, he played a brief role in the film Where the Wild Things Are as Max's mother's boyfriend. In 2010, he co-starred in the Martin Scorsese thriller Shutter Island as U.S. Marshal Chuck Aule, the partner of Leonardo DiCaprio's character Teddy Daniels.In 2010, he starred in Lisa Cholodenko's The Kids Are All Right, with Annette Bening and Julianne Moore. Ruffalo stated in an interview that he approached Cholodenko after watching High Art and said he would love to work with her. Years later, she called Ruffalo and said she wrote a script and had him in mind for the part. His performance earned him an Academy Award nomination for Best Supporting Actor.\n\nRuffalo starred in The Avengers (2012), the sixth installment of the Marvel Cinematic Universe, replacing Edward Norton as Dr. Bruce Banner / Hulk. Ruffalo received critical acclaim for his performance and is under contract to reprise the role in any future film appearances of the character produced by Marvel Studios. Ruffalo also made a cameo appearance as Banner in Iron Man 3. He reprised the role again in Avengers: Age of Ultron (2015), Thor: Ragnarok (2017), Avengers: Infinity War (2018), and Avengers: Endgame (2019).\n\nIn 2014, Ruffalo starred as Ned Weeks in a television adaptation of Larry Kramer's AIDS-era play, The Normal Heart; his performance earned him an Emmy nomination. He says he has had an outpouring of support for his performance: I've never had so sincere and vulnerable a response from people for anything that I've ever done. ... And of everything that I've done since I've been on social media, which hasn't been that long, by the way, I haven't had such an overwhelmingly positive response as I have from The Normal Heart directly to me. And it's a blessing, man. If this is it, if I have a piano dropped on me tomorrow, then I would go down thinking, \"You know what, I did okay as far as my career goes, because that's a gift. That's rare.\"\nAlso in 2014, Ruffalo received his second Academy Award nomination for his portrayal of wrestler Dave Schultz in the biographical drama Foxcatcher. The next year in 2015, he starred as a bipolar father-of-two in the independent comedy film Infinitely Polar Bear, for which he earned a Golden Globe Award nomination, and he also appeared as journalist Michael Rezendes in the drama film Spotlight, for which he earned his third Academy Award nomination and a BAFTA Award nomination. His performance in Avengers: Endgame received acclaim from critics.\n\n\n=== Directing ===\nHe directed a number of plays during his time at the Orpheus Theatre Company, and made his feature film directorial debut with Sympathy for Delicious, which premiered at the Sundance Film Festival and won the Special Jury Prize. On releasing the film, Ruffalo said, \"I'm still looking for distribution. I have a couple offers on the table, but I'm holding out for something a little bigger. I've been screening it for a lot of groups, and people are really responding to it. I think they're scared of that movie.\"", "Political activism": "Ruffalo is pro-choice. He has explained his opinion by saying: \"I don't want to turn back the hands of time to when women shuttled across state lines in the thick of night to resolve an unwanted pregnancy, in a cheap hotel room.\"He has stated support for the LGBT community, however he has received criticism from the transgender community for supporting the casting of a man, Matt Bomer, to play a transgender woman in the film Anything, of which Ruffalo was an executive producer.In 2008, Ruffalo expressed concern that gas companies were eyeing his family's land in Callicoon, New York. After doing his own investigation, New York magazine wrote, he becomes \"anti-fracking's first famous face.\" On October 4, 2010, Ruffalo appeared on The Rachel Maddow Show to discuss hydraulic fracturing and the FRAC Act of 2009. He claimed in the December 2010 issue of GQ magazine that after he organized screenings in Pennsylvania of a documentary about natural-gas-drilling called Gasland, he was placed on a terror advisory list. The Department of Homeland Security denied the claim.Ruffalo has given interviews to We Are Change, a 9/11 'truth' group, in both 2007 and 2011. Ruffalo stated: \"I'm baffled by the way all three buildings came down. My first reaction was that buildings don't fall down like that.In 2014, Ruffalo spoke out against Israel's Operation Protective Edge, Israel's 7-week war against Palestinians, tweeting: \"Israel destroys el-Wafa hospital as staff evacuates all patients\". After receiving criticism, Ruffalo responded: \"Sorry, I thought blowing up Hospitals was something that all human beings could agree was off limits.\"\nIn 2016, Ruffalo narrated and produced Dear President Obama: The Clean Energy Revolution Is Now, a documentary by director Jon Bowermaster which looks at President Obama's environmental tenure and legacy concerning the massive expansion of oil and natural gas drilling. In the 2016 election, Ruffalo supported democratic socialist Bernie Sanders. Ruffalo actively supported the Standing Rock Indian Reservation in their opposition to the Dakota Access Pipeline project.Ruffalo has suggested that the Zika virus is the inadvertent creation of a British biotech company that has been releasing genetically modified mosquitoes to combat dengue fever in Brazil.Ruffalo caused controversy in June 2017 after posting a petition on Twitter urging NBC to stop hiring white conservative commentators.In June 2017, Ruffalo endorsed Labour Party leader Jeremy Corbyn in the 2017 UK general election. He tweeted: \"Because @jeremycorbyn offers people an alternative to the Corporate status quo, which never ends well for them, I humbly endorse Corbyn.\"", "Personal life": "Ruffalo married Sunrise Coigney in 2000. They have three children: son Keen (b. 2001), and daughters Bella Noche (b. 2005) and Odette (b. 2007).After completing work on the film The Last Castle, Ruffalo was diagnosed with a vestibular schwannoma, a type of brain tumor also known as an acoustic neuroma. The tumor was found to be benign, however, the surgery to remove the mass resulted in partial facial paralysis and affected his hearing. The paralysis subsided after a year, but Ruffalo remains deaf in his left ear.On December 1, 2008, Ruffalo's younger brother, Scott, was found outside his home on North Palm Drive in Los Angeles with an execution-style bullet wound to the head. Scott Ruffalo died the following week. The case remains unsolved, which Mark told CBS Sunday Morning in 2014 will likely remain one of \"life's great mysteries\".Ruffalo and his family live in Manhattan. He also owns a house in Sullivan County, New York, describing the Catskill Mountains as his \"home\".", "Filmography and awards": "", "Audiobooks": "2016: Our Revolution: A Future to Believe In (together with Bernie Sanders, the author), Macmillan Audio, ISBN 978-1427285331", "References": "", "External links": "Mark Ruffalo on IMDb \nMark Ruffalo – People in Film at Focus Features\nMark Ruffalo interview clips on Inside the Actors Studio\nMark Ruffalo producer profile for The 1 Second Film"}