{"_id": "32", "name": "Sandra Bullock", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:37", "biography": "Sandra Annette Bullock (; born July 26, 1964) is an American actress, producer, and philanthropist. She was the highest paid actress in the world in 2010 and 2014. In 2015, Bullock was chosen as People's Most Beautiful Woman and was included in Time's 100 most influential people in the world in 2010. Bullock is the recipient of several accolades, including an Academy Award and a Golden Globe Award.\nAfter making her acting debut with a minor role in the thriller Hangmen (1987), Bullock received early attention for her supporting work in the action film Demolition Man (1993). Her breakthrough came in the action thriller Speed (1994). She established herself in the 1990s with leading roles in the romantic comedies While You Were Sleeping (1995) and Hope Floats (1998) and the thrillers The Net (1995) and A Time to Kill (1996). Bullock achieved further success in the following decades with the comedies Miss Congeniality (2000), Two Weeks Notice (2002), The Proposal (2009), The Heat (2013), and Ocean's 8 (2018), the drama Crash (2004), and the thrillers Premonition (2007) and Bird Box (2018). Bullock was awarded the Academy Award for Best Actress and the Golden Globe Award for Best Actress in a Drama for portraying Leigh Anne Tuohy in the biographical drama The Blind Side (2009). She was nominated in the same categories for playing an astronaut stranded in space in the science fiction thriller Gravity (2013), which was her highest-grossing live-action release.\nIn addition to her acting career, Bullock is the founder of the production company Fortis Films. She has produced some of the films in which she has starred, including Miss Congeniality 2: Armed and Fabulous (2005) and All About Steve (2009). She was an executive producer of the ABC sitcom George Lopez (2002–2007) and made several appearances during its run.", "Early life": "Bullock was born in Arlington, Virginia, on July 26, 1964, the daughter of John W. Bullock (1925–2018), an Army employee and part-time voice coach from Birmingham, Alabama, and Helga Mathilde Meyer (1942–2000), an opera singer and voice teacher from Germany. Bullock's maternal grandfather was a German rocket scientist from Nuremberg. John, who was in charge of the Army's Military Postal Service in Europe, was stationed in Nuremberg when he met Helga. They married in Germany and moved to Arlington, where John worked with the Army Materiel Command before becoming a contractor for The Pentagon. Bullock has a younger sister, Gesine Bullock-Prado, who served as president of Bullock's production company Fortis Films.Bullock was raised in Germany (Nuremberg) and Austria (Vienna and Salzburg) for 12 years, and grew up speaking German. She had a Waldorf education in Nuremberg. As a child, while her mother went on European opera tours, Bullock usually stayed with her aunt Christl and cousin Susanne, the latter of whom later married politician Peter Ramsauer. Bullock studied ballet and vocal arts as a child and frequently accompanied her mother, taking small parts in her opera productions. In Nuremberg, she sang in the opera's children's choir. Bullock has a scar above her left eye which was caused by a fall into a creek when she was a child. While she maintains her American citizenship, Bullock applied for German citizenship in 2009.Bullock attended Washington-Lee High School, where she was a cheerleader and performed in school theater productions. After graduating in 1982, she attended East Carolina University (ECU) in Greenville, North Carolina, where she received a BFA in Drama in 1987. While at ECU, she performed in multiple theater productions including Peter Pan and Three Sisters. She then moved to Manhattan, New York, where she supported herself as a bartender, cocktail waitress, and coat checker while auditioning for roles.", "Career": "=== Beginnings (1987–1993) ===\nWhile in New York, Bullock took acting classes with Sanford Meisner. She appeared in several student films, and later landed a role in an Off-Broadway play No Time Flat. Director Alan J. Levi was impressed by Bullock's performance and offered her a part in the made-for-television film Bionic Showdown: The Six Million Dollar Man and the Bionic Woman (1989). This led to her being cast in a series of small roles in several independent films as well as in the lead role of the short-lived NBC television version of the film Working Girl (1990). She went on to appear in several films, such as Love Potion No. 9 (1992), The Thing Called Love (1993) and Fire on the Amazon (1993), before rising to early prominence with her supporting role in the sci-fi action film Demolition Man (1993).\n\n\n=== Worldwide exposure (1994–1999) ===\nBullock's big breakthrough came in 1994, when she starred as one of the passengers of a city bus containing a bomb in the action thriller Speed alongside actor Keanu Reeves. She was required to read for Speed to make sure there was the right chemistry between her and Reeves. She recalls that they had to do \"all these really physical scenes together, rolling around on the floor and stuff.\" Speed garnered acclaim from critics who, according to Rotten Tomatoes, asserted it was a \"terrific popcorn thriller [with] outstanding performances from Keanu Reeves, Dennis Hopper, and Sandra Bullock\". It took in US$350 million worldwide.After the success of Speed, Bullock established herself as a Hollywood leading actress. In the romantic comedy While You Were Sleeping (1995), she portrayed a lonely Chicago Transit Authority token collector who saves the life of a man. While the film made US$182 million globally, it received positive reviews, with Rotten Tomatoes' critical consensus reading: \"While You Were Sleeping is built wholly from familiar ingredients, but assembled with such skill—and with such a charming performance from Sandra Bullock—that it gives formula a good name.\" She received her first Golden Globe Award nomination for Best Actress – Motion Picture Musical or Comedy. In 1995, Bullock also starred in the thriller The Net (1995) as a computer programmer who stumbles upon a conspiracy that puts her life and the lives of those around her in great danger. Owen Gleiberman, writing for Entertainment Weekly, complimented her performance saying \"Bullock pulls you into the movie. Her overripe smile and clear, imploring eyes are sometimes evocative of Julia Roberts\". The Net made US$110.6 million.\n\nIn the crime drama A Time to Kill (1996), Bullock portrayed a member of the defense team, in the trial for murder of two men who raped a young girl, opposite Samuel L. Jackson, Matthew McConaughey and Kevin Spacey. She received a MTV Movie Award nomination for Best Breakthrough Performance. The film grossed US$152 million around the world. Bullock subsequently received US$11 million for the critically panned Speed 2: Cruise Control (1997), which she agreed to star in for financial backing for her next project, Hope Floats (1998). She has stated that she regrets making the sequel. In Hope Floats she starred as an unassuming housewife whose life is disrupted when her husband (played by Michael Paré) reveals his infidelity to her on a talk show. While the film made US$81.4 million, critic James Berardinelli remarked that her \"undisputed strength lies in a blend of light drama and comedy\".Bullock starred in comedy Practical Magic (1998) with Nicole Kidman as two witch sisters who face a curse which threatens to prevent them ever finding lasting love. While the film opened atop the chart on its North American opening weekend, it flopped at the box office. The same year she provided her voice as Miriam the animated adventure film The Prince of Egypt and wrote, produced, and directed the short film Making Sandwiches. Alongside Ben Affleck, she played a free-spirited drifter who begins to talk to a writer in the 1999 romantic comedy Forces of Nature. The film was a commercial hit, grossing US$93 million worldwide, and Boxoffice Magazine remarked: \"The combination of Affleck's deadpan by-the-book persona with the spontaneity of Bullock's character sparks with convincing chemistry, their diverse personalities causing both to grow and bring to the surface what each is running away from or can't admit.\"\n\n\n=== Established career (2000–2008) ===\nBullock took on the role of a FBI agent who must go undercover as a beauty pageant contestant in the comedy Miss Congeniality (2000). It was a financial success, grossing US$212 million worldwide and earned Bullock another Golden Globe Award nomination for Best Actress – Motion Picture Musical or Comedy. Also in 2000 she played a newspaper columnist obliged to enter a rehabilitation program for alcoholism in the dramedy 28 Days; it was a moderate commercial success with a global gross of US$62.1 million. Bullock produced the romantic comedy Kate & Leopold, released in 2001, then starred in the psychological thriller Murder by Numbers (2002) as a seasoned homicide detective. Roger Ebert awarded the film three stars out of a possible four, stating: \"Bullock does a good job here of working against her natural likability, creating a character you'd like to like, and could like, if she weren't so sad, strange and turned in upon herself.\"\n\nBullock teamed up with Hugh Grant for the romantic comedy Two Weeks Notice (2002) in which she starred as a lawyer who walks out on her boss. Liz Braun, of Jam! Movies, found Bullock and Grant to be \"perfectly paired\", stating: \"The script allows the two actors to be at their comedic best, even though the film as a whole is amateurish in many ways\". Two Weeks Notice made US$199 million globally. She was presented with the Raul Julia Award for Excellence in 2002 for helping expand career openings for Hispanic talent in the media and entertainment industry as the executive producer of the sitcom George Lopez (2002–2007). She also made several appearances on the show as Accident Amy, an accident-prone employee at the factory Lopez's character manages.As part of a large ensemble cast, Bullock played the wife of a district attorney in the drama Crash (2004), which won the Academy Award for Best Picture. She received positive reviews for her performance; some critics suggested that it was the best performance of her career. In 2005, she received a US$17.5 million salary for Miss Congeniality 2: Armed and Fabulous and was a co-recipient of the Women in Film Crystal Award. In the romantic drama The Lake House (2006), Bullock reunited with Keanu Reeves although their characters were separated throughout the film; they were only on set together for two weeks during filming. The film had a negative critical response but made US$114.8 million. In 2006 Bullock played Harper Lee in Infamous, a drama based on George Plimpton's 1997 book, Truman Capote: In Which Various Friends, Enemies, Acquaintances, and Detractors Recall His Turbulent Career.Bullock headlined the supernatural thriller Premonition (2007) as a housewife who experiences the days surrounding her husband's death in non-chronological order. Despite negative reviews, several critics, including Rex Reed, commended Bullock for her performance and the film grossed US$84.1 million around the globe. In 2008 Bullock was announced as the face of the cosmetic brand Artistry.\n\n\n=== Critical recognition (2009–2014) ===\n\nBullock had two record highs in 2009. The romantic comedy The Proposal, with Ryan Reynolds, grossed US$317 million at the box office worldwide which made it her fourth-most successful picture to date. She received her third Golden Globe Award nomination for Best Performance by an Actress in a Motion Picture – Musical or Comedy. The drama The Blind Side opened at number two behind New Moon with US$34.2 million, making it her second-highest opening weekend ever. The Blind Side grossed over US$309 million, making it her highest-grossing domestic film, her fourth-highest-grossing film worldwide, and the first one in history to pass the US$200 million mark with only one top-billed female star. Bullock had initially turned down the role of Leigh Anne Tuohy three times due to discomfort in portraying a devout Christian. She was awarded the Academy Award, Golden Globe Award, Screen Actors Guild Award and Critics' Choice Movie Award for Best Actress. The Blind Side also received an Academy Award for Best Picture nomination.Winning the Oscar also gave Bullock another unique distinction—since she won two Razzies the day before for her performance in All About Steve (2009)—she is the only performer ever to have been named both best and worst for the same year. Following a two-year hiatus from the screen, Bullock starred alongside Tom Hanks as a widow of the September 11 attacks in the drama Extremely Loud & Incredibly Close, a film adaptation based on the novel of the same name. Despite mixed reviews, the film was nominated for numerous awards including an Academy Award for Best Picture. Bullock was nominated for Best Actress Drama by Teen Choice Awards.In 2013, Bullock starred alongside Melissa McCarthy in the comedy The Heat as a FBI Special Agent who, along with a city detective, must take down a mobster in Boston. It received positive reviews from critics, and took in US$230 million at the box office worldwide. Bullock also starred as an astronaut stranded in space in the thriller Gravity, opposite George Clooney, which premiered at the 70th Venice Film Festival and was released on October 4, 2013 to coincide with the beginning of World Space Week. Gravity received universal acclaim among critics and a standing ovation in Venice. The film was called \"the most realistic and beautifully choreographed film ever set in space\" and some critics called Bullock's performance the best work of her career. Variety wrote:\n\nBullock inhabits the role with grave dignity and hints at Stone's past scars with sensitivity and tact, and she holds the screen effortlessly once Gravity becomes a veritable one-woman show ... the actress remains fully present emotionally, projecting a very appealing combo of vulnerability, intelligence and determination that not only wins us over immediately, but sustains attention all the way through the cathartic closing reels.\nGravity took in US$716 million at the box office worldwide and made it Bullock's second-most successful picture. For her role as Dr. Ryan Stone, Bullock was nominated for the Academy Award, Golden Globe Award, BAFTA Award, Screen Actors Guild Award, and Critics' Choice Movie Award for Best Actress.\n\n\n=== Later roles (2015–present) ===\n\nIn 2015 Bullock provided the voice of the villain in the animated film Minions, which became her highest-grossing film to date with over US$1.1 billion worldwide and she executive produced and starred, as a political consultant hired to help win a Bolivian presidential election, in the drama Our Brand Is Crisis based on the 2005 documentary film of the same name by Rachel Boynton. Upon the film's release, which was a critical and commercial flop, she took another sabbatical from film. Bullock returned in an all-female spin-off of the Ocean's Eleven franchise, Ocean's 8 (2018) directed by Gary Ross. Bullock plays Debbie Ocean, the sister of Danny Ocean, who helps plan a sophisticated heist of the annual Met Gala in New York City. The film was a commercial success grossing US$296.9 million globally.Bullock played Malorie, a woman who must find a way to guide herself and her children to safety despite the potential threat from an unseen adversary, in the Netflix post-apocalyptic horror film Bird Box (2018), based on the novel of the same name. Bullock received universal acclaim for her work. Variety found her to be \"wonderfully self-reliant\" while TheWrap described her performance as \"fascinating and terrifying to watch.\" Bullock's films have grossed over US$5.3 billion worldwide and her total domestic gross stands at over US$2.6 billion.", "Public image": "Since her acting debut, Bullock has been dubbed \"America's sweetheart\" in the media due to her \"friendly and direct and so unpretentious\" nature.\n\nShe was selected as one of People magazine's 50 Most Beautiful People in the world in 1996 and 1999 and was also ranked number 58 on Empire magazine's Top 100 Movie Stars of All Time list. On March 24, 2005, Bullock received a motion picture star on the Hollywood Walk of Fame at 6801 Hollywood Boulevard in Hollywood.In 2010, Time magazine included Bullock in its annual Time 100 as one of the most influential people in the world. Bullock was selected by People magazine as its 2010 Woman of the Year and ranked number 12 on People's Most Beautiful 2011 list.In September 2013, Bullock joined other Hollywood legends at the TCL Chinese Theatre on Hollywood Boulevard in making imprints of her hands and feet in cement of the theater's forecourt. In November 2013 The Hollywood Reporter named Bullock among the most powerful women in entertainment and she was also named Entertainment Weekly's Entertainer of the Year due to her success with The Heat and Gravity.Bullock ranked number two on the 2014 Forbes' list of most powerful actresses and was honored with the Decade of Hotness Award by Spike Guys' Choice Awards. She was named the Most Beautiful Woman by People in 2015.", "Business ventures": "Bullock owns the production company Fortis Films. She was an executive producer of the George Lopez sitcom (co-produced with Robert Borden and Bruce Helford), which garnered a syndication deal of US$10 million. Bullock tried to produce a film based on F.X. Toole's short story Million Dollar Baby but could not interest the studios in a female boxing drama. The story was eventually adapted and directed by Clint Eastwood as the Oscar-winning film Million Dollar Baby (2004). Fortis Films also produced All About Steve which was released in September 2009. Her father, John Bullock, was the company's CEO and her sister, Gesine Bullock-Prado, is the former president.In November 2006, Bullock founded an Austin, Texas, restaurant named Bess Bistro which was located on West 6th Street. She later opened another business, Walton's Fancy and Staple, across the street in a building she extensively renovated. Walton's is a bakery, upscale restaurant, and floral shop that also offers services including event planning. After almost nine years in business, Bess Bistro closed on September 20, 2015.", "Philanthropy": "Bullock has been a public supporter of the American Red Cross and has donated US$1 million to the organization at least five times. Her first public donation of that amount was to the Red Cross's Liberty Disaster Relief Fund. Three years later, she sent money in response to the 2004 Indian Ocean earthquake and tsunamis. In 2010, she donated US$1 million to relief efforts in Haiti following the Haiti earthquake and again donated the same amount following the 2011 Tōhoku earthquake and tsunami. She donated US$1 million in 2017 to support Red Cross relief efforts for Hurricane Harvey in Texas.Along with other stars, Bullock did a public service announcement urging people to sign a petition for clean-up efforts of the Deepwater Horizon oil spill in the Gulf of Mexico. Bullock backs the Texas non-profit organization The Kindred Life Foundation, Inc. (KLF) and in late 2008 joined other top celebrities in supporting the work of KLF's founder and CEO, Amos Ramirez. At a fundraising gala for the organization, Bullock said, \"Amos has led many efforts across our nation that have helped families that are in need. Our country needs more organizations that are committed to the service that Kindred Life is.\"In 2012, Bullock was inducted into the Warren Easton Hall of Fame for her donations to charities. She was honored in 2013 with the Favorite Humanitarian Award at the 39th People's Choice Awards for her contributions to New Orleans' Warren Easton High School, which was severely damaged by Hurricane Katrina.", "Personal life": "=== Relationships ===\n\nBullock was once engaged to actor Tate Donovan, whom she met while filming Love Potion No. 9. Their relationship lasted three years. She previously dated football player Troy Aikman and actors Matthew McConaughey and Ryan Gosling.Bullock married motorcycle builder and Monster Garage host Jesse James on July 16, 2005. They first met when Bullock arranged for her ten-year-old godson to meet James as a Christmas present. In November 2009, Bullock and James entered into a custody battle with James' second ex-wife, former adult film actress Janine Lindemulder, with whom James had a child. Bullock and James subsequently won full legal custody of James' five-year-old daughter. A scandal arose in March 2010 when several women claimed to have had affairs with James during his marriage to Bullock. Bullock canceled European promotional appearances for The Blind Side citing \"unforeseen personal reasons\".On March 18, 2010, James responded to the rumors of infidelity by issuing a public apology to Bullock. He stated, \"The vast majority of the allegations reported are untrue and unfounded ... beyond that, I will not dignify these private matters with any further public comment.\" James declared, \"There is only one person to blame for this whole situation, and that is me.\" He asked that Bullock and their children one day \"find it in their hearts to forgive me\" for their \"pain and embarrassment\". James' publicist subsequently announced on March 30, 2010, that James had checked into a rehabilitation facility to \"deal with personal issues\" and save his marriage to Bullock. However, on April 28, 2010, it was reported that Bullock had filed for divorce on April 23 in Austin, Texas. Their divorce was finalized on June 28, 2010, with \"conflict of personalities\" cited as the reason.\n\n\n=== Children ===\nBullock announced on April 28, 2010, that she had proceeded with plans to adopt a son born in January 2010 in New Orleans, Louisiana. Bullock and James had begun an initial adoption process four months earlier. Bullock's son began living with them in January 2010, but they chose to keep the news private until after the Oscars in March 2010. However, given the couple's separation and then divorce, Bullock continued the adoption of her son as a single parent. Bullock announced in December 2015 that she had adopted a second child and appeared on the cover of People magazine with her then three-year-old new daughter.\n\n\n=== Accidents ===\nOn December 20, 2000, Bullock was in a private jet crash on a runway from which she and the two crew escaped uninjured. The pilots were unable to activate the runway lights during a night landing at Jackson Hole Airport due to the use of out-of-date approach plates but continued the landing anyway. The aircraft landed in the airport's graded safety area between the runway and parallel taxiway and hit a snowbank. The accident caused a separation of the nose cone and landing gear, partial separation of the right wing, and a bend in the left wing.While Bullock was in Massachusetts on April 18, 2008, shooting the film The Proposal, she and her then-husband Jesse James were in a vehicle that was hit head-on at moderate speed by a drunk driver. Vehicle damage was minor and there were no injuries.\n\n\n=== Legal issues ===\nBeginning in 2002 Bullock was stalked across several states by a man named Thomas James Weldon. Bullock obtained a restraining order against him in 2003, which was renewed in 2006. After the restraining order expired and Weldon was released from a mental institution, he again traveled across several states to find Bullock; she then obtained another restraining order.Bullock won a multimillion-dollar judgment against Benny Daneshjou, the builder of her Lake Austin, Texas, home in October 2004. The jury ruled that the house was uninhabitable. It has since been torn down and rebuilt. Daneshjou and his insurer later settled with Bullock for roughly half the awarded verdict.On April 22, 2007, a woman named Marcia Diana Valentine was found lying outside James and Bullock's home in Orange County, California. When James confronted the woman, she ran to her car, got behind the wheel, and tried to run over him. She was said to be an obsessed fan of Bullock. Valentine was charged with one felony count each of aggravated assault and stalking. Bullock obtained a restraining order to bar Valentine from \"contacting or coming near her home, family or work for three years\". Valentine pleaded not guilty to charges of aggravated assault and stalking. She was subsequently convicted of stalking and sentenced to three years' probation.Joshua James Corbett broke into Bullock's Los Angeles home in June 2014. Bullock locked herself in a room and dialed 911. Corbett pleaded no contest in 2017 and was sentenced to five years' probation for stalking Bullock and breaking into her residence. He was then subject to a ten-year protective order that required him to stay away from Bullock. After Corbett missed a court date the previous month, police officers went to his parents' residence on May 2, 2018, where he lived in a guest house, to arrest him. He refused to leave and threatened to shoot officers. A SWAT team was called and, after a five-hour standoff, they deployed gas canisters and entered the house where they found Corbett had committed suicide. Corbett's death was the result of \"multiple incised wounds\" according to the Los Angeles County coroner.", "Filmography and awards": "", "References": "", "Further reading": "Zannos, Susan (2000). Sandra Bullock. Mitchell Lane Publishers. ISBN 978-1-58415-027-5.\nHill, Anne E. (2000). Sandra Bullock. Lucent Books. ISBN 978-1-56006-711-5.\nJohnson, Taft (2011). Sandra Bullock's Rise to the Top: An Unauthorized Biography. ISBN 978-1-240-96122-1.", "External links": "Sandra Bullock on IMDb \nSandra Bullock at AllMovie\nSandra Bullock at Box Office Mojo\nSandra Bullock at Rotten Tomatoes\n\"Sandra Bullock: 2010's Triumphs\". Life. June 23, 2010. Archived from the original on June 27, 2010.\nDuck, Charlotte (November 25, 2009). \"Interview: Sandra Bullock\". Glamour.\nGay, Jason (September 17, 2013). \"Sandra Bullock Is On Top of The World with Her New Film 'Gravity'\". Vogue. Archived from the original on September 20, 2013."}