{"_id": "73", "name": "Tim Allen", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:58", "biography": "Timothy Alan Dick (born June 13, 1953), known professionally as Tim Allen, is an American actor and comedian. He is known for playing Tim \"The Toolman\" Taylor on the ABC sitcom Home Improvement (1991–1999) and Mike Baxter on the ABC sitcom Last Man Standing (2011–). He also voices Buzz Lightyear for the Toy Story franchise and played Scott Calvin and Santa Claus in The Santa Clause film trilogy (1994–2006). Allen's other films include For Richer or Poorer (1997), Jungle 2 Jungle (1997), Galaxy Quest (1999), Big Trouble (2002), Christmas with the Kranks (2004), The Shaggy Dog (2006), Wild Hogs (2007), Redbelt (2008), and Crazy on the Outside (2010).", "Early life": "Allen was born in Denver, Colorado, to Martha Katherine (née Fox), a community-service worker, and Gerald M. Dick, a real estate agent. He is the third oldest of five brothers. His father died in a car accident in November 1964, colliding with a drunk driver when Allen was 11. Two years later, his mother married her high school sweetheart, a business executive, and moved with her six children to Birmingham, Michigan, a suburb of Detroit, to be with her new husband and his three children.Allen attended Seaholm High School in Birmingham, where he was in theater and music classes (resulting in his love of classical piano). He then attended Central Michigan University before transferring to Western Michigan University in 1974. At Western Michigan, Allen worked at the student radio station WIDR and received a Bachelor of Science degree in communications specializing in radio and television production in 1976 with a split minor in philosophy and design. In 1998, Western Michigan awarded Allen an honorary fine arts degree and the Distinguished Alumni Award.", "Career": "Allen started his career as a comedian in 1975. On a dare from one of his friends, he participated in a comedy night at Mark Ridley's Comedy Castle in Royal Oak, a suburb of Detroit. While in Detroit he began to get recognition appearing in local television commercials and appearing on cable comedy shows such as Gary Thison's Some Semblance of Sanity. \nOn October 2, 1978, Allen was arrested in the Kalamazoo/Battle Creek International Airport for possession of over 650 grams (1.43 lb) of cocaine. He subsequently pleaded guilty to felony drug trafficking charges and provided the names of other dealers in exchange for a sentence of three to seven years rather than a possible life imprisonment. He was paroled on June 12, 1981, after serving two years and four months in Federal Correctional Institution, Sandstone in Sandstone, Minnesota.  Following his release from prison, he returned to comedy.  He moved to Los Angeles and became a regular performer at The Comedy Store. He began to do stand-up appearances on late-night talk shows and specials on record and film.Despite his admitted limited acting range (he once told a magazine his range as an actor is \". . . strictly limited. I can only play a part if I can draw on personal experience, and that well can go dry pretty quickly\"), Allen rose to fame in acting with the ABC sitcom Home Improvement (1991–1999) produced for ABC by Wind Dancer Productions, a company he co-founded with producer Carmen Finestra. Allen played the main character Tim \"The Tool-Man\" Taylor. In November 1994, he simultaneously starred in the highest-grossing film (Disney's The Santa Clause), topped the New York Times bestseller list with his book Don't Stand Too Close to a Naked Man, and appeared in the top rated television series (Home Improvement) within the span of one week. Home Improvement ran until 1999, for which he was paid US$1.25 million per episode.\nIn 1995, Allen provided the voice of Buzz Lightyear in the Disney/Pixar blockbuster Toy Story. In 1997, he starred in the family comedy Jungle 2 Jungle from Disney. The next year he returned to voice Buzz Lightyear in Toy Story 2 which was a financial and critical hit. Also in 1999 he starred in the sci-fi parody Galaxy Quest alongside Sigourney Weaver, Alan Rickman, and Sam Rockwell.  That same year, Allen was arrested for DUI in Birmingham, Michigan. At the time, his blood alcohol content was 0.15, nearly double the legal limit in Michigan. He was sentenced to one-year probation. He entered a rehabilitation clinic for alcohol abuse as part of his court obligation.In 2002, he reprised his role as Scott Calvin in The Santa Clause 2. Two years later, he starred as Luther Krank in Christmas with the Kranks. In 2006, Zoom was released, starring Allen as Jack Shepard. The same year, he also starred in The Shaggy Dog and The Santa Clause 3.\n\nAllen began narrating the \"Pure Michigan\" television and radio commercials for the \"Travel Michigan\" agency. These commercials can be seen and heard throughout the Midwest and began airing nationally in 2009.In December 2009, he started a preview tour of Crazy on the Outside, a film that debuted in January 2010. Allen accompanied the film, helping promote it with a series of stand-up acts beforehand. During the performances, he told audiences that he planned a 2010 comedy tour. Allen also directed the film, marking his film directorial debut.Allen hosted the 8th Annual TV Land Awards on April 25, 2010. That same year, he became the official voice of the Chevrolet Cruze, narrating commercials for the vehicle, and he became the voice of Campbell Soup's \"It's Amazing What Soup Can Do\" campaign.\nAllen returned to ABC with the sitcom Last Man Standing (2011–2017). He played the role of Mike Baxter, a conservative father fighting for his manhood in a house filled with women. The character is loosely based on his own life, as a Republican father of three girls. After six seasons, the show was canceled in May 2017. ABC Entertainment Chief Channing Dungey denied claims of political bias against Allen, explaining that the network simply could not accommodate the program on their schedule. On May 11, 2018, Fox TV's CEOs and chairmen announced that Fox had officially picked up Last Man Standing for a seventh season.Shortly before the cancellation of Last Man Standing, Allen had been announced as part of the cast of the Netflix original comedy film El Camino Christmas (2017).", "Personal life": "Allen was raised as an Episcopalian. He married Laura Deibel on April 7, 1984. In December 1989, their daughter Katherine was born. He and Laura legally separated in 1999. Their divorce was finalized in 2003. Allen married actress Jane Hajduk on October 7, 2006, in a small private ceremony in Grand Lake, Colorado. They had dated for five years. In March 2009, their daughter Elizabeth was born.Allen is a Republican. He has appeared on Sean Hannity's show and announced support for John Kasich, and later Donald Trump, in the 2016 presidential election.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===", "Awards and honors": "=== Other honors ===\n1999: Named a Disney Legend for his work on the Toy Story and The Santa Clause franchises\n2004: Received a motion pictures star on the Hollywood Walk of Fame at 6834 Hollywood Boulevard for his contributions to the film industry\n2017: Inducted into the Diecast Hall of Fame", "Books": "Don't Stand Too Close to a Naked Man (1994) – ISBN 0-7868-6134-7\nI'm Not Really Here (1996) – ISBN 0-7868-6257-2", "References": "", "External links": "Official website\nTim Allen on IMDb \nTim Allen at the TCM Movie Database\nTim Allen at AllMovie"}