{"_id": "55", "name": "Mark Wahlberg", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:45", "biography": "Mark Robert Michael Wahlberg (born June 5, 1971) is an American actor, producer, businessman, model, rapper, singer and songwriter. He is also known by his former stage name Marky Mark, from his early career as frontman for the group, Marky Mark and the Funky Bunch, with whom he released the albums Music for the People and You Gotta Believe.\nFrom his early music career Wahlberg transitioned to acting, with his screen debut in Renaissance Man (1993) and his first starring role in Fear (1996). He received critical praise for his performance as porn actor Dirk Diggler in Boogie Nights. In the early 2000s, he ventured into big budget action oriented movies, such as Planet of the Apes (2001) and The Italian Job (2003). In 2006 he appeared in the neo-crime drama The Departed, for which he earned a nomination for the Academy Award for Best Supporting Actor. For the biographical sports drama The Fighter (in which he additionally took the lead) Wahlberg achieved an Academy Award nomination as Producer for Best Picture, and a nomination for the Golden Globe Award for Best Actor in a Drama. In the 2010s, he landed successful comedy roles with The Other Guys, Daddy's Home, Daddy's Home 2, Ted and its sequel, and became the protagonist in the Transformers live-action film franchise.\nWahlberg also served as executive producer of four HBO series: the comedy-drama Entourage (2004–2011), the period crime drama Boardwalk Empire (2010–2014), and the comedy-dramas How to Make It in America (2010–2011) and Ballers (2015–present). He is co-owner of the Wahlburgers chain and co-starred in the reality TV series about it. Wahlberg received a star on the Hollywood Walk of Fame on July 29, 2010. He frequently portrays police officers, military personnel, or criminals in his films. He is also known for his collaborations with directors David O. Russell, Michael Bay, Peter Berg and Sean Anders and working out at 3am.", "Early life": "Wahlberg was born in the Dorchester neighborhood of Boston, Massachusetts, the youngest of nine children, including actor Robert and actor-singer Donnie. His mother, Alma Elaine (née Donnelly), was a bank clerk and a nurse's aide, and his father, Donald Edmond Wahlberg, was a delivery driver. His parents divorced in 1982, and afterward, he divided his time between them. His father was of Swedish and Irish descent, and his mother is of Irish, English, and French-Canadian ancestry. Maternally, Wahlberg is distantly related to author Nathaniel Hawthorne. Wahlberg had a Roman Catholic upbringing and attended Copley Square High School on Newbury Street in Boston. By age 13, Wahlberg had developed an addiction to cocaine and other substances. He did not receive his high school diploma until June 2013.\n\n\n=== Arrests and felony assault conviction ===\nIn June 1986, Wahlberg and three friends chased after three black children while yelling \"Kill the nigger, kill the nigger\" and throwing rocks at them. The next day, Wahlberg and others followed a group of schoolchildren taking a field trip on a beach, yelled racial epithets at them, threw rocks at them, and \"summoned other white males who joined\" in the harassment. In August 1986, civil action was filed against Wahlberg for violating the civil rights of his victims, and the case was settled the next month.In April 1988, Wahlberg assaulted a middle-aged Vietnamese man on the street, calling him a \"Vietnam fucking shit\" and knocking him unconscious with a large wooden stick. Wahlberg attacked a second Vietnamese man later the same day, punching him in the eye. When Wahlberg was arrested and returned to the scene of the first assault, he told police officers: \"I'll tell you now that's the mother-fucker whose head I split open.\" Investigators also noted that Wahlberg \"made numerous unsolicited racial statements about 'gooks' and 'slant-eyed gooks'\".\nWahlberg was charged with attempted murder, pleaded guilty to felony assault, and was sentenced to two years in jail, but served only 45 days of his sentence. Wahlberg believed he had left the second victim (named Trinh) permanently blind in one eye.In August 1992, Wahlberg fractured the jaw of a neighbor in an unprovoked attack. Court documents state that in 1992, Wahlberg \"without provocation or cause, viciously and repeatedly kicked\" a man in the face while another man held the victim on the ground.In 2006 Wahlberg said the right thing for him to do would be to meet with Trinh and make amends, though he had not done so. In 2016, while requesting a pardon for his conviction for the assault on Trinh, Wahlberg said he had met with Trinh and apologized \"for those horrific acts.\"In 2014 Wahlberg applied for a pardon for his convictions. His pardon application engendered controversy. According to the BBC, the debate about his suitability for a pardon raised \"difficult issues, with the arguments on both sides being far-reaching and complex\".One of the black children attacked by Wahlberg opposed the pardon, saying: \"a racist will always be a racist.\" Judith Beals, who had been the prosecutor in some of the cases, argued that \"Wahlberg has never acknowledged the racial nature of his crimes\" and that a pardon would undermine Wahlberg's charity work, saying: \"a formal public pardon would highlight all too clearly that if you are white and a movie star, a different standard applies. Is that really what Wahlberg wants?\"In September 2016, Wahlberg said that he regretted his attempt to obtain a pardon, and his petition was closed after he failed to answer a request from the pardon board as to whether he wanted it to remain open.", "Career": "=== Music ===\nWahlberg first came to fame as the younger brother of Donnie Wahlberg of the successful boy band, New Kids on the Block. Mark, at the age of 13, was one of the group's original members, along with Donnie, but quit after a few months. Danny Wood, Jordan Knight, Jonathan Knight and Joey McIntyre all joined the group after Mark had left.\nIn 1990, Wahlberg began recording with dancers/rappers Scott Ross (Scottie Gee), Hector Barros (Hector the Booty Inspector), Anthony Thomas (Ashley Ace), and Terry Yancey (DJ-T) as Marky Mark and the Funky Bunch, earning a hit with \"Good Vibrations\" from their debut album Music for the People. The record, produced by brother Donnie, hit number one on the Billboard Hot 100, later becoming certified as a platinum single. The second single, \"Wildside\", peaked at number five on Billboard's Hot Singles Sales chart and at number 10 on the Billboard Hot 100. It was certified as a gold single. Marky Mark opened for the New Kids on the Block during their last tour. Marky Mark and the Funky Bunch also had their own video game, titled Marky Mark and the Funky Bunch: Make My Video, which despite the band's success, was a huge flop. The second Marky Mark and the Funky Bunch LP, You Gotta Believe, was not as successful as the first, yielding only a minor hit single in the title track.In December 1992, while performing on the British TV show The Word, Wahlberg praised Shabba Ranks, who had stated gays should be crucified. Gay and Lesbian Alliance Against Defamation condemned him and berated Calvin Klein for using him to promote their products. A self-titled autobiographical picture book Marky Mark, with images taken by Lynn Goldsmith and statements mostly by him was also released. Trying to resuscitate his music career, he had shifted to Hamburg where he was produced under the label of East West Records by Frank Peterson and Alex Christensen.Wahlberg later collaborated with the late reggae/ragga singer Prince Ital Joe on the album Life in the Streets. The project combined rap vocals, electronic-infused ragga, and \"European dancefloor\" music, delivering the singles \"Happy People\", German number one hit \"United\", \"Life in the Streets\", and \"Babylon\", with Frank Peterson and Alex Christensen as producers. Many of these tracks featured on the hit film Renaissance Man, starring Wahlberg and Danny Devito.\nIn 1995, he released a single titled \"No Mercy\" in support of his friend Dariusz Michalczewski, whom he had befriended earlier in the 1990s. Michalczewski also appears in the music video of the song. Wahlberg and Prince Ital Joe released another album in 1995 for Ultraphonic Records. Titled The Remix Album, it featured remixes from the duo's previous album, Life in the Streets, as well as the Mark's solo track, \"No Mercy\".After his album with Ital Joe became a hit in Germany, he started putting together a musical act called One Love with him as its producer and also sometimes its lead singer. He also started production on a third studio album. In 1996, Wahlberg released a solo single titled \"Hey DJ\". Two solo tracks titled \"Feel the Vibe\" and \"Best of my Love\" were released in 1997. All the solo tracks, along with another song titled \"Here With Me\", were released on an album titled All Around the World in 1997 that also included the remixed versions of the songs.In 2000, he was also featured in the Black Label Society music video for \"Counterfeit God\", as a stand-in for the band's bassist.\n\n\n=== Advertising ===\nWahlberg first displayed his physique in the \"Good Vibrations\" music video and most prominently in a series of underwear ads for Calvin Klein (1992) shot by Herb Ritts, following it with Calvin Klein television advertisements. Magazine and television promotions would sometimes feature Wahlberg exclusively or accompanied by model Kate Moss. Annie Leibovitz also shot a famous session of Wahlberg in underwear for Vanity Fair's annual Hall of Fame issue. He also made a workout video titled The Marky Mark Workout: Form... Focus... Fitness (ISBN 1-55510-910-1).\nIn 2012, Wahlberg began serving as a brand ambassador for a line of sports nutrition supplements by GNC called Marked.In March 2017, AT&T announced that Wahlberg would become a spokesman and he would create original content for the mobile network division. The deal would reportedly pay Wahlberg more than $10 million.\n\n\n=== Film ===\n\nIn 1993, Wahlberg made his acting debut in the TV film The Substitute. After this appearance, he dropped the \"Marky Mark\" name. His big screen début came the next year, with the Danny DeVito feature Renaissance Man. A basketball fanatic, he caught the attention of critics after appearing in The Basketball Diaries in 1995, playing the role of Mickey alongside Leonardo DiCaprio, in a film adaptation of the Jim Carroll book of the same name. He had his first starring role in the 1996 James Foley thriller Fear.\nHe earned positive reviews after films such as Boogie Nights (as Dirk Diggler), Three Kings, The Perfect Storm, and Four Brothers. During the early 2000s, Wahlberg appeared in remakes of 1960s films such as Planet of the Apes, The Truth About Charlie (remake of Charade), and The Italian Job. His performance in I Heart Huckabees was voted best supporting performance of the year in the 2004 The Village Voice Critics Poll. Wahlberg was originally cast as Linus Caldwell in Ocean's Eleven; Matt Damon played the role instead. The two later worked together in The Departed. Wahlberg was also considered for a role in the film Brokeback Mountain. It was originally intended to star Wahlberg and Joaquin Phoenix (with whom he appeared in the 2000 film The Yards) as Ennis Del Mar and Jack Twist, respectively, but both actors were uncomfortable with the film's sex scenes. The roles ultimately went to Heath Ledger and Jake Gyllenhaal, both of whom were nominated for Academy Awards for their performances.Wahlberg starred in the American football drama Invincible, based on the true story of bartender Vince Papale. He was also the executive producer of the HBO series Entourage (2004–2011), which was loosely based on his experiences in Hollywood. In 2006, he appeared as an unpleasant, foul-mouthed Massachusetts State Police detective in Martin Scorsese's critically acclaimed thriller, The Departed, which netted him an Academy Award nomination for Best Supporting Actor, a Golden Globe nomination for Best Performance by an Actor in a Supporting Role in a Motion Picture, and a National Society of Film Critics Best Supporting Actor award. Wahlberg has confirmed that he was approached to star in a sequel to The Departed, but it is still early in development. The sequel would reportedly revolve around the staff sergeant played by Wahlberg.\n\nDespite his felony conviction, which legally prohibits him from handling firearms, Wahlberg prepared for his role in Shooter by attending long-range shooting training at Front Sight Firearms Training Institute near Pahrump, Nevada. He was able to hit a target at 1,100 yards on his second day, a feat which usually takes weeks to achieve. He had said in a number of interviews that he would retire at the age of 40 to concentrate on parenthood and professional golf. However, in early 2007 he indicated that the latter was no longer the plan as \"his golf game is horrible\". He played Jack Salmon, a leading role in Peter Jackson's film of The Lovely Bones. In 2007, he starred opposite Joaquin Phoenix in We Own the Night, a movie about a family of police officers in New York City.\nHe starred in M. Night Shyamalan's The Happening as Eliot Moore, which premiered in movie theatres on June 13, 2008. The same year, he played the title role in Max Payne, based on a video game of the same name. While promoting Max Payne, Wahlberg became involved in a playful feud with The Lonely Island's Andy Samberg. Samberg had done an impression of Wahlberg in a Saturday Night Live sketch titled \"Mark Wahlberg Talks to Animals\". Wahlberg later appeared in a follow-up sketch parodying the original one, Samberg's impression of Wahlberg, and his own threats to Samberg.In a February 2007 interview with Empire, updated in 2010, Wahlberg stated that there might be a sequel to The Departed, focusing on his character, Dignam, with Robert De Niro potentially playing a corrupt senator. He also stated that William Monahan was writing the script. The film is said to be on hold, because producer Brad Grey is now the head of Paramount Pictures and the film is a Warner Bros. project. In June 2010, Wahlberg and Monahan continued to express interest in a sequel, then said to be projected for 2012. Nothing further has been announced.\nIn 2012, Wahlberg starred in Seth MacFarlane's hit comedy Ted. He returned in the same role in the 2015 sequel Ted 2. Wahlberg later starred as Navy SEAL Marcus Luttrell in the war film Lone Survivor (2013), based on Luttrell's 2007 book of the same name. The film received commercial success and mostly positive reviews, and Wahlberg's performance was highly praised. In 2014, Wahlberg starred in the remake of The Gambler, the 1974 James Caan film that was loosely inspired by the Dostoyevsky novella. In 2015, he starred opposite Will Ferrell in the comedy Daddy's Home. In 2016, he starred in two Peter Berg films, Deepwater Horizon and Patriots Day.\nWahlberg topped the list of the world's highest-paid actors in 2017. In 2018, his salary of $1.5 million for reshoots for All the Money in the World caused controversy because his female co-star Michelle Williams received less than $1,000. Wahlberg donated the money to Time's Up, a movement against sexual harassment co-founded by Williams.Walhberg produced and starred in the hacker film Mile 22 and has set to appear in the Netflix film Wonderland and the animated Scoob.\n\n\n=== Business interests ===\nWahlberg co-owns Wahlburgers with his brothers Donnie and Paul. It was Mark's idea to expand Paul's restaurant in Hingham, Massachusetts, into a full-fledged chain with a reality show to promote it.In July 2013, Wahlberg bought an equity interest of the Barbados Tridents cricket team. Wahlberg was introduced to the game by his friend Ajmal Khan, the club's chairman and Caribbean Premier League founder. Following the announcement, Wahlberg stated, \"I am a huge cricket fan now. I'm excited to be a part of the Limacol Caribbean Premier League because I know cricket is huge in the Caribbean and a rich part of the region's heritage. Sports and entertainment are a powerful combination, and the LCPL will appeal to a huge audience worldwide.\"In 2015, Wahlberg recruited rapper Sean Combs and billionaire Ronald Burkle to join him in investing in Aquahydrate, a bottled water brand Wahlberg discovered. Together, the three men own a majority stake in the company. Wahlberg, together with former GNC executive Tom Dowd, co-founded Performance Inspired, a sports nutrition company launched in 2016. In February 2017, Wahlberg was one of the investors who took part in a $6 million funding round for StockX, a sneaker resale marketplace. On July 20, 2018, Wahlberg and his business partner, Jay Feldman, announced the purchase of Bobby Layman Chevrolet in Columbus, Ohio. The dealership was renamed Mark Wahlberg Chevrolet. In March 2019, Wahlberg bought a stake in the F45 fitness franchise.\n\n\n=== Television production ===\nIn 2014, Wahlberg was the producer of the reality show Breaking Boston, which was pulled off the air after its premiere had 311,000 viewers. He executive-produced one episode of Wahlburgers, while co-starring in it.", "Charities": "Wahlberg established the Mark Wahlberg Youth Foundation in May 2001 for the purpose of raising and distributing funds to youth service and enrichment programs.\nWahlberg is active with The Good Shepherd Center for Homeless Women and Children.", "Personal life": "In a relationship with model Rhea Durham since 2001, the couple married on August 1, 2009, at the Good Shepherd Catholic Church in Beverly Hills. They have four children: daughters Ella Rae (b. 2003) and Grace Margaret (b. 2010), and sons Michael (b. 2006) and Brendan Joseph (b. 2008).\n\nWahlberg's father, a U.S. Army veteran of the Korean War, died on February 14, 2008.In 2012, Wahlberg was quoted in a magazine interview regarding what would have happened if he had flown aboard American Airlines Flight 11 on September 11, 2001. He had been booked on Flight 11, but his plans changed the day before the scheduled flight and he cancelled his reservation. Wahlberg received public criticism for stating, \"If I was on that plane with my kids, it wouldn't have went down like it did,\" and \"There would have been a lot of blood in that first-class cabin and then me saying, 'OK, we're going to land somewhere safely, don't worry.'\" Wahlberg issued a public apology after family members of those killed on the flight expressed outrage about his statements.A committed Roman Catholic, Wahlberg openly supports same-sex marriage, despite the church's opposition. He said that he first relied on the guidance of his parish priest to turn his back on crime; he said that he told his street gang that he was leaving them and had \"some serious fights\" with them over it. In September 2015, he apologized to Pope Francis about the crude jokes he made in the film Ted, and in October 2017, in a public interview conducted by Catholic Cardinal Blase Cupich of Chicago, stated that he has sought forgiveness from God for portraying a porn actor in Boogie Nights. He later stated on Andy Cohen's radio show, Radio Andy, that the interview \"was a joke taken too seriously.\"", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Fitness documentary ===\nForm... Focus... Fitness, the Marky Mark Workout (1993)\n\n\n=== Producer ===", "Discography": "=== Studio albums ===\n\n\n==== Marky Mark and the Funky Bunch ====\n\n\n==== Prince Ital Joe and Marky Mark ====\n\n\n=== Remix albums ===\n\n\n==== Prince Ital Joe and Marky Mark ====\n\n\n=== Singles ===\n\n\n==== Marky Mark and the Funky Bunch ====\n\n\n==== Prince Ital Joe and Marky Mark ====\n\n\n==== Solo ====", "Awards and nominations": "", "References": "", "Further reading": "Reisfeld, Randi. Marky Mark and the Funky Bunch. New York: Avon Books, 1992. ISBN 0-380-77100-4\nSimpson, Mark. \"Marky Mark and the Hunky [sic] Bunch: the Hustler Syndrome\", in his Male Impersonators: Men Performing Masculinity (New York: Routledge, 1994, ISBN 0-41590991-0), pp. [150]–163. N.B.: Wahlberg is also mentioned and discussed elsewhere (as \"Marky Mark\") in Simpson's book.", "External links": "Mark Wahlberg on IMDb \nMark Wahlberg at the TCM Movie Database\nMark Wahlberg in the Hollywood Walk of Fame Directory\nMark Wahlberg at Box Office Mojo\nWorks by or about Mark Wahlberg in libraries (WorldCat catalog)"}