{"_id": "35", "name": "Robert De Niro", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:38", "biography": "Robert Anthony De Niro Jr. (, Italian: [de ˈniːro]; born August 17, 1943) is an American-Italian actor, producer, and director. He is a recipient of numerous accolades, including two Academy Awards, a Golden Globe Award, the Cecil B DeMille Award, AFI Life Achievement Award, Presidential Medal of Freedom, and has been nominated for six BAFTA Awards, four Primetime Emmy Awards and four Screen Actors Guild Awards.\nDe Niro was cast as the young Vito Corleone in the 1974 film The Godfather Part II, for which he won the Academy Award for Best Supporting Actor. His longtime collaboration with director Martin Scorsese earned him the Academy Award for Best Actor for his portrayal of Jake LaMotta in the 1980 film Raging Bull.\nDe Niro's first major film roles were in the sports drama Bang the Drum Slowly (1973) and Scorsese's crime film Mean Streets (1973). He earned Academy Award nominations for the psychological thrillers Taxi Driver (1976) and Cape Fear (1991), both directed by Scorsese. De Niro received additional nominations for Michael Cimino's Vietnam war drama The Deer Hunter (1978), Penny Marshall's drama Awakenings (1990), and David O. Russell's romantic comedy-drama Silver Linings Playbook (2012). His portrayal of gangster Jimmy Conway in Scorsese's crime film Goodfellas (1990), and his role as Rupert Pupkin in the black comedy film The King of Comedy (1982), earned him BAFTA Award nominations.De Niro has earned four nominations for the Golden Globe Award for Best Actor – Motion Picture Musical or Comedy, for his work in the musical drama New York, New York (1977), the action comedy Midnight Run (1988), the gangster comedy Analyze This (1999), and the comedy Meet the Parents (2000). Other notable performances include roles in 1900 (1976), The Last Tycoon (1976), Once Upon a Time in America (1984), Brazil (1985), The Mission (1986), The Untouchables (1987), Heat (1995), Casino (1995) and Ronin (1998). He has directed and starred in films such as the crime drama A Bronx Tale (1993) and the spy film The Good Shepherd (2006).", "Early life": "Robert Anthony De Niro Jr. was born on August 17, 1943, in the Manhattan borough of New York City, the only child of painters Virginia Admiral and Robert De Niro Sr. He is of Irish and Italian descent on his father's side, while his mother had Dutch, English, French, and German ancestry.De Niro's parents, who had met at the painting classes of Hans Hofmann in Provincetown, Massachusetts, divorced when he was two years old after his father announced that he was gay. De Niro was raised by his mother in the Greenwich Village and Little Italy areas of Manhattan. His father lived within walking distance and De Niro spent much time with him as he grew up. His mother was raised Presbyterian but became an atheist as an adult, while his father had been a lapsed Catholic since the age of 12. Against his parents' wishes, his grandparents had him secretly baptized into the Catholic Church while he was staying with them during his parents' divorce.De Niro attended PS 41, a public elementary school in Manhattan, through the sixth grade. He then went to Elisabeth Irwin High School, the private upper school of the Little Red School House, for the seventh and eighth grades. He was accepted into the High School of Music and Art for the ninth grade, but only attended for a short time before transferring to a public junior high school, IS 71, Charles Evan Hughes Junior High School. De Niro began high school at the private McBurney School and later attended the private Rhodes Preparatory School, although he graduated from neither. Nicknamed \"Bobby Milk\" for his pallor, De Niro hung out with a group of street kids as a youth in Little Italy, some of whom have remained his lifelong friends. His stage debut was at age 10, when he played the Cowardly Lion in a school production of The Wizard of Oz. Along with finding relief from shyness through performing, he was also fixated by cinema, and he dropped out of high school at age 16 to pursue acting. He studied acting at HB Studio, the Stella Adler Conservatory, as well as Lee Strasberg's Actors Studio.", "Career": "=== Acting and filmmaking ===\nDe Niro's first film role came at the age of 20, when he appeared in Brian De Palma's 1963 film The Wedding Party, but the film was not released until 1969. He then appeared in Roger Corman's film Bloody Mama (1970). He gained popular attention with his role as a dying Major League Baseball player in Bang the Drum Slowly (1973) and began his collaboration with Martin Scorsese when he played the small-time criminal Johnny Boy in Mean Streets (1973).De Niro had a pivotal role in the Francis Ford Coppola film The Godfather Part II (1974), playing the young Vito Corleone. Coppola had remembered his previous auditions for the roles of Sonny Corleone, Michael Corleone, Carlo Rizzi, and Paulie Gatto in The Godfather. His performance earned him his first Academy Award, for Best Supporting Actor, although Coppola accepted the award as De Niro was not present at the ceremony. De Niro became the first actor to win an Academy Award speaking mainly a foreign language. In this case, several Sicilian dialects, although he delivered a few lines in English. He and Marlon Brando, who played the older Vito Corleone in the first film, are the only actors to have won Oscars for portraying the same fictional character.\nAfter working with Scorsese in Mean Streets, De Niro went on to have a successful working relationship with him in films such as Taxi Driver (1976), New York, New York (1977), Raging Bull (1980), The King of Comedy (1982), Goodfellas (1990), Cape Fear (1991), and Casino (1995). They also acted together in Guilty by Suspicion (1991) and provided their voices for the animated feature Shark Tale (2004). Taxi Driver was particularly important to De Niro's career. His iconic performance as Travis Bickle catapulted him to stardom and forever linked his name with Bickle's famous \"You talkin' to me?\" monologue, which De Niro largely improvised. The role of Bickle earned him his first Academy Award Nomination for Best Actor. His portrayal of Jake LaMotta in Raging Bull was lauded, as well as his interpretation of Max Cady in Cape Fear.\n\nIn 1976, De Niro appeared in 1900, Bernardo Bertolucci's biographical exploration of life in Italy before World War II, seen through the eyes of two Italian childhood friends at the opposite sides of society's hierarchy. He also starred in The Last Tycoon (1976), directed by Elia Kazan. Kazan recalls that De Niro \"would do almost anything to succeed\" and noted that he cut his weight down from 170 to 128 pounds for the role in this film. Kazan adds that De Niro \"is one of a select number of actors I've directed who work hard at their trade, and the only one who asked to rehearse on Sundays. Most of the others play tennis. Bobby and I would go over the scenes to be shot. Bobby is more meticulous... he's very imaginative. He's very precise. He figures everything out both inside and outside. He has good emotion. He's a character actor: everything he does he calculates. In a good way, but he calculates.\" Kazan developed and used those personality traits for his character in the film. And although the film did poorly at the box office, reviewers praised De Niro's acting. Film critic Marie Brenner wrote that \"for De Niro, it is a role that surpasses even his brilliant and daring portrayal of Vito Corleone in The Godfather Part II... his performance deserves to be compared with the very finest\".\n\nDe Niro played Michael Vronsky in the acclaimed Vietnam War film The Deer Hunter (1978), for which he was nominated for Best Actor in a Leading Role. Fearing he had become typecast in mob roles, he began expanding into occasional comedic roles in the mid-1980s and has had much success there as well, with such films as Brazil (1985), Midnight Run (1988), Analyze This (1999), Meet the Parents (2000), and Meet the Fockers (2004). Other films include True Confessions (1981), Falling in Love (1984), Once Upon a Time in America (1984), The Mission (1986), Angel Heart (1987), The Untouchables (1987), Goodfellas (1990), Awakenings (1990), Mary Shelley's Frankenstein (1994), Heat (1995), The Fan (1996), Sleepers (1996), Wag the Dog (1997), Jackie Brown (1997), Ronin (1998) and Flawless (1999).\nIn 1987, De Niro was the President of the Jury at the 15th Moscow International Film Festival. He appeared in This Boy's Life (1993). Around this time, he was offered the role of the psychotic assassin Mitch Leary in In the Line of Fire opposite Clint Eastwood (1993). However, due to scheduling conflicts with his directorial debut A Bronx Tale (1993), he gave up the role to John Malkovich, who later received an Academy Award nomination for it. In A Bronx Tale, which De Niro agreed to direct after seeing the screenwriter's one-man off-Broadway play, he played a bus driver who struggles to keep his son away from a local mobster. At the 20th Moscow International Film Festival in 1997, he was awarded an Honorable Prize for contribution to cinema.De Niro would reference In the Line of Fire, along with Dirty Harry (1971) and Magnum Force (1973), two more of Eastwood's films, in Righteous Kill (2008). He also appeared in the crime drama Cop Land (1997). He starred in the police action-thriller Heat (1995), along with fellow actor and long-time friend, Al Pacino. The duo drew much attention from fans, as both have generally been compared throughout their careers. Though Pacino and De Niro both starred in The Godfather Part II (1974), they shared no screen time. They once again appeared together in Righteous Kill (2008).De Niro played Master Chief Billy Sunday in the biographical film Men of Honor (2000), based on the life of Carl Brashear, the first African American to become a U.S. Navy Master Diver. That same year, he starred in the comedy Meet the Parents opposite Ben Stiller as Jack Byrnes, a former CIA operative who takes a dislike to Stiller's character. He also hosted 9/11 (2002), a documentary about the 9/11 attacks, shown on CBS and focusing on video footage made by Jules and Gedeon Naudet that showed the role of firefighters following the attacks. Also that same year, he starred in the action comedy Showtime opposite Eddie Murphy. In the movie, he and Murphy play as cops assigned to work together in a TV show while trying to bring down an arms dealer; the movie received both critical and box office failure. He reprised his role as Jack Byrnes in Meet the Fockers (2004) and was featured in Stardust (2007). All of the films were successful at the box office.\n\nDe Niro had to turn down a role in The Departed (2006) due to commitments with preparing The Good Shepherd (2006). He said: \"I wanted to. I wish I could've been able to, but I was preparing The Good Shepherd so much that I couldn't take the time to. I was trying to figure a way to do it while I was preparing. It just didn't seem possible.\" In June 2006, it was announced that De Niro had donated his film archive (including scripts, costumes, and props) to the Harry Ransom Center at the University of Texas at Austin. On April 27, 2009, it was announced that the De Niro collection at the Ransom Center was open to researchers and the public. De Niro directed and starred in The Good Shepherd (2006). The film reunited him onscreen with Joe Pesci, with whom he had starred in Raging Bull, Goodfellas, A Bronx Tale, Once Upon a Time in America, and Casino.\nDe Niro announced that he would appear in the film version of the BBC crime series Edge of Darkness in 2010. However, just after he arrived to begin shooting, De Niro left the film due to creative differences. He was replaced by Ray Winstone. He appeared as Senator John McLaughlin in the action film Machete (2010), and starred in the thriller Stone (2010). He again reprised his role as Jack Byrnes in Little Fockers (2010). He appeared in the action film Killer Elite (2011), Limitless (2011) and the romantic comedy film New Year's Eve (2011).De Niro starred in the film Manuale d'amore 3 (2011). In January 2011, CBS picked up De Niro's crime pilot, NYC 22 (originally titled Rookies), but it was canceled after airing only four episodes. In 2011, De Niro was the President of the Jury for the 64th Cannes Film Festival. In 2012, he starred in the films Silver Linings Playbook, Freelancers, Red Lights, and Being Flynn. He received a nomination for an Academy Award for Best Supporting Actor for his role in Silver Linings Playbook.In July 2018 it was announced that De Niro would appear in Todd Phillips' 2019 film Joker, an original story based on the Batman comic book supervillain The Joker, who will be played by Joaquin Phoenix.De Niro is set to reunite with Martin Scorsese in the Netflix film The Irishman based on the book I Know You Paint Houses by Charles Brandt. Al Pacino, Harvey Keitel, Joe Pesci, Bobby Cannavale, Anna Paquin, and Ray Romano are set to star in the film. The film's teaser trailer was released during the 91st Academy Awards.\n\n\n=== Commercial ventures ===\nDe Niro's capital ventures have included co-founding the film studio TriBeCa Productions, the Tribeca Film Festival, the restaurants Nobu and Tribeca Grill (which he co-owns with Broadway producer Stewart F. Lane), the Greenwich Hotel (located in Tribeca), and the restaurant inside the hotel, Locanda Verde (run by executive chef and co-owner Andrew Carmellini). In August 2019, De Niro's film production company Canal Productions filed a $6 million lawsuit against a former employee for breaching her fiduciary duties and violating New York's faithless servant doctrine by embezzling money and binge-watching Netflix at work, including watching 55 episodes of Friends in four days.", "Filmography": "Selected filmography:", "Awards and nominations": "=== Academy Awards ===\nDe Niro has received two awards from seven nominations.\n\n\n=== British Academy Film Awards ===\n\n\n=== Golden Globe Awards ===\n\n\n=== Primetime Emmy Awards ===\n\n\n=== Screen Actors Guild Awards ===", "Acting style and legacy": "De Niro studied with Stella Adler, from whom he learned about the techniques of the Stanislavski system. The technique encouraged him to explore both internal and external aspects to fully realize the character being portrayed. He is praised for his commitment to roles; he gained 60 lb (27 kg) and learned how to box for his role as Jake LaMotta in Raging Bull, ground his teeth down for Cape Fear, lived in Sicily for The Godfather Part II, worked as a cab driver for a few weeks for Taxi Driver, and learned to play the saxophone for New York, New York. He again put on weight for his performance as Al Capone in The Untouchables.De Niro's brand of acting includes employing whatever extreme tactic he feels is necessary to elicit the best performance from those with whom he is working. During the filming of The King of Comedy, he directed a slew of anti-Semitic epithets at co-star Jerry Lewis to enhance and authenticate the anger demonstrated by Lewis' character. According to People magazine, the technique was successful, with Lewis recalling, \"I forgot the cameras were there... I was going for Bobby's throat.\"", "Personal life": "=== Family ===\nDe Niro married his first wife, Diahnne Abbott, in 1976. They have a son, Raphael, a former actor who works in New York real estate. De Niro also adopted Abbott's daughter Drena De Niro from a previous relationship. They divorced in 1988. De Niro has twin sons, Julian and Aaron, conceived by in vitro fertilization and delivered by a surrogate mother in 1995, from a long relationship with former model Toukie Smith.In 1997, De Niro married his second wife, actress Grace Hightower. Their son Elliot was born in 1998 and the couple split in 1999. The divorce was never finalized and in 2004 they renewed their vows. In December 2011, their daughter was born via surrogate. In addition to his six children, De Niro has four grandchildren; his daughter Drena has one child, and his son Raphael has three. In November 2018, it was reported De Niro and Hightower had separated after 20 years of marriage.In October 2003, his spokesman announced that De Niro had been diagnosed with prostate cancer. He underwent surgery at the Memorial Sloan-Kettering Cancer Center in December 2003.De Niro announced on March 25, 2016, that his son Elliot has autism and explained his interest in its causes and treatment.\n\n\n=== Properties ===\nDe Niro, who has long resided in New York City, has been investing in Manhattan's Tribeca neighborhood since 1989. He has residences on the east and west sides of Manhattan. He also has a 32-hectare (78-acre) estate in Gardiner, New York, which serves as his primary residence.He is a stakeholder in Paradise Found Nobu Resort, a company planning to build a luxury resort on the island of Barbuda.\n\n\n==== Tribeca Grill ====\nTribeca Grill is a New American restaurant located at 375 Greenwich Street (at Franklin Street) in Tribeca, Manhattan, in New York City, co-owned by Robert De Niro, Drew Nieporent and Lou Diamond Phillips, among others. It opened in 1990. The Executive Chef is Scott Burnett. The \"large mahogany bar is from the Maxwell's Plum restaurant.\"\n\n\n=== Legal issues ===\nDuring a film shoot in France in February 1998, De Niro was questioned as a witness about the Bourgeois prostitution ring. De Niro denied any involvement, later filing a complaint. Despite saying at the time that he would not return to France, he later filmed there and presided over the jury at the 2011 Cannes Film Festival.In 2006, the trust that owns De Niro's Gardiner estate sued the town to have its property tax assessment reduced, arguing that, at $6 million, it was too high and should be compared only with similar properties in Ulster County, where Gardiner is located. The town, which had been comparing its value to similar estates in Dutchess County, across the Hudson River, and Connecticut's Litchfield County, east of Dutchess, where many other wealthy New York City residents maintain estates on large properties, won in State Supreme Court. But in 2014, the trust's lawyers appealed the decision and the town was unsure if it should continue to defend the suit because of its own financial limitations (it would have earned far less in payments on the increased taxes than it had spent in legal bills). This has made many residents, who initially sympathized with De Niro, angry, and some proposed to raise money privately to help the town continue the suit.A local newspaper's report on the continued dispute was picked up by The New York Times and made international news. \"When he read about it on Election Day, he went bananas,\" due to the negative publicity, said Gardiner town councilman Wiegand. He had apparently been unaware that the trust had filed the lawsuit. Its accountants took the blame, citing their fiduciary duty. A short time later, his lawyer met with town officials, at De Niro's direction, and offered them withdrawal of the suit and $129,000 in reimbursement for the town's legal bills, paid by the accounting firm. \"[He] made it very clear that De Niro didn't want to screw the town, that he didn't know about any of it and that he wanted it settled as quickly as possible,\" Wiegand said.\n\n\n=== Political activism ===\nIn 1998, he lobbied Congress against impeaching President Bill Clinton.While promoting the film The Good Shepherd with co-star Matt Damon on the December 8, 2006, episode of Hardball with Chris Matthews at George Mason University, De Niro was asked whom he would like to see as President of the United States. De Niro responded, \"Well, I think of two people: Hillary Clinton and Obama.\" On February 4, 2008, De Niro supported Obama at a rally at the Izod Center in New Jersey before Super Tuesday.In 2012, De Niro joined the anti-fracking campaign Artists Against Fracking.During the 2016 presidential campaign, De Niro was an outspoken critic of then-Republican presidential candidate Donald Trump, calling him \"so blatantly stupid\" and stating, \"He wants to punch people in the face?! I'd like to punch him in the face.\" This was in reference to the similar desire Trump expressed towards protestors at one of his rallies.On June 10, 2018, while introducing a performance by Bruce Springsteen of his song \"My Hometown\" at the 72nd Tony Awards, De Niro brought the audience to a standing ovation with this denunciation of President Trump:\n\nI'm gonna say one thing. Fuck Trump. It's no longer \"down with Trump\". It's \"fuck Trump\".\nA day later, in front of a crowd in Toronto, he apologized to Canadian Prime Minister Justin Trudeau for Trump's \"idiotic behavior\". He has said that Trump is a racist, and that like many white liberals he was “naive” about Obama's two election wins and their implication of a post-racial America. \"I felt we were on a new thing. I didn't realise how against him certain people were – racially against him, offended that he was there.\"De Niro initially supported the inclusion of the controversial documentary about an alleged vaccination coverup, Vaxxed, at the 2016 Tribeca Film Festival. He explained that his interest in the film resulted from his family experience with an autistic son. De Niro withdrew his recommendation \"after reviewing it ... with the Tribeca Film Festival team and others from the scientific community\". He said he was pressured by some festival filmmakers to remove Vaxxed from the festival lineup. He also said that he intends to be a part of the conversation about vaccines and autism in the future.\n\n\n=== Religious views ===\nDe Niro was raised by an atheist mother and a lapsed Catholic father who left the Catholic Church at age 12. His grandparents had him secretly baptized Catholic, and his grandmother was the main advocate of Catholicism in the family. He refuses to be asked about religion in interviews.\nWhen asked why he would not play Jesus Christ in Martin Scorsese's 1988 film The Last Temptation of Christ, he explained on at least two different occasions:\n\nLast Temptation was something I was never interested in doing. But I did tell [Scorsese], \"If you really have a problem, if you really want to do it, and you need me, I'll do it. If you're against the wall and have no other way, I'll do it as a friend. [...] I was not interested in playing Christ. It's like playing Hamlet. I just didn't want to do it. Marty and I talked about it. We do things with each other because we like to work together, but also for our separate reasons. I have mine as an actor, he has his as a director. That's the best way.\nIn addition, De Niro has played a number of Catholic characters in his movies, including a Catholic penitent in the 1986 film The Mission.\n\n\n=== Citizenship ===\nDe Niro received an Italian passport in 2006. His Italian citizenship was granted by the Italian government despite strong opposition by the Sons of Italy, who believe that De Niro damaged the public image of Italians by portraying criminals.", "See also": "List of Academy Award records", "References": "", "Biographies": "Baxter, John (2002). De Niro: A Biography. HarperCollins. ISBN 978-0-00-257196-8.\nDougan, Andy (2003). Untouchable: A Biography of Robert De Niro. Da Capo Press. ISBN 1-56025-469-6.", "External links": "Official website\nRobert De Niro at the Encyclopædia Britannica\nTribeca Shortlist\nRobert De Niro at Box Office Mojo\nRobert De Niro on Playbill\nRobert De Niro at Rotten Tomatoes\nRobert De Niro on IMDb \nRobert De Niro at the Internet Broadway Database"}