{"_id": "51", "name": "Karen Gillan", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:44", "biography": "Karen Sheila Gillan (born 28 November 1987) is a Scottish actress and filmmaker. She played Amy Pond, companion to the Eleventh Doctor, in the BBC One series Doctor Who (2010–2013). She received international recognition for playing Nebula in the Marvel Cinematic Universe films Guardians of the Galaxy (2014), Guardians of the Galaxy Vol. 2 (2017), Avengers: Infinity War (2018) and Avengers: Endgame (2019) as well as for her starring role in Jumanji: Welcome to the Jungle (2017).\nOn stage, Gillan appeared in John Osborne's play Inadmissible Evidence in 2011. Her first feature film as a writer and director, titled The Party's Just Beginning, was released in 2018.", "Early life": "Gillan was born and raised in Inverness, the daughter of Marie and Raymond Gillan. When she turned 16, Gillan moved to Edinburgh and completed an HNC Acting and Performance course at Telford College. She moved to London at age 18 to study at the Italia Conti Academy of Theatre Arts drama school.While studying at Italia Conti, Gillan was scouted by a modeling agency. Prior to her acting career, she worked as a model, premiering at London Fashion Week in 2007. Gillan has said she would not give up her acting career to return to modeling, stating that while she enjoyed modeling, acting had always been her main interest and goal.", "Career": "=== Television ===\n\nGillan's early television acting career included guest appearances on several television shows, with her first role being in an episode of ITV crime drama Rebus, a role for which she had to drop out of school. Gillan then undertook a two-year stint as a member of the ensemble cast of the sketch comedy series The Kevin Bishop Show, in which she played multiple characters including celebrities such as Katy Perry and Angelina Jolie. Gillan also appeared on TV in a leading role in a horror project entitled The Well, which was broadcast as a series of episodic short films on BBC Two and later as a web series on BBC.co.uk. Part of the BBC's multimedia \"switch\" programming, the short episodes interconnect with online games that further explore the environments presented in the series. In 2008, she starred in the Channel 4 television film Stacked.\nGillan went on to portray Amy Pond, companion to the Eleventh Doctor, on the British sci-fi series Doctor Who. Before cast in the lead role in May 2009, she previously appeared on Doctor Who in series four episode \"The Fires of Pompeii\" in the role of a soothsayer. She made her first on-screen appearance as Amy Pond in \"The Eleventh Hour\" with her cousin Caitlin Blackwood portraying a younger version of the same character. In 2010, she won in the Entertainment category at the Young Scot Awards. She appeared in the sixth series in 2011 and the first five episodes of the seventh series in 2012, after which her character and Rory Williams (portrayed by Arthur Darvill) left the series. Gillan reprised her role in the 2013 Christmas special \"The Time of the Doctor\".\nGillan was cast in the third season of A Touch of Cloth, which was co-created by Charlie Brooker. She then joined the regular cast of Adult Swim's NTSF:SD:SUV:: for the show's third season in 2013.In February 2014, Gillan was cast as the lead in Selfie, an American single-camera sitcom for ABC produced by Warner Bros. Television which was greenlit for the 2014–15 US television season. Gillan played a socialite named Eliza Dooley, a modern-day take on Eliza Doolittle, who is obsessed with social media. This was Gillan's first time in the lead role of an American television series. The series was cancelled by ABC on 7 November 2014 after seven episodes; the remaining six episodes were made available on Hulu starting 25 November 2014.\n\n\n=== Film ===\n\nAfter making an appearance in Outcast, it was announced that Gillan would star in an indie Scottish romantic comedy called Not Another Happy Ending alongside Emun Elliott in August 2011. She was selected by director John McKay because he came to know her during the production of We'll Take Manhattan, which he also directed, as \"a very bubbly, vibrant, energetic, funny, slightly clumsy person\" who was a perfect fit for the character. Filming took place in July 2012, though Elliott was replaced by Stanley Weber. Gillan told journalists that she was happy to be involved in a Scottish production that \"isn't about drug use or fighting the English\". The film premiered at the Edinburgh International Film Festival in June 2013. In 2012, Gillan appeared in the television film We'll Take Manhattan playing the part of supermodel Jean Shrimpton, which told the story of Shrimpton's relationship with the photographer David Bailey.Gillan starred in the lead role in the supernatural horror movie Oculus, which was filmed in Alabama and released in April 2014.In May 2013, Gillan was cast as Nebula in the Marvel superhero science fiction film Guardians of the Galaxy, which was released in August 2014. Gillan had her head shaved bald for the role, which Marvel turned into the wig that Gillan wore during the production of Selfie.In May 2014, Gillan was cast in the Western film In a Valley of Violence directed by Ti West, opposite John Travolta, Ethan Hawke and Taissa Farmiga. Gillan portrayed Ellen, the older sister to Farmiga's character.In 2015, Gillan appeared in the drama film The Big Short directed by Adam McKay, alongside Brad Pitt, Christian Bale, Ryan Gosling, Steve Carell and Melissa Leo. She wrote and directed her first short film, Coward, which screened at the 2015 Edinburgh Film Festival, and was nominated for several awards. Later in the year she wrote, directed, and starred in another short film called Conventional. She won in the Best Female Newcomer category at the 20th Empire Awards for Guardians of the Galaxy and Oculus.On 2 November 2016, it was announced that Gillan would write, direct and star in her directorial feature film debut with Burbank-based development and production company Mt. Hollywood Films' indie drama project titled Tupperware Party. Set in her home city of Inverness in the Scottish Highlands, filming began in January 2017 and wrapped in the following month. The title of the film was later changed to The Party's Just Beginning. The film was nominated for Best Feature Film at the British Academy Scotland Awards.In 2017, Gillan reprised her role as Nebula in Guardians of the Galaxy Vol. 2, this time becoming a member of the film's eponymous team, and co-starred in The Circle, alongside Emma Watson, Tom Hanks, and John Boyega. The latter film, released in April, was directed and written by James Ponsoldt, and was based on the novel by Dave Eggers. Also in that year, Gillan played the lead female role in Jumanji: Welcome to the Jungle, the third installment of the Jumanji franchise, starring alongside Dwayne Johnson, Kevin Hart, Jack Black and Nick Jonas. She replayed Nebula in Avengers: Infinity War (2018) and Avengers: Endgame (2019), which were filmed back-to-back. Filming for the two films began in January 2017 at Pinewood Atlanta Studios in Fayette County, Georgia and ended in January 2018. \nIn 2019, she took part in All Creatures Here Below, Stuber, Spies in Disguise and Jumanji: The Next Level. In 2020, she's set to appear in Call of the Wild, and will star in Gunpowder Milkshake alongside Lena Headey, Angela Bassett, Carla Gugino, Michelle Yeoh and Paul Giamatti.\n\n\n=== Theatre ===\nIn 2011, Gillan made her first theatre appearance playing the role of Shirley in John Osborne's play Inadmissible Evidence along with Douglas Hodge. The play debuted at the Donmar Warehouse on 16 October 2011.In November 2013, Gillan appeared on Broadway in a play called Time to Act, one of the plays included in \"The 24 Hour Plays on Broadway\" to benefit the non-profit Urban Arts Partnership.\n\n\n=== Selected other work ===\nIn 2011, Gillan helped promote Fashion Targets Breast Cancer (FTBC) and the opening of Squirrel Ward at the Great Ormond Street Hospital in London.Gillan has also voiced advertisements for eHarmony and The Royal Bank of Scotland. She also appeared in TV on the Radio's \"Happy Idiot\" music video, released on 3 October 2014.In 2018, she visited the Mikeysline crisis support centre in Inverness after presenting her film The Party's Just Beginning. The film is about the high suicide rate in the Scottish Highlands, and Gillan made a public pledge to support the mental health charity.", "Personal life": "During a 2012 interview on The Late Late Show, she stated that she had relocated to the US to star in the film Oculus.She has stated that, although her family is Catholic, she has not been christened and is not religious, instead agreeing with the statement that, \"we're just minuscule dots in the vast cosmic emptiness of the universe\".", "Filmography": "=== Feature film ===\n\n\n=== Television ===\n\n\n=== Short film ===\n\n\n=== Music videos ===\n\n\n=== Video games ===\n\n\n=== Stage ===", "Awards and nominations": "", "References": "", "External links": "Karen Gillan on IMDb"}