{"_id": "46", "name": "Tom Hiddleston", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:42", "biography": "Thomas William Hiddleston (born 9 February 1981) is an English actor, film producer, and musician. He is the recipient of several accolades, including a Golden Globe Award, a Laurence Olivier Award and has been nominated for two Primetime Emmy Awards. \nBorn in London, England, he earned a double first in Classics at the University of Cambridge and later proceeded to study acting at the Royal Academy of Dramatic Art. At the beginning of his career, he appeared in West End productions of Cymbeline (2007) and Ivanov (2008). He won the Olivier Award for Best Newcomer in a Play for his role in Cymbeline and was also nominated for the same award for his role as Cassio in Othello (2008). Hiddleston starred as the title character in a production of Coriolanus (2013-2014) winning the Evening Standard Theatre Award for Best Actor and receiving a nomination for the Olivier Award for Best Actor. He made his Broadway debut in a 2019 revival of Betrayal. \nHiddleston made his film debut in the drama Unrelated (2007). He came to wider public attention when cast as Loki in the Marvel Cinematic Universe, appearing in Thor (2011), The Avengers (2012), Thor: The Dark World (2013), Thor: Ragnarok (2017), Avengers: Infinity War (2018), and Avengers: Endgame (2019). In 2011, he won the Empire Award for Best Male Newcomer and was nominated for the BAFTA Rising Star Award. He has also appeared in Steven Spielberg's War Horse (2011), The Deep Blue Sea (2011), Woody Allen's romantic comedy Midnight in Paris (2011), the 2012 BBC series Henry IV and Henry V, and the romantic vampire film Only Lovers Left Alive (2013). In 2015, he starred in Guillermo del Toro's Crimson Peak, Ben Wheatley's High Rise, and played the troubled country music singer Hank Williams in the biopic I Saw The Light. The film Kong: Skull Island (2017) marked his first big-budget leading role outside MCU.\nHe starred in and was an executive producer of the AMC / BBC limited series The Night Manager (2016), for which he received two Primetime Emmy Award nominations for Outstanding Lead Actor in a Limited Series or Movie and Outstanding Limited Series, and won his first Golden Globe Award for Best Actor – Miniseries or Television Film.", "Early life": "Thomas William Hiddleston was born on 9 February 1981 in Westminster, London, the son of Diana Patricia (née Servaes) Hiddleston, an arts administrator and former stage manager, and Dr. James Norman Hiddleston, a physical chemist and former managing director of a biotech company that liaised with Oxford University. His father is from Greenock, Scotland and his mother is from Suffolk. His younger sister, Emma, is also an actress, whilst his older sister, Sarah, is a journalist in India. Through his mother, he is a great-grandson of Vice Admiral Reginald Servaes and a great-great-grandson of food producer Sir Edmund Vestey. His paternal grandfather, Alexander, served in the Royal Artillery and worked as a plater in the shipyards. He shares the same name as his great-great uncle, Tom Hiddleston, a shipyard plater from Greenock and a member of Royal Artillery's 51st (Highland) Division, who died after the Battle of the Somme and his name is engraved in the Broomhill war memorial.Hiddleston was raised in Wimbledon in his early years, and later moved to a village near Oxford. He started boarding at Windlesham House School at the age of seven, moving to the Dragon School in Oxford a year later. His parents divorced when he was 12. When discussing his parents' divorce in an interview with The Daily Telegraph, he stated: \"I like to think it made me more compassionate in my understanding of human frailty.\"At the age of 13, Hiddleston started at Eton College, again as a boarder. He continued on to Pembroke College at the University of Cambridge, where he earned a double first in Classics. During his second term at Cambridge, he was seen in a production of A Streetcar Named Desire by talent agent Lorraine Hamilton of Hamilton Hodell. He proceeded to study acting at the Royal Academy of Dramatic Art, from which he graduated in 2005.", "Career": "=== 2001–2010: Early work ===\nWhile still doing student plays, Hiddleston began appearing on television, landing parts in Stephen Whittaker's adaptation of Nicholas Nickleby (2001) for ITV, the BBC/HBO co-production Conspiracy (2001), and as Randolph Churchill, the son of Winston Churchill, in the BBC/HBO drama The Gathering Storm (2002).Upon graduating from RADA, Hiddleston was cast in his first film role, playing Oakley in Joanna Hogg's first feature film, Unrelated (2006). His sister Emma also appeared in the film as Badge. Casting director, Lucy Bevan, who cast him in the film said \"there was just a fantastic confidence about him\". Hiddleston had leading roles in Declan Donnellan's company Cheek by Jowl's productions The Changeling (2006), and Cymbeline (2007). For the latter he won the Laurence Olivier Award for Best Newcomer in a Play. His Donmar Warehouse credits include Cassio in Michael Grandage's production of Shakespeare's Othello (2008) alongside Chiwetel Ejiofor and Ewan McGregor, and Lvov in the West End revival of Chekhov's Ivanov (2008) with Kenneth Branagh.Hiddleston was the voiceover for BBC's documentary on the Galapagos Island in 2006. He also narrated the audiobook The Red Necklace by Sally Gardner in 2007, Hiddleston played the leading role of Edward in Hogg's second feature, Archipelago (2010). His TV credits include Magnus Martinsson in the BBC detective drama Wallander (2008), Bill Hazledine in Suburban Shootout (2006), John Plumptre in the BBC costume drama TV film Miss Austen Regrets (2008) and William Buxton in the BBC drama series Return to Cranford (2009). In 2007, he joined a list of British actors, including Kate Winslet and Orlando Bloom, to have guest starred in the long-running medical drama Casualty.\n\n\n=== 2011–2014: Career breakthrough ===\n\nHiddleston is well known for his portrayal of Loki in the 2011 Marvel Studios film Thor. He was invited to audition by Kenneth Branagh, the film's director, after having previously worked with Branagh on Ivanov and Wallander. Hiddleston said of Branagh, \"Ken has had a life-changing effect. He was able to say to the executives, 'Trust me on this, you can cast Tom and he will deliver'. It was massive and it's completely changed the course of what is available to me to do. Ken gave me my break.\" In the beginning, he originally auditioned for the part of Thor. \"I initially auditioned to play Thor. That was what I was being considered for, because I'm tall and blonde and classically trained, and that seemed to be the mold for what Thor was, he was to be a classical character. And it was in my auditions. I owe this entirely to Marvel and their open-mindedness, they saw something that they thought was interesting. They saw some temperament that they liked.\" The casting director gave Hiddleston six weeks to bulk up, so he went on a strict diet and gained twenty pounds of muscle. In the end, Branagh decided he was more suitable as the antagonist and cast him as Loki. The film magazine Empire ranked Hiddleston's portrayal as Loki the 19th Greatest Movie Character of All Time.In November 2010, Hiddleston appeared with Benedict Cumberbatch, Gemma Arterton, Eddie Redmayne and Rose Byrne among others in Danny Boyle's one time production of The Children's Monologues, in which he played Prudence, a young girl upset with her mother for her father leaving and excited for her birthday. The play was a one time event of adapted stories of children's first-hand experiences in South Africa being re-interpreted by and performed by various actors.In 2011, Hiddleston portrayed novelist F. Scott Fitzgerald in writer-director Woody Allen's Midnight in Paris. He then played the noble Captain Nicholls in War Horse, a film based on the 1982 novel by Michael Morpurgo, directed by none other than Steven Spielberg. The same year he starred as Freddie Page, a RAF pilot in the drama The Deep Blue Sea, alongside Rachel Weisz. In 2012, he reprised his role as the supervillain Loki in The Avengers. While filming a scene with Chris Hemsworth, who plays Thor, the film's director, Joss Whedon told the fighting duo that the scene did not look real enough, so Hiddleston told Hemsworth to really hit him for the fight scene. \"I said to Chris, 'Dude, just hit me. Just hit me because I'm protected here and it's fine.' He's like, 'Are you sure?' I was like, 'Yeah, it will look great. Just go for it.'\" He provided the voiceover the Ancient Egyptian Book of the Dead in 2011 and poetry for iF Poems and The Love Book on iTunes in 2012.On television in 2012, Hiddleston appeared in the BBC Two series The Hollow Crown, portraying Prince Hal opposite Jeremy Irons as Henry IV in the adaptation of Shakespeare's Henry IV, Part I and Part II. He later appeared as King Henry V in the television film Henry V. In 2013, Hiddleston played Loki again in Thor: The Dark World, following which he played a vampire in Jim Jarmusch's film Only Lovers Left Alive with Tilda Swinton and Mia Wasikowska.From December 2013 to February 2014, Hiddleston played the title character in William Shakespeare's Coriolanus at the Donmar Warehouse in Covent Garden directed by Josie Rourke. It was also aired live internationally on 30 January 2014. David Benedict of Variety praised a \"scorching\" performance. He had a cameo in the 2014 film Muppets Most Wanted, as the Great Escapo.\n\n\n=== 2015–present: Varied roles ===\n\nHiddleston replaced Benedict Cumberbatch in the gothic horror film Crimson Peak, directed by Guillermo del Toro. The film started filming in Toronto in February 2014, and was released in October 2015. He starred as Robert Laing in High-Rise (2015), based on J. G. Ballard's novel of the same name and directed by Ben Wheatley.In January 2014, Hiddleston became a spokesperson for Jaguar Cars in their \"Good to be Bad\" ad campaign featuring British actors in villain-themed commercials to promote Jaguars new models. The first commercial of the campaign, titled \"Rendezvous\", first aired during the 2014 Super Bowl and featured Hiddleston along with Mark Strong and Ben Kingsley.In April 2014, Hiddleston starred in another commercial in the campaign, titled \"The Art of Villainy\". It was released on YouTube, promoting the F-Type coupe. However, the Advertising Standards Authority received complaints about the video \"encouraging irresponsible driving\". Jaguar Land Rover said that in the ad, when the car did leave the car park, it \"accelerated briefly\" and that police were present at filming to confirm the speed limit was not breached but the ASA ruled against it and banned the commercial.It was announced in June 2014 that Hiddleston would play country music singer Hank Williams in the 2015 biopic I Saw the Light, based on the 1994 biography. The film was directed by Marc Abraham, and was first shown in the Special Presentations section of the 2015 Toronto International Film Festival. The film was released on 25 March 2016, by Sony Pictures Classics. Although the film wasn't well received, Hiddleston's performance was widely praised by critics. Stephanie Zacharek of Time called him \"magnificent\" adding that \"he honors Williams’ greatness but also wriggles beyond it.\"Hiddleston was one of the narrators in the 2015 documentary Unity directed by Shaun Monson. He appeared as Jonathan Pine in the 2016 television mini-series The Night Manager based on the espionage and detective novel of the same name by John le Carré. The series started filming in Spring 2015 and aired on BBC and AMC with Hugh Laurie also starring. Ben Travers of IndieWire noted that he carried the role of Pine from start to finish, \"with an admirable determination and aptly unbreakable constitution.\" For his performance in the series he was nominated for several awards, including two Primetime Emmy Awards and won a Golden Globe Award for Best Actor.\n\nIn early 2017 he expressed his will to take a long break from work, and his desire to work again in theater. Later the same year, Hiddleston starred in Legendary Pictures' King Kong film, Kong: Skull Island. Released on 10 March, and directed by Jordan Vogt-Roberts, Kong: Skull Island was a commercial success, earning over $566 million worldwide and received generally positive reviews. In September 2017 he played the title character in a limited run of William Shakespeare's Hamlet directed by Kenneth Branagh. The production ran for three weeks at a 160-seat theater, with the tickets given out by lottery system to raise money for RADA. Michael Billington of The Guardian called his performance \"a compelling Hamlet with a genuine nobility of soul.\" Ann Treneman of The Times praised his perfomance writing that he made the role \"completely his own, emotional, magnetic, canny, often frolicsome\" and that is \"a shame is that so few will see his HiddleHamlet.\"He reprised his role as Loki in Thor: Ragnarok, released on 3 November 2017, and also appeared in Avengers: Infinity War (2018) and Avengers: Endgame (2019). All three films were well received with Endgame earning over $2 billion worldwide to rank as the highest-grossing film of all time. He voiced the villain in Nick Park's animated film Early Man which was released in early 2018. In 2019, he starred as Robert from 5 March to 8 June in a revival of Harold Pinter's Betrayal at the Harold Pinter Theatre, directed by Jamie Lloyd. The play premiered to positive reviews and succeeded to have a sold-out West End run. In August 2019 he made his Broadway debut reprising his role of Robert in Betrayal, as the production transferred to Broadway for an 17-week limited engagement at the Bernard B. Jacobs Theatre.\n\n\n==== Upcoming projects ====\nOn 8 November 2018, it was announced that Hiddleston would be reprising his role as Loki in a new Marvel limited series centered on the character which will air on Disney's upcoming streaming service, Disney+. He is also set to voice the same character in the animated series What If…?. Hiddleston is in talks to reprise his role in a second series of The Night Manager. He is attached to star in a Ben Wheatley's adaptation of Frank Miller's comic book mini-series Hard Boiled produced by Warner Bros and in a James Ivory's adaptation of Shakespeare's Richard II as the eponymous character.", "Personal life and off-screen work": "Hiddleston lives in the Belsize Park area of north-west London. He has donated items for auction and has supported several charities, including: Small Steps Project, Starlight Children's Foundation, Cure EB, Comic Relief, Red Nose Day USA, Thomas Coram Foundation for Children, Great Ormond Street Hospital, Amnesty International and Chance to Shine.He is a UK ambassador of the humanitarian and developmental assistance fund group UNICEF. He traveled to Guinea in early 2013 to raise awareness about hunger and malnutrition, and to South Sudan in early 2015 and late 2016 to report the results of the ongoing civil war on the lives of vast numbers of children across the country. Hiddleston is a self-described feminist. In February 2018 he was named as one of the donators by Justice and Equality Fund, the UK version of Time's Up movement. He is also an ambassador of the Illuminating BAFTA campaign, an action which aims to provide opportunities to those who otherwise wouldn’t have been given a chance in the film, games and television industries.Hiddleston was previously in a relationship with actress Susannah Fielding, who appeared with him in an episode of Wallander in 2008. Their relationship ended in late 2011. In 2016, Hiddleston dated  American Pop singer Taylor Swift for several months.Hiddleston is a supporter of Scottish football club Rangers F.C..", "Media image and acting style": "One of the highest profile actors in contemporary British popular culture, Hiddleston appeared on Debrett's 2017 list of the most influential people in the UK. In 2015 he was named British Film Institute's first official founding ambassador. Hiddleston won the light-hearted UK award Rear of the Year 2016, in which the public nominate the male and female UK-based celebrities that they think should win the titular award. He has been named most stylish/best dressed man in several lists. Taffy Brodesser-Akner of GQ described his off-screen persona as \"a sweet-natured bookworm given the face and body of the only man who should ever be allowed to wear a suit\". Crimson Peak's director Guillermo del Toro and comic book writer Stan Lee have called him \"the nicest guy on earth/you’ll ever meet\" with del Toro adding that he ruined the usual barrier of being either nice, or good-looking.Kenneth Branagh noted that the first time he ever saw Hiddleston, playing Cassio in Othello, it was quite clear to him that he was an utterly naturalistic speaker of Shakespeare. Michael Billington of The Guardian, wrote that Hiddleston’s key acting quality is his ability to combine a sweet sadness with an incandescent fury, suggesting a fierce intellect gnawed by intense melancholy and yet subjecting to bouts of intemperate rage. Hiddleston spent nearly five weeks preparing for the role of Hank Williams, performing seven of the movie's soundtrack songs. He has claimed that Method acting isn't easy for him, because it doesn't help him as a collaborator. The Telegraph's Dominic Cavendish suggests that Hiddleston has got the theatrical acting chops to head up there among the greats, and The Independent's Paul Taylor that his range is beginning to look pretty limitless. David Fear of the Rolling Stone opines that there are two Tom Hiddlestons, the old-school movie star of Midnight in Paris, War Horse or The Night Manager, and the unpredictable, borderline weirdo version of him we can see in characters like Loki or in High-Rise, adding that Hiddleston refuses to settle on one specific kind of role.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Theatre ===\n\n\n=== Video games ===\n\n\n=== Radio ===", "Awards and nominations": "", "References": "", "External links": "Tom Hiddleston on IMDb \nTom Hiddleston on Twitter \nTom Hiddleston on Facebook\nTom Hiddleston on Instagram"}