{"_id": "24", "name": "Chadwick Boseman", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:33", "biography": "Chadwick Aaron Boseman (born November 29, 1976, or in 1977) (sources differ) is an American actor known for his portrayals of real-life historical figures such as Jackie Robinson in 42 (2013), James Brown in Get on Up (2014) and Thurgood Marshall in Marshall (2017) and for his portrayal of the superhero Black Panther in the Marvel Cinematic Universe films Captain America: Civil War (2016), Black Panther, Avengers: Infinity War (both 2018) and Avengers: Endgame (2019). \nBoseman has also had roles in the television series Lincoln Heights (2008) and Persons Unknown (2010) and the films The Express: The Ernie Davis Story (2008), Draft Day (2014) and Message from the King (2016).", "Early life": "Boseman was born and raised in South Carolina, to Carolyn and Leroy Boseman, both African American. According to Boseman, DNA testing has indicated that his ancestors were Krio people from Sierra Leone, Yoruba people from Nigeria and Limba people from Sierra Leone. His mother was a nurse and his father worked at a textile factory, keeping an upholstery business as well. Boseman graduated from T. L. Hanna High School in 1995. In his junior year, he wrote his first play, Crossroads, and staged it at the school after a classmate was shot and killed.He attended college at Howard University in Washington, D.C., graduating in 2000 with a Bachelor of Fine Arts in directing. One of his teachers was Phylicia Rashad, who became a mentor. She helped raise funds so that Boseman and some classmates could attend the Oxford Mid-Summer Program of the British American Drama Academy in London, to which they had been accepted.Boseman wanted to write and direct, and initially began studying acting to learn how to relate to actors. After he returned to the U.S., he graduated from New York City's Digital Film Academy. He lived in Brooklyn at the start of his career. Boseman worked as the drama instructor in the Schomburg Junior Scholars Program, housed at the Schomburg Center for Research in Black Culture in Harlem, New York. In 2008, he moved to Los Angeles to pursue an acting career.", "Career": "Boseman got his first television role in 2003, in an episode of Third Watch. His early work included episodes of the series Law & Order, CSI:NY, and ER. He also continued to write plays, with his script for Deep Azure performed at the Congo Square Theatre Company in Chicago; it was nominated for a 2006 Joseph Jefferson Award for New Work. In 2008, he played a recurring role on the television series Lincoln Heights and appeared in his first feature film, The Express: The Ernie Davis Story. He landed a regular role in 2010 in another television series, Persons Unknown.Boseman had his first starring role in the 2013 film 42, in which he portrayed baseball pioneer and star Jackie Robinson. He had been directing an off-Broadway play in East Village when he auditioned for the role, and was considering giving up acting and pursuing directing full-time at the time. About 25 other actors had been seriously considered for the role, but director Brian Helgeland liked Boseman's bravery and cast him after he had auditioned twice. In 2013, Boseman also starred in the indie film The Kill Hole, which was released in theaters a few weeks before 42.In 2014, Boseman appeared opposite Kevin Costner in Draft Day, in which he played an NFL draft prospect. Later that year, he starred as James Brown in Get on Up. In 2016, he starred as Thoth, a deity from Egyptian mythology, in Gods of Egypt.He started portraying the Marvel Comics character T'Challa / Black Panther in 2016, with Captain America: Civil War being his first film in a five-picture deal with Marvel. He headlined Black Panther in 2018, which focused on his character and his home country of Wakanda in Africa. The film opened to great anticipation, becoming one of the highest-grossing films of the year in the United States. He reprised the role in both Avengers: Infinity War and Avengers: Endgame, which were released in April 2018 and 26th April 2019 respectively.", "Personal life": "Boseman was raised a Christian. He was baptized, and was part of a church choir and youth group. His former pastor said that he still keeps his faith. Boseman has stated that he prayed to be the Black Panther before he was cast as the character in the Marvel Cinematic Universe.", "Filmography": "=== Film ===\n\n\n=== Television ===", "References": "", "External links": "Chadwick Boseman on Facebook\nChadwick Boseman on Instagram\nChadwick Boseman on IMDb \nBorrelli, Christopher (April 11, 2013). \"Robinson actor swings for the fences\". Chicago Tribune."}