{"_id": "68", "name": "Kevin Hart", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:53", "biography": "Kevin Darnell Hart (born July 6, 1979) is an American stand-up comedian, actor, and producer. Born and raised in Philadelphia, Pennsylvania, Hart began his career by winning several amateur comedy competitions at clubs throughout New England, culminating in his first real break in 2001 when he was cast by Judd Apatow for a recurring role on the TV series Undeclared. The series lasted only one season, but he soon landed other roles in films such as Paper Soldiers (2002), Scary Movie 3 (2003), Soul Plane (2004), In the Mix (2005), and Little Fockers (2010).\nHart's comedic reputation continued to grow with the release of his first stand-up album, I'm a Grown Little Man (2008), and performances in the films Think Like a Man (2012), Grudge Match (2013), Ride Along (2014) and its sequel Ride Along 2 (2016), About Last Night (2014), Get Hard (2015), Central Intelligence (2016), The Secret Life of Pets (2016), Captain Underpants: The First Epic Movie (2017), Jumanji: Welcome to the Jungle (2017), and Night School (2018). \nHe also released four more comedy albums, Seriously Funny in 2010, Laugh at My Pain in 2011, Let Me Explain in 2013, and What Now? in 2016. In 2015, Time Magazine named Hart one of the 100 most influential people in the world on the annual Time 100 list. He starred as himself in the lead role of Real Husbands of Hollywood.", "Early life": "Hart was born on July 6, 1979, in Philadelphia, Pennsylvania. He was raised in a single-parent household by his mother, Nancy Hart, who was a systems analyst for the Office of Student Registration and Financial Services at University of Pennsylvania. He has one older brother, Robert. His father, Henry Witherspoon, a cocaine addict, was in and out of jail throughout most of Kevin's childhood, and Kevin used humor as a way to cope with his troubled family life.After graduating from George Washington High School, Hart briefly attended the Community College of Philadelphia and moved to New York City. He then moved to Brockton, Massachusetts, and found work as a shoe salesman. He began pursuing a career in stand-up comedy after performing at an amateur night at a club in Philadelphia.", "Career": "=== Stand-up ===\nHart's first gig was at The Laff House in Philadelphia under the name of Lil Kev, which did not go well. His career suffered a slow start, as he was booed off stage several times, once even having a piece of chicken thrown at him. After those initial unsuccessful shows, Hart began entering comedy competitions throughout Massachusetts and audience receptions of his performances eventually improved.It took time for Hart to develop a unique comedic style. After an early period of attempting to imitate comedians like Chris Tucker, he found his own rhythm by delving into his insecurities and life experiences. \"Because of what I do, it has to be an open book,\" he has said. \"But right now this is a book that is being written.\"Hart's comedy tours began in 2009 with his act titled I'm a Grown Little Man, followed by Seriously Funny in 2010, Laugh at My Pain in 2011, and Let Me Explain in 2013, the later two of which were also released as features in movie theaters. Hart grossed over $15 million from \"Laugh at My Pain\", making it one of the year's top-selling comedy tours. Hart also has a game available through iTunes called \"Little Jumpman\". His Facebook page, Twitter account, and YouTube channel are all connected to and accessible through this app. Most overseas fans of Hart discovered him on YouTube, as well.On April 9, 2015, Hart embarked on a comedy world tour titled the What Now? Tour at the AT&T Center in San Antonio, which concluded on August 7, 2016, at the Columbus Civic Center in Columbus, Georgia. On July 16, 2015, Universal Pictures announced that Kevin Hart: What Now?, a stand-up comedy film featuring a performance of Kevin Hart's What Now? Tour, would be theatrically released in the United States on October 14, 2016. The show was filmed live on August 30, 2015, in front of 53,000 people, at Philadelphia's Lincoln Financial Field.\n\n\n=== Film and television roles ===\nHart came to prominence from his guest appearance in Undeclared. He made his film debut in the film Paper Soldiers. Hart then gained further recognition from his other films such as the Scary Movie franchise, Soul Plane, The 40-Year-Old Virgin, Death at a Funeral, and Little Fockers. He turned down a role in the 2008 film Tropic Thunder because the character is gay, citing his own \"insecurities\".\n\nHe played Doug in the film The Five-Year Engagement (2012) and appeared in Think Like a Man which was a box office success. He also appeared in the sequel. He had a cameo as himself in This Is the End. In 2013, Hart played a boxing promoter in Grudge Match and appeared in Exit Strategy as Mannequin Head Man. He also appeared in 35 and Ticking.\nIn 2014, Hart starred as Ben in Ride Along, opposite Ice Cube. The film received generally negative reviews from critics, but was a major box office success. Hart returned in the sequel, Ride Along 2, which was released on January 15, 2016.In 2013, Hart co-created Real Husbands of Hollywood with Chris Spencer. The show follows Hart along with other married celebrities (each playing a comical fictionalized version of themselves) within the series including: Boris Kodjoe, Nelly, Duane Martin, J.B. Smoove, Nick Cannon, and Robin Thicke. Thicke didn't return for the second season due to his music career, though Hart has stated that the door is open for Thicke to return. The series is intentionally filmed in a style similar to Bravo's The Real Housewives. Episodes often hinge on the \"real\" Kevin Hart's desperately unsuccessful attempts to climb Hollywood's celebrity social ladder (which always backfire in humiliating ways), and the character's barely-hidden jealousy of his more successful celebrity friends. A sneak peek was shown as a segment during the 2012 BET Awards and the official promo was released in October 2012.In 2015, Hart starred in the films Get Hard with Will Ferrell and The Wedding Ringer. In 2016, he starred in the movies Central Intelligence, with Dwayne Johnson, and the animated The Secret Life of Pets. In 2017, he starred in the movies Captain Underpants: The First Epic Movie, in a voice role, and Jumanji: Welcome to the Jungle with Jack Black, Karen Gillan, and retaming again with Johnson.In 2018, he produced his first film under his production company HartBeat Productions, Night School. In October 2018, it was announced that through his production company, he has signed a first-look deal with Nickelodeon. Under the deal, Hart and his HartBeat Productions banner will develop and produce live-action, scripted kids content for the network. Hart also has a first-look film deal with Universal Studios.In 2019, Hart's film The Upside, his first headlining role in a drama, was theatrically released. It also starred Bryan Cranston and Nicole Kidman. Hart also reprised his role of Snowball in the sequel The Secret Life of Pets 2.\n\n\n==== Upcoming projects ====\nHart will star in the sequel Jumanji: The Next Level, scheduled for December 2019. He will next shoot Fatherhood, a drama about a man whose wife dies shortly after childbirth, leaving him to raise their daughter on his own. It will be released on April 3, 2020.As of October 2016, Hart was set to portray Santa Claus in Dashing Through the Snow, a planned 2017 Disney Christmas-themed film. In October 2018, it was reported that Chris Rock will direct Hart in a movie based on an original idea by the both of them. The film will be written by Black-ish writer Yamara Taylor and the film will revolve around a stay at home dad who raises the kids while his star CEO wife serves as the breadwinner. The man finds himself in emotional and public turmoil when his wife kicks him to the curb, and they engage in a bitter divorce and custody battle. In 2019, Hart signed on to star in and produce Monopoly, Black Friday, an untitled international romantic comedy, Extreme Job, and Scrooged.\n\n\n=== Hosting ===\nIn addition to acting, Hart has also hosted various ceremonies. Hart first hosted the 2011 BET Awards. Hart then hosted the 2012 MTV Video Music Awards. His longtime friend Judd Apatow, the director who gave him his first big on-screen break in the TV series Undeclared, was the one who recommended him for the gig. Hart hoped that this will project him further into a side career as an emcee, stating, \"Hopefully after MTV, of course we're talking Emmys, Oscars, whatever.\" He has hosted three episodes of Saturday Night Live. In 2015, Hart hosted the Comedy Central Roast of Justin Bieber. In 2016, Hart co-hosted the 2016 MTV Movie Awards with Dwayne Johnson.Kevin Hart has also hosted on HQ Trivia and gave away $100,000 to 1 person with Scott Rogowsky on September 26, 2018 which had 699K players.\nOn December 4, 2018, Hart was announced as the host of the 91st Academy Awards, but on December 6 he stepped down as host in response to public criticism of several alleged homophobic tweets from 2010 and 2011. Hart characterized the protest as non-constructive and stated \"If you don’t believe people change, grow as they get older, I don’t know what to tell you\". On December 7, he tweeted an apology to the LGBTQ community following criticism that he did not issue one the previous day. On January 3, 2019, Hart announced he was going to reconsider stepping down as host, after openly lesbian comedian Ellen DeGeneres, who has hosted the Academy Awards multiple times, expressed support for Hart to do so and said she telephoned the Academy to ask if Hart would be able to reverse his decision if he wished and, according to DeGeneres, the Academy said he would be able to do so. On January 8, after a backlash for what was perceived as his insincere apology, Kevin Hart announced that he wouldn't be hosting the Academy Awards.\n\n\n=== Music ===\nAs Chocolate Droppa, his alias, he signed to Motown Records and released Kevin Hart: What Now? (The Mixtape Presents Chocolate Droppa), the soundtrack to his stand-up film of the same name. He released the singles \"Push It On Me\" featuring Trey Songz and \"Baller Alert\" with Migos & T.I.\n\n\n=== Modeling ===\nIn 2017, Kevin Hart and Tommy John appeared in an underwear commercial for Macy's.", "Influences": "Hart has cited as comedy inspirations Bill Cosby, Chris Rock, Eddie Murphy, George Carlin, Jerry Seinfeld, Dave Chappelle, Richard Pryor, Patrice O'Neal, and Keith Robinson.", "Personal life": "=== Family relationships ===\nHart's relationship with his father improved after the latter recovered from his addiction. Hart said, \"My dad said I was supposed to be on drugs. I was like, 'Dad, shut up', but then I thought about it, and it was stupid, but it made sense. He was saying that basically he was my example to never go down that road.\"Hart also talks about his mother in his stand-up routine, portraying her as a loving, yet intimidating woman. She died from cancer in 2007.\n\n\n=== Divorce ===\nKevin and Torrei Hart filed for divorce in February 2010, citing irreconcilable differences. Hart requested joint custody of their two children, a daughter and a son. The divorce was finalized in November 2011.\n\n\n=== Marriage ===\nOn August 18, 2014, Hart proposed to Eniko Parrish. They married on August 13, 2016, near Santa Barbara, California. Their son was born in 2017.\nOn December 15, 2017, Hart publicly admitted to having cheated on his wife while she was pregnant with their son.\n\n\n=== Earnings ===\nHart earned an estimated $32.5 million in 2017.\n\n\n=== Legal issues ===\nHart was arrested on April 14, 2013, on suspicion of drunk driving after his black Mercedes nearly collided with a tanker truck on a Southern California freeway. Hart failed a field sobriety test and was booked for misdemeanor DUI. On August 5, 2013, Hart was sentenced to three years of probation after pleading no contest to one count of driving under the influence of alcohol.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Music videos ===", "Bibliography": "Hart, Kevin (2017). I Can't Make This Up: Life Lessons. 37 INK. ISBN 978-1501155567.", "Awards and nominations": "", "References": "", "External links": "Kevin Hart at Box Office Mojo\nOfficial website\nKevin Hart on IMDb \nKevin Hart at Rotten Tomatoes\nKevin Hart on Twitter"}