{"_id": "10", "name": "Harrison Ford", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:28", "biography": "Harrison Ford (born July 13, 1942) is an American actor. He gained worldwide fame for his starring roles as Han Solo in the Star Wars film series and as the title character of the Indiana Jones movie series. Ford is also known for playing Rick Deckard in the neo-noir dystopian science fiction film Blade Runner (1982) and its sequel Blade Runner 2049 (2017); John Book in the thriller Witness (1985), for which he was nominated for the Academy Award for Best Actor; and Jack Ryan in the action films Patriot Games (1992) and Clear and Present Danger (1994).\nHis career spans six decades and includes roles in several Hollywood blockbusters, including the epic war film Apocalypse Now (1979), the legal drama Presumed Innocent (1990), the action film The Fugitive (1993), the political action thriller Air Force One (1997), and the psychological thriller What Lies Beneath (2000). Seven of his films have been inducted into the National Film Registry: American Graffiti (1973), The Conversation (1974), Star Wars (1977), Apocalypse Now (1979), The Empire Strikes Back (1980), Raiders of the Lost Ark (1981) and Blade Runner (1982).\nAs of 2019, the U.S. domestic box-office grosses of Ford's films total over US $5.1 billion, with worldwide grosses surpassing $9.3 billion, making Ford the fourth highest-grossing U.S. domestic box-office star.", "Early life": "Ford was born at the Swedish Covenant Hospital in Chicago, Illinois to Christopher Ford (born John William Ford), an advertising executive and former actor, and Dorothy (née Nidelman), a former radio actress. A younger brother, Terence, was born in 1945. His father was Catholic and his mother was Jewish. Ford's paternal grandparents, John Fitzgerald Ford and Florence Veronica Niehaus, were of Irish and German descent, respectively. Ford's maternal grandparents, Harry Nidelman and Anna Lifschutz, were Jewish emigrants from Minsk, Belarus (at that time a part of the Russian Empire). When asked in which religion he and his brother were raised, Ford jokingly responded, \"Democrat,\" \"to be liberals of every stripe\". In a television interview shown in August 2000, when asked about what influence his Irish Catholic and Russian Jewish ancestry may have had on his life as a person and as an artist, Ford humorously stated, \"As a man I've always felt Irish, as an actor I've always felt Jewish.\"Ford was active in the Boy Scouts of America, and achieved its second-highest rank, Life Scout. He worked at Napowan Adventure Base Scout camp as a counselor for the Reptile Study merit badge. Because of this, he and director Steven Spielberg later decided to depict the young Indiana Jones as a Life Scout in the 1989 film Indiana Jones and the Last Crusade.\nIn 1960, Ford graduated from Maine East High School in Park Ridge, Illinois. His was the first student voice broadcast on his high school's new radio station, WMTH, and he was its first sportscaster during his senior year (1959–60). He attended Ripon College in Wisconsin, where he was a philosophy major and a member of the Sigma Nu fraternity. He took a drama class in the final quarter of his senior year to get over his shyness. Ford, a self-described \"late bloomer\", became fascinated with acting.", "Early career": "In 1964, after a season of summer stock with the Belfry Players in Wisconsin, Ford traveled to Los Angeles to apply for a job in radio voice-overs. He did not get it, but stayed in California and eventually signed a $150-per-week contract with Columbia Pictures' new talent program, playing bit roles in films. His first known role was an uncredited one as a bellhop in Dead Heat on a Merry-Go-Round (1966). There is little record of his non-speaking (or \"extra\") roles in film. Ford was at the bottom of the hiring list, having offended producer Jerry Tokovsky after he played a bellboy in the feature. He was told by Tokovsky that when actor Tony Curtis delivered a bag of groceries, he did it like a movie star; Ford felt his job was to act like a bellboy.His speaking roles continued next with Luv (1967), though he was still uncredited. He was finally credited as \"Harrison J. Ford\" in the 1967 Western film A Time for Killing, starring Glenn Ford, George Hamilton and Inger Stevens, but the \"J\" did not stand for anything, since he has no middle name. It was added to avoid confusion with a silent film actor named Harrison Ford, who appeared in more than 80 films between 1915 and 1932 and died in 1957. Ford later said that he was unaware of the existence of the earlier actor until he came upon a star with his own name on the Hollywood Walk of Fame. Ford soon dropped the \"J\" and worked for Universal Studios, playing minor roles in many television series throughout the late 1960s and early 1970s, including Gunsmoke, Ironside, The Virginian, The F.B.I., Love, American Style and Kung Fu. He appeared in the western Journey to Shiloh (1968) and had an uncredited, non-speaking role in Michelangelo Antonioni's 1970 film Zabriskie Point as an arrested student protester. French filmmaker Jacques Demy chose Ford for the lead role of his first American film, Model Shop (1969), but the head of Columbia Pictures thought Ford had \"no future\" in the film business and told Demy to hire a more experienced actor. The part eventually went to Gary Lockwood. Ford later commented that the experience had been nevertheless a positive one because Demy was the first to show such faith in him.Not happy with the roles being offered to him, Ford became a self-taught professional carpenter to support his then-wife and two young sons. Casting director and fledgling producer Fred Roos championed the young Ford and secured him an audition with George Lucas for the role of Bob Falfa, which Ford went on to play in American Graffiti (1973). Ford's relationship with Lucas would profoundly affect his career later on. After director Francis Ford Coppola's film The Godfather was a success, he hired Ford to expand his office and gave him small roles in his next two films, The Conversation (1974) and Apocalypse Now (1979); in the latter film, Ford played an army officer named \"G. Lucas\".", "Milestone franchises": "=== Star Wars ===\nFord's previous work in American Graffiti eventually landed him his first starring film role when he was hired by Lucas to read lines for actors auditioning for roles in Lucas' upcoming film Star Wars (1977). Lucas was eventually won over by Ford's performance during these line reads and cast him as Han Solo. Star Wars became one of the most successful movies of all time and established Ford as an international superstar. He returned to star in the similarly successful Star Wars sequels, The Empire Strikes Back (1980) and Return of the Jedi (1983), as well as the Star Wars Holiday Special (1978). Ford wanted Lucas to kill off Han Solo at the end of Return of the Jedi, saying, \"That would have given the whole film a bottom,\" but Lucas refused.Ford later reprised the role of Han Solo in the sequel Star Wars: The Force Awakens (2015). During filming on June 11, 2014, Ford suffered what was said to be a fractured ankle when a hydraulic door fell on him. He was airlifted to John Radcliffe Hospital in Oxford, England for treatment. Ford's son Ben released details on his father's injury, saying that his ankle would likely need a plate and screws, and that filming could be altered slightly with the crew needing to shoot Ford from the waist up for a short time until he recovered. Ford made his return to filming in mid-August, after a two-month layoff as he recovered from his injury.Ford's character was killed off in The Force Awakens, but it was subsequently announced, via a casting call, that Ford would return in some capacity as Solo in Episode VIII. In February 2016, when the cast for Episode VIII was confirmed, it was indicated that Ford would not reprise his role in the film after all. When Ford was asked if his character could come back in \"some form\", he replied, \"Anything is possible in space.\" Solo: A Star Wars Story, a spin-off movie focusing on the life of a young Han Solo, was released in May 2018, but Ford was not involved in the production beyond meeting with actor Alden Ehrenreich. \n\n\n=== Indiana Jones ===\n\nFord's status as a leading actor was solidified when he starred as globe-trotting archaeologist Indiana Jones in the film Raiders of the Lost Ark (1981), a collaboration between George Lucas and Steven Spielberg. Though Spielberg was interested in casting Ford from the beginning, Lucas was not, due to having already worked with the actor in American Graffiti and Star Wars. Lucas eventually relented after Tom Selleck was unable to accept.Ford went on to star in the prequel Indiana Jones and the Temple of Doom (1984) and the sequel Indiana Jones and the Last Crusade (1989). During the June 1983 filming of Indiana Jones and the Temple of Doom in London, Ford herniated a disc in his back. The 40-year-old actor was forced to fly back to Los Angeles for an operation and returned six weeks later.Ford reprised the role yet again for a 1993 episode of the television series The Young Indiana Jones Chronicles, and later for the fourth film of the franchise, Indiana Jones and the Kingdom of the Crystal Skull (2008). On March 15, 2016, Walt Disney Studios announced that Ford was scheduled to portray Indiana Jones in a fifth film due for release in July 2019. However, on April 25, 2017, Disney announced that the film would be released on July 10, 2020.", "Other film work": "Ford has appeared in many other films, including Heroes (1977), Force 10 from Navarone (1978) and Hanover Street (1979). Ford also co-starred alongside Gene Wilder in the buddy-Western The Frisco Kid (1979), playing a bank robber with a heart of gold. He then starred as Rick Deckard in Ridley Scott's cult sci-fi classic Blade Runner (1982), and in a number of dramatic-action films: Peter Weir's Witness (1985) and The Mosquito Coast (1986), and Roman Polanski's Frantic (1988).The 1990s brought Ford the role of Jack Ryan in Tom Clancy's Patriot Games (1992) and Clear and Present Danger (1994), as well as leading roles in Alan Pakula's Presumed Innocent (1990) and The Devil's Own (1997); Andrew Davis' The Fugitive (1993); Sydney Pollack's remake of Sabrina (1995); and Wolfgang Petersen's Air Force One (1997). Ford also played straight dramatic roles, including an adulterous husband in both Presumed Innocent (1990) and What Lies Beneath (2000), and a recovering amnesiac in Mike Nichols' Regarding Henry (1991).Many of Ford's major film roles came to him by default through unusual circumstances: he won the role of Han Solo while reading lines for other actors, was cast as Indiana Jones because Tom Selleck was not available, and allegedly took over the role of Jack Ryan due to Alec Baldwin's fee demands. Baldwin had previously played the role of Ryan in the 1990 film The Hunt for Red October.\n\n\n=== 1990s–2010s ===\n\nStarting in the late 1990s, Ford appeared in several critically derided and/or commercially disappointing movies, including Six Days, Seven Nights (1998), Random Hearts (1999), K-19: The Widowmaker (2002), Hollywood Homicide (2003), Firewall (2006) and Extraordinary Measures (2010). One exception was 2000's What Lies Beneath, which grossed over $155 million in the United States and $291 million worldwide. In the 2001 Guinness Book of World Records, Ford was listed as the richest male actor in the world.In 2004, Ford declined a chance to star in the thriller Syriana, later commenting that \"I didn't feel strongly enough about the truth of the material and I think I made a mistake.\" The role eventually went to George Clooney, who won an Oscar and a Golden Globe for his work. Prior to that, Ford had passed on a role in another Stephen Gaghan-written film, that of Robert Wakefield in Traffic, which eventually went to Michael Douglas.\nIn 2008, Ford enjoyed success with the release of Indiana Jones and the Kingdom of the Crystal Skull, another Lucas/Spielberg collaboration. The film received generally positive reviews and was the second highest-grossing film worldwide in 2008. Ford later said he would like to star in another sequel, \"...if it didn't take another 20 years to digest.\"Other 2008 work included Crossing Over, directed by Wayne Kramer. In the film, Ford plays an ICE/Homeland Security Investigations Special Agent, working alongside Ashley Judd and Ray Liotta. He also narrated a feature documentary film about the Dalai Lama entitled Dalai Lama Renaissance. Ford filmed the medical drama Extraordinary Measures in 2009 in Portland, Oregon. Released January 22, 2010, the film also starred Brendan Fraser and Alan Ruck. Also in 2010, he co-starred in the film Morning Glory, along with Patrick Wilson, Rachel McAdams and Diane Keaton.\n \nIn July 2011, Ford starred alongside Daniel Craig and Olivia Wilde in the science fiction Western film Cowboys & Aliens. To promote the film, Ford appeared at the San Diego Comic-Con International and, apparently surprised by the warm welcome, told the audience, \"I just wanted to make a living as an actor. I didn't know about this.\" Also in 2011, Ford starred in Japanese commercials advertising the video game Uncharted 3: Drake's Deception for the PlayStation 3.2013 began a trend that saw Ford accepting more diverse supporting roles. That year, Ford co-starred in the corporate espionage thriller Paranoia, with Liam Hemsworth and Gary Oldman, and directed by Robert Luketic, as well as Ender's Game, 42 and Anchorman 2: The Legend Continues. His performance as Branch Rickey in 42 was praised by many critics and garnered Ford a nomination as best supporting actor for the Satellite Awards. In 2014, he appeared in The Expendables 3 and the documentary Flying the Feathered Edge: The Bob Hoover Project. The next year, Ford co-starred in The Age of Adaline with Blake Lively to good notices.On February 26, 2015, Alcon Entertainment announced Ford would reprise his role as Rick Deckard in Blade Runner 2049. The film was well received by critics, Scott Collura of IGN called it a \"deep, rich, smart film that's visually awesome and full of great sci-fi concepts\" and Ford's role \"a quiet, sort of gut-wrenching interpretation to Deckard and what he must've gone through in the past three decades.\" The Economist has described Ford's appearance in the film as \"little more than a cameo\", despite his being used heavily in the film's promotion. The film grossed $259.3 million worldwide, far short of the estimated $400 million that the film needed in order to break even. In 2019, Ford had his first voice role in an animated film, as a dog named Rooster in The Secret Life of Pets 2. That same year, with filming for a fifth Indiana Jones film having been delayed by a year, he also agreed to headline a big-budget adaptation of Jack London's The Call of the Wild, playing prospector John Thornton.", "Personal life": "=== Marriages and family ===\n\nFord has been married three times and has five children. His first wife was Mary Marquardt or Mary Ford Becker, from 1964 until their divorce in 1979. They had two sons, chef-restaurateur Benjamin Ford (born 1966) and clothier Willard Ford (born 1969). Benjamin Ford co-owns Ford's Filling Station, a gastropub with two locations: at The Marriott, L.A. Live, Downtown Los Angeles, and at LAX Terminal 5. Willard is the owner of Strong Sports Gym, and was co-owner of the Kim Sing Theater and owner of the Ludwig Clothing company.Ford's second wife was screenwriter Melissa Mathison; they married in March 1983 and separated in late 2000, subsequently divorcing. They had two children, actor/musician Malcolm Ford (born 1987) and actress Georgia Ford (born 1990). Ford began dating actress Calista Flockhart after meeting at the 2002 Golden Globe Awards, and together they are parents to her adopted son, Liam (born 2001). Ford proposed to Flockhart over Valentine's Day weekend in 2009. They married on June 15, 2010, in Santa Fe, New Mexico, where Ford was filming Cowboys & Aliens.In her 2016 autobiography The Princess Diarist, Carrie Fisher claimed that she and Ford had a three-month affair in 1976 during the filming of Star Wars.Ford is known as one of Hollywood's most private actors, guarding much of his personal life.\n\n\n=== Aviation ===\n\nFord is a licensed pilot of both fixed-wing aircraft and helicopters, and owns an 800-acre (320-hectare) ranch in Jackson, Wyoming, approximately half of which he has donated as a nature reserve. On several occasions, Ford has personally provided emergency helicopter services at the request of local authorities, in one instance rescuing a hiker overcome by dehydration.Ford began flight training in the 1960s at Wild Rose Idlewild Airport in Wild Rose, Wisconsin, flying in a Piper PA-22 Tri-Pacer, but at $15 an hour (equivalent to $124 in 2018), he could not afford to continue the training. In the mid-1990s, he bought a used Gulfstream II and asked one of his pilots, Terry Bender, to give him flying lessons. They started flying a Cessna 182 out of Jackson, Wyoming, later switching to Teterboro, New Jersey, flying a Cessna 206, the aircraft in which he made his first solo flight.\nFord keeps his aircraft at Santa Monica Airport, though the Bell 407 is often kept and flown in Jackson, and has been used by the actor in two mountain rescues during his assigned duty time with Teton County Search and Rescue. On one of the rescues, Ford recovered a hiker who had become lost and disoriented. She boarded Ford's helicopter and promptly vomited into one of the rescuers' caps, unaware of who the pilot was until much later; \"I can't believe I barfed in Harrison Ford's helicopter!\" she said later.Ford flies his de Havilland Canada DHC-2 Beaver (N28S) more than any of his other aircraft, and has repeatedly said that he likes this aircraft and the sound of its Pratt & Whitney R-985 radial engine. According to Ford, it had been flown in the CIA's Air America operations, and was riddled with bullet holes that had to be patched up.In March 2004, Ford officially became chairman of the Young Eagles program of the Experimental Aircraft Association (EAA). Ford was asked to take the position by Greg Anderson, Senior Vice President of the EAA at the time, to replace General Chuck Yeager, who was vacating the post that he had held for many years. Ford at first was hesitant, but later accepted the offer and has made appearances with the Young Eagles at the EAA AirVenture Oshkosh gathering at Oshkosh, Wisconsin, for two years. In July 2005, at the gathering in Oshkosh, Ford agreed to accept the position for another two years. He has flown over 280 children as part of the Young Eagles program, usually in his DHC-2 Beaver, which can seat the actor and five children. Ford stepped down as program chairman in 2009 and was replaced by Captain Chesley Sullenberger and First Officer Jeff Skiles. He is involved with the EAA chapter in Driggs, Idaho, just over the Teton Range from Jackson, Wyoming. On July 28, 2016, Ford flew the two millionth Young Eagle at the EAA AirVenture convention.As of 2009, Ford appears in Internet advertisements for General Aviation Serves America, a campaign by the advocacy group Aircraft Owners and Pilots Association (AOPA). He has also appeared in several independent aviation documentaries, including Wings Over the Rockies (2009), Flying The Feathered Edge: The Bob Hoover Project (2014) and Living in the Age of Airplanes (2015).Ford is an honorary board member of the humanitarian aviation organization Wings of Hope, and is known for having made several trips to Washington, D.C. to fight for pilots' rights. He has also donated substantial funds to aerobatic champion Sean Tucker's charitable program The Bob Hoover Academy (named in honor of legendary pilot Bob Hoover), which educates at-risk teens in central California and teaches them how to fly.\n\n\n==== Incidents ====\nOn October 23, 1999, Harrison Ford was involved in the crash of a Bell 206L4 LongRanger helicopter (N36R). The NTSB accident report states that Ford was piloting the aircraft over the Lake Piru riverbed near Santa Clarita, California, on a routine training flight. While making his second attempt at an autorotation with powered recovery, Ford allowed the helicopter's altitude to drop to 150–200 feet before beginning power-up. The aircraft was unable to recover power before hitting the ground. The aircraft landed hard and began skidding forward in the loose gravel before one of its skids struck a partially embedded log, flipping the aircraft onto its side. Neither Ford nor the instructor pilot suffered any injuries, though the helicopter was seriously damaged. When asked about the incident by fellow pilot James Lipton in an interview on the TV show Inside the Actor's Studio, Ford replied, \"I broke it.\"On March 5, 2015, Ford's plane, believed to be a Ryan PT-22 Recruit, made an emergency landing on the Penmar Golf Course in Venice, California. Ford had radioed in to report that the plane had experienced engine failure. He was taken to Ronald Reagan UCLA Medical Center, where he was reported to be in fair to moderate condition. Ford suffered a broken pelvis and broken ankle during the accident, as well as other injuries.On February 13, 2017, Ford landed an Aviat Husky at John Wayne Airport in Orange County, California on the taxiway left of runway 20L. A Boeing 737 was holding short of the runway on the taxiway when Ford overflew them.", "Activism": "In 2009, Ford signed a petition in support of Polish film director Roman Polanski, calling for his release after he was arrested in Switzerland in relation to his 1977 charge for drugging and raping a 13-year-old girl.\n\n\n=== Environmental causes ===\nFord is vice-chair of Conservation International an American nonprofit environmental organization headquartered in Arlington, Virginia. The organization's intent is to protect nature.In September 2013, Ford, while filming an environmental documentary in Indonesia, interviewed the Indonesian Forestry Minister, Zulkifli Hasan. After the interview, Ford and his crew were accused of \"harassing state institutions\" and publicly threatened with deportation. Questions within the interview concerned the Tesso Nilo National Park, Sumatra. It was alleged the Minister of Forestry was given no prior warning of questions nor the chance to explain the challenges of catching people with illegal logging. Ford was provided an audience with the Indonesian President, Susilo Bambang Yudhoyono, during which he expressed concerns regarding Indonesia's environmental degradation and the government efforts to address climate change. In response, the President explained Indonesia's commitment to preserving its oceans and forests.In 1993, the arachnologist Norman Platnick named a new species of spider Calponia harrisonfordi, and in 2002, the entomologist Edward O. Wilson named a new ant species Pheidole harrisonfordi (in recognition of Harrison's work as Vice Chairman of Conservation International).Since 1992, Ford has lent his voice to a series of public service messages promoting environmental involvement for EarthShare, an American federation of environmental and conservation charities. He has acted as a spokesperson for Restore Hetch Hetchy, a non-profit organization dedicated to restoring Yosemite National Park's Hetch Hetchy Valley to its original condition. Ford also appears in the documentary series Years of Living Dangerously, which reports on people affected by and seeking solutions to climate change.\n\n\n=== Political views ===\nLike his parents, Ford is a lifelong Democrat.On September 7, 1995, Ford testified before the U.S. Senate Foreign Relations Committee in support of the Dalai Lama and an independent Tibet. In 2007, he narrated the documentary Dalai Lama Renaissance.In 2003, he publicly condemned the Iraq War and called for \"regime change\" in the United States. He also criticized Hollywood for making movies which were \"more akin to video games than stories about human life and relationships\", and he called for more gun control in the United States.After Republican presidential candidate Donald Trump said his favorite role of Ford's was Air Force One because he \"stood up for America\", Ford reasoned that it was just a film and made critical statements against Trump's presidential bid.\n\n\n=== Archaeology ===\nFollowing on his success portraying the archaeologist Indiana Jones, Ford also plays a part in supporting the work of professional archaeologists. He serves as a General Trustee on the Governing Board of the Archaeological Institute of America (AIA), North America's oldest and largest organization devoted to the world of archaeology. Ford assists them in their mission of increasing public awareness of archaeology and preventing looting and the illegal antiquities trade.\n\n\n=== Star Wars: Force for Change ===\nFord participated in a Star Wars promotion geared toward fans who donated to Star Wars: Force for Change on video call which offered them the opportunity to purchase tickets to the premiere of The Force Awakens.", "Selected filmography": "", "Accolades": "In 1994, the National Association of Theatre Owners named Ford \"Star of the Year\". In the October 1997 issue of Empire Magazine, Ford was ranked no. 1 in \"The Top 100 Movie Stars of All Time\". In 1998, People Magazine named Ford the \"Sexiest Man Alive\". For three consecutive years (1998, 1999 and 2000), the Harris Poll named Ford \"America's Favorite Movie Star\".\n\nFord received the AFI Life Achievement Award in 2000. He received an Academy Award for Best Actor nomination for his performance in Witness, for which he also received \"Best Actor\" BAFTA and Golden Globe nominations. He was given the Cecil B. DeMille Award at the 2002 Golden Globe Awards, and on June 2, 2003, was presented with a star on the Hollywood Walk of Fame. Three additional Best Actor Golden Globe nominations have gone to Ford, for The Mosquito Coast, The Fugitive and Sabrina.\nIn 2006, he was awarded the Jules Verne Award, given to an actor who has \"encouraged the spirit of adventure and imagination\" throughout their career. He was presented with the first-ever Hero Award at the 2007 Scream Awards for his many iconic roles, including Indiana Jones and Han Solo (both roles earned him two Saturn Awards for Best Actor in 1981 and 2015, respectively), and in 2008 he received the Spike TV's Guy's Choice Award for \"Brass Balls\".Ford has also been honored multiple times for his involvement in general aviation, receiving the Living Legends of Aviation Award and the Experimental Aircraft Association's Freedom of Flight Award in 2009, the Wright Brothers Memorial Trophy in 2010 and the Al Ueltschi Humanitarian Award in 2013. In 2013, Flying Magazine ranked him number 48 on their list of the 51 Heroes of Aviation.", "References": "", "External links": "Harrison Ford at the Encyclopædia Britannica\nHarrison Ford on IMDb \nHarrison Ford at Box Office Mojo\n\n\n=== Interviews ===\n\"Harrison Ford Interview\". CinemasOnline. 2002. Archived from the original on December 11, 2003. Retrieved March 19, 2006.\nDawson, Angela (June 12, 2003). \"Harrison Ford: Hollywood loved him even before they knew him\". The Cincinnati Post (Entertainment News Wire). E. W. Scripps Company. Archived from the original on February 27, 2005. Retrieved March 19, 2006.\nHoneycutt, Kirk (1986). \"Harrison Ford on Harrison Ford\". Daily News. Retrieved March 19, 2006.\nLeopold, Todd (February 9, 2006). \"Harrison Ford and the movie machine\". Cable News Network. Retrieved March 19, 2006.\nRader, Dotson (July 7, 2002). \"I found purpose\". Parade. Archived from the original on August 12, 2002. Retrieved March 19, 2006.\nTuran, Kenneth (1986). \"Harrison Ford wants to be alone\". GQ. Archived from the original on February 15, 2001. Retrieved March 19, 2006."}