{"_id": "25", "name": "Steve Carell", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:34", "biography": "Steven John Carell (; born August 16, 1962) is an American actor, comedian, producer, writer, and director. He is well known for his portrayal of boss Michael Scott on the NBC sitcom The Office (2005–2013), on which he also worked as an occasional producer, writer and director.\nCarell was a correspondent on The Daily Show with Jon Stewart from 1999 to 2005. He has starred in Anchorman: The Legend of Ron Burgundy (2004) and its 2013 sequel, The 40-Year-Old Virgin (2005), Evan Almighty (2007), Get Smart (2008), Crazy, Stupid, Love (2011), The Incredible Burt Wonderstone and The Way, Way Back (both 2013). He has also voice acted in Over the Hedge (2006), Horton Hears a Who! (2008) and the Despicable Me franchise (2010–present). In 2016, Carell co-created the TBS comedy series Angie Tribeca with his wife, Nancy Carell. \nCarell was nominated as \"America's funniest man\" in Life magazine, and received the Golden Globe Award for Best Actor – Television Series Musical or Comedy for his work on the first season of The Office. In the 2010s, Carell received attention for more dramatic roles. His role as wrestling coach and convicted murderer John Eleuthère du Pont in the drama film Foxcatcher (2014) earned him, among various honors, nominations for the Academy Award for Best Actor, the Golden Globe Award for Best Actor – Motion Picture Drama and the BAFTA Award for Best Actor in a Supporting Role. He also received acclaim for his roles in Little Miss Sunshine (2006), The Big Short (2015), and Battle of the Sexes (2017), the latter two earning him his eighth and ninth Golden Globe Award nominations, respectively. In 2018, he re-teamed with Anchorman and The Big Short director Adam McKay for the Dick Cheney biopic Vice, in which he portrayed Donald Rumsfeld, and played journalist David Sheff in the drama Beautiful Boy. ", "Early life": "The youngest of four brothers, Carell was born at Emerson Hospital in Concord, Massachusetts, and raised in nearby Acton, Massachusetts. His father, Edwin A. Carell (b. 1925), was an electrical engineer, and his mother, Harriet Theresa (née Koch; 1925-2016), was a psychiatric nurse. His maternal uncle, Stanley Koch, worked with scientist Allen B. DuMont to create cathode ray tubes. His father is of Italian and German descent and his mother was of Polish ancestry.Carell was raised Roman Catholic, and was educated at Nashoba Brooks School, The Fenn School, and Middlesex School. He played ice hockey and lacrosse while in high school. He played the fife, performing with other members of his family, and later joined a reenacting group portraying the 10th (North Lincoln) Regiment of Foot. He attributed his interest in history to this, earning a degree in the subject from Denison University in Granville, Ohio, in 1984.While at Denison, Carell was a member of Burpee's Seedy Theatrical Company, a student-run improvisational comedy troupe and was a goalie on the school's Big Red hockey team for four years. He also spent time as a disc jockey under the name \"Sapphire Steve Carell\" at WDUB, the campus radio station.", "Career": "=== Early work ===\nCarell states that he worked as a mail carrier in Littleton, Massachusetts. He later recounted that he quit after seven months because his boss told him he was not very good at being a mail carrier and needed to be faster. Early in his performing career, Carell acted on the stage in a touring children's theater company, later in the comedy musical Knat Scatt Private Eye and in a television commercial for the restaurant chain Brown's Chicken in 1989.In 1991, Carell performed with Chicago troupe The Second City where Stephen Colbert was his understudy for a time. Carell made his film debut in a minor role in Curly Sue. In spring 1996, he was a cast member of The Dana Carvey Show, a short-lived sketch comedy program on ABC. Along with fellow cast member Colbert, Carell provided the voice of Gary, half of The Ambiguously Gay Duo, the Robert Smigel-produced animated short which continued on Saturday Night Live later that year. While the program lasted only seven episodes, The Dana Carvey Show has since been credited with forging Carell's career. He starred in a few short-lived television series, including Come to Papa and Over the Top. He has made numerous guest appearances, including in \"Funny Girl\", an episode of Just Shoot Me! Additional screen credits include Brad Hall's short-lived situation comedy Watching Ellie (2002–2003) and Woody Allen's Melinda and Melinda. Carell was a correspondent for The Daily Show from 1999 to 2005, with a number of regular segments including \"Even Stevphen\" with Stephen Colbert and \n\"Produce Pete\".\n\n\n=== The Office ===\n\nIn 2005, Carell signed a deal with NBC to star in The Office, a remake of the British TV series of the same name. In the series, a mockumentary about life at a mid-sized paper supply company, Carell played the role of Michael Scott, the idiosyncratic regional manager of Dunder Mifflin, in Scranton, Pennsylvania. Although the first season of the adaptation suffered mediocre ratings, NBC renewed it for another season due to the anticipated success of Carell's film The 40-Year-Old Virgin, and the series subsequently became a ratings success. Carell won a Golden Globe Award and Television Critics Association Award during 2006 for his role in The Office. He received six Primetime Emmy Award nominations for his work in the series (2006–2011). Carell earned approximately US$175,000 per episode of the third season of The Office, twice his salary for the previous two seasons. In an Entertainment Weekly interview, he commented on his salary, saying, \"You don't want people to think you're a pampered jerk. Salaries can be ridiculous. On the other hand, a lot of people are making a lot of money off of these shows.\"Carell was allowed \"flex time\" during filming to work on theatrical films. Carell worked on Evan Almighty during a production hiatus during the second season of The Office. Production ended during the middle of the fourth season of The Office because of Carell's and others' refusal to cross the picket line of the 2007 Writers Guild of America strike. Carell, a WGA member, has written two episodes of The Office: \"Casino Night\" and \"Survivor Man\". Both episodes were praised, and Carell won a Writers Guild of America Award for \"Casino Night\". On April 29, 2010, Carell stated he would be leaving the show when his contract expired at the conclusion of the 2010–2011 season because he wanted to focus on his film career.\nHis last episode as a main character, \"Goodbye, Michael\", aired April 28, 2011, with his final shot showing Carell walking to a Colorado-bound plane to join his fiancée, Holly Flax, in Boulder, Colorado. Although he was invited back for the series finale in 2013, Carell originally declined believing that it would go against his character's arc. Ultimately Carell did reprise the role briefly in the series finale.\n\n\n=== Film career ===\n\n\n==== Comedic roles (2004–2013) ====\nCarell's first major film role was as weatherman Brick Tamland in the 2004 hit comedy Anchorman: The Legend of Ron Burgundy. Struck by Carell's performance in the film, Anchorman producer Judd Apatow approached Carell about creating a film together, and Carell told him about an idea he had involving a middle-aged man who is still a virgin. The result was the 2005 film The 40-Year-Old Virgin, which Carell and Apatow developed and wrote together, starring Carell as the title character. The film made $109 million in domestic box office sales and established him as a leading man. It also earned Carell an MTV Movie Award for Best Comedic Performance and a WGA Award nomination, along with Apatow, for Best Original Screenplay.Carell played Uncle Arthur, imitating the camp mannerisms of Paul Lynde's original character, in Bewitched, a TV adaptation co-starring Nicole Kidman and Will Ferrell. He also voiced Hammy the Squirrel in the 2006 computer-animated film, Over the Hedge and Ned McDodd, the mayor of Whoville, in the 2008 animated film Horton Hears a Who! He starred in Little Miss Sunshine during 2006, as Uncle Frank.His work in the films Anchorman, The 40-Year-Old Virgin, and Bewitched established Carell as a member of Hollywood's so-called \"Frat Pack\", a group of actors who often appear in films together, that also includes Owen Wilson, Will Ferrell, Vince Vaughn, and Luke Wilson. Carell acted as the title character of Evan Almighty, a sequel to Bruce Almighty, reprising his role as Evan Baxter, now a U.S. Congressman. The film received mostly negative reviews. Carell starred in the 2007 film Dan in Real Life, co-starring Dane Cook and Juliette Binoche.\n\nCarell played Maxwell Smart in the 2008 film Get Smart, an adaptation of the TV series starring Don Adams. It was successful, grossing over $230 million worldwide. During 2007, he was invited to join the Academy of Motion Picture Arts and Sciences. Carell starred with Tina Fey in Date Night during late 2008 and was released on April 9, 2010 in the U.S. He voiced Gru, the main character in the Universal CGI film Despicable Me along with Russell Brand, Miranda Cosgrove, and Kristen Wiig. He reprised the role in the 2013 sequel Despicable Me 2 and in the third installment of the film franchise Despicable Me 3 in 2017. He has several other projects in the works, including a remake of the 1967 Peter Sellers film The Bobo. He is doing voice-over work in commercials for Wrigley's Extra gum. Carell has launched a television division of his production company, Carousel Productions, which has contracted a three-year overall deal with Universal Media Studios, the studio behind his NBC comedy series. Thom Hinkle and Campbell Smith of North South Prods., former producers on Comedy Central's The Daily Show, were hired to manage Carousel's TV operations.\n\n\n==== Dramatic roles (2014–present) ====\nIn 2014, Carell starred in the true crime drama film Foxcatcher alongside Mark Ruffalo and Channing Tatum in which\nCarell played the millionaire and convicted murderer John Eleuthère du Pont. It premiered at the Cannes Film Festival and has received widespread acclaim. Carell was nominated for the Golden Globe for Best Actor and the Academy Award for Best Actor.\nCarell played activist Steven Goldstein in the gay rights drama Freeheld, replacing Zach Galifianakis, who dropped out due to scheduling conflicts. The film co-stars Julianne Moore, Ellen Page, and Michael Shannon, and was released in October 2015. \nHe followed this with another biographical drama, The Big Short, in which he portrayed banker Steve Eisman, whose name was changed in the film to Mark Baum. Directed by Adam McKay, the film stars Christian Bale, Ryan Gosling, and Brad Pitt, and it was released in December 2015. The film also received widespread critical acclaim, earning Carell a Golden Globe Award nomination for Best Actor. The film was also nominated for the Academy Award for Best Picture.\nIn 2016, he replaced Bruce Willis in Woody Allen's Café Society (2016), alongside Kristen Stewart and Jesse Eisenberg. The film premiered at the 69th Cannes Film Festival opening the festival. The film is certified fresh with the consensus on Rotten Tomatoes reading, \"Café Society's lovely visuals and charming performances round out a lightweight late-period Allen comedy whose genuine pleasures offset its amiable predictability\".In 2017, Carell headlined the biographical comedy-drama Battle of the Sexes, portraying tennis star Bobby Riggs, with Emma Stone co-starring as Billie Jean King. The film received critical acclaim and both Carell and Stone received Golden Globe nominations.In 2018, Carell starred in three films. He led the addiction drama Beautiful Boy as real life father David Sheff, whose son Nic (Timothée Chalamet) struggles with drug addiction. He also played Donald Rumsfeld in Adam McKay's political satire comedy, Vice, about the life of former Vice President Dick Cheney (Christian Bale). The film received mixed reviews, and went on to be nominated for eight Academy Awards, including Best Picture. His third 2018 role was starring as Mark Hogancamp of Marwencol in Robert Zemeckis' Welcome to Marwen. The film received a 32% on Rotten Tomatoes, with the critical consensus reading, \"Welcome to Marwen has dazzling effects and a sadly compelling story, but the movie's disjointed feel and clumsy screenplay make this invitation easy to decline.\" The movie was a box office failure, grossing $12.7 million against a budget of around $49 million.\n\n\n=== Upcoming projects ===\nCarell will return to television by starring in the Apple TV+ comedy-drama series The Morning Show opposite Reese Witherspoon and Jennifer Aniston. Carell will play Mitch Kessler, a morning news show anchor who is struggling to maintain relevance in a changing media landscape. The Morning Show received a two-season order from Apple, with the first season to premiere in the fall of 2019.Carell will also reunite with Greg Daniels for the Netflix workplace comedy series Space Force, based on the proposed space warfare service branch of the United States Armed Forces: the United States Space Force. He will also star in the upcoming film Irresistible, which Jon Stewart is currently directing.", "Personal life": "On August 5, 1995, Carell married Saturday Night Live alumna Nancy Carell (née Walls), whom he met when she was a student in an improvisation class he was teaching at Second City. They have two children, Elisabeth Anne \"Annie\" (born May 2001) and John \"Johnny\" (born June 2004).In addition to working with Carell as a fellow correspondent on The Daily Show, Nancy acted with him on The Office as his realtor and short-lived girlfriend Carol Stills. She also cameoed as a sex therapist in The 40-Year-Old Virgin and played Linda in Seeking a Friend for the End of the World. They also created the TBS comedy series Angie Tribeca starring Rashida Jones, which premiered on January 17, 2016.\nIn February 2009, Carell bought the Marshfield Hills General Store in Marshfield, Massachusetts.In an interview with 60 Minutes, Carell stated that his inspirations for acting and comedy are Steve Martin, Peter Sellers, John Cleese, Bill Cosby, and George Carlin.", "Awards and nominations": "For his contributions to the film industry, Carell received the 2,570th star on the Hollywood Walk of Fame in 2016.", "Filmography": "=== Film ===\n\n\n=== Television ===\n\n\n=== Video games ===", "References": "", "External links": "Steve Carell on IMDb \nSteve Carell at Box Office Mojo\nSteve Carell on Charlie Rose\nWorks by or about Steve Carell in libraries (WorldCat catalog)"}