{"_id": "65", "name": "Sylvester Stallone", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:50", "biography": "Sylvester Enzio Stallone (; born Michael Sylvester Gardenzio Stallone, July 6, 1946) is an American actor, director, screenwriter, and producer. After his beginnings as a struggling actor for a number of years upon arriving to New York City in 1969 and later Hollywood in 1974, he won his first critical acclaim as an actor for his co-starring role as Stanley Rosiello in The Lords of Flatbush.Stallone mostly only found gradual work as an extra or side character in films with a sizeable budget until he achieved his greatest critical and commercial success as an actor, starting in 1976 with his self-created role as the boxer Rocky Balboa, in the first film of the successful Rocky series (1976-2018). In the films, Rocky is portrayed as an underdog fighter that does battle with numerous brutal opponents, and wins the world heavyweight championship twice. The last two entries in the series are  Creed and Creed 2, that serve as spin-off films focusing on Adonis Creed, the son of the ill-fated boxer Apollo Creed, whom the long retired Rocky is a mentor to. Reprising the role during the 2010s brought Stallone praise, and his first Golden Globe award for the first Creed, as well as a third Academy Award nomination, having been first nominated for the same role 40 years prior.Stallone had similar box-office success, portraying the PTSD plagued soldier John Rambo in the five Rambo films (1982–2019) and as mercenary Barney Ross in the three The Expendables films (2010–2014). He wrote or co-wrote most of the films in his three biggest franchises, and directed many of them too.\nStallone's film Rocky was inducted into the National Film Registry, and had its props placed in the Smithsonian Museum. His use of the front entrance to the Philadelphia Museum of Art in the Rocky series led the area to be nicknamed the Rocky Steps, and Philadelphia has a statue of his Rocky character placed permanently near the museum. It was announced on December 7, 2010 that he was voted into the International Boxing Hall of Fame in the non-participant category.In 1977, Stallone was nominated for two Academy Awards for Rocky, for Best Original Screenplay and Best Actor. He became the third man in history to receive these two nominations for the same film, after Charlie Chaplin and Orson Welles.", "Early life": "Michael Sylvester Gardenzio Stallone was born in the Hell's Kitchen neighborhood of Manhattan, New York on July 6, 1946, the elder son of Francesco \"Frank\" Stallone Sr., a hairdresser and beautician, and Jacqueline \"Jackie\" Stallone (née Labofish; born 1921), an astrologer, dancer, and promoter of women's wrestling. His Italian father was born in Gioia del Colle, Italy and moved to the U.S. in the 1930s, while his American mother is of French (from Brittany) and Ukrainian-Jewish (from Odessa) descent. His younger brother is actor and musician Frank Stallone. \nComplications suffered by Stallone's mother during labor forced her obstetricians to use two pairs of forceps during his birth; misuse of these forceps accidentally severed a nerve and caused paralysis in parts of Stallone's face. As a result, the lower left side of his face is paralyzed (including parts of his lip, tongue, and chin), an accident which gave him his signature snarling look and slurred speech. He was baptized Catholic. His father moved the family to Washington, D.C. in the early 1950s to open a beauty school. In 1954, his mother opened a women's gym called Barbella's. Stallone attended Notre Dame Academy and Lincoln High School in Philadelphia, as well as Charlotte Hall Military Academy, prior to attending Miami Dade College and the University of Miami.", "Film career": "=== Early film roles ===\nWhile Stallone was in Switzerland, he played a restaurant patron, in a scene with Robert Redford and Camilla Sparv, in the sports drama, Downhill Racer (1969). Stallone had his first starring role in the softcore pornography feature film The Party at Kitty and Stud's (1970). He was paid US$200 for two days' work. Stallone later explained that he had done the film out of desperation after being evicted from his apartment and finding himself homeless for several days. He has also said that he slept three weeks in the Port Authority Bus Terminal in New York City prior to seeing a casting notice for the film. In the actor's words, \"it was either do that movie or rob someone, because I was at the end – the very end – of my rope\". The film was released several years later as Italian Stallion, in order to cash in on Stallone's newfound fame (the new title was taken from Stallone's nickname since Rocky). Stallone also starred in the erotic Off-Broadway stage play Score which ran for 23 performances at the Martinique Theatre from October 28 to November 15, 1971, and was later made into the 1974 film Score by Radley Metzger.In 1972, Stallone appeared in the film No Place to Hide, which was re-cut and retitled Rebel, the second version featuring Stallone as its star. After the style of Woody Allen's What's Up, Tiger Lily?, this film, in 1990, was re-edited from outtakes from the original movie and newly shot matching footage, then redubbed into an award-winning parody of itself titled A Man Called... Rainbo.\nStallone's other first few film roles were minor, and included brief uncredited appearances in Pigeons (1970) as a party guest, Woody Allen's Bananas (1971) as a subway thug, in the psychological thriller Klute (1971) as an extra dancing in a club, and in the Jack Lemmon film The Prisoner of Second Avenue (1975) as a youth. In the Lemmon film, Jack Lemmon's character chases, tackles and mugs Stallone, thinking that Stallone's character is a pickpocket. According to actor Elliott Gould, Stallone confessed to being in MASH (1970) as an extra. He had his second starring role in The Lords of Flatbush, in 1974. In 1975, he played supporting roles in Farewell, My Lovely; Capone; and Death Race 2000. He made guest appearances on the TV series Police Story and Kojak.\n\n\n=== Rise to prominence with Rocky ===\n\nStallone gained worldwide fame with his starring role in the smash hit Rocky (1976). On March 24, 1975, Stallone saw the Muhammad Ali–Chuck Wepner fight. That night Stallone went home, and after three days and 20 straight hours, he had written the script, but Stallone subsequently denied that Wepner provided any inspiration for it. Other possible inspirations for the film may have included Rocky Graziano's autobiography Somebody Up There Likes Me, and the movie of the same name. Wepner filed a lawsuit which was eventually settled with Stallone for an undisclosed amount. Stallone attempted to sell the script to multiple studios, with the intention of playing the lead role himself. Irwin Winkler and Robert Chartoff became interested and offered Stallone US$350,000 for the rights, but had their own casting ideas for the lead role, including Robert Redford and Burt Reynolds. Stallone refused to sell unless he played the lead character and eventually, after a substantial budget cut to compromise, it was agreed he could be the star.Rocky was nominated for ten Academy Awards, including Best Actor and Best Original Screenplay nominations for Stallone. The film went on to win the Academy Awards for Best Picture, Best Directing and Best Film Editing.\nFollowing the success of Rocky, Stallone made his directorial debut and starred in the 1978 film Paradise Alley, a family drama in which he played one of three brothers who enter the world of wrestling. That same year, he starred in Norman Jewison's F.I.S.T., a social drama in which he plays a warehouse worker, very loosely modelled on James Hoffa, who becomes involved in the labor union leadership. In 1979 he wrote, directed and starred in the sequel to his 1976 hit, Rocky II (replacing John G. Avildsen, who won an Academy Award for directing the first film), which also became a major success, grossing US$200 million. In 1981, he starred alongside Michael Caine and soccer star Pelé in Escape to Victory, a sports drama in which he plays a prisoner of war involved in a Nazi propaganda soccer game. That same year, he starred in the thriller Nighthawks, in which he plays a New York city cop who plays a cat-and-mouse game with a foreign terrorist, played by Rutger Hauer.\n\n\n=== Continued success with more Rocky, Rambo and additional action roles ===\n\nStallone launched another major franchise success, starring as Vietnam veteran John Rambo, a former Green Beret, in the action-war film First Blood (1982). The first installment of Rambo was both a critical and box office success. Critics praised Stallone's performance, saying he made Rambo seem human, as opposed to the way he is portrayed in the book of the same name. Three Rambo sequels, Rambo: First Blood Part II (1985), Rambo III (1988) and Rambo (2008), followed. He also continued his box office success with the Rocky franchise and wrote, directed, and starred in two more 1980s sequels to the series: Rocky III (1982) and Rocky IV (1985). Stallone has portrayed these two characters in a total of eleven films. In preparation for these roles, Stallone embarked upon a vigorous training regimen, which often meant six days a week in the gym and further sit-ups in the evenings. Stallone claims to have reduced his body fat percentage to his all-time low of 2.8% for Rocky III. Stallone met former Mr. Olympia Franco Columbu to develop his character's appearance for the films Rocky IV and Rambo II, just as if he were preparing for the Mr. Olympia competition. That meant two workouts a day, six days a week.\n\nDuring this time period, Stallone cultivated a strong overseas following. He also attempted, albeit unsuccessfully, roles in different genres. In 1984, he co-wrote and starred alongside Dolly Parton in the comedy film Rhinestone, where he played a wannabe country music singer. For the Rhinestone soundtrack, he performed a song. Stallone turned down the lead male role in Romancing the Stone in order to make Rhinestone instead, a decision he later regretted. In 1987, he starred in the family drama Over the Top as a struggling trucker who tries to make amends with his estranged son. These films did not do well at the box office and were poorly received by critics. It was around 1985 that Stallone was signed to a remake of the 1939 James Cagney classic Angels With Dirty Faces. The film would form part of his multi-picture deal with Cannon Films and was to co-star Christopher Reeve and be directed by Menahem Golan. The re-making of such a beloved classic was met with disapproval by Variety and horror by top critic Roger Ebert. Cannon opted to make Cobra instead. Cobra (1986) and the buddy cop action film Tango & Cash (1989), the latter alongside Kurt Russell, did solid business domestically and blockbuster business overseas, grossing over US$100 million in foreign markets and over US$160 million worldwide.\nStallone began the 1990s starring in the fifth installment of the Rocky franchise, Rocky V. This film brought back the original film's director John G. Avildsen. It was considered a box office disappointment. He attempted the comedy genre, starring in two comedies during the early 1990s, the critical and commercial disasters Oscar (1991) and Stop! Or My Mom Will Shoot (1992). \nIn 1993, he made a comeback with the hit Cliffhanger, which was a success in the US, grossing US$84 million, but even more successful worldwide, grossing US$171 million. Later that year, he starred with Wesley Snipes in the futuristic action film Demolition Man, which grossed over US$158 million worldwide. His string of hits continued with 1994's The Specialist (over US$170 million worldwide gross). In 1995, he played the futuristic character Judge Dredd (from the British comic book 2000 AD) in the eponymous film Judge Dredd. His overseas box office appeal saved the domestic box office disappointment of Judge Dredd, which cost almost US$100 million and barely made its budget back, with a worldwide tally of US$113 million. He also appeared in the thriller Assassins (1995) with Julianne Moore and Antonio Banderas. In 1996, he starred in the disaster film Daylight.\nThat same year, Stallone, along with an all-star cast of celebrities, appeared in the Trey Parker and Matt Stone short comedy film \"Your Studio and You\" commissioned by the Seagram Company for a party celebrating their acquisition of Universal Studios and the MCA Corporation. Stallone speaks in his Rocky Balboa voice with subtitles translating what he is saying. At one point, Stallone starts yelling about how can they use his Balboa character, that he left it in the past; the narrator calms him with a wine cooler and calling him \"brainiac.\" In response, Stallone says, \"Thank you very much.\" He then looks at the wine cooler and exclaims, \"Stupid cheap studio!\"Following his breakthrough performance in Rocky, critic Roger Ebert had stated that Stallone could become the next Marlon Brando, though he barely recaptured the critical acclaim achieved with Rocky. Stallone did go on to receive acclaim for his role in the crime drama Cop Land (1997), in which he starred alongside Robert De Niro and Ray Liotta. His performance led him to win the Stockholm International Film Festival Best Actor Award. In 1998, he did voice-over work for the computer-animated film Antz, which was a big hit domestically.\n\n\n=== Declining years ===\nIn 2000, Stallone starred in the thriller Get Carter, a remake of the 1971 British Michael Caine film of the same name, but the film was poorly received by both critics and audiences. Stallone's career declined considerably after his subsequent films Driven (2001), Avenging Angelo (2002) and D-Tox (2002) were also critical and commercial failures. In 2003, he played a villainous role in the third installment of the Spy Kids series: Spy Kids 3-D: Game Over, which was a huge box office success (almost US$200 million worldwide). Stallone also had a cameo appearance in the 2003 French film Taxi 3 as a passenger.\nFollowing several poorly reviewed box office flops, Stallone started to regain prominence for his supporting role in the neo-noir crime drama Shade (2003) which was only released in a limited fashion but was praised by critics. He was also attached to star and direct a film tentatively titled Rampart Scandal, which was to be about the murder of rappers Tupac Shakur and The Notorious B.I.G. and the surrounding Los Angeles Police Department corruption scandal. It was later titled Notorious but was shelved.In 2005, he was the co-presenter, alongside Sugar Ray Leonard, of the NBC Reality television boxing series The Contender. That same year he also made a guest appearance in two episodes of the television series Las Vegas. In 2005, Stallone also inducted wrestling icon Hulk Hogan, who appeared in Rocky III as a wrestler named Thunderlips, into the WWE Hall of Fame; Stallone was also the person who offered Hogan the cameo in Rocky III.\n\n\n=== Revisiting Rocky and Rambo ===\nAfter a three-year hiatus from films, Stallone had a comeback in 2006 with the sixth installment of his successful Rocky series, Rocky Balboa, which was a critical and commercial hit. After the critical and box office failure of the previous installment Rocky V, Stallone had decided to write, direct and star in a sixth installment which would be a more appropriate climax to the series. The total domestic box office came to US$70.3 million (and US$155.7 million worldwide). The budget of the movie was only US$24 million. His performance in Rocky Balboa has been praised and garnered mostly positive reviews.Stallone's fourth installment of his other successful movie franchise is titled simply Rambo. The film opened in 2,751 theaters on January 25, 2008, grossing US$6,490,000 on its opening day and US$18,200,000 over its opening weekend. Its box office was US$113,244,290 worldwide with a budget of US$50 million.\nAsked in February 2008 which of the icons (Rocky or Rambo) he would rather be remembered for, Stallone said \"it's a tough one, but Rocky is my first baby, so Rocky.\"\n\n\n=== Back to success with The Expendables and Creed, the return of Rambo ===\n\nIn 2010, Stallone wrote, directed and starred in the ensemble action film The Expendables. The movie, which was filmed during summer/winter 2009, was released on August 13, 2010. Joining him in the film were fellow action stars Jason Statham, Jet Li, and Dolph Lundgren, as well as Terry Crews, Mickey Rourke, Randy Couture, Eric Roberts, and Stone Cold Steve Austin, and cameos by fellow '80s action icons Bruce Willis and Arnold Schwarzenegger. The movie took US$34,825,135 in its opening weekend, going straight in at No. 1 in the US box office. The figure marked the biggest opening weekend in Stallone's career. In summer 2010, Brazilian company O2 Filmes released a statement saying it was still owed more than US$2 million for its work on the film. A sequel, The Expendables 2 was released August 17, 2012, to a positive critical reception of 67% on Rotten Tomatoes, as opposed to the original's 41%. As well as returning cast members from the first film, the ensemble cast also included Jean-Claude Van Damme and Chuck Norris.\nIn 2012, Stallone co-wrote the book for the Broadway musical adaptation of Rocky. In 2013, Stallone starred in the action film Bullet to the Head, directed by Walter Hill, based upon Alexis Nolent's French graphic novel Du Plomb Dans La Tete. Also in 2013, he starred in the action thriller Escape Plan, along with Arnold Schwarzenegger and Jim Caviezel, and in the sports comedy Grudge Match alongside Robert De Niro. Stallone was reported to be developing an English-language remake of the Spanish film No Rest for the Wicked, though the project was shelved.\n\nThe Expendables 3, the third installment in the ensemble action film series was released on August 15, 2014. The returning ensemble cast also added Wesley Snipes, Antonio Banderas, Mel Gibson and Harrison Ford. This film was negatively received by both critics and audiences and became the lowest grossing film in the series.In 2015, Stallone reprised his role as Rocky Balboa in a spin-off-sequel film, Creed, which focused on Adonis Creed, the son of his deceased friend/rival, Apollo Creed, becoming a boxer, played by Michael B. Jordan. The film, directed by Ryan Coogler, received critical acclaim. Portraying the iconic cinematic boxer for the seventh time in a span of 40 years, Stallone's portrayal of the character received widespread acclaim and accolades, including the Golden Globe Award for Best Supporting Actor, and his third Academy Award nomination; this time for Best Supporting Actor.\nIn 2017 Stallone appeared in Guardians of the Galaxy Vol. 2 as Stakar Ogord / Starhawk, the leader of a Ravagers faction. In 2018, he co-starred in Escape Plan 2: Hades with Dave Bautista which was released straight to home-video. Upon wrapping production, he announced via his social media page that work on Escape Plan 3: Devil's Station began immediately thereafter.By July 2017, Stallone announced that he had finished a script for a sequel to Creed, with a plot including the return of Ivan Drago from Rocky IV. Creed II went into production in March 2018, with a schedule release on Thanksgiving 2018. Stallone was originally slated to direct before the appointment of Steven Caple Jr., in his feature film directorial debut. Creed II was released in the United States by Metro-Goldwyn-Mayer on November 21, 2018. The film received generally positive reviews from critics and it went on to debut to $35.3 million in its opening weekend (a five-day total of $55.8 million), marking the biggest debut ever for a live-action release over Thanksgiving.Rambo: Last Blood began filming by September 2018, with a script co-written by Stallone. The plot centers around John Rambo infiltrating a Mexican drug cartel to rescue a family friend's daughter. Deadline Hollywood reported that Stallone is co-writing the script, but he is unlikely to direct. The film is scheduled for a September 20, 2019 release.On July 23, 2019 in an interview with Variety, Stallone said that a Rocky sequel and prequel are in development. Producer Irwin Winkler said “We’re very high on it\" and that negotiations are underway for Stallone to write and star in the feature. “We’re very anxious to make it.” Stallone said the plot of the movie would be about Rocky befriending a young fighter who is an undocumented immigrant. \"Rocky meets a young, angry person who got stuck in this country when he comes to see his sister. He takes him into his life, and unbelievable adventures begin, and they wind up south of the border. It’s very, very timely.\" Stallone said. Stallone also said there are \"ongoing discussions\" about a Rocky prequel television series, which he hopes will land on a streaming service and the series will likely follow a young Rocky Balboa as a professional boxing hopeful. Stallone said producer Irwin Winkler is hesitant on making the series saying that \"There was some conflict there, yes. He felt in his mind that “Rocky” was primarily a feature film, and he didn’t see it as being translated for cable, so there was a big bone of contention.\"\n\n\n=== Balboa Productions ===\nSylvester Stallone formed a film studio with Braden Aftergood in March 2018, named Balboa Productions, where Stallone will serve as co-producer for each of their projects. The studio signed a multi-year collaboration deal with Starlight Culture Entertainment to develop projects for film and television. Following the releases of Creed II, Rambo V: Last Blood, and The Expendables 4, the studio has an extensive production slate. A film depicting the history of Jack \"Galveston Giant\" Johnson, the first African-American boxing heavyweight champion is in development. The project was announced after Stallone's instrumental involvement in helping get Johnson a posthumous pardon from US President Donald J. Trump.Samaritian, a dark interpretation of the superhero genre will star Stallone in the titular role, from a script written by Bragi Schut. Stallone will later star in the film adaptation of Hunter, a story which had originally been planned as the premise for Rambo V: Last Blood. The story centers around Nathaniel Hunter, a professional tracker who is hired to hunt a half-human beast created as an experiments of a secret agency. The studio has yet to hire a screenwriter. A feature-length adaptation of the biographical novel, Ghost: My Thirty Years as an FBI Undercover Agent by Michael McGowan and Ralph Pezzullo about McGowan's career of over fifty undercover missions will follow, though there is no screenwriter attached to the project yet. Additionally, a film centered around black ops troops being written by retired Army Ranger, Max Adams, is also in development.\nThe television production slate includes Levon's Trade created by Chuck Dixon, and a series adaptation of Charles Sailor's Second Son being written by Rob Williams.", "Other film works": "Stallone's debut as a director came in 1978 with Paradise Alley, which he also wrote and starred in. In addition, he directed Staying Alive, the sequel to Saturday Night Fever, along with Rocky II, Rocky III, Rocky IV, Rocky Balboa, Rambo and The Expendables.\nIn August 2005, Stallone released his book Sly Moves which claimed to be a guide to fitness and nutrition as well as a candid insight into his life and works from his own perspective. The book also contained many photographs of Stallone throughout the years as well as pictures of him performing exercises. \nIn addition to writing all six Rocky films, Stallone also wrote Cobra, Driven, Rambo and Homefront. He has co-written several other films, such as F.I.S.T., Rhinestone, Over the Top, the first three Rambo films, the three The Expendables films and Creed II. His last major success as a co-writer came with 1993's Cliffhanger. In addition, Stallone has continued to express his passion in directing a film on Edgar Allan Poe's life, a script he has been preparing for years.\nIn July 2009, Stallone appeared in a cameo in the Bollywood movie Kambakkht Ishq where he played himself. Stallone also provided the voice of a lion in Kevin James' comedy Zookeeper. \nStallone has also mentioned that he would like to adapt Nelson DeMille's novel, The Lion's Game, and James Byron Huggins's novel, Hunter, for which Stallone had the film rights several years; he originally planned to use the plot from Hunter for Rambo V: Last Blood. In 2009, Stallone expressed interest in starring in a remake of Charles Bronson's 1974 film Death Wish.There are plans for a fourth film in The Expendables series that will conclude the saga.Stallone is featured in the 2017 documentary John G. Avildsen: King of the Underdogs about Academy Award-winning Rocky director John G. Avildsen, directed and produced by Derek Wayne Johnson.Stallone hand-picked Derek Wayne Johnson to direct and produce a documentary on the making of the original Rocky, currently entitled 40 Years of Rocky: The Birth of a Classic, due for release in 2019. The documentary will feature Stallone narrating behind-the-scenes footage from the making of the film.", "Soundtrack contributions": "Stallone has occasionally sung in his films. He sang \"Too Close To Paradise\" for Paradise Alley (1978), with the music provided by Bill Conti (who also collaborated with Stallone in prior years, having recorded the famous \"Gonna Fly Now\" theme for his Academy Award-nominated film, Rocky (1976) which was a U.S. #1 hit). In Rocky IV (1985), Stallone (as Rocky Balboa) sang \"Take Me Back\" to his on-screen wife, Adrian (Talia Shire), as they lay in bed. The song was first performed by his younger brother, Frank, who had a small role in the original Rocky as a singer at a street corner, and then bit parts in several of the sequels. For Rhinestone (1984), Stallone sang such songs as \"Drinkenstein\" as well as duets with his co-star, and actual country music star, Dolly Parton. He also performed two songs when he guest-starred on The Muppet Show in the 1980s, at the height of his career. The last time Stallone sang in a film was in Grudge Match (2013) when he and Robert De Niro performed \"The Star Spangled Banner\" together. Stallone's brother Frank achieved moderate success as a pop singer, releasing the #10 U.S. hit \"Far From Over\" in 1983 for the film Staying Alive, which Stallone directed and had a cameo appearance in. Frank also portrayed the character Carl in the film. In addition to this, Frank has contributed songs to other films starring his brother, including Rambo: First Blood Part II, and The Expendables 2.", "Boxing promoter": "Stallone became a boxing promoter in the 1980s. His boxing promoting company, \"Tiger Eye Productions\", signed world champion boxers Sean O'Grady and Aaron Pryor.", "Personal life": "Stallone has been married three times. At age 28, on December 28, 1974, he married Sasha Czack. They had two sons, Sage Moonblood Stallone (1976–2012), who died of heart disease at age 36, and Seargeoh (born 1979), who was diagnosed with autism at an early age. The couple divorced on February 14, 1985. Stallone married model and actress Brigitte Nielsen on December 15, 1985, in Beverly Hills, California. Their marriage (which lasted two years) and their subsequent divorce were highly publicized by the tabloid press. In May 1997, Stallone married Jennifer Flavin, with whom he has three daughters named Sophia, Sistine, and Scarlet. His daughters were chosen to share the role of Golden Globe Ambassador at the 74th Golden Globe Awards.Stallone was engaged to model Janice Dickinson for less than a year in the early '90s. Stallone had ended his relationship with Jennifer Flavin via FedEx after Dickinson gave birth to her daughter Savannah in February 1994. It was reported that Stallone was the father, and Savannah was given his surname at birth.  They split up when Stallone discovered he was not the father of her daughter.  In 1995, Stallone was briefly engaged to model Angie Everhart before rekindling his relationship with Flavin.After Stallone's request that his acting and life experiences be accepted in exchange for his remaining needed college credits to graduate, he was granted a Bachelor of Fine Arts (BFA) degree by the president of the University of Miami in 1999.In 2006, Stallone partnered with a beverage company producing an upscale bottled water brand called Sly Water.In 2007, customs officials in Australia discovered 48 vials of the synthetic human growth hormone Jintropin in Stallone's luggage. In a court hearing on May 15, 2007, Stallone pleaded guilty to two charges of possessing a controlled substance.Stallone's 48-year-old half-sister, Toni Ann Filiti, died of lung cancer on August 26, 2012. She died at their mother's Santa Monica home after choosing to leave UCLA's hospital.Stallone was the recipient of the Heart of Hollywood Award from the Board of Governors of the Cedars-Sinai Medical Center in 2016.A close friend of Joe Spinell, Spinell was the godfather of his late son Sage Stallone. They had a falling out during the shooting of their final collaboration Nighthawks (1982).\n\n\n=== Injuries ===\nKnown for physically demanding roles and his willingness to do the majority of his own stunts, Stallone has suffered numerous injuries during his acting career. For a scene in Rocky IV, he told Dolph Lundgren, \"Punch me as hard as you can in the chest.\" He later said, \"Next thing I know, I was in intensive care at St. John's Hospital for four days. It's stupid!\" While filming a fight scene with Steve Austin for The Expendables, he broke his neck, which required the insertion of a metal plate. During the filming of Escape to Victory, he broke a finger trying to save a penalty kick from Pelé.\n\n\n=== Sexual assault allegations ===\nIn 2016, a report from the Las Vegas Metropolitan Police Department was published stating that Stallone was accused of sexual assault by a 16-year-old girl while he was shooting a film in Las Vegas in 1986. The teen reportedly said that Stallone, then 40, forced her into a threesome with his bodyguard. A spokeswoman for Stallone denied the allegation. Stallone's ex-wife, Brigette Nielsen, later came to his defense, saying that she was with him at the time of the alleged assault. Stallone's Over the Top costar David Mendenhall also defended Stallone, denying claims that he introduced Stallone to the girl in question.In November 2017, a woman accused Stallone of sexually assaulting her at his Santa Monica office in the early 1990s. Stallone denied the claim. Stallone's attorney revealed the accuser filed a report after an entertainment website declined to pick up the story. Stallone's attorneys also stated that while the actor had a consensual relationship with the accuser in 1987, they had two witnesses who refuted the claims. In June 2018, the Los Angeles District Attorney's office confirmed an investigation, stating that the Santa Monica Police Department had presented a sex-crimes case against Stallone to a special prosecution task force for review. In October 2018, the Los Angeles District Attorney's office made the decision not to charge Stallone for the alleged attack, as no witnesses corroborated the allegations. Stallone in turn filed a police report regarding her lying on an official document.\n\n\n=== Religious views ===\nStallone was raised a devout Catholic but stopped going to church as his acting career progressed. Later, he rediscovered his childhood faith, when his daughter was born ill in 1996, and he again became a strict Catholic.In late 2006, the actor was interviewed by Pat Robertson from the CBN's The 700 Club. Stallone stated that before, in Hollywood, temptation abounded and he had \"lost his way\", but later put things \"in God's hands\".In 2010, he was interviewed by GQ magazine, to which he said that he considered himself a spiritual man, but was not part of any organized church institution.\n\n\n=== Political views ===\nStallone has supported several Republican politicians, but he says he is not a member of the Republican Party.In 1994, Stallone contributed $1,000 to the campaign of then-Congressman Rick Santorum, who was then running for the United States Senate in Pennsylvania.In 2008, Stallone endorsed John McCain for that year's presidential election. In the 2016 election he described Donald Trump as a \"Dickensian character\" and \"larger than life,\" but did not endorse him or any candidate in that year's Republican primary.In December 2016, he declined an offer to become Chair of the National Endowment for the Arts, citing a desire to work on issues related to veterans.Despite his conservative views, he is an advocate for gun control and has been described as \"the most anti-gun person working in Hollywood today\".", "Awards and honors": "Star on the Hollywood Walk of Fame (1984)\nInternational Boxing Hall of Fame (Class of 2010)\nGolden Globe Award for Best Supporting Actor - Motion Picture (2015)", "Selected filmography": "", "References": "", "External links": "Official website\nSylvester Stallone on IMDb \nSylvester Stallone at Box Office Mojo\n\"Sylvester Stallone collected news and commentary\". The New York Times."}