{"_id": "54", "name": "Ewan McGregor", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:45", "biography": "Ewan Gordon McGregor  (born 31 March 1971) is a Scottish actor, singer, and director known internationally for his various film roles, including independent dramas, science-fiction epics, and musicals.\nMcGregor's first professional role was in 1993, when he won a leading role in the British Channel 4 series Lipstick on Your Collar. Some of his best known roles include heroin addict Mark Renton in the drama films Trainspotting (1996) and T2 Trainspotting (2017), Jedi Obi-Wan Kenobi in the Star Wars prequel trilogy (1999–2005), poet Christian in the musical film Moulin Rouge! (2001), young Edward Bloom in Big Fish (2003), Rodney Copperbottom in Robots (2005), Camerlengo Father Patrick McKenna in Angels and Demons (2009), \"the ghost\" in Roman Polanski's political thriller The Ghost Writer (2010), Dr. Alfred Jones in the romantic comedy-drama Salmon Fishing in the Yemen (2011), Lumière in the live-action adaptation of the musical romantic fantasy Beauty and the Beast (2017), and the adult version of the titular character in the fantasy comedy-drama Christopher Robin (2018).\nIn 2018, McGregor won a Golden Globe Award for Best Actor – Miniseries or Television Film for his performance as brothers in the third season of FX anthology series Fargo, and received Golden Globe nominations for Best Actor – Musical or Comedy for both Moulin Rouge! and Salmon Fishing in the Yemen. McGregor has also starred in theatre productions of Guys and Dolls (2005–07) and Othello (2007–08). He was ranked number 36 on Empire magazine's \"The Top 100 Movie Stars of All Time\" list in 1997. In a 2004 poll for the BBC, McGregor was named the fourth most influential person in British culture.McGregor has been involved in charity work and has served as an ambassador for UNICEF UK since 2004. In 2013, he was appointed an Officer of the Order of the British Empire (OBE) for services to drama and charity. In 2016, he received the BAFTA Britannia Humanitarian Award.", "Early life": "McGregor was born in Perth and raised in Crieff. His mother, Carol Diane (née Lawson), is a retired teacher at Crieff High School and latterly deputy head teacher at Kingspark School in Dundee. His father, James Charles Stewart \"Jim\" McGregor, is a retired physical education teacher and careers master at Morrison's Academy in Crieff. He has an older brother, Colin (born 1969), a former Tornado GR4 pilot in the Royal Air Force. His uncle is actor Denis Lawson and his aunt by marriage was actress Sheila Gish, which makes him a step-cousin of Gish's actress daughters, Kay Curram and Lou Gish.McGregor attended the independent Morrison's Academy in Crieff. After leaving school at the age of 16, he worked as a stagehand at Perth Theatre and studied a foundation course in drama at Kirkcaldy College of Technology, before moving to London to study drama at the Guildhall School of Music and Drama when he was 18 years old.", "Career": "=== Film and television ===\n\nSix months prior to his graduation from Guildhall, McGregor won a leading role in Dennis Potter's six-part Channel 4 series Lipstick on Your Collar (1993). Not long afterwards, he starred in the BBC adaptation of Scarlet and Black (also 1993) with a young Rachel Weisz, and made his film debut in Bill Forsyth's Being Human (1994). For his role in the thriller Shallow Grave (also 1994), he won an Empire Award. The film was his first collaboration with director Danny Boyle. His international breakthrough followed with the role of heroin addict Mark Renton in Boyle's Trainspotting (1996), an adaptation of Irvine Welsh's novel of the same name.McGregor played the male romantic lead role in the British film Little Voice (1998). He was cast as the young Obi-Wan Kenobi in Star Wars: Episode I – The Phantom Menace (1999); the character was originally played by Sir Alec Guinness in the first Star Wars trilogy. While the prequels received criticism, McGregor's performance was well received. He reprised the role of Obi-Wan Kenobi for the subsequent prequels Star Wars: Episode II – Attack of the Clones (2002) and Star Wars: Episode III – Revenge of the Sith (2005). His uncle, Denis Lawson, had played Wedge Antilles in the original trilogy.McGregor starred in Moulin Rouge! (2001) as the young poet Christian, who falls in love with the terminally-ill courtesan Satine (Nicole Kidman), for which his performance was widely praised and nabbed McGregor his first Golden Globe Award for Best Actor – Motion Picture Musical or Comedy nomination. He starred alongside Renée Zellweger in Down With Love (2003). He also portrayed the younger Edward Bloom in the critically acclaimed film Big Fish (2003) alongside Albert Finney, Jessica Lange, Alison Lohman and Billy Crudup. In the same period, he also received critical acclaim for his portrayal of an amoral drifter mixed up with murder in the drama Young Adam (also 2003), which co-starred Tilda Swinton.McGregor voiced two successful animated features; he played the robot Rodney Copperbottom in Robots, which also featured the voices of Halle Berry and Robin Williams, and he voiced the lead character in Gary Chapman's Valiant (both 2005), alongside Jim Broadbent, John Cleese and Ricky Gervais. Also around this time, McGregor played two roles — one a clone of the other — opposite Scarlett Johansson in Michael Bay's science fiction action thriller film The Island. He also headlined Marc Forster's 2005 film Stay (both 2005), a psychological thriller co-starring Naomi Watts and Ryan Gosling.He narrated the Fulldome production Astronaut (2006), created for the National Space Centre. Around the same time, he also narrated the STV show JetSet (also 2006), a six-part series following the lives of trainee pilots and navigators at RAF Lossiemouth as they undergo a gruelling six-month course learning to fly the Tornado GR4, the RAF's primary attack aircraft. McGregor starred opposite Colin Farrell in the Woody Allen film Cassandra's Dream (2007), and he co-starred with Jim Carrey in I Love You Phillip Morris and appeared in Amelia (both 2009) alongside Hilary Swank. He played \"the ghost\" — the unnamed main character — in Roman Polanski's political thriller The Ghost Writer (2010). He portrayed Camerlengo Patrick McKenna in Angels & Demons (also 2009), the film adaptation of Dan Brown's novel of the same name. In 2011, McGregor starred in the British comedy Salmon Fishing in the Yemen directed by Lasse Hallström and co-starring Emily Blunt and Kristin Scott Thomas, for which he received his second Golden Globe Award for Best Actor – Motion Picture Musical or Comedy nomination. At the same year, he was awarded with the SIFF Golden Space Needle Award for Outstanding Achievement in Acting at the 2011 Seattle International Film Festival.In 2012, he was a member of the Jury for the Main Competition at the 2012 Cannes Film Festival. At the San Sebastián International Film Festival, he was awarded the Donostia Lifetime Achievement Award and became the youngest recipient of the award. In 2013, McGregor starred alongside Meryl Streep and Julia Roberts in August: Osage County, which was based on Tracy Letts's Pulitzer Prize-winning play of the same name.McGregor starred in the action comedy film Mortdecai (2015), alongside Johnny Depp and Paul Bettany. Robbie Collin of The Daily Telegraph felt the film was \"psychotically unfunny\". He made his directorial debut with American Pastoral (2016), in which he also starred.In 2017, he reprised his role as Mark Renton in T2 Trainspotting. McGregor played Lumière in the live action adaptation of Disney's Beauty and the Beast, directed by Bill Condon with an ensemble cast featuring Emma Watson and Dan Stevens in leading roles, alongside Luke Evans, Kevin Kline, Josh Gad, Stanley Tucci, Ian McKellen, and Emma Thompson. Filming began in May 2015 at Shepperton Studios in London, and the movie was released in March 2017. He then starred in FX anthology series in the third season of Fargo (both 2017), which garnered him a Golden Globe Award for Best Actor – Miniseries or Television Film for his dual performance of Emmit Stussy and Ray Stussy at the 75th Golden Globe Awards. In 2018, McGregor starred as the adult version of the titular character in Christopher Robin, a live-action adaptation of Disney's Winnie the Pooh franchise directed by Marc Forster and starred alongside Hayley Atwell.McGregor will next be seen as the older Danny Torrance in the film adaptation of Stephen King's novel Doctor Sleep. He will also star opposite Margot Robbie in Warner Bros.' DC Comics film Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn), directed by Cathy Yan, as the main villain Roman Sionis / Black Mask.On August 15, 2019, McGregor was reportedly in talks to reprise his role as Obi-Wan Kenobi in a unnamed series centered around the character on Disney+. Later on August 23, 2019 at the D23 Expo, Lucasfilm officially announced said series with McGregor confirming his return as Kenobi.\n\n\n=== Theatre ===\nFrom November 1998 to March 1999, McGregor starred as Malcolm Scrawdyke in a revival of David Halliwell's Little Malcolm and His Struggles Against the Eunuchs, directed by his uncle, Denis Lawson. The production was first staged at the Hampstead Theatre before transferring to the Comedy Theatre in London's West End. In November 2001, McGregor made a cameo appearance in The Play What I Wrote.From June 2005 to April 2007, McGregor starred alongside Jane Krakowski, Douglas Hodge and Jenna Russell in the Donmar Warehouse revival of Guys and Dolls after it transferred to the Piccadilly Theatre in London. He played the leading role of Sky Masterson. McGregor received the LastMinute.com award for Best Actor for his performance in 2005, and he was nominated for a Laurence Olivier Award for Best Actor in a Musical in 2007.From December 2007 to February 2008, McGregor starred as Iago in Othello at the Donmar Warehouse alongside Chiwetel Ejiofor as Othello and Kelly Reilly as Desdemona. He reprised the role on BBC Radio 3 in May 2008.", "Motorcycling": "A motorcyclist since his youth, McGregor undertook a marathon international motorbike trip with his best friend Charley Boorman and cameraman Claudio von Planta in 2004. From mid-April to the end of July, they travelled from London to New York via central Europe, Ukraine, Kazakhstan, Mongolia, Russia, Canada and the United States on BMW R1150GS Adventure motorbikes, for a cumulative distance of 22,345 miles (35,960 km). The trip included visits to several UNICEF programs along the route, and formed the basis of a television series and a best-selling book, both called Long Way Round.The Long Way Round team reunited in 2007 for another motorcycle trip from John o' Groats in Scotland to Cape Town in South Africa. The journey, entitled Long Way Down, lasted from 12 May until 5 August 2007. McGregor's brother Colin joined the motorcycle team during the early stages of the Long Way Down journey, and his father Jim also rode on sections of both Long Way Round and Long Way Down.McGregor appeared in a two-part BBC documentary in April 2012 entitled Ewan McGregor: Cold Chain Mission in which he travels by motorbike, boat, plane and foot to deliver vaccines to children in remote parts of India, Nepal and the Republic of Congo. The trip was part of his work as a UNICEF Ambassador.\nIn a June 2015 interview, McGregor indicated that a long discussed South American trip with Boorman was still in the planning stages, but he expected that an excursion through the Baja California Peninsula would take place first.", "Personal life": "McGregor married Eve Mavrakis, a French-Greek Jewish production designer whom he met on the set of Kavanagh QC, in 1995. Together they have four daughters, one of them adopted from Mongolia. McGregor has a heart and dagger tattoo of the names of his wife and daughters on his right arm. The family lived in Los Angeles, California, having relocated from North London. With his children raised in Mavrakis's Jewish faith, McGregor has said, \"My involvement in religion has more to do with the Jewish faith now and not the Christian faith, which I was very vaguely brought up in\". In May 2017, after separating from his wife, McGregor began a relationship with Mary Elizabeth Winstead, whom he met on the set of season 3 of Fargo in which they starred together. On 19 January 2018, McGregor filed for divorce from his wife, citing irreconcilable differences.McGregor is involved in charity work, including UNICEF UK since 2004 and GO Campaign. During the Long Way Round journey in 2004, McGregor and his travelling companions saw some of UNICEF's work in Ukraine, Kazakhstan, and Mongolia, and during the Long Way Down trip in 2007, he and Charley Boorman did some work for UNICEF in Africa. McGregor hosted the annual Hollywood gala for the GO Campaign in 2009 and 2010. He has worked with the Children's Hospice Association Scotland, as featured in Long Way Down. In 2012, he travelled with UNICEF immunization workers to remote parts of India, Nepal and the Republic of Congo for a BBC2 documentary entitled Ewan McGregor: Cold Chain Mission. In June 2015, McGregor read Hans Christian Andersen's \"The Little Match Girl\" for the children's fairytales app GivingTales in aid of UNICEF, together with other prominent figures such Roger Moore, Stephen Fry, Joan Collins, Joanna Lumley, and Michael Caine.In 2007, on an episode of Parkinson, McGregor said he had given up alcohol after a period where he was arguably a functioning alcoholic, and that he had not had a drink in seven years. In 2008, he had a cancerous mole removed from below his right eye.", "Filmography": "", "Awards and nominations": "In 2010, McGregor was appointed by the French government as a Chevalier dans l'Ordre des Arts et Lettres (Knight of the Order of the Arts and Letters). McGregor was appointed an Officer of the Order of the British Empire (OBE) in the 2013 New Year Honours for services to drama and charity.", "Bibliography": "Long Way Round, 2004 (with Charley Boorman), ISBN 0-7434-9933-6\nLong Way Down, 2008 (with Charley Boorman), ISBN 1-4165-7745-9", "Discography": "\"Choose Life\" with PF Project, Trainspotting#2: Music from the Motion Picture, Vol.#2, 1997.\n\"TV Eye\" with Wylde Ratttz, Velvet Goldmine: Music from the Original Motion Picture, 1999.\n\"Come What May\" with Nicole Kidman, Moulin Rouge! Music from Baz Luhrmann's Film, 2001.\n\"Elephant Love Medley\" with Nicole Kidman, Moulin Rouge! Music from Baz Luhrmann's Film, 2001.\n\"El Tango de Roxanne\" with Jose Feliciano, Moulin Rouge! Music from Baz Luhrmann's Film, 2001.\n\"Your Song\" with Alessandro Safina, Moulin Rouge! Music from Baz Luhrmann's Film, 2001.\n\"Here's To Love\" with Renée Zellweger, Down With Love: Music from and Included in the Motion Picture, 2003.\n\"The Sweetest Gift\", Unexpected Dreams – Songs From the Stars, 2006.\n\"Be Our Guest\" with Emma Thompson, Ian McKellen, and Gugu Mbatha-Raw, Beauty and the Beast, 2017.\n\"Days in the Sun\" with Adam Mitchell, Stanley Tucci, Ian McKellen, Emma Thompson, Emma Watson, Audra McDonald, Clive Rowe, Beauty and the Beast, 2017.\n\"Something There\" with Emma Watson, Dan Stevens, Ian McKellen, Emma Thompson, Nathan Mack, Gugu Mbatha-Raw, Beauty and the Beast, 2017.\n\"The Mob Song\", with Luke Evans, Josh Gad, Emma Thompson, Ian McKellen, Stanley Tucci, Nathan Mack, & Gugu Mbatha-Raw, Beauty and the Beast, 2017.", "References": "", "Further reading": "Adams, Billy. Ewan McGregor: The Unauthorized Biography. Overlooks Press, 1999. ISBN 0-87951-704-2\nBassom, David. Ewan McGregor: An Illustrated Story. Hamlyn, 1999. ISBN 0-600-59653-2\nJones, Veda Boyd. Ewan McGregor. Facts On File Inc., 1999. ISBN 0-7910-5501-9\nNickson, Chris. Ewan McGregor: An Unauthorized Biography. Macmillan, 1999. ISBN 0-312-96910-4\nPendreigh, Brian. Ewan McGregor. Thunder's Mouth Press, 1999. ISBN 1-56025-239-1\nRobb, Brian J. Ewan McGregor: From Junkie to Jedi. Plexus, 1999. ISBN 0-85965-276-9", "External links": "Ewan McGregor on IMDb  \nEwan McGregor at the Internet Broadway Database \nEwan McGregor at the TCM Movie Database \nEwan McGregor at the BFI's Screenonline\nEwan McGregor at Box Office Mojo\nEwan McGregor at AllMovie\nEwan McGregor at Rotten Tomatoes\nEwan McGregor at Emmys.com\nEwan McGregor on Twitter \nEwan McGregor on Instagram"}