{"_id": "27", "name": "Dwayne Johnson", "source": "wikipedia", "created_utc_dt": "08/29/2019, 10:29:35", "biography": "Dwayne Douglas Johnson (born May 2, 1972), also known by his ring name The Rock, is an American actor, producer, and former professional wrestler. Johnson was a professional wrestler for the World Wrestling Federation (WWF, now WWE) for eight years prior to pursuing an acting career. His films have grossed over $3.5 billion in North America and over $10.3 billion worldwide, making Johnson one of the highest-grossing box-office stars of all time.Johnson was a college football player for the University of Miami, with whom he won a national championship in 1991. He initially aspired for a professional career in football and entered the 1995 NFL Draft, but he went undrafted. As a result, Johnson signed with the Calgary Stampeders of the Canadian Football League (CFL), but was cut from the team in the middle of his first season. Shortly after, he began training as a professional wrestler.In 1996, Johnson secured a contract with the WWF and was promoted as the first third-generation wrestler in the company's history, as he is the son of Rocky Johnson and grandson of Peter Maivia. He rose to prominence after developing a charismatic persona of a boastful trash-talking wrestler named The Rock. He subsequently won his first WWF Championship in 1998 and helped usher the WWF into the \"Attitude Era\", a boom period in the company's business in the latter 1990s and early 2000s which still hold professional wrestling records for television ratings. In 2004, he left the WWE to pursue an acting career and went on a seven-year hiatus before returning in 2011 as a part-time performer until 2013, before wholly retiring in 2019.\nConsidered to be one of the greatest professional wrestlers and biggest draws of all-time, The Rock headlined the most bought professional wrestling pay-per-view event, WrestleMania XXVIII, and was featured in among the most watched episodes of WWE's television shows, WWE Raw and WWE SmackDown. He has won several championships, being a two-time Intercontinental Champion, a five-time tag team champion, and a ten-time world champion. He was also a Royal Rumble match winner and WWE's sixth Triple Crown champion.\nJohnson had his first acting role in The Mummy Returns (2001), and played his first lead role in the spin-off The Scorpion King (2002). He has since starred in numerous other films, including The Rundown (2003), The Other Guys (2010), Moana (2016), and Jumanji: Welcome to the Jungle (2017). Johnson's most successful box office role has been Luke Hobbs in The Fast and the Furious franchise. He first appeared as the character in Fast Five (2011) and helped catapult the film series into one of the top-grossing movie franchises in history. The character's popularity led to The Fast and the Furious spin-off movie Hobbs & Shaw (2019).Johnson has also attained success as an author and producer. In 2000, he released an autobiography titled The Rock Says... which debuted at number one on The New York Times Best Seller list.  In 2012, he founded the entertainment production company Seven Bucks Productions, which has since produced several films. Consistently ranked among the world's highest paid actors, Johnson made the Time 100 Most Influential People in the World list in both 2016 and 2019.", "Early life": "Johnson was born on May 2, 1972, in Hayward, California, to Ata Johnson (née Maivia; b.1948) and former professional wrestler Rocky Johnson (born Wayde Douglas Bowles; b.1944). Growing up, Johnson briefly lived in New Zealand with his mother's family, where he attended Richmond Road Primary School in Grey Lynn before returning to the United States.  He then attended Montclaire Elementary School in Charlotte, North Carolina before moving to Hamden, Connecticut where he spent a couple years at Shepherd Glen Elementary School and Hamden Middle School. Johnson spent his high school years in Honolulu, Hawaii at President William McKinley High School, in Nashville, Tennessee at Glencliff High School and McGavock High School, and in Bethlehem, Pennsylvania at Freedom High School. He was arrested multiple times for fighting, theft, and check fraud before the age of 17. Johnson also began playing sports, joining his high schools' gridiron football, track and field and wrestling teams.", "Football career": "Johnson was a promising football prospect and received offers from many Division I collegiate programs. He decided on a full scholarship from the University of Miami where he mostly played defensive tackle. In 1991, he was on the Miami Hurricanes' national championship team. After suffering a number of injuries, he was later replaced in the starting lineup by future Pro Football Hall of Famer Warren Sapp.After Johnson graduated in 1995 with a Bachelor of General Studies in criminology and physiology, he signed with the Calgary Stampeders of the Canadian Football League as a linebacker. He was assigned to the practice roster but was cut two months into the season.", "Professional wrestling career": "=== Early career (1995–1996) ===\nAfter his football career, Johnson decided to pursue a career as a professional wrestler. Veteran wrestler Pat Patterson got Johnson several tryout matches with the World Wrestling Federation (WWF) in 1996. Under his real name, he defeated The Brooklyn Brawler at a house show and lost matches to Chris Candido and Owen Hart. After wrestling at Jerry Lawler's United States Wrestling Association as Flex Kavana and winning the USWA World Tag Team Championship twice with Bart Sawyer in the summer of 1996, Johnson signed a WWF contract. He received additional training from Tom Prichard, alongside Achim Albrecht and Mark Henry.\n\n\n=== World Wrestling Federation/Entertainment ===\n\n\n==== Debut and Intercontinental Champion (1996–1997) ====\nJohnson made his WWF debut as Rocky Maivia, a combination of his father and grandfather's ring names, although his real name was acknowledged by the announcers. He was initially reluctant to take this ring name but was persuaded by Vince McMahon and Jim Ross. He was given the nickname \"The Blue Chipper\" and his lineage was played to on TV, where he was hyped as the WWF's first third-generation wrestler. Maivia, a clean-cut face character, was pushed heavily from the start despite his wrestling inexperience. He debuted on Monday Night Raw as a member of Marc Mero's entourage on November 4, 1996. His first match came at Survivor Series, on November 17, in an eight-man elimination tag match; he was the sole survivor and eliminated the final two members of the opposing team, Crush and Goldust. On February 13, 1997, he won the Intercontinental Championship from Hunter Hearst Helmsley on Monday Night Raw. Maivia then successfully defended the title against Helmsley at In Your House 13: Final Four. He had his first WrestleMania match at WrestleMania 13 where he was victorious in his Intercontinental Championship defense against The Sultan. WWF fans started to reject his character and push from the company. He defeated Bret Hart by disqualification in a title defense on the March 31 episode of Raw is War. Behind the scenes, Hart mentored Johnson for his first year in WWF and refused to be booked to take the title from him. On April 20, at In Your House 14: Revenge of the 'Taker, he lost to Savio Vega by countout but retained the title. Audiences became increasingly hostile toward Maivia, with chants of \"die, Rocky, die\" and \"Rocky sucks\" being heard during his matches.\n\n\n==== The Nation of Domination (1997–1998) ====\n\nAfter losing the Intercontinental Championship to Owen Hart on the April 28, 1997 episode of Raw Is War, and suffering a legitimate knee injury in a match against Mankind, Maivia returned in August 1997 and turned heel for the first time in his career by lashing out at fans who had been booing him and joining Faarooq, D'Lo Brown and Kama in the stable called the Nation of Domination. He then refused to acknowledge the Rocky Maivia name, instead referring to himself in the third person as The Rock, though he would still be billed as Rocky \"The Rock\" Maivia until 1998. The Rock would then regularly insult the audience, WWF performers, and interviewers in his promos.At D-Generation X: In Your House, Stone Cold Steve Austin defeated The Rock in under six minutes to retain the Intercontinental Championship. The next night on Raw Is War, Austin was ordered by Mr. McMahon to defend the title in a rematch, but forfeited it to The Rock instead, handing him the title belt before hitting him with the Stone Cold Stunner. The Rock feuded with Austin and Ken Shamrock through the end of 1997 and beginning of 1998. On January 19, 1998, at Royal Rumble, The Rock defeated Shamrock by disqualification to retain the Intercontinental title. Later that night, he entered the Royal Rumble match and lasted until the final two before he was eliminated by Stone Cold Steve Austin. On March 29, at WrestleMania XIV, he defeated Shamrock by disqualification once again to retain the title. The next night, on Raw is War, The Rock debuted a new Intercontinental Championship design and would later overthrow Faarooq as leader of the Nation of Domination to spark a feud between the two. He then successfully defended the Intercontinental title against Faarooq at Over the Edge: In Your House on May 31. The stable would then refer to themselves as simply \"The Nation\".The Rock and The Nation then feuded with Triple H and D-Generation X, with the two stable leaders first meeting in the quarter-final of the 1998 King of the Ring tournament, which The Rock won. At King of the Ring, The Rock defeated Dan Severn in the semi-final match and lost to rival Ken Shamrock in the final. The Rock then resumed his feud with Triple H, as the two had a two out of three falls match at Fully Loaded: In Your House for the Intercontinental title, which The Rock retained in controversial fashion. This led to a ladder match at SummerSlam, where The Rock lost the title.The Rock saw a big uptick in fan support during this time, causing him to be booked in a feud with fellow Nation members Mark Henry and D'Lo Brown, turning babyface in the process. Henry defeated him at Judgment Day: In Your House, after interference from Brown, effectively breaking up the stable.\n\n\n==== WWF Champion and rise to superstardom (1998–2000) ====\n\nThe Rock was then entered into the \"Deadly Game\" tournament for the vacant WWF Championship. The finals occurred at Survivor Series, where The Rock defeated Vince McMahon's associate, Mankind, to win his first WWF Championship. A \"double turn\" then occurred as The Rock turned heel again after allying with Vince and Shane McMahon as the crown jewel of their stable, The Corporation, after the McMahons betrayed Mankind. On December 13, 1998, at the pay-per-view named after him, Rock Bottom: In Your House, The Rock had a rematch with Mankind for the WWF Championship. Mankind appeared to win the match when The Rock passed out to the Mandible Claw submission move, but Vince McMahon ruled that since The Rock did not tap out, he retained his title.The Rock continued to feud with Mankind over the WWF Championship, which was traded back and forth between them. First, in the main event of the January 4, 1999 episode of Raw Is War, Mankind defeated The Rock after interference from Stone Cold Steve Austin. Then, in an \"I Quit\" match at Royal Rumble on January 24, The Rock regained the title, when a recording of Mankind saying \"I quit\" from an earlier interview was played over the PA system. On January 31, during an episode of Sunday Night Heat, Mankind pinned The Rock using a forklift truck in an Empty Arena match to win the WWF title. This match was referred to as \"Halftime Heat\" as it was televised during halftime of that year's Super Bowl. The two faced off again, at St. Valentine's Day Massacre: In Your House, in a Last Man Standing match which ended in a draw, meaning Mankind retained the title. Their feud ended on the February 15 Raw Is War, when The Rock won his third WWF Championship in a Ladder Match after Big Show interfered on his behalf. The Rock then lost the WWF Championship to Stone Cold Steve Austin at WrestleMania XV.The Rock's popularity continued to grow and audiences still cheered for him even though he was a heel. He then lost the title rematch against Stone Cold Steve Austin at Backlash: In Your House after he was betrayed by Shane McMahon, turning him face again and starting a feud with Triple H, The Undertaker and The Corporate Ministry. On April 29, 1999, WWF aired the pilot episode of SmackDown!, a term derived from one of The Rock's catchphrases. In the episode, The Rock continued his feud with The Corporate Ministry. This led to a match with Triple H, at Over the Edge, which The Rock won, and a match for the WWF Championship against The Undertaker, at King of the Ring, which The Rock lost. The Rock then lost a number one contender's match to Triple H, at Fully Loaded, after interference from \"Mr. Ass\" Billy Gunn. The Rock then defeated Gunn in a Kiss My Ass match at SummerSlam.\n\nShortly after SummerSlam, The Rock began teaming with former opponent Mankind and the two became known as The Rock 'n' Sock Connection. They became WWF Tag Team Champions for the first time after defeating The Undertaker and Big Show for the titles on the August 30, 1999 episode of Raw is War. The two performed a number of critically acclaimed comedic skits together, including one called \"This Is Your Life\", which saw Mankind bring parody versions of people from The Rock's past on television, such as his high school girlfriend and his high school football coach, only to have The Rock insult them. The segment earned an 8.4 Nielsen rating, one of the highest ratings ever for a Raw segment. The two lost the titles back to Undertaker and Big Show on the September 7, 1999 episode of SmackDown! and won them back from them on the September 20, 1999 episode of Raw is War. Rock and Mankind then lost the titles to The New Age Outlaws on the very next episode SmackDown!. Rock and Mankind would win the tag titles for the third and final time after beating the New Age Outlaws on the October 12, 1999 episode of SmackDown! before losing the titles to The Holly Cousins on the October 18, 1999 episode of Raw is War.At Royal Rumble, on January 23, 2000, The Rock entered the Royal Rumble match and was one of the final two remaining, along with Big Show; In an attempt at a \"false finish\", Big Show intended to throw The Rock over the top rope in a running powerslam-like position, before The Rock countered the move on the ring apron, sending Big Show to the floor before re-entering the ring as the winner. However, The Rock's feet accidentally hit the floor during the reversal attempt although those watching the event on TV did not see that. This was played up in the storyline as Big Show provided additional video footage showing this fact, and claimed to be the rightful winner. The Rock's number one contendership for the WWF Championship was then put on the line against Big Show at No Way Out, which Big Show won after Shane McMahon interfered. The Rock then defeated Big Show, on the March 13 episode of Raw Is War, to regain the right to face the WWF Champion, Triple H, at WrestleMania 2000 in a Fatal Four-way elimination match, also including Big Show and Mick Foley. Each wrestler had a McMahon in his corner: Triple H had his wife, Stephanie, Foley had Linda, The Rock had Vince and Big Show had Shane. The Rock lasted until the final two but was eliminated by then-reigning champion Triple H after Vince betrayed him by hitting him with a chair.\n\n\n==== Record-breaking world championship reigns (2000–2002) ====\n\nIn the following weeks, The Rock continued his feud with Triple H and eventually won his fourth WWF Championship, which he won on April 30, at Backlash, after Stone Cold Steve Austin intervened on his behalf. The following night on Raw, he successfully defended his title against Shane McMahon in a Steel Cage match. On May 21, at Judgment Day, The Rock faced Triple H in an Iron Man match with Shawn Michaels as the special guest referee. With the score tied at five falls each, and with seconds left on the time limit, The Rock was disqualified when The Undertaker attacked Triple H, thus giving Triple H the 6–5 win and the title. The Rock won the WWF Championship for a fifth time at King of the Ring on June 25 by scoring the winning pin in a six-man tag team match, teaming with Kane and The Undertaker against Shane McMahon, Triple H and Vince McMahon, whom he pinned. The Rock successfully defended the championship against Chris Benoit, on July 23, at Fully Loaded. The next month, he successfully defended his title against Kurt Angle and Triple H at SummerSlam. The Rock had another successful title defense against Benoit, Kane and The Undertaker, on September 24, at Unforgiven.The Rock then lost the WWF Championship to Kurt Angle, at No Mercy, in October. The next month, The Rock feuded with Rikishi and defeated him at Survivor Series. The Rock wrestled a six-man Hell in a Cell match for the WWF Championship, at Armageddon, which Angle won to retain the title. On the December 18 episode of Raw, The Rock won the WWF Tag Team Championship with The Undertaker, defeating Edge and Christian, before losing it back to them the next night at a SmackDown! taping. In 2001, The Rock continued to feud with Angle over the WWF Championship, culminating at No Way Out in February, where he pinned Angle to win the WWF Championship for a sixth time. The Rock then feuded with the Royal Rumble winner, Stone Cold Steve Austin, whom he lost the title to at WrestleMania X-Seven after Austin allied with Vince McMahon, who interfered on his behalf. On the next night's Raw Is War, during a steel cage title rematch, Triple H attacked The Rock, allying with McMahon and Austin and helping Austin retain the championship. Austin and Triple H then formed a tag team called The Power Trip, while The Rock was indefinitely suspended in storyline. Johnson used this time off to act in The Scorpion King.\n\nThe Rock returned in late July 2001, when the WWF was feuding with rival promotions, World Championship Wrestling (WCW) and Extreme Championship Wrestling (ECW), during what's known as The Invasion storyline. In reality, WCW and ECW were purchased by Vince McMahon and the WWF. Many former WCW and ECW wrestlers were then brought onto WWF television and formed The Alliance to compete with WWF in storyline. The Alliance and Vince McMahon then both attempted to persuade The Rock to join their team. The Rock then aligned with McMahon and the WWF. The next month, The Rock defeated Booker T, at SummerSlam, to win the WCW Championship for the first time. He later lost the title to Chris Jericho at No Mercy. The next night on Raw, he teamed with Jericho to win the WWF Tag Team Championship from The Dudley Boyz. The two then lost the tag titles to Booker T and Test on the November 1, 2001 episode of SmackDown!. The Rock defeated Jericho on the November 5 episode of Raw for his second WCW Championship.As part of the WWF's battle against The Alliance, The Rock wrestled in a \"winner takes all\" five-on-five elimination tag team match at Survivor Series where the losing team's company would be dissolved in storyline. He was a member of Team WWF along with Chris Jericho, The Undertaker, Kane, and Big Show. The Alliance's team consisted of Stone Cold Steve Austin, Kurt Angle, Booker T, Rob Van Dam, and Shane McMahon. In the end, it came down to a one-on-one between The Rock and Stone Cold Steve Austin. The Rock seemed to have the upper hand, until his teammate Jericho entered the ring and attacked The Rock. Austin tried to capitalize on this by pinning The Rock, but Kurt Angle revealed his true allegiance by attacking Austin. The Rock then pinned Austin, giving Team WWF the victory and forcing The Alliance to disband. The Rock's WCW Championship was renamed the unbranded \"World Championship\" following the Alliance's loss. At the next pay-per-view, Vengeance, The Rock lost the World Championship to Jericho, who would then unify the WWF and World titles later that night. The Rock then unsuccessfully challenged Jericho for the now Undisputed WWF Championship at Royal Rumble.\n\nAt the next pay-per-view, No Way Out, The Rock defeated The Undertaker in a singles match. The event also saw the WWF debut of the famed WCW faction New World Order, which at the time consisted of \"Hollywood\" Hulk Hogan, Kevin Nash, and Scott Hall. This later led to a match between The Rock and Hogan at WrestleMania X8. The match was billed as \"icon versus icon\", with both men representing the top tier of two generations of wrestling; ultimately The Rock pinned Hogan at WrestleMania X8. Despite The Rock portraying a heroic character and Hogan a villain, a portion of the crowd attending the SkyDome was rooting heavily for Hogan. In an interview in 2013, Hogan said he and The Rock changed the style of the match on the fly based on the crowd's response. After the introduction of the first-ever brand extension, the WWF held a \"draft lottery\" on the March 25, 2002, episode of Raw. The Rock was the number one overall pick, going to the SmackDown brand before taking a sabbatical from wrestling.The Rock made a surprise return on a June episode of Raw before going to his assigned brand of SmackDown. There, he was named the number one contender for the WWE Undisputed Championship, which he won for a record-setting seventh time at Vengeance, on July 21, by defeating Kurt Angle and then-champion The Undertaker in a Triple Threat match. The Rock successfully defended the title at the Global Warning event in Melbourne, Australia, against Triple H and Brock Lesnar after pinning Triple H. On August 25, at SummerSlam, after interference from Lesnar's manager Paul Heyman, The Rock lost the WWE Undisputed Championship to Lesnar along with the record for the youngest WWE Champion, which he had set in 1998. In 2018, writing for ESPN.com, Sean Coyle noted in a retrospective review of the event, that following his victory over Hulk Hogan at WrestleMania X8, The Rock \"started to see a dip in fan support\" and \"that dip turned into a plunge\" by the time Rock had his match with Lesnar at SummerSlam because fans knew he was leaving WWE to pursue an acting career. This was evident by the fact that he was met with a negative crowd response during his match against Lesnar. After the event ended, The Rock was visibly angry at the crowd reaction. When he tried to do a post-show speech for the crowd, the fans attending the Nassau Coliseum would still boo him. The Rock then took time off to kickstart his acting career.\n\n\n==== Final feuds and first retirement (2003–2004) ====\nThe Rock returned on the January 30, 2003 episode of SmackDown! to set up another match with Hulk Hogan at No Way Out. Because of negative fan reaction during his previous couple of matches as a result of his budding acting career, The Rock turned heel again. The Rock then defeated Hogan at No Way Out before assigning himself to the Raw brand. There, he had various small feuds, including one with The Hurricane. He also began performing \"Rock Concerts\", segments in which he played the guitar and mocked WWE performers and fans in song.\n\nAfter failing to win a number one contendership for the World Heavyweight Championship, The Rock went into another program with Stone Cold Steve Austin. This led to a match at WrestleMania XIX, which called back to their previous two WrestleMania encounters, both of which Austin had won. The Rock won after delivering three consecutive Rock Bottoms, ending their long-running rivalry in what turned out to be Austin's final match. The next night, Raw was billed as \"The Rock Appreciation Night\", in honor of his victory over Austin. That night, he was attacked by a debuting Goldberg. At Backlash, Goldberg defeated The Rock, who then briefly left WWE to film Walking Tall.Throughout the rest of the year, The Rock made occasional appearances, reverting back to a face character. In 2004, The Rock aided Mick Foley in his feud against Evolution, leading to a reunion of The Rock 'n' Sock Connection. They lost against Ric Flair, Randy Orton, and Batista in a handicap match at WrestleMania XX, when Orton pinned Foley after an RKO. This would be Johnson's final wrestling match until November 2011. The Rock appeared in WWE sporadically following WrestleMania XX. He made returns to provide support for Eugene against Jonathan Coachman, made a cameo in his hometown of Miami and helped Mick Foley against La Résistance. Later in 2004, he hosted a pie-eating contest, as part of the WWE Diva Search, and ended the segment by giving Coachman a People's Elbow. The Rock's contract with WWE then ended and he started his full-time acting career.\n\n\n=== Return to WWE ===\n\n\n==== Non-wrestling appearances (2007–2009) ====\nOn March 12, 2007, The Rock appeared on a WWE show after nearly three years, via a pre-taped promo shown during Raw. He correctly predicted that Bobby Lashley would defeat Umaga at WrestleMania 23 in Donald Trump and Vince McMahon's \"Battle of the Billionaires\" Hair vs Hair match. On March 28, 2008, Johnson appeared to induct his father and grandfather Peter Maivia and Rocky Johnson into the WWE Hall of Fame. Johnson's next appearance was via a pre-taped promo on October 2, 2009, during the Decade of SmackDown.\n\n\n==== Feud with John Cena (2011–2013) ====\n\nOn February 14, 2011, The Rock was revealed as the host of WrestleMania XXVII, appearing live on Raw for the first time in almost seven years. During a lengthy promo, he addressed the fans and started a feud with John Cena. After numerous appearances via satellite, The Rock appeared live on the Raw before WrestleMania XXVII to confront Cena. After he and Cena exchanged insults, The Miz and Alex Riley appeared and attacked The Rock; he fended off Miz and Riley, only for Cena to blindside him with an Attitude Adjustment.\n\nOn April 3, at WrestleMania XXVII, The Rock opened the show by cutting a promo. After appearing in numerous backstage segments, The Rock came to ringside to restart the main event between Cena and The Miz as a No Disqualification match, after it had ended in a draw. As revenge for the Attitude Adjustment Cena had given him on Raw, Rock hit Cena with the Rock Bottom, allowing The Miz to pin him and retain the WWE Championship. After the match, Rock attacked Miz and hit him with the People's Elbow. The following night on Raw, The Rock and Cena agreed to a match at WrestleMania XXVIII the next year. They then worked together to fend off an attack by The Corre, which at the time consisted of Wade Barrett, Heath Slater, Justin Gabriel, and Ezekiel Jackson.The Rock appeared live on Raw in his hometown of Miami to celebrate his 39th birthday. On September 16, WWE announced The Rock would wrestle in a traditional 5-on-5 Survivor Series tag team match, teaming with Cena at Survivor Series in November. However, on the October 24 episode of Raw, Cena instead suggested The Rock be his partner in a standard tag team match against The Miz and R-Truth, a team called Awesome Truth, which Rock agreed to the following week. On November 14, during the special Raw Gets Rocked, The Rock appeared live, delivering Rock Bottoms to Mick Foley, who had been hosting a \"This Is Your Life\"-style segment for Cena, and later both members of Awesome Truth. The Rock and Cena defeated Awesome Truth on November 20 at Survivor Series, when The Rock pinned The Miz. After the match, The Rock gave Cena a Rock Bottom.\n\nLeading up to WrestleMania, The Rock and Cena had several verbal confrontations on Raw. On the March 12, 2012 episode of Raw, The Rock hosted his first \"Rock Concert\" segment since 2004, mocking Cena in his songs. On April 1, at WrestleMania XXVIII, The Rock beat Cena in the main event after countering Cena's attempt at a People's Elbow into a Rock Bottom. This event broke the record for biggest professional wrestling pay-per-view buyrate. The following night on Raw, The Rock praised Cena, calling their match \"an honor\". He then vowed to once again become WWE Champion.On July 23, at Raw 1000, The Rock announced he would wrestle for the WWE Championship at the Royal Rumble pay-per-view. During the show, he encountered then-reigning WWE Champion CM Punk, Daniel Bryan, and John Cena, all of whom expressed a desire to face him. The Rock later saved Cena from an assault by Big Show, only to be laid out by CM Punk. On the January 7, 2013 episode of Raw, The Rock returned to confront his Rumble opponent CM Punk. On January 11, he made his first SmackDown appearance in ten years, getting into an altercation with Team Rhodes Scholars, resulting in him delivering a Rock Bottom to Damien Sandow and a People's Elbow to Cody Rhodes. The Rock closed out the 20th-anniversary episode of Raw, on January 14, with one of his \"Rock Concerts\", leading to a brawl with CM Punk. The following week on Raw, The Rock was attacked by The Shield. Vince McMahon then asserted that if The Shield attacked The Rock in his title match with CM Punk, Punk would be stripped of the WWE Championship.\n\nOn January 27, at Royal Rumble, CM Punk would seemingly defeat The Rock after the arena lights went out and someone attacked The Rock. Vince McMahon then came out and was about to strip Punk of the championship, however, at The Rock's request, he instead restarted the match. This culminated in The Rock defeating Punk to win his eighth WWE Championship. Punk received a title rematch with The Rock, at Elimination Chamber, with the added stipulation that if The Rock was disqualified or counted out, he would still lose the WWE Championship. The Rock would pin Punk to retain the championship. The following night on Raw, The Rock unveiled a new WWE Championship design, with a different center plate and removable customizable side-plates which had his \"Brahma Bull\" logo. The Rock then resumed his rivalry with John Cena, who won that year's Royal Rumble to set up a rematch of the previous WrestleMania match between the two at WrestleMania 29, only this time with the WWE Championship on the line.On April 7, at WrestleMania 29, Rock lost the WWE Championship to Cena, ending his reign at 70 days. Despite being advertised for the Raw after WrestleMania, where it was stated that The Rock was still entitled a rematch for the WWE Championship, The Rock did not appear because of a legitimate injury sustained during his match with Cena, in which his abdominal and adductor tendons tore from his pelvis. Johnson underwent surgery on April 23 to reattach the torn tendons.\n\n\n==== Sporadic appearances (2014–2016) ====\n\nIn April 2014, The Rock appeared in the opening segment of WrestleMania XXX along with Stone Cold Steve Austin and Hulk Hogan. On the October 6 episode of Raw, The Rock made a surprise appearance to confront Rusev and Lana; this resulted in the Rock clearing Rusev from the ring.The Rock appeared at the 2015 Royal Rumble event during the main event match, where he helped his relative Roman Reigns fend off Big Show and Kane after Reigns eliminated them from the match. Reigns then won the match and The Rock endorsed him in the ring. The Rock appeared at WrestleMania 31 alongside Ronda Rousey, getting into an in-ring altercation with Triple H and Stephanie McMahon. Rock and Rousey prevailed after he attacked Triple H and she overpowered McMahon. On June 27, The Rock appeared at a live event in Boston where he confronted Bo Dallas and gave him a Rock Bottom.\n\nOn the January 25, 2016, episode of Raw, The Rock was in a segment that saw him converse with The Miz, Big Show, Lana and Rusev before he and his relatives, The Usos, got into an altercation with then-WWE Tag Team Champions, The New Day. The Rock appeared at WrestleMania 32 where he announced that WWE had broken the all-time WrestleMania attendance record before being interrupted by The Wyatt Family. The Rock got into a verbal back-and-forth with Bray Wyatt before having an impromptu match with Wyatt Family member Erick Rowan. The Rock won after giving Rowan a Rock Bottom and pinning him in six seconds, which set the record for the fastest win in WrestleMania history. The Rock was then aided by a returning John Cena to fend off Wyatt, Rowan and Braun Strowman.\n\n\n=== Mainstream crossover ===\nThe Rock appeared on Wyclef Jean's 2000 single \"It Doesn't Matter\" and in its music video. He also recorded \"Pie\" with Slick Rick for WWF The Music, Vol. 5.In 1999, Johnson appeared on That '70s Show as his father, Rocky Johnson. The next year, he was on Star Trek: Voyager as an alien wrestler that used The Rock's famous moves.In 2000, he hosted Saturday Night Live (SNL) for the first time. Fellow wrestlers Triple H, The Big Show, and Mick Foley also appeared on the show. Johnson has stated the success of that episode is the reason he began receiving offers from Hollywood studios. He has since hosted SNL another four times.\n\nIn 1999, The Rock was listed No. 5 on Entertainment Weekly's Top 12 Entertainers of the Year. In 2000, Access Hollywood ranked him number six in their list of the Top 10 Celebrities of 2000. That year, Rock was also listed in the Forbes Celebrity 100 and People Magazine's 25 Most Intriguing People.The Rock was listed Entertainment Weekly's 101 Most Influential People in both 2000 and 2001. In 2001, he was also listed on E!'s 20 Top Entertainers. In 2002, The Rock was listed on E!'s 25 Toughest Stars. In 2003, he was listed in VH1's 200 Greatest Pop Culture Icons and was No. 13 in People Magazine's 50 Favorite TV Stars.The Rock made a surprise appearance at the official Xbox unveiling during Bill Gates's keynote speech at the ongoing Computer Electronics Show in 2001.Johnson's motion picture debut was as The Scorpion King in The Mummy Returns (2001). The movie broke a two-year record for the highest-grossing single day in film history by earning US$28,594,667. The movie's financial success led to Johnson's first leading role, in the spin-off The Scorpion King (2002). He received US$5.5 million for the role and Guinness World Records named him the record-holder for highest-paid actor in their first leading role.The Rock has appeared on the covers of many magazines, including Rolling Stone, Entertainment Weekly, Newsweek, and TV Guide. He has also appeared in, and been the cover athlete for, several video games.In 2018, his Instagram account had the eighth-most followers in the world.\n\n\n=== Legacy in pro wrestling ===\nThe Rock has been listed as one of the all-time greatest professional wrestlers as well as one of the top draws in wrestling history. Many have placed The Rock on their \"Mount Rushmore of Pro Wrestling\" including Hulk Hogan, Ric Flair, Chris Jericho and John Cena. In \"Cable Visions: Television Beyond Broadcasting\", The Rock was described as \"for a long time, the WWE's biggest star and probably held the greatest international appeal\". R.D. Reynolds stated in his book \"The WrestleCrap Book of Lists\" that The Rock was \"the biggest star for WWE from 1999 until 2004\".The Rock main-evented the most bought pay-per-view worldwide in WWE history (WrestleMania XXVIII), the most bought pay-per-view domestically in WWE history (WrestleMania X-Seven), the highest rated Raw in history, the highest rated SmackDown in history, and was part of the highest rated segment in WWE history. His return in 2001 did a 7.1 rating which was the highest rated segment of the entire year. The Rock was also part of the highest rated match of the 21st century. His WWF Championship defense, on May 1, 2000, against Shane McMahon did an 8.3 rating on the regular time and a 9.1 on the overrun making this match the most watched professional wrestling match in the United States of this millennium.In 2011, The Rock's return to an episode of Raw generated an average of 4.7 million viewers in the United States, with 7.4 million tuning in during his promo. Raw 1000 was the highest rated Raw episode of 2012 and his segment with CM Punk and Daniel Bryan was the highest rated segment of the show. In 2013, the night after The Rock won the WWE Championship for the first time in over a decade, at Royal Rumble,  Raw got its highest rating of that year.Derived from one of his catchphrases \"lay the smackdown\", WWE introduced its second flagship program WWE SmackDown in 1999 which later became television's second longest-running weekly episodic program in history. The term \"smackdown\" was instituted in Merriam-Webster dictionaries since 2007.The Rock holds the record for most Raw shows main-evented in one year (38 in 2000), most SmackDown shows main-evented in one year (36 in 2000) and tied with Stone Cold Steve Austin (in 2001) for most PPV shows main evented in one year (12 in 2000).", "Acting career": "In 1999, Johnson played his own father in an episode of That '70s Show called \"That Wrestling Show\". Nearly a year later, he appeared in the Star Trek: Voyager episode \"Tsunkatse\" as an alien wrestler who fought popular character Seven of Nine.Johnson had his first theatrical movie role in The Mummy Returns (2001) which led to his first leading role in the spin-off The Scorpion King (2002). He then starred in the action-comedy The Rundown (2003) and the film remake Walking Tall (2004). He played a supporting role in Be Cool (2005) and was the primary antagonist in Doom (2006). Roles in Gridiron Gang (2006), Reno 911!: Miami (2007) and Southland Tales (2007) soon followed. He played a cocky famous American football player in the family-film The Game Plan (2007) and Agent 23 in the comedy Get Smart (2008). In February 2008, he presented the Academy Award for Best Visual Effects at the 80th Academy Awards.\n\nIn 2009, he starred in Race to Witch Mountain, and had his first animated voice-over role in Planet 51. In 2010, he starred in comedy movies Tooth Fairy and The Other Guys, and in the action movie Faster. In 2011, he played the role of Luke Hobbs for the first time in Fast Five. In 2012, he was named CinemaCon Action Star of the Year. That year, he also starred in the adventure movie Journey 2: The Mysterious Island. In 2013, Johnson portrayed Roadblock in G.I. Joe: Retaliation, played Luke Hobbs for the second time in Fast & Furious 6, and starred in Pain & Gain and Snitch.  Johnson was named by Forbes as the top-grossing actor of 2013, with his films bringing in $1.3 billion worldwide for the year.In 2014, Johnson starred as the title character in Hercules. In 2015, he reprised his role as Luke Hobbs in Furious 7 and started executive-producing and starring in Ballers, an HBO comedy-drama series about professional athletes. Also in 2015, he played the lead role in the disaster movie San Andreas. In 2016, Johnson starred in the action-comedy Central Intelligence and voiced the Polynesian demigod Maui in the Academy Award-nominated Disney animated film Moana. He was then named by Forbes as the world's highest paid actor for 2016 and won \"Favorite Premium Cable TV Actor\" at the People's Choice Awards for his portrayal of a former-athlete-turned-manager named Spencer Strasmore in Ballers.\nIn 2017, Johnson again played Luke Hobbs in the eighth installment of The Fast and the Furious franchise, The Fate of the Furious, and starred in Baywatch and Jumanji: Welcome to the Jungle. That year, he was ranked by Forbes as the second-highest grossing actor and the second-highest paid actor. He also won his second consecutive award at the People's Choice Awards for his role in Ballers. In 2018, Johnson starred in two action films, Rampage and Skyscraper, and was again the world's second-highest paid actor for the calendar year. He then appeared as himself in Fighting with My Family (2019), a seriocomedy centering around the life of WWE's Paige. Johnson performed as Luke Hobbs for the fifth time in his career in The Fast and the Furious spin-off movie Hobbs & Shaw (2019). He will play video game avatar Dr. Smolder Bravestone for the second time in the next installment of the Jumanji franchise, Jumanji: The Next Level (2019).", "Other work": "In 2000, Johnson published his autobiography, titled The Rock Says..., which he co-wrote with Joe Layden. It debuted at No. 1 on The New York Times Best Seller list and remained on the list for several weeks. In 2012, Johnson founded his production company, Seven Bucks Productions.In 2013, Johnson hosted and produced the TNT reality competition series The Hero. In 2014, he hosted another TNT reality series entitled Wake Up Call. In 2019, Johnson started hosting an NBC competition series called The Titan Games.In March 2016, Johnson partnered with the American fitness apparel manufacturer Under Armour to release \"Project Rock\". The first item in his partnership with Under Armour, a gym bag, sold out in a couple of days. His second item, a black T-shirt sporting his signature \"Brahma bull\" sold out after being worn at WrestleMania 32. Johnson also released an alarm clock app as part of \"Project Rock\" that received more than one million downloads in its first week of release. Since then, they have released sneakers, headphones, and other apparel.In 2016, Johnson started a YouTube channel titled \"The Rock\" with the help of online personality Lilly Singh. His first video was called \"The YouTube Factory\" and featured several internet stars.", "Personal life": "Johnson is half-Black and half-Samoan. His father, Rocky Johnson, is a Black Canadian, from Nova Scotia, and part of the first Black tag team champions in WWE history along with Tony Atlas. His mother is Samoan and the daughter of Peter Maivia, who was also a pro wrestler. Maivia's wife, Lia, was the first female pro wrestling promoter, taking over Polynesian Pacific Pro Wrestling after her husband's death in 1982, until 1988. Through his grandfather Maivia, Johnson is considered a non-blood relative to the Anoa'i wrestling family. In 2008, Johnson inducted his father and grandfather into the WWE Hall of Fame.\n\nJohnson married Dany García on May 3, 1997. They have one child. On June 1, 2007, they announced they were splitting up amicably. Johnson then began dating Lauren Hashian, daughter of Boston drummer Sib Hashian. They first met in 2006 while Johnson was filming The Game Plan. Hashian and Johnson were married on August 18, 2019, in Hawaii. They have two children.\nAs of 2014, Johnson has a home in Southwest Ranches, Florida, as well as Los Angeles, California. He also owns a farm in Virginia. In 2009, Johnson gained citizenship in Canada in honor of his father's background. Though Johnson was previously registered as a Republican, he voted for Barack Obama in the 2008 and 2012 United States presidential elections and is now an independent voter. He stated he did not vote in the 2016 U.S. election.In recognition of his service to the Samoan people, and because he is a descendant of Samoan chiefs, Johnson had the noble title of Seiuli bestowed upon him by Malietoa Tanumafili II during his visit there in July 2004. He received a partial Samoan pe'a tattoo on his left side in 2003, and, in 2017, had the small \"Brahma bull\" tattoo on his right arm covered with a larger half-sleeve tattoo of a bull's skull.", "Activism and philanthropy": "Johnson attended the 2000 Democratic National Convention as part of WWE's non-partisan \"Smackdown Your Vote\" campaign, which aimed to influence young people to vote. He also had a speaking role at the 2000 Republican National Convention that same year.In 2006, Johnson founded the Dwayne Johnson Rock Foundation, a charity working with at-risk and terminally ill children. On October 2, 2007, he and his ex-wife donated $1 million to the University of Miami to support the renovation of its football facilities. The University of Miami renamed the Hurricanes' locker room in Johnson's honor. In 2015, Johnson donated $1,500 to a GoFundMe to pay for an abandoned dog's surgery. In 2017, he donated $25,000 to Hurricane Harvey relief efforts. In 2018, Johnson donated a gym to a military base in Oahu, Hawaii. After the 2018 Hawaii floods, he worked with Malama Kauai, a nonprofit organization, to help repair damages caused by the floods. Johnson has also worked with Make-A-Wish Foundation on a number of occasions.", "Championships and accomplishments": "Pro Wrestling Illustrated\nMatch of the Year (1999) vs. Mankind in an \"I Quit\" match at Royal Rumble\nMatch of the Year (2002) vs. Hollywood Hulk Hogan at WrestleMania X8\nMost Popular Wrestler of the Year (1999, 2000)\nWrestler of the Year (2000)\nRanked No. 2 of the top 500 singles wrestlers in the PWI 500 in 2000\nUnited States Wrestling Association\nUSWA World Tag Team Championship (2 times) – with Bart Sawyer\nWrestling Observer Newsletter\nBest Box Office Draw (2000, 2011, 2012)\nBest Gimmick (1999)\nBest on Interviews (1999, 2000)\nMost Charismatic (1999–2002, 2011, 2012)\nMost Improved (1998)\nWrestling Observer Newsletter Hall of Fame (Class of 2007)\nWWE/World Wrestling Entertainment/Federation\nWCW Championship (2 times)\nWWE Championship (8 times)\nWWF Intercontinental Championship (2 times)\nWWF Tag Team Championship (5 times) – with Mankind (3), The Undertaker (1), and Chris Jericho (1)\nRoyal Rumble (2000)\nSixth Triple Crown Champion\nDeadly Games WWF Championship Tournament (1998)\nSlammy Award (9 times)\nBest Actor (2014)\nGame Changer of the Year (2011) – with John Cena\nGuess Who's Back or: Return of the Year (2011)\nLOL! Moment of the Year (2012, 2013) – insulting John Cena using the history of Boston, Massachusetts, Rock Concert on the 20th anniversary episode of Raw\nMatch of the Year (2013) – vs. John Cena for the WWE Championship at WrestleMania 29\nNew Sensation (1997)\n\"Tell Me You Didn't Just Say That\" Insult of the Year (2014) – insulting Rusev and Lana\n\"This is Awesome\" Moment of the Year (2015) – with Ronda Rousey", "Other awards and honors": "1991: NCAAF National Championship – as a member of the Miami Hurricanes\n2001: Teen Choice Awards – Choice Movie Villain\n2012: CinemaCon Action Star of the Year\n2013: Kids Choice Awards – Favorite Male Butt Kicker\n2015: Muscle & Fitness Man of the Century\n2016: Mr. Olympia ICON Award\n2016: People's Choice Awards – Favorite Premium Cable TV Actor\n2016: People Magazine Sexiest Man Alive\n2016: Shorty Awards – Best Actor\n2016: Time 100 Most Influential People in the World inclusion\n2017: Hollywood Walk of Fame induction with a motion pictures star\n2017: People's Choice Awards – Favorite Premium Series Actor\n2017: Kids' Choice Awards – Favorite BFF's (shared with Kevin Hart)\n2017: Teen Choice Awards – Choice Fantasy Movie Actor\n2017: NAACP Image Award for Entertainer of the Year\n2018: Kids' Choice Awards – Favorite Movie Actor\n2018: The Razzie Nominee So Rotten You Loved It - as executive producer of Baywatch \n2018: Teen Choice Awards – Choice Comedy Movie Actor\n2019: Johnson was honored by the United States 1st Armored Division, which named one of its Abrams tanks after him\n2019: Time 100 Most Influential People in the World inclusion\n2019: MTV Movie & TV Awards – Generation Award", "Filmography": "", "See also": "List of people from Miami\nRock and a Hard Place (film)", "Notes": "", "References": "", "External links": "Dwayne Johnson on IMDb \nDwayne Johnson on Facebook\nDwayne Johnson on Instagram\nDwayne Johnson on Twitter\nThe Rock on WWE.com\nDwayne Johnson's profile at Cagematch.net, Wrestlingdata.com, Internet Wrestling Database"}