{"headshot": "https://m.media-amazon.com/images/M/MV5BNDQyNzMzZTMtYjlkNS00YzFhLWFhMTctY2M4YmQ1NmRhODBkXkEyXkFqcGdeQXVyNjcyNzgyOTE@._V1_UY98_CR6,0,67,98_AL_.jpg", "birth name": "Mark Alan Ruffalo", "height": "5' 8\" (1.73 m)", "mini biography": ["'Mark Ruffalo' (qv) was born in Kenosha, Wisconsin, to Marie Rose (Hebert), a stylist and hairdresser, and Frank Lawrence Ruffalo, a construction painter. His father's ancestry is Italian, and his mother is of half French-Canadian and half Italian descent. Mark moved with his family to Virginia Beach, Virginia, where he lived out most of his teenage years. Following high school, Mark moved with his family to San Diego and soon migrated north, eventually settling in Los Angeles. He took classes at the 'Stella Adler' (qv) Conservatory and subsequently co-founded the Orpheus Theatre Company, an Equity-Waiver establishment, where he worked in nearly every capacity. From acting, writing, directing and producing to running the lights and building sets while building his resume. Bartending for nearly nine years to make ends meet and ready to give it all up, a chance meeting and resulting collaboration with playwright/screenwriter 'Kenneth Lonergan' (qv) changed everything.Ruffalo won NY success in Lonergan's play \"This Is Our Youth\", which led to the male lead in Lonergan's film _You Can Count on Me (2000)_ (qv), playing the ne'er-do-well brother of 'Laura Linney' (qv). The performance drew rave reviews and invited comparisons to an early 'Marlon Brando' (qv). Notable roles in _The Last Castle (2001)_ (qv), _XX/XY (2002)_ (qv), and _Windtalkers (2002)_ (qv) followed, although in 2002 Ruffalo was diagnosed with an acoustic neuroma, a type of brain tumor. Though the tumor was benign, the resulting surgery led to a period of partial facial paralysis, from which he fully recovered. In 2003, Ruffalo scored leading roles alongside two popular female stars, playing a police detective opposite 'Meg Ryan' (qv) in _In the Cut (2003)_ (qv) and the love interest of 'Gwyneth Paltrow' (qv) in the comedy _View from the Top (2003)_ (qv). Though both films were high-profile box office disappointments, Ruffalo went on to four notable (if highly disparate) films in 2004 - _We Don't Live Here Anymore (2004)_ (qv), _Eternal Sunshine of the Spotless Mind (2004)_ (qv), _13 Going on 30 (2004)_ (qv), and _Collateral (2004)_ (qv) - which solidified his ability to be both a popular leading man and an acclaimed ensemble player in either comedy or drama.After 2004, Ruffalo was consistently at work, with leads in popular Hollywood films and independent productions that continued to solidify him as one of film's most consistently strong actors: _Just Like Heaven (2005)_ (qv), _All the King's Men (2006)_ (qv), _Zodiac (2007)_ (qv), _Reservation Road (2007)_ (qv), and _The Brothers Bloom (2008)_ (qv). In 2010 Ruffalo achieved something of a breakthrough, by directing the indie film _Sympathy for Delicious (2010)_ (qv), which won him the Special Jury Prize at the Sundance Film Festival, and co-starring as the sperm-donor father to lesbian couple 'Annette Bening' (qv) and 'Julianne Moore' (qv) in _The Kids Are All Right (2010)_ (qv). His role in the idiosyncratic domestic comedy/drama earned him Academy Award, Independent Spirit Award, Screen Actors Guild, and BAFTA nominations for Best Supporting Actor.High-profile roles in 'Martin Scorsese' (qv)'s _Shutter Island (2010)_ (qv) and 'Kenneth Longeran''s long-delayed _Margaret (2011)_ (qv) followed before Ruffalo's appearance as Dr. Bruce Banner, aka The Hulk, in 'Joss Whedon' (qv)'s blockbuster _The Avengers (2012)_ (qv). Garnering highly positive reviews for a role in which actors 'Eric Bana' (qv) and 'Edward Norton' (qv) could not find success in previous films made Ruffalo a box office star in addition to a critically-acclaimed actor. He is expected to reprise the role in the upcoming 2015 sequel, and reunited with former co-star Gywneth Paltrow in the sex-addiction comedy-drama _Thanks for Sharing (2012)_ (qv); Ruffalo also will take the lead in 'Ryan Murphy' (qv)'s adaptation of 'Larry Kramer' (qv)'s AIDS-drama play _The Normal Heart (2014)_ (qv).Ruffalo has been married to actress 'Sunrise Coigney' (qv) since 2000; the couple have three children, a son and two daughters.::Gary Brumburgh / gr-home@pacbell.net"], "spouse": ["'Sunrise Coigney' (qv)::(11 June 2000 - present) ( 3 children)"], "trade mark": ["Frequently plays likeable everyman types"], "trivia": ["He was set to appear in _Signs (2002)_ (qv) but had to drop out when he was diagnosed with a brain tumor. His part in _Signs (2002)_ (qv) went to 'Joaquin Phoenix' (qv). The brain tumor Mark was diagnosed with was found to be benign. Following brain surgery, he has fully recovered after suffering from a partial facial paralysis.", "Father was a construction painter and mother a hairstylist. His three siblings ('Scott Ruffalo' (qv), Tania, and Nicole) are all hairdressers.", "Studied at the 'Stella Adler' (qv) Conservatory in Los Angeles.", "Bartended for nearly a decade while trying to break in to show business.", "In an interview with Moviemaker magazine, he claims to have made 800 auditions in his lifetime before making it big.", "Attended First Colonial High School in Virginia Beach, Virginia.", "'Benicio Del Toro' (qv) was a fellow student at the 'Stella Adler' (qv) drama school in Los Angeles.", "His father is of Italian descent. His maternal grandfather was of French-Canadian ancestry, and his maternal grandmother was also of Italian descent.", "Was in attendance at 'Chris Penn' (qv)'s funeral.", "Was a close friend of 'Heath Ledger' (qv). He is also friends with 'Gael García Bernal' (qv).", "He was supposed to play the part of \"Perry Smith\" in _Infamous (2006)_ (qv) but had other engagements and so recommended 'Daniel Craig' (qv), who then went on to get the job.", "His brother, 'Scott Ruffalo' (qv), died December 8, 2008, after being found outside his Beverly Hills home after a gunshot wound to the head. He was a 39-year-old hairdresser and was married to Luzelena. His body was cremated.", "While appearing in the drama \"Awake and Sing!\", he was nominated for the 2006 Tony Award (New York City) for Supporting or Features Actor in a Drama.", "Sold his three-bedroom, 2,957-square-foot house in Los Angeles' Hollywood Hills for $1,650,000. He bought the property in 2004 for the same price for which he later sold it. [2009]", "Sold his L.A. home in 2009 and moved his family to Callicoon, New York.", "He was diagnosed with a benign brain tumor (more specifically, an acoustic neuroma) in 2002; he subsequently had it removed and is in good health.", "Like his predecessor and friend 'Edward Norton' (qv), he was a fan of the \"Incredible Hulk\" comics and TV series before playing the title character.", "For his environmental advocacy, 'Mark Ruffalo' (qv) received a Global Green Millennium Award and a Meera Gandhi Giving Back Foundation Award. Also chosen as one of the \"People Who Mattered\" in 2011 by Time magazine.", "His uncredited cameo as a snoozing Dr. Banner in _Iron Man 3 (2013)_ (qv) makes him only the second actor - the first was 'Bill Bixby' (qv) - to play the role twice.", "Lives in ultra trendy Los Angeles neighborhood, Los Feliz. 'Giovanni Ribisi' (qv), 'Bo Barrett' (qv), 'Scarlett Johansson' (qv), 'Chris Pine' (qv), 'Ryan Reynolds' (qv), 'Brad Pitt' (qv), 'Kristen Stuart' (qv), 'Michael Cera' (qv), 'Hannah Telle' (qv) and 'Robert Pattinson' (qv) are among the other actors who also call Los Feliz home.", "Anti-fracking activist.", "Currently in LA filming _Sympathy for Delicious (2010)_ (qv). [January 2009]", "California University of Pennsylvania filming _Foxcatcher (2014)_ (qv). [December 2012]", "Was cast as \"Brick\" in the Broadway revival of 'Tennessee Williams (I)''s \"Cat on a Hot Tin Roof\", also featuring 'Ashley Judd' (qv) and 'Ned Beatty' (qv). He soon backed out to play \"Stan\" in 'Charlie Kaufman' (qv)'s _Eternal Sunshine of the Spotless Mind (2004)_ (qv). [October 2003]", "Currently appearing on Broadway in 'Clifford Odets' (qv)' \"Awake and Sing!\". [May 2006]", "New York, New York, USA [2002]", "Became a father for the 2nd time at age 37 when his wife 'Sunrise Coigney' (qv) gave birth to their daughter Bella Noche Ruffalo in May 2005.", "Became a father for the 3rd time at age 39 when his wife 'Sunrise Coigney' (qv) gave birth to their daughter Odette Ruffalo on October 20, 2007.", "Son, 'Keen Ruffalo' (qv), was born in June 2001.", "He was Louis Leterrier's original choice for the title role in The Incredible Hulk (2008) but the studio wanted 'Edward Norton' (qv). Ruffalo was later cast in the role in _The Avengers (2012)_ (qv) and has played it since.", "He is an animal rights activist.", "He supported Bernie Sanders in the 2016 U.S. Presidential election.", "He is well-known for his far left-wing political views and activism.", "He auditioned for the role of Doctor Doom in The Fantastic Four (1994) but was turned down."], "quotes": ["With indies, all they have is their script and it's very important to them. The characters are better drawn, the stories more precise and the experience greater than with studio films where sometimes they fill in the script as they're shooting.", "For some reason, my whole life has been, 'You can't do this, you can't do that.' The other day I was watching these kids crossing the road, and they have these crossing guards, kids who help other kids across the road. They would never let me be a crossing guard when I was a little kid . It would come up, I'd always raise my hand, I would never get picked . They thought I was too wild, but I knew I was responsible enough, if I was given that task.", "The true value of somebody in this town [Hollywood] is very hard to determine. It's all smoke and mirrors.", "The whole experience of getting close to mortality changed my perspective on work. I wasn't enjoying acting before: I felt like I wasn't in charge of my career. I wasn't doing things that made me feel good. I was really bitter, I thought I deserved more, and I wasn't grateful for all the great shit that had happened to me. If you're not grateful, then it's very easy to be an asshole. After the brain tumor happened, I realized I love acting, I've always loved it, I may never get a chance to do it again.", "Certainly, it's very easy to fall in love with cash. If you're going to make all your decisions based on cash, you're going to have a pretty naffy career.", "\"I don't like this idea of Method. I come from that school, but what I was taught was that it's your imagination. You do your homework, and you use your imagination. People use the Method as a shield; it shields them from being vulnerable. I hear all these young actors who are like, 'I'm Method, I'm gonna go live in the house, you know, I totally get it, I've done it, I've been there', but one thing I know is it kills spontaneity. They'll still give great performances, but they're not playing with the other actors - it's all about them. And spontaneity and vulnerability are gold on screen and on stage - they are the fucking magic. When Brando reaches down and picks up that glove and puts it on his hand, that is magic. You can't plan that.\" (He is referring to a scene in _On the Waterfront (1954)_ (qv): 'Eva Marie Saint' (qv) accidentally dropped a glove on set and, rather than wait for another take, 'Marlon Brando' (qv) picked it up and put it on, without missing a line.)", "I want to do a western. Nobody does westerns anymore.", "I love acting with kids, cause they're great acting partners. They're totally present. Even when they're acting, they're still available and you can crack them up or something weird will happen and they'll go with it. You can throw them little curve-balls and they'll go with it. I always like having kid energy around. I think it's good for a movie, even when you're doing dramatic stuff.", "[on navigating his career] - I try to do the things that speak to me in one way or another, and sometimes I'm even drastic. I like extremes. I like to change things up and keep from getting complacent or stale. I moved away from L.A. [to upstate New York] because it was feeling empty and it didn't feel like Los Angeles was a fertile place for me as an artist anymore. I didn't like the distance between my family and myself that I was experiencing from having to work all the time. I let my heart sort of guide me on that, and I turned out okay. It was a bit of a gamble, but it's turned out pretty good. But mostly it's just trying to keep it fresh and new and exciting for me and hopefully for everyone else.", "[on favorite performances that he's given or films that he's done] - Every five years or so, there's some great thing that I'm really proud of, an experience that I'm really proud of. I stopped long ago putting too much emphasis on the results of how a film was going to be reviewed or what kind of money it makes. Those are important things, but as far as to my satisfaction, I've really focused on the experiences. _The Kids Are All Right (2010)_ (qv) is a special one; _My Life Without Me (2003)_ (qv); _In the Cut (2003)_ (qv). _What Doesn't Kill You (2008)_ (qv) is a really great movie that was little seen, but I think is one of my personal favorites. _You Can Count on Me (2000)_ (qv), of course, and probably _Zodiac (2007)_ (qv). Those are my top picks, as far as things that I've done. Another one, _We Don't Live Here Anymore (2004)_ (qv). Not the most beloved of movies, or widely known, but they're the ones I've had a good time making.", "(2011, on moving out of L.A.) I'd had it with L.A., and I'd really had it with the business side of acting, the machinery of it all. You're an artist, but then all of a sudden you're a product at the same time, and there's this company that's sprung up around you. I got depressed. I was losing my love for it. So I said, 'I'm done.' I fired everybody and moved my family out here (to Callicoon, New York). I had to make a radical move.", "(2011, on his early struggling actor days) It was brutal. The years are stripping away, but when you're talking to anyone from home, you're saying something like, 'Well, I'm just working on my craft right now,' when the truth is that I can't get a fucking job because no one will hire me. It was humiliating.", "If you're not yelling at your kids then you're not spending enough time with them!", "[on the Obama administration issuing new rules for water and air pollution at fracking sites, as well as pushing for more disclosure of the chemicals in fracking fluids, 2012] I like where he is going. Overall, we now have a president who is willing to talk about renewable energy, which is a very good thing. As for fracking, President Obama says we should move forward with it if it doesn't destroy our water and air. And that really is the key question. It has yet to be proven that we can frack without destroying our water and air. If it can be done, why aren't they doing it? ... We're clearly coming to the end of the fossil fuel era. We have the technology to shift to renewable energy, we have the will of the people. The only thing that's keeping us back is the fossil fuel industry's hold on our political system. That's what we need to change. And that's why we're looking to Gov. Cuomo. He did the right thing on gay marriage, and we're proud of him for that. Now he has the chance to do the right thing again with hydrofracking.", "My thinking at the time was, \"Aren't we at the place in our culture where a gay man should be playing this part?\" And 'Ryan Murphy' (qv) said, \"That's the antithesis of what this movie is about. It doesn't matter what your sexual preference is. It matters what actor I think should play this part.\"", "When you're a young actor and you're really fighting to have your place in the world - for me anyway - it took a mental focus and energy and striving. It took a long time. And it was my whole life.", "[on _Foxcatcher (2014)_ (qv)] Shakespeare does a great job of taking 5,000-year-old stories and turning them into modern pieces that are true to the original essence, but are completely remade. And that's how this feels. It's a true story but it's lifted up into the eternal, the universal.", "It isn't just the Academy 'Awards' (qv). The entire American system is rife with white privilege racism. It goes into our justice system. [2016]"], "birth date": "1967-11-22", "birth notes": "Kenosha, Wisconsin, USA", "_actorID": "14", "_source": "IMDB", "actorID": "0749263", "created_utc_dt": "09/14/2019, 13:01:24"}