{"headshot": "https://m.media-amazon.com/images/M/MV5BOTU2MTI0NTIyNV5BMl5BanBnXkFtZTcwMTA4Nzc3OA@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Kip"], "height": "6' 3\" (1.91 m)", "mini biography": ["'Chris Hemsworth' (qv) was born in Melbourne, Australia, to Leonie (van Os), a teacher of English, and Craig Hemsworth, a social-services counselor. His brothers are actors 'Liam Hemsworth' (qv) and 'Luke Hemsworth' (qv). He is of Dutch (from his immigrant maternal grandfather), Irish, English, Scottish, and German ancestry. His uncle, by marriage, was Rod Ansell, the bushman who inspired the film _Crocodile Dundee (1986)_ (qv).Chris saw quite a bit of the country in his youth, after his family moved to the Northern Territory before finally settling on Phillip Island, to the south of Melbourne. In 2004, he unsuccessfully auditioned for the role of Robbie Hunter in the Australian soap opera _Home and Away (1988)_ (qv) but was recalled for the role of Kim Hyde which he played until 2007. In 2006, he entered the Australian version of _Dancing with the Stars (2004)_ (qv) and his popularity in the soap enabled him to hang on until show 7 (_Dancing with the Stars: Episode #5.7 (2006)_ (qv) when he became the fifth contestant to be eliminated.His first Hollywood appearance was in _Star Trek (2009)_ (qv), but it was his titular role in _Thor (2011)_ (qv) which propelled him to prominence worldwide. He reprised the character in the science fiction blockbuster _The Avengers (2012)_ (qv).Chris's American representative, management company ROAR, also manages actress 'Elsa Pataky' (qv), and it was through them that the two met, marrying in 2010. The couple have a daughter and twin sons.::IMDb Editors"], "spouse": ["'Elsa Pataky' (qv)::(26 December 2010 - present) ( 3 children)"], "trade mark": ["Deep resonant voice", "Light bold blue eyes", "Muscular physique"], "trivia": ["Younger brother of 'Luke Hemsworth' (qv).", "Won Logie for Most Popular New Male Talent. [May 2005]", "Older brother of 'Liam Hemsworth' (qv).", "Parents are Craig and Leonie Hemsworth.", "Chris studied American English at Screenwise Film & TV School for Actors in Sydney, Australia.", "Has gained 20 pounds of muscle for the title role in _Thor (2011)_ (qv).", "Daughter, India Rose Hemsworth, was born on May 11, 2012 in London, England.", "Attended and graduated from Heathmont College in Heathmont, Victoria.", "Very good friends with 'Chris Evans' (qv) and 'Tom Hiddleston' (qv). Friends with 'Sienna Miller' (qv).", "His maternal grandfather, Martin van Os, is a Dutch immigrant. The rest of Chris's ancestry is Irish, English, and smaller amounts of German and Scottish.", "Born on a Thursday, the day of the week named after Thor, a character he has portrayed.", "(December 26, 2010) Married his girlfriend of 10 months 'Elsa Pataky' (qv) following a 5-month-long engagement.", "Ranked #7 in Glamour magazine's list of \"50 Sexiest Men\" of 2013, behind his younger brother 'Liam Hemsworth' (qv).", "Has twins with his wife 'Elsa Pataky' (qv) born March 18, 2014, two sons Tristan and Sasha Hemsworth.", "The last four letters of his surname are the same letters that form his most associated on-screen character's name: Thor.", "Cousin Rob Hemsworth, an oyster farmer, competed on the sixth season of _My Kitchen Rules (2010)_ (qv), representing Victoria.", "His uncle was bushman Rod Ansell, who inspired the film _Crocodile Dundee (1986)_ (qv). Rod was married to Chris's aunt (Chris's mother's sister), Joanne van Os, who is an author.", "Is incredibly close with his _Thor (2011)_ (qv) on-screen brother 'Tom Hiddleston' (qv), Chris has said Tom is an honorary Hemsworth and has been adopted into the family.", "Currently resides in Byron Bay, New South Wales, Australia.", "Chosen as People magazine's Sexiest Man Alive (2014).", "Paid off the mortgage on his father's house with his earnings from 'Cabin in the Woods' (2011)."], "quotes": ["I love the adventure that comes with this work, the travel and all that. But also the craft, the storytelling. From a kid, I remember enjoying certain books and getting swept away in movies.", "[on life in the Australian Outback] It's beautiful up there in the Northern Territory. My earliest memories are of buffalo and crocodiles. As a kid, you don't own a pair of shoes because it's too hot!", "[In an appearance at San Diego Comic-Con on July 26, 2014, noting that, in the paper Marvel Universe, the new Thor will be a woman] I don't want to speak too early and jinx it, but I think that could be my Oscar.", "Everything shifted for me after _Rush (2013)_ (qv). It wasn't as financially successful as other things I'd done, but it gave me more movement, more options, more doors opening, more meetings. All of a sudden, it's \"Oh, wow! You're an actor!\".", "I remember how differently people treated me when things went well. Some directors and producers who never gave a shit - at best, they would have given me a sideways glance - next time I saw them, they're my best friend. That's gross.", "[on the paparazzi] When I'm with my kids, and someone is scaring my kids - which is what they will do - that gets me fired up. The hairs on the back of my neck stand up. I get hot. I get flustered. And in the States, they're there, 24/7, at the gate, six feet away when you take out the rubbish. Nah mate, you don't have the right to do that. I don't give a fuck what anyone says - you're not a bonus to my career."], "salary history": ["_Snow White and the Huntsman (2012)_ (qv)::$5,000,000", "_Avengers: Age of Ultron (2015)_ (qv)::$5,000,000 + % back-end", "_The Huntsman: Winter's War (2016)_ (qv)::$10,000,000 +", "_Thor: Ragnarok (2017)_ (qv)::$15,000,000", "_Avengers: Infinity War (2018)_ (qv)::$15,000,000", "_Avengers: Endgame (2019)_ (qv)::$15,000,000"], "birth date": "1983-08-11", "birth notes": "Melbourne, Victoria, Australia", "_actorID": "8", "_source": "IMDB", "actorID": "1165110", "created_utc_dt": "09/14/2019, 13:01:18"}