{"headshot": "https://m.media-amazon.com/images/M/MV5BMjA1MTQ3NzU1MV5BMl5BanBnXkFtZTgwMDE3Mjg0MzE@._V1_UY98_CR15,0,67,98_AL_.jpg", "birth name": "William John Neeson", "height": "6' 4\" (1.93 m)", "mini biography": ["'Liam Neeson' (qv) was born on June 7, 1952 in Ballymena, Northern Ireland, to Katherine (Brown), a cook, and Bernard Neeson, a school caretaker. He was raised in a Catholic household. During his early years, Liam worked as a forklift operator for Guinness, a truck driver, an assistant architect and an amateur boxer. He had originally sought a career as a teacher by attending St. Mary's Teaching College, Newcastle. However, in 1976, Neeson joined the Belfast Lyric Players' Theater and made his professional acting debut in the play \"The Risen People\". After two years, Neeson moved to Dublin's Abbey Theater where he performed the classics. It was here that he was spotted by director 'John Boorman' (qv) and was cast in the film _Excalibur (1981)_ (qv) as Sir Gawain, his first high-profile film role.Through the 1980s Neeson appeared in a handful of films and British TV series - including _The Bounty (1984)_ (qv), _A Woman of Substance (1984)_ (qv), _The Mission (1986)_ (qv), and _Duet for One (1986)_ (qv) - but it was not until he moved to Hollywood to pursue larger roles that he began to get noticed. His turn as a mute homeless man in _Suspect (1987)_ (qv) garnered good reviews, as did supporting roles in _The Good Mother (1988)_ (qv) and _High Spirits (1988)_ (qv) - though he also starred in the best-to-be-forgotten _Satisfaction (1988)_ (qv), which also featured a then-unknown 'Julia Roberts' (qv) - but leading man status eluded him until the cult favorite _Darkman (1990)_ (qv), directed by 'Sam Raimi' (qv). From there, Neeson starred in _Under Suspicion (1991)_ (qv) and _Ethan Frome (1993)_ (qv), was hailed for his performance in 'Woody Allen' (qv)'s _Husbands and Wives (1992)_ (qv), and ultimately was picked by 'Steven Spielberg' (qv) to play 'Oskar Schindler' (qv) in _Schindler's List (1993)_ (qv). The starring role in the Oscar-winning Holocaust film brought Neeson Academy Award, BAFTA and Golden Globe nominations for Best Actor.Also in 1993, he made his Broadway debut with a Tony-nominated performance in \"Anna Christie\", in which he co-starred with his future wife 'Natasha Richardson' (qv). The next year, the two also starred opposite 'Jodie Foster' (qv) in the movie _Nell (1994)_ (qv), and were married in July of that year. Leading roles as the 18th century Scottish Highlander _Rob Roy (1995)_ (qv) and the Irish revolutionary leader 'Michael Collins' (qv) (1996) followed, and soon Neeson was solidified as one of Hollywood's top leading men. He starred in the highly-anticipated _Star Wars: Episode I - The Phantom Menace (1999)_ (qv) as Qui-Gon Jinn, received a Golden Globe nomination for _Kinsey (2004)_ (qv), played the mysterious Ducard in 'Christopher Nolan' (qv)'s _Batman Begins (2005)_ (qv), and provided the voice for Aslan in _The Chronicles of Narnia: The Lion, the Witch and the Wardrobe (2005)_ (qv).Neeson found a second surprise career as an action leading man with the release of _Taken (2008)_ (qv) in early 2009, an unexpected box office hit about a retired CIA agent attempting to rescue his daughter from being sold into prostitution. However, less than two months after the release of the film, tragedy struck when his wife 'Natasha Richardson' (qv) suffered a fatal head injury while skiing and passed away days afterward. Neeson returned to high-profile roles in 2010 with two back-to-back big-budget films, _Clash of the Titans (2010)_ (qv) and _The A-Team (2010)_ (qv), and returned to the action genre with _Unknown (2011)_ (qv), _The Grey (2011)_ (qv), _Battleship (2012)_ (qv) and _Taken 2 (2012)_ (qv), as well as the sequel _Wrath of the Titans (2012)_ (qv).Neeson was awarded Officer of the Order of the British Empire in the 1999 Queen's New Year's Honours List for his services to drama. He has two sons from his marriage to Richardson: Micheal Richard Antonio Neeson (born June 22, 1995) and Daniel Jack Neeson (born August 27, 1996).::Tony Fontana <tony.fontana@spacebbs.com>"], "spouse": ["'Natasha Richardson' (qv)::(3 July 1994 - 18 March 2009) ( her death) ( 2 children)"], "trade mark": ["Often takes roles in which he is a mentor/trainer/father figure to a younger man, as in, for example, _Batman Begins (2005)_ (qv), _Kingdom of Heaven (2005)_ (qv), _Gangs of New York (2002)_ (qv), and _Star Wars: Episode I - The Phantom Menace (1999)_ (qv). His character often dies early in the film and/or the student's life so that the young man can apply the Neeson character's lessons to his own ongoing struggle", "Frequently portrays real people (e.g. Rob Roy, 'Oskar Schindler' (qv), 'Michael Collins' (qv), 'Alfred Kinsey' (qv), 'Mark Felt' (qv))", "Towering height", "Deep gravelly voice", "Northern Irish accent, sometimes with a mid-Atlantic lilt", "Often plays agents or ex-agents in an unusual situation"], "trivia": ["Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#74) (1995).", "He was awarded the OBE (Officer of the Order of British Empire) in the 2000 Queen's Millennium Honours List for his services to drama.", "Has two sons with 'Natasha Richardson' (qv): Micheál Richard Antonio Neeson (born June 22, 1995) and Daniel Jack Neeson (born August 27, 1996).", "Was a boxer as a teenager in Northern Ireland, which resulted in getting his nose broken at age 15. Nevertheless, he went on to win the Irish Youth Championship. However, a brief blackout after one of his fights caused him to give up the ring for good.", "Won a libel case against newspapers that claimed that his marriage was in trouble. [October 1998]", "Ranked #69 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "First worked with his future wife, actress 'Natasha Richardson' (qv), on the miniseries _Ellis Island (1984)_ (qv).", "Son-in-law of actress 'Vanessa Redgrave' (qv) and 'Tony Richardson' (qv).", "Was considered for the role of James Bond in _GoldenEye (1995)_ (qv), which went to 'Pierce Brosnan' (qv).", "Attended Queen's University of Belfast for a short while to study physics and computer science, but flunked out.", "Brother-in-law of 'Joely Richardson' (qv), 'Carlo Gabriel Nero' (qv) and 'Katherine Grimond' (qv).", "Was connected to 'David Lean' (qv)'s production of \"Nostromo,\" but withdrew before preproduction began and Lean's subsequent death.", "He was considered for the role of Van Helsing in _Bram Stoker's Dracula (1992)_ (qv) (and reportedly very much wanted the role). However, he was turned down after 'Anthony Hopkins' (qv) showed an interest in the role and ultimately got the role.", "Has worked repeatedly with 'Laura Linney' (qv), including in _Kinsey (2004)_ (qv), _Love Actually (2003)_ (qv), and in a Broadway revival of \"The Crucible\", playing husband and wife in _Kinsey (2004)_ (qv) and \"The Crucible\". The two have joked about feeling like \"an old married couple\".", "Wanted to be in _Star Wars: Episode I - The Phantom Menace (1999)_ (qv) so badly, he did not even bother reading the script.", "Attended and graduated from the Gaiety School of Drama in Dublin, Ireland.", "Is a member of the Dublin Shakespeare Theatre Festival, where his past credits include \"Hamlet\", \"King Richard II\" and \"All's Well That Ends Well\".", "He recalled his most embarrassing moment in acting as when, relatively early in his career, he auditioned for the role of Fezzik, the giant in _The Princess Bride (1987)_ (qv). Director 'Rob Reiner' (qv) had a look of disgust on his face when he realized that Neeson was \"only\" six-feet-four. 'André the Giant' (qv) ended up getting the role.", "Was chosen for the role of Gawain in _Excalibur (1981)_ (qv) primarily because director 'John Boorman' (qv) wanted a large man in the role for the duel between Gawain and Lancelot ('Nicholas Clay' (qv)). It was on this film where he met 'Helen Mirren' (qv), who was playing Morgana.", "Auditioned for, and was accepted by, the Bristol Old Vic Drama School in England, but decided to attend the Gaiety School of acting instead so he could stay active with the Dublin Shakespeare Festival while in school.", "Was an honorary board member of the CDS (Conference of Drama Schools) in England, which also included Sir 'Anthony Hopkins' (qv), 'Brian Cox' (qv), 'Richard Harris' (qv), 'Peter O'Toole' (qv) and 'Jeremy Irons' (qv), to name a few. The board oversaw all drama schools in England.", "During the 1990s, he was very active with the Royal National Theatre in London, where he performed a wide range of Shakespeare's works.", "Was twice nominated for Broadway's Tony Award as Best Actor (Play): in 1993 for a revival of 'Eugene O'Neill' (qv)'s \"Anna Christie\", and in 2002 for a revival of 'Arthur Miller' (qv)'s \"The Crucible\".", "It was his role in _Shining Through (1992)_ (qv) as a high Nazi party official that got him noticed by 'Steven Spielberg' (qv), and that eventually led to him being cast as 'Oskar Schindler' (qv) in _Schindler's List (1993)_ (qv).", "_Schindler's List (1993)_ (qv) is ranked #3 on the American Film Institute's 100 Most Inspiring Movies of All Time.", "Was 'Oliver Stone' (qv)'s first choice for the role of King Philip of Macedonia in _Alexander (2004)_ (qv), which went to 'Val Kilmer' (qv).", "Was considered for the role of Count Dracula in the cult classic _The Monster Squad (1987)_ (qv), which went to 'Duncan Regehr' (qv).", "In an interview with the BBC, he said that Northern Irish Protestant minister Ian Paisley influenced his decision to become an actor. Neeson used to sneak into the church in his hometown, Ballymena, and watch Paisley preach. \"He had a magnificent presence and it was incredible to watch this six-foot-plus man just Bible-thumping away. It was acting but it was also great acting and stirring too\".", "On March 16, 2009, his wife 'Natasha Richardson' (qv) suffered a brain injury in a skiing accident. On March 18, 2009, she died in a hospital. Liam interrupted filming of his movie _Chloe (2009)_ (qv) to be by her side.", "Received an honorary doctorate from his alma mater, Queen's University of Belfast, at the British consulate on May 6, 2009, in New York.", "Friends with 'Ralph Fiennes' (qv), 'Henry Herman' (qv) and 'Ciarán Hinds' (qv).", "Appeared with 'Daniel Day-Lewis' (qv) in _The Bounty (1984)_ (qv) and _Gangs of New York (2002)_ (qv). Neeson later appeared on stage as John Proctor in a 2002 production of \"The Crucible,\" a role played by Day-Lewis in the 1996 film version of the play. After dropping out of 'Steven Spielberg' (qv)'s biography of Abraham Lincoln, Neeson was replaced by Day-Lewis.", "Regarding some rumors saying that he \"felt like a puppet while working on _Star Wars: Episode I - The Phantom Menace (1999)_ (qv),\" Neeson said, \"That's simply not true,\" and that he had \"absolutely no misgivings\" about being in \"Star Wars,\" adding that Lucas was \"very good\" to work with. \"He was clear about what he wanted,\" said Neeson.", "Neeson is a National Goodwill Ambassador to Ireland.", "Is a huge fan of boxing and said that 'Muhammad Ali' (qv) was the most famous boxer he ever met. Was an amateur boxer, a sport he started participating in at the age of 9. He had his last fight at age 17.", "Originally planned to become a teacher before discovering acting.", "Started acting in his early twenties, upon joining the Belfast Lyric Players' theater.", "Admitted in 2014 that he had to quit alcohol, after having began to quietly drink heavily following 'Natasha Richardson' (qv)'s death in 2009, and eventually drinking up to two to three bottles of wine per night.", "As of 2015, he has appeared in three films that were nominated for the Best Picture Oscar: _The Mission (1986)_ (qv), _Schindler's List (1993)_ (qv) and _Gangs of New York (2002)_ (qv). Of those, _Schindler's List (1993)_ (qv) is the only one to have won the award.", "For a couple of years, he was the original choice to play the lead role in _Lincoln (2012)_ (qv), which would reunite his partnership with 'Steven Spielberg' (qv) after their massive success with _Schindler's List (1993)_ (qv). However, due to the many delays with the filming, Neeson felt he was too old for the role and he turned down, which went to 'Daniel Day-Lewis' (qv), who won his third Oscar for the role.", "He has two roles in common with his _The Bounty (1984)_ (qv) co-star 'Laurence Olivier' (qv): (1) Olivier played Zeus in _Clash of the Titans (1981)_ (qv) while Neeson played him in the remake _Clash of the Titans (2010)_ (qv) and its sequel _Wrath of the Titans (2012)_ (qv) and (2) Olivier played General 'Douglas MacArthur' (qv) in _Inchon (1981)_ (qv) while Neeson played him in _Battle for Incheon: Operation Chromite (2016)_ (qv).", "His character, Jedi Master Qui-Gon Jinn, was trained by Count Dooku, who was played by 'Christopher Lee' (qv). Lee ended up passing away on Neeson's birthday, June 7.", "Was scheduled to produce a television mini series based on the early years of the IRA based on the Leon Uris book Trinity.", "After first meeting on the set of _Excalibur (1981)_ (qv), Liam and 'Helen Mirren' (qv) lived together for 4 years, after which time Helen met husband-to-be 'Taylor Hackford' (qv) when he directed her in _White Nights (1985)_ (qv).", "One of his oldest and dearest friends is Irish actor 'Ciarán Hinds' (qv), both having met as struggling actors on the set of _Excalibur (1981)_ (qv).", "Dated 'Barbra Streisand' (qv) in 1991.", "Is a longtime supporter of the legalization of abortion in Ireland."], "quotes": ["I never did think of myself as handsome--terribly attractive, yes, but not handsome.", "I think I realized there were two communities in Northern Ireland when I was about nine or 10, not because there was any trouble but because in certain years my parents would keep us indoors on the 12th of July. I couldn't figure that out, because all my mates were out dancing in the streets and I wanted to go out and join them. So it was then that I sensed a \"them and us\" attitude.", "No, I don't get obsessed with acting. Because in the past when I have got obsessed about it, it really got in the way of the creative process. I've learned to hang the character on the coat-peg at the end of the day, and when I leave in the morning I pick it up again. And I had to work at that because the other way lies a strange sort of madness.", "Laid-back? My wife said that? Well, I guess I am. It takes a lot to get me riled.", "[on the widespread unemployment of actors and their fear of it] The truth is I love the insecurity part of it, it keeps me on my toes. I think you become bland and predictable without the stress and angst. There's a certain lethargy that sets in.", "Before _Schindler's List (1993)_ (qv), I wouldn't have believed movies had a lot of power for social change. But having seen what happened with \"Schindler's List\", and touring the world with it, it really made me realize the power of images.", "Some mornings you wake up and think, \"Gee, I look handsome today.\" Other days I think, \"What am I doing in the movies? I wanna go back to Ireland and drive a forklift\".", "Acting is invigorating. But I don't analyze it too much. It's like a dog smelling where it's going to do its toilet in the morning.", "In Los Angeles, it's like they jog for two hours a day and then they think they're morally right. That's when you want to choke people, you know?", "I grew up in Northern Ireland, of course. Lived all through the Troubles; saw violence, the results of violence, at first hand. It's always terrified me and fascinated me. So it was a gut reaction, something about how that rage can eat you alive. I can understand that. I haven't known it myself, but I knew guys who did. Some of them aren't on this planet any more because of it.", "(on the state of his family after the death of 'Natasha Richardson' (qv)) We're doing good. To be honest, we're taking each day as it comes.", "[on performing with 'Ralph Fiennes' (qv)] On _Clash of the Titans (2010)_ (qv) we found it hard to act with each other. So I would look at his forehead and he would look at my forehead, because sometimes, if we made eye contact, it got quite silly. We were more restrained on _Wrath of the Titans (2012)_ (qv) because we had deeper, darker issues to act.", "Even with action films, the fundamental for me is the writing. I adore writers, no matter what the genre is, and if it is a well-written piece of material then I am always very interested.", "Just look at the success of _Taken (2008)_ (qv), for example. I thought it was going to be a straight-to-video release. That is actually one of the reasons I did it, to be honest. I felt like spending three months in Paris, I'd get to do all this physical stuff that no one would think of me for, and that the film would go straight to video. Then it became this big success. I was a tiny bit embarrassed by it, a tiny bit, but then people started sending me action scripts.", "_Schindler's List (1993)_ (qv) is a very special movie on lots of fronts. It was a brilliant script and it was great to work with 'Steven Spielberg' (qv): I formed a close relationship with him.", "[on _Darkman (1990)_ (qv)] [The film] has rabid fans, especially in the black community, I've found. It's always the black dudes who are stopping me and giving me a high five. I saw _Spider-Man (2002)_ (qv), and a lot of it was shot-for-shot Darkman.", "[on _Schindler's List (1993)_ (qv)] I did a lot of research, but I found it was best not to do too much because I was playing a guy who lived in 1942, '43. If I'd read all the Holocaust literature, it would have played into my performance. Ignorance was bliss, certainly for Schindler.", "[on _Nell (1994)_ (qv)] I was a bit disappointed in the film. I felt it should have been rougher and cruder and darker and colder. There was too much of a glow surrounding the movie. I thought Jodie [Foster] was very good, but, I mean, that house she lived in, that was, like, something out of Swiss Family Robinson! There should have been plastic chairs and windows with bits of newspaper stuck in them to stop the draft.", "[on working with 'Julia Roberts' (qv) in 'Michael Collins' (qv) (1996)] I was surprised at first [when she was cast]. I thought, surely there's an actress in Ireland who can [play the role]; Neil [Jordan] doesn't need this star power. I thought maybe he was going to shoot himself in the foot. But she was very committed to doing it. I thought she was terribly good and I was very proud of her.", "[on _Gangs of New York (2002)_ (qv)] Martin [Scorsese] was interested in me for the part of Monk, that Brendan Gleeson played. But when I read it, I said, \"No, I want to play this Priest Vallon character. It's a showier part.\" It was the perfect cameo, I think. You come in, do a bit of physical stuff, and then they talk about you for the rest of the movie. Meanwhile, I'm back home with my wife and kids, and they're still talking about me. It's great!", "[on losing the role of _Lincoln (2012)_ (qv)] I don't feel sad about it, and I have no regrets whatsoever. There comes a point where you think \"I'm past my sell-by date\" and I passed that about three years ago. It's just like a light switch went off in my head: it just wasn't for me anymore. I'd lived with it too long and there was a process happening: Steven ['Steven Spielberg' (qv)] would do something else or I would do something else and it was like \"Okay, let's cut this loose.\" They got one of the best actors to do it, you know, in 'Daniel Day-Lewis' (qv).", "[on _The A-Team (2010)_ (qv)] I watched it about two months ago and I found it a little confusing and I was in the thing. I just couldn't figure out who was who and what's been done to him and why, a little bit. I mean, my kids totally understood it and got it. I don't know. It's a toss of the coin, sometimes, with these things. I thought it was a great ride and Joe ['Joe Carnahan' (qv)] had done a great job. I thought it was cast well. But there you go - you never know.", "I am attracted to characters who are loners, who operate by themselves. There's something mysterious, manly and stoic about them.", "[on director 'Martin Scorsese' (qv)] He's intimidating. He requires absolute silence on the set - if he hears one tiny sound, it shatters it for him.", "Action heroes used to be for much younger men, but now I get all these scripts where it's, 'Scratch 35, and now it's 60'!'", "[2014] I'm keeping myself to myself. And I like it that way. I'm not hunting. I'm the opposite of a - what would a male cougar be? Is there such a thing? Whatever it is, I'm not that.", "[on 'Ralph Fiennes' (qv)] He's one of my closest friends. He's very into yoga and I do bits of that with him. We hike and walk and talk a lot.", "[after being insulted by 'Steven Seagal' (qv)] I want to know who dyed his hair. Stevie Wonder?"], "salary history": ["_Schindler's List (1993)_ (qv)::$1,500,000", "_Star Wars: Episode I - The Phantom Menace (1999)_ (qv)::$2,500,000", "_K-19: The Widowmaker (2002)_ (qv)::$3,000,000", "_Gangs of New York (2002)_ (qv)::$2,000,000", "_Love Actually (2003)_ (qv)::$250,000", "_Batman Begins (2005)_ (qv)::$2,000,000", "_Taken (2008)_ (qv)::$5,000,000", "_Clash of the Titans (2010)_ (qv)::$5,000,000", "_Wrath of the Titans (2012)_ (qv)::$7,000,000", "_Battleship (2012)_ (qv)::$10,000,000", "_Taken 2 (2012)_ (qv)::$15,000,000", "_Non-Stop (2014)_ (qv)::$20,000,000", "_Taken 3 (2014)_ (qv)::$20,000,000"], "birth date": "1952-06-07", "birth notes": "Ballymena, Co. Antrim, Northern Ireland, UK", "_actorID": "36", "_source": "IMDB", "actorID": "0000553", "created_utc_dt": "09/14/2019, 13:01:45"}