{"headshot": "https://m.media-amazon.com/images/M/MV5BNTYzMjc2Mjg4MF5BMl5BanBnXkFtZTcwODc1OTQwNw@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Robin McLaurin Williams", "height": "5' 7\" (1.7 m)", "mini biography": ["Robin McLaurin Williams was born on Saturday, July 21st, 1951, in Chicago, Illinois, a great-great-grandson of Mississippi Governor and Senator, Anselm J. McLaurin. His mother, Laurie McLaurin (née Janin), was a former model from Mississippi, and his father, Robert Fitzgerald Williams, was a Ford Motor Company executive from Indiana. Williams had English, German, French, Welsh, Irish, and Scottish ancestry.Robin briefly studied political science at Claremont Men's College and theater at College of Marin before enrolling at The Juilliard School to focus on theater. After leaving Juilliard, he performed in nightclubs where he was discovered for the role of \"Mork, from Ork\", in an episode of _Happy Days (1974)_ (qv). The episode, _Happy Days: My Favorite Orkan (1978)_ (qv), led to his famous spin-off weekly TV series, _Mork & Mindy (1978)_ (qv). He made his feature starring debut playing the title role in _Popeye (1980)_ (qv), directed by 'Robert Altman' (qv).Williams' continuous comedies and wild comic talents involved a great deal of improvisation, following in the footsteps of his idol 'Jonathan Winters' (qv). Williams also proved to be an effective dramatic actor, receiving Academy Award nominations for Best Actor in a Leading Role in _Good Morning, Vietnam (1987)_ (qv), _Dead Poets Society (1989)_ (qv), and _The Fisher King (1991)_ (qv), before winning the Academy Award for Best Actor in a Supporting Role in _Good Will Hunting (1997)_ (qv).During the 1990s, Williams became a beloved hero to children the world over for his roles in a string of hit family-oriented films, including _Hook (1991)_ (qv), _FernGully: The Last Rainforest (1992)_ (qv), _Aladdin (1992)_ (qv), _Mrs. Doubtfire (1993)_ (qv), _Jumanji (1995)_ (qv), _Flubber (1997)_ (qv), and _Bicentennial Man (1999)_ (qv). He continued entertaining children and families into the 21st century with his work in _Robots (2005)_ (qv), _Happy Feet (2006)_ (qv), _Night at the Museum (2006)_ (qv), _Night at the Museum: Battle of the Smithsonian (2009)_ (qv), _Happy Feet Two (2011)_ (qv), and _Night at the Museum: Secret of the Tomb (2014)_ (qv). Other more adult-oriented films for which Williams received acclaim include _The World According to Garp (1982)_ (qv), _Moscow on the Hudson (1984)_ (qv), _Awakenings (1990)_ (qv), _The Birdcage (1996)_ (qv), _Insomnia (2002)_ (qv), _One Hour Photo (2002)_ (qv), _World's Greatest Dad (2009)_ (qv), and _Boulevard (2014)_ (qv).On Monday, August 11th, 2014, 'Robin Williams' (qv) was found dead at his home in Tiburon, California USA, the victim of an apparent suicide, according to the Marin County Sheriff's Office. A 911 call was received at 11:55 a.m. PDT, firefighters and paramedics arrived at his home at 12:00 p.m. PDT, and he was pronounced dead at 12:02 p.m. PDT.::Ray Hamel and TrekFan1"], "spouse": ["'Susan Schneider' (qv)::(22 October 2011 - 11 August 2014) ( his death)", "'Marsha Garces Williams' (qv)::(30 April 1989 - 2010) ( divorced) ( 2 children)", "'Valerie Velardi' (qv)::(4 June 1978 - 6 December 1988) ( divorced) ( 1 child)"], "trade mark": ["Wild improvised stream-of-consciousness comedy dialogue where he would do cultural references, impersonations and one-liners with rapid switching.", "Unique skill at imitating voices", "Frequently played offbeat and eccentric characters", "Frequently played fathers or family men", "Often played characters lacking in self-awareness", "Often played men who have suffered a trauma or loss", "Often played characters with mental instability and/or a deep capacity for violence (One Hour Photo, Insomnia)", "Distinctive low-pitched (and extremely versatile) voice", "Clean shaven in comedies and bearded in dramatic films", "Humble and softspoken"], "trivia": ["He moved to San Francisco, CA, when he was 16.", "He studied acting briefly at The Juilliard School under 'John Houseman' (qv). Houseman told him he was wasting his talent at Juilliard and he should strike out on his own and do stand-up comedy.", "He resided with his family in San Francisco's Seacliff neighborhood for many years. before moving to San Francisco suburb of Tiburon in the 2000s, just across the Golden Gate Bridge in Marin County, CA.", "He was set to play 'Drew Barrymore' (qv)'s father in _Home Fries (1998)_ (qv) and had the role during production, but pulled out of the part days before his scenes were to be shot.", "In October 1997 he was ranked #63 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list.", "In 1997 he was voted funniest man alive by Entertainment Weekly.", "When he auditioned for the role of Mork from Ork on _Happy Days (1974)_ (qv), producer 'Garry Marshall' (qv) told him to sit down. Williams immediately sat on his head on the chair. Marshall hired him, saying that he was the only alien who auditioned.", "During the making of _Mork & Mindy (1978)_ (qv), he departed from the scripts and ad-libbed so many times and so well that the producers stopped trying to make him stick to the script and deliberately left gaps in the later scripts, leaving only \"Mork can go off here\" in those places so he could improvise.", "He released the album: \"Reality... What a Concept\" on Casablanca Records (1979).", "He was set to appear in _Star Trek: The Next Generation: A Matter of Time (1991)_ (qv), as the time traveler Prof. Berlinghoff Rasmussen, but a schedule conflict with _Hook (1991)_ (qv) forced him to drop out (the role eventually went to 'Matt Frewer' (qv)). He was inspired to seek a Trek role by his friend, 'Whoopi Goldberg' (qv), who had a recurring role on the series as the bartender Guinan.", "He was a huge fan of the sport of Rugby Union, and in particular New Zealand All Black star 'Jonah Lomu' (qv), who flew to San Francisco and gifted him with a signed All Black jersey. On a recent visit to New Zealand they were reunited on national television, Williams accepting another All Black jersey--except this time it had Jonah's #11 on the back.", "For his first year of college he attended Claremont Men's College (renamed Claremont McKenna College in 1981), in Claremont, California with the intent to study political science. While there he played soccer and took an improvisational theater class because it was the only one open to both men and students from the nearby women's school, Pitzer College. Both colleges later became coeducational in the 1970s. He soon stopped going to the political science classes and his father said he would no longer pay for college so Williams returned home and studied theater at College of Marin junior college in Marin County. He later transferred to The Juilliard School in New York City.", "In 1998 he was listed by Entertainment Weekly as one of the 25 Best Actors.", "He was a huge fan of the BBC comedy series _Monty Python's Flying Circus (1969)_ (qv). The admiration was mutual. Paying tribute after his death, 'Michael Palin' (qv) said that Williams was \"up there\" with his all-time heroes, 'Spike Milligan' (qv) and 'Peter Cook' (qv), and performing with him \"would have been like being invited to play in a jazz band when you couldn't play an instrument\". However, Palin also added that Williams was \"possessed\" by \"the devil of comedy\", which he said \"must have been hard to live with\".", "He studied at The Juilliard School with actor 'Christopher Reeve' (qv). The two remained good friends until Reeve's death in 2004.", "He enjoyed cycling and occasionally trained with 'Lance Armstrong' (qv).", "After having won the Academy Award for _Good Will Hunting (1997)_ (qv), he sent 'Peer Augustinski' (qv) (who was his standard German dubbing voice) a little Oscar replica with a note: \"Thank you for making me famous in Germany.\".", "He graduated from Redwood High School in Larkspur, CA, north of San Francisco. Other famous alumni from Redwood include 'Gabrielle Carteris' (qv) (_Beverly Hills, 90210 (1990)_ (qv)) and 'Erin Gray' (qv) (Kate Summers from _Silver Spoons (1982)_ (qv)), and Jason Branson, radio talk show guest/therapist and author.", "In 2003, he won Grammy Award for Best Spoken Comedy Album for \"'Robin Williams' (qv) - Live 2002\".", "In 1980, hit #104 on the Billboard Singles Charts with \"I Yam What I Yam\" (Boardwalk 5701).", "In 2003 he was ranked #7 in Star TV's Top 10 Box Office Stars of the 1990s.", "He reached a unique milestone by having two of his films reach the $100-million mark in the US exactly the same week: _Jumanji (1995)_ (qv) and _The Birdcage (1996)_ (qv). [1996]", "He was voted \"Least Likely to Succeed\" by his fellow graduates at Larkspur.", "Early in his career he told a reporter that he was born in Scotland. His original press releases indeed listed Scotland as his place of birth. He admitted that he was \"under the influence\" at the time he said this. He was really born in Chicago.", "He was voted the 50th Greatest Movie Star of all time by Entertainment Weekly.", "One week after 'Christopher Reeve' (qv)'s tragic horse-riding accident, Williams visited him in the hospital. However, he was dressed from head to toe in scrubs, spoke with a Russian accent, and had a surgical mask on. He was acting as if he was a real doctor and did a bunch of wacky antics. After he took off his mask, Reeve stated, \"That was the first time he laughed since the accident!\".", "When \"Blame Canada\", a song from _South Park: Bigger, Longer & Uncut (1999)_ (qv), was nominated for a Best Song Academy Award, it was Williams who performed the song at the ceremony because the actress who sang the song in the film, 'Mary Kay Bergman' (qv), had committed suicide a few months prior to the awards show. Sadly, Williams himself would also commit suicide fifteen years later.", "He was considered for the role of Joe Miller in 'Jonathan Demme' (qv)'s _Philadelphia (1993)_ (qv), which went to 'Denzel Washington' (qv).", "He was an active supporter of the Democratic Party and had been outspoken about his opposition to the war in Iraq. However, he became the most consistent entertainer of U.S. troops since the war began, leading some to dub him the new 'Bob Hope' (qv).", "He had been seen playing paintball at public reservations near his Northern California residences.", "He was a very overweight child. As a result, nobody would play with him. He started talking in different voices to entertain himself.", "In 2004 he dedicated his winning the 'Cecil B. DeMille' (qv) Award at the Golden Globe 'Awards' (qv) to his good friend 'Christopher Reeve' (qv).", "Most of his dialogue in _Aladdin (1992)_ (qv) was ad-libbed.", "He was a guest on 'Johnny Carson' (qv)'s next to last episode of The Tonight Show Starring 'Johnny Carson' (qv) (1962), along with 'Bette Midler' (qv).", "He had English, French, German, Irish, Scottish and Welsh ancestry.", "He and his _Being Human (1994)_ (qv) and _Robots (2005)_ (qv) castmate 'Ewan McGregor' (qv) have both shared a role with 'Alec Guinness' (qv). McGregor, of course, played the young Obi-Wan Kenobi in the Star Wars prequels. Williams appeared in 'Kenneth Branagh' (qv)'s _Hamlet (1996)_ (qv), as Osric, a role that Guinness had played on stage opposite 'John Gielgud' (qv). Williams also shares that role with another Star Wars series actor, 'Peter Cushing' (qv), who played the same role in the same year in the film, opposite 'Laurence Olivier' (qv).", "He co-owned the Rubicon Restaurant in San Francisco with 'Robert De Niro' (qv) and fellow Bay area resident 'Francis Ford Coppola' (qv).", "In 1993, he wrote the foreword to 'Gary Larson' (qv)'s book, \"The Far Side: Gallery 4\".", "Though he was highly regarded for his ability to perform numerous different voices, he only lent his voice to six animated features: _FernGully: The Last Rainforest (1992)_ (qv), _Aladdin (1992)_ (qv), _Aladdin and the King of Thieves (1996)_ (qv), _Robots (2005)_ (qv), _Happy Feet (2006)_ (qv) and _Happy Feet Two (2011)_ (qv). However, he did voice-over work for a cartoon on _Mrs. Doubtfire (1993)_ (qv), played a small role in the animated short _A Wish for Wings That Work (1991)_ (qv), and had done narration for different rides and attractions at Disney World. He has also done the voice for the character \"Doctor Know\" in the movie _A.I. Artificial Intelligence (2001)_ (qv), which was not an animated movie.", "Half-brother of 'McLaurin Smith' (qv).", "In 1976 he performed at the opening of the San Francisco Comedy Competition against 'Dana Carvey' (qv), 'Harry Anderson' (qv) and 'A. Whitney Brown' (qv).", "He was a huge fan of _Doctor Who (1963)_ (qv) and _Star Trek (1966)_ (qv).", "He invented the curse word \"Shazbot\", first heard on the situation comedy _Mork & Mindy (1978)_ (qv) (in which Mork says the expression during the opening credits). Later it was used in _The Simpsons: Treehouse of Horror VI (1995)_ (qv). In 1998 it was used as a voice chat option in the very popular \"Starsiege Tribes\" game and was carried over into the sequels \"Tribes 2\" and \"Tribes: Vengeance\". \"Shazbot, nano nano\" also remain the last recorded words of the legendary former singer of 'AC/DC' (qv) 'Bon Scott' (qv).", "He considered 'Jonathan Winters' (qv) and 'Richard Pryor' (qv) his comedic idols.", "He was offered the role of The Riddler in _Batman Forever (1995)_ (qv), which eventually went to 'Jim Carrey' (qv).", "He was considered for the role of Bobby Wheeler in the situation comedy _Taxi (1978)_ (qv), which went to 'Jeff Conaway' (qv).", "He was the second choice for the role of Frank Ginsberg in _Little Miss Sunshine (2006)_ (qv), which went to 'Steve Carell' (qv).", "In 1993 was turned down for a Best Actor in a Supporting Role Academy Award nomination in for his performance in _Aladdin (1992)_ (qv), because he only voiced the Genie.", "He liked computer games and video games.", "He owned a home and vineyard in Northern California's St. Helena district, hence the quip, \"I love the smell of Napa in the morning.\" Not-too-distant neighbors included football legend 'Joe Montana' (qv) (Calistoga) and filmmaker 'Francis Ford Coppola' (qv) (Rutherford), both of whom run their own vineyards.", "Williams and 'Robert De Niro' (qv) were the last stars to see 'John Belushi' (qv) alive, albeit on separate visits to Bungalow #3 of the Chateau Marmont Hotel in Los Angeles on the day Belushi died of a drug overdose in March 1982.", "Asked by 'James Lipton' (qv) about what he would like to God say when he arrived in heaven, Williams answered that \"There is a seat in the front\" in the concert of 'Wolfgang Amadeus Mozart' (qv) and 'Elvis Presley' (qv).", "He was invited to the party 'Steve Martin' (qv) was throwing that turned out to be his wedding.", "He was one of the few celebrities to have a segment on _Sesame Street (1969)_ (qv) that did not have any puppets or actors playing \"Sesame Street\" regular characters.", "He had played both a fictional President in _Man of the Year (2006)_ (qv) and a real-life one in _Lee Daniels' The Butler (2013)_ (qv).", "He and his former second wife, 'Marsha Garces Williams' (qv), frequently visited Australia during their holidays.", "He met second wife 'Marsha Garces Williams' (qv) when she was nanny for his and first wife 'Valerie Velardi' (qv)'s son, 'Zak Williams' (qv).", "He lived in San Francisco, Tiburon and Napa, CA.", "He spoke French fluently.", "He was voted \"Most Humorous\" and \"Least likely to succeed\" in school.", "In October 2008 he filed a lawsuit against Frank and Beans Productions, production company of a shelved movie called \"A Couple of Dicks\". The film was later given to Gold Circle Films and the title was changed to _Cop Out (2010)_ (qv). Williams claimed that he was to receive $6 million in \"fixed compensation\", meaning that he would receive the money whether the film was made or not.", "He checked himself into rehab to be treated for alcoholism. He had already overcome drug and alcohol addiction in the 1980s. He left rehab in September 2006.", "He recovered at the Cleveland (OH) Clinic after successful open-heart surgery on March 13, 2009, to replace his aortic valve.", "His role in _August Rush (2007)_ (qv) was modeled after the character of Fagin from _Oliver Twist (1948)_ (qv), who was played in 'David Lean' (qv)'s film by 'Alec Guinness' (qv). Guinness also played Osric in 'John Gielgud' (qv)'s theatrical production of \"Hamlet\". Williams played the role in 'Kenneth Branagh' (qv)'s film version of _Hamlet (1996)_ (qv).", "He was frequently called up by 'Steven Spielberg' (qv) when he was filming _Schindler's List (1993)_ (qv). He would put him on speaker phone so he could tell jokes to the cast and crew to cheer them up. He used his character in _Aladdin (1992)_ (qv) most of the time.", "During the course of recording the voice of Genie in _Aladdin (1992)_ (qv), Robin improvised so much they had almost 16 hours of material. He also ad-libbed so many of his lines that the movie's script was turned down for a Best Adapted Screenplay Academy Award nomination.", "He had appeared fully nude in _The Fisher King (1991)_ (qv) and _World's Greatest Dad (2009)_ (qv).", "He studied acting with Michael Howard in New York City.", "He became a vegetarian following his open heart surgery.", "He married for the third time to 'Susan Schneider' (qv), a graphic designer, on October 23, 2011, at Meadowood Resort in St. Helena, California, among friends and family.", "His great friend, Scottish comedian 'Billy Connolly' (qv), referred to Robin's hairy arms as \"Quest for Fire\" opera gloves.", "He was a huge fan of the \"Legend of Zelda\" series since the first game appeared in 1986, and even named his daughter Zelda, after the eponymous character. Both Robin and Zelda appeared in a commercial for _The Legend of Zelda: Skyward Sword (2011)_ (qv).", "He had played the same character (Mork) in three different series: _Happy Days (1974)_ (qv), _Mork & Mindy (1978)_ (qv) and _Out of the Blue (1979)_ (qv).", "He became a father for the first time at age 31 when his ex-wife 'Valerie Velardi' (qv) gave birth to their son 'Zak Williams' (qv) on April 11, 1983. He became a father for the second time at age 38 when ex-wife 'Marsha Garces Williams' (qv) gave birth to their daughter 'Zelda Williams' (qv) on July 31, 1989. He became a father for the third time at age 40 when his ex-wife Marsha gave birth to their son 'Cody Williams' (qv) on November 25, 1991.", "He had appeared with 'Billy Crystal' (qv) in four films: _In Search of Dr. Seuss (1994)_ (qv), _Hamlet (1996)_ (qv), _Fathers' Day (1997)_ (qv), _Deconstructing Harry (1997)_ (qv) and a cameo on _Friends (1994)_ (qv).", "He had worked with 'Frank Welker' (qv) in five films: _A Wish for Wings That Work (1991)_ (qv), _Aladdin (1992)_ (qv), _In Search of Dr. Seuss (1994)_ (qv), _Jumanji (1995)_ (qv) and _Aladdin and the King of Thieves (1996)_ (qv).", "He was awarded a Star on the Hollywood Walk of Fame at 6925 Hollywood Blvd. on December 12, 1990.", "As of his death in 2014, he had appeared in three films that were nominated for the Best Picture Oscar: _Dead Poets Society (1989)_ (qv), _Awakenings (1990)_ (qv) and _Good Will Hunting (1997)_ (qv).", "He was the first choice for the role of Bob Wiley in _What About Bob? (1991)_ (qv), but was forced to turn it down because he was finishing filming _The Fisher King (1991)_ (qv), at the same exact time. The role went to 'Bill Murray' (qv) instead.", "He was declared dead at 12:02 p.m. on August 11, 2014, seven minutes after a call was received by 911 operators and two minutes after paramedics arrived at his home in the unincorporated town of Tiburon, which is in Marin County, CA, just north of San Francisco. The cause was apparent suicide after a long bout with severe depression.", "Upon his death, his wife 'Susan Schneider' (qv) said, \"This morning I lost my husband and my best friend, while the world lost one of its most beloved artists and beautiful human beings. I am utterly heartbroken. On behalf of Robin's family, we are asking for privacy during our time of profound grief. As he is remembered, it is our hope the focus will not be on Robin's death, but on the countless moments of joy and laughter he gave to millions.\".", "'Mara Buxbaum' (qv) was his longtime press agent and publicist.", "On the night of his death it was announced to the UK on the BBC 'News' (qv) Channel., BBC Three had just broadcast _Family Guy: Viewer Mail #2 (2012)_ (qv), where Peter Griffin wishes that everyone was 'Robin Williams' (qv), is then struck by lightning and gets the power that everyone he touches turns into 'Robin Williams' (qv).", "He was a huge fan of the anime series Neon 'Genesis' (qv) Evangelion (1995).", "He was raised in Bloomfield Hills, MI (suburban Detroit). He attended Detroit Country Day School until his senior year of high school when his father retired from the Ford Motor Co. and moved the family to San Francisco, CA.", "Due to the seven feature films he shot in the San Francisco Bay area in the 1990s, he was made an Honorary Member of IATSE Local 16 in San Francisco.", "A statement was released by his wife 'Susan Schneider' (qv) after his death in which she said that Robin's sobriety was intact and that he was brave as he struggled with his own battles of depression, anxiety as well as early stages of Parkinson's Disease, which he was not yet ready to share publicly.", "His remains were cremated after his death and his ashes were scattered along the San Francisco Bay Area.", "His final moments were spent at his seafront home overlooking San Francisco Bay (St. Thomas Way, Tiburon, CA).", "When his _Inside the Actors Studio (1994)_ (qv) interview was being taped, a man in the audience had to be hospitalized after acquiring a hernia from laughing so hard.", "ABC 'News' (qv) ran the announcement about the family wanting their privacy to grieve on a webpage that also featured a link to a live stream of aerial footage of Williams' home. This link was removed after a campaign by outraged Twitter users.", "He slipped in phrases from his stand-up comedy into his serious movie roles, such as: \"Gravity Works,\" (from An Evening with 'Robin Williams' (qv) (1983)) in _The Fisher King (1991)_ (qv) and _FernGully: The Last Rainforest (1992)_ (qv). \"Drive her/you to China,\" in _Club Paradise (1986)_ (qv) and _The Adventures of Baron Munchausen (1988)_ (qv). \"Harder than Chinese algebra,\" in _Shrink (2009)_ (qv). Why Freud \"did enough cocaine to kill a small horse,\" in _Good Will Hunting (1997)_ (qv). \"That won't look good on a resume,\" in _Club Paradise (1986)_ (qv) and _Good Morning, Vietnam (1987)_ (qv). Referencing \"a waste processing plant next to a recreation area\" in _Bicentennial Man (1999)_ (qv). Referencing tattoos of Chinese/Kanji symbols for happiness and laughter in _Shrink (2009)_ (qv).", "He used a specific hand salute--with his thumb touching (or near) his nose, as in \"thumbing your nose\"--in television appearances and movies, among them: _Mork & Mindy (1978)_ (qv), _I Love Liberty (1982)_ (qv), _The Survivors (1983)_ (qv), _Club Paradise (1986)_ (qv), _Good Morning, Vietnam (1987)_ (qv), _Toys (1992)_ (qv), _Mrs. Doubtfire (1993)_ (qv), _Patch Adams (1998)_ (qv), _The Night Listener (2006)_ (qv) and _Night at the Museum (2006)_ (qv).", "He was considered for the Genie in _Aladdin (1992)_ (qv) from the scripting stage. Disney animators even modeled his face into the Genie's.", "Though he was right-handed, he batted and golfed left-handed _Good Morning, Vietnam (1987)_ (qv), _Old Dogs (2009)_ (qv), _The Crazy Ones (2013)_ (qv)).", "From August 16-18, 2014, Disney honored him by airing _Aladdin (1992)_ (qv) on their three children's channels (Disney Channel on Saturday, Disney XD on Sunday, and Disney Junior on Sunday evening and Monday morning), twice on each channel. At the end of the movie, just before the credits, they put up an image that read, \"In Memory of 'Robin Williams' (qv), who made us laugh.\" using 'Eric Goldberg' (qv)'s (the movie's animator) tribute to him as a backdrop.", "He died only 13 days before his _Hamlet (1996)_ (qv) co-star 'Richard Attenborough' (qv).", "More than 400 fellow celebrities, friends and co-stars gave condolences and paid tribute to him upon his tragic death. Internet surveys showed his name was the most \"looked up\" thing in 2014.", "He became very close with 'Sarah Michelle Gellar' (qv) who played his daughter on _The Crazy Ones (2013)_ (qv) and described him as a \"surrogate father\".", "He had expressed interest in playing the Riddler in _Batman Forever (1995)_ (qv) and was a fan favorite to do so, until 'Joel Schumacher' (qv) took over the project and reworked the concept. He was also considered for the role of Hagrid in the Harry Potter series.", "He was fond of going to comedy clubs and taking pictures with the club owners to be displayed on the walls, which made the clubs more popular and encouraged aspiring stand-ups to audition there.", "He became extremely close with 'Lisa Jakub' (qv) and 'Mara Wilson' (qv) who played his daughters in _Mrs. Doubtfire (1993)_ (qv) and stayed in touch with them over the years. Mara described him as a source of great comfort after the death of her mother.", "An autopsy revealed he suffered from Lewy Body Dementia, a neurodegenerative disorder with a rapid onset, which has a higher prevalence in men and occurring after the age of 50. It is often mistaken for Parkinson's or Alzheimer's disease. Symptoms can include difficulty with alertness, hallucinations, slowing of movement, difficulty walking (ataxia or dystaxia), and rigidity. Restlessness during sleep and mood changes like depression are also common in Lewy Body Dementia.", "A best seller at most Episcopal camps or gift shops is \"'Robin Williams' (qv): 10 Reasons to be Episcopalian\".", "Before making _Mrs. Doubtfire (1993)_ (qv), 'Chris Columbus' (qv) had already seen Williams in comedy clubs in Los Angeles. He was blown away at his energy, saying Williams was one of the most brilliant minds he had ever come across in terms of comedy.", "He did interviews as the title character in _Mrs. Doubtfire (1993)_ (qv) to promote the film, and sometimes played the interviewer also.", "He appeared in three films with 'Billy Crystal' (qv): _Hamlet (1996)_ (qv), _Fathers' Day (1997)_ (qv) and _Deconstructing Harry (1997)_ (qv).", "'Chris Columbus' (qv) was amazed how far Williams took his performance in _Mrs. Doubtfire (1993)_ (qv). First, he would play each scene as scripted two to three times and then was allowed to improvise. Columbus allowed him to do a lot of improv because that was where the film's funniest material came from; Scenes were shot from 15-22 times because Williams wasn't satisfied until he had the scene worked out of his system. Columbus admitted he never knew where Williams was going to take the character next.", "When making _Mrs. Doubtfire (1993)_ (qv), Williams and director 'Chris Columbus' (qv) would often clown around between takes, like Mrs Doubtfire introducing Columbus as her son.", "There are several versions of _Mrs. Doubtfire (1993)_ (qv) because of the sheer volume of Williams' improv, so it was difficult to edit the film to something resembling the script. 'Chris Columbus' (qv) likened it to editing a documentary. These other versions were unworkable because tonally they were all over the place.", "During the restaurant scene in _Mrs. Doubtfire (1993)_ (qv) when her false teeth fell into a wine glass, the cast didn't know Williams would do that, and their reactions on film were genuine, mirroring the shock of the crew.", "He named the British rock group 'Genesis' (qv) as his favorite band and inducted them for the _VH1 Rock Honors (2007)_ (qv). He had previously shared a scene with the band's lead singer and drummer 'Phil Collins' (qv) in the film _Hook (1991)_ (qv).", "He was the favorite actor of 'Omarion' (qv).", "He helped pay for his friend 'Christopher Reeve' (qv)'s physical therapy and other medical expenses after Reeve's horse-riding accident.", "He was close friends with 'Pam Dawber' (qv), 'Billy Crystal' (qv), 'Whoopi Goldberg' (qv), 'Paul Reubens' (qv), 'Fred Travalena' (qv), 'Jim Varney' (qv), and 'Kristin Chenoweth' (qv).", "He accepted the offer to voice the Genie in _Aladdin (1992)_ (qv) as he wanted to be part of the animation tradition. Fearing that his contribution would be exploited commercially, he accepted a minimum salary on the conditions that his voice would not be used in the film's merchandise, nor would the Genie be overused in the film's advertising. When both conditions were broken by Disney's chairman 'Jeffrey Katzenberg' (qv), Williams refused to work with Disney again. He was therefore absent as the Genie's voice in _Aladdin and the Return of Jafar (1994)_ (qv) or the _Aladdin (1994)_ (qv) TV show. After Katzenberg was fired and the new CEO 'Joe Roth' (qv) publicly apologized to him, he changed his mind and returned to do _Aladdin and the King of Thieves (1996)_ (qv).", "As a comic book lover, Williams happily accepted an offer to play The Joker in _Batman (1989)_ (qv) after 'Jack Nicholson' (qv) was hesitant to take on the part. Upon hearing that Williams had committed to the part, Nicholson immediately signed on, and Warner Bros. let the former go. Williams was so upset about being used as leverage to get Nicholson on board that he refused to do movies for Warner Bros. for years afterwards, until the studio had apologized to him.", "'Chris Columbus' (qv) likened Williams to \"an impressive ball of fire\" he was blown away by when he saw him doing stand up in comedy clubs in Los Angeles and pronounced him \"one of the most brilliant minds he had ever come across in terms of comedy\". They later worked together on films like _Mrs. Doubtfire (1993)_ (qv), _Nine Months (1995)_ (qv) and _Bicentennial Man (1999)_ (qv).", "He was offered the lead roles in _City Slickers (1991)_ (qv) and _Drop Dead Fred (1991)_ (qv), but he was busy with _Hook (1991)_ (qv).", "Was best friends with 'Steven Spielberg' (qv).", "Son of 'Laurie Williams' (qv).", "His maternal great-great-grandfather Anselm Joseph McLaurin (1848-1909) was a United States Senator (1894-1895; 1901-1909), and Governor of Mississippi (1896-1900).", "Former uncle of 'Jennifer Garces' (qv).", "Younger half-brother of 'Dr. Toad' (qv).", "Was a huge fan of video games.", "Enjoyed playing pen and paper board games and played monthly with a group of close friends in San Francisco.", "His 1st grandchild McLaurin Clement Williams was born on May 22nd 2019 to son Zak and his fiance Olivia June.", "Was known for being very humble and soft spoken.", "Was known for being very humble and soft spoken to everyone that knew him."], "quotes": ["Cocaine is God's way of telling you you are making too much money.", "...And now that you have a child you have to clean up your act, 'cause you can't drink anymore. You can't come home drunk and go, \"Hey, here's a little switch: Daddy's gonna throw up on you!\".", "Ah, yes, divorce, from the Latin word meaning to rip out a man's genitals through his wallet.", "See, the problem is that God gives men a brain and a penis, and only enough blood to run one at a time.", "Ballet: Men wearing pants so tight that you can tell what religion they are.", "You can start any Monty Python routine and people finish it for you. Everyone knows it like shorthand.", "[on Canada] Canada is like a loft apartment over a really great party.", "Comedy is acting out optimism.", "[to troops in Iraq] I'm looking at a group of heavily armed people here. I'm telling myself \"If you're not funny, it's a problem.\".", "[on _Popeye (1980)_ (qv)] If you watch it backwards, it has a plot.", "Everyone has these two visions when they hold their child for the first time. The first is your child as an adult saying \"I want to thank the Nobel Committee for this award.\" The other is \"You want fries with that?\".", "A woman would never make a nuclear bomb. They would never make a weapon that kills, no, no. They'd make a weapon that makes you feel bad for a while.", "About comic lines written by Mark Shaiman being removed for innuendo (i.e. \"Chip 'n Dale are both strippers\") the week before for his presenting of Best Animated Film at the 77th Academy 'Awards' (qv): For a while you get mad, then you get over it. They're afraid of saying Olive Oyl is anorexic. It tells you about the state of humor. It's strange to think: how afraid are you? We thought that they got the irony of it. I guess not.", "You're only given one little spark of madness. You mustn't lose it.", "They're talking about partial nuclear disarmament, which is also like talking about partial circumcision - you either go all the way or forget it.", "Countering the complaint that the juiciest roles go to younger actors: They (the roles) may not be financially enriching, but personally enriching? Yes. You are no longer under pressure. You don't have to prove yourself on some levels, but you do have to [creatively] push yourself.", "I started doing comedy because that was the only stage that I could find. It was the pure idea of being on stage. That was the only thing that interested me, along with learning the craft and working, and just being in productions with people.", "[on his acting career]: All the new people you meet, it's pretty amazing. The vampire needs new blood. And there is still a lot to learn and there is always great stuff out there. Even mistakes can be wonderful.", "Okra is the closest thing to nylon I've ever eaten. It's like they bred cotton with a green bean. Okra, tastes like snot. The more you cook it, the more it turns into string.", "I believe I could do dance on ice, or play in a musical of Freud's life called \"It's Your Mother\" - or maybe one for the symbolists: \"Jung at Heart\". There's always the one about India: \"The Gandhi Man Can\".", "[While accepting the Oscar for Best Supporting Actor for _Good Will Hunting (1997)_ (qv)] Most of all, I want to thank my father, up there, the man who when I said I wanted to be an actor, he said, \"Wonderful. Just have a back-up profession like welding.\".", "Australians are basically English rednecks. If Darwin had landed in Australia, he would have gone: \"I'm wrong\".", "I'd play the Riddler in the next Batman, although it'd be hard to top 'Heath Ledger' (qv) as the villain, and I'm a little hairy for tights. Plus, the Batman films have screwed me twice before: years ago they offered me the Joker and then gave it to 'Jack Nicholson' (qv), then they offered me the Riddler and gave it to 'Jim Carrey' (qv).", "[on entertaining the troops on USO tours] I enjoy it. I enjoy performing for heavily armed people. It's easier than going to Georgia.", "There's so much to talk about. The fact that Donald Trump wants to see Obama's birth certificate. I want to see his hairline first.", "I was once walking in an airport and a woman came up to me and said, \"Be zany!\". That'd be like walking up to Baryshikov and going, \"Plie! Just do a plie! Do it! Do a releve right now! Lift my wife!\".", "I went to rehab in wine country just to keep my options open.", "Men can't fake an orgasm, who wants to look that dumb, you know what I'm saying?", "Stand-up is the place where you can do things that you could never do in public. Once you step on stage you're licensed to do that. It's an understood relationship. You walk on stage - it's your job.", "[on 'Jonathan Winters' (qv)] Jonathan taught me that the world is open for play, that everything and everybody is mockable, in a wonderful way.", "'Jonathan Winters' (qv) was my mentor. I told him that and he said, \"Please, I prefer idol\".", "[on working with 'Al Pacino' (qv) on _Insomnia (2002)_ (qv)] I loved working with Pacino. Al does this Method thing where before every take he roars like a lion. So my first day working with him I bleated like a goat: \"What was that?!\" \"Hi Al, I'm here, it's just Robin, just playing.\" Playing scenes with him was a little surreal, because I was like, \"I'm watching 'Al Pacino' (qv)!\" and then I'd realize I had to act, too. I loved talking to him off-set. He plays all these incredible characters, but he claims most of the time he just wants to be in the Village having coffee and discussing Aristotle. Having worked with 'Robert De Niro' (qv) (on _Awakenings (1990)_ (qv)) I was kind of prepared for the idea of someone who's that intense. (If I ever get to work with 'Robert Duvall' (qv), I'll have the entire Godfather collector's set. Except for Brando. But I got to meet Brando once, so I guess that qualifies.) But like 'Christopher Nolan' (qv), even though he's very focused, he's also prepared to try anything. At that time, Al was flying back and forth from L.A. because his twins were just born, so I think he was way beyond Method acting: he really wasn't getting any sleep. He was completely ragged, and that was perfect.", "I used to think that the worst thing in life was to end up alone. It's not. The worst thing in life is to end up with people who make you feel alone.", "Divorce is expensive. I used to joke they were going to call it \"all the money\", but they changed it to \"alimony\". It's ripping your heart out through your wallet.", "The truth is, if anything, I'm probably addicted to laughter.", "If women ran the world, we wouldn't have wars, just intense negotiations every 28 days.", "You're only given a little spark of madness. If you lose that, you're nothing.", "[on _World's Greatest Dad (2009)_ (qv) being an \"indictment of the modern grief industry\", and asked if it's getting worse] Well, I think people want it. In a weird way, it's trying to keep hope alive.[on if he does or doesn't share the film's \"judgment on mawkish sentimentality\"] Well, you just try and keep it in perspective; you have to remember the best and the worst. In America they really do mythologize people when they die.", "[from his first appearance on \"The Tonight Show\", October 14, 1981] I was the only child on my block on Halloween to go, \"Trick or trout!\"...\"Here comes that young Williams boy again. Better get some fish.\".", "[on 'Genesis' (qv)] This is a group that pulled off the single most surprising lead singer swap in all of rock history. Their first great frontman 'Peter Gabriel' (qv) decided to stop dressing like vegetables and little furry woodland creatures and went solo to shock his monkey. And instead of asking another steadily qualified singer or having a talent contest so 'Simon Cowell' (qv) could go, \"I'm sorry, darling, you suck!\", no, they just looked to their brilliantly gifted drummer and said, \"You! Collins! You 'Bob Hoskins' (qv) lookalike! Get your ass up to the microphone and sing your bollocks off!\". And so Phil did, and it was good, and the goodness became greatness.", "It's amazing that medical science can develop a drug to give you an erection, but can't develop a drug to give you mental clarity.", "Life's a tragedy to those who feel and a comedy to those that think. So it can be curse in that you find something funny in even the darkest thing.", "Being a celebrity is like wearing a Mardi Gras head - although you're not floating! Obviously it's great that it can get you a table in a restaurant, but it can also get people following you into the men's room with a palm-cam.", "The imagination functions on its own. I grew up as an only child, so the imagination was a necessity, like a survival mechanism.", "[on who can run for office in American politics] We're frightening away people who have lived interesting lives, intelligent people who might have inhaled, who might have had different sexual experiences or orientations, but who are stone-cold brilliant.", "[on 'George W. Bush' (qv)] There's nothing Bush has said, apart from a few malapropisms, that we will remember. Comparing him to Churchill is akin to comparing 'Margaret Thatcher' (qv) and 'Paris Hilton' (qv).", "I had my midlife crisis when I was about 30, so I got that over with. But when I hit 50, it was like, this is cool. It feels like the prime of your life, literally. Things are going great; you've come to the point where it's no longer a struggle. As 'Rodney Dangerfield' (qv) said, \"Why am I sweating? I own the club!\" You're there, so you don't have to worry as much. And yet the object is to keep working, to find interesting parts, and obviously it's skewed more for men than women to find character parts at my age. And, hey, supporting parts are just as interesting as the lead.", "My childhood was lonely. Both my parents were away a lot, working, and the maid basically raised me. And I think that's where a lot of my comedy comes from. Not only was the maid very funny and witty, but when my mother came home I'd use humor to try and get her attention. If I made mommy laugh, then maybe everything would be all right. I think that's where it all started.", "[on the first film to make a big impression on him] That was _2001: A Space Odyssey (1968)_ (qv). I saw it at the Cinerama with my parents and was totally slack-jawed. With that sort of cinema and that film, you don't ever need to take acid! It knocked me out. I love science fiction and Kubrick. That whole experience was so surreal.", "Cocaine is nothing new; it's been part of Hollywood from the outset. It's the pressure, I think. People use it to relieve that, and for me it was about getting numb and forgetting. I did coke so I wouldn't have to talk to anyone. For me it was a true sedative, a way to pull back from the world.", "I don't know how much value I have in this universe, but I do know that I've made a few people happier than they would have been without me, and as long as I know that, I'm as rich as I ever need to be.", "[his word for improv] Playing.", "I was once on a German talk show--and if you want to go on one, it's a lot of fun. It's really fun. And I was on this German talk show, and this woman said to me, she said, \"Mr. Williams, why do you think there's not so much comedy in Germany?\" And I said, \"Did you ever think you killed all the funny people?\" And here's where it got interesting. She didn't bat an eyelash; she just went, \"No.\" At that point, even God's going, \"Do you get it!!?!\" German comedy: \"Knock, knock. we ask the questions!!\"", "[on _The Fisher King (1991)_ (qv)] We'd closed down Grand Central for the Ballroom Scene, and this guy on a bicycle with a winged hat started circling us, saying \"Hello, my name is Mercury, and I'd like to speak to 'Terry Gilliam' (qv) RIGHT NOW!\"... And then there was this taxi driver who kept yelling \"SCREW YOU! SCREW YOUR MOVIE!\"", "'Phil Collins' (qv) gets a lot of flack, but I think it's undeserved. That man was the glue that kept 'Genesis' (qv) together. No other band could lose a front man as popular as 'Peter Gabriel' (qv) and come out of it stronger. Never happens. Be honest, do you think the other three were going to keep the band going? Besides that, he was a damn good drummer, one of the best in the business. Turn off the radio and listen to one of the 'Genesis' (qv) albums from the 1970s to see what I'm talking about.", "I think the saddest people always try their hardest to make people happy because they know what it's like to feel absolutely worthless and they don't want anyone else to feel like that."], "salary history": ["_Mork & Mindy (1978)_ (qv)::$35,000 per 1/2 hour episode", "_Popeye (1980)_ (qv)::$500,000", "_Aladdin (1992)_ (qv)::$100,000", "_Jumanji (1995)_ (qv)::$15,000,000", "_Bicentennial Man (1999)_ (qv)::$20,000,000", "_The Night Listener (2006)_ (qv)::$65,000", "_Man of the Year (2006)_ (qv)::$1,000,000", "_The Crazy Ones (2013)_ (qv)::$165,000 per episode (2013-2014)"], "birth date": "1951-07-21", "birth notes": "Chicago, Illinois, USA", "death date": "2014-08-11", "death cause": "(suicide by hanging)", "death notes": "in Tiburon, California, USA (suicide by hanging)", "_actorID": "29", "_source": "IMDB", "actorID": "0000245", "created_utc_dt": "09/14/2019, 13:01:39"}