{"headshot": "https://m.media-amazon.com/images/M/MV5BMTkxNTI5NzM4MV5BMl5BanBnXkFtZTcwMTI3ODY3Mg@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Cami"], "birth name": "Cameron Michelle Diaz", "height": "5' 8½\" (1.74 m)", "mini biography": ["A tall, strikingly attractive blue-eyed natural blonde, 'Cameron Diaz' (qv) was born in 1972 in San Diego, the daughter of a Cuban-American father and a German mother. Self described as \"adventurous, independent and a tough kid,\" Cameron left home at 16 and for the next 5 years lived in such varied locales as Japan, Australia, Mexico, Morocco, and Paris. Returning to California at the age of 21, she was working as a model when she auditioned for a big part in _The Mask (1994)_ (qv). To her amazement and despite having no previous acting experience, she was cast as the female lead in the film opposite 'Jim Carrey' (qv). Over the next 3 years, she honed her acting skills in such low budget independent films as _The Last Supper (1995)_ (qv); _Feeling Minnesota (1996)_ (qv); and _Head Above Water (1996)_ (qv). She returned to main stream films in _My Best Friend's Wedding (1997)_ (qv), in which she held her own against veteran actress 'Julia Roberts' (qv). She earned full fledged star status in 1998 for her performance in the box office smash _There's Something About Mary (1998)_ (qv). With her name near the top on virtually every list of Hollyood's sexiest actresses, and firmly established as one of filmdom's hottest properties and most sought after actresses, 'Cameron Diaz' (qv) appears to possess everything necessary to become one of the super stars of the new century.::Tom McDonough"], "spouse": ["'Benji Madden' (qv)::(5 January 2015 - present)"], "trade mark": ["Blonde hair and Blue eyes", "She is filmed dancing in almost every movie", "Wide, bright smile"], "trivia": ["Chosen by Empire magazine as one of the \"100 Sexiest Stars\" in film history (#13). [1995]", "Chosen by People Magazine as one of the \"50 Most Beautiful\" people in the world. [1998]", "Was set to play Sonya Blade in _Mortal Kombat (1995)_ (qv) but broke her wrist while taking karate lessons to prepare for the role and was replaced by 'Bridgette Wilson-Sampras' (qv).", "Got alcohol poisoning in Australia at age 18.", "Cameron's father 'Emilio Diaz' (qv) appeared in her movie _There's Something About Mary (1998)_ (qv) as a \"Jailbird.\".", "She graduated from Long Beach Polytechnic (Poly) High School (Class of 1990) in Long Beach, California. As a member of that school's \"Polyettes\" dance-drill team, Cameron performed during half-time at football games.", "Police caught an airline security guard at Los Angeles International Airport stealing items from Diaz. Diaz reported her passport and a large sum of cash missing. [December 1999]", "Cameron's parents allowed the then-16-year old to spend five years traveling the world to pursue her modeling career beginning in Japan, where she was accompanied only by a 15-year-old fellow model.", "Was discovered by a photographer at a Hollywood party who, within a week, helped her land a contract with the Elite Modeling Agency.", "Lived with video producer 'Carlos De La Torre' (qv) for 4 years.", "Her father was from a Cuban immigrant family (of Spanish origin). Her mother has English, Scots-Irish, and German ancestry.", "Became only the second actress to join the coveted $20 Million Club (after 'Julia Roberts' (qv)), when she signed for that amount to do _Charlie's Angels: Full Throttle (2003)_ (qv) in January 2002.", "Named by People Magazine as one of the the \"50 Most Beautiful People\" in the world. [2002]", "Has an older sister, Chimene.", "Voted the 11th \"Sexiest Female Movie Star\" in the Australian Empire Magazine. [September 2002]", "30 August 2003 - Broke her nose in a surfing accident in Hawaii on her birthday.", "Photographer 'John Rutter' (qv) was ordered to stand trial for attempted extortion, attempted grand theft, perjury, and forgery after trying to blackmail her with topless shots he had of her from a 1992 shoot. [November 2003]", "Voted as #8 on the \"Top 100 Sexiest Women\" in FHM [DK]. [2004]", "Ranked #3 in Stuff magazine's \"102 Sexiest Women in the World.\" [2002]", "During her interview on _Inside the Actors Studio (1994)_ (qv), said that she doesn't read scripts and wishes movies were filmed from start to finish because sometimes she doesn't understand them.", "Her name is mentioned in the lyric of 'Brian Wilson' (qv)'s 1998 song \"South America\".", "Has been friends with 'Drew Barrymore' (qv) since _Charlie's Angels (2000)_ (qv). Both Drew and Cameron are huge fans of the rock group, 'Ratt' (qv).", "Named #11 on the Maxim magazine Hot 100 of 2005 list.", "Named #13 in FHM's \"100 Sexiest Women in the World 2005\" special supplement. (2005)", "Ranked #1 in the \"Worst Hollywood Signers 2006\" list by \"Autograph Collector\" magazine (May 2006).", "'Christophe Gans' (qv) originally wanted her to play the part of Cybil Bennett in _Silent Hill (2006)_ (qv).", "Went to the same high school at the same time as 'Snoop Dogg' (qv).", "Named #23 in FHM magazine's \"100 Sexiest Women in the World 2006\" supplement. (2006).", "After having her nose broken 4 times, she decided to undergo corrective surgery. [November 2006]", "Said that her role in _Gangs of New York (2002)_ (qv) marked the pinnacle of her career.", "Broke up with 'Justin Timberlake' (qv). They had been together since 2003. [January 2007]", "Was considered for the role of Dorothy Boyd in _Jerry Maguire (1996)_ (qv).", "Ranked #19 on the Maxim magazine Hot 100 of 2007 list.", "Was set to play Jane in _Fun with Dick and Jane (2005)_ (qv), but bowed out shortly before production due to scheduling conflicts.", "'Robbie Williams' (qv) mentions her in his song \"I Will Talk and Hollywood Will Listen\".", "According to Forbes, for each dollar she got paid, 'Cameron Diaz' (qv)'s movies averaged $9 of gross income. [December 2007]", "Named #47 on Empire Magazine's 100 Sexiest Movie Stars. [2007]", "As a child, her friends nicknamed her \"Skeletor,\" because she was tall and had an infectious smile.", "Ranked #26 on the Maxim magazine Hot 100 of 2008 list.", "Received the 2,386th star on the Hollywood Walk of Fame on June 22, 2009.", "Born at 2:53 AM (EST).", "Friend of 'Gwyneth Paltrow' (qv) 'Reese Witherspoon' (qv), 'Jessica Alba' (qv), 'Kate Upton' (qv), 'Sean 'Diddy' Combs' (qv), 'Demi Moore' (qv), 'Bradley Cooper' (qv), 'Eva Mendes' (qv), and 'Stella McCartney' (qv).", "She has hosted _Saturday Night Live (1975)_ (qv) three times and appeared uncredited several times as the character \"Kiki Deamore\".", "Voted #4 on the 2011 Maxim list of Hot 100 Women.", "Served as maid of honor at her best friend 'Drew Barrymore' (qv)'s wedding to 'Will Kopelman' (qv) on June 2, 2012.", "Along with 'Tom Cruise' (qv), she attended the _Knight and Day (2010)_ (qv) premiere at Roppongi Hills on Tuesday (September 28) in Tokyo, Japan. [September 2010]", "On July 6th, along with co-star 'Tom Cruise' (qv), she visited Rio de Janeiro, Brazil briefly - less then 24hrs - to promote their latest film, _Knight and Day (2010)_ (qv). The following day, on July 7th, she attended another premiere for the film in Mexico City at the Cinemex Santa Fe. [July 2010]", "Released a book, \"The Body Book: The Law of Hunger, the Science of Strength, and Other Ways to Love Your Amazing Body\" in 2013.", "Doesn't wear antiperspirant/deodorant.", "Engaged to 'Benji Madden' (qv). [December 2014]", "Aunt of Harlow and Sparrow Madden.", "Sister-in-law of 'Joel Madden' (qv) who is married to 'Nicole Richie' (qv).", "(January 5, 2015) Married her boyfriend of 8 months, 'Benji Madden' (qv), in an intimate ceremony at their home in Los Angeles, following a 2-week-long engagement. Over the weekend, the couple hosted an intimate rehearsal dinner at their Beverly Hills pad for family and friends, including 'Drew Barrymore' (qv), 'Gwyneth Paltrow' (qv), 'Toni Collette' (qv), 'Reese Witherspoon' (qv), 'Joel Madden' (qv) and 'Nicole Richie' (qv). The wedding was held in front of 90-plus guests - including bridesmaid, Barrymore, as well as ring bearer and nephew, Sparrow - and took place inside the home, while the reception was held under a tent.", "Was introduced to husband 'Benji Madden' (qv) by 'Nicole Richie' (qv). Richie is married to Madden's brother, 'Joel Madden' (qv).", "Her bridesmaids at her wedding to 'Benji Madden' (qv) were her sister Chimene, 'Nicole Richie' (qv), best friend 'Drew Barrymore' (qv), and assistant Jesse Lutz.", "Despite playing her younger sister in _In Her Shoes (2005)_ (qv), Diaz is actually 9 weeks older than 'Toni Collette' (qv) in real life.", "Will ONLY wash her face in Evian spring water!.", "Has starred in several films where her character is a terrible singer: Shrek, My Best Friend's Wedding, and The Holiday, just to name a few.", "Attended Long Beach Polytechnic (Poly) High School with Snoop Dog.", "Attended Jordan High School in North Long Beach, California.", "Ranked highest grossing actress of all time with her previous films grossing $3.3 billion.", "She keeps pairs of shoes from most of her movies.", "Announced her retirement from acting in 2017."], "quotes": ["There were times when I'd go, \"This outfit would look so badass with stilettos\". You wanted those four-inch heels, those wrappy, strappy, show-off-your-pedicure shoes, but you couldn't do it. At the beginning of the scene it would have been fine because I'm just hanging out with the dude. But the next thing you know, you're kicking the dude's rear, so you had to make sure you had the right shoes on.", "I didn't realize it [_The Mask (1994)_ (qv)] was a fairly large film that I was a part of. Halfway through I was going, \"Is there any place that my mom and dad can see this film?\" and they're going, \"Cameron, at the theaters\". I had no idea. Durrrrrrr. I'm blonde. I'm allowed.", "One thing I realized from Julia ['Julia Roberts' (qv), her _My Best Friend's Wedding (1997)_ (qv) co-star]--which I knew before, but was made very clear--is that when you're the star of the film, the crew looks to you to set the tone of everyday work. So when you come into work, whatever it is that you're giving off, that is what the tone is going to be for the working conditions.", "On _Being John Malkovich (1999)_ (qv): \"It's been said that in Hollywood there are only 14 different scripts. Well, this is number 15.\"", "Your regrets aren't what you did, but what you didn't do. So I take every opportunity.", "I grew up with a lot of boys. I probably have a lot of testosterone for a woman.", "Growing up, I was the plain one. I had no style. I was the tough kid with the comb in the back pocket and the feathered hair.", "I would kiss a frog even if there were no promise of a Prince Charming popping out of it. I love frogs. I'd lick him.", "We have a voice now and we're not using it. Women have so much to lose. I mean, we could lose the right to our bodies. If you think rape should be legal then don't vote. But if you think you have a right to your body and you have a right to say what happens to you and fight off that danger of losing that, then you should vote.", "My Latin roots are very strong. All my life, because I'm blonde and blue-eyed, people who aren't Hispanic can't believe I am. And people who are Hispanic always think I'm not, because I don't look like them. Being Latin is part of who I am and I bring that part to every role.", "\"What we women need to do, instead of worrying about what we don't have, is just love what we do have.\"quoted Women's World (6-14-05)", "Toronto has such a nice balance as far as the films they show there. They kind of give an opportunity to everybody. You get the best of the best there. It's a good standard to be held up against, and it's very flattering to be in that festival.", "I'm like every other woman: a closet full of clothes, but nothing to wear: So I wear jeans.quoted in Woman's World 1-3-06.", "I go, 'God, you know, it all sounds so familiar. I know what you're saying, I really do. I just cannot respond to you back in Spanish. I can barely speak English properly.' I didn't grow up in a Cuban or Latin community. I grew up in Southern California on the beach, basically. And I'm third generation. I'm of Cuban descent, but I'm American. - when asked if she can speak Spanish.", "The last couple of years were hell. Like, I can't even tell you, it was so hard. I didn't know how to handle it. But I think I'm in a much better place now, because I stepped away for a second and took a breath. Hollywood is a funny place. It offers so much, but it can also take a lot away from you.", "I'm not 25 years old anymore, nor do I want to be. I wouldn't even want to go back to being 30. You know what I mean? That journey, I've done it already. I don't want to do it again. It's a lot of work to get through it, and I am excited about moving forward. I think that people get caught up in getting back to some place that they already passed or to a place where you cannot stay.", "Men are wonderful. I don't think my feeling about that is ever going to change. I'm never going to feel differently about men. I'm not a man-hater. It's just not in my nature. I think guys are amazing. I love the dichotomy, the differences in men and women. I think it's wonderful. It keeps things interesting. We can't walk in each other's shoes. We don't know what it's really like, but we certainly can make an effort to know each other a little bit better.", "My father's death will be a part of me forever, and I'm sure it's going to be a part of all of the roles that I play now. It's been a year since he died, and it's been an incredibly transformative year. It's just something that's going to be with me forever.", "We all fall in love with our parents.", "What's changed from 10 years ago is that now I want a man who knows who he is. Someone who understands himself, has already dealt with his issues and who can say: \"I see where I've been foolish before and I'm not going to be like that again.\"", "It will be cool to be under people's feet. It really is the place where people can understand exactly that actors are not really stars -- they don't exist in the sky, they exist on the ground just like everybody else. - on getting her star on the Hollywood Walk of Fame.", "You know what terrifies me? Trailers to horror movies! I kind of want to look, but I'm always afraid that I'm going to look too long and see the one image that I'm not going to be able to get out of my head for at least a week every night before I'm going to bed.", "Women have always behaved badly. I think probably worse than men.Maybe men just don't have the stomach for it. They don't want to see it on film because they just can't take it. Any of my guy friends, when I tell them what women really talk about, they just don't want to hear it. But maybe it's time.", "[on playing \"Elizabeth Halsey\", the title role in _Bad Teacher (2011)_ (qv)]: Obviously if I thought I could get somewhere with bigger boobies I would have done it by now. But for her, it's everything. It's called hard economic times. You can't find a millionaire like you could three or four years ago. It's an investment.", "I'd rather have my heart broken a thousand times than never to love at all.", "The fountain of youth [for me], let's see...I guess it's exercise, healthy diet, lots of water, lots of laughter, lots of sex - yes, we all need that as human beings. Its healthy, it's natural, it's what we are here to do.", "Sex is my favorite sport. I'm always in the mood.", "Oh gosh, I can't even count how many times I've gotten on a plane for love. It's not unusual in this business; my lifestyle demands it. I'm always traveling for [whispers] cock. You've got to go where it is.", "I'm primal on an animalistic level, kind of like, \"Boink me over the head , throw me over your shoulder. You man, me woman.\" Not everybody has the right kind of primal thing for me...I love physical contact. I have to be touching my lover, like, always. It's not optional.", "I'm not comfortable with the idea of cutting myself up. I hope I never become that vain. I will never get breast implants. I think in LA, a lot of girls are doing it to please other people. So, having big boobs may be in now, but in the future the fat-chested look will probably be back. I'm happy with the way I look.", "I think that all women have been sexually attracted to another woman at some point. It's natural to have connectivity and an appreciation for the beauty of other women.", "I love my laugh lines. It's like, Guess this means: I've smiled my whole life!", "[on what she would do if she could be a man for a day] I would have sex. I would love to know how it operates! Like what the real mechanics feel like! It would be fun to feel the other side, wouldn't it?", "[On not wearing antiperspirant/deodorant] I don't believe in antiperspirant. It's really bad for you. I haven't used it for almost 20 years. You're stinky, because you use antiperspirant. It keeps all the stink in.", "Pay attention to your gut because your body is telling you whether or not something is a good idea.", "If I'm going to do a scene where I'm naked, the film will have to be substantial and be taken seriously. Otherwise, the whole publicity involving the movie will be about 'Cameron Diaz' (qv) does nudity and blah-blah-blah. You don't want your body to become the whole point of what attracts attention to a movie. [1999]"], "salary history": ["_There's Something About Mary (1998)_ (qv)::$2,000,000", "_Any Given Sunday (1999)_ (qv)::$500,000", "_Charlie's Angels (2000)_ (qv)::$12,000,000", "_Shrek (2001)_ (qv)::$3,000,000", "_Vanilla Sky (2001)_ (qv)::$10,000,000", "_The Sweetest Thing (2002)_ (qv)::$15,000,000", "_Gangs of New York (2002)_ (qv)::$17,500,000", "_Charlie's Angels: Full Throttle (2003)_ (qv)::$20,000,000", "_Shrek 2 (2004)_ (qv)::$10,000,000", "_In Her Shoes (2005)_ (qv)::$15,000,000", "_What Happens in Vegas (2008)_ (qv)::$10,000,000", "_Shrek Forever After (2010)_ (qv)::$10,000,000", "_Knight and Day (2010)_ (qv)::$10,000,000", "_The Green Hornet (2011)_ (qv)::$6,000,000", "_Sex Tape (2014)_ (qv)::$12 500 000", "_Annie (2014)_ (qv)::$7,500,000"], "birth date": "1972-08-30", "birth notes": "San Diego, California, USA", "_actorID": "39", "_source": "IMDB", "actorID": "0000139", "created_utc_dt": "09/14/2019, 13:01:47"}