{"headshot": "https://m.media-amazon.com/images/M/MV5BMTg3MDc0MjY0OV5BMl5BanBnXkFtZTcwNzU1MDAxOA@@._V1_UY98_CR3,0,67,98_AL_.jpg", "birth name": "Clinton Eastwood Jr.", "height": "6' 4\" (1.93 m)", "mini biography": ["'Clint Eastwood' (qv) was born May 31, 1930 in San Francisco, the son of Clinton Eastwood Sr., a manufacturing executive for Georgia-Pacific Corporation, and 'Ruth Wood' (qv), a housewife turned IBM operator. He had a comfortable, middle-class upbringing in nearby Piedmont. At school Clint took interest in music and mechanics, but was an otherwise bored student; this resulted in being held back a grade. Eastwood's parents relocated to Washington state in 1949, and Clint worked menial jobs in the Pacific Northwest until returning to California for a stint at Fort Ord Military Reservation. He enrolled at Los Angeles City College, but dropped out after two semesters to pursue acting. During the mid-'50s he found uncredited bit parts in such B-films as _Revenge of the Creature (1955)_ (qv) and _Tarantula (1955)_ (qv) while simultaneously digging swimming pools to supplement his income. In 1958, he landed his first consequential acting role in the long-running TV show _Rawhide (1959)_ (qv) with 'Eric Fleming' (qv). Though only a secondary player for the first seven seasons, Clint was promoted to series star when Fleming departed in its final year, along the way becoming a recognizable face to television viewers around the country.Eastwood's big-screen breakthrough came as The Man with No Name in 'Sergio Leone' (qv)'s trilogy of excellent spaghetti westerns: _A Fistful of Dollars (1964)_ (qv), _For a Few Dollars More (1965)_ (qv), and _The Good, the Bad and the Ugly (1966)_ (qv). The movies were shown exclusively in Italy during their respective copyright years with 'Enrico Maria Salerno' (qv) providing the voice for Clint's character, finally getting American distribution in 1967. As the last film racked up phenomenal grosses, Eastwood, 37, rose from undistinguished TV actor to sought-after box office attraction in just a matter of months. Yet again a success was the late-blooming star's first U.S.-made western, _Hang 'Em High (1968)_ (qv). He followed that up with the lead role in _Coogan's Bluff (1968)_ (qv) (the loose inspiration for the TV series _McCloud (1970)_ (qv)), before playing second fiddle to 'Richard Burton' (qv) in the World War II epic _Where Eagles Dare (1968)_ (qv) and 'Lee Marvin' (qv) in the bizarre musical _Paint Your Wagon (1969)_ (qv). In _Two Mules for Sister Sara (1970)_ (qv) and _Kelly's Heroes (1970)_ (qv), Eastwood leaned in an experimental direction by combining tough-guy action with offbeat humor.1971 proved to be his busiest year in film. He starred as a predatory Union soldier in _The Beguiled (1971)_ (qv) to critical acclaim, and made his directorial debut with the classic erotic thriller _Play Misty for Me (1971)_ (qv). His role as the hard edge police inspector in _Dirty Harry (1971)_ (qv), meanwhile, gave him cultural icon status and helped popularize the loose-cannon cop genre. Thereafter, Eastwood put out a steady stream of entertaining movies: the westerns _Joe Kidd (1972)_ (qv), _High Plains Drifter (1973)_ (qv) and _The Outlaw Josey Wales (1976)_ (qv) (his first of six onscreen collaborations with then live-in love 'Sondra Locke' (qv)), the Dirty Harry sequels _Magnum Force (1973)_ (qv) and _The Enforcer (1976)_ (qv), the road adventures _Thunderbolt and Lightfoot (1974)_ (qv) and _The Gauntlet (1977)_ (qv), and the fact-based prison film _Escape from Alcatraz (1979)_ (qv). He branched out into the comedy genre in 1978 with _Every Which Way but Loose (1978)_ (qv), which became the biggest hit of his career up to that time; taking inflation into account, it still is. In short, _The Eiger Sanction (1975)_ (qv) notwithstanding, the '70s were an uninterrupted success for Clint.Eastwood kicked off the '80s with _Any Which Way You Can (1980)_ (qv), the blockbuster sequel to Every Which Way but Loose. The fourth Dirty Harry film, _Sudden Impact (1983)_ (qv), was the highest-grossing film of the franchise and spawned his trademark catchphrase, \"Make my day.\" Clint also starred in _Bronco Billy (1980)_ (qv), _Firefox (1982)_ (qv), _Tightrope (1984)_ (qv), _City Heat (1984)_ (qv), _Pale Rider (1985)_ (qv) and _Heartbreak Ridge (1986)_ (qv), all of which were solid hits, with _Honkytonk Man (1982)_ (qv) being his only commercial failure of the period. In 1988 he did his fifth and final Dirty Harry movie, _The Dead Pool (1988)_ (qv). Although it was a success overall, it did not have the box office punch the previous films had. About this time, with outright bombs _Pink Cadillac (1989)_ (qv) and _The Rookie (1990)_ (qv), it seemed Eastwood's star was declining as it never had before. He started taking on low-key projects, directing _Bird (1988)_ (qv), a biopic of 'Charlie Parker' (qv) that earned him a Golden Globe, and starring in and directing _White Hunter Black Heart (1990)_ (qv), an uneven, loose biopic of 'John Huston' (qv). (Both films had a limited release.)Eastwood bounced back with his dark western _Unforgiven (1992)_ (qv), which garnered the then 62-year-old his first ever Academy Award nomination (Best Actor), and an Oscar win for Best Director. Churning out a quick follow-up hit, he took on the secret service in _In the Line of Fire (1993)_ (qv), then accepted second billing for the first time since 1970 in the interesting but poorly received _A Perfect World (1993)_ (qv) with 'Kevin Costner' (qv). Next up was a love story, _The Bridges of Madison County (1995)_ (qv), where Clint surprised audiences with a sensitive performance alongside none other than 'Meryl Streep' (qv). But it soon became apparent he was going backwards after his brief revival. Subsequent films were credible, but nothing really stuck out. _Absolute Power (1997)_ (qv) and _Space Cowboys (2000)_ (qv) did well enough, while _True Crime (1999)_ (qv) and _Blood Work (2002)_ (qv) were received badly, as was _Midnight in the Garden of Good and Evil (1997)_ (qv), which he directed but didn't appear in.Eastwood surprised yet again in 2005, when he returned to the top of the A-list with _Million Dollar Baby (2004)_ (qv). Also starring 'Hilary Swank' (qv) and 'Morgan Freeman' (qv), the hugely successful drama won four Academy 'Awards' (qv), including Best Picture and Best Director for Clint. He scored his second Best Actor nomination, too. Eastwood's next starring vehicle, _Gran Torino (2008)_ (qv), earned almost $30 million in its opening weekend and was his highest grosser unadjusted for inflation. 2012 saw him in a rare lighthearted movie, _Trouble with the Curve (2012)_ (qv), as well as a reality show, _Mrs. Eastwood & Company (2012)_ (qv). Between screen appearances, Clint chalked up an impressive list of additional credits behind the camera. He directed _Mystic River (2003)_ (qv) (in which 'Sean Penn' (qv) and 'Tim Robbins' (qv) gave Oscar-winning performances), _Flags of our Fathers (2006)_ (qv), _Letters from Iwo Jima (2006)_ (qv) (nominated for the Best Picture Oscar), _Changeling (2008)_ (qv) (a vehicle for screen megastar 'Angelina Jolie' (qv)), _Invictus (2009)_ (qv) (again with Freeman), _Hereafter (2010)_ (qv), _J. Edgar (2011)_ (qv), _Jersey Boys (2014)_ (qv), _American Sniper (2014)_ (qv) (2014's top box office champ), _Sully (2016)_ (qv) (starring 'Tom Hanks' (qv) as hero pilot 'Chesley Sullenberger' (qv)) and _The 15:17 to Paris (2018)_ (qv) (based on the thwarted Thalys train attack of 2015). His latest project, in which he stars as an unlikely drug courier, is _The Mule (2018)_ (qv).Eastwood's individuality outside of work has been extremely convoluted, to put it mildly. He managed to keep his personal life top secret for the first three decades of his celebrity. (To this day the Hollywood kingpin refuses to disclose exactly how many families he's started.) He had a long time relationship with frequent '70s/'80s co-star Locke, who published a scathing memoir in 1997, and has fathered at least eight children by at least six different women. He has only been married twice, however -- with a mere three of his progeny coming from those unions. 'Clint Eastwood' (qv) lives in L.A. and owns property in Monterey, northern California, Idaho's Sun Valley and Maui, Hawaii.::Scott- msa0510@mail.ecu.edu"], "spouse": ["'Dina Eastwood' (qv)::(31 March 1996 - 22 December 2014) ( divorced) ( 1 child)", "Margaret Neville Johnson::(19 December 1953 - 19 November 1984) ( divorced) ( 2 children)"], "trade mark": ["During the credits at the end of his movies, the camera will move around the location it was filmed in, after which there will be freezeframe for the rest of the credits.", "Frequently uses shadow lightning in his films", "Known on-set as a director for filming very few takes and having an easy shooting schedule. 'Tim Robbins' (qv) once said that when working on _Mystic River (2003)_ (qv), Eastwood would usually ask for only one take, or two \"if you were lucky\", and that a day of filming would consist of starting \"no earlier than 9 a.m. and you leave, usually, after lunch.\"", "The lead characters in his movie are often outsiders with a dark past they prefer not to remember", "Narrow eyes and towering height", "Unmistakable authoritative rasping (sometimes hissing) voice", "Often breaks unexpectedly into a warm smile", "Deadpan delivery of one-liners", "Many of his films show at least one variation of sexual assault", "His films are often period pieces with a strong attention to detail", "His scowl", "Often plays characters who are consumed by regrets over past mistakes and are given one chance to redeem themselves", "Recurring pattern of his characters is having an unloaded gun or one that misfires", "His films often feature misguided but well meaning younger characters who are mentored by older characters", "Actors in his films usually underplay and get emotion across in subtle ways", "Many of his films revolve around people struggling with serious trauma that they are unable or unwilling to get help for", "Mole on his upper lip", "Often plays characters with no name, or whose name is revealed in the end", "His films reflect upon real-life stories", "Usually borrows stylistic elements from his \"mentors\" 'Sergio Leone' (qv) and 'Don Siegel' (qv)", "His leading ladies are almost never played by an A-list actress", "His movies often begin and end with the death of a character"], "trivia": ["Lived with 'Sondra Locke' (qv) from 1975 to 1989.", "Owns the Mission Ranch hotel & restaurant in Carmel, Calif., the exclusive Tehama golf club in Carmel Valley, and is partial owner of the Pebble Beach Golf Country Club in nearby Monterey Peninsula.", "Received an honorary Cesar award in Paris, France for his body of work. [February 1998]", "Ranked #2 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Gained popularity with his first three major films, _A Fistful of Dollars (1964)_ (qv), _For a Few Dollars More (1965)_ (qv) and _The Good, the Bad and the Ugly (1966)_ (qv) (which weren't released in America until 1967/68). Soon afterwards Jolly Films (which produced _A Fistful of Dollars (1964)_ (qv)) came out with a film called \"The Magnificent Stranger\", which was actually two episodes of _Rawhide (1959)_ (qv) edited together. Eastwood sued and the film was withdrawn.", "He wore the same sarape, without ever having washed it, in all three of his \"Man with No Name\" Westerns.", "Elected mayor of Carmel-by-the-Sea, California. It has often been claimed that Eastwood ran for office as a Republican. In fact, although he was registered as a Republican in California, the position of mayor is non-partisan. [April 1986]", "Was apparently such an organized director that he finished _Absolute Power (1997)_ (qv) days ahead of schedule.", "Got his role in _Rawhide (1959)_ (qv) while visiting a friend at the CBS lot when a studio exec spotted him because he \"looked like a cowboy.\"", "In 1951 and 1952, he was a lifeguard and projectionist of training films for the U.S. Army, stationed at Fort Ord in Marina, California. According to former buddy Don Loomis, as told in \"Clint: The Life and Legend\" (2002) by 'Patrick McGilligan' (qv), page 49, Eastwood avoided being sent to combat in Korea by romancing one of the daughters of a Fort Ord officer, who might have been entreated to watch out for him when names came up for postings.", "Has at least eight children by at least six different women: Laurie Alison Murray (b. February 11, 1954) who was given up for adoption by her biological mother; 'Kimber Eastwood' (qv) (b. June 17, 1964) with 'Roxanne Tunis' (qv); 'Kyle Eastwood' (qv) (b. May 19, 1968) and 'Alison Eastwood' (qv) (b. May 22, 1972) with Maggie Johnson; 'Scott Eastwood' (qv) (b. March 21, 1986) and 'Kathryn Eastwood' (qv) (b. February 2, 1988) with Jacelyn Reeves; 'Francesca Eastwood' (qv) (b. August 7, 1993) with 'Frances Fisher' (qv); 'Morgan Eastwood' (qv) (b. December 12, 1996) with 'Dina Eastwood' (qv).", "It's interesting, given his penchant towards violence, that his name, 'Clint Eastwood' (qv), is an anagram for 'old west action'.", "His name is used as the title of the hit 'Gorillaz' (qv) song and video \"'Clint Eastwood' (qv)\" (2001).", "Mentioned in the theme song of the 1980s TV hit _The Fall Guy (1981)_ (qv).", "Until his pride was displaced by discovery of a larger version of same tree in 2002, Eastwood used to be proud owner of tree believed to be the nation's largest known hardwood - a bluegum eucalyptus.", "Sworn in as parks commissioner for state of California at Big Basin Redwood Park, Santa Cruz, 8 June 2002. Holding up his new commissioner's badge, he told the crowd, \"You're all under arrest.\".", "2000 recipient of John F. Kennedy Center Honors.", "Received the Career Golden Lion at the Venice Film Festival. [August 2000]", "Of English, Scottish, Irish, and smaller amounts of German, Dutch, and Welsh, ancestry.", "His character's voice was provided by 'Enrico Maria Salerno' (qv) in _A Fistful of Dollars (1964)_ (qv), _For a Few Dollars More (1965)_ (qv) and _The Good, the Bad and the Ugly (1966)_ (qv). For the trilogy's American release, Eastwood redubbed his dialogue in English.", "When he directs, he insists that his actors wear as little makeup as possible and he likes to print first takes. As a result, his films consistently finish on schedule and on budget.", "When directing, he simply says \"okay\" instead of \"action\" and \"cut.\" (source: _Shootout (2003)_ (qv)).", "Weighed 11 lbs 6 oz at birth.", "His production company is Malpaso Productions, which he formed in 1968. The company's first feature release was _Hang 'Em High (1968)_ (qv).", "Mentioned on 'T.G. Sheppard' (qv)'s hit single \"Make My Day,\" which in the first half of 1984 reached #12 on Billboard's Hot Country Singles chart and also reached #62 on that magazine's Hot 100 singles survey.", "When 'Don Siegel' (qv) fell ill during production of _Dirty Harry (1971)_ (qv), Eastwood stepped in as director during the attempted-suicide/jumper sequence.", "Ex-wife Dina Ruiz ('Dina Eastwood' (qv)) is a former local television news anchor/reporter from Salinas, California. They met when she was assigned to interview him for KSBW-TV in April 1993. Dina admitted that she'd seen \"zero\" of his movies. The pair didn't start dating right away since Clint was expecting a baby with 'Frances Fisher' (qv). In February 1995, Clint made his first public appearance with Dina at a golf tournament, without ever announcing that he and Frances had broken up.", "Is 35 years older than ex-wife 'Dina Eastwood' (qv). Dina's parents were 19 and 21 when she was born; this makes Clint 16 years older than his former mother-in-law and 14 years older than his former father-in-law.", "Ex-brother-in-law of 'Dominic V. Ruiz' (qv) & 'Jade Marx-Berti' (qv).", "He got involved in an illicit relationship with 'Roxanne Tunis' (qv) in 1959 during the second season of _Rawhide (1959)_ (qv). Tunis was a regular extra/stuntwoman on the show. Their daughter 'Kimber Eastwood' (qv) was born in 1964 as Kimber Tunis. Following Kimber's birth, Eastwood asked Maggie Johnson for a divorce. But within a matter of weeks afterward, Johnson fell very ill with hepatitis and had to be hospitalized. Eastwood and Johnson reconciled, mutually understanding that it would be best if she turned a blind eye to his existing family, and in 1968, almost 15 years after they married, their first child together was born. Johnson was finally introduced to Tunis in 1972, outside Eastwood's presence, by a crew member on the set of _Breezy (1973)_ (qv). The affair between Eastwood and Tunis is believed to have dissolved in the mid-seventies, around the time he and 'Sondra Locke' (qv) got together. Tunis later appeared as an extra in _Every Which Way but Loose (1978)_ (qv) as a member of the audience at LA's Palomino country-western club where Locke's character sings, but Eastwood didn't tell Locke about Kimber until 1983. She thought it was cruel that he admitted he was Kimber's father but never treated her accordingly.", "Eastwood's two children from liaisons with Jacelyn Reeves were given their mother's last name. No father is listed on either of their birth certificates.", "He has always disliked the reading of political and social agendas in his films, which has occurred from _Dirty Harry (1971)_ (qv) to _Million Dollar Baby (2004)_ (qv). He has always maintained that all of his films are apolitical and what he has in mind when making a film is whether it's going to be entertaining and compelling.", "Has been named to Quigley Publications' annual Top 10 Poll of Money-Making Stars 21 times, making him #2 all-time for appearances in the top 10 list. Only 'John Wayne' (qv), with 25 appearances in the Top 10, has more. Eastwood, who first appeared in the Top Ten at #5 in 1968, finished #2 to Wayne at the box office in 1971 after finishing #2 to 'Paul Newman' (qv) in 1970. After his first two consecutive #1 appearances in 1972 and 1973, he dropped back to #2 in 1974, trailing 'Robert Redford' (qv) at the box office. Clint was again #2 in 1979, 1981 and 1982 (topped by 'Burt Reynolds' (qv) all three years), before leading the charts in 1983 and '84. He last topped the poll in 1993.", "Was named the top box-office star of 1972 and again in 1973 by the Motion Picture Herald, based on an annual poll of exhibitors as to the drawing power of movie stars at the box-office, conducted by Quigley Publications.", "He was the only nominee for the Best Actor Oscar in 2004 (for _Million Dollar Baby (2004)_ (qv)) to play a fictitious character. All four other nominees portrayed real people in their respective films.", "A sample of his whistling can be heard on the track \"Big Noise\" from his son 'Kyle Eastwood' (qv)'s jazz CD \"Paris Blue\" (2004).", "At The 45th Annual Academy 'Awards' (qv) (1973), he presented the 1972 Best Picture Oscar to 'Al Ruddy' (qv), the producer of _The Godfather (1972)_ (qv). Thirty-two years later they would jointly accept the 2004 Best Picture Oscar at the The 77th Annual Academy 'Awards' (qv) (2005), along with fellow _Million Dollar Baby (2004)_ (qv) co-producer 'Tom Rosenberg' (qv).", "At The 72nd Annual Academy 'Awards' (qv) (2000) he presented the Best Picture statuette to _American Beauty (1999)_ (qv).", "Was named the #1 top money-making star at the box office in Quigley Publications' annual poll of movie exhibitors five times between 1972 and 1993. 'Bing Crosby' (qv), 'Burt Reynolds' (qv) and 'Tom Hanks' (qv) also have been named #1 five times, while 'Tom Cruise' (qv) holds the record for being named #1 six times.", "'Stacy McLaughlin' (qv) filed a $100,000 lawsuit against Eastwood in May 1989 for \"knowingly, intentionally and deliberately\" ramming her Nissan Maxima with his quarter-ton pickup at the Burbank Studios on Dec. 16, 1988, when she mistakenly parked in his parking space while dropping off a tape at his Malpaso Productions office. Eastwood, who contended he was only trying to park his vehicle in its rightful space, paid $960 to repair the headlights and bumper of McLaughlin's car. She sought the additional money as punitive damages, claiming malice on Eastwood's part. The case went to court in July 1991, but a judge refused to grant the damages.", "At age 74, he became the oldest person to win the Best Director Oscar for _Million Dollar Baby (2004)_ (qv).", "He directed 11 different actors in Oscar-nominated performances: 'Gene Hackman' (qv), 'Meryl Streep' (qv), 'Sean Penn' (qv), 'Tim Robbins' (qv), 'Marcia Gay Harden' (qv), 'Hilary Swank' (qv), 'Morgan Freeman' (qv), 'Angelina Jolie' (qv), 'Matt Damon' (qv), 'Bradley Cooper' (qv), and himself (in _Unforgiven (1992)_ (qv) and _Million Dollar Baby (2004)_ (qv)). Hackman, Penn, Robbins, Freeman and Swank won Oscars for their performances in one of Eastwood's movies.", "For two consecutive years he directed two out of the four actors who won Oscars for their performances: 'Sean Penn' (qv) (Best Actor) and 'Tim Robbins' (qv) (Best Supporting Actor) in _Mystic River (2003)_ (qv)) in 2004, and 'Hilary Swank' (qv) (Best Actress) and 'Morgan Freeman' (qv) (Best Supporting Actor) for _Million Dollar Baby (2004)_ (qv)) in 2005.", "Received an honorary Doctorate from Wesleyan University in Connecticut. Wesleyan is also home to his personal archives. [2000]", "Every year the PGA tour comes to Pebble Beach, Ca., to host a celebrity golf tournament where celebrities team up with the professionals. Clint participated in this every year from 1962-2002 and is the longest running participant. He now serves as Host.", "In early 2005 he announced that he would supply the voice for a \"Dirty Harry\" video game. However, the game ended up getting canceled in 2007.", "Premiere Magazine ranked him as #43 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature. [2005]", "Favorite actor is 'James Cagney' (qv).", "Some of his favorite movies are _The 39 Steps (1935)_ (qv), _How Green Was My Valley (1941)_ (qv), _Sergeant York (1941)_ (qv), _The Ox-Bow Incident (1942)_ (qv) and _Chariots of Fire (1981)_ (qv).", "Some of his favorite actors are 'Gary Cooper' (qv), 'Humphrey Bogart' (qv), 'Robert Mitchum' (qv) and 'James Stewart' (qv).", "Became so fond of British pubs and beer during his time in London filming _Where Eagles Dare (1968)_ (qv) that he opened the Hog's Breath Inn with co-founders 'Paul E. Lippman' (qv) and Walter Becker in 1972. According to Lippman, \"I had to terminate three pretty good waitresses in the first few months of operation; not because they went to bed with 'Clint Eastwood' (qv), but because they either talked about it all over the premises, or came in the next day acting like they owned the place.\" The restaurant closed in 1999 and has since re-opened under new management.", "Has his look-alike puppet in the French show _Les Guignols de l'info (1988)_ (qv).", "He stood at 6'4\" at his peak, but due to recent back problems, he can only stretch up to 6'2\".", "He, 'Warren Beatty' (qv), 'Robert Redford' (qv), 'Mel Gibson' (qv), 'Richard Attenborough' (qv) and 'Kevin Costner' (qv) are the only directors best known as actors who have won an Academy Award as Best Director.", "President of jury at the Cannes Film Festival. [1994]", "Claimed that the trait he most despised in others was racism.", "The boots that he wore in _Unforgiven (1992)_ (qv) are the same ones he wore in the TV series _Rawhide (1959)_ (qv). They are now a part of his private collection and were on loan to the 2005 'Sergio Leone' (qv) exhibit at the Gene Autry Museum of Western Heritage in Los Angeles. In essence these boots have book-ended his career in the Western genre.", "Made six movies with former partner 'Sondra Locke' (qv): _The Outlaw Josey Wales (1976)_ (qv), _The Gauntlet (1977)_ (qv), _Every Which Way but Loose (1978)_ (qv), _Bronco Billy (1980)_ (qv), _Any Which Way You Can (1980)_ (qv) and _Sudden Impact (1983)_ (qv).", "As a director, he has always refused to test screen his films before their release.", "He objected to the end of _Dirty Harry (1971)_ (qv) when Harry throws his badge away after killing the Scorpio Killer, arguing with director 'Don Siegel' (qv) that Harry knew that being a policeman was the only work for which he was suited. Siegel eventually convinced Eastwood that Harry threw his badge away as a symbol that he had lost faith in the justice system.", "He was a contract player at Universal International in the mid-1950s. He and a younger actor named 'Burt Reynolds' (qv) were released from their contracts and left the studio on the same day. They were both fired by the same director. Eastwood was fired when the director didn't want to use him in a movie because of the wart above his top lip. Reynolds, who was serving as a stunt man, was fired after he shoved the director into a water tank during an argument over how to do a stunt fall.", "At the 2005 National Board of Review awards dinner in New York City, Eastwood joked that he would kill filmmaker 'Michael Moore' (qv) if Moore ever showed up at his home with a camera (an evident reference to Moore's controversial interview with actor/Second Amendment advocate 'Charlton Heston' (qv), for _Bowling for Columbine (2002)_ (qv)). After the crowd laughed, Eastwood said, \"I mean it.\" Moore's spokesman said, \"Michael laughed along with everyone else, and took Mr. Eastwood's comments in the lighthearted spirit in which they were given.\" Publicly, Eastwood has not commented further.", "Took acting class from 'Michael Chekhov' (qv) in Hollywood.", "In 1972 Eastwood attended President 'Richard Nixon' (qv)'s landslide victory celebration in Los Angeles, along with 'John Wayne' (qv), 'Charlton Heston' (qv) and 'Glenn Ford' (qv).", "Was appointed to serve on the National Council of the Arts by President Nixon in 1972.", "Has ruled out the possibility of playing Dirty Harry again, saying he has \"outgrown him age-wise.\"", "His performance as \"Dirty\" Harry Callahan in _Dirty Harry (1971)_ (qv) is ranked #92 on Premiere Magazine's 100 Greatest Performances of All Time.", "At a press conference for his movie _Mystic River (2003)_ (qv), Eastwood condemned the Iraq war as a \"big mistake\" and defended 'Sean Penn' (qv)'s visit to Baghdad, saying he might have done the same thing but for his age.", "Eastwood declined an offer from President 'George Bush' (qv) to campaign for him in the 1992 Presidential election. He told an interviewer the next year, \"I think what the ultra-right wing conservatives did to the Republicans is really self-destructive, absolutely stupid.\".", "His performance as Blondie in _The Good, the Bad and the Ugly (1966)_ (qv) is ranked #50 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "His performance as \"Dirty\" Harry Callahan in _Dirty Harry (1971)_ (qv) is ranked #42 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "Ended his longstanding friendship with onetime neighbor 'William R. Thompkins' (qv) in 1964.", "He claims that he wound up getting the role in 'Sergio Leone' (qv)'s _A Fistful of Dollars (1964)_ (qv) because 'James Coburn' (qv), to whom the role was originally offered, wanted $25,000. Eastwood accepted the role for $15,000.", "Was offered 'Al Pacino' (qv)'s role in _Any Given Sunday (1999)_ (qv), but turned it down because Warner Bros. wouldn't let him direct it also.", "Is a patron of the arts, notably as an avid collector of western art.", "Presented the Golden Globe Award for Best Director to 'Ang Lee' (qv) for _Brokeback Mountain (2005)_ (qv).", "His \"Fistful\" mannerisms was imitated in Canada, by the Tim Horton's restaurant chain, to promote the 2005 Southwest chicken sub.", "Claims to have been an early choice for the title role in _Superman (1978)_ (qv).", "Whenever asked if he would do a Dirty Harry 6, he often joked that he can imagine Dirty Harry now long retired, and fly-fishing with his .44 magnum.", "Cited as America's Favorite Movie Star by the Harris Polls conducted in 1993, 1994 and 1997. 'Tom Hanks' (qv) and 'Harrison Ford' (qv) are the only other actors to be cited as the #1 Movie Star as many times.", "He is \"Chevalier de la Légion d'Honneur\", a high French distinction that has been conferred on him by President 'Jacques Chirac' (qv) on February 17, 2007, as a tribute to his career as an actor and a filmmaker.", "Voted for 'Arnold Schwarzenegger' (qv) as Governor of California in 2003 and 2006.", "Son of 'Ruth Wood' (qv).", "In 1969 he attended a celebration of 'John Wayne' (qv)'s 40-year career at Paramount Pictures, along with 'Lee Marvin' (qv), 'Rock Hudson' (qv), 'Fred MacMurray' (qv), 'James Stewart' (qv), 'Ernest Borgnine' (qv), 'Michael Caine' (qv) and 'Laurence Harvey' (qv).", "Semi-fluent in Italian.", "Had to fill in for 'Charlton Heston' (qv) at The 44th Annual Academy 'Awards' (qv) (1972) until Heston arrived.", "Was offered 'Gregory Peck' (qv)'s role in _Mackenna's Gold (1969)_ (qv), but turned it down to make _Hang 'Em High (1968)_ (qv) instead.", "The producers of _Dirty Harry (1971)_ (qv) originally didn't want Eastwood, since they felt he was too young at 41. After older stars like 'John Wayne' (qv), 'Frank Sinatra' (qv) and 'Robert Mitchum' (qv) turned the film down, Eastwood was cast. He last played Harry Callahan aged 58 in _The Dead Pool (1988)_ (qv), which was only a year older than the character was supposed to be in the first film according to the original screenplay.", "'William Friedkin' (qv) offered him the lead in _Sorcerer (1977)_ (qv), but Eastwood didn't want to travel anywhere at that time. 'Jack Nicholson' (qv) turned the film down for the same reason.", "Mentioned in theme song in _The Adventures of George the Projectionist (2006)_ (qv).", "Received an honorary Doctor of Humane Letters from the University of Southern California. [May 2007]", "Learned mountain climbing for _The Eiger Sanction (1975)_ (qv) because he felt the scenes were too dangerous for him to pay a stuntman to do for him. He was the last climber up The Totem Pole in Monument Valley, and as part of the contract, the movie crew removed the pitons left by decades of other climbers. The scene where he was hanging off the mountain by a single rope was actually Eastwood, and not a stuntman.", "An accomplished jazz pianist, he performs much of the music for his movies, including the scene in the bar in _In the Line of Fire (1993)_ (qv).", "California Gov. 'Arnold Schwarzenegger' (qv) and First Lady 'Maria Shriver' (qv) inducted Eastwood into the California Hall of Fame located at The California Museum for History, Women, and the Arts. [December 2006]", "Along with 'John Travolta' (qv) and 'Tom Selleck' (qv), he attended the formal state dinner at the White House held by President 'Ronald Reagan' (qv) to welcome 'Prince Charles' (qv) and 'Princess Diana' (qv) to the United States in 1985.", "In the late 1980s he discussed remaking the classic 'Sam Peckinpah' (qv) western _Ride the High Country (1962)_ (qv) with 'Charlton Heston' (qv).", "He was made a Fellow of the British Film Institute in recognition of his outstanding contribution to film culture.", "'William Goldman' (qv) said of Eastwood that he was the only person to be a star in the '70s, '80s and '90s. By \"star\" Goldman means Variety's list of top ten actors of the decade.", "Former longtime companion 'Sondra Locke' (qv) blasted Eastwood in her autobiography \"The Good, the Bad & the Very Ugly: A Hollywood Journey\" (1997). Locke described Eastwood as \"a monster who thought nothing of destroying anything inconvenient to him\" and likened the actor to 'O.J. Simpson' (qv). \"Others who knew Clint said that I had been 'far too kind' to him,\" she said of this evisceration. (Neither Eastwood or his publicist, 'Joe Hyams' (qv), would comment.) Locke reiterated previous testimony that Eastwood had manipulated her into having two abortions and sterilizing herself in the 1970s and sabotaged her directorial career after their 1989 split. But she also made a new allegation that he sired another woman's two children during the last three years of their relationship. The allegation of secret children was not even acknowledged by mainstream media, despite the fact that Locke's book exposed the kids' names and exact birthdates. Published reviews misrepresented the book by omitting its serious accusations and emphasizing trivial tidbits instead. (One anecdote widely printed in lieu of anything relevant was Eastwood's habit of asking \"Sweetie, did you floss?\" before they made love.) Locke learned of Eastwood's double life, she wrote, when an investigative journalist phoned her during depositions in the palimony case. The extraordinary revelation -- that Eastwood had a hidden family in Carmel, residing in a house under his business manager Roy Kaufman's name -- was confirmed in closed court after Locke filed a motion to discover and Eastwood's will was called in for evidence, with the document showing one Jacelyn Reeves and Reeves' legally fatherless son and daughter listed as beneficiaries.", "In April 1989, 'Sondra Locke' (qv) filed a $70 million palimony lawsuit against Clint, after he changed the locks on their Bel-Air home and moved her possessions into storage while she was at work on the _Impulse (1990)_ (qv) set. The relationship had been on the rocks for months, with Clint leaving nonverbal hints that he wanted Sondra to get out of his life voluntarily (once, while she was still in the shower, he left to go to a party to which they'd both been invited), but they weren't officially broken up. During the 15 days between the lockout and Sondra filing suit, she tried to resolve things quietly, but Clint offered her nothing and would only communicate via lawyers. (To Sondra, an equal division of assets was principle rather than greed. She had actually saved up $3 million over the course of her 14-year relationship with Clint because he was paying all their expenses.) Clint refused to say Sondra's name out loud at his depositions, reducing her to pronouns or alternately referring to her as \"the person.\" He also never made eye contact or any reference to her proximity in the courtroom. Sondra said the stress of the ordeal induced breast cancer, requiring mastectomies. In November 1990, 19 months into proceedings, she arranged to meet with Clint in private and achieved an immediate settlement. Sondra received $450,000 lump sum plus monthly support payments, title to a house in West Hollywood that Clint had been leasing to her lawful wedded but openly gay husband 'Gordon Anderson' (qv), and a $1.5 million multi-year contract with Warner Bros. to develop and direct films. By 1994, however, the studio had yet to provide Sondra with a single directorial assignment and rejected over 30 projects she submitted. Sondra became convinced the deal was a sham and that she was employed only on paper. \"I was stunned and outraged at how I had been tricked and cheated\" she said. (Her attorney, Peggy Garrity, would later claim Clint held out the Warner deal like a \"dangled carrot\" to get her to drop the palimony suit.) Sondra sued Clint again for fraud in June 1995, having unearthed a bookkeeping printout to corroborate the charge. She asserted that the money WB pretended they were paying her came from Clint's own pocket and had been laundered through the operating budget for _Unforgiven (1992)_ (qv). The case went to trial in September 1996; one juror disclosed that the panel agreed to find for Sondra by a 10-to-2 vote (nine votes are needed for a verdict) and were only debating the amount. Clint's legal team convinced him to settle at the eleventh hour, and on the morning jurors were set to begin a second day of deliberation, Sondra announced her decision to drop her suit against Clint in return for an unspecified monetary reward. As Clint walked down the courthouse steps, he told a bank of cameras, \"What does this say to young women across the country who work very hard for a living?\" (A nonsensical remark, since the case he had just lost was all about work--work he had obstructed his ex-soulmate from doing.) Sondra then brought separate action against Warner Brothers, seeking $100 million in damages for conspiring with Clint to ruin her career. It was settled out of court in May 1999, ending the decade-long legal saga. While she was bound by confidentiality not to reveal the amount, Locke wasn't shy about disclosing her feelings. \"I feel elated. This has been the best day in a long, long time\" she told reporters.", "Though he often smokes in his movies, he is a lifelong non-smoker offscreen.", "Although he can handle pistols with either hand equally well, he is left-eye dominant, evident when he shoots a rifle as in _Joe Kidd (1972)_ (qv) or _Unforgiven (1992)_ (qv), but is right handed, as seen when he wears or handles one pistol.", "He and 'Burt Reynolds' (qv) had major influences on each other's careers. It was he who sent a copy of \"Sharky's Machine\" to Reynolds, which gave Reynolds the idea to turn the novel into a movie, _Sharky's Machine (1981)_ (qv), which went on to garner excellent reviews. On the other hand, it was Reynolds who sent Clint a copy of \"The Outlaw Josey Wales\", later made into a film by Eastwood (_The Outlaw Josey Wales (1976)_ (qv)). Years later, Reynolds told him about \"this great novel\" called \"The Bridges of Madison County\", and some time later it was shot by Eastwood (_The Bridges of Madison County (1995)_ (qv)).", "Served as mayor of Carmel-by-the-Sea, CA for one term for the nominal salary of $300. A small contingent insisted that Eastwood was a spoiled brat mayor and the town acted just like an indulgent parent. \"We wanted to eliminate traffic and parking problems, not make more with hordes of tourists. He brought a lot of notoriety that we didn't need,\" said Jane Mayer, president of the Carmel Residents Association. \"Some people thought he was charming, but I disagree. He didn't know anything about the issues. People are giving him credit for things that were on the table for years. He also hired a public relations woman and kept an unlisted phone number - he was totally inaccessible. I don't think that's being a good mayor.\" \"It was a disaster,\" added former mayor Gunnar Norberg. \"Eastwood turned a peaceful forest by the sea into Coney Island.\" Norberg claimed his blood pressure hit such heights when he was around Eastwood that his doctor refused to let him attend council meetings. 'Sondra Locke' (qv), Eastwood's cohabiting partner at the time, later acknowledged she \"knew he wasn't the dedicated mayor he pretended to be.\".", "Turned down the role of Captain Willard in _Apocalypse Now (1979)_ (qv) because he found the storyline \"too dark.\" The role went to 'Martin Sheen' (qv).", "Was offered the role of James Bond in _Live and Let Die (1973)_ (qv). He was flattered, but declined, saying that Bond should be played by an English actor.", "Has a younger sister named Jeanne Bernhardt (b. 1934) and two nieces, Anna (b. 1958) and Celia (b. 1961).", "Owns a hillside mansion in Sun Valley, Idaho and a beachfront estate in Maui.", "Notable women Eastwood had affairs with include actresses 'Mamie Van Doren' (qv), 'Inger Stevens' (qv), 'Jean Seberg' (qv), 'Jo Ann Harris' (qv), 'Jamie Rose' (qv), 'Rebecca Perle' (qv), 'Jill Banner' (qv), 'Catherine Deneuve' (qv) and 'Susan Saint James' (qv); competitive swimmer 'Anita Lhoest' (qv); singer 'Keely Smith' (qv); restaurant critic 'Gael Greene' (qv); columnist 'Bridget Byrne' (qv); French model 'Cathy Reghin' (qv); WB story analyst Megan Rose; wildlife activist 'Jane Cameron Agee' (qv); and former Carmel mayor Jean Grace. Generally, however, Eastwood preferred unknown women he would not later accidentally meet. In his early 40s, he'd sometimes pick up young ladies from the Carmel tourist shops for quick intercourse in his truck parked on Dolores Street.", "Practices transcendental meditation twice a day, and said in 2013 that he has been meditating for the past 40 years.", "Father was Clinton Eastwood Sr. (1906-1970), an executive at Georgia Pacific LLC, a pulp and paper manufacturing company. Stepfather, after his widowed mother remarried in 1972, was John Belden Wood (1913-2004), a lumber executive.", "Considered for the role of Rambo in _First Blood (1982)_ (qv) long before 'Sylvester Stallone' (qv) was hired.", "He was awarded the American National Medal of the Arts on February 25, 2010 for his services and contributions to the arts.", "Profiled in \"Directors Close Up\" by 'Jeremy Kagan' (qv). [2005]", "Declined to have a party for his 80th birthday, explaining that at his age he doesn't like birthday parties for himself. He said his only plans to celebrate the occasion would be to go out for a drink with his wife.", "The genesis of his production company, Malpaso Productions, had a curious origin. When Italian director 'Sergio Leone' (qv) approached Eastwood about appearing in what would become the \"Spaghetti Western\" trilogy--_A Fistful of Dollars (1964)_ (qv), _For a Few Dollars More (1965)_ (qv) and _The Good, the Bad and the Ugly (1966)_ (qv)--Eastwood was eager to take it but was advised against it by his agent, suggesting it would be a \"bad move\" (mal paso). Against all advice, the actor went ahead and accepted the \"man with no name\" role and his decision turned out to be a \"good move\". Eastwood never forgot the irony of the situation and adopted \"Malpaso\" as his production company name.", "Turned down the role of Harmonica in _Once Upon a Time in the West (1968)_ (qv), which went to 'Charles Bronson' (qv).", "'Sergio Leone' (qv) asked him and his _The Good, the Bad and the Ugly (1966)_ (qv) co-stars 'Eli Wallach' (qv) and 'Lee Van Cleef' (qv) to appear in _Once Upon a Time in the West (1968)_ (qv). The idea was reportedly scrapped due to scheduling conflicts with other films, although some rumors state they declined when they heard that their characters were going to be killed off by 'Charles Bronson' (qv)'s character in the first five minutes. Leone filmed the scene instead with character actors 'Woody Strode' (qv), 'Jack Elam' (qv) and 'Al Mulock' (qv).", "Attended Glenview Elementary School, Crocker Highlands Elementary School and Frank C. Havens Elementary School, all located within a short distance of each other in Oakland and Piedmont. He was held back due to poor academic scores, but in at least one case, delinquent behavior was the reason he left one school to enroll in another. He went to Piedmont Junior High and attended Piedmont High School from January 1945 to at least January 1946. Eastwood was asked to leave Piedmont High for writing an obscene suggestion to a school official on the athletic field scoreboard, and burying someone in effigy on the school lawn, on top of other school infractions. He transferred to Oakland Technical High School, scheduled to graduate in January 1949 as a midyear graduate, although it is not clear if he ever did.", "Served as President of the Cannes Jury when _Pulp Fiction (1994)_ (qv) won but the film was not his personal choice: \"On the jury here when 'Pulp Fiction' won, somebody said, 'Oh, 'Clint Eastwood' (qv) was on the jury, so he voted for the American film.' But my sensibilities are European, here is where my success started. Actually, 'Yimou Zhang' (qv)'s _To Live (1994)_ (qv) was my favorite piece, but most of the European jurors seemed to like 'Pulp Fiction.'\".", "Five of his movies were nominated for AFI's 100 Years...100 Movies: _Dirty Harry (1971)_ (qv), _The Outlaw Josey Wales (1976)_ (qv), _Unforgiven (1992)_ (qv), _Mystic River (2003)_ (qv) and _Million Dollar Baby (2004)_ (qv). \"Unforgiven\" made the list at #68, 30 places up from its original rank at #98.", "Turned down 'Paul Newman' (qv)'s role in _The Towering Inferno (1974)_ (qv).", "'Paul Haggis' (qv), who wrote the screenplay for _Million Dollar Baby (2004)_ (qv), offered Eastwood the role of Hank Deerfiled in _In the Valley of Elah (2007)_ (qv). Eastwood turned it down and recommended 'Tommy Lee Jones' (qv), who went on to receive a Best Actor Oscar nomination for his performance.", "He was going to play the villain Two-Face on the _Batman (1966)_ (qv) TV series, but the show was canceled before the episode began shooting.", "Although he has been associated with violence throughout his career, he personally detests it and has carefully shown the horrific consequences of violence in films such as _Unforgiven (1992)_ (qv), _A Perfect World (1993)_ (qv), _Absolute Power (1997)_ (qv), _Mystic River (2003)_ (qv), _Million Dollar Baby (2004)_ (qv) and _Gran Torino (2008)_ (qv).", "According to 'Robert Daley' (qv), the head of Warner Bros. when Eastwood made 15 pictures there, none of those films ever included preview screenings because Clint \"doesn't believe in the preview process\".", "He and 'Warren Beatty' (qv) are the only actor-directors to earn Best Actor and Best Director Oscar nominations for the same film two times.", "His signature character, \"The Man With No Name\", is portrayed by 'Timothy Olyphant' (qv) as \"The Spirit of the West\" in _Rango (2011)_ (qv).", "A former logger, steel furnace stoker and gas station attendant before becoming an actor.", "Directed two films concurrently in 1973; _High Plains Drifter (1973)_ (qv) and _Breezy (1973)_ (qv).", "Cinematographer 'Bruce Surtees' (qv) and actor 'Geoffrey Lewis' (qv) are regulars in Eastwood films (he's directed).", "Father-in-law of 'Stacy Poitras' (qv) and 'Shawn Midkiff' (qv).", "In Cape Town, South Africa, filming _Invictus (2009)_ (qv). [March 2009]", "Attending Cannes premiere of latest film _Changeling (2008)_ (qv), a period thriller set in the 1920s. [May 2008]", "The character Shane Gooseman (\"Goose\" for short) from the animated space opera _The Adventures of the Galaxy Rangers (1986)_ (qv) was based on him and his screen persona.", "A guest speaker at the 2012 Republican National Convention, Eastwood spent much of his speech time on a largely improvised routine addressing an empty chair representing President 'Barack Obama' (qv). It generated many responses and a lot of discussion. Old flame 'Frances Fisher' (qv) wrote a condemning post on Facebook and insinuated that Eastwood's appearance was a publicity stunt to get more tickets sold for his new movie _Trouble with the Curve (2012)_ (qv), adding \"I've seen this act before. And I didn't buy it. Crazy like a fox. I saw the same act sitting with therapists, mediators and lawyers. [...] Even though I am certainly not a Republican, I felt bad for the people who thought this was a good idea.\" Several commentators including 'Bill Maher' (qv) sidetracked to point out the hypocrisy of Eastwood's mere presence at the gathering, since his inordinately adventurous love life antithesizes the \"family values\" advocated by Presidential nominee 'Mitt Romney' (qv) on the same stage that evening.", "Has played the same character in more than one film three times: The Man with No Name in the Leone trilogy, Philo Beddoe in the Any Which Way movies and Harry Callahan in the Dirty Harry franchise.", "He appeared in and directed two Best Picture Academy Award winners: _Unforgiven (1992)_ (qv) and _Million Dollar Baby (2004)_ (qv). 'Morgan Freeman' (qv) also appeared in both films.", "Had planned to star in _Die Hard (1988)_ (qv) and originally owned the rights to the novel \"Nothing Lasts Forever\" on which the film is based, but opted to make _The Dead Pool (1988)_ (qv) instead.", "Ranked #19 in Forbes magazine's list of the world's 40 best-paid entertainers, with estimated earnings of $44 million in 1995 and 1996. [September 1996]", "Along with 'Orson Welles' (qv), 'Laurence Olivier' (qv), 'Woody Allen' (qv), 'Warren Beatty' (qv), 'Kenneth Branagh' (qv) and 'Roberto Benigni' (qv), he is one of only seven men to receive Academy Award nominations for both Best Actor and Best Director for the same film: Welles for _Citizen Kane (1941)_ (qv), Olivier for _Hamlet (1948)_ (qv), Allen for _Annie Hall (1977)_ (qv), Beatty for both _Heaven Can Wait (1978)_ (qv) and _Reds (1981)_ (qv), Branagh for _Henry V (1989)_ (qv), Eastwood for _Unforgiven (1992)_ (qv) and Benigni for _Life Is Beautiful (1997)_ (qv).", "Ex-significant other 'Sondra Locke' (qv) was legally married to homosexual 'Gordon Anderson' (qv) from 1967 until her death in 2018, covering the whole time she and Eastwood were living together. While house hunting with Locke in the late seventies, Eastwood introduced himself as \"Mr. Anderson,\" even when he happened to be wearing a _Thunderbolt and Lightfoot (1974)_ (qv) T-shirt. Locke recalled that the sales agents could barely keep a straight face and always looked at their feet when addressing him as such.", "'Biography' (qv) in: John Wakeman, editor. \"World Film Directors, Volume Two, 1945- 1985\". Pages 294-302. New York: The H.W. Wilson Company, 1988.", "Early in his career he appeared in a \"B\" western, _Ambush at Cimarron Pass (1958)_ (qv), in which he was billed third and leading lady 'Margia Dean' (qv) was billed second. Years later, after Eastwood had become a superstar actor and director, Dean ran into him at a social function and teased him, \"Just remember, I got top billing over you\".", "Went through a brief period in Hollywood sitting for hours on a Schwab's drugstore stool in a tight sweater waiting to be \"discovered\" à la 'Lana Turner' (qv).", "Has a grandson born in February 1984 named Clinton Eastwood Gaddie from his illegitimate daughter Kimber Tunis ('Kimber Eastwood' (qv)). Clint and 'Roxanne Tunis' (qv) are great-grandparents via Kimber's son, to great-grandson Clinton IV (born 2011) and great-granddaughter Penelope (born 2018). Their existences have never been acknowledged in the press.", "Clint and former spouse Maggie Johnson were estranged for at least nine years and legally separated for six before she filed for divorce in May 1984 (it was finalized that November). Johnson had finally decided to make the split official so she could marry 'Henry Wynberg' (qv), a used car salesman slightly younger than herself. The Johnson-Wynberg union ended in 1989 after four years, and in 1992 Wynberg, then 58, married a 19-year-old Costa Rican woman.", "Couples in his social circle used to include 'Merv Griffin' (qv) & 'Eva Gabor' (qv), 'Bud Yorkin' (qv) & 'Cynthia Sikes' (qv), 'Richard D. Zanuck' (qv) & 'Lili Fini Zanuck' (qv), 'Arnold Schwarzenegger' (qv) & 'Maria Shriver' (qv).", "Had a falling out with longtime associate 'Fritz Manes' (qv) during the filming of _Heartbreak Ridge (1986)_ (qv). Manes was fired over the telephone by Eastwood's secretary. When Manes went over to Malpaso to collect his belongings, the locks on his office had been changed and his possessions were sitting outside next to a dumpster.", "Dated 'Marisa Berenson' (qv), 'Dani Crayne' (qv), 'Barbra Streisand' (qv) and 'Barbara Minty' (qv).", "Landed his breakthrough role in _A Fistful of Dollars (1964)_ (qv) after 'Charles Bronson' (qv), 'Rory Calhoun' (qv), 'James Coburn' (qv), 'Henry Fonda' (qv), 'Ty Hardin' (qv), 'Steve Reeves' (qv), 'Tony Russel' (qv) and 'Henry Silva' (qv) all turned it down.", "Wanted to direct _Angels & Demons (2009)_ (qv), but didn't get the chance because 'Ron Howard' (qv) was contractually obligated to direct it because of his contract from _The Da Vinci Code (2006)_ (qv).", "Once said that his wide hips were his only physical flaw, except for the chipped tooth he eventually had fixed.", "Hired a private detective in the early 1980s when his company, Malpaso Productions, began to receive a series of strange, threatening letters addressed to him mailed from various California locations by someone who seemed to have inside knowledge of his life. The trouble was, the detective had an extremely long list of possible Clint enemies and ex-girlfriends but no real clues as to who might be the culprit. After a while suspicion focused on 'Jane Cameron Agee' (qv), an off-and-on paramour of Eastwood's then married to actor 'James Brolin' (qv). Eastwood scoffed at the idea it was her and thought it might be an actress friend of ex-mistress 'Roxanne Tunis' (qv), seeking some kind of revenge on him. One night he drove around the Hollywood Hills with 'Fritz Manes' (qv) trying to find this woman's address. He tried to convince Manes that they should burgle her place, and see if the lady's typewriter matched up with the letters. Manes said no, and the vile letters eventually waxed and waned.", "When he was 19, he gained unwanted attention from a 23-year-old schoolteacher who stalked him after a one-night stand and threatened to kill herself.", "Wanted to play 'Charles A. Lindbergh' (qv) in _The Spirit of St. Louis (1957)_ (qv) and penned a letter to director 'Billy Wilder' (qv) in October 1954 requesting to meet in person to discuss his potential eligibility for the role. Eastwood had just done his first screen test for Universal Pictures but had yet to make his acting debut. The role ultimately went to an established star, 'James Stewart' (qv).", "Agent is 'Leonard Hirshan' (qv).", "On Christmas morning 2001, his daughter 'Francesca Eastwood' (qv) and her mother 'Frances Fisher' (qv) narrowly escaped a fire that engulfed their rented house in North Vancouver, Canada. Francesca leaped 15 feet from a second-story window into the arms of her mother and a neighbor, and was treated at a hospital for smoke inhalation. Frances was also treated for burns on her hands. Clint flew up to visit them in the hospital and personally thanked his daughter's rescuers.", "One of several celebrity endorsers of 'David Lynch' (qv)'s Foundation for Consciousness-Based Education and World Peace.", "On a return air trip from a prearranged tryst in Seattle, a two-seated plane on which he was aboard ran out of fuel and crashed into the Pacific Ocean near Point Reyes. Using a life raft, Eastwood and the pilot swam 2 miles to shore. After the fact publicity erroneously infers that this occurrence was somehow war related. [September 1951]", "Former father-in-law of 'Kirk Fox' (qv) and 'Jordan Feldstein' (qv).", "Says he voted for 'Dwight D. Eisenhower' (qv) in 1952 and 1956, 'Richard Nixon' (qv) in 1968 and 1972, 'Ronald Reagan' (qv) in 1980 and 1984, 'Ross Perot' (qv) in 1992, and 'John McCain' (qv) in 2008.", "Had a long-held obsession with New York Times film critic 'Pauline Kael' (qv) because she never liked his work. After her review of _The Enforcer (1976)_ (qv), Clint asked a psychiatrist to do an analysis of Kael from her reviews of his past work, which he had memorized verbatim. It concluded that Kael was actually physically attracted to Clint and because she couldn't have him she hated him. Therefore, it was some sort of vengeance, according to Clint.", "Was interested in the prospect of playing Hank Rearden in a cinematic adaptation of \"Atlas Shrugged\" that was in development by 'Al Ruddy' (qv) in the early '70s.", "A slow bloomer in almost every regard, Clint was going on 19 when he left high school (in an era where some students graduated at 16), got his first big film role at age 34, waited until he turned 38 to start a family (not including illegitimate unmentionables), made his directorial debut at 41, and received his first Oscar nomination when he was nearly 63.", "Accounts from inside the courtroom in the fraud case brought against him by 'Sondra Locke' (qv) noted that Eastwood spoke in a barely audible tone on the witness stand and was unable to cross-reference. In one deposition he used the phrase \"I have no records on that\" 79 times.", "Developed his movie voice by listening to audio recordings of 'Marilyn Monroe' (qv). He said he'd noticed Monroe's breathy whisper and he thought it was very sexy and since it had worked so well for her, he decided he'd \"do\" a male version of it himself.", "Has at least six homes in the state of California alone. One of them, the 1,067.5 acre Rising River Ranch near Cassel, formerly belonged to 'Bing Crosby' (qv); Eastwood bought it in November 1978 for $1.9 million after it fell into probate. In July 1979, he paid a little over $1.1 million for a 6,136-square-foot house in Bel Air, just a mile northwest of UCLA. He eventually acquired the place next door as well. The most expensive property he owns is a 15,000-square-foot estate in Carmel, which he spent approximately $20 million building in 2010.", "Parodied by 'Bill Hader' (qv) on _Saturday Night Live (1975)_ (qv).", "Used to be buddies with 'Robert Donner' (qv), 'George Fargo' (qv) and 'Chill Wills' (qv).", "Past cars have included Audi, Ferrari, Mercedes-Benz and GMC Yukon. As of 2016 he is still driving at 86 years old and his vehicle of choice is an unmarked Ford Crown Victoria.", "According to author 'Patrick McGilligan' (qv), in July 1993 Eastwood was confronted with the claims of a woman in her late thirties, originally from Washington State, who had researched her adoption and ascertained that he was her biological father. After having his lawyers and business managers check her out, so the story goes, Eastwood agreed to have dinner with the woman, Laurie Murray, who was married to a rich man and was happy to guard her anonymity - she just wanted to meet him - and promised to stay in touch. (It is worth noting that although McGilligan's book is touted as being scrupulously researched, it does contain easily discernible errors concerning people in Eastwood's life, e.g. ex-consort 'Sondra Locke' (qv)'s year of birth, son 'Kyle Eastwood' (qv)'s marital status at a given time and the gender of Clint's only grandchild of record, 'Graylen Eastwood' (qv).) In Les grands reportages: L'album secret de 'Clint Eastwood' (qv) (2013), McGilligan stated on camera: \"We don't know how many children Clint has had.\" Besides Ms. Murray, since at least 2005 there is a rumor of unknown origin that Eastwood fathered a son named Lesly born on 13 February 1959 to one Rosina Mary Glen. Publicly, Eastwood has neither confirmed nor denied any of these claims.", "Avid tennis player in the past.", "Turned down _The Bucket List (2007)_ (qv).", "Doesn't use text messaging and prefers landline when he talks on the phone.", "His first onscreen kiss was with 'Carol Channing' (qv) in _The First Traveling Saleslady (1956)_ (qv).", "In addition to his multiple houses, he has a well-appointed apartment behind his studio office in Burbank. In Carmel he used to keep an apartment on the third floor of a building two doors down from the Hog's Breath Inn.", "Turned down the role of Archie Gates in _Three Kings (1999)_ (qv) which went to 31-years-younger 'George Clooney' (qv). Coincidentally, Eastwood and Clooney have both been romantically linked with 'Frances Fisher' (qv).", "Cited under the pseudonym Mr. Smith in 'Durk Pearson' (qv) & 'Sandy Shaw' (qv)'s self-help book, \"Life Extension: A Practical Scientific Approach\" (1982).", "A July 1968 newspaper item by 'Dorothy Manners' (qv) gives insight to his rapid rise to stardom: \"'Clint Eastwood' (qv) is on his way to earning $750,000 per picture while the proverbial man in the street is still asking, 'Who's 'Clint Eastwood' (qv)?' He's the hottest property sight unseen (almost) in Hollywood today.\" Clint was 38 years old.", "Has always been allergic to horses, which is why, in his westerns, he is rarely seen in close-up on horseback. When he had to ride horses in films, he would first have to sniff medication into his nose and lungs. On _Bronco Billy (1980)_ (qv) it left him constantly miserable. One time he was so frustrated he socked his horse in the nose.", "'Ferris Webster' (qv) worked exclusively as Eastwood's film editor for a decade, but the two had a falling out during postproduction on _Firefox (1982)_ (qv).", "The only biographical book he's ever authorized is \"'Clint Eastwood' (qv): A 'Biography' (qv)\" (1996) by 'Richard Schickel' (qv). It provides extensive plot summary for each of Eastwood's movies but leaves his life little documented by comparison (not to mention omitting several of Eastwood's families). What it does say about his life, while approved by Clint, doesn't sit well with everyone. 'Sondra Locke' (qv) denounced Schickel's book as a \"puff piece\" and said it was \"full of misstatements and downright fabrication, not only about me but others.\" Schickel, who also provided audio commentary for Eastwood films on DVD, passed away in 2017. Locke died a year later.", "Clint's first wife Maggie encouraged him to marry 'Frances Fisher' (qv), with whom she and her two kids by Clint, Alison and Kyle, got along great. Fisher was aware of Clint's other family Roxanne and Kimber Tunis, but it was only after giving birth to Eastwood's child that she discovered - not through him - that he had yet another brood with Jacelyn Reeves. So it didn't really come as a surprise to anyone in the know when they decided not to get married, splitting when their daughter Francesca was barely a year old. Frances later had a face-to-face encounter with Reeves at the funeral of one of Clint's golf buddies.", "Has no middle name.", "Without taking any acting jobs, he earned $17 million for the period of a year ending in 2010: $6 million apiece for directing _Invictus (2009)_ (qv) and _Hereafter (2010)_ (qv), $4 million in DVD royalties for _Gran Torino (2008)_ (qv), plus $1 million in royalties from earlier projects.", "Completely avoids soda and rarely drinks alcohol.", "Personal physician Dr. 'Harry Demopoulos' (qv) told Muscle & Fitness magazine in 1991 that Clint never eats fat, takes his antioxidants faithfully, works out like a demon and gets plenty of sleep, which is an area that is often neglected in a fitness program.", "He started lifting weights at 19, when weight training and bodybuilding were relegated to back-alley sweatshops with black-iron plates.", "Eastwood's image was untouched by personal scandal of any sort until late April 1989, when his girlfriend of 14 years, 'Sondra Locke' (qv), made it known to the world that she had undergone two abortions and a tubal ligation \"at his specific request.\" (\"I had done the unthinkable. I had publicly exposed him,\" she commented in retrospect.) The breakup with Locke opened the floodgates to investigative journalism about Eastwood. In July 1989, the National Enquirer reported the existence of a love child he fathered in 1964, and in February 1990, the Star tabloid became the first publication to link Eastwood's name with Jacelyn Reeves--who, it turns out, was the mother of two of his unmentionable offspring. Reputable news outlets wouldn't touch this information for years after. Almost certainly, his career would have suffered had this become public knowledge during the fact. Almost certainly, knowledge of this (and other out-of-wedlock children) would have hampered his 1986 mayoral campaign. When Locke's memoirs were published in 1997, she was shut out of most venues to promote the book. \"Sadly, it was well suppressed by Clint and WB. [...] I was sad that it did not get the attention I feel it deserved,\" she said in 2013. \"Clint: The Life and Legend,\" a deeply unflattering biography by film historian 'Patrick McGilligan' (qv), was published in Great Britain in 1999, but did not make its way to the United States until 2002, having bounced around publishers for three years amid rumored threats from Eastwood's attorneys. Los Angeles Times critic 'Allen Barra' (qv) called it \"perhaps the most thoroughly demythologizing book yet written on modern Hollywood.\" On Christmas Eve 2002, Eastwood's lawyer 'Marshall Grossman' (qv) filed a $10 million libel suit against McGilligan and St. Martin's Press in San Jose, California. Strangely enough, out of all the sordid stories in the book, the libel claim only covered three points, according to news reports: (1) That Eastwood once punched his first wife Maggie Johnson in the face; (2) That Eastwood is an atheist; (3) That Eastwood used a romantic relationship with an officer's daughter in order to avoid being sent overseas during the Korean conflict. The suit was settled in July 2004 without any public disclosure; McGilligan and the publisher admitted no wrongdoing and there was no penalty. A revised and updated version of \"Clint\" was published in 2015, with most of the original content intact. The three cited passages had been excised, and a few other modifications amounting to less than two pages were made. McGilligan says many of things he reported in the first edition are now taken for granted, and one of the reasons Eastwood sued him was an obvious attempt to find out his sources.", "Net worth was estimated at $375 million prior to his 2014 divorce from 'Dina Eastwood' (qv). No terms of financial settlement were revealed in the divorce decree, so it's unclear where his personal fortune currently stands.", "A bachelor again at age 84, he's been seen in the company of photographer Erica Tomlinson-Fisher and restaurant hostess Christina Sandera in recent times, and has reportedly bought homes for both women. [2014]", "Had hair transplants in the mid-1980s. When his head was wrapped in white bandages after the surgery, he told people he'd been in a bicycle accident.", "Was asked for permission about his name being used for Marty ('Michael J. Fox' (qv)) in _Back to the Future Part III (1990)_ (qv). He consented and was said to be tickled by the homage.", "Eastwood was _Ratboy (1986)_ (qv)'s de facto producer and exerted complete creative control, so first-time director 'Sondra Locke' (qv) had an obligation to show the revised screenplay to him after she did some collaborative editing with 'Gordon Anderson' (qv). Eastwood sat up in bed one night reading the new draft, while Locke sat next to him, watching him warily. Yet he seemed to be enjoying it, laughing as he read and scribbling in the margins. The next day, Locke arrived at Malpaso offices first and told credited producer 'Fritz Manes' (qv) not to worry, Clint loved the changes. Eastwood came in the door about noontime because he never came in early. According to Manes, \"He was purple...I've never seen him so f***ing mad. He takes this thing and he throws it so hard it almost broke the window behind me. He said, 'I'm closing this thing down. How could you let her do this?'. I said, 'I thought you knew.' He said, 'Well, you don't have to worry about this piece of s*** anymore. I'm going out and telling Warners to shut the production down.'\" Clint went to the outer office and grabbed Sondra and they went off somewhere and had a huge explosion. Manes went over to the floor and picked up the script. \"It had F*** - C***SUCKER - S*** - across every page,\" said Manes. \"Every page had some awful thing on it like some lunatic had scribbled all over it!\" Production ultimately went ahead, but Locke had to abandon Anderson's script and all the new characters and details he had created. Sondra cites the _Ratboy (1986)_ (qv) debacle as \"the beginning of the end\" of her relationship with Clint, and declared in hindsight that \"obviously whatever control issues he had over my directing were fueled by the hidden birth of a son.\" (Although she didn't know it at the time, Eastwood was cheating on her and had just become the father of Scott Clinton Reeves, born more than 300 miles away to a stewardess in Monterey.).", "While promoting the reality series _Mrs. Eastwood & Company (2012)_ (qv) on E!, Clint's then-wife 'Dina Eastwood' (qv) told 'Chelsea Handler' (qv): \"I hope we're still married when this is over!\". Just two weeks after the show premiered, Clint and Dina separated.", "Known to be passive-aggressive in private life, communicating only by gesture, inference, and what isn't said or done.", "Went to the Coachella Valley Music and Arts Festival in 2013 and 2015.", "After being contacted by 'Sondra Locke' (qv) in 1994, feminist leader 'Gloria Steinem' (qv) said she would orchestrate a nationwide campaign to ban 'Clint Eastwood' (qv) films. However, there was no ban on Clint's movies, and no explanation of why not.", "Although Clint implies that he grew up poor by frequently dropping references to the Great Depression, actually his family lived in a very wealthy part of town, had a swimming pool, belonged to the country club, and each drove their own car.", "His mother 'Ruth Wood' (qv) often brought her own bedsheets when she visited overnight at Clint's.", "With the exception his cameo as 'Silvana Mangano' (qv)'s husband in the obscure Italian film _The Witches (1967)_ (qv), _Space Cowboys (2000)_ (qv) is the only time Eastwood has played a formally married man. His characters are usually single and meet their potential love interest (if any) as the story develops. Other times he's played divorcées (_Tightrope (1984)_ (qv), _Heartbreak Ridge (1986)_ (qv), _The Rookie (1990)_ (qv), _The Mule (2018)_ (qv)), widowers (_Dirty Harry (1971)_ (qv), _The Outlaw Josey Wales (1976)_ (qv), _Gran Torino (2008)_ (qv), _Trouble with the Curve (2012)_ (qv)) or men who are separated from their wives (_True Crime (1999)_ (qv)) but never actually married.", "Biographer 'Patrick McGilligan' (qv) affirms that \"the people who know Clint best suspect there are other families in his closet\" in addition to his verified children, editorializing \"If Kimber Tunis was kept secret for twenty-five years, and the Washington woman for forty, might there not be others?\".", "Left-handed.", "To date, 24 of the 47 films Eastwood has starred in depict violence against women. He's made 16 films in which a female character is killed, 12 films depicting rape or attempted rape, and 11 films showing a female character physically battered. [2019]", "According to the unpublished manuscript \"Take Ten\" by Ria Brown, 'Anita Lhoest' (qv) at one point became pregnant with Clint's child, but went ahead and had an abortion.", "Speaking on condition of anonymity, one of the mothers of Eastwood's children told biographer 'Patrick McGilligan' (qv): \"There is no guilt with Clint. Anything that vaguely resembles guilt is channeled into anger. His anger is always intended to prove people wrong, or prove their behavior bad. And if people are wrong or bad, there is nothing for him to feel guilty about.\".", "Modeled sweaters in a 1972 Playboy layout with a bottomless 'Susan Blakely' (qv).", "In general, he wraps films early and uses the actors' first takes. Most of his films are shot in the spring or summer and released around Christmastime.", "According to 'Robert Daley' (qv), \"If they ever called a meeting of all the people Clint has screwed over, they'd have to hold it in the LA Coliseum.\".", "Eerily, three of his leading ladies ('Inger Stevens' (qv), 'Jean Seberg' (qv), 'Elizabeth Hartman' (qv)) committed suicide.", "One afternoon in the early 1970s, Eastwood and 'Paul E. Lippman' (qv) were walking around San Francisco when a random woman on the street (who happened to be of short stature) sniffed, \"Oh, you're 'Clint Eastwood' (qv) . . . I hear you're a bum lay!\" Clint, very stunned and at a total loss for words, stretched his neck muscles mightily, as he always did when stuck for a quick response, then finally managed, \"Well . . . uh . . . where did you hear that?\" To which she pertly answered, \"Oh, it's all over town.\" After a few more neck stretches, Clint invited her for a drink at some club to discuss the matter, then spent the night at Sausalito's Alta Mira Hotel trying to prove otherwise. The next morning Lippman asked her if she still thought 'Clint Eastwood' (qv) was 'a bum lay', and she held out a flat hand, palm down, and wiggled it.", "Formerly a part-time resident of Tiburon, Marin County.", "'Jane Cameron Agee' (qv), a side piece of Eastwood's for several years, was in the process of writing a tell-all book when she died in a car crash on February 13, 1995.", "Told Rolling Stone magazine in 1985, \"I didn't really get involved in team sports [in school] because we moved so much\" but actually, he didn't move at all between the ages of 10 and 19.", "When The Variety Club honored Clint in 1986 hardly anyone in the large audience knew him personally. He'd never even met some of the celebrities who gave a speech. Yet everyone acted like good friends.", "Lifeguarded for a summer at Kennydale Beach in Renton, Washington, 1953. \"He never had to bring his lunch. He never had to do any of the normal duties like beach clean-up, because all the girls would do it for him,\" according to Penny Wade, chief of budget and personnel for King County Parks. \"There are stories,\" Wade added.", "One of many fabrications to be spoon fed to reporters - and go unchallenged for decades - is the fictional story that Eastwood got into show business after being scouted by director 'Arthur Lubin' (qv) at Fort Ord during the filming of _Francis Joins the WACS (1954)_ (qv). For one thing, Eastwood had already left Fort Ord by the time Lubin filmed there in spring 1954. It was Clint who took initiative, as he wanted to be an actor and had somehow managed to encounter cinematographer 'Irving Glassberg' (qv). Glassberg introduced him to Lubin at a gas station on Santa Monica Boulevard, and that's how they met.", "First wife Margaret Neville Johnson, known as Maggie, was born in 1931 and had one sibling, Gilbert F. Johnson Jr. (1924-2006). Her parents were Gilbert Sr. (1896-1966) and Edith (1896-1970). An alumni of UC Berkeley, Maggie was employed as a secretary for auto parts suppliers Industria Americana when she met Clint on a blind date in L.A. in June 1953. At that time, she'd been \"going steady\" with another guy and Clint had recently impregnated a girl he knew from a Seattle theatre group. The Seattle girlfriend, who has never been identified, gave birth to Clint's daughter Laurie Eastwood on February 11, 1954 - less than 8 weeks after he married Maggie.", "The first incarnation of his publicity advanced the fairy tale that Clint was \"a star on the high school basketball team,\" and this became an established nugget of his life story, carried down in permutations through the years in articles and books, appearing in even as authoritative and recent a source as Current 'Biography' (qv) (Yearbook, 1989).", "Is allegedly updating and revising his will constantly.", "Studied at LACC. Other alumni include 'Morgan Freeman' (qv), 'Mark Hamill' (qv), 'Cindy Williams' (qv), 'Donna Reed' (qv) and 'Rene Michelle Aranda' (qv).", "Hates being written about, even if it's the most harmless mention.", "Women he's been photographed with throughout his career have often been misidentified in accompanying captions, because he's always refused comment on his personal life. Most celebrities issue a press release when they get married or divorced, break up with their significant other, or become a parent. Eastwood never has. Hence, many discrepancies exist.", "In 2017, 46 years after the release of _The Beguiled (1971)_ (qv), 'Sofia Coppola' (qv) remade the film. _The Beguiled (2017)_ (qv) stars 'Colin Farrell' (qv) in the role of John McBurney. Farrell shares the same May 31 birthday as Eastwood and is 41, the same age Eastwood was in the original.", "Bans Coca-Cola from his sight, stemming from a long-ago discord with Columbia Pictures (Coca-Cola and Columbia Pictures were connected).", "Doesn't allow pets in the house because of his allergy to animal hair.", "'Sondra Locke' (qv) said it was a nightmare getting him into court because he refused his subpoena and ordered Malpaso to also refuse any subpoenas her lawyer Peggy Garrity tried to serve him. Eastwood always had an excuse for being unavailable: he was out of town; he was sick; his life was being threatened etc. On December 8, 1994, Mark Ryan, a registered California process server for Harris & Mason, went to Malpaso's headquarters at the Warner Brothers Burbank lot to serve Eastwood with court papers requiring him to appear as a witness. Once Eastwood realized what the papers were he began screaming, \"What the fuck!\" \"Close the door and call security,\" he ordered his assistant. In a lawsuit filed on January 4, 1995, Ryan contended that Warner Bros., at the direction of Eastwood, falsely imprisoned him in a van for 70 minutes, handcuffed him, refused to allow him to leave the WB lot and threatened to have him arrested. Eastwood, of course, could not be reached for comment.", "A fan of 'Paul Reubens' (qv) and 'Benny Hill' (qv).", "During a 1985 interview with 'Gene Siskel' (qv), he subtly expressed disdain for 'Jessica Lange' (qv), 'Sally Field' (qv) and 'Sissy Spacek' (qv).", "Has a line of sportswear: Tehama Clint. At the tourist shops in Carmel, kinkier fans can buy panties with the inscription \"Make My Night\".", "Was given the nickname \"Susi Pi\" by 'Gordon Anderson' (qv).", "As a boy he collected snakes. One time, he had 13 snakes.", "Has no formal acting training.", "'Clint Eastwood' (qv) has stated \"The best part of me is the Irish part of my ancestry\" and has expressed a desire to make a film in Ireland in the past.", "At one point, he took so much carotene his hands turned orange.", "Counts among his fans such luminaries as 'Orson Welles' (qv).", "Surprisingly does not have a star on the Hollywood Walk of Fame. He does, however, have his hands and footprints in cement at Grauman's Chinese Theatre. By sheer coincidence, Clint's handprint square touches corners with comedy legend 'Groucho Marx' (qv)'s handprint square. Groucho's granddaughter, 'Jade Marx-Berti' (qv), is Clint's ex-sister-in-law. When Jade started dating 'Dominic V. Ruiz' (qv) (the younger brother of Clint's former wife 'Dina Eastwood' (qv)), they viewed this as a \"sign\" of their relationship being written \"in stone and in the stars\".", "As of 2018, has produced and directed two Oscar Best Picture winners: _Unforgiven (1992)_ (qv) and _Million Dollar Baby (2004)_ (qv), and three nominees: _Mystic River (2003)_ (qv), _Letters from Iwo Jima (2006)_ (qv) and _American Sniper (2014)_ (qv).", "Throughout his life, he has always had a preference for women of small stature. (He calls them \"little dollies,\" \"squirts,\" \"spinners,\" \"shrimps\" or \"hip pocket rockets.\") He once dated a woman who was only 4'8\" -- 20 inches shorter than himself.", "Got the role of Dirty Harry after first choice 'Frank Sinatra' (qv) suffered an arm injury.", "His first wife Maggie was born in 1931, although during the 1970s she was wrongly reported as five years younger than that. Longtime spouse-equivalent 'Sondra Locke' (qv) was born in 1944 but always gave a younger birthdate, sometimes as much as twelve years younger. Unlike the women in his life, Clint has always been honest about his age.", "On August 4, 2018, he was honored with a day of his film work during the TCM Summer Under The Stars.", "In 1960, 'Clint Eastwood' (qv) was one of 'Lucille Ball' (qv)'s first choices to play her romantic lead in the Broadway musical \"Wildcat.\" When he (and a few A-list marquee names) were not available, she settled on 'Keith Andes' (qv).", "In 1997, he launched his own beer 'Pale Rider Ale', with the ad line: 'You Didn't Expect 'Clint Eastwood' (qv) to Make a Salad Dressing Did You?' on a western-style playbill poster.", "Grandson Titan Wraith Eastwood was born September 16, 2018 to daughter 'Francesca Eastwood' (qv) and her boyfriend 'Alexander Wraith' (qv). Titan is Clint's first grandchild whose birth has been publicly announced.", "Has played a pilot twice: _Tarantula (1955)_ (qv) & _Firefox (1982)_ (qv).", "Was offered the role of K in _Men in Black (1997)_ (qv), but turned it down.", "Often directs using a hand-held wireless monitor, which allows him to be close to the actors while keeping an eye on the frame.", "Grandchildren: Lowell Thomas Murray IV (born circa 1982) and Kelsey Hayford (born April 17, 1984) via secret daughter Laurie Warren and her husband, Lowell Thomas Murray III. Their existence was not publicized until December 2018. Laurie was born in 1954 when Clint was married to his first wife, Maggie Johnson. She was adopted by Helen and Clyde Warren of Seattle. Eastwood biographer 'Patrick McGilligan' (qv) divulged that Laurie's biological mother, who refuses to be identified, was a member of a Seattle theatre group when she and Clint conceived Laurie. The Daily Mail said that Clint's office did not respond to requests for clarification.", "The death of Eastwood's former common-law wife 'Sondra Locke' (qv) on November 2, 2018 was not publicized until opening day of his new movie _The Mule (2018)_ (qv) - 6 weeks later.", "Likes to listen to Dixieland music.", "Once punched his fist through a door, ripping his hand. The same day a palmist read his hand - still bleeding - and said she could tell what a 'tranquil' person he is.", "Obtained a permit for a .38 Smith & Wesson revolver in 1983.", "His fallacious episode of 'Biography' (qv) (1987) (original air date: 10/5/03) only acknowledges four children, when he in fact has at least eight.", "Walked out on an interview with The Boston Herald's Stephen Schaefer when Schaefer asked about his kids.", "He has appeared in three films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _Dirty Harry (1971)_ (qv), _The Outlaw Josey Wales (1976)_ (qv) and _Unforgiven (1992)_ (qv). He has also directed two films that are in the registry: The Outlaw Josey Wales and Unforgiven.", "Former publicist is 'Jerry Pam' (qv).", "According to Bill Brown, publisher of The Pine Cone newspaper in Carmel and a golfing pal of Eastwood's, \"Clint told me not too long ago that Sondra was the love of his life.\".", "Business manager Roy Kaufman died in 2016. For more than 40 years, all the houses Eastwood owns were listed in Kaufman's name, to keep stalkers at bay.", "His father's obituary in the Oakland Tribune was wrong, in the sense that Clint's illegitimate children were omitted from the grandchildren count.", "With the sole exceptions of 'Shirley MacLaine' (qv) in _Two Mules for Sister Sara (1970)_ (qv) and 'Meryl Streep' (qv) in _The Bridges of Madison County (1995)_ (qv), has never starred opposite an actress of even remotely equal stature.", "During his life, he has impregnated at least nine women: the six women confirmed as having his babies, plus 'Sondra Locke' (qv), 'Anita Lhoest' (qv) and 'Jane Cameron Agee' (qv) whose terminated pregnancies are documented in 'Patrick McGilligan' (qv)'s Clint biography."], "quotes": ["[on 'Sondra Locke' (qv)] She plays the victim very well. Unfortunately she had cancer and so she plays that card.", "[to 'Eli Wallach' (qv) prior to starting work on _The Good, the Bad and the Ugly (1966)_ (qv)] Never trust anyone on an Italian movie. I know about these things. Stay away from special effects and explosives.", "[what he says after a take, instead of \"Cut!\"] That's enough of that shit.", "I like the libertarian view, which is to leave everyone alone. Even as a kid, I was annoyed by people who wanted to tell everyone how to live.", "I love every aspect of the creation of motion pictures and I guess I am committed to it for life.", "Right now, the state of the movies in America, there's an awful lot of people hanging on wires and floating across things and comic book characters and what have you. There seems to be a lot of big business in that, a nice return on some of those.", "Nowadays you'd have many battles before you blow it up, but eventually you'd take it down. And that's okay, I don't heavily quarrel with that, but for me personally, having made films for years and directed for 33 years, it just seems to me that I long for people who want to see a story and see character development. Maybe we've dug it out and there's not really an audience for that, but that's not for me to really worry about.", "And I like to direct the same way that I like to be directed.", "[on directing] Most people like the magic of having it take a long time and be difficult . . . but I like to move along, I like to keep the actors feeling like they're going somewhere, I like the feeling of coming home after every day and feeling like you've done something and you've progressed somewhere. And to go in and do one shot after lunch and another one maybe at six o'clock and then go home is not my idea of something to do.", "I think kids are natural actors. You watch most kids; if they don't have a toy they'll pick up a stick and make a toy out of it. Kids will daydream all the time.", "There's really no way to teach you how to act, but there is a way to teach you how to teach yourself to act. That's kind of what it is; once you learn the little tricks that work for you, pretty soon you find yourself doing that.", "Again, after you've gone through all the various processes and the film comes out and is very successful, you're almost afraid to revisit it. You want to save it for a rainy day.", "...in America, instead of making the audience come to the film, the idea seems to be for you to go to the audience. They come up with the demographics for the film and then the film is made and sold strictly to that audience. Not to say that it's all bad, but it leaves a lot of the rest of us out of it. To me cinema can be a much more friendly world if there's a lot of things to choose from.", "You know when you think of a particular director, you think you would have liked to be with them on one particular film and not necessarily on some other one.", "At the studios, everybody's into sequels or remakes or adaptations of old TV shows. I don't know if it's because of the corporate environment or they're just out of ideas. Pretty soon, they're going to be wanting to do one of _Rawhide (1959)_ (qv).", "I think I'm on a track of doing pictures nobody wants to do, that they're all afraid of. I guess it's the era we live in, where they're doing remakes of _The Dukes of Hazzard (1979)_ (qv) and other old television shows. I must say, I'm not a negative person, but sometimes I wonder what kind of movies people are going to be making 10 years from now if they follow this trajectory. When I grew up there was such a variety of movies being made. You could go see _Sergeant York (1941)_ (qv) or _Sitting Pretty (1948)_ (qv) or _Sullivan's Travels (1941)_ (qv), dozens of pictures, not to mention all the great B movies. Now, they're looking for whatever the last hit was. If it's _The Incredibles (2004)_ (qv), they want 'The Double Incredibles.' My theory is they ought to corral writers into writers' buildings like they used to and start out with fresh material.", "I liked the _Million Dollar Baby (2004)_ (qv)' script a lot. Warner Bros. said the project had been submitted to them and they'd passed on it. I said, \"But I like it.\" They said, \"Well, it's a boxing movie.\" And I said, \"It's not a boxing movie in my opinion. It's a father-daughter love story, and it's a lot of other things besides a boxing movie.\" They hemmed and hawed and finally said that if I wanted to take it, maybe they'd pay for the domestic rights only. After that, I'd be on my own. We took it to a couple of other studios, and they turned it down, much like _Mystic River (2003)_ (qv) was turned down, the exact same pattern. People who kept calling and saying, \"Come on, work with us on stuff.\" I'd give it to them, and they'd go, \"Uh, we were thinking more in terms of Dirty Harry coming out of retirement.\" And who knows? Maybe when it comes out they'll be proven right.", "Plastic surgery used to be a thing where older people would try to go into this dream world of being 28 years old again. But now, in Hollywood, even people at 28 are having work done. Society has made us believe you should look like an 18-year-old model all your life. But I figure I might as well just be what I am.", "[on trying to get _Million Dollar Baby (2004)_ (qv) made at Warner Bros.] They might have been a little more interested if I said I wanted to do \"Dirty Harry 9\" or something.", "[2005 Academy 'Awards' (qv) acceptance speech for Best Director for _Million Dollar Baby (2004)_ (qv)] Thank you. Thank you very much. Thank you. I'd like to thank my wife, who is my best pal down here. And my mother, who was here with me in 1993. She was only 84 then. But she's here with me again tonight. And she just -- so, at 96, I'm thanking her for her genes.It was a wonderful adventure. It takes a -- to make a picture in 37 days, it takes a well-oiled machine. And that well-oiled machine is the crew -- the cast, of course, you've met a lot of them. But there's still Margo and Anthony and Michael and Mike and Jay and everybody else who was so fabulous in this cast. And the crew, Campanelli. 'Billy Coe' (qv) and, of course, 'Tom Stern' (qv), who is fantastic. And 'Henry Bumstead' (qv), the great 'Henry Bumstead' (qv) who is the head of our crack geriatrics team. And Henry and Jack Taylor, and Dick Goddard ['Richard C. Goddard' (qv)], all those guys. Walt and everybody. I can't think of everybody right now.I'm drawing a blank right now. But, Warren, you were right. And thank you, for your confidence earlier in the evening. I'm just lucky to be here. Lucky to be still working. And I watched 'Sidney Lumet' (qv), who is 80, and I figure, \"I'm just a kid. I'll just -- I've got a lot of stuff to do yet.\" So thank you all very much. Appreciate it.", "[1985] My old drama coach used to say, \"Don't just do something, stand there.\" 'Gary Cooper' (qv) wasn't afraid to do nothing.", "One of the first films I went to - I went with my dad because my mother didn't want to go see a war movie - was _Sergeant York (1941)_ (qv). My dad was a big admirer of Sergeant York stories from [World War I]. It was directed by 'Howard Hawks' (qv). That was when I first became aware of movies, who made them, who was involved.", "Most people who'll remember me, if at all, will remember me as an action guy, which is OK. There's nothing wrong with that. But there will be a certain group which will remember me for the other films, the ones where I took a few chances. At least, I like to think so.", "The plan was, when I first started directing in the 1970s, to get more involved in production and directing so at some point in my life, when I decided I didn't want to act anymore, I didn't have to suit up.", "I feel very close to the western. There are not too many American art forms that are original. Most are derived from European art forms. Other than the western and jazz or blues, that's all that's really original.", "In _The Bridges of Madison County (1995)_ (qv) Kincaid's a peculiar guy. Really, he's kind of a lonely individual. He's sort of a lost soul in mid-America. I've been that guy.", "I think people jumped to conclusions about _Dirty Harry (1971)_ (qv) without giving the character much thought, trying to attach right-wing connotations to the film that were never really intended. Both the director ['Don Siegel' (qv)] and I thought it was a basic kind of drama - what do you do when you believe so much in law and order and coming to the rescue of people and you just have five hours to solve a case? That kind of impossible effort was fun to portray, but I think it was interpreted as a pro-police point of view, as a kind of rightist heroism, at a time in American history when police officers were looked down on as \"pigs\", as very oppressive people - I'm sure there are some who are, and a lot who aren't. I've met both kinds.", "You have to trust your instincts. There's a moment when an actor has it, and he knows it. Behind the camera you can feel the moment even more clearly. And once you've got it, once you feel it, you can't second-guess yourself. You can find a million reasons why something didn't work. But if it feels right, and it looks right, it works. Without sounding like a pseudointellectual dipshit, it's my responsibility to be true to myself. If it works for me, it's right.", "None of the pictures I take a risk in cost a lot, so it doesn't take much for them to turn a profit. We don't deal in big budgets. We know what we want and we shoot it and we don't waste anything. I never understand these films that cost twenty, thirty million dollars when they could be made for half that. Maybe it's because no one cares. We care.", "[on how he decided to do _A Fistful of Dollars (1964)_ (qv)] I'd done _Rawhide (1959)_ (qv) for about five years. The agency called and asked if I was interested in doing a western in Italy and Spain. I said, \"Not particularly.\" They said, \"Why don't you give the script a quick look?\" Well, I was kind of curious, so I read it, and I recognized it right away as _Yojimbo (1961)_ (qv), a Kurosawa ['Akira Kurosawa' (qv)] film I had liked a lot. Over I went, taking the poncho with me - yeah the cape was my idea.", "There's a rebel lying deep in my soul. Anytime anybody tells me the trend is such and such, I go the opposite direction. I hate the idea of trends. I hate imitation; I have a reverence for individuality. I got where I am by coming off the wall. I've always considered myself too individualistic to be either right-wing or left-wing.", "I don't like the wimp syndrome. No matter how ardent a feminist may be, if she is a heterosexual female, she wants the strength of a male companion as well as the sensitivity. The most gentle people in the world are macho males, people who are confident in their masculinity and have a feeling of well-being in themselves. They don't have to kick in doors, mistreat women, or make fun of gays.", "I don't believe in pessimism. If something doesn't come up the way you want, forge ahead.", "The reason I became a Republican is because ['Dwight D. Eisenhower' (qv)] was running. A hero from World War II, a charismatic individual, a military man, a non-attorney - even then I liked that! I was a very young person voting for the first time. A lot of people joke that a conservative is a liberal who's made his first $100,000 and then decides,\"Wait a second, I want to save this, why are they taxing it away?\". Today the country's in kind of a turmoil over taxing. Being raised in the thirties, watching my parents work hard to make ends meet, with jobs scarce, and then the war years - it tends to make a person a little more fiscally conscious than if you've been born into a wealthier family. You know, if you go to most people who are self-made and ask them what their political philosophy is, usually they're a little more conservative than people who had a better start.", "This film cost $31 million. With that kind of money I could have invaded some country.", "They say marriages are made in Heaven. But so is thunder and lightning.", "I've always supported a certain amount of gun control. I think California has always had a mandatory waiting period, so we were never concerned about it like the rest of the country. Some states didn't have any at all. So I've always supported that. I think it's very important that guns don't get in the wrong hands, and, yes, I would support most of that. I don't know too much about trigger locks. I've never really discussed that with anyone. But I do feel that guns - it's very important to keep them out of the hands of felons or anyone who might be crazy with it.", "I've thought about retiring for years now. When I did _Play Misty for Me (1971)_ (qv) in 1970, I thought that if I could pull this off maybe I could step behind the camera, and it would be time to see the end of me. Every year I have threatened to do that - and here I am. So it may come sooner than you think.", "[on World War II] I feel terrible for both sides in that war and in all wars. A lot of innocent people get sacrificed. It's not about winning or losing, but mostly about the interrupted lives of young people.", "I've done a lot of violent movies, especially in the early days. My recent efforts, like _The Bridges of Madison County (1995)_ (qv), weren't too violent. In recent years I've done less, and, yes, I am concerned about violence in film. In '92, when I did _Unforgiven (1992)_ (qv), which is a film that had a very anti- violence and anti-gun play - anti-romanticizing of gun play theme, I remember that 'Gene Hackman' (qv) was concerned about it, and we both discussed the issue of too much violence in films. It's escalated ninety times since _Dirty Harry (1971)_ (qv) and those films were made.", "Maybe I'm getting to the age when I'm starting to be senile or nostalgic or both, but people are so angry now. You used to be able to disagree with people and still be friends. Now you hear these talk shows, and everyone who believes differently from you is a moron and an idiot - both on the Right and the Left.", "I like to play the line and not wander too far to either side. If a guy has just had a bad day in the mines and wants to see a good shoot 'em up, that's great.", "My involvement goes deeper than acting or directing. I love every aspect of the creation of motion pictures and I guess I'm committed to it for life.", "Whatever success I've had is due to a lot of instinct and a little luck.", "I've always had the ability to say to the audience, watch this if you like, and if you don't, take a hike.", "I've actually had people come up to me and ask me to autograph their guns.", "[on former President 'Ronald Reagan' (qv)] Yes, I liked him very much. When he was a former president of the Screen Actors Guild, I don't think he had the vast support that a lot of other presidents have had. So I don't know why that is, it's just the nature of things.", "[when asked if he is still registered as a Republican] Yes, I am. I started - I enrolled as a Republican in 1951 when 'Dwight D. Eisenhower' (qv) was running. And I was in the military. I was a fan of his. And that's how I got started off. I was never - my parents were mixed, I think one Republican, one Democrat, so I didn't have any grand-pappies to influence me.", "When I was doing _The Bridges of Madison County (1995)_ (qv), I said to myself, \"This romantic stuff is really tough. I can't wait to get back to shooting and killing.\"", "[when asked if he has disappointed his conservative fans by directing _Million Dollar Baby (2004)_ (qv)] Well, I got a big laugh out of that. These people are always bitching about \"Hollyweird\", and then they start bitching about this film. Are they all so mad because _The Passion of the Christ (2004)_ (qv) is only up for the makeup award and a couple of other minor things? Extremism is so easy. You've got your position, and that's it. It doesn't take much thought. And when you go far enough to the right you meet the same idiots coming around from the left.", "[on 'John Huston' (qv)] It's another aspect of the character that pleased me: he was interested in other things besides his art. He liked women, gambling, living the high life. He could have a life parallel to his work. I could identify with this type of behavior. But, because of this very fact, he became attracted more and more by other things, so that what interested him in life moved him away from his art to the point that he nearly lived a tragedy. And the tragedy brings him back to reality. If you study Huston's life, you realize that at the age of nineteen he thought he didn't have long to live because of a heart defect a doctor has notified him of as a result of a misdiagnosis. It drove him to elaborate a personal philosophy according to which he would profit from life to the maximum. He didn't take care of himself - he was a confirmed smoker, a heavy drinker - and yet he lived to be more than eighty. 'Paul Newman' (qv) spoke to me about him when we were acting at the same time, each in a different movie, in Tucson, Arizona. He was starring in _The Life and Times of Judge Roy Bean (1972)_ (qv) and I was doing _Joe Kidd (1972)_ (qv) with 'John Sturges' (qv). Huston drank martinis and smoked cigars all night long, slept from one o'clock to four o'clock in the morning because he was an insomniac, did everything he shouldn't do to live to be old, and yet he died at a very great age! It was the same thing with 'John Wayne' (qv), who was first of all the opposite of a health fanatic.", "I never considered myself a cowboy, because I wasn't. But I guess when I got into cowboy gear I looked enough like one to convince people that I was.", "If you want a guarantee, buy a toaster.", "I always cry when I watch myself on screen.", "Guys I thought of as heroes were like 'Joe Louis' (qv) and, maybe during the war, there was General ['George S. Patton' (qv)], of course, and maybe ['Dwight D. Eisenhower' (qv)], who was the head of the Allied forces. And 'Gary Cooper' (qv). There were just a handful of men and a handful of women. Now, people become stars who are just heiresses or something.", "I also wonder how I got this far in life. Growing up, I never knew what I wanted to do. I was not a terribly good student or a very vivacious, outgoing person. I was just kind of a backward kid. I grew up in various little towns and ended up in Oakland, California, going to a trade school. I didn't want to be an actor, because I thought an actor had to be an extrovert - somebody who loved to tell jokes and talk and be a raconteur. And I was something of an introvert. My mother used to say: \"You have a little angel on your shoulder.\" I guess she was surprised I grew up at all, never mind that I got to where I am. The best I can do is quote a line from _Unforgiven (1992)_ (qv): \"Deserve's got nothing to do with it.\"", "Every movie I make teaches me something, and that's why I keep making them. I'm at that stage of life when I could probably stop and just hit golf balls. But in filming these two movies about Iwo Jima, I learnt about war and about character. I also learnt a lot about myself.", "I was a teenager when the battle of Iwo Jima took place. I remember hearing about the bond drive and the need to maintain the war effort. Back then, people had just come through 10 years of a Depression, and they were used to working for everything. I still have an image of someone coming to our house when I was about six years old, offering to cut and stack the wood in our back yard if my mother would make him a sandwich.", "The Americans who went to Iwo Jima knew it would be a tough fight, but they always believed they'd win. The Japanese were told they wouldn't come home - they were being sent to die for the Emperor. People have made a lot out of that very different cultural approach. But as I got into the storytelling for the two movies [_Flags of our Fathers (2006)_ (qv) and _Letters from Iwo Jima (2006)_ (qv)], I realised that the 19-year-olds from both sides had the same fears. They all wrote poignant letters home saying: \"I don't want to die.\" They were all going through the same thing, despite the cultural differences.", "I guess if you see both of the movies [_Flags of our Fathers (2006)_ (qv) and _Letters from Iwo Jima (2006)_ (qv)] together, they sum up as an antiwar film. Whether it's about territory or religion, war is horrifyingly and depressingly archaic. But I didn't set out to make a war movie. I cared about those three fellows - Bradley, Hayes and Gagnon ['John H. Bradley' (qv), 'Ira H. Hayes' (qv), 'Rene A. Gagnon' (qv)] - the headliners on that war-bond circus. The young men were taken off the front lines, wined and dined, introduced to movie stars. But it felt wrong to them.", "As for me, I like being behind the camera instead of in front of it. I can wear what I want. Will I act again? I never say never. I like doing things where I can stretch and go in different directions. I'm not looking to take it easy. Like the Marines on Iwo Jima, I understand that if you really want something, you have to be ready to fight.", "Life is a constant class, and once you think you know it all, you're due to decay. You're due to slide. I have to keep challenging myself and try something I haven't done before. The studios aren't always happy with that. When I wanted to make _Mystic River (2003)_ (qv), the studio said, \"Uh-oh, it's so dark.\" And I said, \"Well, it's important. And it's a nice story.\" Then the next movie, _Million Dollar Baby (2004)_ (qv), they said, \"Who wants to see a picture about a girl boxing?\" And I said, \"It's really a father-daughter love story. Boxing just happens to be what's going on.\" They didn't have much faith. So there are always obstacles and people afraid to take risks. That's why you end up with remakes of old TV shows as movies. But playing it safe is what's risky, because nothing new comes out of it.", "[on the Iraq war] My druthers would have been, \"Get a more benevolent dictator and stick him in. You know, try somebody a little less mean.\" You don't go in there and fire the army. The army's got to do something. When you fire 'em, you leave them all unemployed. Worst thing in the world. Just get somebody else who they respect and bring him on your side. That's one way of doing it.", "[on President 'George W. Bush' (qv)] You've got to admire somebody who stands up for what they believe regardless of how the polls go. A lot of presidents do everything by the polls. They do a focus group then all of a sudden they say, \"OK, that's what I'm going to be for because that's where focus group is leading me.", "[on the Iraq war] I wasn't for going in there. Only because democracy isn't something that you get overnight. I don't think America got democracy overnight. It's something we had to fight for and believe in.", "[on 'John Wayne' (qv)] I gave him a piece of material that I thought had potential for us to do as a younger guy and an older guy. He wrote me back critical of it. He had seen _High Plains Drifter (1973)_ (qv), and he didn't think that represented Americana like _She Wore a Yellow Ribbon (1949)_ (qv) and other 'John Ford' (qv) westerns. I never answered him.", "[on 'Sergio Leone' (qv)] I spun off Sergio and he spun off me. I think we worked well together. I like his compositions. He has a very good eye. I liked him, I liked his sense of humor, but I feel it was mutual. He liked dealing with the kind of character I was putting together.", "\"Macho\" was a fashionable word in the 1980s. Everybody was kind of into it, what's macho and what isn't macho. I really don't know what macho is. I never have understood. Does it mean somebody who swaggers around exuding testosterone? And kicks the gate open and runs sprints up and down the street? Or does handsprings or whatever? Or is macho a quiet thing based on your security. I remember shaking hands with 'Rocky Marciano' (qv). He was gentle, he didn't squeeze your hand. And he had a high voice. But he could knock people around, it was a given. That's macho. 'Muhammad Ali' (qv) is the same. If you talked with him in his younger years, he spoke gently. He wasn't kicking over chairs. I think some of the most macho people are the gentlest.", "I was tired of playing the nice, clean-cut cowboy in _Rawhide (1959)_ (qv), I wanted something earthier. Something different from the old-fashioned Western. You know: Hero rides in, very stalwart, with white hat, man's beating a horse, hero jumps off, punches man, schoolmarm walks down the street, sees this situation going on, slight conflict with schoolmarm, but not too much. You know schoolmarm and hero will be together in exactly 10 more reels, if you care to sit around and wait, and you know the man beast horse with eventually get comeuppance from hero this guy bushwhacks him in reel nine. But [_A Fistful of Dollars (1964)_ (qv)] was different; it definitely had satiric overtones. The hero was an enigmatic figure, and that worked within the context of this picture. In some films, he would be ludicrous. You can't have a cartoon in the middle of a Renoir.", "In those days, they'd make interview tests, not acting tests. They'd sit you in front of the camera and talk--just as we're talking now. I thought I was an absolute clod. It looked pretty good; it was photographed well, but I thought, \"If that's acting, I'm in trouble\". But they signed me up as a contract player--which was a little lower than working in the mailroom.", "I like working with actors who don't have anything to prove.", "[on _Ambush at Cimarron Pass (1958)_ (qv)] Probably the lousiest western ever made.", "[on the retirement of friend and fellow actor 'Gene Hackman' (qv)]: It is a sad thing. I know his agent and I saw him recently, and he said, 'Can't you talk Gene into coming back?' I said, 'I'd love to see him come back, but I think it's not very nice to ride him.' He's too good an actor not to be performing but, by the same token, he probably thinks that's enough.", "[on _Gran Torino (2008)_ (qv)] That will probably do it for me as far as acting is concerned. You always want to quit while you are ahead. You don't want to be like a fighter who stays too long in the ring until you're not performing at your best.", "There are certain things you have to be realistic about. Dirty Harry would not be on a police department at my age so we'll move on from that.", "Having a good person as a foil certainly helps, because acting is an ensemble art form. 'Clark Gable' (qv) is only as good as 'Claudette Colbert' (qv) in _It Happened One Night (1934)_ (qv).", "[on _Paint Your Wagon (1969)_ (qv)] It wasn't like _Singin' in the Rain (1952)_ (qv), where it had a cohesive plot line. They started out with a real dramatic story and then made it fluffy. When they changed it around, I tried to bail out. It wasn't my favorite. I wasn't particularly nervous about singing on film. My dad was a singer and we'd have sing-arounds. But certainly ['Frank Sinatra' (qv)] wasn't worried.", "With _Every Which Way but Loose (1978)_ (qv), they gave me the script and I thought, \"This is something. This is kinda crazy. But there's something kind of hip about it. This guy's out drifting along and his best friend is an orangutan\". I mean, the scenes of talking to an orangutan about your troubles, I'd never seen anything quite like it. He has a romance that falls through, he doesn't get the girl, and then he goes off with the orangutan. I thought, What could be better? I wouldn't put it in the time capsule of films you did that you thought were great, but everything's a challenge.", "'Gene Hackman' (qv) was interesting because I gave the _Unforgiven (1992)_ (qv) script to his agent and he said no, he didn't want to do anything violent. But I went back to him and said, \"I know where you're coming from. You get to a certain age and I'm there too, where you don't want to tell a lot of violent stories, but this is a chance to make a great statement\".", "At this particular time in my life, I'm not doing anything as a moneymaker. It's like I'm pushing the envelope the other way to see how far we can go to be noncommercial. But I'm definitely not going for the demographics of 13- to 15-year-olds. I didn't know if _Mystic River (2003)_ (qv) would go over at all. I had a hard time getting it financed, to tell you the truth. But I just told Warners the same thing I did with _Million Dollar Baby (2004)_ (qv): \"I don't know if this is going to make any money. But, I think I can make a picture that you'd be proud to have in your library.", "People have lost their sense of humor. In former times we constantly made jokes about different races. You can only tell them today with one hand over your mouth or you will be insulted as a racist. I find that ridiculous. In those earlier days every friendly clique had a 'Sam the Jew' or 'Jose the Mexican' - but we didn't think anything of it or have a racist thought. It was just normal that we made jokes based on our nationality or ethnicity. That was never a problem. I don't want to be politically correct. We're all spending too much time and energy trying to be politically correct about everything.", "[on the possibility of a _Dirty Harry (1971)_ (qv) sequel] I'm 78 years old, and you're pretty well drummed out of the police force by that age. There could be a scenario. I suppose if some mythical writer came out of nowhere and it was the greatest thing on the planet, I'd certainly have to think about it. But it's not like I've ever courted it. I feel like that was an era of my life, and I've gone on to other things. I'm not sure about being Dirty Harry again--but who knows?", "I keep finding interesting stories, or they come to me, so I'll keep making movies.", "[on a possible return to acting after saying he was giving it up with _Gran Torino (2008)_ (qv)] I'm like _Jaws 2 (1978)_ (qv): \"Just when you think it's safe to go back in the water...\"", "[on 'Angelina Jolie' (qv)] She's wonderful. To me, she's like a throwback to the women in film of the Forties. Not to say women today aren't great, but back then there was more individuality. They didn't have the same Botox look. Angelina has that great individuality, her own look and her own style. I think she would have been just as big a name in that era, the same as 'Katharine Hepburn' (qv), 'Bette Davis' (qv) and 'Ingrid Bergman' (qv).", "[on _Million Dollar Baby (2004)_ (qv)] It's a tragedy that could have been written by the Greeks or Shakespeare.", "I don't quite understand this obsession about doing remakes and making television series into feature films. I would rather see them encourage writers with new ideas in all different genres like they used to in the heyday of movies.", "[in 2002, on 'Michael Cimino' (qv)] 'George Lucas' (qv) made _Howard the Duck (1986)_ (qv), and the guy who made _Waterworld (1995)_ (qv) - those films didn't destroy them. Critics were set up to hate _Heaven's Gate (1980)_ (qv) . . . the picture didn't work with the public. If it had, it would have been the same as _Titanic (1997)_ (qv). \"Titanic\" worked, so all is forgiven. Certain things may have been his fault. The accolades for _The Deer Hunter (1978)_ (qv) probably made him think, \"I am a genius, king of the world\". But if you say you're king of the world then people will root for you to fall . . . I've always said that if you're prepared to accept reviews saying you're brilliant, you better be prepared to accept reviews saying you're a burn. The guy calling you a bum may be wrong, but the guy calling you brilliant may be wrong, too. Michael needs to make an intimate, smaller picture, do a film for five or six weeks, with no special effects, flying by the seats of his pants, to not be afraid and pull the trigger.", "[on death] I don't think older people think about it that much, my mother was 97. She passed away a few years back. The only thing she ever said to me, toward the last, she said, 'I want out of here, I am tired.' And I said 'No, no, three more years. We get the century mark.' I figured I could coax her into more after that, but when she finally did pass away, she couldn't talk because she had had a stroke. They said do you want to be resuscitated for while, and she said 'no.' So, I had to grant her that wish. She had no fear and I think as you get older -- you probably have more fear as a younger person than you do as an older person. Because as an older person you have stacked up a lot of background and time-in-grade, so to speak, so you are probably thinking what the hell 'I have had a good time.", "If you believe in reincarnation you're putting too much on the other side. I believe you have just one shot at life, and you should do the best you can with that shot. And I suppose you should be thankful that you've been given the ability to do certain things in life, and not be greedy enough to want to stay around forever.", "[on the _Rocky (1976)_ (qv) movies] I loved the first one. I always admired 'Sylvester Stallone' (qv)'s tenacity to go ahead and get that made.", "I would never have been able to pass the 'Bill Clinton' (qv)-'Gary Hart' (qv) test. No one short of 'Mother Teresa' (qv) could pass.", "[on directing 'Leonardo DiCaprio' (qv) as 'J. Edgar Hoover' (qv)] He could make a lot of money making mechanical genre pictures but he wants to be challenged. And it's much more of a challenge to play someone who doesn't have the slightest thing in common with you.", "[on 'Bruce Surtees' (qv)] He was fearless. He wasn't afraid to give you sketchy lighting if you asked for it. He didn't believe in flat light or just bright, 'Rexall drugstore' lighting, which a lot of times you can get if you get somebody that isn't very imaginative. He was perfect for me, because we didn't have very big budgets in those days. He'd made dollies by towing a blanket across the floor with the cameraman sitting on it.", "I don't believe in pessimism. If something doesn't come out the way you want, forge ahead. If you think it's going to rain, it will.", "[on surviving a plane crash in the early 1950s] They had one plane, a Douglas AD, sort of a torpedo bomber of the World War II vintage, and I thought I'd hitch on that. Everything went wrong. Radios went out. Oxygen ran out. And finally we ran out of fuel up around Point Reyes, California, and went in the ocean. So we went swimming. It was late October, November. Very cold water. I found out many years later that it was a white shark breeding ground, but I'm glad I didn't know that at the time or I'd have just died.", "[on his planned remake of _A Star Is Born (1937)_ (qv)] I talked about that for a while with Warner Brothers' people and we're still playing with that idea. But the problem at the beginning was they were more infatuated with just the idea of the casting. They were talking about having 'Beyoncé' (qv) in it, and she was very popular, but she also is very active and it's hard to get a time scheduled, so we never could get that worked out. But I'm still playing with the idea.", "I've done war movies because they're always loaded with drama and conflict. But as far as actual participation ... it's one of those things that should be done with a lot of thought, if it needs to be done. Self-protection is a very important thing for nations, but I just don't like to see it.", "Extremism is so easy. You've got your position and that's it. It doesn't take much thought. And when you go far enough to the right,you meet the same idiots coming around from the left.", "The stronger the participation of the female characters, the better the movie. They knew that in the old days, when women stars were equally as important as men.", "I like the image of the piano player: the piano player sits down, plays, tells his story, and then gets up and leaves - letting the music speak for itself.", "[after the Carmel city council refused his architectural plans for a downtown construction] They don't know who they're fuckin' with. I'll build that damn building the way I want it if I have to run the fucking city council to do it.", "My father used to say to me, 'Show 'em what you can do, and don't worry about what you're gonna get. Say you'll work for free and make yourself invaluable'.", "[asked by 'Steve Kroft' (qv) on _60 Minutes (1968)_ (qv) how many children he has, 11/16/97] I have a few.", "[press statement issued 4/27/89 in response to claims made by ex-significant other 'Sondra Locke' (qv)] I adamantly deny and deeply resent the accusation that either one of those abortions or the tubal ligation were done at my demand, request or even suggestion. As to the abortions, I told Locke that whether to have children or terminate her pregnancies was a decision entirely hers. Particularly with regard to the tubal ligation, I encouraged Locke to make her own decision after she had consulted with a physician about the appropriateness of and the necessity for that surgical procedure.", "[re 'Patrick McGilligan' (qv)'s 2002 unauthorized biography of him] I don't know if this is the same book that came out in England, but if it is, it's just very factually inaccurate. He has me involved with women I've never met and attending schools I've never gone to - and there was a photograph supposedly of me that wasn't me. The stories about my father weren't true (sic). There were incidents described that never took place; I've never broken a window with a ball peen hammer in my life. If you can't even get the little stuff right, then how are you going to get the big stuff right? But I don't want to talk about it too much, because I hate even giving it credence. It's a very mean-spirited book. I don't care if you write something bad about me, as long as it's true. I'm not Mr. Evangelical Pure-as-the-snow. I just want the true [stories] out. They're fair game. But when they're made up, they're not fair game.", "[on misrepresentation of his early work] My parts ranged from one-liners to four-liners, but to look at some of the billings in TV Guide these days, you'd think I co-starred in those films.", "[on director 'Arthur Lubin' (qv)] We spent a lot of time together, traveled together. He liked me a lot; got me into the talent program at Universal, gave me a lot of breaks. Bought me some nice clothes, too. That's when people started wondering about us!", "I tried being reasonable, I didn't like it.", "[to 'Sondra Locke' (qv), 1975] I've never known anyone that I wanted to be around me all the time. I guess I'm usually trying to get away.", "[in bed with 'Sondra Locke' (qv) on Thanksgiving night 1975] I never knew I could love somebody so much, and feel so peaceful about it at the same time.", "Crimes against children are the most heinous crime. That, for me, would be a reason for capital punishment because children are innocent and need the guidance of an adult society.", "[1/14/09, his reply to 'David Letterman' (qv)'s question \"You have uh--is it seven children?\"] Uh, at least.", "I was always respectful of people who were deeply religious because I always felt that if they gave themselves to it, then it had to be important to them. But if you can go through life without it, that's OK, too. It's whatever suits you.", "[on home pornography] The ultimate turn-on.", "My grandfather lived to be late 90s on one side and on the other side, 70s or something. And my father died young, at 63. But he didn't take very good care of himself.", "I grew up with 'J. Edgar Hoover' (qv). He was the G-man, a hero to everybody, and the Federal Bureau of Investigation was the big, feared organization. He was ahead of his time as far as building up forensic evidence and fingerprinting. But he took down a lot of innocent people, too.", "It's much more fun to play something you're nothing like than what you are... It's much easier to hide yourself in a character.", "[characterizing his relationship with 'Roxanne Tunis' (qv)] It didn't mean anything; it was just an affair. I was young and . . . anyway she was a stand-in and extra on the show, and she was really crazy about me, and always hanging out in my dressing room.", "Plagiarism is always the biggest thing in Hollywood.", "I always thought of myself as a character actor. I never thought of myself as a leading man.", "I love stories about women.", "When I was a kid, I thought movies just came from air. I thought they just appeared.", "Why am I a star? It can't be because of looks.", "I kind of make a film for myself to sort of express myself.", "[2007, on troubled actress 'June Fairchild' (qv), his _Thunderbolt and Lightfoot (1974)_ (qv) co-star who wound up homeless] My heart sank when I heard of what had become of June. There are organizations that can help her but I'm sure she could also use a friendly face right now. I'd really like to meet her.", "I've been through my womanizer part of my life. There was a point when it was an illness, just compulsive, but that's behind me now. I've never considered myself addicted to anything, but if I was, that was it.", "Everybody has certain things they wish they hadn't done in life. They wish they hadn't kicked their dog when they were ten or something.", "I like Italian movies. I was frequently there in the '60s, in Rome and the vicinity. It was a great period in life. I was very influenced by their stuff.", "[January 1962] There has to be something for me beyond western roles, which rarely give you a full feeling of acting accomplishment. Have you ever heard of a western star being called an actor's actor? I'll bet not!", "[April 2010] I planned on not working at this time in my life, but I am enjoying working more now than I ever have. I have been lucky enough to work in a profession I really like and I figure I will continue until somebody hits me over the head.", "In the past I have been with women who wanted more from me than I was ever willing to give. I was probably not as attentive as I could have been. I can be selfish and some of the women didn't have a good idea of their self. They wanted me to mould them and I just can't do that.", "I'm not good in big crowds. I prefer smaller, one-to-one nights out, which is why I've never been single. I like the company of women, but I do go for longer-term relationships than flings. The best things to come of all those relationships are my children.", "[2002] I've waited all my life for a woman like Dina. She is bright, funny, independent. It's fate that I met her when I was in my sixties. I'd love to have been with her 20, 30 years ago and I would have settled down much sooner. I spent my twenties and thirties being angry, then my forties and fifties being disappointed. It's only in the last part of my life that I've learned to be happy.", "[if he could give advice to his younger self] He was never a smart kid. I was a slow learner, so I'd say speed up the process a bit-and maybe practice a little more!", "[December 2014] I just went through a period where my DNA was in demand for a while. I think that's all ended-but, you never know!", "[on marriage] I haven't exactly been successful at it, but I made a couple of attempts. I've had moments of success interrupted by moments of satyr. Shelley Berman used to say that. I admire people who can accomplish and do it, but it's very difficult in today's society, because there are so many things pulling at people. People gain different interests as time goes by, so they decide that they want to try something else. You have to keep trying! You don't want to give up and be so cynical that, you say, 'Never!' But, maybe, at my stage in life, there's a silver act. Never say never.", "'Sergio Leone' (qv) loved long stories and long pictures. To me, I don't mind a long picture if you've got a lot of story. But if you're just making a long movie to just show off more production value, I think you can edit some of that stuff down. That's where he and I would differ.", "I am concerned about violence in films. In 1992, when I did _Unforgiven (1992)_ (qv), which is a film that is very anti-violence and very anti-gun, I remember that 'Gene Hackman' (qv) was concerned about it too. And we both discussed how much violence in films has escalated since _Dirty Harry (1971)_ (qv) and other movies I made.", "Films can go overboard on violence but the Dirty Harry films don't. We don't use slow motion violence for instance, or lingering blood squirts. Also, Harry Callahan is an honorable man and a hero to middle America. I'd question films like _Taxi Driver (1976)_ (qv) where the hero is mentally ill.", "As soon as I read that line in the script, \"Go ahead make my day\", I knew audiences would love it.", "[on 'John Ford' (qv)] I remember seeing _Stagecoach (1939)_ (qv) as a kid when it first came out. Ford had an influence on me subconsciously, and I watched it in a dark theatre with my knees up. Sometimes twice in a row. There's something about the way he approached the subject that broke down clichés of the era. I think he was always trying to make social statements in his movies, and with Stagecoach he used the western to do it efficiently.", "Too many directors don't know what the hell they're doing. They'll do multiple takes on scenes and try out different angles and lighting. I don't like that. If you can't see it yourself straight away, you shouldn't be a director.", "[on his dissatisfaction with his diminishing role in the \"Dollars\" trilogy] In the first, I was just about alone. Then there were two of us. And now are three of us. If it goes on like this I'm going to end up in a detachment of cavalry.", "There's a bar I used to go to on Sunset Boulevard that was a straight bar that's now a gay bar. I think I went into it once some years later, and I looked around and said, 'Oh, yeah, it's a gay bar.' I still finished my beer.", "[on his daughter 'Kimber Eastwood' (qv) and her mother 'Roxanne Tunis' (qv)] I give them a few thousand here and there, but I always give it in cash so they can't prove anything. Besides, Kimber is listed as a dependent on her stepfather's tax returns; she's not a dependent of mine. Legally, I'm not responsible.", "[asked by British interviewer Ginny Dougary why so many women had his babies] Well, sometimes -- ughh . . . arghh . . . I . . . I don't . . . ahh . . . know why it is that I'm any more of a sire than anyone else. Um . . . er . . . something to do with the genes, I guess.", "When I used to be a contract player in 1954 at Universal, I wasn't getting good roles. I was getting one-liners, and then I'd be gone. But I'd hang around; I'd watch guys. And when I had days off, which was most days, I'd go down and watch other sets while they were shooting. Watch 'Joan Crawford' (qv) or whomever. Just watch how they worked and how the director handled them. I didn't know anything about making movies, and there's a lot to learn.", "Secretly everybody's getting tired of political correctness, kissing up. That's the kiss-ass generation we're in right now. We're really in a pussy generation. Everybody's walking on eggshells. We see people accusing people of being racist and all kinds of stuff. When I grew up, those things weren't called racist. And then when I did _Gran Torino (2008)_ (qv), even my associate said, \"This is a really good script, but it's politically incorrect.\" And I said, \"Good. Let me read it tonight.\" The next morning, I came in and I threw it on his desk and I said, \"We're starting this immediately.\"", "I don't know what I am. I'm a little of everything.", "[on 'Barack Obama' (qv)] He doesn't go to work. He doesn't go down to Congress and make a deal. What the hell's he doing sitting in the White House? If I were in that job, I'd get down there and make a deal. Sure, Congress are lazy bastards, but so what? You're the top guy. You're the president of the company. It's your responsibility to make sure everybody does well. It's the same with every company in this country, whether it's a two-man company or a two-hundred-man company...", "You're as young as you feel. As young as you want to be. There's an old saying I heard from a friend of mine. People ask him, \"Why do you look so good at your age?\" He'll say, \"Because I never let the old man in.\" And there's truth to that. It's in your mind, how far you let him come in.", "I don't have any great pickup lines. I was never an extrovert, so I always had to have someone meet me halfway. If she was interested, we'd come together, and if not ... When I became a movie actor and became well-known, it took care of itself. Maybe that's why I became an actor.", "100 years from now and more, people will look back on this generation of films, and the guy who will standout more than anyone else will be 'Tom Cruise' (qv).", "What's one great thing about a theater is it's got an exit.", "One of the most important things in life is feeling good about yourself. And when you're in decent shape, when you like the way your body looks and feels and your energy levels are at their highest, it's a lot easier to feel good about yourself.", "I am a junior, and all my younger life I was called Sonny or Junior, and I think a kid deserves his own name.", "When I was growing up in the '30s and '40s, kids were a lot more active than they are today. We didn't have television, we certainly didn't have computers, so you came home from school and then went out to play with the other kids in your neighborhood. You didn't have to be a varsity athlete to get into a game of pickup basketball or football or to take a bat, ball and glove out to an empty lot for a game of flies-and-grounders.", "[on taking nootropics] You can actually feel a difference and see a difference in yourself. I'm not necessarily interested in extending life. To me, what seems most intriguing is just keeping the quality of your life up as long as fate decrees that you'll be here on the planet.", "[on the contemporary superhero craze in Hollywood] Thank God that I didn't have to do that. [...] I always liked characters that were more grounded in reality. Maybe they do super things or more-than-human things - like Dirty Harry, he has a knack for doing crazy things, or the western guys - but, still, they're not caped crusaders.", "Follow what you think. You want to do something? Just do it the best you can. Not everyone makes something phenomenal, but at least you can fail on your own terms.", "I was a bit of a screw-up, a loner.", "I think women like to see other women put down when they're out of line. They have a dream of the guy who won't let them get away with anything. And the man in the audience is thinking, 'That's how I'd like to handle it--cool and assured, knowing all the answers.' He wants to be a superhero.", "The important thing to remember about women is that they're a lot smarter than men and they don't play fair.", "[asked on the red carpet at _The Bridges of Madison County (1995)_ (qv) premiere if he thinks men become sexier with age] That's in the eyes of the beholder. I know nothing about how men become sexy because men aren't sexy to me, so I really don't know.", "My appeal is in the characters I play. A superhuman type character who has all the answers, is double cool, exists on his own without society or the help of society's police forces. A guy sits in the audience. He's twenty-five years old and he's scared stiff about what he's going to do with his life. He wants to have that self-sufficient thing he sees up on the screen.", "I'm just doing a job, I'm just in the entertainment business doing the kinds of films that appeal to me. You've got to keep that in perspective. Fame is fleeting.", "I think I'm reasonably intelligent.", "[in GQ magazine, October 2011] I don't give a fuck about who wants to get married to anybody else! Why not?! We're making a big deal out of things we shouldn't be making a deal out of ... Just give everybody the chance to have the life they want", "I can get into the nostalgia thing sometimes, but to me the good old days are right now.", "I am very well mannered, and that, believe it or not, stands me in very good stead.", "Marriage is not just about 'love.' It's about 'like' as well.", "The main thing is not how long you're on the planet, but the quality you have while you're here.", "In some ways I know I didn't live up to my parents' hopes. It was a long time before I wanted to go to college--but in some ways I surpassed my parents' hopes.", "I guess I'm just a bum and a drifter by nature. I don't think of myself as a \"star.\" I don't have any image of myself.", "Sometimes I think I disappoint people by not being more like the characters I play in the movies. But who wants to be those guys? The best kind of fan is the one who tells you he loved your film and then, boom, is off.", "I'm in the entertainment business, NOT in the business of trying to shape social opinions.", "My dad was always talking about retiring and sitting next to a stream with a couple of beers in his hand. Sounds like a commercial - but it's not for me!", "I'm not a person who pre-plans life.", "[asked for the secret to a lasting marriage, 1971] We don't believe in 'togetherness'. We've stayed together by staying apart.", "For years I bummed around trying to get an acting job. They told me my voice was too soft, my teeth needed capping, I squinted -- all that tearing down of my ego. If I walked into a casting office now, a stranger, I'd get the same old crap. But now I'm 'Clint Eastwood' (qv).", "[in the early '70s] I'm number one at the box office, but Hollywood considers me a bore.", "I've always felt that if I examine myself too much, I'll find out what I know and don't know, and I'll burst the bubble. I've gotten so lucky relying on my animal instincts, I'd rather keep a little bit of the animal alive.", "Guys appreciate a man's ingenuity to make a buck and have a certain cool. The girls like it too . . . A guy who knows exactly what he wants and goes out and gets it, is reassuring to people.", "The less secure a man is, the more likely he is to have extreme prejudice.", "I'll never win a Best Actor Oscar. First of all, I'm not Jewish, and second, I'm too successful for all those old farts at the Academy.", "I'm like Hitchcock; I believe when you CHOOSE the actors, that's the direction.", "[when 'Frances Fisher' (qv) announced \"We're pregnant!\" during dinner with 'Richard D. Zanuck' (qv) & 'Lili Fini Zanuck' (qv)] Who's this \"we\"? YOU are pregnant, not we!", "[when _Rawhide (1959)_ (qv) cast members kidded him about having had \"a hard night in the sack with the old lady\"] Don't make me barf!", "[January 1989, when his mother 'Ruth Wood' (qv) had been in the hospital with pneumonia] She's okay now. For a minute there I thought it was gonna be the end of an era.", "Everything has a price. Especially lunch.", "I feel like I should just throw myself off the Golden Gate Bridge.", "By nature I'm not a person who likes to expound. My nature is to be more within. That sometimes can be an advantage and sometimes not.", "[12/10/88, after learning 'Sondra Locke' (qv) had cast 'Lynne Thigpen' (qv) in _Impulse (1990)_ (qv)] I hope you know what you're doing. Casting a black actress to play a police psychiatrist! [as he walked out the door to pick up his NAACP award]", "I was born looking like what most people perceive as the western type. I have no burning desire to play Henry V. I'm totally unsuited for it.", "[to 'Maria Shriver' (qv) in January 1989] Maybe it's time to get rid of everybody in my life and start over.", "[on turning down _Superman (1978)_ (qv)] I was like, 'Superman? Nah, nah, that's not for me.' Not that there's anything wrong with it. It's for somebody, but not me.", "[on how some might not approve of his personal life] What? My modern, dysfunctional family? Life is no great plan. Mine is career-driven and fate-driven. I was in a job that took me around the world. I wasn't always the good guy I could have been. But I haven't run away from members of my family, either. I'm a very integral part of their lives.", "When I was doing _The Bridges of Madison County (1995)_ (qv), I said to myself \"This romantic stuff is really tough. I can't wait to get back to shooting and killing.\"", "I don't think my movies are that stimulating. People in the audience just sit there and say, \"I admire the independence. I'd like to have the nerve to tell the boss off or have that control over my life.\" In the society we live in, everything is kind of controlled for us. We just grow up and everything's kind of done.", "I think that the sad trick of nature is that people propagate at a rather early age when they really enjoy it at a later age.", "Men can probably identify more with me than the prettier actor.", "I guess I am vain. I never thought about it. I don't look in the mirror and ask: \"Who is the fairest of them all?\" If you do that a voice comes out and says: \"Snow White, baby, and don't you forget it!\"", "I like people but I'm not that comfortable with them.", "I was never a discovery of the press. I never had a publicity build-up or any amazing covers. I had to have the success first.", "I was a daydreamer as a kid. I just like being myself and meditating. I think a certain kind of meditation is good for anybody for some sort of peace of mind. Some people find it looking at the ocean, some people find it in religion. It depends on the individual. I don't believe in the old adage that men shouldn't cry. If a person feels like crying it's probably the greatest catharsis in the world.", "I do the kind of roles I'd like to see if I were digging swimming pools and wanted to escape my problems.", "Sex can be overrated.", "I have a very strict gun control policy: if there's a gun around, I want to be in control of it.", "It's kind of a boring life. I guess movie-making is my biggest obsession ... I just like it.", "There's a little bit of me in every character I play.", "[on if he worries about having a movie flop at the box office] If you start thinking about the end results and start anticipating what an audience might feel, you may be dead wrong. I just go ahead with my way and figure that, at least I can have the satisfaction of having put it down. And if it works, it works, and if it doesn't, move on.", "Nobody really knows me . . . I've never been an extrovert or even inclined to be one.", "[on his first marriage to Margaret Neville Johnson] The first year of marriage was terrible. If I had to go through it again, I think I'd be a bachelor for the rest of my life. I liked doing things when I wanted to do them. I did not want any interference. ... One thing Mag had to learn about me was that I was going to do as I pleased. She had to accept that, because if she didn't, we wouldn't be married.", "'Dustin Hoffman' (qv) and 'Al Pacino' (qv) play losers very well, but my audience likes to be in there vicariously with a winner.", "My limitations are real.", "I never begged for respectability. I never said, 'Come, let me show you, come like me.'", "I guess I can lie like anybody else, but I don't like it. I'd hate to exist constantly, day- in, day-out, having to come up with something. Having to come up with something whether it's the truth, a variation of the truth or whether it's an outright lie or variations on a lie.", "Maybe being an introvert gives me, by sheer accident, a certain screen presence, a mystique.", "I'm always appalled, just knocked out by disloyalty. I never think it's coming. I was driving around my place in Carmel, and I saw this guy and his girl camping on it. I thought, 'What the hell, they're probably having a great time, let 'em stay.' Later, I went back, and they had left the place a mess. I felt I had been had.", "I never second-guess audiences, because many times they're just so much further ahead of you. And then sometimes, they miss what you think you've been explaining so simply. So you can't second-guess. All you do is build on your own instinctive reactions. That tells you what to do. You do it the best way you know how, and you hope, of course, that somebody likes it.", "[on turning down _Apocalypse Now (1979)_ (qv)] I would't have been happy. I didn't understand the story, didn't feel the role was a challenge, something I hadn't done before. Also, I'd just got situated at home and didn't want to live in the Philippines for two years. They weren't planning on two years - just 18 weeks. I kinda felt it might be a little longer.", "I've never met a genius. A genius to me is someone who does well at something he hates. Anybody can do well at something he loves - it's just a question of finding the subject.", "It was time to do some American films - the movie business was still thinking of me as a TV actor hiding out on the plains of Spain - or an Italian movie actor! My agency thought 'Carl Foreman' (qv)'s film was a real plum. a vast amount of well known people in it. I thought it just an extension of _Rawhide (1959)_ (qv) and went off and did _Hang 'Em High (1968)_ (qv), which analysed the pros and cons of capital punishment. They thought I was absolutely nuts! Why do this little $1.5m movie as opposed to the $7m epic? I wasn't snubbing them, the subject matter didn't interest me. Hang 'Em High did.", "[why he turned down _The Towering Inferno (1974)_ (qv)] Financially, it would have been a smart move. It made an awful lot of money. I could've played it. Just couldn't see the reason why. The effects, the tower, was the star!", "[recalling his worst fan encounters] One night in Indianapolis, a woman calmly walked up to me and poured a drink over my head. I seldom go anyplace that I don't meet up with the character fresh out of a bar who wants to take a poke at me. I have been in several situations where I almost had to fight my way out. And an actor, no matter how much in the right he is, can only be the heavy in any such situation.", "I like clothes kind of sporty I guess. But a woman has to wear something that fits her particular design. Clothes have to be simple . . . I like everything simple . . . nothing gaudy. Women shouldn't wear very much jewelry . . . just a little . . . just enough to make things look right.", "Call me lucky, if you want to, but people don't know about the weeks and months I was a regular customer at the unemployment office in Hollywood.", "Sergio [Leone] was great fun, but he didn't speak much English. None, in fact. So we communicated in Spanish mostly. But, come to think of it, he didn't speak much Spanish either.", "I don't get tired. That's because I took up lumber jacking and being a swimming instructor instead of playing chess and watching birds.", "Of course I saw Angelina [Jolie] in _Girl, Interrupted (1999)_ (qv). She's a tremendous actress. Sometimes she's taken for granted because you see her in the tabloids. But she's terribly smart.", "[observation, 1964] I'm not too wild about some of these new hair styles. I like hair that you can touch. But most of these gals . . . their hair is like barbed wire or straw or something. You don't even want to touch it! It has to be soft and pretty.", "[on mayonnaise] You might as well shoot up Crisco, right into your veins.", "The first time I went to Italy, I just sneaked in. I had a beard, but it didn't matter. Nobody knew me anyway. And no one paid me any attention.", "[when told 'Sophia Loren' (qv) wants to meet him] That's news to me. But if the lady wants to meet me, I'd sure enjoy meeting her.", "[his rationale for making 'Frances Fisher' (qv) keep her pregnancy a secret until her third trimester] I don't want that kinda thing taking attention away from my Oscar race!", "[asked in 1969 if he would ever consider playing a gay character] Only if I was sure I could convince people I was merely acting.", "It's not healthy to go out with a woman who has a connection to the business and might look at you as some kind of stepping stone. When you have a certain standing, it isn't easy weeding out the predators.", "Respect your efforts, respect yourself. Self-respect leads to self-discipline. When you have both firmly under your belt, that's real power.", "I have no choice but to look the way I am because they don't make enough shoe polish for my hair and they don't have a sander for my face. At some point you have to say: \"This is who I am.\""], "salary history": ["_Francis in the Navy (1955)_ (qv)::$300", "_Star in the Dust (1956)_ (qv)::$75", "_The First Traveling Saleslady (1956)_ (qv)::$750", "_Ambush at Cimarron Pass (1958)_ (qv)::$750", "_Rawhide (1959)_ (qv)::$700 per episode (season one)", "_Per un pugno di dollari (1964)_ (qv)::$15,000", "_Per qualche dollaro in più (1965)_ (qv)::$50,000", "_Il buono, il brutto, il cattivo (1966)_ (qv)::$250,000 + 10% of Western Hemisphere profits", "_Le streghe (1967)_ (qv)::$20,000", "_Hang 'Em High (1968)_ (qv)::$400,000 + 25% of gross", "_Coogan's Bluff (1968)_ (qv)::$1,000,000", "_Where Eagles Dare (1968)_ (qv)::$850,000", "_Paint Your Wagon (1969)_ (qv)::$600,000", "_Two Mules for Sister Sara (1970)_ (qv)::$750,000", "_Kelly's Heroes (1970)_ (qv)::$1,000,000", "_Every Which Way but Loose (1978)_ (qv)::$16,000,000 (after 15% take from the gross)", "_Firefox (1982)_ (qv)::$3,000,000 + 10% of gross", "_Sudden Impact (1983)_ (qv)::$30,000,000 (includes salary and 60% of all profits)", "_Tightrope (1984)_ (qv)::$5,000,000", "_City Heat (1984)_ (qv)::$5,000,000", "_Pale Rider (1985)_ (qv)::$6,000,000", "_Heartbreak Ridge (1986)_ (qv)::$10,000,000", "_White Hunter Black Heart (1990)_ (qv)::No upfront fee in exchange for unspecified percentage of the gross", "_In the Line of Fire (1993)_ (qv)::$7,000,000", "_Mystic River (2003)_ (qv)::$0 (waived his salary)", "_Invictus (2009)_ (qv)::$6,000,000", "_Hereafter (2010)_ (qv)::$6,000,000"], "birth date": "1930-05-31", "birth notes": "San Francisco, California, USA", "_actorID": "77", "_source": "IMDB", "actorID": "0000142", "created_utc_dt": "09/14/2019, 13:02:24"}