{"headshot": "https://m.media-amazon.com/images/M/MV5BMTc3MDcxMDA5Ml5BMl5BanBnXkFtZTgwNDM1NTU5MDE@._V1_UY98_CR0,0,67,98_AL_.jpg", "birth name": "Laura Jeanne Reese Witherspoon", "height": "5' 1½\" (1.56 m)", "mini biography": ["Laura Jeanne 'Reese Witherspoon' (qv) was born on March 22, 1976 at Southern Baptist Hospital (now Memorial Medical Center) in New Orleans, Louisiana. She is the second child of Mary Elizabeth \"Betty\" (Reese) and Dr. John Draper Witherspoon, Sr. Her father was a military surgeon specializing in ear, nose and throat. Her mother was a Registered Nurse who later became a Ph.D in pediatric nursing. Reese spent the first four years of her life in Wiesbaden, Germany, where her father served as a lieutenant colonel in the US Army reserves. Shortly after, John moved the family back to the States, settling in Nashville, Tennessee.Reese was introduced to the entertainment industry at a very early age. At age 7, she began modeling. This led to appearances on several local television commercials. At age 11, she placed first in a Ten-State Talent Fair.In 1990, she landed her first major acting role in 'Robert Mulligan' (qv)'s _The Man in the Moon (1991)_ (qv). Her role as a 14-year old tomboy earned her rave reviews. Roles in bigger films such as _Jack the Bear (1993)_ (qv) and _A Far Off Place (1993)_ (qv) followed shortly after.Following high school graduation in 1994 from Harpeth Hall, a Nashville all girls school, Reese decided to put her acting career on hold and attend Stanford University where she would major in English literature. However, her collegiate plans were shortly dashed when she accepted roles to star in two major motion pictures: _Fear (1996)_ (qv), alongside 'Mark Wahlberg' (qv), and _Freeway (1996)_ (qv) with 'Kiefer Sutherland' (qv). Although neither film was a huge box-office success, they did help to establish Reese as a rising starlet in Hollywood and open the door for bigger and better film roles. Those bigger roles came in movies such as _Pleasantville (1998)_ (qv), _Election (1999)_ (qv) and _Cruel Intentions (1999)_ (qv).Her breakthrough role came as Elle Woods in the 2001 comedy, _Legally Blonde (2001)_ (qv). The movie was huge box-office smash and established Reese as one of the top female draws in Hollywood. The next year, she scored a follow-up hit with _Sweet Home Alabama (2002)_ (qv), which went on to gross over $100 million dollars at the box office. In 2006, she took home the best actress Oscar for her role as 'June Carter Cash' (qv) in the 'Johnny Cash' (qv) biopic, _Walk the Line (2005)_ (qv). In the late 2000s and early 2010s, Reese continued to star in more romantic comedies, such as _Four Christmases (2008)_ (qv) and _How Do You Know (2010)_ (qv). In December 2010, she received a star on the Hollywood Walk of Fame. In the year 2014, she produced both _Gone Girl (2014)_ (qv) and _Wild (2014)_ (qv), for which she got nominated for best actress Oscar again for her role as 'Cheryl Strayed' (qv).Off the screen, she was married to 'Ryan Phillippe' (qv) from 1999 to 2007. They met at her 21st birthday party and subsequently worked together in _Cruel Intentions (1999)_ (qv). They have two children: a daughter, Ava Elizabeth (born 9 September 1999) and a son, Deacon (born 23 October 2003). In March 2011, Reese remarried talent agent 'Jim Toth' (qv). She gave birth to a second son, Tennessee (born 27 September 2012).::SteveG"], "spouse": ["'Jim Toth' (qv)::(26 March 2011 - present) ( 1 child)", "'Ryan Phillippe' (qv)::(5 June 1999 - 13 June 2008) ( divorced) ( 2 children)"], "trade mark": ["Mostly plays chipper-type women convinced of their own successful destiny", "Expressive face", "Smooth voice with a strong southern accent", "Blonde hair and blue eyes"], "trivia": ["Majored in English Literature at Stanford University; on leave from her studies as of 1996.", "Shortly after she started acting, she had an audition for a role in _Cape Fear (1991)_ (qv). She was supposed to meet with 'Robert De Niro' (qv) and 'Martin Scorsese' (qv) for the audition, but at the time did not really know who they were. On the plane, she was talking to the man next to her about her audition, and the man started to rave to her about De Niro and Scorsese. This made her so nervous that she completely blew the audition and the role eventually went to 'Juliette Lewis' (qv).", "Refused the lead roles in two horror movies: _Scream (1996)_ (qv) and _Urban Legend (1998)_ (qv).", "Was considered for the role of Juliet in _Romeo + Juliet (1996)_ (qv), which went to 'Claire Danes' (qv).", "Her mother, Betty, has a Ph.D. in pediatric nursing and her father, John, is a surgeon.", "Chosed as one of People magazine's \"25 Most Intriguing People of 2001\".", "Named one of E!'s \"Top 20 Entertainers of 2001\".", "Chosen by People magazine as one of the 50 Most Beautiful People in the World (2002).", "Attended Harpeth Hall School, a private school for girls in Nashville, Tennessee.", "She runs a production company called \"Type A Films\" with Debra Siegal", "Has appeared at #22 in Entertainment Weekly's Most Powerful List.", "She won the \"Ten State Talent Award\" at the young age of 11.", "She was a cheerleader in high school and a debutante.", "Reese is her mother's maiden name.", "Has moved her production company, Type A Films, to Universal Pictures. Has signed a two-year first-look production pact with Universal. The studio has already picked up a romantic comedy pitch, Sports Widow (2010), for her to star in and produce.", "She appeared in a television commercial when she was 7 for a local Nashville florist.", "Has been named one of Rolling Stone's \"People of the Year\" along with 'Eminem' (qv) and 'Kelly Osbourne' (qv).", "She lived in Wiesbaden, Germany, as a young child.", "Her Gap ad appeared on a six-story-high building on Sunset Boulevard.", "Named one of E! 2002 \"Entertainers of the Year\".", "Her daughter, 'Ava Phillippe' (qv), is named after her ex-husband, 'Ryan Phillippe' (qv)'s, grandmother.", "Steve Dontanville from the William Morris Agency is still her agent. They got together after _The Man in the Moon (1991)_ (qv).", "She has English, Irish, Scottish, Welsh, and distant Dutch, ancestry. She is said to be a relative of John Witherspoon, a Gifford, Scotland-born Presbyterian minister who attended Haddington Grammar School, obtained his Master's degree from Edinburgh University in 1739, and was a signatory of the United States Declaration of Independence.", "Her wedding ring is an early 1990s 'Neil Lane' (qv), Asscher-cut-diamond, and there are only a few like it in the world.", "Has an older brother: 'John D. Witherspoon' (qv).", "Ranked #1 on E!'s Hollywood's Hottest Blondes (2003)", "As extra credit for a high school class, she worked as an office production assistant for the film _Devil in a Blue Dress (1995)_ (qv). Director 'Carl Franklin' (qv) paid homage to her by featuring _Legally Blonde (2001)_ (qv) in the film _Out of Time (2003)_ (qv).", "She collects antique linens and is crazy about old embroidery.", "Ryan proposed to her in December 1998 while the couple was vacationing at The Planter's Inn in Charleston, South Carolina.", "As a child, she appeared in her local Sunday paper modeling kids' track suits and such. She said that it was creative for her. She was paid $50 a day.", "Started children's acting classes at a community college at the age of seven. She was taking adult acting classes by the age of nine.", "Her son is named after former Pittsburgh Pirates pitcher Deacon Phillippe, a distant relative of her ex-husband 'Ryan Phillippe' (qv).", "She was a gymnast for seven years when she was younger.", "Chosen as \"Favorite Female Film Star\" by People magazine (2004).", "Neither she nor her ex-husband, actor 'Ryan Phillippe' (qv), use their real first names - Reese's first name is Laura, Ryan's first name is Matthew.", "Was the first person to host _Saturday Night Live (1975)_ (qv) after the September 11 terror attacks.", "Was approached by a few companies to record music after she provided her own singing voice for _Walk the Line (2005)_ (qv).", "Has appeared in four movies bearing the names of songs: _Jack the Bear (1993)_ (qv), _Sweet Home Alabama (2002)_ (qv), _Just Like Heaven (2005)_ (qv) and _Walk the Line (2005)_ (qv).", "She donated many items to 'Rocky Stone' (qv) to be given to less fortunate kids as part of the Toy Mountain Campaign.", "The year she won her Oscar for _Walk the Line (2005)_ (qv), her ex-husband 'Ryan Phillippe' (qv) appeared in the movie that won Best Picture, _Crash (2004)_ (qv).", "Her performance as Tracy Flick in _Election (1999)_ (qv) is ranked #45 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "Dyed her hair brown for her role as 'June Carter Cash' (qv) in _Walk the Line (2005)_ (qv).", "Ranked #40 in FHM magazine's \"100 Sexiest Women in the World 2005\" special supplement.", "Is the second actress to win the best actress Oscar for portraying a female singer in a biography; the first was 'Sissy Spacek' (qv) for _Coal Miner's Daughter (1980)_ (qv).", "The dress she wore at the Golden Globe 'Awards' (qv) in 2006 was also worn by 'Kirsten Dunst' (qv) at the Golden Globe 'Awards' (qv) in 2003.", "Distant cousin of 'Daniel Morton' (qv)", "Ranked #34 in FHM magazine's \"100 Sexiest Women in the World 2006\" supplement.", "Announced on October 30, 2006 that she has separated and would file divorce papers against her husband, 'Ryan Phillippe' (qv), after seven years of marriage.", "Best friends with 'Selma Blair' (qv), 'Chelsea Handler' (qv) and 'Renée Zellweger' (qv).", "Was originally cast in the lead role in Bunny Lake Is Missing (2012), but backed out a few weeks before shooting began.", "Filed for divorce against husband, 'Ryan Phillippe' (qv), on November 8, 2006.", "Mentioned in the song \"High School Never Ends\" by 'Bowling for Soup' (qv), as \"the prom queen\".", "(August 1, 2007) Named the first-ever Avon Global Ambassador and will serve as the Honorary Chairman of the Avon Foundation.", "Was named highest-paid actress in Hollywood by The Hollywood Reporter in 2007.", "In 2007, Forbes magazine estimated her earnings for the year at $7 million.", "Is one of 13 actresses to have won the Academy Award, BAFTA Award, Critics' Choice Award, Golden Globe Award and SAG Award for the same performance. The others in chronological order are 'Julia Roberts' (qv) for _Erin Brockovich (2000)_ (qv), 'Renée Zellweger' (qv) for _Cold Mountain (2003)_ (qv), 'Helen Mirren' (qv) for _The Queen (2006)_ (qv), 'Jennifer Hudson' (qv) for _Dreamgirls (2006)_ (qv), 'Kate Winslet' (qv) for _The Reader (2008)_ (qv), 'Mo'Nique' (qv) for _Precious (2009)_ (qv), 'Natalie Portman' (qv) for _Black Swan (2010)_ (qv) and 'Octavia Spencer' (qv) for _The Help (2011)_ (qv), 'Anne Hathaway' (qv) for _Les Misérables (2012)_ (qv), 'Cate Blanchett' (qv) for _Blue Jasmine (2013)_ (qv), 'Patricia Arquette' (qv) for _Boyhood (2014)_ (qv) and 'Julianne Moore' (qv) for _Still Alice (2014)_ (qv).", "Campaigned for the role of Christine Collins in _Changeling (2008)_ (qv), but lost the role to 'Angelina Jolie' (qv).", "Was in a relationship with 'Jake Gyllenhaal' (qv), having met him on the set of _Rendition (2007)_ (qv) (January 2007-November 2009).", "Auditioned for the role of Rachel Dawes in _Batman Begins (2005)_ (qv), but 'Katie Holmes' (qv) was cast instead.", "Was considered for the role of Amy Stanton in _The Killer Inside Me (2010)_ (qv), but 'Kate Hudson' (qv) was cast instead.", "(December 1, 2010) Was awarded the 2,425th star on the Hollywood Walk of Fame by 'James L. Brooks' (qv) and 'James Mangold' (qv), accompanied by her children, Ava and Deacon Phillippe, and boyfriend 'Jim Toth' (qv).", "(December 28, 2010) Announced her engagement to boyfriend 'Jim Toth' (qv), having been in a relationship with him since February 2010.", "Married 'Jim Toth' (qv) on March 26, 2011, in a marquee on her ranch in Ojai, California, wearing a custom-designed gown by 'Monique Lhuillier' (qv), before 120 guests. Eighty white doves were released just moments after the couple said \"I do\".", "Her bridesmaids at her wedding included her best friend Heather Rosenfield, daughter 'Ava Phillippe' (qv), and her two young nieces.", "Amongst the guests at her wedding were 'Renée Zellweger' (qv), 'Matthew McConaughey' (qv), 'Tobey Maguire' (qv), 'Robert Downey Jr.' (qv), 'Alyssa Milano' (qv), 'Isla Fisher' (qv), 'Selma Blair' (qv) and 'Salma Hayek' (qv).", "Has played 'Robert Pattinson' (qv)'s mother in _Vanity Fair (2004)_ (qv), but his scene was cut from the end product. In _Water for Elephants (2011)_ (qv) the two of them play lovers.", "She was honored with the MTV Generation Award at the 2011 MTV Movie 'Awards' (qv), being the second female in the history of the show to receive the award, following 'Sandra Bullock' (qv) who received the award one year earlier.", "Rushed to the hospital after being hit by a car on September 7, 2011 while jogging in Santa Monica, California. Was treated for minor injuries before being sent home. Received a quarter-inch scar on her forehead that she hides with her bangs.", "Won the Academy Award for Best Actress, in 2006, for playing 'June Carter Cash' (qv) in _Walk the Line (2005)_ (qv). Funnily enough, Witherspoon had already played another Carter family member before; she played 'Mother Maybelle Carter' (qv) (June Carter's mother) in her fourth grade play.", "Revealed in the 84th Academy 'Awards' (qv) montage that her favorite movie is _Overboard (1987)_ (qv).", "Gave birth to her 1st child at age 23, daughter 'Ava Phillippe' (qv) (Ava Elizabeth Phillippe), on September 9, 1999. Child's father is her 1st husband, 'Ryan Phillippe' (qv).", "Returned to work 4 months after giving birth to her daughter Ava in order to begin filming her guest appearance on _Friends (1994)_ (qv).", "Gave birth to her 2nd child at age 27, a son Deacon Reese Phillippe on October 23, 2003. Child's father is her 1st husband, 'Ryan Phillippe' (qv).", "Returned to work 8 months after giving birth to her son Deacon in order to begin filming _Walk the Line (2005)_ (qv).", "Gave birth to her 3rd child at age 36, a son Tennessee James Toth on September 27, 2012. Child's father is her 2nd husband, 'Jim Toth' (qv).", "Was 8 months pregnant with her son Tennessee when she completed filming on _Devil's Knot (2013)_ (qv).", "Considers 'Meryl Streep' (qv)'s performance in _Sophie's Choice (1982)_ (qv) as the greatest female performance of all time. Witherspoon also states that she was influenced by Streep.", "Returned to work 7 months after giving birth to her son Tennessee in order to begin filming _The Good Lie (2014)_ (qv).", "Honoring 'Dolly Parton' (qv), of whom she is a huge fan, at the Kennedy Center Honors TV special aired on December 26, 2006. [December 2006]", "Debut of her perfume, \"In Bloom\" by Avon (2009).", "Was the 128th actress to receive an Academy Award; she won the Best Actress Oscar for _Walk the Line (2005)_ (qv) at The 78th Annual Academy 'Awards' (qv) (2006) on March 5, 2006.", "She has worked with three actors who have played comic book characters. She worked with 'Tobey Maguire' (qv) who played Spider-Man. She worked with 'Tom Hardy' (qv) who played Bane and she worked with 'Christian Bale' (qv) who played Batman.", "Her favorite films include _Splendor in the Grass (1961)_ (qv), _Overboard (1987)_ (qv), _The Impossible (2012)_ (qv), _Bad Grandpa (2013)_ (qv) and _The Grand Budapest Hotel (2014)_ (qv).", "Her parents separated in 1996 when she was age 20. They still remain close.", "Performs the audiobook version of Go Set A Watchman, the sequel to To Kill A Mockingbird. In _Four Christmases (2008)_ (qv), she appears with 'Sissy Spacek' (qv); who performed the audiobook of To Kill A Mockingbird; and 'Robert Duvall' (qv), who played Boo Radley in the film.", "Is one of 14 actresses to have won both the Best Actress Academy Award and the Best Actress in a Comedy/Musical Golden Globe for the same performance; hers being for _Walk the Line (2005)_ (qv). The others, in chronological order, are: 'Judy Holliday' (qv) for _Born Yesterday (1950)_ (qv), 'Julie Andrews' (qv) for _Mary Poppins (1964)_ (qv), 'Barbra Streisand' (qv) for _Funny Girl (1968)_ (qv), 'Liza Minnelli' (qv) for _Cabaret (1972)_ (qv), 'Glenda Jackson' (qv) for _A Touch of Class (1973)_ (qv), 'Diane Keaton' (qv) for _Annie Hall (1977)_ (qv), 'Sissy Spacek' (qv) for _Coal Miner's Daughter (1980)_ (qv), 'Cher' (qv) for _Moonstruck (1987)_ (qv), 'Jessica Tandy' (qv) for _Driving Miss Daisy (1989)_ (qv), 'Helen Hunt' (qv) for _As Good as It Gets (1997)_ (qv), 'Gwyneth Paltrow' (qv) for _Shakespeare in Love (1998)_ (qv), 'Marion Cotillard' (qv) for _La Vie en Rose (2007)_ (qv), and 'Jennifer Lawrence' (qv) for _Silver Linings Playbook (2012)_ (qv).", "Co-founded the film production company \"Pacific Standard\" with Australian partner 'Bruna Papandrea' (qv) in 2012. First books optioned were, \"Gone Girl\" by 'Gillian Flynn' (qv) and \"Wild: A Journey from Lost to Found\" by 'Cheryl Strayed' (qv).", "Is just 9 years younger than 'Laura Dern' (qv), who played her mother in _Wild (2014)_ (qv).", "Since 2015, Witherspoon co-founded a Southern apparel store called Draper James.", "She has worked with 2 directors who have won a Best Director Oscar: 'Robert Benton' (qv) and 'James L. Brooks' (qv).", "As of August 2014, Witherspoon owns an estate at Nashville, Tennessee.", "Considers _Wild (2014)_ (qv) to be her best film and her best performance.", "Spoke at an event for the Stanford Graduate School of Business. [May 20, 2017].", "Visted her old dorm room at Stanford University and met the current occupant.[May 20, 2017].", "Friends with 'Jennifer Garner' (qv), 'Jennifer Aniston' (qv), 'Matthew McConaughey' (qv), 'Selma Blair' (qv), and 'Kate Hudson' (qv).", "Born on the day before 'Keri Russell' (qv)."], "quotes": ["[on having a baby]: Obviously, this isn't the time in my life that I would have chosen to do this, but I feel like life gives you these challenges for a reason. I feel so happy and glad to be in the place that I am. I really feel blessed. This is something I need to face and take control of.", "[on how she choose the films she will be in]: I have a weird process, but the main thing is like this: I hear her voice in my head. There are a lot of wonderful scripts my agents can't believe I pass on, but I do because I can't hear the voice. It doesn't appeal to me then. I'm really careful. Unless I hear the voice, I can't do it.", "[on 'Ryan Phillippe' (qv)]: I'm lucky to find a person to share my life, and the best friend I'll ever have.", "[on motherhood and her baby]: I feel good, I'm proud of _Election (1999)_ (qv) and very proud of this [her child]. It couldn't be a better time. It's always the right time when it happens. You make it the right time.", "[on _Pleasantville (1998)_ (qv)]: We were thrilled for just the three nominations we got, but obviously it's a little sad. I went through so many press junkets with people saying they loved it. And 'Joan Allen' (qv) was robbed but she can't get nominated every year. She's an inspiration for every young actress. She has that calm and reserve about herself and makes you think she appreciates the normal things of everyday. Then she transforms into this character that's so different.", "[on the movie business]: The battles that we face in this business aren't financial, but they are moral. And I certainly think that the longer you can keep your values, and your morality intact, and keep your head on your shoulders about what is important at the end of the day, you can get the most out of this business and really emerge with something wonderful.", "I grew up in Tennessee. We didn't know what Louis Vuitton was. I had to order all my prom outfits out of catalogs.", "People want to try and move you into a place where you can be easily identifiable by every woman in America - to be this very likable woman in a romantic comedy. And it's really hard for me. I just don't see myself as the girl that everybody likes. I never have been and I don't know how to be that person.", "As far as being in the spotlight and under public scrutiny, a lot of that's about how much you put yourself out there. It's not like we go to every premiere and every celebrity function and every charity auction. We really just try to maintain our privacy and never let our public persona get out of hand.", "I'm not perfect! I'm human. I make mistakes. But I try to be as conscious as I can about things I should be. If I'm going to do something commercial and mainstream and made for the masses, I just believe you can make those kinds of films with quality - and good ideas and good intentions. There's a lot of negativity out there.", "While making _Legally Blonde 2: Red, White & Blonde (2003)_ (qv), I had like 50 outfit changes. It was great! I'm real into the whole \"girlie\" thing, it was a lot of fun. I really enjoyed it.", "Attending an all-girls school has its advantages, there are no inhibitions. You can walk to school with your zit cream on and your hair in rollers and nobody cares.", "It's nice to come home to what's real. - E! _Revealed with Jules Asner (2001)_ (qv)", "[on husband 'Ryan Phillippe' (qv)] I don't think I can imagine a better guy than the one I've ended up with.", "There's something timeless and important about making people laugh, about being the right spot in their day. - as quoted in the December 7, 2004 issue of Woman's World.", "I was thinking about why I make movies, and I know why. Life is hard. It's nice to go escape and have a good time at the movies. If I can give people a movie about hope, love and the future, then I've done my job.", "I do think things were meant to happen. I'm just this little girl from Tennessee, and here I am today. I think a lot of things are just out of your hands.", "[When asked about the ways she is discriminated against] I get discriminated against in three ways: I get discriminated against because I'm blond, I get discriminated against because I'm an actress and I get discriminated against because I'm from the South.", "[on trying to get out of the role of 'June Carter Cash' (qv) in _Walk the Line (2005)_ (qv)] I did. I called my attorney. My agent. My manager. I said, \"You know y'all, you're serious about this?\". I'm really. I gotta get out of this. Like, can't they call 'LeAnn Rimes' (qv)? I mean she's good.", "[on doing her own singing in _Walk the Line (2005)_ (qv)] The director came to us and he said \"No, I really want you guys to learn to sing. To learn to play instruments and I want you to record an album.\" and that is what... and I just absolutely was just gob-smacked and I said, \"I don't know. I can't do that.\" And he said, \"Well, I want you to try.\" Now that's the thing for me. If someone asks me to try, I will always try.", "Life isn't just about you: It's about family and friends and giving back. - as quoted in Woman's World magazine 2-21-06.", "[on dual careers and marriage]: Marriage and family come before everything. You don't want to make a movie at the cost of your relationship.", "I feel like there's a race being run for some unattainable goal - to be the best, the skinniest, the most beautiful. I just admit that's what I'll never be.", "What gets me is how many women - young women - give up their power and sense of self. Thinking they're going to get more out of life if they take off their clothes and objectify themselves, instead of functioning on the principle that they're smart and capable, that you can be an actress and not be on the covers of T&A magazines. I'm flabbergasted by how many legitimate actresses do that. It blows my mind.", "(Part of her Oscar speech) I am so blessed to have my family here tonight. My mother and my father are here. And I just want to say thank you so much for everything, for being so proud of me. It didn't matter if I was making my bed or making a movie. They never hesitated to say how proud they were of me. And that means so very much to a child. So thank you, Mom and Dad. I want to say thank you to my wonderful husband and my two children who should be going to bed. And thank you for loving me so much and supporting me. And I want to say that, my grandmother was one of the biggest inspirations in my life. She taught me how to be a real woman to have strength and self respect, and to never give those things away. And those are a lot of qualities I saw in 'June Carter Cash' (qv). People used to ask June how she was doing, and she used to say -- \"I'm just trying to matter.\" And I know what she means. You know, I'm just trying to matter, and live a good life and make work that means something to somebody. And you have all made me feel that I might have accomplished that tonight. So thank you so much for this honor.", "I think everyone has their own set of problems, and sometimes I feel I'm in the middle of the biggest challenge of my life just trying to maintain normalcy in a kind of crazy lifestyle.", "I'm pretty conservative or old-fashion, I should say, it's how I grew up. I think you have to let your children be individuals, but you have to set boundaries. Ryan and I have similar ideas about all of it, you really have to support you partner in the things that are important to them and hold the line together.", "Many people worry so much about managing their careers, but rarely spend half that much energy managing their lives. I want to make my life, not just my job, the best it can be. The rest will work itself out.", "I have cellulite. I have stretch marks. I feel intimidated by Victoria's Secret. Hollywood is one of those endless competitions, but it's like running a race toward nothing. There's no winning. You're never going to win the pretty race. I just want to be the best version of myself that I can be.", "I feel like there's a race being run in Los Angeles for some unattainable goal - to be the best, the skinniest, the most beautiful. I just admit that that's what I'll never be. (Marie Claire - September 2005)", "I don't think these women are stupid. I think they're selling a personality that's very marketable: Wouldn't it be fun if we were all gorgeous and didn't have a care? But creating a cultural icon out of someone who goes, \"I'm stupid, isn't it cute?\" makes me want to throw daggers at them! I want to say to them, \"My grandma did not fight for what she fought for, and my mother did not fight for what she fought for, so you can start telling women it's fun to be stupid.\" Saying that to young women, little girls, my daughter? It's not okay. (Marie Claire - September 2005)", "I feel there are certain people who are systematically ripping [feminism] down because of their lack of regard and their ignorance about what the women before us had to go through. (Marie Claire - September 2005)", "What gets me is how many women - young women - give up their power and their sense of self. Thinking they're going to get more out of life if they take off their clothes and objectify themselves, instead of functioning on the principle that they're smart and capable, that you can be an actress and not be on the covers of T&A magazines. I'm flabbergasted by how many legitimate actresses do that. It blows my mind. (Marie Claire - September 2005)", "I'm wary of what goal I set, because then I'll have to accomplish it. (Vanity Fair - September 2004 - \"Regally Blonde\" by 'Leslie Bennett' (qv))", "[on being criticized after admitting she and then-husband 'Ryan Phillippe' (qv) have gone to couples therapy] Since when is self-improvement a negative? Why wouldn't I be interested in psychology? I like to read a lot of psychology books. I'm obsessed with child behavior; I would love to be a child psychologist. (Vanity Fair - September 2004 - \"Regally Blonde\" by 'Leslie Bennett' (qv))", "[on how she handles people who disagree with her] I've learned the art of ignoring people. When people give you some piece of direction you don't like, you just nod and ignore it. Just don't do it! Most people want to be heard and acknowledged, anyway. Just do what you want to do. (Vanity Fair - September 2004 - \"Regally Blonde\" by 'Leslie Bennett' (qv))", "[on struggling to be taken seriously in the industry] Even now, people want to marginalize me. They want to attribute all my success to teenagers seeing my movies. I really resent it when people say, \"It's just a genre film; it's a teen comedy.\" It takes a lot of work to make these things have heart and resonance so they're not just empty, disposable confections. But I don't give a damn about other people's perceptions, because I'll show them. For women in this business, ascendancy is always a battle. It's scrape and claw. I just try to stick to my guns and respect myself. I want to take the ingénues aside and say, \"Value yourself! It's okay if you have opinions!\". (Vanity Fair - September 2004 - \"Regally Blonde\" by 'Leslie Bennett' (qv))", "[on asserting herself, even with her employers] They want people they can push around. I was the girl who was always asking, \"Why? Yeah, I know you want me to do that - but why?\". I always thought people wanted to hear my opinions. ns] But I gave them anyway. It's just blind self-confidence. I get like a little terrier about things. My mother says I should have been an attorney. (Vanity Fair - September 2004 - \"Regally Blonde\" by 'Leslie Bennett' (qv))", "[on the harsh standards played on women by Hollywood] It's one of those endless competitions, but it's like running a race toward nothing. There's no winning. You're never going to win the thin race. You're never going to win the pretty race. You're never going to win the smart race. You're never going to win the funny race. I just want to be the best version of myself I can be. (Vanity Fair - September 2004 - \"Regally Blonde\" by 'Leslie Bennett' (qv))", "I like work. If it's not hard enough, I try to make it harder. I like the process of being daunted by it, tackling it, and knowing I can do it (Vanity Fair - September 2004 - \"Regally Blonde\" by 'Leslie Bennett' (qv))", "[on roles resembling the title character in _Penelope (2006)_ (qv)] I like this girl because she is a bit of a badass. I grew up watching movies with people like 'Barbara Stanwyck' (qv) and, sometimes, I get frustrated that there aren't a lot of great female characters out there that young women can look at and go, \"I want to be like that.\" I go to movies and yell at the women on-screen, \"Shoot him; just shoot him.\" I mean, why does the guy always have to shoot him?", "When I was a question on _Jeopardy! (1984)_ (qv), that's when I felt famous.", "There's always going to be somebody younger or sexier. That's why I like to say, and it's become my famous line, \"Funny doesn't sag.\".", "[on storing her Oscar] I have it out [at home] with the kids artwork... I think it's great when they hold it and dress it up.", "People want to make you easily identifiable with every woman in America, to be this very likable woman in a romantic comedy. And it's really hard for me. I just don't see myself as the girl everybody likes. I never have been and I don't know how to be that person.", "[on the Academy 'Awards' (qv)] It's funny that it all becomes about clothes. It's bizarre. You work your butt off and then you win an award and it's all about your dress. You can't get away from it.", "If you are not yelling at your kids, you are not spending enough time with them.", "[on 'Johnny Depp' (qv)] -- have to say probably 'Johnny Depp' (qv) in _21 Jump Street (1987)_ (qv). I just had a really major crush on him. I used to pull pictures out of Teen Beat and put them on my wall. I don't think he knows. I'm not sure it would faze him: I'm sure he's heard that quite a bit.", "My grandmother was a quintessential southern lady who didn't leave the house without being somewhat put together. She taught me it doesn't matter what's going on in your life, you've got to show your best self to the world.", "When you look good, you feel good. I know that's what Elle Woods says, but it's true!!", "I did one of those genetic testing things and I found out that I'm 63 percent Irish. I had no idea. I had no idea! I thought I was Scottish and Welsh. It turns out my parents are just full of shit, I guess. But now I'm Irish. It just makes so much sense. I'm a really good drinker. I love St. Patrick's Day. Potatoes are delicious. I'm looking forward to meeting all my cousins.", "[on 'Jean-Marc Vallée' (qv)] I feel safe with Jean-Marc - more safe than I've ever felt with anybody, because he's my brother, he's my partner; I know he's always going to demand the best, but I'm always going to bring my best. We hold each other to those standards. We don't have any artifice between us."], "salary history": ["_Fear (1996)_ (qv)::$200,000", "_Cruel Intentions (1999)_ (qv)::$250,000", "_Legally Blonde (2001)_ (qv)::$2,500,000", "_Sweet Home Alabama (2002)_ (qv)::$12,500,000", "_Legally Blonde 2: Red, White & Blonde (2003)_ (qv)::$15,000,000", "_Vanity Fair (2004)_ (qv)::$15,000,000", "_Walk the Line (2005)_ (qv)::$15,000,000", "_Just Like Heaven (2005)_ (qv)::$15,000,000", "_Four Christmases (2008)_ (qv)::$14,000,000", "_How Do You Know (2010)_ (qv)::$15,000,000", "_Water for Elephants (2011)_ (qv)::$2,000,000", "_This Means War (2012)_ (qv)::$12,000,000", "_The Morning Show (2019)_ (qv)::$1,250,000 /episode+back end(2019,2020)"], "birth date": "1976-03-22", "birth notes": "New Orleans, Louisiana, USA", "_actorID": "94", "_source": "IMDB", "actorID": "0000702", "created_utc_dt": "09/14/2019, 13:02:38"}