{"headshot": "https://m.media-amazon.com/images/M/MV5BMjAwNDU3MzcyOV5BMl5BanBnXkFtZTcwMjc0MTIxMw@@._V1_UY98_CR3,0,67,98_AL_.jpg", "nick names": ["Bobby Milk", "Kid Monroe", "Bob", "Bobby D"], "birth name": "Robert Anthony De Niro Jr.", "height": "5' 9¾\" (1.77 m)", "mini biography": ["One of the greatest actors of all time, 'Robert De Niro' (qv) was born on August 17, 1943 in Manhattan, New York City, to artists Virginia (Admiral) and 'Robert De Niro' (qv) Sr. His paternal grandfather was of Italian descent, and his other ancestry is English, Dutch, German, French and Irish. He was trained at the 'Stella Adler' (qv) Conservatory and the American Workshop. De Niro first gained fame for his role in _Bang the Drum Slowly (1973)_ (qv), but he gained his reputation as a volatile actor in _Mean Streets (1973)_ (qv), which was his first film with director 'Martin Scorsese' (qv). He received an Academy Award for Best Supporting Actor for his role in _The Godfather: Part II (1974)_ (qv) and received Academy Award nominations for best actor in _Taxi Driver (1976)_ (qv), _The Deer Hunter (1978)_ (qv) and _Cape Fear (1991)_ (qv). He received the Academy Award for Best Actor for his role as 'Jake LaMotta' (qv) in _Raging Bull (1980)_ (qv).De Niro has earned four Golden Globe Award nominations for Best Actor - Motion Picture Musical or Comedy, for his work in _New York, New York (1977)_ (qv), opposite 'Liza Minnelli' (qv), _Midnight Run (1988)_ (qv), _Analyze This (1999)_ (qv) and _Meet the Parents (2000)_ (qv). Other notable performances include _Brazil (1985)_ (qv), _The Untouchables (1987)_ (qv), _Backdraft (1991)_ (qv), _Mary Shelley's Frankenstein (1994)_ (qv), _Heat (1995)_ (qv), _Casino (1995)_ (qv) and _Jackie Brown (1997)_ (qv). At the same time, he also directed and starred in such films as _A Bronx Tale (1993)_ (qv) and _The Good Shepherd (2006)_ (qv). De Niro has also received the AFI Lifetime Achievement Award in 2003 and the Golden Globe 'Cecil B. DeMille' (qv) Award in 2010.::Pedro Borges"], "spouse": ["'Grace Hightower' (qv)::(17 June 1997 - present) ( separated) ( 2 children)", "'Diahnne Abbott' (qv)::(28 April 1976 - 1988) ( divorced) ( 2 children)"], "trade mark": ["Often played characters that were prone to brutal violence and/or characters who were borderline psychotics.", "Known for method acting techniques with his characters by heavily studying  their backgrounds.", "Mole on his right cheek", "Often plays violently angry and yet extensively depressed men", "Frequently works with 'Martin Scorsese' (qv).", "Intense physical and mental preparation for roles", "Distinctive New York accent", "Often plays antiheroes and/or ambiguous, shifty characters.", "Often works with 'Bradley Cooper' (qv), 'David O. Russell' (qv) and 'Jennifer Lawrence' (qv)."], "trivia": ["After marrying 'Diahnne Abbott' (qv) he adopted her daughter 'Drena De Niro' (qv), Abbott's daughter from her previous marriage. Drena refuses to identify her biological father. He also has son 'Raphael De Niro' (qv) with Abbott.", "Had a long-term relationship with fashion model 'Toukie Smith' (qv), sister of the late fashion designer 'Willi Smith' (qv). They have twins sons together.", "He married his second wife 'Grace Hightower' (qv) in 1997, and she gave birth to their son, Elliot De Niro on March 18, 1998. In 1999, the couple renewed marriage vows at their Ulster County farm in New York's Catskill Mountains, but later that year De Niro filed for divorce. Their fallout continued into 2001 as a potential custody battle over their son, Elliott, heated up. However, the divorce was never finalized and they managed to smooth over their troubles. Their second child was born in December 2011 via surrogate.", "When he was a child, he was an avid reader of playwrights.", "Growing up in the Little Italy section of New York City, his nickname was \"Bobby Milk\" because he was so thin and as pale as milk.", "He turned down the role of Jesus in _The Last Temptation of Christ (1988)_ (qv). He was considered for the role of Josh Baskin in 'Penny Marshall' (qv)'s _Big (1988)_ (qv). He was offered the role of Sal the pizza shop owner in _Do the Right Thing (1989)_ (qv), which he turned down.", "Son of painter Virginia Admiral and abstract expressionist 'Robert De Niro' (qv) Sr.. Despite being raised Presbyterian, Virginia was an atheist for most of Robert's childhood. Robert Sr. was raised Catholic but was not religious in any way. After De Niro was born, his father Robert Sr. came out as a homosexual and eventually divorced Robert's mother.", "He formed his own production company, Tribeca Film Center (1989).", "In his 1980 Oscar acceptance speech, he thanked Joey LaMotta (brother of 'Jake LaMotta' (qv)), who was at the time suing United Artists for the portrayal of him in _Raging Bull (1980)_ (qv).", "After being caught up in a Paris prostitution ring investigation, he, denying any involvement, vowed never to return to France again (1998).", "Although he is sometimes referred to as an Italian-American actor, De Niro is actually one quarter Italian in ancestry. His father was of half Italian and half Irish descent. His mother was of Dutch, English, German, French and Irish ancestry on her own father's side, and of German ancestry on her own mother's side. Robert was quite close to his Italian paternal grandfather, whom he visited frequently in Syracuse, New York when he was young. De Niro has stated that he identifies \"more with [his] Italian side\". He was inducted into the Italian-American Hall of Fame (2002).", "He is the second actor to receive an Academy Award for portraying Vito Corleone. He and 'Marlon Brando' (qv) are the only two actors to receive an Academy Award for playing the same character.", "He first discovered his love for acting at age 10 when he portrayed the Cowardly Lion in a local production of \"The Wizard of Oz\". He dropped out of high school to join a gang.", "Formerly held the World Record for Most Weight Gained for a Movie, in gaining over 60 pounds for his role in _Raging Bull (1980)_ (qv). But seven years later, 'Vincent D'Onofrio' (qv) eclipsed him in gaining 70 pounds for his role in _Full Metal Jacket (1987)_ (qv).", "Three movies (at least) that De Niro has appeared in have the song \"Gimme Shelter\" by 'The Rolling Stones' (qv) noticeably featured in the soundtrack: _Goodfellas (1990)_ (qv), _Casino (1995)_ (qv) and _The Fan (1996)_ (qv).", "Ranked #78 in Premiere magazine's 2002 annual Power 100 List.", "In 1993, he was tapped to star as 'Enzo Ferrari' (qv) in the film \"Ferrari\", which was budgeted at $65 million (U.S.) and had 'Michael Mann' (qv) attached as director. The project fell through.", "He organized the first Tribeca Film Festival in May 2002. He intended to revitalize the Lower Manhattan area after the September 11 attacks.", "Has said that 'Meryl Streep' (qv) is his favorite actress to work with.", "He was voted as the best actor of all time at FilmFour.com (2002).", "In 1984, British pop group 'Bananarama' (qv) had a song dedicated to him called \"'Robert De Niro' (qv)'s Waiting\". De Niro heard about this and arranged to meet the three girls, but they got so nervous, while waiting for him, that they got drunk before he even arrived.", "Diagnosed with prostate cancer, and expected to make a full recovery. [October 2003]", "Spent four months learning to speak the Sicilian dialect in order to play Vito Corleone in _The Godfather: Part II (1974)_ (qv). Nearly all the dialogue that his character spoke in the movie was in Sicilian.", "According to a profile in Vanity Fair's annual Hollywood issue, is the first actor to do a method interpretation of a cartoon character as Fearless Leader in _The Adventures of Rocky & Bullwinkle (2000)_ (qv).", "He started the whole \"awards show ribbon\" tradition by wearing a green ribbon on his lapel at the 1981 Academy 'Awards' (qv). The ribbon was in rememberance of several African-American children who were victims of a serial killer in Atlanta, Georgia in 1980-1981. The ribbon was given to him by a fan in the bleachers as he arrived; the victims' families had been wearing them for months.", "Was in Ossining, New York (home of the infamous Sing Sing penitentiary) to shoot three different movies: _Analyze This (1999)_ (qv), _Analyze That (2002)_ (qv) and _Hide and Seek (2005)_ (qv).", "In the Egyptian film _El Medina (1999)_ (qv), the main actor Ali has a duck that he named De Niro after his favorite actor.", "Was voted the No. #2 greatest movie star of all time in a Channel 4 (UK) poll, narrowly being beaten by 'Al Pacino' (qv).", "This was tricky to make him look huge as Frankenstein's monster in _Mary Shelley's Frankenstein (1994)_ (qv) , considering that 'Kenneth Branagh' (qv), who played Dr. Frankenstein, is of similar height. Many of the tricks used to make humans, wizards and elves dwarf the hobbits later on for the Lord of the Rings trilogy were also employed to make De Niro appear much bigger than his co-stars, including using very large men as body doubles for shots where only the hands and feet are seen.", "He was voted the 34th Greatest Movie Star of all time by Entertainment Weekly.", "Singer 'PJ Harvey' (qv) refers to De Niro in a song, \"Reeling\", from her album \"4-Track Demos\".", "'Finley Quaye' (qv) mentions him in the song \"Sunday Shining\", in the line \"I'm a hero like 'Robert De Niro' (qv)\".", "Was unable to accept his first Academy Award in 1975 due to filming commitments to 'Bernardo Bertolucci' (qv)'s _1900 (1976)_ (qv).", "Was good friends with comedian 'John Belushi' (qv), who died of a drug overdose on March 5, 1982. In fact, De Niro and 'Robin Williams' (qv) were the last stars to see Belushi alive, albeit on separate visits to Bungalow #3 of L.A.'s Chateau Marmont hotel that fateful day. De Niro visited Belushi at 3:00 am on the morning of his death, but, according to eyewitnesses, left minutes later after seeing that Belushi was sick. Less than an hour earlier, Belushi had been visited by 'Robin Williams' (qv), who also left straight away.", "Ranked #1 in Empire (UK) magazine's \"The Greatest Living Actor (Gods Among Us)\" list. [October 2004]", "At age 17, after leaving the movies with a friend, he unexpectedly stated that he was going to be a film actor. No one believed him until he dropped out of his senior year of high school and joined 'Stella Adler' (qv)'s acting school.", "His boyhood idols among actors included 'Montgomery Clift' (qv), 'Robert Mitchum' (qv) and 'Marlon Brando' (qv). He preferred the darker, more character-driven work of these men to the older stars of Hollywood, for whom their public persona as a star was more important than their immersion into the character.", "Rarely does interviews and is known as one of the most ultra-private celebrities. He was the subject of a late 1990s interview (and cover photo) for Esquire magazine. Most of the article focused on how guarded he is with his personal life, what few details are known about him, what rumors are speculated while only a minority of the article dealt with the actual interview itself. The writer noted that while the interview was ultimately agreed upon, he was given a substantial list of off-limit subjects not to ask De Niro about. They included: politics, religion, his family, his reported interest in fine wines, and so on.", "When they met shortly before making _Mean Streets (1973)_ (qv) De Niro and 'Harvey Keitel' (qv) became fast friends. De Niro was from Greenwich Village in Manhattan and was taught by 'Stella Adler' (qv) and Keitel was from the Brighton Beach area of Brooklyn and was mainly mentored by 'Lee Strasberg' (qv). But the two guarded actors bonded and remain close to this day.", "He and 'Martin Scorsese' (qv) were brought up blocks apart in the Greenwich Village area of Manhattan, but never formally met when they were young. When introduced at a party in 1972, the two came to realize that they had seen each other many times but had never spoken.", "Limousine drivers in Los Angeles joke about his less than generous tips by referring to him as \"No Dinero\".", "Very good friends with 'Joe Pesci' (qv). They appeared together in six films: _Raging Bull (1980)_ (qv), _Once Upon a Time in America (1984)_ (qv), _Goodfellas (1990)_ (qv), _A Bronx Tale (1993)_ (qv), _Casino (1995)_ (qv) and _The Good Shepherd (2006)_ (qv).", "In October 1997, he ranked #5 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. In 2005, Premiere magazine ranked him as #38 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature.", "Both of his Oscar-winning performances involved 'Marlon Brando' (qv). His first Oscar, for Best Supporting Actor, had him playing the younger version of Brando's character Vito Corleone. His second, for Best Actor in _Raging Bull (1980)_ (qv), he recited Brando's famous lines from _On the Waterfront (1954)_ (qv).", "Underwent surgery for prostate cancer at New York's Sloan-Kettering Hospital. The cancer has now gone into remission. [December 2003]", "Co-owns the Rubicon restaurant in San Francisco with Bay area residents 'Francis Ford Coppola' (qv) and 'Robin Williams' (qv). Much of his father's art work adorns the walls of the business. He also owns a restaurant in West Hollywood, Ago, and co-owns several restaurants in New York, including Nobu and Layla.", "Shares a birthday with friend and sometime-co-star 'Sean Penn' (qv).", "First performer to receive an Academy Award (for _The Godfather: Part II (1974)_ (qv)) for a performance in a sequel.", "He is a staunch supporter of the US Democratic Party. He lobbied Congress against impeaching President 'Bill Clinton' (qv) in 1998. He supported 'Al Gore' (qv) in the 2000 Presidential election and supported 'John Kerry' (qv) in the 2004 Presidential election. Supported Democratic senator 'Barack Obama' (qv) for the 2008 presidential election.", "His performance as 'Jake LaMotta' (qv) in _Raging Bull (1980)_ (qv) is ranked #10 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "His performance as Travis Bickle in _Taxi Driver (1976)_ (qv) is ranked #42 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "Before 'Tim Burton' (qv) was commissioned as director, he was considered for the role of Willy Wonka in _Charlie and the Chocolate Factory (2005)_ (qv). The role went to 'Johnny Depp' (qv).", "He was offered the role of Dick Tracy in _Dick Tracy (1990)_ (qv), which went to 'Warren Beatty' (qv).", "He turned down the role of Tony D'Amato in _Any Given Sunday (1999)_ (qv), which went to 'Al Pacino' (qv).", "Passed up the opportunity to play Frank Costello in _The Departed (2006)_ (qv) to work on his second directorial feature _The Good Shepherd (2006)_ (qv).", "After _Once Upon a Time in America (1984)_ (qv), director 'Sergio Leone' (qv) planning to cast De Niro in a film he was working on about the siege of Leningrad in World War II, but that project never came about due to Leone's death in 1989.", "For the role of Max Cady in _Cape Fear (1991)_ (qv), he paid a dentist $5,000 to make his teeth look suitably bad. After filming, he paid $20,000 to have them fixed. For this film, he was tattooed with vegetable dyes, which faded after a few months.", "Accidentally broke a rib of 'Joe Pesci' (qv) in a sparring scene in _Raging Bull (1980)_ (qv). This shot appears in the film: De Niro hits Pesci in the side, Pesci groans, and there is a quick cut to another angle.", "Mentioned in ''Weird Al' Yankovic' (qv)'s song, \"Frank's 2000 TV\".", "Owns residences on the east and west sides of Manhattan as well as near Marbletown, New York.", "Is one of five performers to win an Oscar playing a character that spoke mostly in a foreign language. The other are 'Sophia Loren' (qv), 'Marion Cotillard' (qv), 'Roberto Benigni' (qv) and 'Benicio Del Toro' (qv).", "Played a real-life CIA director in _The Good Shepherd (2006)_ (qv) and another real-life CIA agent in _Ronin (1998)_ (qv), as well as a fictional CIA agent in _Meet the Parents (2000)_ (qv).", "Mentioned in the song \"Gun Love\" by the rock band 'ZZ Top' (qv), in the line \"Runnin' with the Wild Bunch, makin' like 'Robert De Niro' (qv)\".", "(November 11, 2008) Attended the star-studded opening of Dubai's lavish Atlantis Palms resort. Guests were welcomed in style with a display of one million fireworks, said to be visible from space.", "Is mentioned in 'Stephen Lynch' (qv)'s song \"Vanilla Ice Cream\".", "As of the fifth edition of 1001 Movies You Must See Before You Die (edited by Steven Jay Schneider), De Niro is the most represented actor, by 14 films. Included are the De Niro films _Mean Streets (1973)_ (qv), _The Godfather: Part II (1974)_ (qv), _Taxi Driver (1976)_ (qv), _1900 (1976)_ (qv), _The Deer Hunter (1978)_ (qv), _Raging Bull (1980)_ (qv), _The King of Comedy (1982)_ (qv), _Once Upon a Time in America (1984)_ (qv), _Brazil (1985)_ (qv), _The Untouchables (1987)_ (qv), _Goodfellas (1990)_ (qv), _Casino (1995)_ (qv), _Heat (1995)_ (qv) and _Meet the Parents (2000)_ (qv).", "He based the movement of his character Travis Bickle in _Taxi Driver (1976)_ (qv) on that of a crab. He thought the character was indirect and tended to shift from side to side.", "He visited 'Michael Jackson' (qv) on the set of filming the \"Smooth Criminal\" segment for _Moonwalker (1988)_ (qv). Also visiting the set was 'Gregory Peck' (qv), and 'Bruce Willis' (qv).", "Was cited as one of the most promising movie personalities of 1973 in John Willis' 1974 Film Annual \"Screen World\" book.", "One of the five winners of the 2009 Kennedy Center Honors. Other 2009 winners were 'Bruce Springsteen' (qv), 'Dave Brubeck' (qv), 'Mel Brooks' (qv), and 'Grace Bumbry' (qv).", "Mentioned in 'Jay Z' (qv)'s and 'Alicia Keys' (qv)' song \"Empire of State\".", "Is almost perfectly imitated by St. Louis Cardinals' Shortstop, 'Brendan Ryan' (qv), especially during post game interviews.", "He studied drama at HB Studio in Greenwich Village, New York City.", "He won an Oscar for playing Jake La Motta in _Raging Bull (1980)_ (qv), making him one of 18 actors to win the Award for playing a real person who was still alive at the evening of the Award ceremony (as of 2015). The other seventeen actors and their respective performances are: 'Spencer Tracy' (qv) for playing Father Edward Flanagan in _Boys Town (1938)_ (qv), 'Gary Cooper' (qv) for playing Alvin C. York in _Sergeant York (1941)_ (qv), 'Patty Duke' (qv) for playing Helen Keller in _The Miracle Worker (1962)_ (qv), 'Jason Robards' (qv) for playing Ben Bradlee in _All the President's Men (1976)_ (qv), 'Sissy Spacek' (qv) for playing Loretta Lynn in Coal Miner's Daughter (1980)_, 'Jeremy Irons' (qv) for playing Claus Von Bullow in _Reversal of Fortune (1990)_ (qv), 'Susan Sarandon' (qv) for playing Sister Helen Prejean in _Dead Man Walking (1995)_ (qv), 'Geoffrey Rush' (qv) for playing David Helfgott in _Shine (1996)_ (qv), 'Julia Roberts' (qv) for playing Erin Brockovich in _Erin Brockovich (2000)_ (qv), 'Jim Broadbent' (qv) for playing John Bayley in _Iris (2001)_ (qv), 'Jennifer Connelly' (qv) for playing Alicia Nash in _A Beautiful Mind (2001)_ (qv), 'Helen Mirren' (qv) for playing Queen Elizabeth II in _The Queen (2006)_ (qv), 'Sandra Bullock' (qv) for playing Leigh Anne Tuohy in _The Blind Side (2009)_ (qv), 'Melissa Leo' (qv) for playing Alice Eklund-Ward in _The Fighter (2010)_ (qv), 'Christian Bale' (qv) for playing Dickie Eklund in _The Fighter (2010)_ (qv), 'Meryl Streep' (qv) for playing Margaret Thatcher in _The Iron Lady (2011)_ (qv), and 'Eddie Redmayne' (qv) for playing Stephen Hawking in _The Theory of Everything (2014)_ (qv).", "First guest to appear on _Late Night with Jimmy Fallon (2009)_ (qv) on March 2, 2009.", "Receive the 'Cecil B. DeMille' (qv) Award at the Golden Globe 'Awards' (qv). [January 2011]", "Unlike 'Marlon Brando' (qv), who preceded him as Don Vito Corleone, he actually has Italian ancestry in his background. He and Brando both have Dutch ancestry.", "He was originally cast in the role of Bill the Butcher in _Gangs of New York (2002)_ (qv), but pulled out when he discovered this would mean spending six months in Europe and was replaced by 'Daniel Day-Lewis' (qv).", "He was considered for the role of Harry Line in _Home Alone (1990)_ (qv), which went to his good friend 'Joe Pesci' (qv).", "Is an only child of 'Robert De Niro' (qv) Sr. and Virginia Admiral.", "Is mentioned in 'Billy Bragg' (qv)'s 1991 song \"Sexuality\".", "President of the jury at the 2011 Cannes Film Festival.", "The longest he has gone without an Oscar nomination is 21 years, between _Cape Fear (1991)_ (qv) and _Silver Linings Playbook (2012)_ (qv).", "Became a father for the first time at age 33 when his [now ex] wife 'Diahnne Abbott' (qv) gave birth to their son 'Raphael De Niro' (qv) on November 9, 1976.", "Became a father for the second and third time at age 52 when his twins Julian Henry and Aaron Kendrick De Niro with [now ex] partner 'Toukie Smith' (qv) were born via a surrogate on October 20, 1995.", "Became a father for the fourth time at age 54 when his second wife 'Grace Hightower' (qv) gave birth to their son Elliot De Niro on March 18, 1998.", "Became a father for the fifth time at age 68 when his daughter Helen Grace De Niro with second wife 'Grace Hightower' (qv) was born via a surrogate in December 2011.", "As of 2015, has appeared in nine films that were nominated for the Best Picture Oscar: _The Godfather: Part II (1974)_ (qv), _Taxi Driver (1976)_ (qv), _The Deer Hunter (1978)_ (qv), _Raging Bull (1980)_ (qv), _The Mission (1986)_ (qv), _Awakenings (1990)_ (qv), _Goodfellas (1990)_ (qv), _Silver Linings Playbook (2012)_ (qv) and _American Hustle (2013)_ (qv). Of those, _The Godfather: Part II (1974)_ (qv) and _The Deer Hunter (1978)_ (qv) are winners in the category. Goodfellas and Awakenings were released in the same year, 1990.", "_The Godfather (1972)_ (qv) predicts both of his Oscar-winning roles. In a scene with Vito Corleone, a poster advertising a 'Jake LaMotta' (qv) fight can be seen.", "He and his close friend 'Gérard Depardieu' (qv) have both received Oscar nominations for playing a role that had already earned an Oscar for another actor. DeNiro won his first Oscar for playing Don Vito Corleone in _The Godfather: Part II (1974)_ (qv), a role previously played by 'Marlon Brando' (qv). Depardieu was nominated for _Cyrano de Bergerac (1990)_ (qv), a role that previously won an Oscar for 'José Ferrer' (qv).", "Read the book _Raging Bull (1980)_ (qv) while filming _The Godfather: Part II (1974)_ (qv). His roles in both films would win him an Academy Award.", "Has played characters that are Vietnam veterans on five occasions: _Taxi Driver (1976)_ (qv), _The Deer Hunter (1978)_ (qv), _Jacknife (1989)_ (qv), Meet the Parents trilogy, and _Grudge Match (2013)_ (qv).", "He was considered for the role of Howard Payne in _Speed (1994)_ (qv), which went to 'Dennis Hopper' (qv) instead.", "Before 'Martin Scorsese' (qv) was hired to direct _Taxi Driver (1976)_ (qv), others considered for the role of Travis Bickle were 'Jeff Bridges' (qv), 'Jack Nicholson' (qv), 'Dustin Hoffman' (qv), 'Warren Beatty' (qv), 'Burt Reynolds' (qv), 'Ryan O'Neal' (qv), 'Peter Fonda' (qv), 'Al Pacino' (qv), 'Jon Voight' (qv), 'Robert Blake' (qv), 'David Carradine' (qv), 'Richard Dreyfuss' (qv), 'Christopher Walken' (qv), 'Alain Delon' (qv), 'James Caan' (qv), 'Roy Scheider' (qv), 'Paul Newman' (qv), 'Marlon Brando' (qv), 'Martin Sheen' (qv), 'Elliott Gould' (qv), 'Alan Alda' (qv), 'Neil Diamond' (qv), 'George Hamilton' (qv), 'Charles Grodin' (qv) and 'Kris Kristofferson' (qv).", "In the 1950s, Robert lived with his mother in the top floor apartment at 219 West 14th Street in Manhattan's \"Little Spain\".", "He was offered the roles of Captain Robert Stout and Staff Sergeant Eddie Dohun in _A Bridge Too Far (1977)_ (qv) but turned both down. 'Elliott Gould' (qv) and 'James Caan' (qv) were cast respectively.", "Walked out of a Radio Times interview after saying the journalist was asking him questions with a \"negative inference\".", "He gained 60 pounds for a single scene playing an older Jake La Motta in _Raging Bull (1980)_ (qv).", "There is a \"De Niro Men's Clothing Shop\" in Chengdu, China.", "He turned down the role of Hopper in _A Bug's Life (1998)_ (qv), which went to 'Kevin Spacey' (qv).", "He was considered for the role of Doctor Octopus in _Spider-Man 2 (2004)_ (qv), which went to 'Alfred Molina' (qv).", "Has worked with eight directors who have won an Oscar for Best Director: 'Martin Scorsese' (qv), 'Francis Ford Coppola' (qv), 'Bernardo Bertolucci' (qv), 'Elia Kazan' (qv), 'Michael Cimino' (qv), 'Ron Howard' (qv), 'Barry Levinson' (qv) and 'Alfonso Cuarón' (qv).", "He was offered the role of Mitch Leary in _In the Line of Fire (1993)_ (qv), which he turned down due to scheduling conflicts with _A Bronx Tale (1993)_ (qv). The role went to 'John Malkovich' (qv).", "Longtime friend/fan and confidant of 'Whoopi Goldberg' (qv).", "Prefers making movies to acting on stage.", "He was awarded the Presidential Medal of Freedom, the nation's highest civilian award, by President 'Barack Obama' (qv), in a live televised ceremony held in the East Room of the White House, on November 22, 2016, along with twenty other recipients, the the largest, and final Medal of Freedom ceremony of Obama's presidency. At this ceremony, the twenty-one recipients, in alphabetical order, included: 'Kareem Abdul-Jabbar' (qv), 'Elouise Cobell' (qv) (posthumous award given to her son), 'Ellen DeGeneres' (qv), 'Robert De Niro' (qv), 'Richard Garwin' (qv), 'Bill Gates' (qv), 'Melinda Gates' (qv), 'Frank Gehry' (qv), 'Margaret Hamilton' (qv) (as Margaret H. Hamilton), 'Tom Hanks' (qv), Rear Admiral 'Grace Hopper' (qv) (posthumous award given to her niece), 'Michael Jordan' (qv), 'Maya Lin' (qv), 'Lorne Michaels' (qv), 'Newton Minow' (qv), 'Eduardo Padron' (qv) (as Eduardo Padrón), 'Robert Redford' (qv), 'Diana Ross' (qv), 'Vin Scully' (qv), 'Bruce Springsteen' (qv) and 'Cicely Tyson' (qv).", "He was the one who first made 'Martin Scorsese' (qv) aware of 'Leonardo DiCaprio' (qv). He had worked with DiCaprio on _This Boy's Life (1993)_ (qv) and had been very impressed by his talent and spoke about him to his friend and frequent collaborator. Scorsese and DiCaprio would later work together on many films.", "De Niro revealed in March 2016, that his son Elliot is autistic.", "In an interview with Total Film magazine in 2007, he praised 'Eddie Redmayne' (qv), whom he directed and starred with in _The Good Shepherd (2006)_ (qv), when asked about younger actors whom he liked.", "Maternal grandson of Donald (1890-1949), born in the state of Illinois, and Alice (née Groman) Admiral (1887-1962), born in the state of Iowa.", "Maternal great grandson of Nicholas (1853-1918), born in Holland, and Virginia (née Holton) Admiral (1848-1928), born in the state of Kentucky.", "He has appeared in six films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _Mean Streets (1973)_ (qv), _The Godfather: Part II (1974)_ (qv), _Taxi Driver (1976)_ (qv), _The Deer Hunter (1978)_ (qv), _Raging Bull (1980)_ (qv) and _Goodfellas (1990)_ (qv).", "Maternal great grandson of August (1856-1947) and Gesina (née Beckman) Groman (1860-1949). Both were born and raised in the state of Indiana and died in the state of Iowa.", "'Robert De Niro' (qv)'s Best Actor Oscar nomination for _Cape Fear (1991)_ (qv) is the only time he was nominated for his performance in a film which was not nominated for Best Picture.", "Speaks fluent Italian and French.", "At the 31st AFI Life Achievement 'Awards' (qv), 'Jodie Foster' (qv) credited De Niro with introducing her to the true craft of acting. During production of _Taxi Driver (1976)_ (qv), he would insist that they'd meet for coffee and rehearse their scenes from together at a local diner. After a while, Jodie became bored of the routine until De Niro began improvising lines during their rehearsals. Jodie soon learned to follow his improv as he weaved back and forth to the original script, in essence teaching her how to effectively build a character.", "Cites actor 'Alec Baldwin' (qv)'s De Niro impressions as his favorites.", "His father left home when he was 2.", "He left school at 16 and trained with 'Stella Adler' (qv) and 'Lee Strasberg' (qv).", "He appeared in off - Broadway productions and with touring companies before making his film debut in Brian de Palma's 'Greetings' in 10968.", "As a teenager he ran with the Greenwich Village 'Kenmare Street Gang'.", "In 1988 he and Jane Rosenthal founded Tribeca production company which develops projects for him to produce, direct or appear in."], "quotes": ["It's important not to indicate. People don't try to show their feelings, they try to hide them.", "I don't like to watch my own movies--I fall asleep in my own movies.", "Don't talk it [shooting a scene] away, do it!", "Some people say that drama is easy, and comedy is hard. Not true. I've been making comedies the last couple of years, and it's nice. When you make a drama, you spend all day beating a guy to death with a hammer, or what have you. Or you have to take a bite out of somebody's face. On the other hand, with a comedy, you yell at 'Billy Crystal' (qv) for an hour, and you go home.", "[interview in Chicago Sun Times, 1/8/98] I think Hollywood has a class system. The actors are like the inmates, but the truth is they're running the asylum. You've got to look at the whole studio structure. There's these guys. We call them suits. They have the power to okay a film. They're like your parents, going, \"We have the money\". But at the same time they say to us actors, \"We love you. We can't do without you\". You know, I've been around a long time. I've seen the suits run the asylum. I think I can do it as good or even better. Let me try it. That's why I have TriBeCa.", "I go to Paris, I go to London, I go to Rome, and I always say, \"There's no place like New York. It's the most exciting city in the world now. That's the way it is. That's it.\"", "I've never been one of those actors who has touted myself as a fascinating human being. I had to decide early on wether I was to be an actor or a personality.", "[on acting] The whole thing is for younger people who are sexy and youthful.", "[on the mobster characters he often plays] The characters that I play are real. They are real so they have as much right to be portrayed as any other characters. There are other characters I have played, other than those ones that have been called stereotypes or whatever. So.", "People treat me with a bit too much reverence. Look at 'Dustin Hoffman' (qv). I always envy the way he can speak and be smart and funny and so on. I just can't do that.", "[on 'Al Pacino' (qv)] Al, over the years we've taken roles from one another. People have tried to compare us to one another, to pit us against one another and to tear us apart personally. I've never seen the comparison, frankly. I'm clearly much taller, more the leading-man type. Honestly, you just may be the finest actor of our generation--with the possible exception of me.", "One of the things about acting is it allows you to live other people's lives without having to pay the price.", "I am part Italian, I'm not all Italian. I'm part Dutch, I'm part French, I'm part German, I'm part Irish. But my name is Italian and I probably identify more with my Italian side than with my other parts.", "If there is a God, he has a lot to answer for. You'll have time to rest when you're dead.", "After my first movies, I gave interviews. Then I thought, \"What's so important about where I went to school, and hobbies? What does any of that have to do with acting, with my own head?\".", "There is a mixture of anarchy and discipline in the way I work. The talent is in the choices.", "[in 2004] I love Italy and I have a deep tie with my Italian roots. I stand for ['John Kerry' (qv) (I)]. I hope he will arrive at the White House. We need a different government to represent America. The change of presidency would be a clear and international sign to say that we are approaching again to the rest of the world. I don't want any prize that can influence this election. I stand for Kerry.", "[on the infamous line from _Taxi Driver (1976)_ (qv)] You have no idea that, years later, people in cars will recognize you on the street and shout, \"You talkin' to me?\" I don't remember the original script, but I don't think the line was in it. We improvised. For some reason it touched a nerve. That happens.", "Some people say, \"New York's a great place to visit, but I wouldn't want to live there.\" I say that about other places.", "It's true: I spent lunchtime in a grave during the filming of _Bloody Mama (1970)_ (qv). When you're younger, you feel that's what you need to do to help you stay in character. When you get older, you become more confident and less intense about it--and you can achieve the same effect. You might even be able to achieve more if you take your mind off it, because you're relaxed. That's the key to it all. When you're relaxed and confident, you get good stuff.", "Movies are hard work. The public doesn't see that. The critics don't see it. But they're a lot of work. A lot of work. When I'm directing a great dramatic scene, part of me is saying, \"Thank God, I don't have to do that\". Because I know how fucking hard it is to act. It's the middle of the night. It's freezing. You gotta do this scene. You gotta get it up to get to that point. And yet, as a director, you've got to get the actors to that point. It's hard either way.", "When I was a teenager, I went to the Dramatic Workshop at the New School. The school had a lot of actors under the GI Bill--Rod Steiger, 'Harry Belafonte' (qv), the generation ahead of me. I went in there and the director said to me, \"Vy do you vant to be an acteh?\" I didn't know how to answer, so I didn't say anything. And he said, \"To express yourself!\" And I said, \"Yeah, yeah, that's it. That's right.\"", "[on witnessing the terrorist attack on New York on 9/11/2001] I left a meeting right after they hit the World Trade Center. I went to my apartment, which looks south, and I watched it out my window. I could see the line of fire across the North Tower. I had my binoculars and a video camera--though I didn't want to video it. I saw a few people jump. Then I saw the South Tower go. It was so unreal, I had to confirm it by immediately looking at the television screen. CNN was on. That was the only way to make it real. Like my son said: \"It was like watching the moon fall\".", "The hardest thing about being famous is that people are always nice to you. You're in a conversation and everybody's agreeing with what you're saying--even if you say something totally crazy. You need people who can tell you what you don't want to hear.", "I didn't have a problem with rejection, because when you go into an audition, you're rejected already. There are hundreds of other actors. You're behind the eight ball when you go in there. At this point in my career, I don't have to deal with audition rejections. So I get my rejection from other things. My children can make me feel rejected. They can humble you pretty quick.", "Money makes your life easier. If you're lucky to have it, you're lucky.", "I only go to Los Angeles when I am paid for it.", "Nobody has moved me from my seat yet. But, just in case, I've bought my own restaurants.", "[on _What Just Happened (2008)_ (qv)] This is as close as it gets to what it can be like to be in the middle of this stuff. The fear factor is always there--everything from losing tens of millions of dollars on a film that doesn't work to not being able to get a good table in a top restaurant because your last movie flopped.", "It is good to have a few other interests [restaurants, hotels, the TriBeca Film Festival]. But my main interest has always been movies--making them, directing them, being involved. I have never lost the passion for that.", "I like New York because I can still walk the streets and sit down in a bar or restaurant and observe people. If you can't properly observe, as an actor, you're finished. The impression sometimes given is that I can't leave my own home without being recognized or bothered in the street. That's just not true. I can go out, at leisure, meet people for lunch or take my kids to the park. I don't think I am glamorous enough for Hollywood.", "I have lived in Los Angeles, working in Hollywood, countless times, doing movies. I am not against the place. I was not a young actor kicking around, living by the seat of my pants, desperate for work. I went by invitation, and my experiences have been good ones. But I have never chosen to live there full-time.", "I've always done comedies. There were comic elements in _Mean Streets (1973)_ (qv) and even _Taxi Driver (1976)_ (qv). And I did _The King of Comedy (1982)_ (qv). I've always had what I consider to be a good sense of humor. There is this image that has been built up--invented, more like--and there's me, living the life. I do not consider myself some sort of acting legend, just an actor doing his best with the material that is there at the time.", "You can look into my background all you like, but I have never had problems with authority on film sets. Even if I disagree with a director, I work through it. I am also not one for regrets. I don't regret any film I've made, because there was a reason for making it at the time. If it hasn't worked out, then don't spend time worrying about why and how. Just move on to the next project.", "Difficult? Me? I don't think I am difficult compared to other people. It is hard to make a movie at the best of times, so you don't want to give people a hard time. People all have their own agendas. But it is not worth acting out something from your own history to make a point on a film set. If you have a problem with, say, your father or some other father figure, why give the director a tough time?", "[on 'Martin Scorsese' (qv)] I wish I had that knowledge of movies that he has. He's like an encyclopedia. I could call him up and ask him about a certain movie, and he would know about it. He's seen everything, it's great.", "[on the lengths he will go to disappear into a part] You don't just play a part. You've got to earn the right to play them.", "[on 'Martin Scorsese' (qv)] I really hope I get to do another movie with him again.", "[on 'Angelina Jolie' (qv) and 'Helen Mirren' (qv)] She [Jolie] is my dream co-star and I love to work with her. It depends on the project [as to who would be] at the top of my list . . . wonderful actresses.", "I always wanted to direct. Directing is a lot more of a commitment though, a lot more time. I like directors who do very few takes, they know what they want. As for me, I know when I have a shot, but I might want back up, and one other take. You never know. If it's about capturing a moment, you're never going to be able to go back and repeat it, you go with it. It's a tricky thing. I go through all the footage, and look at everything.", "Some things you learn from just being in movies, so I see what's getting done, how it's getting done. I know what making a film is going to take, how much time. I almost don't even think about it. If I'm in a movie, I can sense if something is not quite right, if the rhythm is off.", "I know it's important to give everybody as much freedom as you can so that they don't feel there are any limitations. With any mistake they could make, everything is fine. And then they're not afraid to try things or trust you when you say, \"Look, let's try and go in this direction.\" That's very important with actors--and all other creative elements.", "[on being cast in _The Deer Hunter (1978)_ (qv)] I talked with the millworkers, drank and ate with them, played pool. I tried to become as close to being a steelworker as possible, and I would have worked a shift at the mill but they wouldn't let me.", "I just can't fake acting. I know movies are an illusion, and maybe the first rule is to fake it, but not for me. I'm too curious. I want to deal with all the facts of the character, thin or fat.", "[2013, on the release of the restored version of _The King of Comedy (1982)_ (qv)] I was a big fan of the script and was very excited to do it with Marty ['Martin Scorsese' (qv)] and happy that we finally made it. The fact that it's been restored--hard to believe that so many years have passed--is even all the better, and I can't wait to see it on our closing night.", "The first time I went to Vegas, I was 17. I had a friend who was a dealer in a casino. It was real desert, still like the Wild West. Apparently, there's a nightclub scene now. Back then, you gambled and then, at 4:00 a.m., you went to the lounges to see [Frank Sinatra] sing.", "When you're directing, you think of everything . . . The few times I've directed, if someone comes up with something you missed, you're glad to hear that.", "I'm hoping that if things work out with digital technology, they can finally make us look younger and I can go on for another 40 years.", "[on the death of his _Flawless (1999)_ (qv) co-star 'Philip Seymour Hoffman' (qv)] I'm very, very saddened by the passing of Phil. He was a wonderful actor. This is one of those times where you say, \"This just shouldn't be. He was so young and gifted and had so much going, so much to live for.\" My family and I send our deepest condolences to his family.", "[on theatre] I like movies. I mean, I'd do a play if I could find a great play, a modern play, a new play. But you can do more with film. I like the illusion. In like that you can create something and do it over and then put it together like a big puzzle. With a play, the most you can do is videotape it once and then put it in the archive at the Lincoln Center. Films last. You put it on the screen and it's there forever, a little piece of history.", "[on the cast reunion for the 25th anniversary of _Goodfellas (1990)_ (qv)] We sometimes run into each other. What happens is, you see each other 10 or 15 years later, and it is as if the time has not passed. Because we got to know each other so well at an emotional or spiritual level; and it never goes away.", "[on 'Donald Trump' (qv)] I mean he's so blatantly stupid. He's a punk, he's a dog, he's a pig, he's a con, he's a mutt who doesn't know what he's talking about, he doesn't do his homework, doesn't care, thinks he's gaming his society, doesn't pay his taxes, he's an idiot. 'Colin Powell' (qv) said it best, he's a national disaster. He's an embarrassment to this country. It makes me so angry that this country has gotten to this point that this fool, this bozo, has wound up where he has. He talks how he wants to punch people in the face; well, I'd like to punch him in the face. This is somebody we want for president? I don't think so. What I care about is the direction of this country, and what I'm very, very worried about is that it might go in the wrong direction with someone like 'Donald Trump' (qv).", "[on 'Donald Trump' (qv)] I said that because he said that about somebody, that he would like to punch them in the face. How dare he say that to the crowd? How dare he say the things he does? Of course, I want to punch him in the face. It was only a symbolic thing, anyway. It wasn't like I was going to go find him and punch him in the face. But he's got to hear it. He's got to hear that, you know, that's how he makes people feel. It's not good to feel that way. It's not good to start that stuff up, but at the same time, sometimes when people are bullies like that, that's what you have to do to shut them up. Bully them back.", "[on Parkland student activists] They're the ones that feel the way we do, not the way the gun lovers and the NRA do, with all that idiocy to the point of absurdity.", "The people that I care about are those young people who demonstrated. They're the future. They know. They say, \"We'll remember in November\". They're the ones that feel the way we do, not the way the gun lovers and the NRA do, with all that idiocy to the point of absurdity.", "[on Donald J. Trump] If he was smart, he'd be even more dangerous. He's dangerous as it is. He's terrible, and a flat-out blatant racist and doubling down on that, and it's good that he does because he's going to sink himself.", "The [Donald J. Trump] administration's mean-spiritedness towards our art and entertainment is an expression of their mean-spirited attitude about people who want that art and entertainment, people who also want and deserve decent wages, a fair tax system, a safe environment, education for their children and health care for all. All of us in film--directors, actors, writers, crews, audiences--owe a debt to [Charles Chaplin], an immigrant who probably wouldn't pass today's extreme vetting. I hope we're not keeping out the next Chaplin.", "I could play somebody who's a total lunatic. I could play somebody who's a member of the NRA. It doesn't mean I subscribe to that. That's what an actor does.", "I am talking about my own country, the United States of America. We don't like to say we are a backward country so let's just say we're suffering from a case of temporary insanity.", "I can't articulate it well enough other than to say it's ridiculous. It's idiotic. This guy [President Donald J. Trump] has sullied the presidency. He's debased the presidency. It's just beyond surreal what this guy has done. He's a mutt. Every word I said then I mean today. He has not changed.", "Our government today, with the propping of the baby-in-chief [President Donald J. Trump]--the jerk-off-in-chief, I call him--has put the press under siege, ridiculing it through trying to discredit it through outrageous attacks and lies.", "Everyone knows [Charles Chaplin] was a great artist, but he made his movies to entertain. It was only later that they became art.", "Are you sure you want to do this? Do you have any idea what's happened to our world in the four years you've been here? Well, the country's going crazy. In movie terms, when you started school, the country was an inspiring uplifting drama. You're graduating into a tragic dumbass comedy . . . Work for the change. Work to stop the insanity. Start now so the class of 2018 will graduate into a better world.", "Personally, I don't like a lot of violence, believe it or not. I always feel that violence should be done in a way that it's believable, real, and justified. You'd like to think movies have some good intentions with violence, if you will, that there's a reason for it, that it's not gratuitous, but that doesn't always happen.", "I've been thinking about this a lot lately because of our government's hostility towards art. The budget proposal, among its other draconian cuts to life-saving and life-enhancing programs, eliminates the National Endowment for the Arts, the National Endowment for the Humanities and the Corporation for Public Broadcasting. For their own divisive political purposes, the [Donald J. Trump] administration suggests that the money for these all-inclusive programs goes to rich liberal elites. This is what they now call an \"alternative fact\", but I call it bullshit. I don't make movies for 'rich, liberal elites. I've got my restaurants for that. I--and all of us speaking here tonight--make them for you.", "One thing that there should be is some regulation of guns. It's crazy how almost anyone can get access to a gun. That itself is not so good.", "The movie gave us glimpses of President Nixon as delusional, narcissistic, petty, vindictive, nasty and bat shit fucking crazy. Ah, the good old days.", "[on Donald J. Trump, before receiving a standing ovation at the 2018 Tony awards] I wanna say one thing: fuck Trump, It's no longer \"Down with Trump\", it's \"fuck Trump\".", "[on Roseanne Barr] I've never seen her show before, I didn't know she was supporting [Donald J. Trump], but I have no interest in that. We're at a point with all of this where it's beyond trying to see another person's point of view. There are ways you can talk about that, but we're at a point where the things that are happening in our country are so bad and it comes from Trump. There are so many people who have left his administration. It's a serious thing. So I don't care about Roseanne. They want that thing, fine. We have real issues in this country.", "The Fourth Estate (2015) is an obvious one and a necessary film to see . . . It's about \"The New York Times\" and following the various reporters around and what they're dealing with on a daily basis. It's just important to watch that, to see how they deal with the truth, and how the truth is distorted, and to see how they're just trying to keep things in balance. It's insanity with [Donald J. Trump] and his gang. They all buy into it. The only one I think who has any kind of dignity in his whole group is [Secretary of Defense James Mattis]. The rest are all hopeless.", "America's being run by a madman [Donald J. Trump] who won't recognize the truth . . . When he doesn't like what he hears, he dismisses it by saying it's un-American and damning it as \"fake news\". But we know the truth. All thinking people do know the truth. Your job is difficult enough without being attacked by our lowlife-in-chief. That's the new name I have for him.", "Sadly, in my country, we are going through a grotesque version of nationalism ... marked by greed, xenophobia and selfishness under the banner of \"America First\".", "I used to joke that Trump would shake it up and now I give him big credit, full credit: he shook it up all right, big time, made everybody including myself much more aware of our civic duty to stand up and make our voices heard about what's happening in this country. We have a lot of problems that we have to work together to fix. It all sounds very noble and all that, but that's the truth. Let's start at home.", "I don't want to play him [Trump] ever. I always find the character's point of view and I can of course find his, but I have so little sympathy for him, for what he's done, the responsibility he's been given and just thrown away. He doesn't care. I always say every person has a story that's interesting. It's how you tell it. And of course his 'how you tell it' would be interesting, too, but I've not seen one moment of reflection from him, ever. He knows what he is and everything he says negative about people or things is really a projection of himself. I don't know how he was raised but I never thought there'd be evil people - He's not even evil. He's mundane.", "I have to be. I look at it like we're in a nightmare now and it's going to pass. I'll look back on this hopefully, if I'm still around and say, well, we knew it could happen, it will always change for the better. I have to be optimistic that we'll have people come in with the right intentions to run this country.", "You need somebody who's strong enough to outmouth him - because that's all he is, mouth - and smart enough and well-informed enough in a debate, say, to override all that nonsense that he does, because basically it's just name-calling. He has no substance. I don't know how people fall for it. He's just a big blowhard. But it ain't over till it's over as far as I'm concerned with a guy like him because he's a dirty player.", "We have to really solve the problem with the country and people who are dissatisfied and are so angry that they vote for him thinking that he'd make a difference and not seeing that he in no way will make a difference. There has to be a way for people to come together and work it out and help the people who are in pain now in certain parts of the country that I, as a New Yorker living here, am not aware of. I feel that Obama tried to, at least. He made mistakes, I'm sure, but you have to try and encompass everyone and it made us aware of this schism in the country through what's happening now.", "Yeah, I worry, and one of my kids is gay, and he worries about being treated a certain way. We talk about it.", "I mean, a mob boss calls people 'a rat'. That means you lied and somebody snitched on you, so you did commit the crime. So that's interesting and he makes mobsters look bad because there are mobsters who will shake your hand and keep their word. He can't even do that. He's a con artist. He's a huckster. He's a scam artist. And what bothers me is that people don't see that. I think that The Apprentice had a lot to do with that, which I never saw but once, maybe. It's all smoke and mirrors, it's all bullshit.", "[on 'Donald Trump' (qv)] I never had an interest in meeting him. He's a buffoon. If he walked into a restaurant that I was in, I would leave. I would not want to be there.", "I guess that's what it leads to. If he had his way, we'd wind up in a very bad state in this country. I mean, the way I understand it, they laughed at Hitler. They all look funny. Hitler looked funny, Mussolini looked funny and other dictators and despots look funny. What bothers me is that there will be people in the future who see him as an example and they'll be affected in some way, but they'll be a lot smarter and have many more colours to their personality and be more mercurial and become someone with the same values as he has but able to get much further and do more damage as a despot. That's my worry. There are people who look up to him: 'I want to be like him.' But they'll do it much better and they'll be more smart about it.", "Rupert Murdoch became a citizen of this country; look what he's contributed by this. This is what he's going to leave. This is his legacy. It's disgraceful. He's cynical, amoral, but he has a responsibility. He came here as an immigrant, technically, and look what he did. You cannot justify having Fox 'News' (qv) as a mouthpiece for the government. It's wrong. It's beyond disgusting.", "The things that Trump has done; if Obama had done one fiftieth, they'd be all over him. That's why I feel that Democrats have to be more aggressive. You've got to stand up, you can't be so gentlemanly all the time because you've just got to say: 'Sorry, I'm nice to a point, then I've got to push back.' You have to fight fire with fire. You've got to say: 'I'm sorry - let's call a spade a spade. You are who you are and we've got to confront you at your own game and that's what's needed.' You can do it in a nice way but you have to be hard and tough about it.", "Even gangsters have morals-they have ethics, they have a code, and you know, when you give somebody your word that's all you have is your word, especially in that world.", "I won't do it again because that's not the way to get things done. [But] I felt that this is something I should say because it's basic. Trump is basic. He's just a guy who just thinks he can rattle off his mouth and say anything. Well, I want to say the same thing to him: there are people who are going to say the same thing back to you, no matter who you are.", "[on 'Barack Obama' (qv)] I felt we were on a new thing. I didn't realise how against him certain people were - racially against him, offended that he was there.", "I'm older now and I'm just upset about what's going on. When you see someone like [Trump] becoming president, I thought, well, OK, let's see what he does - maybe he'll change. But he just got worse. It showed me that he is a real racist. I thought maybe as a New Yorker he understands the diversity in the city but he's as bad as I thought he was before - and much worse. It's a shame. It's a bad thing in this country.", "You can feel the history, the echo of the entertainers. In this administration, during these disturbing times of promoting racism, tonight, we reject it. No you don't, not here, not on this stage.", "[on 'Donald Trump' (qv)] That's what I said right after he was elected, 'Give him a chance.' I give everybody the benefit of the doubt. This guy has proven himself to be a total loser.", "I have no other way to say it, I guess. It's a civic duty. It's my civic obligation to play [Robert] Mueller. I'm hoping that it goes further. I don't know what'll happen, but I keep saying that, I don't know whether this is actually possible in reality, where I can handcuff him and take him away in an orange jumpsuit.", "We have a wannabe gangster in the White House now. Even gangsters have morals - they have ethics, they have a code, and you know, when you give somebody your word that's all you have is your word, especially in that world. This guy, he doesn't even know what that means.", "I have no other way to say it, I guess. It's a civic duty. It's my civic obligation to play Mueller. I'm hoping that it goes further. I don't know what'll happen, but I keep saying that, I don't know whether this is actually possible in reality, where I can handcuff him and take him away in an orange jumpsuit."], "salary history": ["_The Wedding Party (1969)_ (qv)::$50", "_Taxi Driver (1976)_ (qv)::$35,000", "_The Last Tycoon (1976)_ (qv)::$200,000 + percentage of gross", "_The Untouchables (1987)_ (qv)::$3,000,000", "_Midnight Run (1988)_ (qv)::$5,000,000", "_Stanley & Iris (1990)_ (qv)::$3,500,000", "_Sleepers (1996)_ (qv)::$6,000,000", "_Ronin (1998)_ (qv)::$14,000,000", "_Analyze This (1999)_ (qv)::$8,000,000", "_Meet the Parents (2000)_ (qv)::$13,500,000", "_The Score (2001)_ (qv)::$15,000,000", "_Showtime (2002)_ (qv)::$17,500,000", "_Analyze That (2002)_ (qv)::$20,000,000", "_Meet the Fockers (2004)_ (qv)::$20,000,000", "_Stone (2010)_ (qv)::$2,500,000", "_Little Fockers (2010)_ (qv)::$20,000,000", "Untitled 'David O. Russell' (qv) Project::$775,000 per episode"], "birth date": "1943-08-17", "birth notes": "New York City, New York, USA", "_actorID": "35", "_source": "IMDB", "actorID": "0000134", "created_utc_dt": "09/14/2019, 13:01:44"}