{"headshot": "https://m.media-amazon.com/images/M/MV5BMTg1MjQ0MDg0Nl5BMl5BanBnXkFtZTcwNjYyNjI5Mg@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Ewan Gordon McGregor", "height": "5' 9¾\" (1.77 m)", "mini biography": ["Ewan Gordon McGregor was born on March 31, 1971 in Perth, Perthshire, Scotland, to Carol Diane (Lawson) and James Charles McGregor, both teachers. His uncle is actor 'Denis Lawson' (qv). He was raised in Crieff. At age 16, he left Morrison Academy to join the Perth Repertory Theatre. His parents encouraged him to leave school and pursue his acting goals rather than be unhappy. McGregor studied drama for a year at Kirkcaldly in Fife, then enrolled at London's Guildhall School of Music and Drama for a three-year course. He studied alongside 'Daniel Craig' (qv) and 'Alistair McGowan' (qv), among others, and left right before graduating after snagging the role of Private Mick Hopper in 'Dennis Potter' (qv)'s six-part Channel 4 series _Lipstick on Your Collar (1993)_ (qv). His first notable role was that of Alex Law in _Shallow Grave (1994)_ (qv), directed by 'Danny Boyle' (qv), written by 'John Hodge' (qv) and produced by 'Andrew Macdonald' (qv). This was followed by _The Pillow Book (1996)_ (qv) and _Trainspotting (1996)_ (qv), the latter of which brought him to the public's attention.He is now one of the most critically acclaimed actors of his generation, and portrays Obi-Wan Kenobi in the first three Star Wars episodes. McGregor is married to French production designer 'Eve Mavrakis' (qv), whom he met while working on the television series _Kavanagh QC (1995)_ (qv). They married in France in the summer of 1995, and have four daughters. McGregor formed a production company, with friends 'Jonny Lee Miller' (qv), 'Sean Pertwee' (qv), 'Jude Law' (qv), 'Sadie Frost' (qv), 'Damon Bryant' (qv), 'Bradley Adams' (qv) and 'Geoff Deehan' (qv), called \"Natural Nylon\", and hoped it would make innovative films that do not conform to Hollywood standards. McGregor and Bryant left the company in 2002. He was awarded Officer of the Order of the British Empire in the 2013 Queen's New Years Honours List for his services to drama and charity.Ewan made his directorial debut with _American Pastoral (2016)_ (qv), an adaptation of 'Philip Roth' (qv)'s book, in which Ewan also starred.In 2018 McGregor won an Golden Globe for his work in the TV Series Fargo.::anonymous"], "spouse": ["'Eve Mavrakis' (qv)::(22 July 1995 - present) ( filed for divorce) ( 4 children)"], "trade mark": ["Mischievous smile", "Scottish accent", "Red hair and blue eyes", "Mole on his forehead, until he had it removed"], "trivia": ["Former roommate of 'Jude Law' (qv). They are still close friends.", "Ranked #36 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Nephew of 'Denis Lawson' (qv).", "Born at 3:45pm-CET", "He met his ex-wife, 'Eve Mavrakis' (qv), while filming for _Kavanagh QC (1995)_ (qv).", "Was originally up for the lead role in _The Beach (2000)_ (qv), which would have reunited him with director 'Danny Boyle' (qv) and screenwriter 'John Hodge' (qv) who collaborated with McGregor on _Shallow Grave (1994)_ (qv), _Trainspotting (1996)_ (qv) and _A Life Less Ordinary (1997)_ (qv). The role ultimately went to 'Leonardo DiCaprio' (qv). While McGregor blamed studio influence for the casting decision, he did not speak to either Boyle nor Hodge for years afterwards, commenting in an interview that he felt betrayed and the friendship was over. McGregor said that they bumped into each other several times during that period, which led to a very awkward moment where both he, his wife and Boyle ended up in first class on the same flight, and didn't talk to each other for the entire duration of the trip. However, McGregor and Boyle finally made amends in 2009, when McGregor presented Boyle an award for Slumdog Millionaire. Boyle has since apologized for how he treated McGregor, admitting that he mishandled the situation; McGregor has stated he has changed his opinion about the whole matter, and has moved on, now regretting all the films they did not make together.", "Originally auditioned for the role of Mercutio in the film _Romeo + Juliet (1996)_ (qv). He later got his chance to work with \"Romeo + Juliet\" director 'Baz Luhrmann' (qv) when he was cast as Christian in _Moulin Rouge! (2001)_ (qv).", "In the film _Moulin Rouge! (2001)_ (qv), McGregor sang alongside 'Nicole Kidman' (qv).", "Was presented with an honorary doctorate from the University of Ulster at a graduation ceremony in Belfast, Northern Ireland (July 5, 2001).", "His first name is pronounced \"you-an\".", "He says that he was inspired to get into show business by his uncle, actor 'Denis Lawson' (qv). Lawson played Wedge Antilles in the original Star Wars trilogy.", "Resided in North London, England with his family until 2008, when they re-located to Los Angeles.", "Slated to start filming 'Nautic' in Jamaica with 'Heath Ledger' (qv) in a couple of months. However 'Ted Demme' (qv), who was picked to direct the film died suddenly at age 38 from a heart attack while playing basketball.", "Early career dedicated almost exclusively to indie, low-budget, and non-feature films. When cast as Obi-Wan Kenobi in _Star Wars: Episode I - The Phantom Menace (1999)_ (qv), an interviewer reminded him of his \"aversion\" to major films, and he replied \"I know what I said, but, hey! This is Star Wars!\".", "Ranked #8 in the 2001 Orange Film Survey of greatest British actors.", "Born to James Charles Stuart McGregor, a physical education teacher, and his wife 'Carol McGregor' (qv), née Lawson, a teacher and school administrator, he grew up in Crieff, Scotland.", "Studied 'Alec Guinness' (qv)' films in preparation for his role as Obi-Wan Kenobi in _Star Wars: Episode I - The Phantom Menace (1999)_ (qv) and to ensure accuracy in everything from his accent to the pacing of his words.", "Father of Clara Mathilde (born February 1996) and Esther Rose (born November 7, 2001). Has a nephew (born 1999).", "Studied at the Guildhall School of Music and Drama in London for three years, graduating in 1992.", "Received the Film Actor Award for _Moulin Rouge! (2001)_ (qv) at the Variety Club Show Business 'Awards' (qv) 2002.", "Was a student in the year-long theatre arts program at Kirkcaldy College of Technology in the fall of 1988.", "In 1987, after leaving school at age 16, he worked as a stagehand at Perth Repertory Theatre and had small roles in their productions.", "His brother Colin is part of the RAF's Tornado display team who are based at RAF Lossiemouth in Scotland.", "He and his uncle, 'Denis Lawson' (qv), have worked with two of the same directors. Both have been in Star Wars films, directed by 'George Lucas' (qv). His first film, _Being Human (1994)_ (qv), was directed by 'Bill Forsyth' (qv), who also directed Lawson in _Local Hero (1983)_ (qv).", "Both he and 'Harrison Ford' (qv) have worked for director 'Ridley Scott' (qv) between Star Wars films. Ford made _Blade Runner (1982)_ (qv) after _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), but before _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv). McGregor made _Black Hawk Down (2001)_ (qv) shortly after filming _Star Wars: Episode II - Attack of the Clones (2002)_ (qv), and thus before _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv).", "Embarked on a motorcycle trip around the world along with his friend and fellow actor 'Charley Boorman' (qv) (2004).", "Was voted #9 in the Greatest Movie Stars of All Time (Channel 4).", "Completed a trip from London to New York 'The Long Way Round' by riding a motorbike east, via Europe, Mongolia, Russia, Alaska and Canada to Manhattan over 115 days in 2004.", "Was the original choice for the role of Jim in _28 Days Later... (2002)_ (qv), directed by 'Danny Boyle' (qv) who has worked with Ewan three times previously. However, due to their temporary falling out between 2000 and 2009, 'Cillian Murphy' (qv) was chosen.", "Ewan and his wife, 'Eve Mavrakis' (qv), have the same initials, even with her maiden name.", "When filming in _Star Wars: Episode I - The Phantom Menace (1999)_ (qv), he kept imitating the noise of the lightsaber during his fights. 'George Lucas' (qv) explained many times that this would be added in by the special effects people later on. Ewan said \"I keep getting carried away.\".", "Is good friends with 'Naveen Andrews' (qv), star of the television series _Lost (2004)_ (qv), from drama school.", "While he usually takes his family along with him during his movie shoots, he left them at home during the shoot of _Young Adam (2003)_ (qv).", "Was the best man at 'Dougray Scott' (qv)'s wedding in 2000.", "His Star Wars character, Obi-Wan Kenobi, goes by the call sign \"Red Leader\" in _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv). Wedge Antilles, who was played by his uncle, 'Denis Lawson' (qv), has the same call sign in _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv).", "Is very particular about his children being photographed or seen on television. He strongly believes that just because he is famous, that should not give anyone the right to invade their privacy.", "According to stunt coordinator 'Nick Gillard' (qv), he picked up the lightsaber swordfighting style very quickly. In an interview on the DVD of _Star Wars: Episode I - The Phantom Menace (1999)_ (qv), Gillard commented that Ewan was probably faster than anyone else who was working on the film, including the stunt department.", "Is a casual supporter of St. Johnstone Football Club.", "Refused to have his now-ex wife and kids visit him on the set of _Black Hawk Down (2001)_ (qv), because he felt the content was too violent and too bloody for them to see.", "Has been involved in a campaign against the closure of the maternity wing of Perth Royal Infirmary, the hospital ward where he was born.", "Distant cousin of _The Sound of Music (1965)_ (qv) actress 'Heather Menzies-Urich' (qv).", "Cousin of 'Lou Gish' (qv) and 'Kay Curram' (qv).", "Ewan, a UNICEF ambassador, adopted a 4-year-old girl from Mongolia, named Jamyan, whom he met while traveling around the world in 2004. [April 2006]", "Is near-sighted.", "Before his trip around the world with 'Charley Boorman' (qv), he had a laser eye operation to improve his eyesight, so he did not have to wear glasses or contact lenses.", "His best friend is actor 'Charley Boorman' (qv), whom he traveled around the world with on motorbikes (_Long Way Round (2004)_ (qv) trip). They met on the set of the movie _The Serpent's Kiss (1997)_ (qv).", "Considered for the role of Will Turner in _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv).", "His uncle, 'Denis Lawson' (qv), was considered for the role of Captain Antilles in _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv).", "Attended the Royal Premiere of _Moulin Rouge! (2001)_ (qv) alongside 'Kylie Minogue' (qv), 'Prince Charles' (qv) and 'Nicole Kidman' (qv). [September 2001]", "Was rumored to play James Bond in _Casino Royale (2006)_ (qv); however, in interviews he said he'd be tempted if offered, but would turn it down as he didn't want to be tied down to an open-ended series. It is unknown if he was ever under serious consideration.", "Although his motorcycles of choice include an MV Agusta F4S and a KTM Duke, McGregor and friend 'Charley Boorman' (qv) each rode a BMW 1150GS Adventure for their marathon trip around the world in _Long Way Round (2004)_ (qv).", "Befriended 'Colin Farrell' (qv) during the shooting of _Cassandra's Dream (2007)_ (qv).", "Good friends with _Black Hawk Down (2001)_ (qv) co-star 'Hugh Dancy' (qv) and Texas lead singer 'Sharleen Spiteri' (qv).", "Had two moles, one just below his right eye and one on his forehead, removed after doctors advised him to do so, because the one near his eye was cancerous (2008).", "Older brother, 'Colin McGregor' (qv), is a pilot in the Royal Air Force.", "Quit drinking alcohol in November 2000.", "He was awarded the OBE (Officer of the Order of the British Empire) in the 2013 Queen's New Year's Honours List for his services to drama and charity.", "Adopted another girl, Anouk, as an infant in 2011 (her nationality has not been made public).", "Adopted a dog on the last day of shooting _Beginners (2010)_ (qv).", "Enjoys playing chess.", "(May 12, 2007) Left John O'Groats (Scotland) with friend and actor 'Charley Boorman' (qv), marking the beginning of their 15,000 miles long southward trip on motorbike, _Long Way Down (2007)_ (qv).", "(May 22, 2011) Attended the 2011 Seattle International Film Festival for his film _Beginners (2010)_ (qv).", "First attempted to quit smoking cigarettes in November 2000, only to start again three months later. With the help of a hypnotherapist, he finally kicked the habit for good somewhere between 2008 and 2009.", "Makes an uncredited voice cameo as Obi-Wan Kenobi in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv).", "Features in the music video for English rock band Catfish and the Bottlemen's \"Hourglass\".", "Likes to play the guitar and has even written some of his own songs.", "He did his own singing for _Moulin Rouge! (2001)_ (qv).", "He was up for the male lead in _Shopping (1994)_ (qv), losing out to 'Jude Law' (qv).", "He turned down 'Christopher Eccleston' (qv)'s role in _Jude (1996)_ (qv) in favour of _Trainspotting (1996)_ (qv).", "He was considered for the role of Merton Densher in _The Wings of the Dove (1997)_ (qv) that went to 'Linus Roache' (qv).", "He turned down the lead role in _The Matrix (1999)_ (qv) due to his commitment to _Star Wars: Episode I - The Phantom Menace (1999)_ (qv).", "He turned down 'Don Cheadle' (qv)'s role in _Ocean's Eleven (2001)_ (qv) due to conflicts with _Black Hawk Down (2001)_ (qv).", "He was offered 'Marton Csokas' (qv)'s role in _xXx (2002)_ (qv).", "He was considered for 'Hugh Grant' (qv)'s role in _About a Boy (2002)_ (qv).", "He was considered for 'Jude Law' (qv)'s role in _Alfie (2004)_ (qv).", "He was the original choice to play 'Adolf Hitler' (qv) in _Hitler: The Rise of Evil (2003)_ (qv). The role went to 'Robert Carlyle' (qv).", "He was interested in starring in _American Psycho (2000)_ (qv). However, 'Christian Bale' (qv) talked him out of the part and he wound up getting it.", "He was offered 'Paddy Considine' (qv)'s role in _In America (2002)_ (qv). At the stage, the film was called \"East of Harlem\" and he was to co-star with 'Kate Winslet' (qv).", "He was offered a role in _The Boondock Saints (1999)_ (qv) and even met with writer/director 'Troy Duffy' (qv) to discuss the film. After a drinking session, they got into an argument over the death penalty and McGregor decided not to do the film.", "He was considered for 'Matt Dillon' (qv)'s role in _You, Me and Dupree (2006)_ (qv).", "He was considered to voice Bumblebee and Ratchet in _Transformers (2007)_ (qv).", "He was originally cast in 'Sam Riley' (qv)'s role in _Franklyn (2008)_ (qv), but had to withdraw when he broke his leg in a motorcycle accident.", "He was 'Neil Jordan' (qv)'s choice for Cesare Borgia in _The Borgias (2011)_ (qv) that went to 'François Arnaud' (qv).", "He as cast as King Edward VIII in _W.E. (2011)_ (qv), but dropped out due to scheduling conflicts. 'James D'Arcy' (qv) replaced him.", "He was originally attached to star as 'Edgar Allan Poe' (qv) in _The Raven (2012)_ (qv), but dropped out.", "He was considered for the role of George Carter in _The Sweeney (2012)_ (qv) that went to 'Ben Drew' (qv).", "He was originally cast as Eddie Dodson in _Electric Slide (2014)_ (qv) with 'Carey Mulligan' (qv) as his girlfriend but after years in development, both dropped out and were replaced by 'Jim Sturgess' (qv) and 'Isabel Lucas' (qv).", "He was considered for Napoleon Solo in _The Man from U.N.C.L.E. (2015)_ (qv) that went to 'Henry Cavill' (qv).", "As of 2017, he is now the only top credited actor in the Star Wars films whose character has not died while they played the role. Liam Neeson, 'Harrison Ford' (qv) and Mark Hamill all played their character's deaths, while Obi-Wan's death was instead played by 'Alec Guinness' (qv).", "He turned down 'Paul Bettany' (qv)'s role in _Transcendence (2014)_ (qv) due to scheduling conflicts.", "He was considered for the role of Scott Lang in _Ant-Man (2015)_ (qv) that went to 'Paul Rudd' (qv).", "He was considered for the lead role in _Doctor Strange (2016)_ (qv) that went to 'Benedict Cumberbatch' (qv).", "McGregor is a fan of the Fremantle Dockers in the Australian Football League.", "He took on the role of Frank Churchill in _Emma (1996)_ (qv) because he thought it would be something different from his previous role in _Trainspotting (1996)_ (qv). He wound up being somewhat embarrassed by his performance, mainly due to the wig he had to wear.", "In June 2015, McGregor read 'Hans Christian Andersen' (qv)'s \"The Little Match Girl\" for the children's fairytales app GivingTales in aid of UNICEF, together with other British celebrities, 'Roger Moore' (qv), 'Stephen Fry' (qv), 'Joan Collins' (qv), 'Joanna Lumley' (qv), 'Michael Caine' (qv), 'David Walliams' (qv), 'Charlotte Rampling' (qv) and 'Paul McKenna' (qv).", "He was due to be interviewed live on _Good Morning Britain (2014)_ (qv) about _T2 Trainspotting (2017)_ (qv) in January of 2017, but pulled out with less than an hour to go because he found out he was going to be interviewed by 'Piers Morgan' (qv), who had recently made comments criticizing \"rabid feminists\" who were protesting against 'Donald Trump' (qv).", "He was among the actors considered for the role of Dick Grayson/Robin/Nightwing in _Batman Forever (1995)_ (qv).", "He was considered for 'Matthew Modine' (qv)'s role in _If... Dog... Rabbit (1999)_ (qv).", "Lampooned by Louis CK.", "Of Clan Gregor."], "quotes": ["Actually, I really want to play Princess Leia. Stick some big pastries on my head. Now, that would be interesting.", "I'm doing my bit for the women's movement. The women have always been naked in movies and now I'm just desperate to take my clothes off as much as possible.", "I've been waiting nearly twenty years to have my own lightsaber. Nothing's cooler than being a Jedi Knight.", "Isn't 'Halle Berry' (qv) the most beautiful woman? I have a film I'd like to be in her with. I mean, I'd like to be with her in\" - At the 2002 Golden Globe 'Awards' (qv) commenting to 'Melissa Rivers' (qv) on 'Halle Berry' (qv), who just walked by.", "It's a great feeling of power to be naked in front of people. We're happy to watch actual incredible graphic violence and gore, but as soon as somebody's naked it seems like the public goes a bit bananas about the whole thing.", "I won't buy into the Hollywood thing... I want to be in good movies.", "I was with a friend of mine recently who was dying and while he was lying there with his family around his bed, I just knew that was it, that was the best you can hope for in life - to have your family and the people who love you around you at the end.", "I fight cynicism. It's too easy. It's really boring. It's much harder to be positive and see the wonder of everything. Cynicism is a bunch of people who aren't as talented as other people, knocking them because they make them feel even more untalented.", "[My fans] say, \"I've seen Star Wars and Moulin Rouge! What else should we try to see you in?\". I always tell 'em to get _The Pillow Book (1996)_ (qv). That would be a bit of an eye-opener for them, wouldn't it?", "My uncle would appear back from London, where he lived in the 70s, in sheepskin waistcoats and beads and no shoes. As an actor he had something about him that I liked and wanted to have. So that's one element: to be like my uncle, to be different.", "My brother is two years older than me and he was brilliant at everything, it seemed. He was captain of the cricket and rugby teams. We had this rather archaic system of head boys and prefects at my school. I was in my fourth year - in Scotland we finish school in our sixth year - and my brother had become head boy and brilliant at everything: academia, sports. In fact, all the things I wasn't good at. Then he left and I couldn't get my head round anything, so I became depressed and got in trouble a lot. I remember my mother driving me one night through heavy rain, with the windscreen wipers going. It was the first half term of my fifth year and she said that she'd spoken to my dad and that I could leave school if I wanted to. I'd only assumed that I'd have to stick it out until I was 18, but here I was being offered the chance to leave at 16. My whole world opened up. I couldn't believe it. And I was out, as soon as she said those words.", "It taught me a lesson which was an actor should not say, \"I won't do that.\" Once you've agreed the script, you must be willing to go as far as it needs to go on set. With some directors, you do the scene and they say that it's fine, but you think to yourself, \"Is that really enough? Is there not more?\".", "It's not my job to try and alter the director's style - he's in charge, and I'll always give him my trust. I think what happens is that you learn how to deal with it if you're not getting the support you need or if you're not being pushed. Occasionally you're doing two jobs at once: you're fooling the director into thinking you've taken his note while doing what you think is better. It hasn't happened very often, but it's an awful thing when you lose your trust in a director. But it's not for me to say.", "...as an actor there's nothing better than a great moody moment to play with nothing to say. It's so much easier to do because you can really get inside your head.", "[on playing Obi-Wan Kenobi] That was my challenge - to be a young 'Alec Guinness' (qv). People would come up and say to me, \"You sound a bit like 'Alec Guinness' (qv). Did that just happen?\" No! It's my job, you know? The thrilling bit about it was I immersed myself in 'Alec Guinness' (qv) movies, and I found this great one called _The Promoter (1952)_ (qv). God, it's a brilliant film.", "Then I watched the first episode of Star Wars over and over again. I loved it as a kid. It was a bit funny to be paid for it. I'd say to my wife, \"I've got to go and watch Star Wars again, Sorry. I just haven't quite got it...\" Brilliant.", "[on _Star Wars: Episode II - Attack of the Clones (2002)_ (qv)] Doing the second one was interesting, because I'd never had to go back to play a character again. It was three years between the two episodes. It was a bit easier because I was more used to the technical demands. In other films you rehearse, crack the scene and shoot it. In Star Wars, that's not the case. It's a very different process with an enormous amount of bluescreen work. It's very difficult - you play scenes with people who aren't there.", "Acting to mid-air is odd. There's a perverse pleasure to it when you get it right, but often you don't. Aliens are really hard. On the second one [Star Wars: Episode II] I was doing the scene with those tall ones - actually, I quite fancied the female one - and they've got actors there who will actually be providing the voices for the characters. They wore blue hard hats with cardboard cut-outs of heads taped on top of them. So you've got to remember not to talk to the people but to talk to the hats.", "[on Star Wars Episodes I and II] I love talking to kids about it, because they have great questions about how things work: \"Do you have your lightsaber with you?\".", "It's strange to explain off camera what you have done in this or that scene. How redundant, like an artist explaining his painting. As much as I like watching movies I've been in, I can't watch myself in interviews. People shouldn't know how we do it.", "I am a married man. I haven't been personally involved with all my leading ladies. It would maybe be somewhat glamorous if I had been, but I have not.", "Filmmaking is like a series of problems that need to be solved. And the excitement, the adrenaline that you get from making a small film is that you all have to pull together. You finish and you feel like you're walking away from your family. I love that.", "I've always thought as an actor, I'm not very clever about that, not very clear on it. My choices aren't about \"Okay, if I choose this film, that will let me carry on,\" you know. Whether it is a big budget movie or a small budget movie, that isn't part of my decision.", "Movies are so draining. They pull away from the actor, but theater just fills you up. I needed my fix.", "[on acting with digital characters in _Star Wars: Episode II - Attack of the Clones (2002)_ (qv)] The guy who's creating that character will create their responses off how you respond to their responses which aren't there. It's a nightmare!", "I like 'George Lucas' (qv) and 'Tim Burton' (qv) because there's no messing about. No 100 takes of me walking through a door. They know what they want and when they get it, we move on. Naming no names but, with some directors, it's take after take and take 22 is the exact same as the first one.", "[Aussie World Weekly magazine, 2002] In real life, you don't get up with the sheet after you've had sex. It's not like I'll play a carpenter and wear nothing but a tool belt while constructing a dresser. That's just not safe.", "[on researching for _Moulin Rouge! (2001)_ (qv)] I needed to go and just find out exactly what it meant to be out and having fun in a kind of hedonistic and debauched environment. That's right, something I wasn't familiar with.", "[on _Moulin Rouge! (2001)_ (qv)] Starting with a party scene for 600 cast and end up singing on top of a giant elephant... does it get any better than this?", "[on learning how to use a gun in _Black Hawk Down (2001)_ (qv)] Lying down from 50 feet, I was perfect. So I could really kill someone. Which is always good to know.", "Nicole, Knickers, as I call her. I would swear, burp and fart in front of her. I'd try and embarrass her and she would pretend to be shocked. I always played up on that. It was a real elder sister-younger brother relationship.", "[on coming home to Scotland] There is some really good crack when I come back here. This is where I learned to swear.", "[on his sex appeal] I smoke a lot. I drink far too much-I don't exercise. I torture small animals.", "An airport customs inspector once recognized me from Trainspotting and strip searched me looking for drugs.", "I'm naked a lot of the time, and they don't try to frame planted pots in front of my dick like they do in most other films. It's all part of the story, but they don't zoom in on it or anything and go, \"Cock shot!\". I've been naked in almost everything I've been in, really. I have it written into my contract.", "My dad saw my full package in _The Pillow Book (1996)_ (qv) and said \"I'm glad to see you inherited one of my major attributes.\".", "I hated _Clueless (1995)_ (qv) with a passion. I thought it would have been a really good film if someone had blown her head off at the end with a really huge gun. I mean, this rich bitch suddenly becomes charitable and then she's okay? And then there's the token black friend. It was so corrupt, so L.A., I hated it.", "I've always wanted to go to Hollywood, drive big cars and be in big movies. But I hope I won't do just any film to become a star. I just want to carry on working, acting. I don't want to direct or write. I think making films is brilliant. I get excited just going on a film set. Going on location is amazing, hanging about with all these film people doing their thing. If I bump into a star I get all starstruck.", "[Empire magazine, June 2002] He's quite the gentleman, Obi-Wan. But I don't think he'd have any problems pulling if he wanted to. You know, as a Jedi, he's not allowed to fall in love or get involved with that. So I suppose by now, he's just got really big balls.", "I started watching golf for the first time yesterday. I'm really worried about myself. I was actually enjoying it.", "[Twist magazine] My lightsaber flew out of my hands. No one tells you the sabers have about 10 'D' batteries in them. They burn your hands... I tossed the saber in the air and it ended up hitting a technician in the head.", "[on his co-star 'Hayden Christensen' (qv)] He's quite extraordinary with his moves and spins. I think he was a baton girl in a past life.", "[on an experience during the filming of _A Life Less Ordinary (1997)_ (qv) in Utah] I've got a black woolen hat and it's got Pervert written across the front of it. It's the name of the clothing label. And I was with my wife and my baby at the supermarket and I didn't think. I just put my hat on Clara's head, because it was cold. And the looks. I couldn't figure out why I was getting death looks. And then I realized my 10-month old baby's wearing a hat with the word Pervert written on it and these people were like, \"There's Satan! There's Satan out with his kid!\". And then I made a point of her wearing it every time we went there.", "People are incredibly rude about it sometimes. Like \"What? You're married?\" Strange reaction to have. Proves what people's ideas about marriage are. \"We're having a baby.\" \"What?\" As if it's the end of the world. Of course, it's the start of a brilliant world.", "From _Velvet Goldmine (1998)_ (qv), I got fond of wearing nail polish and eye makeup. I used to wear it quite a lot. We all wear makeup when we go to events - men and women alike. I've also had some good makeup artists, and I like to let them have a good time. I don't think we should pretend we're not wearing makeup when we are. I quite like the look of it.", "When I played Obi-Wan Kenobi in the Star Wars prequels, I had to transform myself into a young 'Alec Guinness' (qv). I watched his early work to see what he was like on screen. It is interesting how he is only remembered by people younger than myself for appearing in Star Wars. He played a wealth of characters in lots of films - it was like he was the British film industry.", "[on his decision to quit cigarettes and alcohol] I wasn't someone who could smoke or drink in moderation, and I recognized that those things would kill me. I started visualizing the doctor telling me that I had cancer from smoking or that I was extremely ill because of how much I'd been drinking. What kind of regret would I have if I had to tell my children or my wife that I was dying because of something I could have done something about? I didn't want to be that kind of man.", "In your 20s, you spend a lot of time being self-conscious about what other people think of you. Then you hit your mid-30s and start to realize they weren't really thinking about you that much.", "[on rejecting the idea of a _Trainspotting (1996)_ (qv) sequel] I wouldn't want to damage _Trainspotting (1996)_ (qv)'s reputation, because it was an amazing film and a very important film of its time, a very important film for me and... a very important film for British cinema. I wouldn't want to leave people remembering a poor sequel rather than leaving its reputation where it sits at the moment, which is kind of a phenomenal film.", "There was talk that Disney fended off the release [of _I Love You Phillip Morris (2009)_ (qv)] until after _A Christmas Carol (2009)_ (qv) came out. They didn't want kids thinking ['Jim Carrey' (qv)'s] Ebenezer Scrooge was a bender.", "[on _I Love You Phillip Morris (2009)_ (qv)] I'm very keen that it's a gay movie. There was quite a lot of talk at Sundance (in 2009) that \"Well, it's not a gay movie. It's a film about guys who happen to be gay.\" And I was thinking, it's nothing but a gay movie. It's about a gay couple, about a man's sexuality, and he comes out. It's not the point of the film, but let's not pretend it's not a gay film.", "I like kissing boys on screen. As a straight guy, it's quite an interesting proposition. Anything on a film set that takes you by surprise like that, that gets your blood up, is good.", "I'm always interested in playing different people, in different situations. It doesn't matter to me whether someone is in love with a man or a woman. I find the idea of love and romance interesting. I'm a sucker for it. I like playing someone who's falling in love because I like the sensation of it. People do extraordinary things when they're falling in love.", "I go on my gut instincts. Occasionally, the thought of working for a director pricks up my ears, or being alongside an actor gets me interested, But if the story can't live in my head when I read the script, I feel I can't be bothered to live with it on set.", "... There's many different factors in films. The script, I always believe, is the foundation of everything. And if you don't connect to that foundation, if you don't believe in that and feel that you wanna spend three, four months of your life exploring it, then all of the other elements are secondary. But if you've got a great foundation in the script, and you like the story... Sometimes it's the story, sometimes it's the atmosphere in the script, the world that you're gonna create. There's many different things that hook you in, and then, on top of that, you have who's directing, who are the other actors, who's lighting-those creative elements that come in. Everyone's tied to the script. I think the script is the key. Regardless of how great everybody else is working on a film, if you're working on a script that you don't think is great, you're not gonna be able to make a great film. Whereas if the script is great, then you can.", "[on quitting drinking] I would soon have gotten a reputation for being a drunk actor and therefore would not get any work, so I really felt it was time to give it up. But I remember doing interviews, drinking and smoking, just saying, \"I am never, ever going to fucking stop!\" And I said it with real pride, you know? 'Cos I wanted to be the best drinker as well as everything else and that's a really bad slippery slope. So it's much easier now and my work's much better. I find that life in general's much more fun without it. My wife's delighted that I stopped, because I'm much more present in our marriage and I'm a much better father. I remember, funnily enough, the last time I had a drink. I was sitting with these guys and we're all talking about how much we love our kids and I thought, \"Well, why are we all sitting in a pub? It's four in the morning. How much do we love our kids? Because tomorrow morning none of us will be any use to them.\" And I thought, \"Fuck it.\" I don't have a problem with people drinking; it's something I chose not to do. It just took me a long time to grow up.", "[on _The Impossible (2012)_ (qv)] When the script first came to me, I wasn't sure about the idea. Would it be a disaster movie that was somehow spectacular? That would be so wrong. But as I read it, I got caught up in Maria's sense of courage. She seemed like a proper hero. Then I spoke to her and she said, no, that's not what it was about - it was all down to luck. She was really emphatic about that. She said, \"If anything I did was heroic, what would that mean for the others who weren't so lucky?\".", "The Thai perspective on the tsunami I thought was quite a healthy one. They're very straightforward and honest about it, and very much in the present in terms of moving forward.", "[on whether he has remained friends with director 'Danny Boyle' (qv) after getting dropped from _The Beach (2000)_ (qv) for 'Leonardo DiCaprio' (qv)] No, you just don't treat your friends like that. They absolutely made me think that I was playing the character in The Beach and we talked about dates and moving dates and so on, and all the while they were keeping me there just in case Leonardo pulled out - which is really nasty. And then afterwards, I just didn't hear from Danny for years.", "Pay attention: I recognize it can be boring to play with young children - to tell a story over and over again, let's say - but the secret is being there. If you've made a decision to play with your children, then play with them. Don't be looking through papers on your desk or sneaking off to the computer. Turn off your BlackBerry. Lose yourself in their world. Even if you do it for a short time, it will mean a lot to you and to them.", "[About his falling out and reconciliation with former friend and director 'Danny Boyle' (qv)]: I just think I've changed my opinion about it. We've all moved on and there's a lot of water under the bridge.", "You know how swimming naked is such a lovely feeling? Well, being naked on set is kind of a bit like that.", "I'm not a religious person... I'm married to a Jewish woman, so my children are Jewish and my involvement in religion has more to do with the Jewish faith now and not the Christian faith, which I was very vaguely brought up in... My parents were not religious, but my school had prayers at morning assembly... So my early understanding of religion was the Protestant faith in Scotland. But my experience is no longer that.", "[on the sometimes questionable food he and 'Charley Boorman' (qv) encountered on their _Long Way Round (2004)_ (qv) and _Long Way Down (2007)_ (qv) motorcycle adventures] Usually, it was something like beans and paste with chunks of bread, but occasionally you'd just have to close your eyes, hold your nose, and hope for the best. The only time we ever got sick was when we ate at hotels. That stuff just sits around in its own botulism.", "[After a fan asks him what advice would give for a young Jedi in training] Don't be ridiculous!", "(On _Emma (1996)_ (qv)) \"My decision-making was wrong. It's the only time I've done that. And I learnt from it, you know. So I'm glad of that - because it was early on and I learnt my lesson. It's a good film, _Emma (1996)_ (qv), but I'm just... not very good in it. I'm not helped because I'm also wearing the world's worst wig. It's quite a laugh, checking that wig out.\"", "(on playing two characters in _Fargo (2014)_ (qv)) I'm very experienced with playing with myself", "[on the possibility of a Obi-Wan Kenobi spin off film] There's no official offer, and I haven't met them about it or anything. But I've always said that I'd be happy to do it if they wanted to do it. It would be a good segue between the last episode of the prequels and the new episodes. I think they've got films to make until the 2020s, so I don't think it's going to happen soon if it happens at all.", "Me and 'Colin Farrell' (qv) lovers? Yes. You heard it here first. Friends, lovers, all of those things. ['Colin Farrell' (qv): We're lovers, but only physically. No movies, no dinners, or long meaningful conversations caring about how the other person is doing in their lives. We just like to make love every now and then. Once a year is going to be the deal, like Woody Allen makes his films. We're going to make love once a year. He does look well, doesn't he? Very dapper. It's the accent as well that gets me.] We plan to hang out together tonight. I'm going to watch a film with people who like to watch films. Then Colin and I are going to go crazy!", "[Entertainment Weekly, June 1997] When I met with agents in L.A., they would tell me you had to do two movies for yourself and then two for the business. And I thought, 'Fuck off. No, you don't. You do every film because you want to do good work. Because you're interested in making good movies and working with good people.' To do a crappy event movie for a lot of money, like _Independence Day (1996)_ (qv) - I would never taint my soul with that crap."], "birth date": "1971-03-31", "birth notes": "Perth, Perthshire, Scotland, UK", "_actorID": "54", "_source": "IMDB", "actorID": "0000191", "created_utc_dt": "09/14/2019, 13:02:02"}