{"headshot": "https://m.media-amazon.com/images/M/MV5BMTc3NzU0ODczMF5BMl5BanBnXkFtZTcwODEyMDY5Mg@@._V1_UY98_CR3,0,67,98_AL_.jpg", "birth name": "Dustin Lee Hoffman", "height": "5' 5¾\" (1.67 m)", "mini biography": ["Dustin Lee Hoffman was born in Los Angeles, California, to Lillian (Gold) and 'Harry Hoffman' (qv), who was a furniture salesman and prop supervisor for Columbia Pictures. He was raised in a Jewish family (from Ukraine, Russia-Poland, and Romania). Hoffman graduated from Los Angeles High School in 1955, and went to Santa Monica City College, where he dropped out after a year due to bad grades. But before he did, he took an acting course because he was told that \"nobody flunks acting.\" Also received some training at Los Angeles Conservatory of Music. Decided to go into acting because he did not want to work or go into the service. Trained at The Pasadena Playhouse for two years.::Taesu Byun"], "spouse": ["'Lisa Gottsegen' (qv)::(12 October 1980 - present) ( 4 children)", "'Anne Byrne Hoffman' (qv)::(4 May 1969 - 6 October 1980) ( divorced) ( 2 children)"], "trade mark": ["He is famous for taking a wide range of difficult roles, such as a crippled street hustler in _Midnight Cowboy (1969)_ (qv); an actor pretending to be a woman in _Tootsie (1982)_ (qv), an autistic person in _Rain Man (1988)_ (qv) and a Captain Pirate in _Hook (1991)_ (qv).", "He has a reputation for being difficult to work with due to his perfectionist approach", "His deep nasal voice, which has a unique \"honking\" timbre"], "trivia": ["He was considered for the role of Michael Corleone in _The Godfather (1972)_ (qv).", "During the filming of _Wag the Dog (1997)_ (qv) Hoffman, his co-star 'Robert De Niro' (qv) and director 'Barry Levinson' (qv) had an impromptu meeting with President 'Bill Clinton' (qv) at a Washington hotel. \"So what's this movie about?\" Clinton asked De Niro. De Niro looked over to Levinson, hoping he would answer the question. Levinson, in turn, looked over to Hoffman. Hoffman, realizing there was no one else to pass the buck to, is quoted as saying, \"So I just started to tap dance. I can't even remember what I said.\"", "In October 1997, he was ranked #41 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list.", "His parents named him Dustin after actor 'Dustin Farnum' (qv).", "In January 1999, he was awarded $3m in damages and compensation in a case against \"Los Angeles\" Magazine, because it had printed a digitally altered image of him in a dress (cf. _Tootsie (1982)_ (qv)). In July 2001 a federal appeals court overturned the verdict. The U.S. 9th Circuit Court of Appeals found that because the photo appeared in an article, not an advertisement, the use of the actor's likeness did not constitute \"commercial speech\" and was entitled to the full protection of the 1st Amendment.", "He is the brother-in-law of producer 'Lee Gottsegen' (qv).", "He was sought for the role of Rick Deckard in _Blade Runner (1982)_ (qv) for several months but he saw the film very differently from the producers. The role eventually went to 'Harrison Ford' (qv) after they were impressed by excerpts of his performance in _Raiders of the Lost Ark (1981)_ (qv).", "He has known 'Gene Hackman' (qv) since 1956 when they met at the Pasadena Playhouse.", "He has a house in the Kensington area of London.", "On Friday, March 6th, 1970, he and wife 'Anne Byrne Hoffman' (qv) were living in a brownstone on 11th St. in New York City's Greenwich Village when the house next door blew up. Fortunately, he and his family weren't home. Members of the radical 1960's domestic terror group, that called themselves \"The Weathermen\" were living in that house unknown to anyone and had stored a large cache of explosives that accidentally detonated, killing three of the group's members. 'Henry Fonda' (qv)'s ex-wife, 'Susan Blanchard' (qv), was also a neighbor in that block and witnessed the explosion, as it occurred.", "He was a neighbor of 'Mel Brooks' (qv) in New York and was set to play the role of Franz Liebkind in Brooks' first film, _The Producers (1967)_ (qv). Just before production was to commence, Hoffman was offered the role of Ben Braddock in _The Graduate (1967)_ (qv), co-starring Brooks' wife 'Anne Bancroft' (qv), and asked to be let out of his contract. The role of Liebkind eventually went to 'Kenneth Mars' (qv).", "He met actor 'Gene Hackman' (qv) in their first month at Pasadena Playhouse and had several classes with him. Hackman failed out after three months and moved to New York to try his luck as a stage actor.", "After attending the Pasadena Playhouse, Hoffman decided to move to New York and looked up former Playhouse classmate 'Gene Hackman' (qv). The two of them roomed together in New York at Hackman's one-bedroom apartment on 2nd Ave. and 26th St. Hoffman slept on the kitchen floor. Originally Hackman had offered to let him stay a few nights, but Hoffman would not leave. Hackman had to take him out to look for his own apartment. Eventually Hackman persuaded Hoffman to room with their mutual friend 'Robert Duvall' (qv), and soon the two nascent actors were sharing an $80-a-month apartment on W. 109th St.in Manhattan's Upper West Side.", "Eventually Hackman persuaded Hoffman to room with their mutual friend 'Robert Duvall' (qv), and soon the two nascent actors were sharing an $80-a-month apartment on W. 109th St.in Manhattan's Upper West Side.", "As roommates, Hoffman and 'Gene Hackman' (qv) would often go to the apartment rooftop and play the drums. Hoffman played the bongo drums while Hackman played the conga drums. They did it out of their love for 'Marlon Brando' (qv), who they had heard played music in clubs. They wanted to be like Brando and were big fans of his.", "He entered into The Guinness Book of World Records as \"Greatest Age Span Portrayed By A Movie Actor\" for _Little Big Man (1970)_ (qv) in which he portrayed a character from age 17 to age 121.", "Despite being old friends and roommates with 'Gene Hackman' (qv) back in the 1960s, it was literally decades before he appeared on screen with him. He finally starred with Hackman in _Runaway Jury (2003)_ (qv).", "He was voted the 28th Greatest Movie Star of all time by Entertainment Weekly.", "He was interested in playing Shylock in 'Michael Radford' (qv)'s adaptation of 'William Shakespeare' (qv)'s \"Merchant of Venice\": _The Merchant of Venice (2004)_ (qv). However, by the time he contacted Radford, 'Al Pacino' (qv) had already been cast for the role.", "While filming _Finding Neverland (2004)_ (qv), he lost the tip of a finger and performed one day of shooting on morphine.", "He has appeared in two films about \"Peter Pan\" (_Hook (1991)_ (qv) and _Finding Neverland (2004)_ (qv)). Following his appearance in _Hook (1991)_ (qv), close friend and former roommate 'Gene Hackman' (qv) began calling him \"Hook\" as a joke. The name stuck and his contemporaries call him by that nickname to this day.", "Both he and 'Robert Duvall' (qv) said one of the best reasons why they went to acting classes were the girls. When they were young, the classes were a gold mine to them.", "In April 2005, he was a recipient of a Lincoln Center tribute.", "He had expressed an early desire to play the title role in _Gandhi (1982)_ (qv), but was offered _Tootsie (1982)_ (qv) the same year and ended up taking the latter role. He eventually lost the Oscar that year to 'Ben Kingsley' (qv) who played Gandhi.", "In 1993 he, together with 'Anne Bancroft' (qv), accepted the Oscar for \"Best Writing, Screenplay Based on Material from Another Medium\", on behalf of 'Ruth Prawer Jhabvala' (qv), who wasn't present at the awards ceremony.", "He played 20 years younger than 'Anne Bancroft' (qv) in _The Graduate (1967)_ (qv), even though she is only six years older than him.", "His father, 'Harry Hoffman' (qv), was born in Massachusetts, to Ukrainian Jewish parents: Esther (Schiskoski) and Frank Hoffman, from Bila Tserkva. His mother, Lillian (Gold), was born in Chicago, Illinois, to Louis Isadore Gold, a Jewish immigrant from Warsaw, Poland; and Celia Epstein, a Romanian Jewish immigrant from Iasi. In the Russian Empire, the Hoffman family's surname was spelled \"Goikhman\".", "He was considered for the role of Beau Burruoghs in _Rumor Has It... (2005)_ (qv). The part was eventually played by 'Kevin Costner' (qv). Beau Burruoghs was meant to be a real-life version of Hoffman's Benjamin Braddock in _The Graduate (1967)_ (qv), set 38 years after the film's release.", "Oscar-winning director 'John Schlesinger' (qv) envisioned a cast of 'Al Pacino' (qv), 'Julie Christie' (qv) and 'Laurence Olivier' (qv) for _Marathon Man (1976)_ (qv). Pacino has said that the only actress he had ever wanted to work with was Christie, who he claimed was \"the most poetic of actresses.\" Producer 'Robert Evans' (qv), who disparaged the vertically challenged Pacino as \"The Midget\" when 'Francis Ford Coppola' (qv) wanted him for _The Godfather (1972)_ (qv) and had thought of firing him during the early shooting of the now-classic film, vetoed Pacino for the lead. Instead, Evans insisted on the casting of the even-shorter 'Dustin Hoffman' (qv)! On her part, Christie -- who was notoriously finicky about accepting parts, even in prestigious, sure-fire material -- turned down the female lead, which was then taken by 'Marthe Keller' (qv) (who, ironically, became Pacino's lover after co-starring with him in _Bobby Deerfield (1977)_ (qv)). Of his dream cast, Schlesinger only got Olivier, who was nominated for a Best Supporting Actor Oscar.", "His performance as \"Ratso\" Rizzo in _Midnight Cowboy (1969)_ (qv) is ranked #7 on Premiere Magazine's 100 Greatest Performances of All Time (2006).", "His performance as Michael Dorsey/Dorothy Michaels in _Tootsie (1982)_ (qv) is ranked #33 on Premiere Magazine's 100 Greatest Performances of All Time (2006).", "His performance as Raymond Babbitt in _Rain Man (1988)_ (qv) is ranked #88 on Premiere Magazine's 100 Greatest Movie Characters of All Time. Hoffman says he infused his portrayal with aspects of the personality of a patient he had known from the days when he worked as a nurse's aide in a New York City psychiatric facility.", "His performance as Michael Dorsey/Dorothy Michaels in _Tootsie (1982)_ (qv) is ranked #39 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "His performance as \"Ratso\" Rizzo in _Midnight Cowboy (1969)_ (qv) is ranked #33 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "Two of his films are on the American Film Institute's 100 Most Inspiring Movies of All Time. They are _Rain Man (1988)_ (qv) at #63 and _All the President's Men (1976)_ (qv) at #34.", "While having dinner with 'Paul McCartney' (qv), 'Dustin Hoffman' (qv) told the story of the death of 'Pablo Picasso' (qv) and his famous last words, \"Drink to me, drink to my health. You know I can't drink anymore.\" Paul had a guitar with him and immediately played an impromptu chord progression while singing the quote. Thus, \"Picasso's Last Words\", one of the highlights of the \"Band On The Run\" album, was made.", "He is active in a commercial campaign with the Swedish clothing company KappAhl.", "On an episode of _The Tonight Show with Jay Leno (1992)_ (qv), 'Dustin Hoffman' (qv) said that his cameo in the film _The Holiday (2006)_ (qv) was not scripted and unplanned. He was driving by the Blockbuster shown in the film and saw all of the cameras and equipment so he decided to stop in and see what was happening. Because he knew director 'Nancy Meyers' (qv), they worked up a scene which ultimately made the final cut.", "He was Warner Brothers' first consideration for \"The Penguin\" in _Batman Returns (1992)_ (qv).", "He was an L.A. high school classmate of 'Johnnie L. Cochran Jr.' (qv).", "He was in talks to appear in _The Verdict (1982)_ (qv).", "He has six children: 'Jenna Byrne' (qv) and Karina Hoffman-Birkhead (born 1966 - adopted) with his first wife 'Anne Byrne Hoffman' (qv); 'Jake Hoffman' (qv), 'Rebecca Hoffman' (qv), 'Max Hoffman' (qv) and 'Alexandra Hoffman' (qv) with his second wife 'Lisa Gottsegen' (qv).", "He is one of the main supporters and contributors to the Santa Monica College Madison Theatre in Santa Monica, CA.", "The only actor in history to have top billing in three films that won the Best Picture Oscar: _Midnight Cowboy (1969)_ (qv), _Kramer vs. Kramer (1979)_ (qv) and _Rain Man (1988)_ (qv).", "The bathroom scene in _Runaway Jury (2003)_ (qv), where Roar confronts Finch is the first ever dialog in a movie between him and 'Gene Hackman' (qv). It was added when someone on the crew found out that the two, though they had been friends for 50 years, had never starred in a movie together.", "As of 2008, he and 'Philip Seymour Hoffman' (qv) are the only two winners of best actor in a leading role at the Oscars to share a last name. Philip won for _Capote (2005)_ (qv) and Dustin won for _Kramer vs. Kramer (1979)_ (qv) and _Rain Man (1988)_ (qv).", "He was considered for the role of Mario Mario in _Super Mario Bros. (1993)_ (qv).", "He did a brief stint while he was a struggling actor working at the toys' department at Macy's. As a joke, he set 'Gene Hackman' (qv)'s toddler son up on a display and tried to pass him off as a large doll, until a woman offered to buy him.", "He was nominated for the 1990 Tony Award (New York City) for Actor in a Drama for \"The Merchant of Venice\".", "He is close friends with: 'Warren Beatty' (qv), 'Robert De Niro' (qv), 'Gene Hackman' (qv), 'Spike Lee' (qv), 'Katharine Ross' (qv), 'David Thewlis' (qv), 'Jack Nicholson' (qv), 'Maggie Smith' (qv), 'Robert Duvall' (qv), 'Ulu Grosbard' (qv), 'Barbra Streisand' (qv), 'Billy Connolly' (qv), 'Judi Dench' (qv), 'Jason Bateman' (qv) 'Jon Voight' (qv), and 'Polly Holliday' (qv).", "He played Tiny Tim in a middle school production. On a bet, he changed the ending line from \"God bless everyone!\" to \"God bless everyone, goddamn it!\" on performing night and was subsequently suspended.", "Both Hoffman and his former roommate, 'Gene Hackman' (qv), had their big breaks in 1967. Hoffman in _The Graduate (1967)_ (qv) and Hackman in _Bonnie and Clyde (1967)_ (qv).", "One of four multiple acting Oscar winners whose wins are all in Best Picture Oscar winners (the others being 'Marlon Brando' (qv), 'Gene Hackman' (qv) and 'Mahershala Ali' (qv)), with his and Brando's being both for in the lead category. Two of 'Jack Nicholson' (qv)'s three acting Oscars are in Best Picture winners.", "He stars in four of the American Film Institute's 100 Greatest Movies: _The Graduate (1967)_ (qv) at #17, _Midnight Cowboy (1969)_ (qv) at #43, _Tootsie (1982)_ (qv) at #69 and _All the President's Men (1976)_ (qv) at #77.", "He is only seven years younger than 'Sean Connery' (qv), who played his father in _Family Business (1989)_ (qv).", "On April 27, 2010, 'Dustin Hoffman' (qv) helped to save the life of Sam Dempster, 27, a lawyer who suffered a cardiac arrest and collapsed while jogging in Hyde Park in London, England. Hoffman, who owned a house in London, was taking a morning walk when he saw Dempster fall and land on his face. The actor waited with Dempster until ambulances came to the scene and resuscitated him.", "He was a recipient of the 2012 Kennedy Center Honors. Other recipient that year were 'Buddy Guy' (qv), 'David Letterman' (qv), 'Natalia Makarova' (qv), and the rock band 'Led Zeppelin' (qv), comprising 'John Paul Jones' (qv), 'Jimmy Page' (qv), and 'Robert Plant' (qv).", "He once bought an old house in London and had asked Robin Moore-Ede, the designer 'Freddie Mercury' (qv) hired to design his Garden Lodge mansion, if he could show him some work he had done. Rather than show drawings, Robin asked Freddie if Dustin could see Garden Lodge. Freddie readily agreed and acted as the tour guide, pointing out all the details for a few hours.", "His public relations agent is 'Jodi Gottlieb' (qv).", "In October 2006, he was active in a commercial campaign for the Swedish cloth-company KappAhl.", "As of 2014, has appeared in eight films that were nominated for the Best Picture Oscar: _The Graduate (1967)_ (qv), _Midnight Cowboy (1969)_ (qv), _Lenny (1974)_ (qv), _All the President's Men (1976)_ (qv) _Kramer vs. Kramer (1979)_ (qv), _Tootsie (1982)_ (qv), _Rain Man (1988)_ (qv) and _Finding Neverland (2004)_ (qv). Three of them won the award in the category: _Midnight Cowboy (1969)_ (qv), _Kramer vs. Kramer (1979)_ (qv), and _Rain Man (1988)_ (qv). 'Dustin Hoffman' (qv) was at least nominated for Best Actor in all of these films except All the President's Men and Finding Neverland.", "On the VHS release of _Rain Man (1988)_ (qv) there was a short documentary segment before the film, narrated by Hoffman, about the seriousness of the issue of Autism.", "He appeared in three Best Picture Academy Award winners: _Midnight Cowboy (1969)_ (qv), _Kramer vs. Kramer (1979)_ (qv) and _Rain Man (1988)_ (qv).", "He was originally set to play the title role in _Popeye (1980)_ (qv), opposite 'Lily Tomlin' (qv) as Olive Oyl. 'Robin Williams' (qv) eventually played the role opposite 'Shelley Duvall' (qv).", "He played a character whose grandson was played by his son in real life 'Jake Hoffman' (qv) both in _Barney's Version (2010)_ (qv) and _Luck (2011)_ (qv).", "He was treated for skin cancer in 2013.", "He has worked with 9 directors who have won a Best Director Oscar: 'Mike Nichols' (qv), 'John Schlesinger' (qv), 'Franklin J. Schaffner' (qv), 'Bob Fosse' (qv), 'Robert Benton' (qv), 'Sydney Pollack' (qv), 'Barry Levinson' (qv), 'Warren Beatty' (qv), and 'Steven Spielberg' (qv).", "He was considered for 'Woody Allen' (qv)'s roles in _Play It Again, Sam (1972)_ (qv), _The Front (1976)_ (qv), _Hannah and Her Sisters (1986)_ (qv) and _Deconstructing Harry (1997)_ (qv).", "In 2009 he received the freedom of the Italian city Ascoli Piceno for being there during 1972 to shoot the movie _Alfredo, Alfredo (1972)_ (qv) by 'Pietro Germi' (qv), where he played the role of Alfredo Sbisà.", "He turned down the role of Lex Luthor in _Superman (1978)_ (qv). The part went to his longtime friend 'Gene Hackman' (qv).", "He received Kennedy Center Honors in 2012, with the following commendation: \"'Dustin Hoffman' (qv)'s unyielding commitment to the wide variety of roles he plays has made him one of the most versatile and iconoclastic actors of this or any other generation\".", "In 1997 he was one of a number of Hollywood stars and executives to sign an open letter to then-German chancellor 'Helmut Kohl' (qv) protesting the treatment of Scientologists in Germany, which was published as a newspaper advertisement in the International Herald Tribune.", "He has appeared in five films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _The Graduate (1967)_ (qv), _Midnight Cowboy (1969)_ (qv), _Little Big Man (1970)_ (qv), _All the President's Men (1976)_ (qv) and _Tootsie (1982)_ (qv).", "On August 25, 2019, he was honored with a day of his film work during the Turner Classic Movies Summer Under the Stars.", "Since being cleared of spurious charges in the #MeToo witch-hunt, Hoffman's career has resumed. He will star in the forthcoming \"Into The Labyrinth,\" to be released in 2019."], "quotes": ["We all believe what we read. I read how 'Tom Cruise' (qv) and I were two big egos holding up shooting. I know that isn't true - but if I wasn't making a movie with him and I just picked up the paper, I'd believe it. That's interesting, isn't it?", "I got into acting so that I could meet girls. Pretty girls came later. First, I wanted to start off with someone with two legs, who'd smile at me and look soft.", "I lived below the official American poverty line until I was 31.", "If a lot of dogs are on the beach, the first thing they do is smell each other's ass. The information that's gotten somehow makes pacifists out of all of them. I've thought, 'If only we smelled each other's asses, there wouldn't be any war.'", "You go to the cinema and you realize you're watching the third act. There is no first or second act. There is this massive film-making where you spend this incredible amount of money and play right to the demographic. You can tell how much money the film is going to make by how it does on the first weekend. The whole culture is in the crap house. It's not just true in the movies, it's also true in the theater.", "Stardom equals freedom. It's the only equation that matters.", "I grew up thinking a movie star had to be like 'Rock Hudson' (qv) or 'Tab Hunter' (qv), certainly nobody in any way like me.", "God knows I've done enough crap in my life to grow a few flowers.", "A good review from the critics is just another stay of execution.", "[on the administration of President 'George Bush' (qv) and its invasion of Iraq] \"For me as an American, the most painful aspect of this is that I believe that [this] administration has taken the events of 9/11 and has manipulated the grief of the country and I think that's reprehensible. I don't think, like many of us, that the reasons we have been given for going to war are the honest reasons. If they are saying it's about the fact they have biological weapons and might have nuclear weapons and that gives us the liberty to pre-empt and strike because we think they might hit us, then what prevents Pakistan from attacking India, what prevents India from attacking Pakistan, what prevents us from going into North Korea? I believe--though I may wrong because I am no expert--that this war is about what most wars are about: hegemony, money, power and oil.\"", "One thing about being successful is that I stopped being afraid of dying. Once you're a star you're dead already. You're embalmed.", "[About his new film _Stranger Than Fiction (2006)_ (qv)] \"I'm really proud of it, and I've only said that about three times during my career.\"", "[About acting] \"You get caught off-guard during a take. Your mind goes wild and it just comes out 'Waaa, you talking to me!' \"", "I'm sixty-eight, I cry every chance I can.", "Euthanasia is legal in Hollywood. They just kill the film if it doesn't succeed immediately.", "I don't like the fact that I have to get older so fast, but I like the fact that I'm aging so well.", "[in 2005] \"I became an actor because I believed I was a failure. In acting, because so few of us ever get work, I could feel proud and fail with dignity. I was born into what I now know was a dysfunctional family. I found that out in therapy three weeks ago.\"", "[on he and 'Gene Hackman' (qv) as young stage actors and roommates in New York]: Psychologically, Gene/myself, we did not think about making it in the terms that people think about. We fully expected to be failures for our entire life. Meaning that we would always be scrambling to get a part. We were actors. We had no pretensions. There was more dignity in being unsuccessful.", "[on working with 'Meryl Streep' (qv) in _Kramer vs. Kramer (1979)_ (qv)] She's an ox when it comes to acting. She eats words for breakfast. Working with her is like playing tennis with Chris Evert -- she keeps trying to hit the perfect ball.", "[on 'Mike Nichols' (qv)] He makes you feel kind of like a kite. He lets you go ahead and you do your thing. And then when you're finished he pulls you in by the string. But at least you've had the enjoyment of the wind.", "[2004 quote] I once met 'Clint Eastwood' (qv), and it was remarkable. I studied him as I spoke to him. I looked down, and his pants were a little short -- they showed a bit too much of his socks. There was something so timid and shy and almost gawky about him in real life. I remember thinking to myself, Someone should have cast him in _Meet John Doe (1941)_ (qv), the Frank Capra movie, because that's the real him. There's not a wisp of aggression about him. That's the real essence, not the guy who says, \"Make my day.\"", "The truth is, the older you get, the less variety of parts you are offered. If you're a star and you've spent most of your career being able to take your pick of the litter, you notice when the offers start to diminish. You're too old to play leads, so you're offered the supporting role - but many stars don't want to make that transition. They see it as a sign of symbolic impotence. And that the audience will no longer regard them as a star. I love acting, and I'm not going to determine what I do based on what I fear other people might think. I do what I want to do.", "I wanted to be a jazz pianist, but I wasn't good enough. I got into city college because I didn't have the grades to get into university. I took acting because it was a way to get three credits. I just needed three credits and my friend told me to take acting because it was like gym - nobody fails you. I took it and that's literally how I got involved in acting.", "On filming _Kramer vs. Kramer (1979)_ (qv): What makes divorce happen is that you can't be in the same space any more, for whatever reason - but the love stays. And that's the killer. That's where the vehemence and anger and rage comes from.", "I know it's written that I'm difficult. 'Barry Levinson' (qv) - who I did four films with - told me that every press person comes up to him and asks, 'How do you work with that guy?' and he says, 'I've done nothing but extol what a privilege and fun it's been.' But not one interviewer has ever printed that. Look, the medical metaphor I use is, it's like you're on a table for brain surgery and you're being wheeled in and the guy leans in and says, 'Hi I'm your brain surgeon and don't worry - I'm not difficult, I'm not a perfectionist.' I am no different from the focus puller - you're either sharp or you're not.", "On why he turned down great roles: I failed everything growing up. I was convinced I was failing for a reason. I wasn't intelligent or like most people. I could barely get through school. I was considered in my family to be a loser. My brother, who is older, was an A student - captain of the football team and the baseball team, and I was the comedian. And someone saying, 'Boy, you're a real comedian,' is like someone saying, 'Boy, you're a real loser.'", "On how he became an actor: I started junior college in Los Angeles because I didn't have the grades to go to university and I didn't want to go into the military. So in my first year of junior college I'm failing and I don't know what to do. I don't want to get a job, I want to be a student, and a friend says, 'Take acting, because they don't flunk you - it's like gym, nobody gets an F.'\"I took it and suddenly it was the first thing I ever did that wasn't painful. Where I held focus. And suddenly, rehearsing with somebody - learning lines - hours could pass by. And I begged my parents to let me go to this acting school, because I knew I couldn't fail.\"", "On meeting 'Gene Hackman' (qv) at the Pasadena Playhouse College of Theater Arts: They kicked him out after three months because he had no talent.", "[Acting coach Barney Brown] told me, you can have a life. He didn't say anything about success. He said, 'Whether you direct, write, act or stage-manage, you're in the right place.' And he said, 'Go to New York and understand one thing - nothing is going to happen to you for 10 years. Give yourself 10 years and nothing is going to happen.' It was true. I found work where I could fail with dignity. Because 90% of us didn't get jobs.", "On working at the New York Psychiatric Institute: It was one of the most illuminating experiences I ever had. You see all the devils we have and just see it out of control. The only thing that frightened me was, I had to hold people down while they were given shock treatments, but after a few months I said, 'I can't do it any more.' [At the time, he was reading \"One Flew over the Cuckoo's Nest,\" and couldn't get over how close it mirrored life at the psychiatric institute.] You went in there normal and came out crazy in those days. You came out worse.", "To this day, 'Robert Duvall' (qv) says it was one of the best times of when we were all living together. Because I'd come home and they'd say, 'What did so-and-so do today?' and I'd act out the characters I'd met there. 'Gene Hackman' (qv) would spend his entire day in the cinema. It was a place where the homeless went, because for 35 cents they could sleep there all day. He was in there at 10am and he heard one homeless guy in the balcony saying, 'You're sorry? You're sorry? What do you mean, you're sorry? You piss all over my date and you say you're sorry?'", "[on choosing a profession where he felt secure in failure:] It's very painful for us to feel we deserve a life. That's the toughest thing. That we deserve to have a life. That can take a lifetime.", "Working with 'Federico Fellini' (qv)? That destabilised everything. That makes liars out of my parents. Because I believed what they told me. I should not have turned down Fellini. If he wants you to do it in mumbo jumbo, if it's the worst script you've ever read, you do not turn down the great artists. I turned 'Samuel Beckett' (qv) down! I didn't show up for a meeting at a bar in Paris. I got too scared. It was to do 'Godot.' They called me up and said he waited there for an hour! That's the title of my autobiography - 'I Turned Beckett Down.' But I just froze. I look back and I can't call up Federico now and say, 'I changed my mind. Will you work with me?'", "[on first turning down _The Graduate (1967)_ (qv)] It was like a bad dream for me. And it came at a time when I was beginning to get work off-Broadway as an actor and I'd just been in a hit and I'd gotten awards and I thought for the rest of my life my dream will come true: I will be an off-Broadway actor for the rest of my life. And that would have been enough. More than enough. Steady employment was the goal. If God had come down at that moment and said to me or 'Gene Hackman' (qv) or 'Robert Duvall' (qv), 'Sign a contract here that says \"You're never going to be successful, you're never going to have a lead, you're never going to be rich and famous, you will never be on Broadway, you will never be in the West End - you'll be not even off, but off-off-off-Broadway, but you will never see a day without work' - we would have signed on the dotted line in a New York minute.", "Someone once said to me, 'Some of us choose to live with a lifeboat just a little bit out of our reach.' I'd like to reach a point where I no longer bullshit myself. I think that's the natural human condition - to lie to yourself. Because the truth is painful.", "[on 'Meryl Streep' (qv)]: She's extraordinarily hardworking, to the extent that she's obsessive. I think that she thinks about nothing else but what she's doing.", "[1974] The Academy 'Awards' (qv) are obscene, dirty and no better than a beauty contest.", "[on the financial success of 'All the President's Men'] The reason for the success of this picture is that Hoffman's back and Redford's got him. It's what the public always wanted: that beautiful WASP finally wound up with a nice Jewish boy.", "[Glancing at his Oscar for _Kramer vs. Kramer (1979)_ (qv)] He has no genitalia and he's holding a sword. I'd like to thank my mother and father for not practicing birth control.", "[on winning the Academy Award] We are part of an artistic family.There are sixty thousand actors in the Screen Actors Guild who don't work. You have to practice accents while you're driving a taxicab 'cause when you're a broke actor you can't write and you can't paint. Most actors don't work and few of us are lucky to have a chance. And to that artistic family that strives for excellence, none of you have ever lost, and I am proud to share this with you, and I thank you.", "[on his role of Dorothy in _Tootsie (1982)_ (qv)] I feel cheated never being able to know what it's like to get pregnant, carry a child and breast-feed.", "Movies are a bastard art form, period. Art, I would think, is the first day you don't start with chapter 25, then jump to the beginning, then jump to the end, and it's all set in concrete, and a script is never what the movie turns out to be. It's either better or worse, but it's a blueprint. When you're painting a picture or writing, you know as well as anyone, you have the general feeling of it but it begins to tell you where it's going. This is the first time I've ever had that opportunity. That is extraordinary. 'Michael Mann' (qv) said he looks at the work, and it starts to influence [him]: We could go there, we could go there, we could go there. I've never had that experience before. As far as it inhabiting me, it doesn't. I don't take the character [home], I've never really understood that personally. You're pretending.", "It's very hard to do your best work, but you want a shot at it. You cannot get a shot at doing your best work in the studio system. You can't. There's committees, there's meetings, you're on the set, you don't have to do that, they get involved in a quasi-creative way but they buck heads with people they shouldn't be bucking heads with. With HBO, once they give a go, there's no committee, no meetings. I was expecting 20 pages a day. I was expecting an atmosphere like making movies on cocaine or speed. It's the opposite. We did the best we could with as much time as we could, and came back the next day. 'Michael Mann' (qv) hired all film directors. There was no difference between making a movie, except he used digital and three cameras, which actors love because we don't have to repeat.", "[on his _Luck (2011)_ (qv) character Chester \"Ace\" Bernstein] I think he tells the truth, and yet he's very intimidating. He's not believed. In the world that he lives in, telling the truth is the last thing they're going to believe. 'Paddy Chayefsky' (qv) said to me many, many years ago when he was researching for _The Godfather (1972)_ (qv), he says, \"I'll take the mob any day, because if you don't keep your word, they kill you. So you keep your word. I just got to know a little bit about Hollywood. There is no moral compass because no one keeps your word because no one's going to kill them. They're just going to get sued. Give me the mafia.\"", "[on learning about Santa Anita Park while making _Luck (2011)_ (qv)] Through 'David Milch' (qv). David knows more about it than anything else. I shouldn't say that, because my wife ['Lisa Gottsegen' (qv)]'s father was a \"degenerate\" [a nickname for a regular gambler], and my wife went to the track with him when she was 6 years old. My wife has told me everything I have to know about the track, because as a child, she'd learn it from her father, who was a degenerate. When my wife was 5 or 6 years old, she went out to Santa Anita every day with him, and she held a piece of paper and she would look at her dad and say, \"See that horse? Write down KS,\" and she knew that stood for \"kidney sweat\" [a sign of a nervous or sick horse], and that was her job for about three years.", "[on playing a shady racetrack ex-con in _Luck (2011)_ (qv)] I don't have a gangster phone book or anything like that. I live in a certain milieu, that's called 'Hollywood' euphemistically, in which you are are continually lied to and screwed with. I'd much rather be with the mob because, if they promise you something, they keep their word. In Hollywood nobody keeps their word. Everybody lies to you because it doesn't cost them their life. If I were more like my character I might want to kill them with my bare hands.", "I think the most insulting thing you can do to a director is to challenge when he or she is satisfied with your interpretation.", "[when asked by a _60 Minutes (1968)_ (qv) interviewer what he would like his tombstone to say] I'd like to thank my parents. Without them I couldn't have gotten this far.", "I knew I was not going to win for _The Graduate (1967)_ (qv). I knew that 'Rod Steiger' (qv) was going to win for _In the Heat of the Night (1967)_ (qv), and I knew I was not going to win for _Midnight Cowboy (1969)_ (qv) because 'John Wayne' (qv) was a sentimental favorite for _True Grit (1969)_ (qv). And he won, as he should have, by the way, because I somehow feel they make more sense when they give you an award for a body of work... I actually remember walking up the aisle, and I'd had a few drinks, when I was nominated for _Tootsie (1982)_ (qv). I was a little late getting there. Everybody was seated, and the show was just beginning, and I'm walking down the aisle and 'Paul Newman' (qv) was on my right. He was nominated (for _The Verdict (1982)_ (qv)) I leaned over and said to him, with three drinks in me, I whispered in his ear, \"We're not gonna win.\" And he smiled because everyone knew 'Ben Kingsley' (qv) was going to win for _Gandhi (1982)_ (qv). There's never been a time, thankfully, where I thought, \"Man, I think I'm gonna win this, and then I didn't.\"", "[in a 2008 interview, on whether he ever googled himself] No, and it's not out of modesty. It's 'cause I don't belong in the 21st Century. I really never got far into the technology since the dial phone. It's all very tough for me. I jut block it out or whatever, but I cannot work those things without help... As we speak, I'm walking my dogs on the beach, and, lo and behold, paparazzi. I'm being interviewed while I'm being shot.", "[on _The Graduate (1967)_ (qv)] As far as I'm concerned, 'Mike Nichols' (qv) did a very courageous thing casting me in a part that was not right for, meaning I was Jewish. In fact many of the reviews were negative. It was kind of veiled anti-Semitism: I was called 'big-nosed'.", "I have the utmost respect for women and feel terrible that anything I might have done could have put her in an uncomfortable situation, I am sorry. It is not reflective of who I am.", "[Responding to 'James Franco' (qv)'s question on Variety's Actors on Actors about his struggle at the beginning of his career] \"I like 'William Saroyan' (qv), the writer. I read his plays when I was, like 22. And he ['William Saroyan' (qv)] said one line talking about his work. He was asked 'Why do you write?' He said 'because it's the only way I chose to survive'. And that was literally in front of me going through rejection year after year.\"", "Well, I cowrote _Kramer vs. Kramer (1979)_ (qv) with the writer-director ['Robert Benton' (qv)]. When we were done he said: I want to give you a writing credit. I said, 'No, no, Bob, that's alright'. That was always my position. It got the Academy Award - for a few things, but one of them was writing. Another one was _Tootsie (1982)_ (qv): my friend and I cowrote the early drafts. He took credit. I didn't want to. _Rain Man (1988)_ (qv) was another one.", "[on the 1970s] We didn't know it was the golden age of movies when we were there."], "salary history": ["_The Graduate (1967)_ (qv)::$17,000", "_Midnight Cowboy (1969)_ (qv)::$700,000", "_John and Mary (1969)_ (qv)::$425,000", "_Papillon (1973)_ (qv)::$1,250,000", "_Kramer vs. Kramer (1979)_ (qv)::$2,000,000", "_Tootsie (1982)_ (qv)::$5,500,000", "_Tootsie (1982)_ (qv)::$5,000,000", "_Ishtar (1987)_ (qv)::$6,000,000", "_Rain Man (1988)_ (qv)::$5,800,000 +% of gross", "_Hook (1991)_ (qv)::$2,000,000 +gross point"], "birth date": "1937-08-08", "birth notes": "Los Angeles, California, USA", "_actorID": "79", "_source": "IMDB", "actorID": "0000163", "created_utc_dt": "09/14/2019, 13:02:25"}