{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQzNjU3MDczN15BMl5BanBnXkFtZTYwNzY2Njc4._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Jules"], "birth name": "Julia Fiona Roberts", "height": "5' 9\" (1.75 m)", "mini biography": ["Julia Fiona Roberts never dreamed she would become the most popular actress in America. She was born in Smyrna, Georgia, to Betty Lou (Bredemus) and Walter Grady Roberts, one-time actors and playwrights, and is of English, Irish, Scottish, Welsh, German, and Swedish descent. As a child, due to her love of animals, Julia originally wanted to be a veterinarian, but later studied journalism. When her brother, 'Eric Roberts' (qv), achieved some success in Hollywood, Julia decided to try acting. Her first break came in 1988 when she appeared in two youth-oriented movies _Mystic Pizza (1988)_ (qv) and _Satisfaction (1988)_ (qv). The movies introduced her to a new audience who instantly fell in love with this pretty woman. Julia's biggest success was in the signature movie _Pretty Woman (1990)_ (qv), for which Julia got an Oscar nomination, and also won the People's Choice award for Favorite Actress. Even though Julia would spend the next few years either starring in serious movies, or playing fantasy roles like Tinkerbell, the movie audiences would always love Julia best in romantic comedies. With _My Best Friend's Wedding (1997)_ (qv) Julia gave the genre fresh life that had been lacking in Hollywood for some time. Offscreen, after a brief marriage, Julia has been romantically linked with several actors, and married cinematographer 'Daniel Moder' (qv) in 2002; the couple has three children together.Julia has also become involved with UNICEF charities and has made visits to many different countries, including Haiti and India, in order to promote goodwill. Julia Robert remains one of the most popular and sought-after talents in Hollywood.::kdhaisch@aol.com"], "spouse": ["'Daniel Moder' (qv)::(4 July 2002 - present) ( 3 children)", "'Lyle Lovett' (qv)::(25 June 1993 - 22 March 1995) ( divorced)"], "trade mark": ["Her bright smile", "Gentle voice", "Her mole"], "trivia": ["Lent her celebrity name to help raise money for research to develop a cure for Rett Syndrome (a disease which is potentially fatal and randomly strikes girls between the ages of 2 to 6 years).", "Has been part of several public polls. She was chosen by People Magazine among \"50 Most Beautiful People in the World\" in 1990, 1991, 2000, 2002, 2005 and 2006. In 1997, she ranked #66 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list (October 1997). Ranked #1 on Forbes magazine 'Celebrity 100' (2000). Named one of E!'s \"Top 20 entertainers of 2001\" and one of People Magazine's '25 Most Intriguing People of 2001'. Same year, she ranked 6th of the 100 Sexiest Women by FHM Taiwan and was cited as America's Favorite Movie Star in a Harris Poll. In 2003, she was #10 in Star TV's Top 10 Box Office Stars of the 1990 and #16 in 2003 on Premiere's Annual Hollywood Power List. In 2005, Premiere Magazine Stars in Our Constellation feature ranked Julia as the #7 Greatest Movie Star of All Time. in their Stars in Our Constellation feature (2005). In November 2006, she was chosen \"Sexiest Bespectacled Star\" by the readers of \"In Touch\" (Nov 2006) . In 2007 she was named #57 on Empire Magazine's 100 Sexiest Movie Stars.", "Had a maternal half-sister, 'Nancy Motes' (qv) (1976 - 2014).", "Turned down the female lead in _Shakespeare in Love (1998)_ (qv).", "Was engaged to 'Kiefer Sutherland' (qv) for a brief period. Broke up with him just days before their planned marriage in 1991.", "Younger sister of 'Lisa Roberts Gillan' (qv) and 'Eric Roberts' (qv).", "Played clarinet in the band. She attended Griffin Middle School and then Campbell High School.", "Has \"movie within a movie\" scenes in _The Player (1992)_ (qv), _Notting Hill (1999)_ (qv), _America's Sweethearts (2001)_ (qv) and _Full Frontal (2002)_ (qv).", "Was considered for the role of Poison Ivy in _Batman & Robin (1997)_ (qv).", "Dated 'Benjamin Bratt' (qv) (1997-2001).", "Born to Walter Grady Roberts (1933-1977), a vacuum cleaner salesman, and his wife Betty Lou Bredemus (1934-2015), a one-time church secretary and real estate agent. Her parents were stage actors and acting coaches.", "Tops the list of the 200 \"hottest\" actors and actresses in the business in \"James Ulmer's Hollywood Hot List: The Complete Guide to Star Power - 2000\" book which is published in October 2000. [June 2000]", "Was engaged to her _Steel Magnolias (1989)_ (qv) co-star, 'Dylan McDermott' (qv).", "Lies on her back to have her make-up applied before going onto a film set -- she insists it gives her a relaxed look.", "Sister-in-law of 'Tony Gillan' (qv) and 'Eliza Roberts' (qv).", "Aunt of 'Emma Roberts' (qv).", "After 'George Clooney' (qv) and 'Brad Pitt' (qv) found out that she was going to be joining them in _Ocean's Eleven (2001)_ (qv), they sent her a card that read \"We heard that you get 20 per film\" and in it was a $20 bill; the joke was that she reportedly gets $20 million per film.", "At the 2002 Peoples Choice 'Awards' (qv) she admitted to being a huge fan of _Days of Our Lives (1965)_ (qv) and asked to be seated near the cast.", "Splits her down time between her ranch in Taos, New Mexico and a home in New York City.", "Married boyfriend, cameraman 'Daniel Moder' (qv), at their ranch home in Taos, New Mexico in a midnight ceremony. 'Bruce Willis' (qv) was the only celebrity that attended her wedding to 'Daniel Moder' (qv). Julia wore a simple pink cotton halter dress by pal Judith Beylerian (4 July 2002).", "She never acted in a sequel until _Ocean's Twelve (2004)_ (qv).", "She has English, German, Swedish, Irish, Scottish, and Welsh ancestry.", "She is a huge fan of actress 'Aishwarya Rai Bachchan' (qv), whom she once commented on being \"The most beautiful woman in the world, more beautiful than any Hollywood actress.\"", "Pakistani film director Rauf Khalid wanted her to work in his film, and even invited her to Pakistan to discuss the project, but she refused because of prior commitments.", "Observed art history classes at New York University in order to prepare for her role in _Mona Lisa Smile (2003)_ (qv).", "Her Oscar-winning performance as 'Erin Brockovich-Ellis' (qv) was ranked #31 on the American Film Institute's Heroes list of the 100 years of The Greatest Screen Heroes and Villains.", "Announced that she and husband 'Daniel Moder' (qv) are expecting twins. Twins run in her family. She is due in early 2005. [June 2004]", "Canadian singer-songwriter 'Chantal Kreviazuk' (qv) wrote the song \"Julia\" about her after seeing her at a Los Angeles restaurant.", "A 9000 year old female skeleton excavated in Bulgaria in November 2004, was called by the archaeologists \"'Julia Roberts' (qv)\" because of the perfect teeth it had. They said that woman would have had a perfect smile - just like the actress.", "Has worked with both 'Hector Elizondo' (qv) and 'Richard Gere' (qv) in two different movies, first in _Pretty Woman (1990)_ (qv), and then again in _Runaway Bride (1999)_ (qv).", "As 'Erin Brockovich-Ellis' (qv) is right handed and Roberts is not, she had to learn to use her right hand for _Erin Brockovich (2000)_ (qv).", "Has played an art historian twice, once in _Everyone Says I Love You (1996)_ (qv) and also in _Mona Lisa Smile (2003)_ (qv).", "First actress to reach 20 million dollar mark salary (for _Erin Brockovich (2000)_ (qv)) The first actor to do so was 'Jim Carrey' (qv), four years earlier, who was paid the same amount for his role in _The Cable Guy (1996)_ (qv).", "She and her _Ocean's Eleven (2001)_ (qv) / _Ocean's Twelve (2004)_ (qv) co-stars 'George Clooney' (qv), 'Brad Pitt' (qv) and 'Elliott Gould' (qv), all have guest-starred on the situation comedy _Friends (1994)_ (qv), though not in the same episodes.", "Roberts' production company \"Red Om\" films is her husband Danny's second name reversed.", "As a gesture of thanks for giving her children music lessons, 'Coretta Scott King' (qv) paid the hospital bills when the pregnant Mrs. Roberts' delivered her next child. That child ended up being Julia.", "Early in her career, she auditioned unsuccessfully for two soap opera roles. She lost the part of \"Linda Warner\" to 'Melissa Leo' (qv) on _All My Children (1970)_ (qv); and the part of \"Hayley Benson\" to 'Stacy Edwards' (qv) on _Santa Barbara (1984)_ (qv).", "Her great-grandmother Elin (Eleanor) was Swedish, born 1884 in Värmland, Sweden. She died in Minneapolis 1960, seven years before Julia was born.", "Her Broadway debut in the play \"Three Days of Rain\" in 2006 received terrible reviews for her performance and ran for just 70 performances.", "Good friends with 'Denzel Washington' (qv) since they met while co-starring in _The Pelican Brief (1993)_ (qv).", "Daughter-in-law of 'Mike Moder' (qv).", "Drives a Toyota Prius. [April 2004]", "She won an Oscar for playing Erin Brockovich in _Erin Brockovich (2000)_ (qv), making her one of 17 actors to win the Award for playing a real person who was still alive at the evening of the Award ceremony (as of 2015). The other sixteen actors and their respective performances are: 'Spencer Tracy' (qv) for playing Father Edward Flanagan in _Boys Town (1938)_ (qv), 'Gary Cooper' (qv) for playing Alvin C. York in _Sergeant York (1941)_ (qv), 'Patty Duke' (qv) for playing Helen Keller in _The Miracle Worker (1962)_ (qv), 'Jason Robards' (qv) for playing Ben Bradlee in _All the President's Men (1976)_ (qv), 'Robert De Niro' (qv) for playing Jake La Motta in _Raging Bull (1980)_ (qv), 'Sissy Spacek' (qv) for playing Loretta Lynn in Coal Miner's Daughter (1980)_, 'Jeremy Irons' (qv) for playing Claus Von Bullow in _Reversal of Fortune (1990)_ (qv), 'Susan Sarandon' (qv) for playing Sister Helen Prejean in _Dead Man Walking (1995)_ (qv), 'Geoffrey Rush' (qv) for playing David Helfgott in _Shine (1996)_ (qv), 'Jim Broadbent' (qv) for playing John Bayley in _Iris (2001)_ (qv), 'Helen Mirren' (qv) for playing Queen Elizabeth II in _The Queen (2006)_ (qv), 'Sandra Bullock' (qv) for playing Leigh Anne Tuohy in _The Blind Side (2009)_ (qv), 'Melissa Leo' (qv) for playing Alice Eklund-Ward in _The Fighter (2010)_ (qv), 'Christian Bale' (qv) for playing Dickie Eklund in _The Fighter (2010)_ (qv), 'Meryl Streep' (qv) for playing Margaret Thatcher in _The Iron Lady (2011)_ (qv) and 'Eddie Redmayne' (qv) for playing Stephen Hawking in _The Theory of Everything (2014)_ (qv).", "An accomplished equestrienne, she did her own riding in _Runaway Bride (1999)_ (qv).", "Turned down leading role in _Sleepless in Seattle (1993)_ (qv) which went to 'Meg Ryan' (qv).", "Received the American Cinematheque Award. [October 2007]", "Is an alumni of the Lee Strasberg Institute such as actors 'Angelina Jolie' (qv), 'Frank Miranda' (qv), 'Mickey Rourke' (qv), 'Scarlett Johansson' (qv), 'Rosario Dawson' (qv), 'Dennis Hopper' (qv).", "Six directors whom have cast her at least twice in their films are: 'Mike Nichols' (qv), 'Steven Soderbergh' (qv), 'Garry Marshall' (qv), 'Robert Altman' (qv), 'Ryan Murphy' (qv), and 'Joel Schumacher' (qv).", "Good friends with 'Bruce Willis' (qv), 'Tom Hanks' (qv), 'George Clooney' (qv), 'Brad Pitt' (qv), 'Susan Sarandon' (qv), 'Natalie Portman' (qv), 'David Letterman' (qv), and 'Dave Matthews' (qv).", "Her stepfather is theater critic Michael Motes.", "Her films have grossed more than $ 2 billion at the US box office, making her the biggest female movie star of all time. [February 2007]", "Has supported UNICEF enthusiastically.", "Buys her own organic greens at the market near her apartment in New York.", "In 2006, she earned $5 million for endorsing Gianfranco Ferre. She posed for eight print ads, which was equivalent for one day of work.", "By 2004, she had a fortune estimated to be worth $212 million. Forbes once named her as #8 among the 20 Richest Women In Entertainment.", "In 2007, Forbes Magazine estimated her earnings for the year at $9 million.", "Currently has made just one movie - _Blood Red (1989)_ (qv) - with brother 'Eric Roberts' (qv).", "Is one of 16 actresses that have won an Academy Award, BAFTA Award, Critics' Choice Award, Golden Globe Award and SAG Award for the same performance. The others in chronological order are 'Renée Zellweger' (qv) for _Cold Mountain (2003)_ (qv), 'Reese Witherspoon' (qv) for _Walk the Line (2005)_ (qv), 'Helen Mirren' (qv) for _The Queen (2006)_ (qv), 'Jennifer Hudson' (qv) for _Dreamgirls (2006)_ (qv), 'Kate Winslet' (qv) for _The Reader (2008)_ (qv), 'Mo'Nique' (qv) for _Precious (2009)_ (qv), 'Natalie Portman' (qv) for _Black Swan (2010)_ (qv), 'Octavia Spencer' (qv) for _The Help (2011)_ (qv), 'Anne Hathaway' (qv) for _Les Misérables (2012)_ (qv), 'Cate Blanchett' (qv) for _Blue Jasmine (2013)_ (qv), 'Patricia Arquette' (qv) for _Boyhood (2014)_ (qv), 'Julianne Moore' (qv) for _Still Alice (2014)_ (qv), 'Brie Larson' (qv) for _Room (2015)_ (qv), 'Allison Janney' (qv) for _I, Tonya (2017)_ (qv), and 'Frances McDormand' (qv) for _Three Billboards Outside Ebbing, Missouri (2017)_ (qv).", "Is a huge fan of actress 'Katharine Hepburn' (qv).", "One of her favorite hobbies is knitting.", "Born at 12:16 AM (EST).", "Refused to star in _The Proposal (2009)_ (qv) unless Disney offered her a higher salary; eventually, Disney hired 'Sandra Bullock' (qv) for even less money than it had offered Roberts, and the film became one of the highest-grossing romantic comedies, ever.", "Is an honorary Phi Mu sister because of her role as one in _Steel Magnolias (1989)_ (qv).", "Gave birth to twins (her first and second child) at age 37, a son 'Finn Moder' (qv) (aka Phinnaeus Walter Moder) and a daughter 'Hazel Moder' (qv) (aka Hazel Patricia Moder) on November 28, 2004. Child's father is her second husband, 'Daniel Moder' (qv).", "Gave birth to her third child at age 39, a son Henry 'Daniel Moder' (qv) on June 18, 2007. Child's father is her second husband, 'Daniel Moder' (qv).", "Was forced to deliver her twins 'Finn Moder' (qv) and 'Hazel Moder' (qv) via emergency Caesarean section 8 days ahead of their due date following a difficult pregnancy.", "Lives in Malibu, California, New York City, New York and Taos, New Mexico.", "She starred alongside actor 'Bradley Cooper' (qv) in the Broadway play \"Three Days of Rain\" in 2006. Four years later, they were reunited in the film _Valentine's Day (2010)_ (qv).", "Returned to work 13 months after giving birth to her twins Phinneaus and Hazel in order to begin rehearsing for her Broadway debut \"Three Days of Rain\".", "Was 4 months pregnant with her son Henry when she completed filming _Charlie Wilson's War (2007)_ (qv).", "Insured her smile for thirty million dollars.", "Returned to work 9 months after giving birth to her son Henry in order to begin filming _Duplicity (2009)_ (qv).", "Is a long-time fan of the 'Dave Matthews' (qv) Band, and appeared in their music video \"Dreamgirl\" in 2005. It was her first performance after giving birth to her twins.", "Was going to do Shakespeare in Love but things didn't work out.", "Making her Broadway debut in the revival of 'Richard Greenberg' (qv)'s play \"Three Days of Rain\". Her co-stars are 'Paul Rudd' (qv) and 'Bradley Cooper' (qv). [April 2006]", "Capital Hill, Washington, D.C., USA testifying for more federal funding for Rett Syndrome [May 2002]", "The longest she has gone without an Oscar nomination is the 13 years between _Erin Brockovich (2000)_ (qv) and _August: Osage County (2013)_ (qv).", "Was the 119th actress to receive an Academy Award; she won the Best Actress Oscar for _Erin Brockovich (2000)_ (qv) at The 73rd Annual Academy 'Awards' (qv) (2001) on March 25, 2001.", "Her role in _Sleeping with the Enemy (1991)_ (qv) was originally written for 'Jane Fonda' (qv).", "Dated 'Matthew Perry' (qv).", "She has worked with 4 directors who have won a Best Director Oscar: 'Steven Spielberg' (qv), 'Woody Allen' (qv), 'Steven Soderbergh' (qv), and 'Mike Nichols' (qv).", "She is left-handed.", "Only agreed to film her Bali scenes from _Eat Pray Love (2010)_ (qv) on location if the producers agreed to allow her to have her family over there during the shoot.", "'Bryan Cranston' (qv) improved his shape and bleached his teeth when he was cast as her husband in _Larry Crowne (2011)_ (qv), stating that he wanted a pairing of them seem more believable.", "Gained 10 pounds while filming the Italian based scenes of _Eat Pray Love (2010)_ (qv), due to the amount of pasta she had to endure.", "Frequent collaborator of 'Dermot Mulroney' (qv). They co-starred in _My Best Friend's Wedding (1997)_ (qv) and _August: Osage County (2013)_ (qv), while she also did a cameo in his directorial debut _Love, Wedding, Marriage (2011)_ (qv).", "13 films of her career have been nominated for at least one Academy Award.", "Personally handpicked 'Nicole Kidman' (qv) to be her co-star in _Secret in Their Eyes (2015)_ (qv). She sent her an email with the script attached that read: \"Will you do this with me?\".", "Made four films with 'Garry Marshall' (qv): _Pretty Woman (1990)_ (qv), _Runaway Bride (1999)_ (qv), _Valentine's Day (2010)_ (qv) and his final film _Mother's Day (2016)_ (qv). The last two were only cameos for which Roberts received $3 million from each film.", "Initially, the real Erin Brokovich was displeased with Roberts being cast to portray her in _Erin Brockovich (2000)_ (qv), because she felt Roberts didn't match her own psychical appearance and was too well-spoken. She suggested 'Goldie Hawn' (qv) and 'Roseanne Barr' (qv) for the part.", "Some of her costumes from _Mirror Mirror (2012)_ (qv) were so elaborate that her kids could hide under her skirts, while other designs made her pull a muscle. The costumes were the final work of 'Eiko Ishioka' (qv) who posthumously received an Oscar nomination for the creations.", "Is a fan of Manchester United FC. Has attended matches in Manchester and visited with the team at training camp in California on a preseason tour of the US in 2017. Reported to be a good friend of Manchester United midfielder Paul Pogba.", "Ninth highest paid actress of 2017 with $12 million.", "Credits 'Shirley MacLaine' (qv) as her favorite acting mentor/best friend.", "Whenever Julia is unavailable to re-record her dialogue on film, fellow actress 'Amy Landecker' (qv) regularly substitutes by providing her voice for ADR (Automated Dialog Replacement). Many of Roberts' movie trailers also feature the voice of Landecker.", "Has played the daughter to five fellow Best Actress Oscar winners; to 'Sally Field' (qv) in _Steel Magnolias (1989)_ (qv), to 'Ellen Burstyn' (qv) in _Dying Young (1991)_ (qv), to 'Shirley MacLaine' (qv) in _Valentine's Day (2010)_ (qv), to 'Meryl Streep' (qv) in _August: Osage County (2013)_ (qv), and to 'Sissy Spacek' (qv) in _Homecoming (2018)_ (qv).", "Nominated for the 2019 Golden Globe Award in the Best Performance by an Actress In A Television Series - Drama category for her role as Heidi Bergman in _Homecoming (2018)_ (qv), but lost to 'Sandra Oh' (qv) for _Killing Eve (2018)_ (qv).", "Roberts has worked with the only 2 men to have won the Oscar for Best Actor who share the same surname: Dustin Hoffman and Philip Seymour Hoffman. She worked with Dustin Hoffman in \"Hook\" (1991) and with Philip Seymour Hoffman in \"Charlie Wilson's War\" (2007).", "Came to fame in the 1989 film Steel Magnolias.", "In film _Blood Red (1989)_ (qv) with her brother Eric."], "quotes": ["I enjoy hats. And when one has filthy hair, that is a good accessory.", "I'm too tall to be a girl, I never had enough dresses to be a lady, I wouldn't call myself a woman. I'd say I'm somewhere between a chick and a broad.", "My real hair color is kind of a dark blonde. Now I just have mood hair.", "[in a 1998 interview) I've sort of grown into my cuteness.", "[about President 'George W. Bush' (qv)'s daughters being caught with alcohol as minor] We all need to take a deep breath and think about being a Bush daughter and having that cross to bear. I'd go out and have a couple of drinks, too.", "[about forgetting to include the real-life 'Erin Brockovich-Ellis' (qv) in her Academy Award acceptance speech] It doesn't bring out the Einstein moment that you hoped it would.", "You know I'm like a total geek, right? First of all, I sit on the set and knit. It's a very social hobby, as opposed to reading at work - I can chat with people and still be fully engaged.", "[about President 'George W. Bush' (qv)] He's embarrassing, he's not my president. He will never be my president.", "I'm just an ordinary person who has an extraordinary job.", "[on the essence hr job] I get dressed up like a doll, a nice man puts lipstick on my lips and I say words - it's deeply satisfying.", "[n why she will never do a nude scene] I just don't feel that my algebra teacher should ever know what my butt looks like.", "You can be true to the character all you want, but you've go to go home with yourself.", "[interview in People magazine, 8/2/99] The first time I felt I was famous was when I went to the movies with my mom. I had gone to the loo, and someone in the bathroom said in a very loud voice, \"Girl in stall No. 1, were you in _Mystic Pizza (1988)_ (qv)?\" I paused and I said, \"Yeah, that was me.\"", "I think it's dangerous to talk in the big generalities of sexism and ageism and face lift-isms. You really have to speak only from your own experience. And my experience so far has been ridiculously nice. Yeah, do the boys get paid more? Yes. But do we all get paid too much? Yes. I'm confused at what I'm supposed to complain about.", "I wouldn't do nudity in films. To act with my clothes on is a performance. To act with my clothes off is a documentary.", "It's heaven truly... we were rehearsing one day, and we had just moved into the theater and it was dark out here, and I was on stage, and all of the sudden, I hear, 'Mama!' And Hazel had come in and in the dark just to hear this little voice, and it's incredibly amazing.", "I think one of the smartest things I ever did for my career was not working for two years in the early 90s. I was being offered a lot of different movies but I just didn't see the point of any of them. People would say to me \"How can you just be passing on all those things?\" And my response was \"Tell me a movie you've seen in the past year that I should have made.\"", "[about her success] I'm just a girl from a little town in Georgia who had this giant, absurd dream.", "[on 'Clive Owen' (qv)] 'George Clooney' (qv) is obsessed with Clive. Every good-guy actor talks about Clive as one of their favourites. Because he's English, because his successes have stood on the shoulders of his talents alone, and because he hasn't been carried away by popular culture.", "I'm tall and smart. If you're aggressive and energetic it can be intimidating for people who aren't very smart themselves.", "We are happy as clams. I am fulfilled by my own life on an hourly basis. Every little moment is amazing if you let yourself access it. I learn that all the time from my kids; children are so filled with wonder. My youngest son woke up at 5 a.m. the other morning and said to me, 'It's a beautiful day, Mama!' What's more precious than that?", "I say you can call me, but I don't necessarily call everybody back now. I'm not off the market, but my decision-making has more components than it used to.", "[on meeting _Eat Pray Love (2010)_ (qv) director 'Ryan Murphy' (qv)]: I fell totally under his spell. We're sort of like best girlfriends now.", "I believe that the way you feel about your life will eventually show up on your face.", "[on _Larry Crowne (2011)_ (qv)] This was my first college experience. And the first time I had to speak in front of a classroom, I was apoplectic. All these faces looking up at me, thinking, What is she going to teach us? I needed to find my composure. It was very hard--it was terrible, in fact.", "It's not just great teachers that shape your life. Sometimes its the absence of great teachers... Being ignored can be just as good for a person as being lauded.", "[on being asked how she developed her role as the nasty queen in _Mirror Mirror (2012)_ (qv): The Untold Adventures of Snow White (2012)] Well, I'm happy to announce that she's not inside me. But, without naming names, I drew from a couple of people I know better than I wish I did, and found it very fun and helpful.", "[on how she manages fame and family] Family values. That's actually values in general. That's all there is. Fame is just a summer breeze that comes and goes. But to have a bedrock of knowing who you are, that's what it's all about.", "[on working with 'Meryl Streep' (qv)] I've never seen anyone work harder than she does. She doesn't just snap her fingers and be a genius. To work with 'Meryl Streep' (qv) is a dream come come true for anyone. To know her is an honor. She is such a beautiful person and it was intimidating, certainly to be in these scenes with her. Choking her, and things like that, were not how I pictured it going in my mind all these years. I thought we'd be together, having tea and speaking fabulous accents, all dressed up. But there we were - I'm sweating and have on a big butt pad. Meryl sees not only what I need as an actor but what I need as a girl in the world. She provides that, all the time. No wonder she's sleeping. She's exhausted after taking care of me.", "[on filming _August: Osage County (2013)_ (qv)] Here's the thing. Here's the crux of the biscuit, if you will. We worked our asses off. Because there was no other way to do it. I've never worked so hard in my life and I've given birth to three children. It was like a mountain to climb every single day and the only way to climb it, we discovered, was holding hands - whether we liked it or not.", "[on 'James Gandolfini' (qv)] If there was ever a friend I can only smile when I think of - even when it is through tears - it is James. My friendship with him was invisible. The sparest amount of notes or tangible signs that we shared some of our life experiences together. The evidence is only within my heart and a handful of cards, some photographs. The same could, I realize, be said for his acting. It was invisible. Sitting down with my husband - who was also a friend of James - recently to watch _Enough Said (2013)_ (qv), one realized how skillful, masterful really James was. He so completely inhabits the part of Albert that the heartsick feeling I had at seeing James gave way to interest in the plight of Albert. Amazing. 'Julia Louis-Dreyfus' (qv) is transcendent in this film and it is so simple and delicate and their relationship is funny and authentic and suddenly, poof, the film was over. I felt so sad. Sitting there still. But realized I was smiling. Because, of course, he was once again Invisible.", "I would like to work with 'Johnny Depp' (qv). I've known him a long time. I think he's so interesting, and I think we look alike in a funny way. So 'Johnny Depp' (qv). 'Johnny Depp' (qv) and I will play brother and sister in something.", "I don't know what I've already said about _I Love Trouble (1994)_ (qv), other than that it was a piece of shit. It's no secret than Nick and i didn't get along like a house on fire."], "salary history": ["_Mystic Pizza (1988)_ (qv)::$50,000", "_Steel Magnolias (1989)_ (qv)::$90,000", "_Pretty Woman (1990)_ (qv)::$300,000", "_Flatliners (1990)_ (qv)::$500,000", "_Law & Order (1990)_ (qv)::$4,000 (scale)", "_Sleeping with the Enemy (1991)_ (qv)::$1,000,000", "_Dying Young (1991)_ (qv)::$3,000,000", "_Hook (1991)_ (qv)::$7,000,000", "_The Pelican Brief (1993)_ (qv)::$8,000,000", "_Mary Reilly (1996)_ (qv)::$8,500,000", "_My Best Friend's Wedding (1997)_ (qv)::$12,000,000", "_Conspiracy Theory (1997)_ (qv)::$11,000,000", "_Notting Hill (1999)_ (qv)::$15,000,000", "_Runaway Bride (1999)_ (qv)::$17,000,000", "_Erin Brockovich (2000)_ (qv)::$20,000,000", "_The Mexican (2001)_ (qv)::$20,000,000", "_America's Sweethearts (2001)_ (qv)::$15,000,000", "_Ocean's Eleven (2001)_ (qv)::$10,000,000", "_Confessions of a Dangerous Mind (2002)_ (qv)::$250,000 (scale)", "_Mona Lisa Smile (2003)_ (qv)::$25,000,000", "_Closer (2004)_ (qv)::$20,000,000", "_Ocean's Twelve (2004)_ (qv)::$5,000,000", "_Duplicity (2009)_ (qv)::$15,000,000", "_Valentine's Day (2010)_ (qv)::$3,000,000 + 3% of the film's gross", "_Eat Pray Love (2010)_ (qv)::$10,000,000", "_Mother's Day (2016)_ (qv)::$3,000,000", "_Wonder (2017)_ (qv)::$6,000,000", "_Homecoming (2018)_ (qv)::$600,000 per episode"], "birth date": "1967-10-28", "birth notes": "Smyrna, Georgia, USA", "_actorID": "47", "_source": "IMDB", "actorID": "0000210", "created_utc_dt": "09/14/2019, 13:01:56"}