{"headshot": "https://m.media-amazon.com/images/M/MV5BMTU4Mjk5MDExOF5BMl5BanBnXkFtZTcwOTU1MTMyMw@@._V1_UY98_CR1,0,67,98_AL_.jpg", "birth name": "Mary Louise Streep", "height": "5' 6\" (1.68 m)", "mini biography": ["Considered by many critics to be the greatest living actress, 'Meryl Streep' (qv) has been nominated for the Academy Award an astonishing 21 times, and has won it three times. Meryl was born Mary Louise Streep in 1949 in Summit, New Jersey, to Mary Wolf (Wilkinson), a commercial artist, and Harry William Streep, Jr., a pharmaceutical executive. Her father was of German and Swiss-German descent, and her mother had English, Irish, and German ancestry.Meryl's early performing ambitions leaned toward the opera. She became interested in acting while a student at Vassar and upon graduation she enrolled in the Yale School of Drama. She gave an outstanding performance in her first film role, _Julia (1977)_ (qv), and the next year she was nominated for her first Oscar for her role in _The Deer Hunter (1978)_ (qv). She went on to win the Academy Award for her performances in _Kramer vs. Kramer (1979)_ (qv) and _Sophie's Choice (1982)_ (qv), in which she gave a heart-wrenching portrayal of an inmate mother in a Nazi death camp.A perfectionist in her craft and meticulous and painstaking in her preparation for her roles, Meryl turned out a string of highly acclaimed performances over the next decade in great films like _Silkwood (1983)_ (qv); _Out of Africa (1985)_ (qv); _Ironweed (1987)_ (qv); and _A Cry in the Dark (1988)_ (qv). Her career declined slightly in the early 1990s as a result of her inability to find suitable parts, but she shot back to the top in 1995 with her performance as 'Clint Eastwood' (qv)'s married lover in _The Bridges of Madison County (1995)_ (qv) and as the prodigal daughter in _Marvin's Room (1996)_ (qv). In 1998 she made her first venture into the area of producing, and was the executive producer for the moving _...First Do No Harm (1997)_ (qv). A realist when she talks about her future years in film, she remarked that \"...no matter what happens, my work will stand...\"::Tom McDonough"], "spouse": ["'Don Gummer' (qv)::(30 September 1978 - present) ( 4 children)"], "trade mark": ["Known for being a perfectionist when preparing for roles", "Known for her ability to master almost any accent", "Frequently plays real-life characters: 'Julia Child' (qv), 'Ethel Rosenberg' (qv), 'Karen Silkwood' (qv), 'Karen Blixen' (qv), Roberta Guaspari, Lindy Chamberlain, 'Susan Orlean' (qv) and 'Margaret Thatcher' (qv).", "Frequently worked with Academy Award-winning director 'Mike Nichols' (qv)."], "trivia": ["Named Best Modern Actress in an Entertainment Weekly online poll, substantially beating out runner-up 'Michelle Pfeiffer' (qv). [September 1999]", "Learned to play the violin, by practicing six hours a day for eight weeks, for her role in _Music of the Heart (1999)_ (qv).", "Has a fear of helicopters.", "Listed as one of 12 \"Promising New Actors of 1977\" in John Willis' Screen World, Vol. 29.", "Ranked #24 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Received her Master's degree in Fine Arts from Yale University in New Haven, Connecticut (1975).", "Received her Bachelor's degree cum laude from Vassar College in Poughkeepsie, New York (1971).", "Was romantically involved with actor 'John Cazale' (qv) for two years, culminating with his death at age 42 in 1978 from lung cancer. She is very reluctant to discuss the relationship with anyone. The couple had been sharing a loft at 146 Franklin Street in Manhattan's Tribeca district.", "Attended and graduated from Bernards High School in Bernardsville, New Jersey (1967).", "Before succeeding as an actress, she was a waitress at the Hotel Somerset in Somerville, New Jersey.", "Was a cheerleader and homecoming queen in high school.", "She left her just-claimed Oscar for _Kramer vs. Kramer (1979)_ (qv) on the back of a toilet during the 1979 festivities.", "Replaced 'Madonna' (qv) for the lead role of Roberta Guaspari in _Music of the Heart (1999)_ (qv).", "In 2001, her son, Henry W. Gummer (\"Hank\") was a student at Dartmouth College in New Hampshire.", "Sister-in-law of 'Maeve Kinkead' (qv).", "'Tennessee Williams' (qv) wanted her for a film version of \"A Streetcar Named Desire\" in the 1980s. When Streep proved unavailable, the project was refashioned for television and the role of Blanche given to 'Ann-Margret' (qv).", "Has a deviated septum, which she refuses to have fixed.", "The children's television series _Sesame Street (1969)_ (qv) has featured a character named \"Meryl Sheep\" in her honor.", "Was originally supposed to play the role of Iris Hineman in _Minority Report (2002)_ (qv), but had to back out. She was replaced by 'Lois Smith' (qv).", "Her character 'Karen Silkwood' (qv) from her film _Silkwood (1983)_ (qv) was ranked #47 on the American Film Institute Heroes list of the 100 years of the Greatest Screen Heroes and Villians.", "Presented 'Paul McCartney' (qv) with the 1990 Grammy Lifetime Achievement award. Attended 'The Beatles' (qv) concert at Shea Stadium in 1965 with an \"I love Paul\" sign, which she mentioned when presenting the award to McCartney.", "Older sister of 'Harry Streep' (qv) and 'Dana Streep' (qv).", "Spent a year as a transfer student at Dartmouth College where she participated in theater.", "Originally applied to Law School but slept in on the morning of her interview and took it as a sign she was destined for other things.", "'Sigourney Weaver' (qv) and 'Christine Estabrook' (qv) were fellow classmates at Yale Drama School.", "Back at Yale Drama School, she and 'Sigourney Weaver' (qv) appeared in a play staged in a swimming pool together. The play was called \"The Frogs\".", "May 27, 2004 was proclaimed \"'Meryl Streep' (qv) Day\" by Manhattan Borough President C. Virginia Fields. [May 2004]", "She was voted the 37th Greatest Movie Star of all time by Entertainment Weekly.", "As a young actor, she performed at the Yale Repertory Theater with 'Christopher Lloyd' (qv).", "According to 'Katharine Hepburn' (qv)'s official biographer A. Scott Berg, 'Meryl Streep' (qv) was her least favorite modern actress on screen: \"Click, click, click,\" she said, referring to the wheels turning inside Streep's head.", "Has only been turned down for five roles: Dwan in 'King Kong' (1976), Michelle Straton in _American Gigolo (1980)_ (qv), 'Patsy Cline' (qv) in _Sweet Dreams (1985)_ (qv), Miss Kenton in _The Remains of the Day (1993)_ (qv), and Elizabeth I in _Elizabeth (1998)_ (qv).", "Mentioned by first name only (with two-time co-star 'Jack Nicholson' (qv)) in 'Michael Crichton' (qv)'s novel \"State of Fear\" (2004).", "Nominated for the 1976 Tony Award for Best Actress (Featured Role - Play) in 'Tennessee Williams' (qv)' \"27 Wagons Full of Cotton\".", "Premiere magazine ranked her as #46 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature (2005).", "Took serious singing lessons. At age 12, she studied to become an opera singer.", "Acting career began on the stage.", "Is the second of four consecutive winners of the Best Supporting Actress Oscar to have the initials \"M.S.\". The others are: 'Maggie Smith' (qv) - _California Suite (1978)_ (qv), 'Mary Steenburgen' (qv) - _Melvin and Howard (1980)_ (qv), and 'Maureen Stapleton' (qv) - _Reds (1981)_ (qv).", "Received her honorary degree (Doctor of Arts) from Middlebury College during her nephew's graduation (2004).", "She attended Harding Township Middle School in Harding, New Jersey for one or two years.", "Sold her New York City townhouse for $9.1 million in February 2006. She was forced to slash the asking price for the eight-bedroom Manhattan property from $12 million to secure a sale. Streep bought the house for $2.2 million in 1995, according to the New York Post.", "Early in her career, Streep received a letter from 'Bette Davis' (qv), whom most critics and cinema historians rank as the greatest American movie actress ever. Davis told Streep that she felt that she was her successor as the premier American actress. Davis, a double winner who was nominated 10 times for an Academy Award, all of them Best Actress nods, set the record for most acting nominations with her tenth in 1963 for _What Ever Happened to Baby Jane? (1962)_ (qv), a record later surpassed by 'Katharine Hepburn' (qv) with her 11th nomination (and 3rd win) for _The Lion in Winter (1968)_ (qv). Hepburn extended her record with her 12th nomination (and fourth win) for _On Golden Pond (1981)_ (qv).", "Her performance as Sophie Zawistowska in _Sophie's Choice (1982)_ (qv) is ranked #3 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "Her performance as 'Karen Silkwood' (qv) in _Silkwood (1983)_ (qv) is ranked #71 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "Her husband, 'Don Gummer' (qv), is a sculptor.", "Her father was a drug company exec; her mother, an artist-turned-housewife who kept an art studio behind the house. Her father loved to play the piano and her mother to sing. Meryl was given singing lessons at a young age. Her mother died in 2001 and her father in 2004.", "Son 'Henry Gummer' (qv) is an actor, filmmaker and co-founder of a rock band; daughter Mary Willa, whose stage name is 'Mamie Gummer' (qv), is an off-Broadway actress; daughter 'Grace Gummer' (qv) is an actress; and daughter [error] is a model.", "Friends with 'Jill Clayburgh' (qv). First met in their roles as mothers.", "The longest she has gone without an Oscar nomination is five years, between _Postcards from the Edge (1990)_ (qv) and _The Bridges of Madison County (1995)_ (qv).", "'Robert De Niro' (qv) said she is his favorite actress to work with.", "Was nominated for Best Actress in 1988 along with 'Cher' (qv). When 'Cher' (qv) was announced, just before the cameras cut away from the other four actresses, Streep could be seen springing to her feet in delight and applauding for 'Cher' (qv). During her acceptance speech, 'Cher' (qv) thanked Streep personally (addressing her as Mary Louise Streep), as they had worked together on 'Cher' (qv)'s first film, _Silkwood (1983)_ (qv). As the camera briefly cut away to Streep sitting in the audience, she blew 'Cher' (qv) a kiss.", "She was considered for the role of Evita Peron in _Evita (1996)_ (qv), which went to 'Madonna' (qv).", "Donated her wardrobe from _The Devil Wears Prada (2006)_ (qv) to a charity auction.", "Uses music, most often Classical, to get into character.", "Is a member of the Academy of Motion Picture Arts and Sciences (AMPAS).", "Nominated for a 2007 Drama Desk Award for her performance in \"Mother Courage and Her Children\" (Outstanding Actress in a Play).", "Daughter of 'Mary Streep' (qv) and 'Harry Streep' (qv) (a pharmaceutical executive).", "Her accumulation of 21 Oscar nominations (3 wins) was accomplished over a period of only 38 years. 'Bette Davis' (qv) scored 10 nominations (2 wins) over 28 years (all leading roles). 'Katharine Hepburn' (qv) garnered 12 nominations (4 wins) after a relatively lengthy 48 years (all leading roles).", "Occasionally mistaken for friend 'Glenn Close' (qv), Streep was pregnant with her fourth child while shopping in a Los Angeles baby store where the staff lavished her with huge amounts of baby paraphernalia. Just as she was about to leave they whispered, \"We loved you in _Fatal Attraction (1987)_ (qv)\".", "She was inducted into the inaugural class of 2007 New Jersey Hall of Fame for her services to arts and entertainment.", "She and her daughter 'Mamie Gummer' (qv) portrayed the same role at different ages in _Evening (2007)_ (qv).", "Ranked #6 on Entertainment Weekly magazine's \"The 50 Smartest People in Hollywood (2007).", "Nominated for a 2008 Grammy Award for \"The One and Only Shrek\" (Best Spoken Word Album for Children).", "Has said she is a great fan of actor 'Leonardo DiCaprio' (qv).", "With the announcement of the 66th Annual Golden Globe Award nominations and receiving two nominations, the actress surpassed Jack Lemmon's count of 22 nominations and is now, besides holding the record for most Oscar nominations, the actor with the most Golden Globe nominations of all time with a total of 29 nominations.", "She was close friends with late actress 'Natasha Richardson' (qv).", "She attended 'Natasha Richardson' (qv)'s funeral along with husband 'Don Gummer' (qv).", "Signs cheques with her real name - Mary Louise Gummer.", "She was ranked #87 on 'Ellen DeGeneres' (qv)' most sexy movie actors list (2009).", "Received her honorary degree from Princeton University in Princeton, New Jersey. [June 2009]", "She gained as much as 15 pounds while filming the _Julie & Julia (2009)_ (qv) movie.", "Her fans call themselves \"Streepers\".", "In the stage show \"Fame\", though other actors are mentioned in song lyrics, she is the only actress to have her name in a song title. The song is called \"Think of 'Meryl Streep' (qv)\" and takes place after Carmen kisses Nick when he asks her how she relaxes, and Serena (who wants Nick for herself) sees them.", "Studied acting with Michael Howard in New York City.", "Through the television series _Faces of America with Henry Louis Gates Jr. (2010)_ (qv), she learned that she is a distant relative of director 'Mike Nichols' (qv).", "Resides in New York City and Salisbury, Connecticut.", "She presented the leadership award to ex-Colombian hostage 'Ingrid Betancourt' (qv). [March 2010]", "Landed the breakthrough role of Linda in _The Deer Hunter (1978)_ (qv) after 'Robert De Niro' (qv) had seen her playing Dunyasha in 'Anton Chekhov' (qv)'s \"The 'Cher' (qv)ry Orchard\" at Manhattan's Lincoln Center (1977). Streep had been playing opposite 'Irene Worth' (qv), 'Raul Julia' (qv) and 'Mary Beth Hurt' (qv).", "On her 60th birthday, her husband brought her a toaster and one of her daughters brought her a rocking chair. Despite having to work until late on the day, her children cooked her a birthday meal when she returned.", "Attended 'Emily Blunt' (qv)'s and 'John Krasinski' (qv)'s wedding with her husband, 'Don Gummer' (qv).", "Kept the sunglasses she wore in _The Devil Wears Prada (2006)_ (qv) and used them again during the \"Money Money Money\" sequence in _Mamma Mia! (2008)_ (qv).", "As of 2018, she is the most nominated actress with 21 Academy Award nominations.", "She was awarded the 2010 National Medal of the Arts for her services to drama.", "Recipient of the 2011 Kennedy Center Honors, along with 'Barbara Cook' (qv), 'Neil Diamond' (qv), 'Yo-Yo Ma' (qv) and 'Sonny Rollins' (qv).", "She was considered for the role of Ellen Ripley in _Alien (1979)_ (qv), which went to her good friend 'Sigourney Weaver' (qv).", "Is one of only four thespians to be nominated for acting honors by the Academy of Motion Picture Arts and Sciences over five decades - 1970s, 1980s, 1990s, 2000s, 2010s. Along with Laurence Olivier (1930s-1970s), Paul Newman (1950s, 1960s, 1980s, 1990s, and 2000s) and Katherine Hepburn (1930s, 1940s, 1950s, 1960s, 1980s).", "Referenced in ''Weird Al' Yankovic' (qv)'s song \"Your Horoscope for Today\".", "Claimed to have had a photographic memory when she was younger, which allowed her to memorize her lines after one reading.", "Spokesperson for the Center for Reproductive Rights' Draw the Line campaign. The Center for Reproductive Rights is a global legal organization dedicated to advancing women's reproductive health, self-determination and dignity as basic human rights.", "Gave birth to her first child at age 30, a son Henry Wolfe Gummer (aka 'Henry Gummer' (qv)) on November 13, 1979. Child's father is her husband, 'Don Gummer' (qv).", "Gave birth to her second child at age 34, a daughter Mary Willa Gummer (aka 'Mamie Gummer' (qv)) on August 3, 1983. Child's father is her husband, 'Don Gummer' (qv).", "Gave birth to her third child at age 36, a daughter Grace Jane Gummer (aka 'Grace Gummer' (qv)) on May 9, 1986. Child's father is her husband, 'Don Gummer' (qv).", "Gave birth to her fourth child at age 41, a daughter Louisa Jacobson Gummer on June 12, 1991. Child's father is her husband, 'Don Gummer' (qv).", "In 2013, she presented the Best Actor Oscar to 'Daniel Day-Lewis' (qv) for _Lincoln (2012)_ (qv). The previous year, she had received her third Oscar (second for Best Actress) for _The Iron Lady (2011)_ (qv), and she give Lewis his third Best Actor Oscar. Both won their third Oscar for playing a Head of Government of a different nationality: Streep was an American actress playing a British Prime Minister, while Day-Lewis is a British actor playing an American President. In addition, Day-Lewis was not the only actor playing Abraham Lincoln that year. The role was played in _Abraham Lincoln: Vampire Hunter (2012)_ (qv) by 'Benjamin Walker' (qv), who was married to Streep's daughter 'Mamie Gummer' (qv).", "Was a finalist for the role of Ellen Ripley in _Alien (1979)_ (qv), but the role went to good friend and classmate 'Sigourney Weaver' (qv) instead. However, Streep later got to make her own contribution to the character. Many of the special effects for _Alien³ (1992)_ (qv) were created in England, after the cast; including Weaver; had returned home to the United States. The filmmakers needed a prosthetic cast of Ripley's head for some shots, so rather than call back Weaver, they used an available cast of Streep that had been made for a previous project and was still floating around the studio.", "Her father was of German and Swiss-German descent, and his patrilineal ancestors had originally been surnamed \"Streeb\". Her mother had English, German, Irish, Scots-Irish/Northern Irish, and Scottish, and remote French and Swedish, ancestry, and was descended from early settlers in Pennsylvania. One of Meryl's maternal great-grandmothers, Mary Agnes McFadden, was born in Ireland.", "Acting mentors were 'Jean Arthur' (qv) and 'Joseph Papp' (qv).", "She was awarded Commander of the Order of the Arts and Letters by French culture minister Jean-Jacques Aillagon in 2003.", "She was awarded a Star on the Hollywood Walk of Fame at 7018 Hollywood Boulevard in Hollywood, California on September 16, 1998.", "As of 2017, has appeared in six films that nominated for the Best Picture Oscar: _Julia (1977)_ (qv), _The Deer Hunter (1978)_ (qv), _Kramer vs. Kramer (1979)_ (qv), _Out of Africa (1985)_ (qv), _The Hours (2002)_ (qv) and _The Post (2017)_ (qv). Winners in the category are _The Deer Hunter (1978)_ (qv), _Kramer vs. Kramer (1979)_ (qv) and _Out of Africa (1985)_ (qv).", "Is one of 6 actresses to have been pregnant at the time of winning the Academy Award; the others are 'Eva Marie Saint' (qv), 'Patricia Neal' (qv), 'Catherine Zeta-Jones' (qv), 'Rachel Weisz' (qv) and 'Natalie Portman' (qv). Neal is the only to have not accepted her award in person as a result of her pregnancy. Streep was 5 months pregnant with her daughter 'Mamie Gummer' (qv) when she won the Best Actress Oscar for _Sophie's Choice (1982)_ (qv).", "Was the 82nd actress to receive an Academy Award; she won the Best Supporting Actress Oscar for _Kramer vs. Kramer (1979)_ (qv) at The 52nd Annual Academy 'Awards' (qv) (1980) on April 14, 1980.", "In 2013, 'David Letterman' (qv) revealed that the director 'Harmony Korine' (qv) had been banned from appearing on Letterman's show during the late 1990s when Letterman personally caught Korine rifling through 'Meryl Streep' (qv)'s purse in a dressing room. Streep and Korine had both been scheduled to appear on Letterman's show that night, but only Streep did.", "According to biographer Diana Maychick when companion 'John Cazale' (qv) was too weak to read the newspapers, Streep read the paper to him imitating well-known broadcaster 'Warner Wolf' (qv)'s voice.", "She was awarded the Presidential Medal of Freedom by President 'Barack Obama' (qv) on November 24, 2014.", "'Meryl Streep' (qv) sings in _Silkwood (1983)_ (qv), _Heartburn (1986)_ (qv), and _Postcards from the Edge (1990)_ (qv), all of which were directed by 'Mike Nichols' (qv).", "Donated her entire salary for _The Iron Lady (2011)_ (qv) to the Women's History Museum.", "Is one of 27 actresses to have received an Academy Award nomination for their performance in a musical; hers being _Into the Woods (2014)_ (qv). The others, in chronological order, are: 'Bessie Love' (qv) for _The Broadway Melody (1929)_ (qv), 'Grace Moore' (qv) for _One Night of Love (1934)_ (qv), 'Jean Hagen' (qv) for _Singin' in the Rain (1952)_ (qv), 'Marjorie Rambeau' (qv) for _Torch Song (1953)_ (qv), 'Dorothy Dandridge' (qv) for _Carmen Jones (1954)_ (qv), 'Deborah Kerr' (qv) for _The King and I (1956)_ (qv), 'Rita Moreno' (qv) for _West Side Story (1961)_ (qv), 'Gladys Cooper' (qv) for _My Fair Lady (1964)_ (qv)), 'Julie Andrews' (qv) for _Mary Poppins (1964)_ (qv), _The Sound of Music (1965)_ (qv), and _Victor Victoria (1982)_ (qv), 'Debbie Reynolds' (qv) for _The Unsinkable Molly Brown (1964)_ (qv), 'Peggy Wood' (qv) for _The Sound of Music (1965)_ (qv), 'Carol Channing' (qv) for _Thoroughly Modern Millie (1967)_ (qv), 'Kay Medford' (qv) for _Funny Girl (1968)_ (qv), 'Barbra Streisand' (qv) for _Funny Girl (1968)_ (qv), 'Liza Minnelli' (qv) for _Cabaret (1972)_ (qv), 'Ronee Blakley' (qv) for _Nashville (1975)_ (qv), 'Lily Tomlin' (qv) for _Nashville (1975)_ (qv), 'Ann-Margret' (qv) for _Tommy (1975)_ (qv), 'Lesley Ann Warren' (qv) for _Victor Victoria (1982)_ (qv), 'Amy Irving' (qv) for _Yentl (1983)_ (qv), 'Nicole Kidman' (qv) for _Moulin Rouge! (2001)_ (qv), 'Queen Latifah' (qv) for _Chicago (2002)_ (qv), 'Catherine Zeta-Jones' (qv) for _Chicago (2002)_ (qv), 'Renée Zellweger' (qv) for _Chicago (2002)_ (qv), 'Jennifer Hudson' (qv) for _Dreamgirls (2006)_ (qv), 'Penélope Cruz' (qv) for _Nine (2009)_ (qv), 'Anne Hathaway' (qv) for _Les Misérables (2012)_ (qv), and 'Emma Stone' (qv) for _La La Land (2016)_ (qv).", "Ever since her first Oscar nomination, 66 actresses have been one of her four co-nominees in the same category, spanning an age gap of 81 years (five generations) from 'Katharine Hepburn' (qv) to 'Emma Stone' (qv). Among them, 11 actresses were co-nominated twice: 'Cate Blanchett' (qv), 'Debra Winger' (qv), 'Helen Mirren' (qv), 'Jane Alexander' (qv), 'Jessica Lange' (qv), 'Judi Dench' (qv), 'Julianne Moore' (qv), 'Kate Winslet' (qv), 'Kathy Bates' (qv), 'Sandra Bullock' (qv), and 'Emma Stone' (qv). So far, her greatest rival, with three Oscar co-nominations, is still 'Glenn Close' (qv).", "Her role in _Music of the Heart (1999)_ (qv) is the only performance for which 'Wes Craven' (qv) directed an actor to an Oscar nomination.", "Is one of 13 actresses who won their Best Supporting Actress Oscars in a movie that also won the Best Picture Oscar (she won for _Kramer vs. Kramer (1979)_ (qv)). The others are 'Hattie McDaniel' (qv) for _Gone with the Wind (1939)_ (qv), 'Teresa Wright' (qv) for _Mrs. Miniver (1942)_ (qv), 'Celeste Holm' (qv) for _Gentleman's Agreement (1947)_ (qv), 'Mercedes McCambridge' (qv) for _All the King's Men (1949)_ (qv), 'Donna Reed' (qv) for _From Here to Eternity (1953)_ (qv), 'Eva Marie Saint' (qv) for _On the Waterfront (1954)_ (qv), 'Rita Moreno' (qv) for _West Side Story (1961)_ (qv), 'Juliette Binoche' (qv) for _The English Patient (1996)_ (qv), 'Judi Dench' (qv) for _Shakespeare in Love (1998)_ (qv), 'Jennifer Connelly' (qv) for _A Beautiful Mind (2001)_ (qv), 'Catherine Zeta-Jones' (qv) for _Chicago (2002)_ (qv) and 'Lupita Nyong'o' (qv) for _12 Years a Slave (2013)_ (qv).", "She won an Oscar for playing 'Margaret Thatcher' (qv) in _The Iron Lady (2011)_ (qv), making her one of 18 actors to win the Award for playing a real person who was still alive at the evening of the Award ceremony (as of 2015). The other sixteen actors and their respective performances are: 'Spencer Tracy' (qv) for playing Father Edward Flanagan in _Boys Town (1938)_ (qv), 'Gary Cooper' (qv) for playing Alvin C. York in _Sergeant York (1941)_ (qv), 'Patty Duke' (qv) for playing Helen Keller in _The Miracle Worker (1962)_ (qv), 'Jason Robards' (qv) for playing Ben Bradlee in _All the President's Men (1976)_ (qv), 'Robert De Niro' (qv) for playing Jake La Motta in _Raging Bull (1980)_ (qv), 'Sissy Spacek' (qv) for playing Loretta Lynn in _Coal Miner's Daughter (1980)_ (qv), 'Jeremy Irons' (qv) for playing Claus Von Bullow in _Reversal of Fortune (1990)_ (qv), 'Susan Sarandon' (qv) for playing Sister Helen Prejean in _Dead Man Walking (1995)_ (qv), 'Geoffrey Rush' (qv) for playing David Helfgott in _Shine (1996)_ (qv), 'Julia Roberts' (qv) for playing Erin Brockovich in _Erin Brockovich (2000)_ (qv), 'Jennifer Connelly' (qv) for playing Alicia Nash in _A Beautiful Mind (2001)_ (qv), 'Jim Broadbent' (qv) for playing John Bayley in _Iris (2001)_ (qv), 'Helen Mirren' (qv) for playing Queen Elizabeth II in _The Queen (2006)_ (qv), 'Sandra Bullock' (qv) for playing Leigh Anne Tuohy in _The Blind Side (2009)_ (qv), 'Melissa Leo' (qv) for playing Alice Eklund-Ward in _The Fighter (2010)_ (qv), 'Christian Bale' (qv) for playing Dickie Eklund in _The Fighter (2010)_ (qv) and 'Eddie Redmayne' (qv) for playing Stephen Hawking in _The Theory of Everything (2014)_ (qv).", "President of the 'Official Competition' jury at the 66th Berlin International Film Festival in 2016.", "Her daughter, 'Grace Gummer' (qv), stars as 'Nora Ephron' (qv) in _Good Girls Revolt (2015)_ (qv). Streep starred in three films written by Ephron: _Silkwood (1983)_ (qv), _Heartburn (1986)_ (qv) and _Julie & Julia (2009)_ (qv).", "Campaigned for 'Hillary Clinton' (qv) in the 2016 Presidential Election.", "She played a character based on 'Carrie Fisher' (qv) in _Postcards from the Edge (1990)_ (qv), and then became godmother to Fisher's real-life daughter, 'Billie Lourd' (qv).", "She presented director 'Mike Nichols' (qv) his AFI Lifetime Achievement Award in 2010.", "Is one of 17 actresses to have received a Best Actress Oscar nomination for a performance where they acted out a labor and/or birth; hers being for _A Cry in the Dark (1988)_ (qv). The others in chronological order are 'Luise Rainer' (qv) for _The Good Earth (1937)_ (qv), 'Jane Wyman' (qv) for _Johnny Belinda (1948)_ (qv), 'Eleanor Parker' (qv) for _Caged (1950)_ (qv), 'Elizabeth Taylor' (qv) for _Raintree County (1957)_ (qv), 'Leslie Caron' (qv) for _The L-Shaped Room (1962)_ (qv), 'Shirley MacLaine' (qv) for _Irma la Douce (1963)_ (qv), 'Vanessa Redgrave' (qv) for _Isadora (1968)_ (qv), 'Geneviève Bujold' (qv) for _Anne of the Thousand Days (1969)_ (qv), 'Marsha Mason' (qv) for _Cinderella Liberty (1973)_ (qv), 'Ann-Margret' (qv) for _Tommy (1975)_ (qv), 'Ellen Burstyn' (qv) for _Same Time, Next Year (1978)_ (qv), 'Jessica Lange' (qv) for _Sweet Dreams (1985)_ (qv), 'Samantha Morton' (qv) for _In America (2002)_ (qv), 'Ellen Page' (qv) for _Juno (2007)_ (qv), 'Gabourey Sidibe' (qv) for _Precious (2009)_ (qv), and 'Ruth Negga' (qv) for _Loving (2016)_ (qv).", "She is one of only 4 actors to have been Oscar nominated for a performance in a film from Walt Disney Pictures, for _Into the Woods (2014)_ (qv). The only other actors to have achieved this feat are 'Julie Andrews' (qv), 'Richard Farnsworth' (qv), and 'Johnny Depp' (qv).", "She has worked with 10 directors who have won a Best Director Oscar: 'Fred Zinnemann' (qv), 'Michael Cimino' (qv), 'Woody Allen' (qv), 'Robert Benton' (qv), 'Mike Nichols' (qv), 'Sydney Pollack' (qv), 'Robert Zemeckis' (qv), 'Jonathan Demme' (qv), 'Robert Redford' (qv), and 'Steven Spielberg' (qv).", "Friends with 'Diane Keaton' (qv) and 'Viola Davis' (qv).", "Gives an Oscar nominated performance each time she appears in a film which won the Academy Award for Best Picture. She was nominated for Best Supporting Actress for _The Deer Hunter (1978)_ (qv), won Best Supporting Actress for _Kramer vs. Kramer (1979)_ (qv) and was nominated for Best Actress for _Out of Africa (1985)_ (qv).", "Born on the same date as 'Lindsay Wagner' (qv), of _The Bionic Woman (1976)_ (qv) fame.", "Was not pregnant with her son 'Henry Gummer' (qv) despite many reports to the contrary whilst filming _Kramer vs. Kramer (1979)_ (qv) as production on the film ended in December 1978 and Streep did not fall pregnant until February 1979.", "Returned to work six months after giving birth to her son 'Henry Gummer' (qv) to begin filming _The French Lieutenant's Woman (1981)_ (qv).", "Returned to work nine months after giving birth to her daughter 'Grace Gummer' (qv) to begin filming _Ironweed (1987)_ (qv).", "Was two months pregnant with her daughter 'Grace Gummer' (qv) when she completed filming on _Heartburn (1986)_ (qv).", "Returned to work seven months after giving birth to her daughter 'Mamie Gummer' (qv) to begin filming _Falling in Love (1984)_ (qv).", "Returned to work six months after giving birth to her daughter Louisa to begin filming _Death Becomes Her (1992)_ (qv).", "She has appeared in two films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _The Deer Hunter (1978)_ (qv) and _Manhattan (1979)_ (qv).", "She and American Senator 'Elizabeth Warren' (qv) were born on the same day (June 22, 1949)."], "quotes": ["[_Entertainment Tonight (1981)_ (qv)] I had it (smoking), it stinks.", "[1978] I'm looking forward to bigger parts in the future, but I'm not doing soft-core scripts where the character emerges in half-light, half-dressed.", "[on her Lifetime Achievement Award from the AFI] I don't want to spit in the eye of good fortune, but it was weird. I felt like I'd butted in line in front of 'Lucille Ball' (qv), 'Audrey Hepburn' (qv), 'Katharine Hepburn' (qv). Hello? How did this happen? I was only the sixth woman to receive it, but they found 26 men to give it to. I thought that was embarrassing.", "[on her view of acting back in college] I thought it was really fun, you've got to understand, but I didn't think it was a serious way to conduct your life. You know, I had a sense of mission. I was a true child of the '60s.", "I love doing comedy, but people just don't give me enough of a chance. It's one of the reasons I enjoy _The Manchurian Candidate (2004)_ (qv) so much. It's because I actually get a chance to be funny.", "Let's face it, we were all once 3-year-olds who stood in the middle of the living room and everybody thought we were so adorable. Only some of us grow up and get paid for it.", "[accepting an Emmy Award for _Angels in America (2003)_ (qv)] You know, there are some days when I myself think I'm overrated, but not today.", "Someone once said that sometimes studio heads don't want to cast films with the image of their first wife in the role. It's just rather unpleasant for them. So they like the idea of the new one.", "[on her role in _The Manchurian Candidate (2004)_ (qv)] I loved being someone so certain. Because certainty is just so attractive in people. To me, it's a completely bogus position - for me. Because, you know, I'm listening to every side. But it's so nice not to have to listen to all the different sides. To be so clear and on your track and sure. It's a fabulous thing. Unfortunately, it leads to fanaticism.", "I think I was wired for family. You know how they say people are wired for religion, or wired for this or that? I always knew I would like to, if I could find the right person, have a family. I can't imagine living single.", "I get nervous calling myself an artist. I feel I'm more like an interpreter or a violinist, you know.", "[on winning the 1983 Best Actress Oscar for _Sophie's Choice (1982)_ (qv)] Oh boy, no matter how much you try to imagine what this is like, it's just so incredibly thrilling right down your toes.", "But ... in my own experience of male and female directors, people have a much, much harder time taking a direct command from a woman. It's somehow very difficult for people.", "I mean, come on; when you have people writing these things, that you're the greatest thing that ever ate scenery, you're dead. You're fucking dead. How can you even presume to begin a new character? It's a killer.", "It's a lesson I learned in drama school: the teacher asks, how do you be the queen? And everybody says, \"Oh it's about posture and authority.\" And they said, no, it's about how the air in the room shifts when you walk in. And that's everyone else's work.", "I really, really depend on the other actors for the confirmation of who I think I am,\" she says. \"And so it's important to me to work with good people that are not worried about how they look. You know. Real actors. They're your blood.", "[part of her Emmy Award acceptance speech for _Angels in America (2003)_ (qv)] 'Glenn Close' (qv) is my friend so I know she'll forgive me, 'Helen Mirren' (qv) is an acting god, and no one has put a better performance on film than 'Judy Davis' (qv) in _Life with Judy Garland: Me and My Shadows (2001)_ (qv). The only one in the group is 'Emma Thompson' (qv), who will hold a grudge for the rest of her life. But who cares?", "[2007, accepting the Golden Globe Award for Best Actress in a Comedy or Musical] I think I've worked with everyone in the room! I have!", "[on her struggles as an actress earlier in her career] It's hard to negotiate the present landscape with a brain and a female body.", "[on winning a Golden Globe Award for _Adaptation. (2002)_ (qv)]. I've been nominated 789 times and I was getting settled over there for a long winter's nap... I didn't have anything prepared because it's been since the Pleistocene Era that I won anything.", "It would be nice to have a woman President. I think half the Senate should be women, half of Parliament, half the ruling mullahs. But that will never happen, darling!", "[on 'Dustin Hoffman' (qv)] He's energized and the greatest combination of the generous and the selfish that ever lived. He wants to be the greatest actor who ever was.", "I try to lead as ordinary a life as I can. You can't get spoiled if you do your own ironing.", "I don't know what I'd do without my husband. I'd be dead, emotionally at least, if I hadn't met him. He's the greatest.", "Listening is everything. Listening is the whole deal. That's what I think. And I mean that in terms of before you work, after you work, in between work, with your children, with your husband, with your friends, with your mother, with your father. It's everything. And it's where you learn everything.", "[on her marriage] There's no road map on how to raise a family: it's always an enormous negotiation. But I have a holistic need to work and to have huge ties of love in my life. I can't imagine eschewing one for the other.", "[on life as a young actress] When I was 20 I busked to afford accommodation. One night I hadn't earned enough, I actually slept in the open in Green Park [in London]. The view was of the Ritz Hotel and I vowed I'd stay there one day. And I have.", "I hate the [Oscar] campaigning thing. It's unseemly. You should be honored for something. It shouldn't be for whose campaign was better.", "[on her appearance] My daughters had helped me to stop worrying about my appearance over the years. I wasted so many years thinking I wasn't pretty enough and why didn't I have 'Jessica Lange' (qv)'s body or someone else's legs? What a waste of time. (February 2009)", "[2009] I've been nominated for an Oscar 15 times and won twice, but it still feels like it's happening to someone else. I wish I could feel it more.", "[on 'Natasha Richardson' (qv)'s tragic death] Tash was the warm sun in the center of a large constellation of family, friends, all of those lucky enough to know her - she is irreplaceable in our lives; she gave us so much, so generously - her legacy is the love that connects us all.", "If you've been married for a long time, you love without looking.", "My greatest culinary triumph was when I was falling in love with my husband. We were on the coast of Maine in a cabin and I made an apple pie... just whipped it up, without a recipe or anything... just the perfect pastry. I've never been able to do it again - and he asks for it often!", "Turning 60 was important to everyone else. It was a big number, to me it was, 'Well yeah, that comes after 59', and I don't even want to look it in the eye.", "[on portraying 'Margaret Thatcher' (qv) in _The Iron Lady (2011)_ (qv)] The prospect of exploring the swathe cut through history by this remarkable woman is a daunting and exciting challenge. I am trying to approach the role with as much zeal, fervor and attention to detail as the real Lady Thatcher possesses - I can only hope my stamina will begin to approach her own.", "[1994, on if she's bothered when one of her films don't do well at the box-office] I'm horribly disappointed when people don't see what I consider some of my best work. Yeah, I'm very sad. But I know that I have a video life. Most of my fans are home with their children waiting for my films to come out on video. But I'm disappointed because certain things should be seen on the big screen. I was very proud of _A Cry in the Dark (1988)_ (qv), but it wasn't distributed widely enough for people to have seen it on the big screen.", "[1994, on career choices] What affects your career choices are the three interesting scripts you get in a year, two of which you're wrong for, one you think you might want to do if you're real lucky. You can't possibly plot what's going to be available, what's going to be written, who's going to think of it, and if it will come to you or not.", "[2008] One of the most important keys to acting is curiosity. I am curious to the point of being nosy. What that means is you want to devour lives. You're eager to put on their shoes and wear their clothes and have them become a part of you. All people contain mystery, and when you act, you want to plumb that mystery until everything is known to you.", "[on _The Iron Lady (2011)_ (qv)] It was one of those rare, rare films where I was grateful to be an actor and grateful for the privilege of being able to look at a life deeply with empathy.", "It took a lot out of me, but it was a privilege to play her ('Margaret Thatcher' (qv)), it really was. I still don't agree with a lot of her policies. But I feel she believed in them and that they came from an honest conviction, and that she wasn't a cosmetic politician just changing make-up to suit the times.", "[on 'Margaret Thatcher' (qv)] We on the Left didn't like her policies but secretly we were thrilled that a woman had made it, and we thought, \"Wow, if it can happen there in England, it could happen here.\" But we're still waiting in America.", "[on 'Margaret Thatcher' (qv)] She's still an incredibly divisive figure, but you miss her clarity today. It was all very clear and up front, and I loved that eagerness to mix it up and to make it about ideas. Today it's all about feelings. You know, \"How do I come off?\" and, \"Does this seem OK?\" You want people who are willing to find a solution. I admire the fact that she was a \"love-me-or-hate-me\" kind of leader who said: \"This is what I stand for.\" It's a hard thing to do and no one's doing that now.", "[on what appealed to her about playing 'Margaret Thatcher' (qv)] Women and power, and diminishment of power, and loss of power. And reconciliation with your life where you come to a point where you've lived most of it, and it's behind you. I have always liked and been intrigued by older people and the idea that behind them lives every human trauma, drama, glory, jokes, love.", "[on 'Margaret Thatcher' (qv)] I consider all the roles I play a privilege but this one was special because there are such vehement opinions about her. People seemed to look at her as an icon or a monster and I just wanted to locate the human being inside those caricatures that we've seen over so many years. And to investigate myself what it must have been like for her.", "[responding to those who have criticized the emphasis placed on 'Margaret Thatcher' (qv)'s frail and confused old age] Some people have said it's shameful to portray this part of a life. But the corollary of that is that, if you think that debility, delicacy, dementia are shameful, if you think that the ebbing of a life is something that should be shut away, if you think that people need to be defended from these images then - yes - then you'll think it's a shameful thing.", "I was never engaged to 'John Cazale' (qv). We lived together for three years until he died of bone cancer.", "[on avoiding cosmetic surgery] I really understand the chagrin that accompanies aging, especially for a woman, but I think people look funny when they freeze their faces. In Los Angeles there's a lot of that. I pick up on the part that doesn't move on a face. I'm immediately drawn to it and that is the opposite of what you're intending. You pull focus on the area that's been worked on.", "I gotta thank everybody in England that let me come and trample over their history.", "[on her college life] A kid who had read only seven books in high school and was now face-to-face with class valedictorians and full time intellectuals, girls whose idea of a Saturday night was an extra chunk of free time to conduct a biology experiment.", "I'm curious about other people. That's the essence of my acting. I'm interested in what it would be like to be you.", "[her Cecil B. DeMille Award acceptance speech] Please sit down. Thank you. I love you all. You'll have to forgive me. I've lost my voice in screaming and lamentation this weekend. And I have lost my mind sometime earlier this year, so I have to read. Thank you, Hollywood Foreign Press. Just to pick up on what Hugh Laurie said: You and all of us in this room really belong to the most vilified segments in American society right now. Think about it: Hollywood, foreigners and the press. But who are we, and what is Hollywood anyway? It's just a bunch of people from other places. I was born and raised and educated in the public schools of New Jersey. Viola was born in a sharecropper's cabin in South Carolina, came up in Central Falls, Rhode Island; Sarah Paulson was born in Florida, raised by a single mom in Brooklyn. Sarah Jessica Parker was one of seven or eight kids in Ohio. Amy Adams was born in Vicenza, Italy. And 'Natalie Portman' (qv) was born in Jerusalem. Where are their birth certificates? And the beautiful 'Ruth Negga' (qv) was born in Addis Ababa, Ethiopia, raised in London no, in Ireland I do believe, and she's here nominated for playing a girl in small-town from Virginia. Ryan Gosling, like all of the nicest people, is Canadian, and Dev Patel was born in Kenya, raised in London, and is here playing an Indian raised in Tasmania. So, Hollywood is crawling with outsiders and foreigners. And if we kick them all out you'll have nothing to watch but football and mixed martial arts, which are not the arts. They gave me three seconds to say this, so: An actor's only job is to enter the lives of people who are different from us, and let you feel what that feels like. And there were many, many, many powerful performances this year that did exactly that. Breathtaking, compassionate work. But there was one performance this year that stunned me. It sank its hooks in my heart. Not because it was good; there was nothing good about it. But it was effective and it did its job. It made its intended audience laugh, and show their teeth. It was that moment when the person asking to sit in the most respected seat in our country imitated a disabled reporter. Someone he outranked in privilege, power and the capacity to fight back. It kind of broke my heart when I saw it, and I still can't get it out of my head, because it wasn't in a movie. It was real life. And this instinct to humiliate, when it's modeled by someone in the public platform, by someone powerful, it filters down into everybody's life, because it kinda gives permission for other people to do the same thing. Disrespect invites disrespect, violence incites violence. And when the powerful use their position to bully others we all lose. Okay, this brings me to the press. We need the principled press to hold power to account, to call him on the carpet for every outrage. That's why our founders enshrined the press and its freedoms in our Constitution. So, I only ask the famously well-heeled Hollywood Foreign Press and all of us in our community to join me in supporting the Committee to Protect Journalists, because we're gonna need them going forward, and they'll need us to safeguard the truth. One more thing: Once, when I was standing around on the set one day, whining about something - you know we were gonna work through supper or the long hours or whatever, Tommy Lee Jones said to me, \"Isn't it such a privilege, Meryl, just to be an actor?\" Yeah, it is, and we have to remind each other of the privilege and the responsibility of the act of empathy. We should all be proud of the work Hollywood honors here tonight. As my friend, the dear departed Princess Leia, said to me once, take your broken heart, make it into art.", "The formula of happiness and success is just being actually yourself, in the most vivid possible way you can.", "[on 'Viola Davis' (qv)] When you spend your life embodying other lives, if you're successful, the one that belongs to you can silently slip behind. But 'Viola Davis' (qv)' hard-won, midlife rise to the very top of her profession has not led her to forget the rough trip she took getting there. And that is why she embodies for all women, but especially for women of color, the high-wire rewards of hard work and a dream, risk and faith...Her gifts as an artist are unassailable, undeniable, deep and rich and true. But her importance in the culture - her ability to identify it, her willingness to speak about it and take responsibility for it - is what marks her for greatness.", "[her released statement after 'Harvey Weinstein' (qv) was fired by the board of The Weinstein Company] The disgraceful news about 'Harvey Weinstein' (qv) has appalled those of us whose work he championed, and those whose good and worthy causes he supported. The intrepid women who raised their voices to expose this abuse are our heroes. One thing can be clarified. Not everybody knew. Harvey supported the work fiercely, was exasperating but respectful with me in our working relationship, and with many others with whom he worked professionally. I didn't know about these other offenses: I did not know about his financial settlements with actresses and colleagues; I did not know about his having meetings in his hotel room, his bathroom, or other inappropriate, coercive acts. And If everybody knew, I don't believe that all the investigative reporters in the entertainment and the hard news media would have neglected for decades to write about it. The behavior is inexcusable, but the abuse of power familiar. Each brave voice that is raised, heard and credited by our watchdog media will ultimately change the game. (Oct. 9th, 2017)", "[on _A Star Is Born (2018)_ (qv)] It's so breezily shot. It's not actor shot. [Some] actors who direct give the actors too much air. They don't cut as brutally as you need to in order to move the story. To them, the character is more interesting than the forward movement of the narrative. But Bradley 'Bradley Cooper' (qv) kept it moving. [It's] brilliant. [2018]"], "salary history": ["_The Deer Hunter (1978)_ (qv)::$35,000", "_Kramer vs. Kramer (1979)_ (qv)::$75,000", "_The French Lieutenant's Woman (1981)_ (qv)::$350,000", "_Sophie's Choice (1982)_ (qv)::$750,000", "_Falling in Love (1984)_ (qv)::$2,000,000", "_Out of Africa (1985)_ (qv)::$3,000,000", "_Postcards from the Edge (1990)_ (qv)::$4,000,000", "_Death Becomes Her (1992)_ (qv)::$4,000,000 + % of the profit", "_The River Wild (1994)_ (qv)::$5,000,000", "_The Bridges of Madison County (1995)_ (qv)::$4,500,000 + percentage of the gross", "_The Devil Wears Prada (2006)_ (qv)::$5,000,000", "_Rendition (2007)_ (qv)::$1,000,000", "_Julie & Julia (2009)_ (qv)::$5,000,000 + first-dollar gross %", "_It's Complicated (2009)_ (qv)::$7,500,000", "_The Iron Lady (2011)_ (qv)::% of gross (original $1,000,000 donated to NWHM)", "_Into the Woods (2014)_ (qv)::$1,500,000", "_Ricki and the Flash (2015)_ (qv)::$5,000,000"], "birth date": "1949-06-22", "birth notes": "Summit, New Jersey, USA", "_actorID": "67", "_source": "IMDB", "actorID": "0000658", "created_utc_dt": "09/14/2019, 13:02:14"}