{"headshot": "https://m.media-amazon.com/images/M/MV5BNDY0ODYwNDM3OV5BMl5BanBnXkFtZTcwMTc3NjQzMg@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Stephen Glenn Martin", "height": "5' 11½\" (1.82 m)", "mini biography": ["'Steve Martin' (qv) was born on August 14, 1945 in Waco, Texas, USA as Stephen Glenn Martin to Mary Lee (née Stewart; 1913-2002) and Glenn Vernon Martin (1914-1997), a real estate salesman and aspiring actor. He was raised in Inglewood and Garden Grove in California. In 1960, he got a job at the Magic shop of Disney's Fantasyland, and while there he learned magic, juggling, and creating balloon animals. At Santa Ana College, he took classes in drama and English poetry. He also took part in comedies and other productions at the Bird Cage Theatre, and joined a comedy troupe at Knott's Berry Farm. He attended California State University as a philosophy major, but in 1967 transferred to UCLA as a theatre major.His writing career began on _The Smothers Brothers Comedy Hour (1967)_ (qv), winning him an Emmy Award. Between 1967 and 1973, he also wrote for many other shows, including _The Glen Campbell Goodtime Hour (1969)_ (qv) and _The Sonny and Cher Comedy Hour (1971)_ (qv). He also appeared on talk shows and comedy shows in the late 1960s and early 1970s. In 1972, he first appeared on _The Tonight Show Starring Johnny Carson (1962)_ (qv), doing stand-up several times each year, and even guest hosting a few years later. In 1976, he served for the first time as guest-host on _Saturday Night Live (1975)_ (qv). By 2016, he has guest-hosted 15 times, which is one less than 'Alec Baldwin' (qv)'s record, and also appeared 12 other times on SNL.In 1977, he released his first comedy album, a platinum selling \"Let's Get Small\". He followed it with \"A Wild and Crazy Guy\" (1978), which sold more than a million copies. Both albums went on to win Grammys for Best Comedy Recording. This is when he performed in arenas in front of tens of thousands of people, and begun his movie career, which was always his goal. His first major role was in the short film, _The Absent-Minded Waiter (1977)_ (qv), which he also wrote. His star value was established in _The Jerk (1979)_ (qv), which was co-written by Martin, and directed by 'Carl Reiner' (qv). The film earned more than $100 million on a $4 million budget. He also starred in _Dead Men Don't Wear Plaid (1982)_ (qv), _The Man with Two Brains (1983)_ (qv), and _All of Me (1984)_ (qv), all directed by Reiner. To avoid being typecast as a comedian, he wanted do more dramatic roles, starring in _Pennies from Heaven (1981)_ (qv), a film remake of 'Dennis Potter' (qv)'s 1978 series. Unfortunately, it was a financial failure.He also starred in 'John Landis' (qv)'s _¡Three Amigos! (1986)_ (qv), co-written by himself, opposite 'Martin Short' (qv) and 'Chevy Chase' (qv). That year, he also appeared in the musical horror comedy, _Little Shop of Horrors (1986)_ (qv) opposite 'Rick Moranis' (qv). Next year, he starred in _Roxanne (1987)_ (qv), co-written by himself, and in 'John Hughes' (qv)' _Planes, Trains & Automobiles (1987)_ (qv), opposite 'John Candy' (qv). His other films include _Parenthood (1989)_ (qv) and _My Blue Heaven (1990)_ (qv), both opposite Moranis. In 1991, he wrote and starred in _L.A. Story (1991)_ (qv), about a weatherman who searches meaning in his life and love in Los Angeles. It also starred his then-wife, 'Victoria Tennant' (qv). Same year, _Father of the Bride (1991)_ (qv) was so successful that a 1995 sequel followed.During the 1990s, he continued to play more dramatic roles, in _Grand Canyon (1991)_ (qv), playing a traumatized movie producer, in _Leap of Faith (1992)_ (qv), playing a fake faith healer, in _A Simple Twist of Fate (1994)_ (qv), playing a betrayed man adopting a baby, and in 'David Mamet' (qv)'s thriller _The Spanish Prisoner (1997)_ (qv). Other, more comedic roles include in _HouseSitter (1992)_ (qv) and _The Out-of-Towners (1999)_ (qv), opposite 'Goldie Hawn' (qv), in 'Nora Ephron' (qv)'s _Mixed Nuts (1994)_ (qv), and in _Bowfinger (1999)_ (qv), written by himself and co-starring 'Eddie Murphy' (qv). After Bowfinger, he starred in _Bringing Down the House (2003)_ (qv) and _Cheaper by the Dozen (2003)_ (qv), both earning more than $130 million. He wrote and starred in _Shopgirl (2005)_ (qv), and appeared in the sequel of Cheaper by the Dozen. After them, he appeared in _The Pink Panther (2006)_ (qv) and _The Pink Panther 2 (2009)_ (qv), which he both co-wrote, as Inspector Clouseau.He continues to do movies, more recently appearing in _The Big Year (2011)_ (qv), _Home (2015)_ (qv), and _Love the Coopers (2015)_ (qv). Besides aforementioned, he has been an avid art collector since 1968, written plays, written for The New Yorker, written a well-received memoir (Born Standing Up), written a novel (An Object of Beauty; 2010), hosted the Academy 'Awards' (qv) three times, released a Grammy award winning music album (The Crow: New Songs for the 5-String Banjo; 2009), and another album (Love Has Come For You; 2013) with 'Edie Brickell' (qv). Since 2007, he has been married to Anne Stringfield, with whom he has a daughter.::imoth"], "spouse": ["Anne Stringfield::(28 July 2007 - present) ( 1 child)", "'Victoria Tennant' (qv)::(20 November 1986 - 1994) ( divorced)"], "trade mark": ["Wearing \"arrow-through-head\" prop", "Frequently plays fathers", "White suit", "[During his stand-up comedy days] would sarcastically say, \"Well, excuse ME!\" or comedically gyrate with, \"Who-oh-oh-oh-oh!\"", "Prematurely white hair"], "trivia": ["He is an accomplished banjo player and appears playing the instrument in 'Earl Scruggs' (qv) and Friends video for \"Foggy Mountain Breakdown,\" for which he won a Grammy for Best Country Instrumental Performance. This makes him rare in that he has won Grammies for both comedy and music.", "'Stanley Kubrick' (qv) liked his work in _The Jerk (1979)_ (qv) and once considered having him play Bill Harford in _Eyes Wide Shut (1999)_ (qv); the role that later went to 'Tom Cruise' (qv).", "He is a trustee of the Los Angeles Museum of Art, and collects the art of 'Georgia O'Keeffe' (qv), Richard Diebenkorn, 'Willem de Kooning' (qv), 'Franz Kline' (qv), Cy Twombly, 'Helen Frankenthaler' (qv), 'Edward Hopper' (qv), 'David Hockney' (qv), 'Roy Lichtenstein' (qv), and 'Pablo Picasso' (qv).", "He is in the horn section of 'B.B. King' (qv)'s \"In The Midnight Hour\" music video.", "He studied philosophy at California State University at Long Beach, and for a while, considered becoming a philosophy professor instead of an actor-comedian. He periodically spoofed his philosophy studies in his 1970s stand-up act, such as comparing Philosophy with studying Geology: \"If you're studying Geology, which is all facts, as soon as you get out of school you forget it all, but Philosophy you remember just enough to screw you up for the rest of your life.\".", "He once had a job at Disneyland in the Magic Shop on Main Street, USA. He also worked for neighboring amusement park Knott's Berry Farm as a comedian in their \"Birdcage Theatre\". It was during these jobs that he honed his skills in live performance, such as improv comedy, banjo playing, juggling, and lassoing. It was at Knott's Berry Farm where he met his friend, 'Stormie Omartian' (qv).", "He graduated from Garden Grove High School in 1963. He attended Rancho Alamitos High School in the beginning of his high school career, but then high school attendance areas were changed, and he had to start going to Garden Grove. He was also a cheerleader at Rancho and often did his King Tut dance.", "Contrary to popular belief, Martin was never a cast member on NBC's _Saturday Night Live (1975)_ (qv). However, he holds the records for guest appearances (25) on the show (followed closely by 'Buck Henry' (qv)), hosting (at 15 times, he sets the standard for the SNL \"Five Timers Club\"), and hosting in a single season (3). He is also the only person to have hosted a season premiere, a season finale, and a Christmas show. He was also scheduled to host for the ill-fated 1980-1981 season, but a writers strike prevented this.", "He is a fan of _Monty Python's Flying Circus (1969)_ (qv). This led to him becoming the host and narrator of the documentary _Parrot Sketch Not Included: Twenty Years of Monty Python (1989)_ (qv).", "His study of philosophy was a source of much of his material for his 1970s standup act.", "In 2003: Was listed as #50 in People Magazine's \"50 Most Beautiful People\" List.", "He played the banjo in his guest appearance on the _The Muppet Show (1976)_ (qv).", "He was voted Most Talented by his classmates at Garden Grove high school.", "He was chosen as #6 in Comedy Central's 100 Greatest Stand-Ups of All Time.", "He is skilled with a rope or lasso and did his own rope work in _¡Three Amigos! (1986)_ (qv). He also plays the harmonica.", "At his insistence, the 1987-1988 season premiere of _Saturday Night Live (1975)_ (qv) (hosted by Martin) went on, despite the fact that there hadn't been a dress rehearsal. There was a fire in a nearby studio and the cast and crew were evacuated from Rockefeller Center just before dress rehearsal was scheduled to begin.", "He was listed as a potential nominee on both the 2004 and 2007 Razzie Award nominating ballots. He was listed as a suggestion in the Worst Actor category for the films _Bringing Down the House (2003)_ (qv) and _Cheaper by the Dozen (2003)_ (qv), and in the Worst Supporting Actor category for his role in _Looney Tunes: Back in Action (2003)_ (qv) on the 2004 ballot. He was suggested again three years later in the Worst Actor category on the 2007 ballot for his performance in _The Pink Panther (2006)_ (qv), but he failed to receive any one of these nominations. He later ended up receiving his first Razzie nomination for _The Pink Panther 2 (2009)_ (qv).", "He attended Lampson Intermediate School (now Ralston Intermediate) in Garden Grove, California.", "In 2005: Recipient of the 8th annual 'Mark Twain' (qv) Prize for American Humor, awarded by the Kennedy Center for the Performing Arts.", "He has worked with actor 'Eugene Levy' (qv) on four different films, _Father of the Bride (1991)_ (qv), _Father of the Bride Part II (1995)_ (qv), _Bringing Down the House (2003)_ (qv) and _Cheaper by the Dozen 2 (2005)_ (qv).", "His performance as \"Navin Johnson\" in _The Jerk (1979)_ (qv) was ranked #99 among Premiere Magazine's list of the 100 Greatest Film Performances of All Time (2006).", "He was considered for the role of \"Willy Wonka\" in the movie _Charlie and the Chocolate Factory (2005)_ (qv).", "Some sources state he is a fan of the BBC science fiction series _Doctor Who (1963)_ (qv). However, in a 2013 interview in the UK's \"Uncut\" magazine, he revealed this was not true, he knows nothing about it and he believed it had started as a false claim by someone on the internet.", "His performance as \"Navin Johnson\" in _The Jerk (1979)_ (qv) is ranked #66 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "He says his favorite movie of his own is _Planes, Trains & Automobiles (1987)_ (qv).", "In November 2005: A production of his play \"The Underpants\" was directed by Brian Barney for Bruka Theatre, Reno, NV.", "He is a member of Mensa, as are 'James Woods' (qv), 'Ben Rollins' (qv).", "Like ''Weird Al' Yankovic' (qv), he did a satire sketch of 'Michael Jackson' (qv)'s \"Billie Jean\" music video on _The Tonight Show Starring Johnny Carson (1962)_ (qv).", "He was on an episode of _The Dating Game (1965)_ (qv) before he was famous in 1966. He won a date with an old friend named Marscha Walker, whom he had not seen in three years. He appeared on the show again the next year and won again. He wore the same shirt and jacket.", "He lists British television (especially the comedies) as his biggest influence.", "He fell into depression for a couple of months when his good friend 'John Candy' (qv) died.", "He is a fan of the animated series _Dave the Barbarian (2004)_ (qv).", "He went to the same college--Cal State Long Beach--as 'Frank Miranda' (qv).", "After inviting friends including 'Tom Hanks' (qv), 'Diane Keaton' (qv) and 'Eugene Levy' (qv) to a dinner party, he married his longtime girlfriend Anne Stringfield in a surprise ceremony at their Los Angeles home.", "His wife is a writer for The New Yorker.", "2007: Best man during his wedding to Anne Stringfield was 'Lorne Michaels' (qv), creator of _Saturday Night Live (1975)_ (qv).", "He wore his Inspector Clouseau mustache during his 2007 wedding because he is reprising his role for the upcoming sequel to _The Pink Panther (2006)_ (qv).", "He is a huge fan of British comedian 'David Walliams' (qv).", "He has a sister named Melinda.", "Even though during his stand up days he said he was a \"wild and crazy guy\", in real life he is actually quite shy and quiet.", "2007: Recipient of the Kennedy Center Honors. Other recipients that year were 'Leon Fleisher' (qv), 'Diana Ross' (qv), 'Martin Scorsese' (qv), and 'Brian Wilson' (qv).", "He told 'Terry Gross' (qv) on her National Public Radio program \"Fresh Air\" that he smoked a fair amount of marijuana in the late 1960s until one night when he had a panic attack at a showing of the 'Mel Brooks' (qv) movie _The Producers (1967)_ (qv). After that, he never smoked pot again, and he believes that the negative experience saved him from the harder drug abuse and addiction that plagued so many of his colleagues during the next few decades.", "He was Warner Bros. second choice for the role of The Riddler in _Batman Forever (1995)_ (qv) (after 'Robin Williams' (qv) ). However he turned it down as with the death of his good friend 'John Candy' (qv) and his divorce from 'Victoria Tennant' (qv) he was too sad to make any movies.", "He appeared on the college circuit in the 1970s with fellow musical comedian 'Martin Mull' (qv) as \"The 'Steve Martin' (qv) Mull Show\".", "He co-wrote two songs with 'Martin Mull' (qv): \"Men\" appearing on the album \"I'm Everyone That I Have Ever Loved\" and \"Westward Ho!\" appearing on the album \"Sex & Violins\".", "Although many critics were disdainful of his overtly silly act early in his career, its postmodern nature was admired by avant garde filmmakers 'David Lynch' (qv) and 'Stanley Kubrick' (qv), both of whom approached Martin to appear in ultimately unproduced comedy films.", "He attended Rancho Alamitos his freshman and sophomore years. He was the freshman class president, and a member of the cheer leading squad at Rancho where some of his zany comical routines were first tested out. When the school boundaries were shifted, they put him in Garden Grove high school attendance area. He graduated from Garden Grove High School in 1963.GGHS opened in 1921 and RAHS opened in 1957.", "He has a dog named Wally.", "He is a fan of 'Carl Ballantine' (qv). Presented him the Lifetime Achievement Fellowship from the Magic Castle in Hollywood in 2007.", "When Martin lived in his Manhattan apartment, his next door neighbor was 'Mary Steenburgen' (qv).", "He learned to play the banjo by playing LPs at 16rpm speed. This approach enabled him to more accurately pick the individual notes due to the halved playback LP speed.", "He played C.D. Bales in _Roxanne (1987)_ (qv), which was based on the play Cyrano de Bergerac by 'Edmond Rostand' (qv). His _Grand Canyon (1991)_ (qv) and _The Pink Panther (2006)_ (qv) cast mate, 'Kevin Kline' (qv), played Cyrano on stage.", "He was one of the victims of a gang of German art forgers, who made an estimated 16 million Euros. In 2004, Steve bought a counterfeit painting of the artist \"Campendonk\". Luckily, he sold the painting in 2006 before the forgeries were discovered.", "He is the father, with Anne Springfield, of a daughter born in December 2012.", "Like friend 'Lorne Michaels' (qv)' and fellow showbiz heavyweights 'Paul Simon' (qv) and 'Mike Nichols' (qv), Martin has had his portrait painted by 'Eric Fischl' (qv).", "Release of his book, \"Picasso at the Lapin Agile and Other Plays\". [1996]", "Release of book: Cruel Shoes [February 1982]", "Release of his book, \"Shopgirl\". [2000]", "Release of his book, \"Born Standing Up: A Comic's Life\". [November 2007]", "Release of his book, \"Pure Drivel\". [1998]", "Release of his children's book, \"The Alphabet From A to Y: With Bonus Letter Z\". [2007]", "Second novella, \"The Pleasure of My Company,\" was published. [October 2003]", "Release of his book, \"The Underpants: A Play by Carl Sternheim\". [2002]", "His business card reads \"This certifies that you have had a personal encounter with me, and that you found me warm, polite, intelligent, and funny.\".", "He was one of the first celebrities to pay tribute to 'Robin Williams' (qv) (on his Twitter feed) and as such his tribute was featured in many news reports on Williams' death.", "He has English, and small amounts of Scottish, Irish, Scots-Irish/Northern Irish, and German, ancestry.", "He was romantically involved with, and at one point engaged to, 'Bernadette Peters' (qv), with whom he worked in several films in the 1970s and '80s.", "He became a father for the first time at age 67.", "He has stated the main factor when deciding which roles to play is if the script appeals to him, if it doesn't, he won't play the role.", "His favorite horror movie is Black Christmas (1974). When he first met lead actress of the film, Olivia Hussey, he claimed he had seen it 27 times.", "He was considered for the role of Harry Sultenfuss in My Girl (1991), but was busy with the remake of _Father of the Bride (1991)_ (qv) at the same time and was unable to take the part. The role was given instead to Dan Aykroyd.", "He is the subject of the tribute song \"The 'Steve Martin' (qv)\" by EPMD.", "At one point he was due to play the title role in The Walker (2006) and studied television interviews with Gore Vidal in his preparation.", "He has hosted Saturday Night Live (1975 - ) fifteen times, a record second only to his friend 'Alec Baldwin' (qv) who has hosted seventeen times.", "He holds the record for hosting Saturday Night Live (1975 - ) five times in the shortest amount of time, doing so in five-hundred and forty-six days.", "Friends with 'Diane Keaton' (qv), 'John Candy' (qv), 'Tom Hanks' (qv), 'David Letterman' (qv), and 'Eugene Levy' (qv).", "As of 2018, has never appeared in a film nominated for the the Best Picture Oscar.", "'Steve Martin' (qv) & 'Martin Short' (qv) were nominated for the 2018 Emmy Award in the Outstanding Writing for a Variety Series category for 'Steve Martin' (qv) and 'Martin Short' (qv): An Evening You Will Forget for the Rest of Your Life (2018), but lost to 'John Mulaney' (qv) for 'John Mulaney' (qv): Kid Gorgeous at Radio City (2018).", "Dated 'Mary Tyler Moore' (qv).", "He was a good friend of 'Jon Pertwee' (qv). At The 69th Annual Academy 'Awards' (qv) (1997), when the \"In Memoriam\" montage was being played, he was upset that Pertwee, who passed away the year before, was not included. He then stormed out and didn't return.", "He has appeared in one film that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _The Muppet Movie (1979)_ (qv).", "\"Bright Star,\" at the BoHo Theatre production at the Greenhouse Theater Center Upstairs Mainstage in Chicago, Illinois was nominated for a 2019 Non-Equity Joseph Jefferson Equity Award for Musical Production.", "While filming _Dirty Rotten Scoundrels (1988)_ (qv), he and 'Michael Caine' (qv) became good friends."], "quotes": ["I believe that sex is the most beautiful, natural, and wholesome thing that money can buy.", "The greatest thing you can do is surprise yourself.", "What is comedy? Comedy is the art of making people laugh without making them puke.", "[while hosting The 73rd Annual Academy 'Awards' (qv) (2001)] And now, I'm pleased to introduce the star of the film _Gladiator (2000)_ (qv), and a man I like to call a close, personal friend, but he told me not to . . .", "I wrote a novel this year called \"Shop Girl\", and several producers came to me and wanted to turn it into a movie. And I said, \"If you think you're going to take this book and change it around, and Hollywoodize it and change the ending . . . that's going to cost you.\"", "All I've ever wanted was an honest week's pay for an honest day's work.", "Chaos in the midst of chaos isn't funny, but chaos in the midst of order is.", "I believe entertainment can aspire to be art, and can become art, but if you set out to make art you are an idiot.", "[From People Magazine, 5/20/03, in which he was listed as one of the 50 Most Beautiful People in the World] It's very hard being one of the most beautiful people. Having this kind of beauty is actually a burden. Sometimes I go to a party and not one of the other 49 most beautiful people is there. That makes me feel very solitary and alone, because it means I am the most beautiful person in the room. If I'm going to a party where I know there will be \"less-beautiful people,\" I try to \"dress down\" in order to hide my beauty. But this seems to have a counter-effect of actually making me more beautiful. I guess me and dungarees are a pretty potent combination. I try not to lord my beauty over others. This is very hard. I try not to mention that I am one of the most beautiful people, but somehow it always comes out. I will usually only bring it up when I'm asked to do a task, like open a garage door. People seem to enjoy my beauty and are genuinely happy for me, because after I mention it they always say, \"How nice for you.\"", "[upon receiving a particularly unremarkable award] When I first found out that I was going to win this award, I tried really hard - to care. And then I realized; we are all here tonight, because of a common love: me.", "Comedians don't get Oscars, so I gave up on that a long time ago. And I can't really speak about the Oscar-worthiness of my own performance.", "I lost 20 pounds - actually, I lost 25 pounds, but then I gained 5 back because I was too skinny. I didn't change what I ate, I just started eating smaller portions. And I cut out bread - that's the real killer, because I was reaching in and eating half a loaf before dinner arrived. All you have to do is that, and then you can drink all you want.", "I've written a lot about L.A., and I always describe it as beautiful. To me, human relationships can be sad, can be exhilarating - but it's not a product of the city. And it takes different forms. Like, in New York, you're always with people. You can't go outdoors, you can't go into the subway, you can't go anywhere without running into people you don't know. But in L.A., you really have to work a bit to be exposed. You have to be standing in a shop, you have to join a club, or join a community service thing, or go to a nightclub in order to meet people. Because there's not the same transitory proximity to other people.", "What is a movie star? A movie star is many things. They can be tall, short, thin, or skinny. They can be Democrats . . . or skinny.", "There's a big difference between the National Book 'Awards' (qv) and the Academy 'Awards' (qv). At the Academy 'Awards' (qv) you can feel the greed and envy and ego. Whereas the National Book 'Awards' (qv) are in New York.", "These Pink Panther movies are a great opportunity to use my physical chops. And I love doing that stuff. These zany or extreme movies are hard to find. I did one in the 90s, _Bowfinger (1999)_ (qv), which was attempting to do that. But it's difficult to come up with something to justify the slapstick. I'm lucky I found this series. Because in what other film would I be able to fall down a chimney or jog on top of a spinning globe? I can't imagine it.", "In _Bowfinger (1999)_ (qv), there's a scene where 'Eddie Murphy' (qv) has to run across a freeway. The studio people all said, \"We've got to cut this. It's too expensive\". I said, \"You can't cut the funniest scene in the movie! We're making a comedy - if you cut the funniest scene what are we making?\" And it did turn out to be the funniest scene.", "I wish I could do a lot of things different. I'm not going to tell you what they are, but if I had a list of all my films right now, I'd go, \"Okay, I'll cross that one out and cross that one out and cross that one out and cross that one out.\" Really. But I've made over 40 films. How can I not have some losers in there?", "I loved doing _Pennies from Heaven (1981)_ (qv). Because you have to understand that I'd been doing comedy for 15 to 20 years, and suddenly along came the opportunity to do this beautiful film. It was so emotional to me. I loved it. I don't think it was a good career move, but I have no regrets about doing it.", "A day without sunshine is like, you know, night.", "[on playing banjo with the Steep Canyon Rangers] This is an accident. And, by the way, when I say comedy was a means of getting myself into film, that was an accident too.", "[to 'Alec Baldwin' (qv) when same-sex weddings were legalized in New York] Alec! Now we can get married! (Baldwin's response: 'Okay, but if you play that effing banjo after eleven o'clock...')", "I always felt there was a deeper meaning to what I was doing than just being wild and crazy, something more philosophical. I had a view that there was something funny about trying to be funny. I needed a theory behind it in order to justify it at the time, but now I don't. I see it for what it was. It was just fun, and it was stupid, and that's why it was so successful.", "[on 'Lorne Michaels' (qv)] Lorne is the kind of power producer who can get things done with simply a phone call. Especially pedicures.", "I've learned through the years that offstage chemistry has absolutely no bearing with onstage or on-film chemistry.", "I love money. I love everything about it. I've bought some pretty good stuff. Got me a $300 pair of socks, got a fur sink. Let's see, bought an electric dog polisher, a gasoline-powered turtleneck sweater, and, of course, I bought some dumb stuff, too.", "When I heard that 'Richard Gere' (qv) was not nominated for his great performance in _Chicago (2002)_ (qv) , I said to myself, 'Welcome to my world, 'Richard Gere' (qv).", "When I first started, I really decided to be a comedian, so I underplayed the banjo. I didn't want it to be a music show, I wanted it to be a comedy show. I subordinated the banjo and the music because I didn't have anybody to play with. It was just me. And music always sounds better when you've got some other people.", "[Uncut magazine \"An Audience With... 'Steve Martin' (qv)\" May 2013] There's a rumor that I'm a big fan of _Doctor Who (1963)_ (qv), but I don't even know who _Doctor Who (1963)_ (qv) is! That's one of those internet things. It's on some website that collects data on celebrities, it's just one of those things someone posted that's completely in error. I don't know. What is _Doctor Who (1963)_ (qv)? I don't know a thing about it, but I'll be a fan if it'll help me in any way.", "You have to remember, I live in an ivory tower so I don't really know what's going on out there. But I love 'Sacha Baron Cohen' (qv)'s work. I thought Borat (_Borat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan (2006)_ (qv)) was a breakthrough comedy, something I really, really had not seen before.", "I was in London in the early '80s and I did the _Parkinson (1971)_ (qv) show. I got a call from 'Stanley Kubrick' (qv), who said he'd like to meet me. I went up to his house and I was overwhelmed. I had only done one movie, _The Jerk (1979)_ (qv). He was very complimentary and he had seen me on Parkinson's show. He viewed his serious movies as comedies. So we played chess and he showed me around his store rooms where he had these huge rooms of open files of - I don't know how to describe them - like library stacks. He had screening rooms, too, where he reviewed every print. This was 1980 and he was still reviewing prints of 2001, before they'd go out. Every print. One thing that struck me, he had files of press reviews marked \"Favorable\" or \"Hostile\". But he was very, very nice.", "When you're young, criticism is a go ahead. You almost want it.", "Be so good they can't ignore you."], "salary history": ["_The Jerk (1979)_ (qv)::$600,000 and 50% of the profits", "_Sgt. Bilko (1996)_ (qv)::$7,000,000", "_Cheaper by the Dozen (2003)_ (qv)::$10,500,000", "_The Pink Panther (2006)_ (qv)::$28,000,000 (includes £3M for writing)"], "birth date": "1945-08-14", "birth notes": "Waco, Texas, USA", "_actorID": "93", "_source": "IMDB", "actorID": "0000188", "created_utc_dt": "09/14/2019, 13:02:37"}