{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQ3ODE3Mjg1NV5BMl5BanBnXkFtZTcwNzA4ODcxNA@@._V1_UY98_CR3,0,67,98_AL_.jpg", "nick names": ["Nat"], "birth name": "Natalie Hershlag", "height": "5' 3\" (1.6 m)", "mini biography": ["'Natalie Portman' (qv) is the first person born in the 1980s to have won the Academy Award for Best Actress (for _Black Swan (2010)_ (qv)).Natalie was born Natalie Hershlag on June 9, 1981, in Jerusalem, Israel. She is the only child of Avner Hershlag, a Israeli-born doctor, and Shelley Stevens, an American-born artist (from Cincinnati, Ohio), who also acts as Natalie's agent. Her parents are both of Ashkenazi Jewish descent. Natalie's family left Israel for Washington, D.C., when she was still very young. After a few more moves, her family finally settled in New York, where she still lives to this day. She graduated with honors, and her academic achievements allowed her to attend Harvard University. She was discovered by an agent in a pizza parlor at the age of 11. She was pushed towards a career in modeling but she decided that she would rather pursue a career in acting. She was featured in many live performances, but she made her powerful film debut in the movie _Léon: The Professional (1994)_ (qv) (aka \"Léon\"). Following this role Natalie won roles in such films as _Heat (1995)_ (qv), _Beautiful Girls (1996)_ (qv), and _Mars Attacks! (1996)_ (qv).It was not until 1999 that Natalie received worldwide fame as Queen Amidala in the highly anticipated US$431 million-grossing prequel _Star Wars: Episode I - The Phantom Menace (1999)_ (qv). She then she starred in two critically acclaimed comedy dramas, _Anywhere But Here (1999)_ (qv) and _Where the Heart Is (2000)_ (qv), followed by _Closer (2004)_ (qv), for which she received an Oscar nomination. She reprised her role as Padme Amidala in the last two episodes of the Star Wars prequel trilogy: _Star Wars: Episode II - Attack of the Clones (2002)_ (qv) and _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv). She received an Academy Award and a Golden Globe Award for Best Actress in _Black Swan (2010)_ (qv).She received a second nomination for Best Actress, for playing 'Jacqueline Kennedy' (qv) in _Jackie (2016)_ (qv).::TrendEklD@aol.com"], "spouse": ["'Benjamin Millepied' (qv)::(4 August 2012 - present) ( 2 children)"], "trade mark": ["Often portrays characters that are rather smart, mature and grown up for their age", "Brown eyes", "Lisp sweet voice", "Petite figure", "Mole on the side of her face"], "trivia": ["Turned down a role in _The Horse Whisperer (1998)_ (qv) to act in \"The Diary of Anne Frank\" on Broadway.", "Graduated from Syosset High School in Syosset, New York in June 1999.", "Has taken dance lessons since the age of 4. Still takes ballet classes.", "Stated in a TV interview that with the exception of the Star Wars prequels, she will not act for the next four years in order to concentrate on studying at Harvard University (1999).", "Can speak two languages, Hebrew and English (her native languages), fluently. Also knows some conversational French, German, Japanese and Spanish.", "Originally turned down the role of Ann August in the film _Anywhere But Here (1999)_ (qv) because of the love scene between herself and 'Corbin Allred' (qv) that required nudity. 'Susan Sarandon' (qv), who had co-star approval, said she couldn't continue the movie without Portman, so the script was re-written without the scene and she accepted the role.", "Was a member of the environmental song and dance troupe The World Patrol Kids under her real name, Natalie Hershlag.", "She went to Stagedoor Manor Performing Arts Camp in 1994 and 1995 where she was Anne in \"Anne of Green Gables\" in 1994 and \"Tapestry\" in 1995.", "She was discovered in a pizza parlor and was originally turned down for the role of Mathilda in _Léon: The Professional (1994)_ (qv) because she was too young.", "'David Letterman' (qv) and Harpers and Queen magazines said that she is \"the new 'Audrey Hepburn' (qv)\".", "Turned down the title role in 'Adrian Lyne' (qv)'s _Lolita (1997)_ (qv), due to her feelings about young adult actors/actresses being exposed to sex in films.", "Before she was cast in _Star Wars: Episode I - The Phantom Menace (1999)_ (qv), she had never seen the original Star Wars trilogy. She admitted to 'James Lipton' (qv) on _Inside the Actors Studio (1994)_ (qv), in 2004, that, before being cast, she didn't know the difference between \"Star Wars\" and \"Star Trek\".", "Moved to the United States when she was 3 years old.", "Turned down the role of Wendy Hood in _The Ice Storm (1997)_ (qv) because she felt the material was \"too dark\". The role went to 'Christina Ricci' (qv), who has said she often gets the projects Natalie turns down.", "Said would never be in a horror movie or any other \"'Jennifer Love Hewitt' (qv) type\" film", "Has said in interviews that when she gets older, she would like to be a doctor like her father.", "Was reportedly caught using a fake ID trying to sneak into Boston club called the Roxy. The performer 'Moby' (qv) insisted that she was invited by him and refused to perform unless she was admitted. She was admitted, and security watched her as she stood in the back, watched the show, and didn't drink. She later stated in an online interview that the story about sneaking into the Roxy club in Boston was not true and that she and her friends went home after they were denied entrance.", "Takes pride in the fact that she is a role model for girls and chooses roles that are positive so that they will have a positive role model to look up to.", "Her father is a fertility specialist and gynecologist.", "Auditioned for the role of young Amy March in _Little Women (1994)_ (qv), which went to 'Kirsten Dunst' (qv).", "Became interested in acting after spending three summers at the prestigious (and expensive) Stagedoor Manor Performing Arts Camp.", "Is very close to her parents and says, \"The best part about being friends with your parents is that no matter what you do, they always love you.\".", "Grew up in Syosset, Long Island, New York, where she still resides.", "Named one of People magazine's 50 Most Beautiful People in the World (2002).", "One of Teen People magazine's 25 Hottest Stars under 25 (2002).", "Went to Usdan Camp for the arts as a child.", "The makeup brand Stila has a lip gloss named after her.", "As of November 2010, she has appeared on Late Show with 'David Letterman' (qv) (1993) 15 times.", "Voted the 15th Sexiest Female Movie Star in the Australian Empire Magazine. [September 2002]", "Graduated from Harvard College in Cambridge, Massachusetts in 2003 with a Artium Baccalaureus degree in Psychology.", "Has a passion for travel. In late 2003 and early 2004, she traveled alone to Morocco and Guatemala.", "Favorite actor is 'Ben Kingsley' (qv).", "Is trained in ballet, jazz, and tap dancing.", "She has worked with or appeared with several of her co-stars twice: 'Ashley Judd' (qv) in _Heat (1995)_ (qv) and _Where the Heart Is (2000)_ (qv); 'Lukas Haas' (qv) in _Mars Attacks! (1996)_ (qv) and _Everyone Says I Love You (1996)_ (qv); 'Julia Roberts' (qv) in _Everyone Says I Love You (1996)_ (qv) and _Closer (2004)_ (qv); 'Philip Seymour Hoffman' (qv) in the play \"The Seagull\" and _Cold Mountain (2003)_ (qv); 'John Carroll Lynch' (qv) in _Beautiful Girls (1996)_ (qv) and _Anywhere But Here (1999)_ (qv); 'Stellan Skarsgård' (qv) in _Goya's Ghosts (2006)_ (qv) and _Thor (2011)_ (qv); 'Olivia Thirlby' (qv) in _New York, I Love You (2008)_ (qv) and _No Strings Attached (2011)_ (qv). She has also worked with director 'Mike Nichols' (qv) on two occasions: for the play \"The Seagull\" and _Closer (2004)_ (qv). She has also appeared alongside 'Jude Law' (qv) three times in _Cold Mountain (2003)_ (qv), _Closer (2004)_ (qv) and _My Blueberry Nights (2007)_ (qv), and with 'Hayden Christensen' (qv) three times in the Star Wars prequels and _New York, I Love You (2008)_ (qv).", "As a young girl, she was an understudy for the lead character in the off-Broadway show \"Ruthless\", alongside 'Britney Spears' (qv). They still keep in touch, and recently threw a party together in New York City.", "Fashion designer 'Zac Posen' (qv) refers to her as his \"muse\".", "Both she and 'Sofia Coppola' (qv) have played the daughter of a character played by 'Al Pacino' (qv), and also both appeared in a film featuring Pacino and 'Robert De Niro' (qv). 'Sofia Coppola' (qv) was in all three Godfather films (though she had only an uncredited part in the second), and Portman was in _Heat (1995)_ (qv). Portman and Coppola appeared together in _Star Wars: Episode I - The Phantom Menace (1999)_ (qv).", "Close friends with 'Jake Gyllenhaal' (qv), 'Mila Kunis' (qv) and 'Bryce Dallas Howard' (qv).", "Her comedic influences are 'Lily Tomlin' (qv) and 'Diane Keaton' (qv). She said in an interview, \"I love 'Lily Tomlin' (qv) and I love 'Diane Keaton' (qv). They're sort of my heroes. 'Diane Keaton' (qv) can do anything. She's just the best there is.\"", "Has a song named after her by the band TeamSleep.", "She and director 'Tom Tykwer' (qv) became good friends after working together on _True (2004)_ (qv).", "She spoofed her role in Star Wars before becoming involved in the series. In _Mars Attacks! (1996)_ (qv), she gives a medal to 'Lukas Haas' (qv) in a scene resembling the award ceremony at the end of _Star Wars: Episode IV - A New Hope (1977)_ (qv). The medals were given out by Princess Leia, the daughter of Portman's future character, Queen Amidala. In addition, the recipients of those medals, Haas and 'Harrison Ford' (qv), appeared together in _Witness (1985)_ (qv).", "Was considered for a role in _Elizabethtown (2005)_ (qv).", "Has a CD named after her by Chicago-based DJ Intel One. The CD was done for charity, given away, and titled \"Love: A Tribute to 'Natalie Portman' (qv)\". It featured songs by 'Shelley Duvall' (qv), 'Common' (qv), 'The Roots' (qv) and others.", "She has worked with two Draculas as well as two Frankenstein monsters. In _Léon: The Professional (1994)_ (qv), she worked with 'Gary Oldman' (qv), who played Dracula for 'Francis Ford Coppola' (qv). In _Heat (1995)_ (qv), she appeared with 'Robert De Niro' (qv), who played The Creature for 'Kenneth Branagh' (qv). In Star Wars, she works with 'Christopher Lee' (qv), who played both roles for Hammer Film Productions.", "Had to miss the premiere of _Star Wars: Episode I - The Phantom Menace (1999)_ (qv) so she could study for her high school final exams.", "Has a song named after her by the band Ozma.", "Bears a striking resemblance to 'Keira Knightley' (qv). Knightley played Sabé, the Queen's decoy, in _Star Wars: Episode I - The Phantom Menace (1999)_ (qv). When in makeup, not even the mothers of the actresses could tell them apart.", "She hesitantly shot an explicit nude scene for _Closer (2004)_ (qv), in the scene where Alice (Portman) strips for Larry ('Clive Owen' (qv)). Ultimately, Portman and director 'Mike Nichols' (qv) agreed not to use it, as the scene was effective enough without it.", "Shaved her head for _V for Vendetta (2005)_ (qv).", "Worked with a vocal coach to learn how to speak with an English accent for _V for Vendetta (2005)_ (qv).", "Learned how to play the piano and conduct for _Mr. Magorium's Wonder Emporium (2007)_ (qv).", "Named #42 on Maxim magazine's Hot 100 Women of 2005 list.", "Named #49 in FHM's \"100 Sexiest Women in the World 2005\" special supplement.", "Says her performances in _Everyone Says I Love You (1996)_ (qv) is her worst. Her failure, she believes, is her inability to improvise.", "Several months after shaving her head, she was traveling through Ireland and stopped for directions at a bed and breakfast. The owners refused to allow her even onto their porch. However, they did give her directions.", "Voted Peta's Sexiest Female Vegetarian in 2002.", "A radio station once had a contest to find out where she went to school; 'Backstreet Boys' (qv) tickets were the prizes.", "Natalie is entirely of Ashkenazi Jewish descent. Natalie's father was born in Israel and Natalie's mother was born in Ohio, in the United States. Natalie's paternal grandparents, Zvi Yehuda Hershlag (a member of the tribe of Naftali) and Mania Portman, were from Rzeszów, Poland, and Romania, respectively. Natalie's maternal grandfather, Arthur Edelstein (later Stevens), was born in New York, to a family of emigrants from Austria, Ukraine, and Russia, while Natalie's maternal grandmother, Bernice Hurwitz, was born in Maryland, the granddaughter of emigrants from Lithuania/Russia.", "In 1999, magazines reported that Portman started a new trend - wearing logo T-shirts - when they snapped photos of her at her 18th birthday wearing a snug Nesquik shirt. (However, logo T-shirts had already been popular since at least the 1970s) She had borrowed the shirt from her best friend's eight-year-old brother; he was appalled.", "In 2005, she spent a few months in Madrid partying with 'Javier Bardem' (qv) and friends. She was mostly unrecognizable to fans because of her Mohawk.", "Occasionally shelters dogs.", "Once during an interview, she offered a metaphor for the Israeli-Palestinian conflict from the 'David Hare' (qv) play \"Via Dolorosa\". It's about a man who jumps out of a burning building and lands on a passerby, breaking the passerby's leg. The passerby says, \"You broke my leg\", and the man breaks his other leg to shut him up.", "Said that it was while working on _The Seagull (2002)_ (qv) that she became aware that acting is much more about the process than the product. Most helpful was when she would peek over 'Philip Seymour Hoffman' (qv)'s shoulder at the notebook he kept, in which he wrote questions and then answers about his character's feelings.", "She became the first client of Artists Management Group to land representation at the powerhouse Creative Artists Agency. CAA refused to work with clients of its former founder 'Michael Ovitz' (qv)'s AMG; as soon as the one-time super-agent sold out his interest in the management firm, CAA went straight after Portman.", "Was surprised and amused to discover that her apartment in the heart of Kings Cross, London, was across the street from a brothel.", "Took diving courses in Eilat, Israel. Diving is one of her favorite hobbies.", "For her 2003 New Year's party, she wore a 'Zac Posen' (qv) dress that had more than $10,000 worth of crystals sewn onto it. She also attended 'Moby' (qv)'s much-hyped secret Naked NYE party.", "As the first day of _Cold Mountain (2003)_ (qv) filming fell on Halloween, Portman came to set dressed as Dorothy Gale in \"The Wizard of Oz\", only to realize she was the only one who had dressed up.", "Her years at Harvard resulted in the phenomenon of The Natalies, in which every underclasswoman with that first name received numerous e-mails and phone messages from fans.", "When she arrived at a London airport to do reshoots for the third Star Wars prequel, a customs official--going by her size--asked Natalie if she was traveling with a guardian.", "Is close friends and well-known customer of 'Zac Posen' (qv), friends with 'Jeanine Lobell' (qv) and her husband 'Anthony Edwards' (qv), as well as 'Jonathan Safran Foer' (qv). Portman has also been friends with 'Isaac Mizrahi' (qv) since she was 14, and friends with 'Mike Nichols' (qv) and his wife 'Diane Sawyer' (qv) since she was 15.", "Attended a soccer game in Madrid with 'Stellan Skarsgård' (qv). Afterwards, the team gave her her own jersey.", "While in northern Iraq in 2004, the 1st Battalion 5th Infantry hung a giant poster of her in their command hanger after discovering that most of the men in the unit were big fans.", "Was considered for the role of Jane Austen in _Becoming Jane (2007)_ (qv), which went to 'Anne Hathaway' (qv).", "Her parents met at Ohio State University in Columbus, Ohio.", "Her father Avner was born on September 12, 1951, and her mother Shelley was born on June 9, 1952. Natalie was born on her mother's 29th birthday.", "Has a slight indentation on her head, that was visible during the time she had her head shaved. The indentation was the result of being delivered by vacuum extraction.", "Named #61 in FHM magazine's \"100 Sexiest Women in the World 2006\" supplement.", "Director 'Milos Forman' (qv) sought her out for an audition after seeing her on the cover of Vogue. He said that she looked like a Goya painting.", "She currently lives on Long Island, New York, and also shares a home in London, England. She has lived on Long Island, New York since she was a child (2007).", "Listens mostly to R&B, old school hip-hop and 1990s alternative rock. Some of her favorite groups and artists are 'A Tribe Called Quest' (qv), 'Radiohead' (qv), 'Stevie Wonder' (qv), 'Portishead' (qv), 'Wu-Tang Clan' (qv) and 'Nirvana' (qv).", "Footage of her and 'Leonardo DiCaprio' (qv) as Juliet and Romeo in 'Baz Luhrmann' (qv)'s _Romeo + Juliet (1996)_ (qv) was actually shot before executives had her replaced with 'Claire Danes' (qv) due to the age difference between Natalie and Leonardo.", "Unwinds by singing karaoke at Winnie's, a New York City bar in Chinatown.", "While in Morocco, she lived in a tent and traveled by camel. She visits Morocco regularly.", "There is a band named after her: 'Natalie Portman' (qv)'s Shaved Head.", "Named #2 on Empire magazine's 100 Sexiest Movie Stars (2007) and was ranked #2 on Entertainment Weekly's '30 Under 30' the actress list (2008).", "During the royal premiere of _Star Wars: Episode I - The Phantom Menace (1999)_ (qv), she met 'Prince Charles' (qv). The prince asked her whether she had also been in _Star Wars: Episode IV - A New Hope (1977)_ (qv), which had been released four years before her birth.", "Was listed as a potential nominee for the 2008 Razzies for Worst Actress, for her performances in _Goya's Ghosts (2006)_ (qv) and _Mr. Magorium's Wonder Emporium (2007)_ (qv). She didn't make the final ballot.", "Was a member of the jury at the Cannes Film Festival in 2008.", "Replaced 'Eva Green' (qv) in _Closer (2004)_ (qv).", "Sold her 2,088-square-foot house in Sea Cliff, New York for $1.750 million. She had purchased it in 2002 for $1.375 million (2007).", "Sold her two-bedroom loft in Manhattan's West Village for $6.55 million. She purchased the property in 2005 for $5.7 million (2008).", "She paid $3.25 million to purchase a four-bedroom, 4,866-sq.-ft. home in Los Angeles's Hollywood Hills area. Previous owners were 'Dermot Mulroney' (qv) and 'Catherine Keener' (qv) (2009).", "(September 13, 2009) Was in attendance at the wedding of her _Your Highness (2011)_ (qv) co-star 'Zooey Deschanel' (qv) to 'Benjamin Gibbard' (qv).", "Best friends with 'Rashida Jones' (qv). Also close friends with 'Jake Gyllenhaal' (qv), 'Bryce Dallas Howard' (qv), 'Britney Spears' (qv), 'Mila Kunis' (qv), 'Robert Pattinson' (qv), and 'Julia Roberts' (qv).", "Was originally cast as Catherine Earnshaw in _Wuthering Heights (2011)_ (qv), but was replaced by 'Gemma Arterton' (qv), who was later replaced by 'Kaya Scodelario' (qv), after dropping out of the project.", "Was considered for the role of Natasha Romanoff/Black Widow in _Iron Man 2 (2010)_ (qv) after 'Emily Blunt' (qv) dropped out of the project, but 'Scarlett Johansson' (qv) was cast instead.", "(December 28, 2010) Engaged to _Black Swan (2010)_ (qv) choreographer 'Benjamin Millepied' (qv), with whom she is expecting their first child.", "(March 6, 2009) In New York, she led a viewing of _A Powerful Noise (2008)_ (qv), a documentary about women fighting adversity. Actress 'Sarah Michelle Gellar' (qv) held another viewing in Los Angeles, California.", "Was considered for the role of Selina Kyle/Catwoman in _The Dark Knight Rises (2012)_ (qv), but 'Anne Hathaway' (qv) was cast instead.", "Is one of 14 actresses to have won the Academy Award, BAFTA Award, Critics' Choice Award, Golden Globe Award and SAG Award for the same performance. The others in chronological order are 'Julia Roberts' (qv) for _Erin Brockovich (2000)_ (qv), 'Renée Zellweger' (qv) for _Cold Mountain (2003)_ (qv), 'Reese Witherspoon' (qv) for _Walk the Line (2005)_ (qv), 'Helen Mirren' (qv) for _The Queen (2006)_ (qv), 'Jennifer Hudson' (qv) for _Dreamgirls (2006)_ (qv), 'Kate Winslet' (qv) for _The Reader (2008)_ (qv), 'Mo'Nique' (qv) for _Precious (2009)_ (qv), 'Octavia Spencer' (qv) for _The Help (2011)_ (qv), 'Anne Hathaway' (qv) for _Les Misérables (2012)_ (qv), 'Cate Blanchett' (qv) for _Blue Jasmine (2013)_ (qv), 'Patricia Arquette' (qv) for _Boyhood (2014)_ (qv), 'Julianne Moore' (qv) for _Still Alice (2014)_ (qv) and 'Brie Larson' (qv) for _Room (2015)_ (qv).", "She has said one of the most difficult challenges of filming _Black Swan (2010)_ (qv) was her speaking voice. She stated throughout her career, so far, director 'Mike Nichols' (qv) has given her consistent criticism on how childish her voice normally sounds and encouraged her to work with vocal coaches to make it sound deeper and more adult. The role of Nina required her to regress backwards to make her voice more child-like. She felt it was taking her back to a point she worked hard to leave behind.", "Was briefly referenced in _The Social Network (2010)_ (qv). Portman was approached by writer 'Aaron Sorkin' (qv) when writing the screenplay to the film to get insider information on Harvard University at that time because she was a fellow student of Facebook co-founders 'Mark Zuckerberg' (qv) and Eduardo Saverin, and also Divya Narendra and Tyler and Cameron Winklevoss.", "In spring 2004, she completed one semester of graduate courses at the Hebrew University of Jerusalem in Jerusalem, Israel.", "She entered a project into the Intel Science Talent Search in the late 1990s while at Syosset High School. Her project, titled \"A Simple Method to Demonstrate the Enzymatic Production of Hydrogen from Sugar\", took her to the semi-finals of the Intel contest. She graduated Valedictorian of Syosset High School in 1999 and went on to study Psychology and Neuroscience at Harvard University, graduating in 2003.", "In 2006, she appeared as a guest lecturer at Columbia University in a political science course titled \"Terrorism & Counterterrorism\". She led the class in a discussion about politically infused violence referencing her most recent film at the time, _V for Vendetta (2005)_ (qv). Her appearance was part of an MTV short-series, \"Stand-Ins\", where college professors were replaced with a celebrity instructor for one day.", "She often broke down and cried offstage while part of the Broadway adaptation of \"The Diary of Anne Frank\" in 1997, where she portrayed Anne Frank, because of her personal connections to the events. Her grandparents lost most of their family members in the Holocaust including her paternal great grandparents who were killed at the Auschwitz concentration camp in Poland.", "Was a resident of Lowell House during her first year at Harvard University.", "Did not have a Bat Mitzvah due to her parents being more secular than religious Jews. She attended a Conservative Jewish day school through seventh grade more to preserve her sense of Israel and her Hebrew than a religious motivation.", "Is a dual citizen of the United States and Israel.", "Was voted \"Most Likely to be on Jeopardy\" in the senior superlatives at Syosset High School.", "In January 2011, she became the new face of Dior in the Miss Dior Cherie ad campaign. On February 27, 2011, a video of top Dior designer, 'John Galliano' (qv), going on an anti-Semitic rant in Paris surfaced online. Portman released a statement condemning Galliano's actions, specifying she was \"shocked and disgusted,\" and as a proud Jewish woman refused to associate herself with him from that point on. Since the Miss Dior Cherie ad campaign was set to officially launch two days after the video surfaced, Dior was forced to take legal action to work out a settlement in order to keep Portman as a spokesperson. Galliano was fired on March 1, 2011 and the ad campaign launched as originally planned.", "Paid for all of her own ballet training to prepare for the role of Nina Sayers in _Black Swan (2010)_ (qv).", "_Where the Heart Is (2000)_ (qv) contains her first on-screen love scene.", "One month before filming began for _The Other Boleyn Girl (2008)_ (qv), Portman began taking daily classes to master the English accent under dialect coach 'Jill McCullough' (qv).", "Was considered for the role of Dr. Ryan Stone in _Gravity (2013)_ (qv), which went to 'Sandra Bullock' (qv).", "Was ranked #8 on Maxim magazine's Hot 100 Women of 2011 list.", "Is a spokeswoman for FINCA, a financial charity who gives and recycles small loans to women in poverty stricken countries so they can start small businesses. FINCA's president Rupert Scofield has spoken about feeling lucky to have Portman as a celebrity spokeswoman because she is, \"extremely intelligent and committed.\" Portman has traveled to several countries as a FINCA ambassador and worked with many of the women FINCA's donations have helped.", "Was the one who led her _Brothers (2009)_ (qv) co-star 'Bailee Madison' (qv) to 'Guillermo del Toro' (qv) for a role in _Don't Be Afraid of the Dark (2010)_ (qv). Portman spoke about her young co-star with 'Alfonso Cuarón' (qv), who is a good friend of 'Guillermo del Toro' (qv), and then recommended Madison for a role. She ultimately was cast as a lead character, Sally Hirst. In July 2011, 'Guillermo del Toro' (qv) spoke in an interview about how 'Bailee Madison' (qv) was \"a miracle\" and that they had Portman to thank for it.", "Was one of the first actresses offered the role of Lisbeth Salander in _The Girl with the Dragon Tattoo (2011)_ (qv) along with 'Carey Mulligan' (qv) and 'Ellen Page' (qv), but Portman declined due to exhaustion. The role ultimately went to 'Rooney Mara' (qv).", "In September 2011, she traveled to Paris, France with fiancé 'Benjamin Millepied' (qv) and their son Aleph to celebrate Millepied's retrieval of an award from the French Minister of Culture. Millepied was awarded the \"Chevalier des Arts et des Lettres\".", "Owns and operates her own film production company, Handsomecharlie Films, with 'Annette Savitch' (qv). As of 2011, every film produced by the company (except for the short film \"Eve\", which Portman wrote and directed) has featured Natalie in a lead or supporting role. As well as acting in the films produced by Handsomecharlie Films, she is also credited as an executive producer.", "On October 18, 2011, she added a fan-voted Spike TV Scream Award for Best Actress in the film _Black Swan (2010)_ (qv) to the collection of other awards she received for the same film and category.", "Favorite actresses include 'Audrey Hepburn' (qv), 'Jane Fonda' (qv), 'Meryl Streep' (qv) and 'Diane Keaton' (qv).", "Participated in a live reading of the 1960 film _The Apartment (1960)_ (qv) where she read the part of Fran Kubelik originally portrayed by 'Shirley MacLaine' (qv). The sold out reading directed by 'Jason Reitman' (qv) was held on November 17, 2011 at the Los Angeles County Museum of Art. Portman read alongside 'J.K. Simmons' (qv), 'Ken Jeong' (qv), 'Nick Kroll' (qv), and her _No Strings Attached (2011)_ (qv) co-star 'Mindy Kaling' (qv).", "Was a vegetarian from 1989 until 2009 when after reading the book Eating Animals she opted to become a vegan. However she resumed vegetarianism after falling pregnant with her son Aleph to give him the necessary supplements and also due to her insatiable craving for eggs and cheese. Following her son's birth she resumed veganism once again.", "Served on the jury at the 2011 Gotham Independent Film 'Awards' (qv) alongside 'Nicole Kidman' (qv) and 'Jodie Foster' (qv).", "Voted #21 on Ask men's top 99 \"most desirable\" women of 2012.", "Returned to work 10 months after giving birth to her son Aleph in order to begin filming _Song to Song (2017)_ (qv).", "Gave birth to her 1st child at age 30, a son named Aleph Portman-Millepied on June 14, 2011. Child's father is her fiancé (now husband), 'Benjamin Millepied' (qv).", "(August 4, 2012) Married her boyfriend of three years and father of her 13-month-old son Aleph 'Benjamin Millepied' (qv). It was a private ceremony in Big Sur, California.", "When 'Roman Polanski' (qv) was arrested in Switzerland in September 2009 and awaiting extradition to the United States for having raped a 13-year-old girl back in 1975, Portman (along with 'Harrison Ford' (qv), 'Monica Bellucci' (qv), 'Tilda Swinton' (qv), 'Adrien Brody' (qv) and many others) signed a petition to free him, even though Polanski did admit that he did have sex with the 13-year-old, committing statutory rape. In a 2018 interview for Buzzfeed to promote _Annihilation (2018)_ (qv), Portman stated that she regretted her involvement, alleging that someone was passing the petition around where she lived and she'd ignorantly signed her name to be helpful.", "Named as one of the \"most desirable\" famous women for 2013 by Ask men's list of the Top 99 \"most desirable\" women.", "She holds the record for third-largest \"Best Actress\" award sweep (38 wins) for her role as Nina Sayers in _Black Swan (2010)_ (qv), following 'Helen Mirren' (qv) (40 wins) for her performance as Queen Elizabeth II in _The Queen (2006)_ (qv) and 'Cate Blanchett' (qv) (41 wins) for her performance as Jasmine French in _Blue Jasmine (2013)_ (qv).", "Does humanitarian work with FINCA International. [July 2005]", "Los Angeles, California: Attended the 83rd annual Academy 'Awards' (qv) with fiancé, 'Benjamin Millepied' (qv), and her parents, Avner and Shelley. [February 2011]", "Named after 'Natalie Wood' (qv).", "Is one of 6 actresses to have been pregnant at the time of winning the Academy Award; the others are 'Eva Marie Saint' (qv), 'Patricia Neal' (qv), 'Meryl Streep' (qv), 'Catherine Zeta-Jones' (qv) and 'Rachel Weisz' (qv). Neal is the only one to have not accepted her award in person as a result of her pregnancy. Portman was 5 months pregnant with her son Aleph when she won the Best Actress Oscar for _Black Swan (2010)_ (qv). She was pregnant again when she was nominated for Best Actress in 2017.", "Was the 138th actress to receive an Academy Award; she won the Best Actress Oscar for _Black Swan (2010)_ (qv) at The 83rd Annual Academy 'Awards' (qv) (2011) on February 27, 2011.", "Has starred in two film franchises in which she stars as a woman who falls in love with a warrior. The 'Star Wars' prequels as Padme Amidala and _Thor (2011)_ (qv) and its sequel _Thor: The Dark World (2013)_ (qv) as Jane Foster.", "One of only four actors with an Erdos-Bacon number - 7 for Portman. This represents sum of the degrees of separation from Kevin Bacon (2) and degrees of separation from co-authoring a paper with famed mathematician Paul Erdos (5) having co-authored the peer-reviewed paper \"Frontal Lobe Activation during Object Permanence: Data from Near-Infrared Spectroscopy\" while a student at Harvard.", "She has made four films with 'Samuel L. Jackson' (qv): _Star Wars: Episode I - The Phantom Menace (1999)_ (qv), _Star Wars: Episode II - Attack of the Clones (2002)_ (qv), _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv) and _Thor (2011)_ (qv).", "She lost 20 pounds for her role as \"Nina Sayers\" in _Black Swan (2010)_ (qv).", "She has the same Erdös-Bacon-Number, as 'Albert Einstein' (qv), with an 11.", "Lived in Connecticut from 1988-90.", "She has appeared in two films with \"I Love You\" in the title: _Everyone Says I Love You (1996)_ (qv) and _New York, I Love You (2008)_ (qv).", "She appeared in two films with 'Lukas Haas' (qv) in 1996: _Mars Attacks! (1996)_ (qv) and _Everyone Says I Love You (1996)_ (qv).", "Portrays Jane Foster, the title character's love interest in _Thor (2011)_ (qv). In 2014, Jane took over the Mjolnir and assumed the mantle of Thor, replacing him in his monthly comic book title.", "Inspired the Wachowskis to adapt 'David Mitchell' (qv)'s novel, \"Cloud Atlas\", into a film.", "Named \"The Most Beautiful Face of 2008\" by TC Candler's list of the \"100 Most Beautiful Famous Faces From Around the World\", and ranked on their list for 19 consecutive years (1998-2016). She was ranked #44 in 2016, #37 in 2015, #34 in 2014, #33 in 2013, #30 in 2012, #19 in 2011, #14 in 2010, #2 in 2009, #1 in 2008.", "Has worked with three of the same directors as 'Carrie Fisher' (qv). Firstly, they played on-screen mother-and-daughter Padme and Leia in 'George Lucas' (qv)'s Star Wars films. Secondly, 'Woody Allen' (qv) cast them in _Hannah and Her Sisters (1986)_ (qv) and _Everyone Says I Love You (1996)_ (qv). Thirdly, 'Mike Nichols' (qv) directed Fisher's first film, _Shampoo (1975)_ (qv), and Portman in _Closer (2004)_ (qv). Portman credits that film with reviving her career after Star Wars. Fisher's career as a writer and script doctor took off after Nichols's film adaptation of Fisher's novel _Postcards from the Edge (1990)_ (qv).", "Is one of five actresses to be nominated for an Academy Award for playing a first lady of the United States (Jackie Kennedy). Previous nominees were 'Beulah Bondi' (qv) (Rachel Jackson), 'Greer Garson' (qv) (Eleanor Roosevelt), 'Joan Allen' (qv) (Pat Nixon), and 'Sally Field' (qv) (Mary Todd Lincoln).", "Natalie is the first person born in the 1980s (and thus could be considered the first millennial) to have won the Academy Award for Best Actress (for Black Swan, 2010). 'Eddie Redmayne' (qv) is the first person born in that decade to win Best Actor (for _The Theory of Everything (2014)_ (qv)). 'Catalina Sandino Moreno' (qv) and 'Ryan Gosling' (qv) are the first persons born in the 1980s to have been nominated in those two respective categories.", "Gave birth to her 2nd child at age 35, a daughter named Amalia Millepied on February 22, 2017. Child's father is her husband, 'Benjamin Millepied' (qv).", "Was 4 months pregnant with her daughter Amalia when she completed filming _The Death and Life of John F. Donovan (2018)_ (qv).", "Returned to work 12 months after giving birth to her daughter Amalia to begin filming _Vox Lux (2018)_ (qv).", "In 2003 she graduated from Harvard in the same class as then friend 'Jared Kushner' (qv).", "Though she played Padmé Amidala, the biological mother of Luke Skywalker in three installments of the Star Wars movies, she has never personally met 'Mark Hamill' (qv) as of 2018; Hamill revealed this to his followers on Twitter when it was Portman's 37th birthday, as well as noting that the 'Annie Leibovitz' (qv) photoshoot for Vanity Fair (which features the stars of both Star Wars trilogies) was shot individually. Portman did, however, met her onscreen daughter Leia ('Carrie Fisher' (qv)).", "In his 2019 autobiography, \"Then It Fell Apart,\" 'Moby' (qv) claims that he dated Portman after she asked him out: \"I was a bald binge drinker and 'Natalie Portman' (qv) was a beautiful movie star. But here she was in my dressing room, flirting with me.\" Portman responded forcefully to his version of events, saying that she had just turned 18 when they met ('Moby' (qv) had claimed she was 20), that they had not dated, and that she had distanced herself from him once \"I realized that this was an older man who was interested in me in a way that felt inappropriate\" (he is 16 years her senior)."], "quotes": ["On _Lolita (1997)_ (qv): I don't think there needs to be a movie out where a child has sex with an adult.", "On _Lolita (1997)_ (qv): I think there's enough exploitation out there that it's not necessary to do more.", "Young actors often don't think of the consequences of doing nudity or sex scenes. They want the role so badly that they agree to be exploited, and then end up embarassing family, friends, and even strangers.", "On acting: I started to do this at age 11. At age 20, I might say, this is enough.", "On violence in the media: We live in a violent world, but since the success of films like _Pulp Fiction (1994)_ (qv), it seems every movie has some violence in it, and it's now being used as a form of comedy: audiences are now being encouraged to laugh when people get their heads blown off. I just don't like hearing people laugh at violence.", "I also feel I'm a positive role model by not putting my education on hold.", "I want to use college to explore what other careers I might be interested in.", "On acting: I'm taking it day by day. Right now I like acting, but if something else sparks my interest in college, I'll do that. It's so limiting to say, this is it for the rest of my life. There are so many things that interest me: I love math, science, literature, languages.", "On _Lolita (1997)_ (qv): Let me tell you, this movie's going to be sleaze.", "I'm going to college. I don't care if it ruined my career. I'd rather be smart than a movie star.", "I don't know if acting is what I want to do for the rest of my life, it's just what I've, you know, ended up doing when I was little, and I've kinda grown up with it.", "When I'm working, they pretty much treat me like an adult, but then when there's a break everyone else goes to their trailers and drinks beer and I like, go to school.", "There's so much else to do in the world. To just be interested in doing films would limit my life.", "I think school is so much harder than real life. People are so much more accepting when they are adults.", "'Danny Aiello' (qv) told me \"Don't do television.\".", "Cute is when a person's personality shines through their looks. Like in the way they walk, every time you see them, you just want to run up and hug them.", "I've never tried smoking. I don't drink. I've never tried drugs. (Australian Dolly, August 2000)", "Politics is easy to segue into from acting. I'm very interested in it, though I would never run for office. But after this, anything I do is going to seem very bizarre to me. (Interview, October 1999)", "No, but I've been thinking about it a lot. I love acting, but I don't know if there's something out there that I love more. That's what college is going to be about for me - checking things out. (Interview, October 1999)", "When asked by Seventeen magazine what advice she had for teenagers going off to college, she said \"I would say practicing laundry it's so hard.\". (November 1999)", "There is a lot lacking on the intellectual side and on the values side when being an actor. (Seventeen, November 1999)", "Told the November 1999 issue of Mademoiselle magazine that she wished she knew 'David Letterman' (qv) because, \"He seems to be so smart, but you never get to hang out with him after the show.\".", "When asked by German Cosmopolitan if she would like having herself as a daughter, she replied, \"Well of course. I am a good person, nice, smart, witty, trustworthy, know nice people, don't do drugs and earn a lot of money.\" On what she likes about her parents: \"They have made it quite clear that they believe I can be great. Had my parents expected less of me,I would not be the person I am now. And I am very happy with myself.\". (German Cosmopolitan, March 2000)", "I'm not planning to be an actress as an adult, I'm planning other things for my future. (Venice Magazine, July 1995)", "I don't think I'd be able to deal with just acting, because I don't know if you get to use your brain that much. You do, for certain roles, but not most. Acting is more of a hobby for me.", "There's a big intellectual aspect that's kind of lacking,\" she says of acting in films. \"Right now I supplement that through being in school. I'm not sure I'd be happy if I was just acting. I haven't explored a lot of other avenues. Hopefully I'll figure it out by the end of school, so I know what I want to do with my life.", "When asked about her prom dress: A designer is going to give me something to wear. It's the most amazing perk I have.", "I didn't have this undying need to be an actress. I didn't have that fire in me ever -- at any point. And still, I don't think I have that within me.", "I don't really know if acting would have ultimately become my passion as an adult, or if there's something else I would have found had I not been in the pizza shop. That's what college is helping me investigate.", "I'm ready to ditch the movies and keep at the books. There are so many other things, and it would feel limiting to say, \"Acting is it for me.\" I love psychology. That's what I'm studying right now. It would probably be difficult, because of my current occupation, to become a clinical psychologist, but I could certainly do research. And I'd like to have a family someday, too.", "It's horrible to be a sex object at any age, but at least when you're an adult you can make the decision if you want to degrade yourself.", "I don't go wagging my boobs around in people's faces. (Rolling Stone (USA), June 2002)", "I couldn't be anorexic because I like food too much, and I couldn't be bulimic because I hate throwing up too much.", "I've wanted to be an astronaut, a doctor, a vet - these are things I've said in interviews. Before that, I wanted to be a mermaid and a fairy.", "I was in a relationship recently with someone who yelled at me for being too much in my head, you know? He said \"I was thinking too much about everything.\".", "I usually run three or four times a week now. Pretty boring, but it's so worth it. It's done wonders for my mood.", "I basically have a little boy's body. They tell me, \"Okay, this is where we're going to push up your cleavage,\" and I'm like, \"What cleavage?\".", "On traveling through Morocco with a guide and sleeping in tents: They knew that I am Israeli, and yet they still opened the doors of their houses for me, offering me tea. They all were nice and hospitable.", "As I look back on it, I'm glad that I had this false image. I was who everyone else - my parents, my friends, society - wanted me to be. I was a pleaser, someone who wanted to make everyone happy, to not let anyone down. Now, I'm not like that.", "My contemporaries in Israel have a love for life that's amazing. There, there is not the luxurious and rich existence of material goods of Hollywood films, every day they struggle to survive, but they still have an enthusiasm difficult to find elsewhere.", "My grandfather was a Polish Jew and a socialist, and as a youngster he helped to organize special camps to teach agriculture to all the young men that were moving to Israel, where in 1930, they created the first kibbutz.", "At college I began to do research for a professor and so I became part of the organization promoted by the Queen of Jordon: the Foundation for International Community Assistance. That offers microcredits, offering small loans of money to women who want to start their own businesses. The interest is very low and the results are extraordinary.", "I'm pretty much a boring Goody Two-shoes. I've definitely gotten drunk before, I don't think it's possible to go through college without getting drunk, but I don't really like it at all. I actually tried my first cigarette last year at school. I just figured, if many people are smoking, there must be something to it, and before I pooh- pooh it I should at least know what it's about. I took one puff and I was like, Okay, I was right. There's nothing to it. They're just wrong, it's disgusting.", "I've been doing like one movie a year so I haven't made that many movies. A lot of girls my age have done 40 already, so I guess I'm a little behind.", "I get like 400 Holocaust scripts. That's what you get for being the openly Jewish actress!", "I wanted to be able to form my own sexual identity. If other people have you in their mind as some sort of sex object, you have two choices: either live up to it and become super-sexual or rebel against it and be super-asexual.", "I'm the anti-Method actor. As soon as we finish a scene, I need to go back to being myself, because it freaks me out. But it was hard not to take this home with me. I would feel cheated on when I went home. There were weekend nights I would lie in bed instead of going out with my friends.", "I had a bad early experience when _Léon: The Professional (1994)_ (qv) came out. I'm really proud of the film, but it was strange for me to be looked at as a sexual object when I was 12.", "I think it is a really beautiful thing that we have recognition within our industry - but it's not that important.", "But we have to remember that almost all films are written and directed by men. Female characters are women imagined by men, so it's always this classic figure of a sexy woman with a childish innocence.", "You walk into a nice strip club, the ones where the women are treated well - obviously 'well' is debatable - and the women just seem so powerful. Women have full control; they can get whatever they want from these guys. But they realise it is a tacit contract: they are that way because men want them to be like that. Obviously, if the men wanted them on the floor scrubbing their shoes they'd probably be doing that too.", "I see that my girlfriends, already at 23, are thinking, \"What career can I choose that will also suit having children?\" And it is limiting. Whereas my male friends aren't thinking that way. (Premiere magazine)", "[about going bald] Some people will think I'm a neo-Nazi or that I have cancer or I'm a lesbian. After all the crazy hairstyles I had to endure for the films, it's quite liberating to have no hair - especially in this heat.", "On filming Star Wars: You learn after your first blue-screen movie, and more after your second, the extent to which you have to prepare. You have to come up with the scenery, the characters, the whole world, as well as what's going on with you. You're often talking to a tape mark instead of a character, and you have to project what they might be thinking, what's going on, how they're treating you.", "On filming _Free Zone (2005)_ (qv) in Jerusalem: I was sleeping five hours a night and we were running from location to location and making up the story as we went along. There's a scene where my arms are uncovered and I'm very close to the guy. People got upset and we moved to another place. It was just crazy because they were calling us Nazis, and I think that's a little much.", "I was the precocious one when I was younger, and now I'm the girlish one, which ultimately means I've stayed the same. Which is not a good sign.", "People think the film industry is going to corrupt me. I wasn't really home when my friends were trying pot for the first time. I was always around adults who wouldn't curse or smoke or do anything like that around me.", "The people whose secrets I most want to know are people who actually have families and marriages as well as careers - people like 'Meryl Streep' (qv), 'Cate Blanchett' (qv) and 'Julianne Moore' (qv). I think that if I were like mid-30s and didn't have kids yet I would probably start adopting or something. Aargh, I don't even have a boyfriend, and I'm talking about kids!", "On starring in _Closer (2004)_ (qv): It's not exploitative, but it is about sex. No kids allowed. It's definitely a different thing for me, but I feel like I'm old enough to handle it now. I sort of understand more how to deal with it publicly, and it doesn't shatter me. I don't have to go to school the next day and have people be like, \"Oh I saw you in that movie; you were very dirty.\".", "I think, especially in those first few years of college, my body started changing a lot. I got hips. Your metabolism changes; you're not exercising as much. I ran track for a couple of years in high school, and I was also dancing. I was always doing something. At Harvard, you don't really join the team unless you're a star.", "(On which of the three Star Wars prequels is her favorite) They are all so very different, Episode III is very dark and much more demanding, we all know that Anakin becomes Darth Vader but to actually see this transition is very painful. So when you have such a dark story to work with it demands you as an actor to work harder. So even though I haven't seen the film yet, I would suppose that the last one is my favorite.", "I began Star Wars when I was 14 and I'm going to be 24 when this final movie comes out, so these movies were 10 years of my life and now I'm just trying to do something different.", "I agree with Walter Murch's theory that digital will never have the emotional or visual power of regular film, because audiences respond to absences. Regular film has a split second of blank screen between each shot, which the audience's brain has to automatically fill in. Digital doesn't have that, so it doesn't engage the audience in the same ways. In all modernist literature, the most present thing is what's absent. Like the opening of The Sound and the Fury, where they're looking between the fence. Or in Closer the most important parts, the relationships, are missing and have to be filled in by the audience. Absences are crucial.", "I was especially fascinated by memory studies. There was one that requested people's good and bad memories, and then checked them for content. But non-pathological people, people who maintain a happy, healthy brain, couldn't provide negative memories. They'd say, \"But I learned this from the experience\"; they'd turn their negative memories into positive ones.", "I get a copy of every action figure from Star Wars. I send them to charity. Some of the really cool ones I keep. Like there's a snow globe thing with one of the spacecrafts in it, which is also a music box, which I really love.", "(Asked if winning the Globe was a shock) God, yes! I was so sure I wasn't going to win it, I went up to 'Meryl Streep' (qv) (nominated for _The Manchurian Candidate (2004)_ (qv)) before the show and said, \"You're going down.\" We'd done a play together, so I knew her pretty well, but to me, it was a big joke, like, I'm going to win against Meryl-yeah, right. When they called my name, all I could think was, oh no, Meryl's going to be mad at me!", "(On the necklace she gave 'Julia Roberts' (qv)) Oh, I made the mistake of telling one person I did that - now everyone loves this story! It was just a joke, because there were lots of dirty words in the script and, every time Julia had to say a bad word, she got all blushy.", "The moment you buy into the idea you're above anyone else is the moment you need to be slapped in the face.", "I actually am starting to feel I should start a revolution against heels, even though that wouldn't be a dramatic revolution. Everyone around me says, \"You have to wear heels.\" It's based on some silly concept that longer legs are more beautiful.", "In seventh grade, I cried every single day when I came back from shooting The Professional. My friends were not my friends. They were saying, \"She thinks she's so hot now,\" things like that, and it was the most painful thing I've ever gone through. Clearly, I haven't had that difficult a life. (Jane Magazine, 1999)", "'Ashley Judd' (qv) and I went to this place called the Broken Spoke. You walk in and everyone's wearing cowboy hats and men come up to you and ask you to dance. We danced the two-step together, and all these men were coming up, saying, \"It's not right to see two ladies dancing. Let us cut in!\".", "There were stories in the house of what had happened to them (her grandparents during the Holocaust), and it wasn't that much talked about. I had to go on a website to read my grandfather's descriptions of what happened to the family.", "[on 'Tom Tykwer' (qv), and working with him during his personal crisis] The very first time we met we were able to tell each other so much about our personal experiences and what we were going through at the moment- my own experience was a similarly difficult and pivotal one for me, though obviously a bit more adolescent than Tom's. It was part of what made the film seem like a joint search for something, a joint expedition.", "[on shooting the strip-club scene fully nude] You can't do this stuff half-assed, pun intended.", "[asked how she would like to be remembered] I don't like that question. That question only provides irony if you prematurely die.", "[Morocco] When I finished _V for Vendetta (2005)_ (qv), I went for a few days as sort of a birthday present for myself. I went out into the desert and an amazing storm was taking place, which is so unusual in the desert. I ended up in a tent with the six strangers whom I had just met, and had traveled with earlier on camel back. There we were, watching this amazing lightening in the middle of the desert. The tent was shaking and it was a really exciting experience.", "I aspire to make more comedies because we never see enough good ones.", "When I was nine and attending a Jewish school, we had different kosher lunches served. We weren't kosher at home. My mom used to make me chicken salad sandwiches and I would have to lie to everyone, saying it was tuna. \"It doesn't smell like tuna,\" they'd say.", "[on preparing for her role as Queen Amidala] George worked with me a lot, on changing my voice and my movement and the way I carried myself. We worked on this accent that... kinda goes to old, older generations of actresses who used kind of an unidentifiable accent. \"Is it American or is it British?\" and I watched 'Lauren Bacall' (qv), 'Audrey Hepburn' (qv), 'Katharine Hepburn' (qv). If you look at them, their voices and the stature is so regal, even in their everyday characters. And that's kinda why I used it to model after.", "[on regretting doing nudity]: I'm really sorry I didn't listen to my intuition. From now on, I'm going to trust my gut more. Sometimes the most powerful thing you can do is say no.", "[on a torture scene she filmed for _Goya's Ghosts (2006)_ (qv)] Last year, I did something that I wasn't comfortable with, and I'm really sorry I didn't listen to my intuition. There was a scene in a movie that felt inappropriate for me, but I didn't want to make waves... From now on, I'm going to trust my gut more. Sometimes the most powerful thing you can do is say 'no'. (Parade magazine)", "[on the dangers of too-early celebrity] I've been lucky enough that most of my big falls have been missed by the tabloids. And I think the other people have not been so lucky. It's a tricky thing, and not necessarily a positive thing,that young people are working and seeking this kind of attention. Getting this sort of attention changes them.", "Overall, to get a real deep, nuanced understanding of human behaviour, art is the best way.", "[on her mixed feelings about nudity] I'm really not prudish about doing nudity. I think it's beautiful in films, and sex is such a big part of life, and nudity is obviously our natural state. That's not my issue. My issue is that I feel it takes something away from what you're doing. And also that it can be used afterwards for different purposes. Misappropriated.", "[on 'Hillary Clinton' (qv)] A lot of the stuff people say about her, I hear it and my stomach falls because it's so sexist. You ask people why they don't like her and it's because her husband cheated on her! That was obviously not her choice. She's so much more polished and experienced than anyone else. Last night, a friend, a social worker in L.A. who works with underprivileged kids, was saying how these girls who have never been interested in politics before are so excited that a woman might be president. I mean, look how many women are in government...Hillary's one of, what, [a handful of] female senators? I also like Obama. I even like McCain. I disagree with his war stance -- which is a really big deal -- but I think he's a very moral person. I met him and Hillary on the same day, actually, when I went to Washington with Finca [a nonprofit that gives loans to businesswomen in developing countries]. Hillary was by far the smartest person I met that day. Just totally focused, and knew more about the issues than anyone else, and was so able to go from one thing to the other.", "(On 'Meryl Streep' (qv)) You look at 'Meryl Streep' (qv), who is so phenomenally, freakishly gorgeous, and in some ways it's just bizarre that she was never a sex symbol. But it was always about her - and now it doesn't matter that she's getting older, because we just want to continue watching her be an interesting person.", "I've always tried to stay away from playing Jews. I get, like, 20 Holocaust scripts a month, but I hate the genre.", "[on 'Scarlett Johansson' (qv)] Seriously, I would really want to grab Scarlett's breasts. She's got beautiful ones.", "There's so much else to do in the world. To just be interested in doing films would limit my life.", "Young actors often don't think of the consequences of doing nudity or sex scenes. They want the role so badly that they agree to be exploited, and then end up embarrassing family, friends, and even strangers.", "[on filming sex scenes in movies] - It's hard to have a sex scene, period. It doesn't matter if it's a friend, a male, a female. You're with 100-something crew members, lighting you, repositioning you, there's no comfort whatsoever.", "[on her role in _Black Swan (2010)_ (qv)] - There were some nights that I thought I literally was going to die. It was the first time I understood how you could get so wrapped up in a role that it could sort of take you down.", "[on her doing kissing scenes and kissing 'Ashton Kutcher' (qv) in _No Strings Attached (2011)_ (qv)] - It's awkward! It's always awkward. It's just weird to kiss someone that you wouldn't choose to kiss in your personal life. You get over it. You laugh through it and act like an immature kindergartner, which is what I did much of the time.", "[on romantic comedies] - I've always wanted to do [a romantic comedy]. But the girls are always in fashion, and it's always about their clothes,\" she explained.They always want to get married at the end. There's some kind of makeover scene. That stuff offends me.", "I want to thank everyone who has ever hired me; 'Luc Besson' (qv) who gave me my first job when I was 11-years old, 'Mike Nichols' (qv) who has been my hero and my champion for the past decade and, now, 'Darren Aronofsky' (qv). You are a fearless leader and visionary. I am blessed to have gotten to work with you every day for the period of time that I did.", "[on her pregnancy and engagement] I have always kept my private life private, but I will say that I am indescribably happy and feel very grateful to have this experience.", "The part I don't like is when what you put out there as part of a story, as art, can be expropriated into something disgusting and objectifying and salacious in another context. Which it all inevitably is in today's media. I'm just aware of that because, yes I'm interested in being in a really provocative film, and no I'm not interested in being on a porn site.", "[on losing weight for her _Black Swan (2010)_ (qv) physique]: I'm a very short person and you're supposed to look very long, and you look longer when you don't have the bulk on you - which is, like, sick. The whole thing. I'm aware that it's sick.", "[on doing her own dancing for _Black Swan (2010)_ (qv)]: I do have a double for the complicated turning stuff, but anything I could do myself saved the budget hundreds of thousands of dollars in special effects.", "[on the _Black Swan (2010)_ (qv) dance controversy]: I know what went on and we had an amazing experience making the movie and I don't want to tarnish it by entering into nastiness. It's such a positive thing what we get to do. We get to create things and I feel so lucky to be a part of that. I'm really proud of everyone's work on the movie and of my experience and I'll have that forever. It's nice for me to always know about that no matter what kind of nastiness or gossip is going around.", "[on 'Sarah Lane' (qv) dance controversy] I did my work and I'm in the majority of the film. I did have a dance double for the most difficult sequences. It was just unfortunate, the entire situation. She's a wonderful dancer and hopefully people will get to see her in her company. I'm sorry that she felt unacknowledged.", "I'm always on the phone because I'm usually not with people I want to be with.", "Someone told me when I was really young not to touch my eyebrows, and that was a really good idea because it was the time when everybody was making their eyebrows really skinny. I am glad I didn't do that because they don't really come back.", "I would say my friends and family are a passion, as I spend most of my time with them. I love dancing, not necessarily ballet, and I love watching dance as well. Those are definitely passions of mine.", "I love being home. My work takes me away so much that it really feels like a vacation being at home and being able to stay in bed all day and not get up. However, I also love traveling and have had amazing trips to many parts of the world.", "Pretty much everyone's role on a film is indispensable -- hundreds of people. Like without a first assistant director? Without a good first AD? Your movie falls to pieces. And those are people who never, ever, ever get interviewed anywhere. And they make the movie. I feel like you could probably run a set better with a good first AD and no director than a good director and no AD.", "'Nicole Kidman' (qv) gave me the advice to always choose a film by its director. You're never certain how the movie will turn out, but you are always guaranteed an interesting experience.", "['Terrence Malick' (qv)'s advice for her directorial debut _A Tale of Love and Darkness (2015)_ (qv)] He kept saying, 'Make films your way and don't let anyone tell you that you need a three-act structure. You just make movies as you experience life.' [2016]", "[on 'Ashton Kutcher' (qv) getting paid three times more than her for their 2011 film No Strings Attached] I wasn't as pissed as I should have been. I mean, we get paid a lot, so it's hard to complain, but the disparity is crazy"], "salary history": ["_Closer (2004)_ (qv)::$1,000,000"], "birth date": "1981-06-09", "birth notes": "Jerusalem, Israel", "_actorID": "62", "_source": "IMDB", "actorID": "0000204", "created_utc_dt": "09/14/2019, 13:02:10"}