{"headshot": "https://m.media-amazon.com/images/M/MV5BOTI3ODk1MTMyNV5BMl5BanBnXkFtZTcwNDEyNTE2Mg@@._V1_UY98_CR1,0,67,98_AL_.jpg", "birth name": "Ryan Rodney Reynolds", "height": "6' 2\" (1.88 m)", "mini biography": ["Ryan Rodney Reynolds was born on October 23, 1976 in Vancouver, British Columbia, Canada, the youngest of four children. His father, James Chester Reynolds, was a food wholesaler, and his mother, Tamara Lee \"Tammy\" (Stewart), worked as a retail-store saleswoman. He has Irish and Scottish ancestry. Between 1991-93, Ryan appeared in _Fifteen (1990)_ (qv), a Nickleodeon series taped in Florida with many other Canadian actors. After the series ended, he returned to Vancouver where he played in a series of forgettable television movies. He did small roles in 'Glenn Close' (qv)'s _Serving in Silence: The Margarethe Cammermeyer Story (1995)_ (qv) and CBS's update of _In Cold Blood (1996)_ (qv). However, his run of luck had led him to decide to quit acting.One night, he ran into fellow Vancouver actor and native 'Chris William Martin' (qv). Martin found Ryan rather despondent and told him to pack everything: they were going to head to Los Angeles, California. The two stayed in a cheap Los Angeles motel. On the first night of their stay, Reynolds' jeep was rolled downhill and stripped. For the next four months, Ryan drove it without doors. In 1997, he landed the role of Berg in _Two Guys, a Girl and a Pizza Place (1998)_ (qv). Initially, the show was reviled by critics and seemed desperate for any type of ratings success. However, it was renewed for a second season but with a provision for a makeover by former _Roseanne (1988)_ (qv) writer 'Kevin Abbott' (qv). The show became a minor success and has led to additional film roles for Ryan, most notably in the last-ever MGM film, a remake of _The Amityville Horror (2005)_ (qv). Ryan was engaged to Canadian singer-songwriter 'Alanis Morissette' (qv), another Nickelodeon veteran, between 2004-2006.He has been married to 'Blake Lively' (qv) since September 9, 2012. They have two children. He was previously married to 'Scarlett Johansson' (qv).::John Sacksteder <jsack@ka.net>"], "spouse": ["'Blake Lively' (qv)::(9 September 2012 - present) ( 2 children)", "'Scarlett Johansson' (qv)::(27 September 2008 - 1 July 2011) ( divorced)"], "trade mark": ["Has appeared in several superhero/comic book adaptations", "Often plays likeable regular guys", "Sarcastic sharp edged wit paired with a frequent stone-faced delivery", "Tattoo on his left wrist"], "trivia": ["Has a fear of flying since he once went skydiving and parachute failed to open at the first attempt.", "Failed his high school drama class.", "Used to work in a grocery store.", "Attended Kwantlen College for a few months before leaving to pursue his acting career.", "Is the youngest of four brothers. Two of his three elder brothers are policemen. His paternal grandfather, Chester \"Ches\" Reynolds, was a Canadian politician and member of the Social Credit Party of Alberta. Chester was an MLA in Alberta from 1940 to 1944.", "Received a Youth in Film Award nomination for best actor for his work on Nickelodeon's teen drama _Fifteen (1990)_ (qv).", "Accompanied musician 'Alanis Morissette' (qv) to the 2003 Canadian Juno Music 'Awards' (qv).", "In early 2001, he met actress 'Rachael Leigh Cook' and the two immediately hit it off. However, Rachael had to fly to Britain shortly after to film _Blow Dry (2001)_ (qv). Ryan ended up surprising her, pulling out of his filming schedule, and following her all the way to London. It was a success and they ended up dating for a year.", "Became engaged to his girlfriend of two years, Canadian singer 'Alanis Morissette' (qv) in June 2004. They announced the engagement was off in June 2006.", "Has expressed great interest in portraying the DC Comics character the Flash, should Warner Bros. ever decide to do a film adaptation of the comic book.", "On the television series episode, _The Outer Limits: If These Walls Could Talk (1995)_ (qv), he played a ghost trapped in a haunted house. Ironically, in _The Amityville Horror (2005)_ (qv), he plays a living man trapped in a haunted house.", "Turned down the role of Xander Harris on _Buffy the Vampire Slayer (1997)_ (qv), which went to 'Nicholas Brendon' (qv), reportedly for his own unpleasant high school experiences. Star 'Sarah Michelle Gellar' (qv) refused to believe this when she was told during a \"Buffy\" trivia quiz promoted by SheKnows.com.", "He was traveling in Indonesia with his former fiancée, 'Alanis Morissette' (qv), when the tsunami struck. They were uninjured since they were staying on the opposite end of the island from where the tsunami hit.", "Ryan alleges he is friends with 'Paul Anka' (qv) and meets with him once in a while.", "(May 5, 2008) Engaged to 'Scarlett Johansson' (qv).", "In 2002, he badly injured his back jumping from a bridge in Zurich, Switzerland.", "Is a huge fan of the Green Bay Packers.", "Married fiancée 'Scarlett Johansson' (qv) in a private Canadian ceremony on September 27, 2008.", "In November 2008, he ran in the New York City Marathon on behalf of the 'Michael J. Fox' (qv) Foundation. His father was diagnosed with Parkinson's disease in 1995.", "Was named the \"Sexiest Man Alive\" by People magazine in 2010. This was during the same time that his wife, 'Scarlett Johansson' (qv) was named as \"Babe of the Year\" by GQ magazine.", "Former brother-in-law of 'Vanessa Johansson' (qv), 'Hunter Johansson' (qv), 'Adrian Johansson' (qv) and 'Christian Johansson' (qv).", "Former son-in-law of 'Karsten Johansson' (qv) and 'Melanie Sloan' (qv).", "Gained 25 pounds of muscle for his role as \"Hannibal King\" in _Blade: Trinity (2004)_ (qv).", "His ancestry is Irish, Scottish, Northern Irish, one eighth Luxembourgish (from Luxembourg), English, and more distant Dutch. Some of his forebears were American-born, including his paternal grandfather, who was born in Chicago, to a Canadian father from Peterborough and an American (Irish-American) mother from New Orleans. His paternal grandmother was born in Kansas. Ryan's maternal grandfather, Neil Alexander Stewart, was a prominent doctor.", "Son-in-law of 'Ernie Lively' (qv) and 'Elaine Lively' (qv).", "Brother-in-law of 'Eric Lively' (qv), 'Bart Johnson' (qv) and 'Robyn Lively' (qv).", "Attended the World Celebrity Pro-Am golf tournament in Haikou, China. [October 2012]", "Lives in ultra trendy Los Angeles neighborhood, Los Feliz. 'Giovanni Ribisi' (qv), 'Bo Barrett' (qv), 'Scarlett Johansson' (qv), 'Chris Pine' (qv), 'Brad Pitt' (qv), 'Mark Ruffalo' (qv), 'Kristen Stuart' (qv), 'Michael Cera' (qv) and 'Robert Pattinson' (qv), 'Hannah Telle' (qv) are among the other actors who also call Los Feliz home.", "One of the few actors to star in films based on comic books from both the Marvel Comics (_X-Men Origins: Wolverine (2009)_ (qv) and the _Deadpool (2016)_ (qv)) and DC Comics (_Green Lantern (2011)_ (qv)) catalogs.", "Has been in three Marvel movies: _Blade: Trinity (2004)_ (qv) (Hannibal King), _X-Men Origins: Wolverine (2009)_ (qv) (Wade Wilson/Deadpool), and the _Deadpool (2016)_ (qv) movie (Wade Wilson/Deadpool).", "He did not enjoy working on _Green Lantern (2011)_ (qv). He admits to having a poor working relationship with director 'Martin Campbell' (qv). Also said that the film's failure, critically and financially, was a huge relief because he did not want to play Hal Jordan, again.", "On April 12, 2015, he was involved in a hit-and-run incident between filming of _Deadpool (2016)_ (qv) in Canada. While walking through a parking garage, he was struck by the car of a paparazzo, who then fled the scene. Reynolds sustained only minor injuries, and later joked about the incident on Twitter.", "Became a father for the first time at age 38 when his wife 'Blake Lively' (qv) gave birth to their daughter James Reynolds on December 16, 2014.", "Along with 'Chris William Martin' (qv), he is one of only two actors to appear in both the first and last episodes of _Fifteen (1990)_ (qv).", "Is the only actor to appear in all 65 episodes of _Fifteen (1990)_ (qv).", "He was awarded a star on Canada's Walk of Fame in Toronto, Ontario in 2014.", "On Halloween 2015, he went Trick-or-Treating with children as the character Deadpool, promoting his role as the title character in _Deadpool (2016)_ (qv).", "Became a father for the second time at age 39 when his wife 'Blake Lively' (qv) gave birth to their daughter Ines Reynolds in September 2016.", "He was awarded a Star on the Hollywood Walk of Fame at 6801 Hollywood Boulevard in Hollywood, California on December 15, 2016.", "Merited a place in Time magazine's \"The 100 Most Influential People\" issue with an homage written by 'Helen Mirren' (qv). [May 2017]", "He first became a fan of Deadpool when he found a comic where Deadpool describes himself as looking like \"'Ryan Reynolds' (qv) crossed with a Shar-Pei\".", "Can do a standing back flip.", "When his 1st daughter was born, a good friend of his (described by Reynolds as someone close enough to him that he was there when the baby was born) tried to sell pictures of her to a tabloid magazine. A furious Reynolds confronted the friend and confirmed the story was true, and then told him their friendship was destroyed and they would never speak to or see each other ever again. The tabloid did not use the pictures because it would have left them open to a massive invasion of privacy lawsuit.", "On May 12, 2018 Reynolds attended a Fußball-Bundesliga match between Hertha BSC and RB Leipzig while promoting _Deadpool 2 (2018)_ (qv) in Berlin, Germany. Talking to sports journalist Jens Westen of Sky Germany before the game, Reynolds revealed that he was an avid soccer player from age 6 to 16. He said while he played with a lot of ambition, he had to realize early on that he would never be good enough to pursue a career as a professional athlete.", "'Ryan Reynolds' (qv) played Seth in _Sabrina the Teenage Witch (1996)_ (qv) where he made mention of the show in the movie _Deadpool 2 (2018)_ (qv). Producer and Author 'Mike Sims' (qv) is a big fan of the Deadpool movies and works with a writer of _Sabrina the Teenage Witch (1996)_ (qv), 'Barney Cohen' (qv) on the TV pitch _The Lazarus Game_ (qv).", "When he was a toddler, a newspaper gave out his address for no apparent reason, accompanying a photo of him at the local pool."], "quotes": ["(on kissing the older woman in _Van Wilder: Party Liaison (2002)_ (qv)) On that note, that being said, it was damn hard kissing her. You've never experienced anything until you've had a mature, darting tongue in your mouth.", "Acting has given me a way to channel my angst. I feel like an overweight, pimply faced kid a lot of the time - and finding a way to access that insecurity, and put it toward something creative is incredibly rewarding. I feel very lucky.", "[on his relationship with 'Alanis Morissette' (qv)] Our relationship couldn't be better. There's no truth to the rumours we would temporarily broken up.", "I never took acting classes, but I knew I could do it based on the skill with which I lied to my parents on a regular basis!", "I'm not a hockey fan, which is probably why I had to leave Canada in the first place.", "(on getting into acting) I started when I was 13 years old. I did a really horrible soap opera called Fifteen for Nickelodeon that stoned college kids kept on the air for three years. And then the first movie I did was in Sri Lanka when I was 14. I spent three months there. I was there without my parents working on a movie in a country that was in the midst of a civil war. It was pretty wild.", "I did two trips in 2006. I did one through New Zealand on a motorcycle, and I tried to cross Australia on a motorcycle from one end of the continent to the other. My friend and I did not make it, unfortunately - he crashed, and we had to find a hospital.", "(on if he gets recognized while traveling) I get noticed depending on where I am. I have no problem wandering all around Spain. But the Germans - ah, the Germans - they are like \"Oh! Van Wilder's a party animal!\".", "(2007) I used to backpack when I was younger. I think I can actually say that I can't do the hostel thing anymore - I'm a little too spoiled.", "I have a discipline that has served me very well in my career and in my personal life... and that's gotten stronger as I've gotten older. I've always felt if I don't just have a natural knack for it, I will just out-discipline the competition if I have to -- work harder than anybody else.", "(2010, on _Van Wilder: Party Liaison (2002)_ (qv)) It made me the party guy. I would walk into a bar and people would start lining up the shots. You could sum up my career at that point as a free shot at a bar. I know it affected me more than I'm revealing, because I know that I went years without even saying the words \"Van Wilder\". Even now, when I say it, it's a bit of a big moment for me.", "(on filming _Buried (2010)_ (qv)) I'll never, ever in my life complain on a set again after being on that set. Sixteen, seventeen days of doing that... It was such a state of emotional distress.", "[on _The Nines (2007)_ (qv)] That was such a wake-up call for me. The movie was made on less than a million dollars. I loved the process. I loved the character I was given to play. I learned a lot about filmmaking from 'John August' (qv), who was directing. That was the birth of my own ambition. There were particular films after that that I went after. I had a new view.", "[on _Buried (2010)_ (qv)] It's one of those rare movies that you experience more than you watch it. The selling point to me was that script had both a narrative challenge and a technical challenge. It's rare to find a script that has both. People like Hitchcock, that's all he looked for. Films like _Rope (1948)_ (qv) and _Lifeboat (1944)_ (qv) and _Rear Window (1954)_ (qv), that was what they were all about. I had a lot of confidence in Rodrigo, though. He sent me a comprehensive, 15-page treatise on why he wanted to make the film. That hooked me. It's not the most glamorous role. You get in the box and as an actor you have to do these things that are embarrassing, frightening and raw. It was an adventure.", "[on the effect the title of \"Sexiest Man Alive\" would have on his wife, 'Scarlett Johansson' (qv)] Now it's going to be, 'Sexiest man, take out the garbage'. That does sound better.", "I'm always terrified at the beginning. Then I start working and get past my fear, which is the real win for me. Just like Hal [Jordan in _Green Lantern (2011)_ (qv)] I'm used to stepping forward in the face of whatever fears I've created for myself. The stunts on the ground I can do, but I've never been good with heights.", "When I was a little kid - maybe nine or ten - I was a complete asshole. I would run around the neighborhood on Halloween throwing firecrackers in people's mailboxes, at their houses, and things like that. We were just these little hell raisers. I'm sure I have a lot to atone for, if there is a judgment day. It's gonna be a long list for me. It goes right up until I was about 18 and then I sort of straightened out.", "For every character I play, there's ten others I've read that went to another actor because he's better qualified for the role, or for whatever reason, who knows - it's always a very mercurial process.", "As an actor, you're always kind of cognizant that you'll never work again. You always have this lizard-brain fear, always, just under the surface, that this is it. Because you see it. I've been fortunate enough to have a 23-year career so far. I've watched people come and go and vanish. I've watched really talented people never get that invaluable foothold into the industry. So you're always walking that tightrope of being very grateful that you're in this position.", "I used to say to [Blake], \"I would take a bullet for you. I could never love anything as much as I love you.\" I would say that to my wife. And the second I looked in that baby's eyes, I knew in that exact moment that if we were ever under attack, I would use my wife as a human shield to protect that baby.", "[having lost interest in The Flash, the comic book adaptation to which his name was once attached] I have no desire to wear a red leotard for three pictures over 10 years.", "[2007, lighting what he calls \"a horrible little cigarette\" while grimacing with self-contempt] I had quit, but then I had to smoke in my last two movies.", "[on his \"Know Thyself\" tattoo that he got in 1998] It was about disappointing my parents.", "[observation, 2019] Some of the stuff I've done in the past that you would characterize as maybe-didn't-work were moments where I was stepping into the archetypal leading-man role. It's just not something I've ever been really that great at, to be totally blunt. But I have immense respect for those who are great at it. I also think that our idea of a traditional leading man, archetypal male is changing wildly day to day, over the last five years in particular. And I think that's great. I think that's evolution, to put in in Pikachu terms.", "I'm terrified that I'm genetically predisposed to only having boys. That's frightening. By the time I was 10 years old, and I'm not exaggerating, I knew how to patch drywall.", "I think every relationship is going to go through a few rough patches. Those are what make it stronger, I think."], "salary history": ["_Deadpool (2016)_ (qv)::$2,000,000 plus box-office bonuses"], "birth date": "1976-10-23", "birth notes": "Vancouver, British Columbia, Canada", "_actorID": "70", "_source": "IMDB", "actorID": "0005351", "created_utc_dt": "09/14/2019, 13:02:17"}