{"headshot": "https://m.media-amazon.com/images/M/MV5BYTFiMWNlNmItMDRiYy00NzA4LWE5YjItZmViNWQ2NzhhOWZlXkEyXkFqcGdeQXVyMTA2Mjc5ODMy._V1_UY98_CR4,0,67,98_AL_.jpg", "nick names": ["JB", "Jables"], "birth name": "Thomas Jacob Black", "height": "5' 6\" (1.68 m)", "mini biography": ["'Jack Black' (qv) was born Thomas Jacob Black in Santa Monica, California, to Judith Love (Cohen) and Thomas William Black, both satellite engineers. He is of British-German (father) and Russian Jewish (mother) ancestry. Black attended the University of California at Los Angeles. While at UCLA, he was a member of 'Tim Robbins' (qv)'s acting troupe and it was through this collaboration that led to his 1992 film debut in _Bob Roberts (1992)_ (qv). Although he was just a background voice in his first film, Jack's appearances in such television shows as _The X-Files (1993)_ (qv), his breakthrough performance in _High Fidelity (2000)_ (qv), and his rock-comedy band, 'Tenacious D' (qv), have created an ever-growing cult following.::Anonymous"], "spouse": ["'Tanya Haden' (qv)::(14 March 2006 - present) ( 2 children)"], "trade mark": ["Starts speaking in a slow, quiet tempo and begins to sing in a faster louder cadence.", "Often plays slackers or sloppy infantiles", "Expressive eyes/eyebrows", "Stocky frame"], "trivia": ["One half of the rock band 'Tenacious D' (qv) alongside friend and collaborator 'Kyle Gass' (qv).", "Filmed a television pilot called _Heat Vision and Jack (1999)_ (qv) co-starring 'Ron Silver' (qv), and 'Christine Taylor' (qv), and directed by 'Ben Stiller' (qv). The series was a parody of _Knight Rider (1982)_ (qv), as well as other action adventure series, and featured a talking motorcycle voiced by 'Owen Wilson' (qv).", "Discovered he could act when he played a game of Freeze after a Passover seder.", "Revealed on an Australian late night variety show that his favorite 'KISS' (qv) rock song is \"I Love it Loud\" (1982) where he began singing parodied lyrics to the first verse.", "Often competes for the same roles with 'Philip Seymour Hoffman' (qv). On the DVD audio commentary for _School of Rock (2003)_ (qv), he jokingly calls Hoffman \"my nemesis\".", "Attended Crossroads High School for the Arts and Sciences.", "Is a member of, what the media refers to as the Frat Pack along with 'Will Ferrell' (qv), 'Ben Stiller' (qv), 'Vince Vaughn' (qv), 'Owen Wilson' (qv), 'Steve Carell' (qv) and 'Luke Wilson' (qv). The Frat Pack name is a reference to the film _Old School (2003)_ (qv), which features Vaughn, Ferrell, and Wilson, due to the wide number of films featuring the seven actors. Black's \"Frat Pack\" films include _The Cable Guy (1996)_ (qv), _Envy (2004)_ (qv), and _Anchorman: The Legend of Ron Burgundy (2004)_ (qv).", "Starred in a management training film \"Manager of the Year - Effective Listening\" (1987) as a teenager who tells his father that the family car has been stolen.", "Had his gall bladder removed.", "Hosted the MTV Movie 'Awards' (qv) along with 'Sarah Michelle Gellar' (qv) (2002).", "Sang backup vocals for the songs in _Bob Roberts (1992)_ (qv).", "One of his closest friends is 'Dave Grohl' (qv).", "Is good friends with 'Tim Robbins' (qv), 'Cesar Gonzalez' (qv) and 'Will Smith' (qv).", "Attended Poseidon School in Santa Monica, California.", "Despite poking fun at the genre, he is actually a very knowledgeable fan of hard rock/heavy metal music from the 1970s and 1980s. He even appears as part of 'Tenacious D' (qv) in 'Ronnie James Dio' (qv)'s music video for the song \"Push\".", "Appears in a parody of the Council of Elrond scene shown during the MTV Movie 'Awards' (qv). The Lord of the Rings director 'Peter Jackson' (qv) later cast him in _King Kong (2005)_ (qv).", "His parents, who were both rocket scientists, divorced when Black was 10. His mother, 'Judith Love Cohen' (qv), worked on the Hubble space telescope.", "Originally met his wife in high school. They both attended Crossroads, a private school. They met again 15 years after they graduated high school at a friend's birthday party.", "Wife, 'Tanya Haden' (qv), is a cellist. She is the daughter of jazz great 'Charlie Haden' (qv).", "His wife is a triplet. Her sisters, 'Petra Haden' (qv) and 'Rachel Haden' (qv), also musicians, used to be members of the band \"That Dog\". Petra was also a former member of the band 'The Decemberists' (qv). Their brother is 'Josh Haden' (qv).", "He and his wife eloped after dating less than a year. They were married in Big Sur, California by the same minister who performed 'Shane Stanley' (qv) and 'Val Barri' (qv)'s ceremony (2005).", "Auditioned for the role of Cubby Barnes in _Ransom (1996)_ (qv), which went to 'Donnie Wahlberg' (qv).", "Mentioned in the song \"High School Never Ends\" by 'Bowling for Soup' (qv), as \"the clown\".", "Was considered for the role of Freddy Lounds in _Red Dragon (2002)_ (qv), which went to 'Philip Seymour Hoffman' (qv).", "Said he considers 'The Who' (qv) to be the greatest band of all time, explaining that \"they were the first ones to ever rock HARD... the recklessness, the deliciousness!\".", "Was engaged to actor/comedian/producer 'Laura Kightlinger' (qv), previously. They were together from 1997 to 2005.", "Was considered for the role of Hal Jordan / Green Lantern in an unproduced screenplay by 'Robert Smigel' (qv). The idea was ultimately scrapped by Warner Brothers for a less comedic screenplay.", "Jack's paternal grandfather, Thomas Walter Black, had English, Scottish, and Scots-Irish/Northern Irish ancestry, partly by way of Canada, and Jack's paternal grandmother, Gladys Rose Zachman, was from an ethnic German family that lived in Romania and Ukraine. Jack's maternal grandparents, Morris Cohen and Sarah Roisman, were Russian Jewish immigrants. Jack's father converted to Judaism when he married Jack's mother.", "Became a father for the first time at age 36 when his wife 'Tanya Haden' (qv) gave birth to their son Samuel Jason Black on June 10, 2006.", "Became a father for the second time at age 38 when his wife 'Tanya Haden' (qv) gave birth to their son Thomas David Black on May 23, 2008.", "He and 'Kirsten Dunst' (qv) were considered for _Land of the Lost (2009)_ (qv). Black was in _Jumanji: Welcome to the Jungle (2017)_ (qv) and Dunst was in _Jumanji (1995)_ (qv).", "He was awarded a Star on the Hollywood Walk of Fame at 6144 Hollywood Boulevard in Hollywood, California on September 18, 2018.", "Born on the same date as 'Jason Priestley' (qv).", "Done commentary for a pro wrestling event."], "quotes": ["[on filming the love scene in _Shallow Hal (2001)_ (qv)] It was just strictly professional. It was like a doctor or a carpenter plying his trade. I received no pleasure whatsoever... I requested 32 takes for the perfection of the craft.", "Never for a second did I think of myself as the sexiest guy in the world. When I was a kid, I thought I was the strongest man in the world. Then the fastest runner and then the smartest person in the world. One by one, my delusions got shut down. Now I just see myself as the lamest guy in the world.", "[on co-starring with 'Gwyneth Paltrow' (qv) for the first time in _Shallow Hal (2001)_ (qv)] You know, I WAS a little afraid that she would fall head-over-heels in love with me, like she did [when co-starring] with 'Brad Pitt' (qv) in _Se7en (1995)_ (qv).", "I'd just like to be in films that I would like to see. I think of myself as an entertainment arsenal. Like I have my acting bazooka and my music machete. And you don't know what I'm going to come at you with.", "I was a little worried about working with kids. I wanted to make sure we didn't approach it tip-toeing around the stuff that would normally be funny, or make it gentle, rock-a-bye-baby bullshit.", "I'm no 'Matt Damon' (qv), my goal was to be a character actor. I never thought I would get leads the way that I've been able to in the past two years.", "I'm hungry for rock 24/7.", "The movie _This Is Spinal Tap (1984)_ (qv) rocked my world. It's for rock what _The Sound of Music (1965)_ (qv) was for hills. They really nailed how dumb rock can be.", "I'd rather be the king of kids, than the prince of fools.", "There's nothing you can really do to prepare to rock. Do you prepare to eat a delicious meal? Are you hungry? Then you're gonna eat it.", "You must never underestimate the power of the eyebrow.", "I played, like, a year of piano until I learned _The Pink Panther (1963)_ (qv) theme. That was my goal. Once I was good enough, I quit. Now, my music has to have some rock.", "If Beethoven and Bach hooked up with Mozart and made a band, they COULD be a distant runner up to The D.", "[on his experiences early on in his career] It wasn't about control. It was about the co-lla-bo. There's great directors who treat actors like cattle, but I hated it, and I knew if I ever had a choice, I didn't want to work with those guys. Who said that thing about actors and cattle? Hitchcock ['Alfred Hitchcock' (qv)]? Yeah, I don't want to work with that dude.", "[on his role and his tights in _Nacho Libre (2006)_ (qv)] At first, I would have rather been naked to tell you the truth, because I just look so goddang ridiculous. But then I thought, \"Wait, that's my job. The stretchy pants are my friends. I love the stretchy pants!\" It just took a little mental adjustment, because I know that when I'm embarrassed and scared about acting, that means I'm going to get some good life-nugget knowledge out of it. And I love the knowledge nuggets.", "I should take down someone who is strong, so 'Steven Seagal' (qv) would be perfect - with his ridiculous Indian gear, ponytail and swagger. He's the best fighter in the world in his own mind, so I'll take him down two notches with my Anaconda Squeeze and Face Melter.", "[when asked about his cooking skills] I make a mean peanut butter and jelly sandwich.", "[on _Shallow Hal (2001)_ (qv)] I wasn't proud of it, and I got paid a lot of money, so in retrospect it feels like a sell-out.", "[on his role in _Margot at the Wedding (2007)_ (qv)] I had to show some darker sides of myself than I have in roles past. It was challenging. I was most worried about the crying scenes and the nudity. But I sucked it up and went to those places because I just had to look over at Jennifer ['Jennifer Jason Leigh' (qv)] who was so fearless in her performance.", "Nobody cares about my babies. It's all about Angelina [Jolie]'s babies.", "I said I named the baby after me. I didn't say that my actual name is Thomas.", "When I was ten years old, I fell in love with 'The Who' (qv). I saw the film _Tommy (1975)_ (qv) on cable television and despite 'Jack Nicholson' (qv)'s heinous rendition of \"Go to the Mirror!\", I was deeply moved by the music and the story. I wasn't deaf, dumb or blind but I could relate to Tommy. I too wanted to be seen, felt and healed. Seriously, not going for the laugh [directed to audience]. I had a supportive family but growing up can be tough no matter what your upbringing. And no other band had the courage or sensitivity to write those kinds of emotionally raw songs. Achingly beautiful melodies touched by the hand of god. Or the devil. Or both. Or neither. I must say neither. Just a collection of ass-kicking songs, the likes of which will never be seen again! On the battlefield of rock, they went toe to toe with the likes of Hendrix and emerged unscathed. Triumphant dragon-slayers of emotionality. And about now they're probably wondering why I was chosen to give this speech. Surely there was someone more qualified. \"Why is this moron talking about dragons and emotions?! Who does he think he is?\". Who? I'm just one of the millions. Roger Daltrey, Pete Townshend. Thank you for blowing our minds and touching our hearts.", "I like to improv. If I'm not feeling a scene down to Po's panda bones, I'll just keep tweaking it.", "[on the difficulty of getting _Frank or Francis_ (qv) made] It's just because the script and the subject matter. It's just too good. When I say too good, I mean it's just too dark and real and strange and wonderful. Investors don't think it's a safe bet. The industry has changed. It's not enough to be brilliant any more. You have to be a sure thing. It's just so short-sighted, so shitty. If I was a billionaire, I'd throw the money at it."], "salary history": ["_High Fidelity (2000)_ (qv)::$250,000", "_Saving Silverman (2001)_ (qv)::$1,000,000", "_Shallow Hal (2001)_ (qv)::$2,000,000", "_Orange County (2002)_ (qv)::$2,000,000"], "birth date": "1969-08-28", "birth notes": "Hermosa Beach, California, USA", "_actorID": "84", "_source": "IMDB", "actorID": "0085312", "created_utc_dt": "09/14/2019, 13:02:30"}