{"headshot": "https://m.media-amazon.com/images/M/MV5BNzg3MTgwOTgzMV5BMl5BanBnXkFtZTgwODIxMTUwMjE@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Monkeyboy"], "birth name": "Christopher Michael Pratt", "height": "6' 2\" (1.88 m)", "mini biography": ["Christopher Michael Pratt is an American film and television actor. He came to prominence for his small-screen roles, including Bright Abbott in _Everwood (2002)_ (qv), Ché in _The O.C. (2003)_ (qv), and Andy Dwyer and _Parks and Recreation (2009)_ (qv), and notable film roles in _Moneyball (2011)_ (qv), _The Five-Year Engagement (2012)_ (qv), _Zero Dark Thirty (2012)_ (qv), _Delivery Man (2013)_ (qv), and _Her (2013)_ (qv). In 2014, he broke out as a leading man after headlining two of the year's biggest films: he voiced Emmet Brickowoski, in _The Lego Movie (2014)_ (qv), and starred as Peter Quill / Star-Lord in _Guardians of the Galaxy (2014)_ (qv). In 2015, he headlined the sci-fi thriller _Jurassic World (2015)_ (qv), the fourth installment in the Jurassic Park franchise and his most financially successful film. In 2016, he co-starred in the remake _The Magnificent Seven (2016)_ (qv), with 'Denzel Washington' (qv) and 'Ethan Hawke' (qv), and appeared with 'Jennifer Lawrence' (qv) in the sci-fi drama _Passengers (2016)_ (qv). In the near future, he returns as Star-Lord for _Guardians of the Galaxy Vol. 2 (2017)_ (qv), with _Jurassic World: Fallen Kingdom (2018)_ (qv) not far behind.He was born in Virginia, Minnesota, to Kathleen Louise (Indahl), who worked at a supermarket, and Daniel Clifton Pratt, who remodeled houses. His mother is of Norwegian descent and his father had English, German, Swiss, and French-Canadian ancestry. Chris grew up in Lake Stevens, Washington state. He is married to fellow Washington State native, 'Anna Faris' (qv), whom he met on the film set of _Take Me Home Tonight (2011)_ (qv), and with whom he has one child, Jack Pratt. Chris's hobbies include fishing, hunting and working on cars. He has two older siblings, Cully and Angie.::Pedro Borges"], "spouse": ["'Katherine Schwarzenegger' (qv)::(8 June 2019 - present)", "'Anna Faris' (qv)::(9 July 2009 - 16 October 2018) ( divorced) ( 1 child)"], "trade mark": ["Affable, gregarious if somewhat goofy persona", "Says \"dude\" a lot, on screen and off", "Tall stature"], "trivia": ["Has two older siblings: Cully Pratt and Angie Pratt.", "Hobbies include fishing, hunting and working on cars.", "Engaged to 'Anna Faris' (qv) on January 30, 2009.", "Attended and graduated from Lake Stevens High School in Lake Stevens, Washington (1997).", "Chris and his ex-wife, 'Anna Faris' (qv), each had a dead bug collection before they met and they have since combined their collections.", "Became a father for the first time at age 33 when his now ex-wife 'Anna Faris' (qv) gave birth to their son Jack Pratt on August 25, 2012.", "Chris worked at Bubba Gumps Restaurant in Hawaii when he met 'Rae Dawn Chong' (qv), who helped him get his start acting.", "His father had English, German, Swiss-German, and French-Canadian ancestry. His mother is of entirely Norwegian ancestry.", "Has appeared in a film that was Oscar-nominated for Best Picture for three consecutive years: _Moneyball (2011)_ (qv), _Zero Dark Thirty (2012)_ (qv) and _Her (2013)_ (qv).", "Has starred in two films with 'Morgan Freeman' (qv) about ordinary individuals, abducted by tough women, to fulfill an extraordinary destiny: _Wanted (2008)_ (qv) and _The Lego Movie (2014)_ (qv).", "He was awarded a Star on the Hollywood Walk of Fame at 6834 Hollywood Boulevard in Hollywood, California on April 21, 2017.", "Friends with 'Aubrey Plaza' (qv).", "He once worked as a stripper before his career took off.", "Was homeless and lived in his van before his career took off.", "Conversational in German, which he studied for three years in school.", "In a game of \"Guess That Guardian\" on _Jimmy Kimmel Live! (2003)_ (qv), it was revealed that he once gave a piece of concrete to his German teacher claiming that it was a piece of the Berlin Wall.", "In August 2017, Pratt and 'Anna Faris' (qv) announced that they had filed for legal separation after eight years of marriage. They both filed for divorce in December 2017, citing irreconcilable differences.", "Voiced promos for group stage matches of the 2018 FIFA World Cup.", "Announced his engagement to 'Katherine Schwarzenegger' (qv) on Instagram [January 13th, 2019].", "Son in law of 'Arnold Schwarzenegger' (qv) and 'Maria Shriver' (qv). Great nephew in law of President John F. Kennedy and senators Robert and Ted Kenendy.", "Son-in-law of 'Arnold Schwarzenegger' (qv) and 'Maria Shriver' (qv).", "Brother-in-law of Christina, Patrick and Christopher Schwarzenegger. Half-Brother-in-law of Joseph Baena."], "quotes": ["[on dating _Everwood (2002)_ (qv) co-star 'Emily VanCamp' (qv)] We've pretty much gotten used to the response of, \"Eww, that's weird. That's creepy.\" The people who know us are happy, and probably expected it to happen eventually. But yeah, every once in a while we get that one person that's like, \"That's really creepy. You just kissed your sister.\" We thought it was weird for six months, but it had more to do with just trying to hide our relationship from the set. I don't know why, and looking back on it, it was foolish. But we were trying to stay secretive and didn't want it to get out there. It never really weirded us out that we played brother and sister, because, you know, it's all fiction.", "[on dating _Everwood (2002)_ (qv) co-star 'Emily VanCamp' (qv)] Obviously, they can never tell you not to date anybody on set. But it's always looked at as being a bit, \"You should be a little apprehensive about getting involved with somebody that you work with.\" But we weren't apprehensive at all. We just said, \"Fuck it. Let's just go for it, because it's important to us.\" But, that being said, other people may have had doubts or suspicions about us being able to last and this and that. Basically, once we get on set, we really just kind of became our characters and left our relationship behind. We would sneak a kiss here and there, but we would try and stay as professional as possible so no one would get uncomfortable. We certainly would never bring any arguments to the set or anything like that.", "You can pour melted ice cream on regular ice cream. It's like a sauce!", "I have a pet lizard named Puff, five goldfish - named Pinky, Brain, Jowels, Pearl and Sandy, an oscar fish named Chef, two pacus, an albino African frog named Whitey, a bonsai tree, four Venus flytraps, a fruit fly farm and sea monkeys.", "The only way physical comedy works is if you don't see it coming. And the harder the fall, the funnier it is. You have to really take some shots, and I've walked away with some bumps and bruises.", "Just be comfortable with who you are.", "Just be yourself and forget all of the stuff you read in 'GQ' magazine.", "I know this may come as a shock to most of you, but I've decided to quit acting. I will not be auditioning for anything anymore, and if I get offered something like a role in a movie or a commercial or something, I will graciously turn it down. It's been great, but its just not for me anymore.", "Being in good physical shape is the best way to combat depression. You just have endorphins running around your body. It is the best anti-depressive that there is.", "I have a lot of plants and fish and a pet lizard and Venus flytraps. I have a whole ecosystem in my room, like a running waterfall and different lights and sensors set on digital timers.", "You know, I just tend to grow my beard out for _Parks and Recreation (2009)_ (qv). As an actor, it's always easier to shave or cut your hair for a role, but it's hard to put fake hair on or grow hair for a role. When you look at pictures of me, the longer my hair is, the longer my facial hair is, that's just the longer I haven't gotten a job.", "The key is just to ignore the pain, because physical comedy only works if you see someone get hurt and they aren't actually hurt. If someone gets hit in the face with a bat, falls down, and gets back up, it's funny. If they stay down and their jaw is wired shut in the next scene, it's really tragic and weird. You have to pretend it doesn't hurt.", "My favorite way to blow off steam is to sing obnoxiously loud in the shower.", "I have some weird habits. For instance, I love beets. Show me a salad bar and I will clean them out of their beets.", "It's interesting - I always thought when I was doing more melodramatic stuff like 'Everwood' that the directors were constantly reeling me in and stopping me from being funny.", "There's nothing funnier than a giant, grown man rollerblading.", "With comedy, it's a combination of knowing the comedic beat was good - it made you laugh, it made people on the crew laugh. With drama, you do something deep and if your stuff was really effective, the ultimate result is silence. Silence is not necessarily... that would also be the result if you sucked.", "Both _The O.C. (2003)_ (qv) and _Everwood (2002)_ (qv), there were people, on set, where you learned to stay away from them on a bad day.", "I married way out of my pay grade. I have no idea how that happened.", "You get to a point where you have to start planning, when you cross that line where you have enough value to get someone's movie made if you attach yourself to it, you have to be very thoughtful and have to plan. When you're starting out, you're willing to do anything.", "As long as I keep getting cast, I don't care if it's typecast.", "I love _Capote (2005)_ (qv) . Huge fan of 'Philip Seymour Hoffman' (qv); if he's not my all-time favorite actor, he's definitely in my top five. I just love him so much.", "I've always been a little soft. I like to eat.", "You want to be with a girl who likes you for you. Just be yourself and forget all of the stuff you read in 'GQ' magazine.", "Most of the writers in TV are from L.A. or New York, and those are places where people are cynical and snarky. And they fly from L.A. to New York in an airplane over this vast, expansive land where people aren't snarky; they're a lot more like the _Parks and Recreation (2009)_ (qv) characters.", "I was an athlete growing up. I was a wrestler, I played football, so I can take a fall. I actually wanted to be a stuntman when I was kid, so I would practice falling down the stairs. It's just something I like to do.", "I primarily have had my career in comedy, and that is something that I have never been too concerned about because I know there is really no room for vanity in comedy. Comedy comes from pain and it is a lot easier to empathize with somebody who is out of shape.", "People have told me I look like 'Gordon Lightfoot' (qv).", "Some people fast, some people go on a cruise or visit a day spa. I get out in the woods with a rifle or a bow. That's my release.", "Television is such an evolving medium. When you're doing a TV show, it's not like you just shoot for six weeks and you're in an editing room with all of your footage. It's like a guitar or a car, you have to fine tune things. You stop doing what's not working, you work on what is working and you add things that do work.", "If one day someone came up to me and was like, 'Look, you're never going to act again,' I don't know what I would do.", "The American audience has really opened up to women being A.) funny and B.) kinda crude. _Bridesmaids (2011)_ (qv) is R-rated, and I think it was a major coup for women to have an R-rated comedy that did really well. Same as _Bad Teacher (2011)_ (qv).", "My first in, my first break, was I met a director and got to talking with her, and she happened to be casting this movie that she had written. That was ten years ago. That got me to Hollywood. I got paid $700 bucks.", "When you're working with film, you can only shoot one angle at a time, and then everything has to stop, and you re-light it and shoot everything else from the opposite side, so it's really important that you stick exactly to what's written.", "I was an athlete growing up and I miss that. I miss hanging out with dudes and making raunchy jokes and telling stories, trading details, you know? There's something I really miss about that.", "To go to the Oscars for _Moneyball (2011)_ (qv) - that was pretty amazing. And to be able to go work with 'Kathryn Bigelow' (qv) - that's going to be pretty sweet. Hopefully I don't have to go back to being a waiter. That's still my main goal.", "I'm still fighting really hard to get any role I get. If it's comedy, I go for the laughs. And if it's drama, I try to tell the truth, and try to play the real stakes of whatever scenario the character's in.", "I don't have any delusions. I don't think I would make it through Navy SEAL training.", "My favorite animal to hunt is probably elk. There's nothing like the sound of a bugling bull splitting the cold air at first light. And that smell is unmistakable. Once you experience their musk in the wild there's no going back! A close second would be a varmint hunt.", "I'd love to work with 'Steve Martin' (qv). I'd love to work with 'Bill Murray' (qv) and 'Dan Aykroyd' (qv).", "_10 Years (2011)_ (qv) was probably - I might say \"10 Years\" was my favorite filming experience of anything I ever worked on. It was totally different from _Moneyball (2011)_ (qv), in that it was a small budget, independent movie. It had a giant ensemble of actors, all of whom were basically working for free.", "Who knew 'Rob Lowe' (qv) was funny? On _Parks and Recreation (2009)_ (qv), we've got some of the funniest comedy writers, some of the funniest comedians in the world working there. And if anything, we don't just effuse to one another and be like, 'Oh, 'Rob Lowe' (qv)'s really funny,' if he wasn't.", "Celebrity is intoxicating.", "When you're doing a TV show, it's not like you just shoot for six weeks and you're in an editing room with all of your footage. It's like a guitar or a car, you have to fine tune things. You stop doing what's not working, you work on what is working and you add things that do work.", "A friend bought me a plane ticket to Hawaii, which is where I got discovered and became an actor, so I guess a friend bought me a winning lottery ticket.", "You get to a point where you have to start planning, when you cross that line where you have enough value to get someone's movie made if you attach yourself to it, you have to be very thoughtful and have to plan.", "I lose my cell phone so much that I switch it every month or so, but Sony Ericsson is usually what I use.", "To go to the Oscars for _Moneyball (2011)_ (qv) - that was pretty amazing.", "I went from 220 pounds that I cut down for _Moneyball (2011)_ (qv) to almost 270-280 pounds for _10 Years (2011)_ (qv).", "Television is such an evolving medium.", "I like to do 'Garfield Mondays': lasagna and napping in a box.", "I've eaten weird things through the course of my life. I've eaten wild game, I've eaten possum - possum's no good.", "[on how he prepares for his shirtless scenes] It's good to know the day I'm going to be shirtless because then I can plan to really peak on that day. I have a whole routine that I took from a bodybuilder. I was also a wrestler back in the day so I already knew how to dehydrate myself to cut weight but that was to create a low body weight and wasn't to create an aesthetic, unlike now. So I have a routine and it takes about a week - dehydration, cutting out carbohydrates, doing a series of salt baths and also flattering body make-up you know like a spray tan. And before the shot I'm doing push-ups, pull-ups and I have some dumbbells there. And you know the main thing you have to lose? Shame! On set, you have to be like, \"Yeah, I am the douche doing bicep curls just before my scene. There's a 100 of you and you are all judging me right now. But guess what, there's going to be millions of other people judging me at a later date.\""], "salary history": ["_Passengers (2016)_ (qv)::$12,000,000", "_Jurassic World: Fallen Kingdom (2018)_ (qv)::$10 .000.000"], "birth date": "1979-06-21", "birth notes": "Virginia, Minnesota, USA", "_actorID": "9", "_source": "IMDB", "actorID": "0695435", "created_utc_dt": "09/14/2019, 13:01:19"}