{"headshot": "https://m.media-amazon.com/images/M/MV5BNTk2OGU4NzktODhhOC00Nzc2LWIyNzYtOWViMjljZGFiNTMxXkEyXkFqcGdeQXVyMTE1NTQwOTk@._V1_UY98_CR4,0,67,98_AL_.jpg", "height": "6' (1.83 m)", "mini biography": ["'Sebastian Stan' (qv) was born on August 13, 1982, in Constanta, Romania. He moved with his mother to Vienna, Austria, when he was eight, and then to New York when he was twelve. Stan studied at Rutgers Mason Gross School of the Arts and spent a year at Shakespeare's Globe Theatre in London.When he went back to New York he started working in some projects like _Law & Order (1990)_ (qv), _Tony 'n' Tina's Wedding (2004)_ (qv) and _Red Doors (2005)_ (qv). Upon finishing college, he played Martin Waters in _The Architect (2006)_ (qv), Chase Collins in _The Covenant (2006)_ (qv) and worked in 'Eric Bogosian' (qv)'s theater play The Talk (2007). Also in 2007, Stan started playing Carter Baizen in _Gossip Girl (2007)_ (qv). His following projects were _Spread (2009)_ (qv), _Kings (2009)_ (qv), _Hot Tub Time Machine (2010)_ (qv), and _Black Swan (2010)_ (qv). He landed also the role of Bucky Barnes in _Captain America: The First Avenger (2011)_ (qv). In 2012, Stan worked in several projects: _Gone (2012)_ (qv), _Political Animals (2012)_ (qv), _The Apparition (2012)_ (qv), _Once Upon a Time (2011)_ (qv) and the mini series _Labyrinth (2012)_ (qv). In 2013, he was in Broadway's Picnic and in 2014 he was introduced as The Winter Soldier in the Marvel universe in _Captain America: The Winter Soldier (2014)_ (qv). He has continued his role as Bucky Barnes/The Winter Soldier in [=tt3498820], _Black Panther (2018)_ (qv) and _Avengers: Infinity War (2018)_ (qv). Other notable projects include _Ricki and the Flash (2015)_ (qv), _The Martian (2015)_ (qv), _The Bronze (2015)_ (qv) and _Logan Lucky (2017)_ (qv). He was given high praise for his work in the recent _I, Tonya (2017)_ (qv).::'Sebastian Stan' (qv) Spain"], "trivia": ["Is friends with his co-stars 'Toby Hemingway' (qv) and 'Chace Crawford' (qv) from _The Covenant (2006)_ (qv).", "He is Romanian. At age 8, his mother moved with him from Romania to Vienna, Austria, where she was employed as a pianist. When he was age 12, they moved to Rockland County, New York, where his mother married the headmaster of an American private school.", "He is an only child.", "He speaks English and Romanian fluently. In _Captain America: Civil War (2016)_ (qv) he actually speaks Romanian in the first scene set in Bucharest, Romania.", "Graduated from Rutgers University in New Brunswick, New Jersey with a BFA in Acting.", "Attended the famous performing arts summer camp Stagedoor Manor.", "Before being cast as James \"Bucky\" Barnes in _Captain America: The First Avenger (2011)_ (qv), he was considered for the 'Steve Rogers/Captain America' part.", "Did all his own stunts in the movie _The Covenant (2006)_ (qv).", "Starring in 'Eric Bogosian' (qv)'s play \"Talk Radio\". [April 2007]", "He was in a relationship with 'Leighton Meester' (qv) from 2008 to 2010, with 'Dianna Agron' (qv) from 2011 to 2012, with 'Jennifer Morrison' (qv) from 2012 to 2013, and with Russian actress 'Margarita Levieva' (qv) from 2014 to 2016.", "He has worked twice with Academy Award winning director 'Jonathan Demme' (qv), in _Rachel Getting Married (2008)_ (qv) and _Ricki and the Flash (2015)_ (qv).", "He appears in two features nominated for a 'Best Picture' Academy Award: _Black Swan (2010)_ (qv) and _The Martian (2015)_ (qv).", "Has portrayed a troubled, closeted gay son of a powerful parent in three different productions, Martin Waters in _The Architect (2006)_ (qv), Jack Benjamin in _Kings (2009)_ (qv), and T.J. Hammond in _Political Animals (2012)_ (qv).", "Sebastian had a blink-and-you'll-miss-it scene as Bucky Barnes at the very end credits of Black Panther. When his mom saw the film she didn't stay for the end credits, thus missing her son's scene.", "He is best friends with his Marvel co-star and on-screen frenemy 'Anthony Mackie' (qv).", "He had to have a new metal arm molded and made for his character of Bucky Barnes/The Winter Soldier in _Captain America: Civil War (2016)_ (qv) because he had gained over twenty pounds of muscle for the role and became too big to fit in his old one.", "His mother's name is Georgeta.", "Has had a love of astronomy since childhood, and considered working in the field before acting.", "His character Bucky Barnes/The Winter Soldier's trademark long hair has always been a wig except for in _Captain America: Civil War (2016)_ (qv) because he had enough time to actually grow his hair out. In every other film portraying the same character, he didn't have enough time for it to grow to the proper long length because of other projects he was filming.", "He portrayed the brother of 'Hayden Panettiere' (qv)'s character in _The Architect (2006)_ (qv), and her boyfriend in 'Hayden Panettiere' (qv): Wake Up Call (2008).", "His godmother is makeup mogul and fellow Romanian Anastasia Soare of 'Anastasia Beverly Hills'."], "quotes": ["It was like a huge master class every day in rehearsal with [director] Bob Falls and [actor] 'Liev Schreiber' (qv). I spent the whole time at the table taking notes on everything Liev was saying: Quoting Shakespeare and how [the play \"Talk Radio\"] was similar to this or that play. I'd come in and be so hyped up and he'd be like, \"Listen. It's all great, but you gotta figure out what you want here and why.\" [2007]", "I seem to keep ending up with these bad boy characters. I don't understand what's going on. I walk the street in New York feeling like I'm 'Paul Rudd' (qv) or something, but apparently no one else sees it that way. [2012]", "[on living in Manhattan, NYC] I love staring out the window. New York, it's like a candy jar - watching people is so phenomenal. Looking at [the couple at the next table] right now, you can tell so much by what they order or their body language. I just find that really fun. It's kind of like being a detective a little bit. [2012]", "The things I learned from my parents, what was deeply ingrained in their generation, is this idea of opportunity and the freedom to have an opportunity. The way the United States was thought of is as a place you can have this chance to do anything, to say, \"This is my idea, and I get to offer it to you, and if you like it, I can profit from it.\" It's why they were so encouraging of me to act too, because they knew how much easier it was to do here. [2016]", "When I go to work I don't discriminate it as a comic-book movie. It's full-on commitment. That's all you can do. (...) Comic-book movies are mythology in a way, and there are a lot more parallels in them with what's going on in the real world than people want to discuss...[2016]", "It's OK to have dreams, it's OK to have goals, in my opinion. But I really think it's much more about the climb and the work you do on the way up. The climb is really hard and really rough, but it's also the best part because there are still places to climb up to. [2016]", "[on his early struggling actor days] Most of the people I admire as actors didn't make it until their mid-30s: The 'Mark Ruffalo' (qv)s, the 'John Hawkes' (qv)es of the world. (...) One of my first big auditions for a casting director in New York - who's amazing, I'm not going to say their name - I walked into the audition, and they were on their computer doing an email. The assistant was behind them. And I said \"Hi,\" and they didn't turn around. They said, \"Yeah, go ahead.\" And then I read with the assistant, and the casting director didn't even turn once! I was in the same room, they were continuing to type the email while I was in there doing it! Just brutal. (...) I always look at auditions as not even getting the job as much as I'm just trying to connect with this casting director so they remember me for next time. (...) Those beginning years, looking back, they could be really tough and painful and hurtful but there was something great about it. And once it's gone, it's gone. [2016]", "Embrace your differences and the qualities about you that you think are weird. Eventually, they're going to be the only things separating you from everyone else."], "birth date": "1982-08-13", "birth notes": "Constanta, Romania", "_actorID": "45", "_source": "IMDB", "actorID": "1659221", "created_utc_dt": "09/14/2019, 13:01:54"}