{"headshot": "https://m.media-amazon.com/images/M/MV5BOTU3NDE5MDQ4MV5BMl5BanBnXkFtZTgwMzE5ODQ3MDI@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Jen", "JLaw", "Nitro: Nickname at school"], "birth name": "Jennifer Shrader Lawrence", "height": "5' 9\" (1.75 m)", "mini biography": ["Was the highest-paid actress in the world in 2015 and 2016. With her films grossing over $5.5 billion worldwide, 'Jennifer Lawrence' (qv) is often cited as the most successful actor of her generation. She is also thus far the only person born in the 1990s to have won an acting Oscar.Jennifer Shrader Lawrence was born August 15, 1990 in Louisville, Kentucky, to Karen (Koch), who manages a children's camp, and Gary Lawrence, who works in construction. She has two older brothers, Ben and Blaine, and has English, German, Irish, and Scottish ancestry.Her career began when she traveled to Manhattan at the age of fourteen. After conducting her first cold read, agents told her mother that \"it was the best cold read by a 14- year-old they had ever heard\", and tried to convince her stage mother that she needed to spend the summer in Manhattan. After leaving the agency, Jen was spotted by an agent in the midst of shooting an H&M ad and asked to take her picture. The next day, that agent followed up with her and invited her to the studio for a cold read audition. Again, the agents were highly impressed and strongly urged her mother to allow her to spend the summer in New York City. As fate would have it, she did, and subsequently appeared in commercials such as MTV's \"My Super Sweet 16\" and played a role in the movie, _The Devil You Know (2013)_ (qv).Shortly thereafter, her career forced her and her family to move to Los Angeles, where she was cast in the TBS sitcom _The Bill Engvall Show (2007)_ (qv), and in smaller movies like _The Poker House (2008)_ (qv) and _The Burning Plain (2008)_ (qv).Her big break came when she played Ree in _Winter's Bone (2010)_ (qv), which landed her Academy Award and Golden Globe nominations. Shortly thereafter, she secured the role of Mystique in franchise reboot _X-Men: First Class (2011)_ (qv), which went on to be a hit in Summer 2011. Around this time, Lawrence scored the role of a lifetime when she was cast as Katniss Everdeen in the big-screen adaptation of literary sensation _The Hunger Games (2012)_ (qv). The film went on to become one of the highest-grossing movies ever with over $407 million at the domestic box office, and instantly propelled Lawrence to the A-list among young actors/actresses. Three Hunger Games sequels were released in each consecutive November, _The Hunger Games: Catching Fire (2013)_ (qv), _The Hunger Games: Mockingjay - Part 1 (2014)_ (qv), and _The Hunger Games: Mockingjay - Part 2 (2015)_ (qv), with Lawrence reprising her role.In 2012, the romantic comedy, Silver Linings Playbook earned her the Academy Award, Golden Globe Award, Screen Actors Guild Award, Satellite Award and the Independent Spirit Award for Best Actress, among other accolades, making her the youngest person ever to be nominated for two Academy 'Awards' (qv) for Best Actress and the second-youngest Best Actress winner.She starred in 'David O. Russell' (qv)'s popular drama-comedy _American Hustle (2013)_ (qv), as Roselyn Rosenfield, and teamed with the director again to play inventor Joy Mangano in another family comedy, _Joy (2015)_ (qv), receiving Oscar nominations for both roles (Best Supporting Actress and Best Actress, respectively).::Ben Lawrence"], "trade mark": ["Slightly husky voice", "Witty sense of humor", "Often works with 'Robert De Niro' (qv), 'David O. Russell' (qv) and 'Bradley Cooper' (qv)."], "trivia": ["For her role in _Winter's Bone (2010)_ (qv), she learned to skin squirrels, chop wood, and fight.", "Lawrence was discovered by a photographer while visiting New York with her mother in 2005, which led to her landing an agent.", "Is the third youngest Oscar nominee for best actress in a leading role, at age 20 years, 163 days. Only Quvenzhané Wallis in _Beasts of the Southern Wild (2012)_ (qv), at age 9 years, 135 days, and 'Keisha Castle-Hughes' (qv) for _Whale Rider (2002)_ (qv), at age 13 years, 309 days, were younger, at the date of nominations announcement.", "She's a huge fan of 'Jeff Bridges' (qv), and got the chance to meet him at the 2013 San Diego Comic-Con. Lawrence approached him, not realizing he was in the middle of an interview with _Entertainment Tonight (1981)_ (qv), and hurried away. Bridges noticed and immediately called her back. The reporter then handed a star-struck Lawrence the microphone and invited her to take over the interview.", "Has appeared in two Sundance Grand Jury Prize winners in a row: _Winter's Bone (2010)_ (qv) and _Like Crazy (2011)_ (qv).", "Named one of People magazine's Most Beautiful People in the World (2011).", "Named one of Variety magazine's Top Ten Actors to Watch (2010).", "Ranked #10 on Maxim magazine's Hot 100 Women of 2011 list.", "Ranked #47 in Ask men's top 99 \"most desirable\" women of 2012.", "Voted by her class as \"Most Talkative\".", "Good friends with 'Josh Hutcherson' (qv), her co-star from _The Hunger Games (2012)_ (qv). They are both Kentucky natives.", "Named as having the \"Sexiest eyes\" by Victoria's Secret What Is Sexy list (2012).", "Her father had a concrete construction firm, Lawrence & Associates, and her mother runs a children's camp.", "For her role as Katniss Everdeen in _The Hunger Games (2012)_ (qv), she worked out twice a day and practiced archery.", "She has portrayed the daughter of 'Paula Malcomson' (qv) twice - in a 2007 episode of the television series _Cold Case: A Dollar, a Dream (2007)_ (qv) and in _The Hunger Games (2012)_ (qv).", "(November 30, 2012) Named \"Entertainer of the Year\", along with 'Ben Affleck' (qv), by Entertainment Weekly.", "Is a natural blonde. She dyed her hair brown for her role in _The Hunger Games (2012)_ (qv).", "Ranked #1 in Ask men's top 99 \"most desirable\" famous women of 2013 list.", "Brought her parents as her date to the 70th Golden Globe 'Awards' (qv) after breaking up with her boyfriend 'Nicholas Hoult' (qv).", "Became the second youngest recipient of the Best Actress Oscar upon winning the award for _Silver Linings Playbook (2012)_ (qv) on February 24, 2013 (age 22); the youngest recipient is 'Marlee Matlin' (qv), who won for _Children of a Lesser God (1986)_ (qv) on March 30, 1987 (age 21).", "By age 23, she became the youngest actress to be nominated for three Oscars, including two of them for leading role, one of which she won.", "Is the third Oscar-winning Actress to appear in the X-Men films, the others being 'Anna Paquin' (qv) and 'Halle Berry' (qv). All three of them will appear together in _X-Men: Days of Future Past (2014)_ (qv).", "Named one of Time Magazine's 100 Most Influential People in the World (2013).", "She has English, German, Irish, Scottish, and remote French, ancestry.", "Universal and Imagine announced in fall 2013 that she will be cast to play the role of Cathy Ames in an eventual remake of the movie _East of Eden (1955)_ (qv), itself based on the classic 1952 novel by 'John Steinbeck' (qv). The remake will be directed by _The Hunger Games (2012)_ (qv) mastermind 'Gary Ross' (qv), and will consist of two parts and two movies. Her role will be featured in the first film.", "Her love of Doritos chips caused her to stain several dresses while on the set of _American Hustle (2013)_ (qv), nearly ruining them in the process. The wardrobe department solved this problem by creating a number of identical dresses for her to use throughout the production so she would always have a clean one to wear.", "Was the 141st actress to receive an Academy Award; she won the Best Actress Oscar for _Silver Linings Playbook (2012)_ (qv) at _The Oscars (2013)_ (qv) on February 24, 2013.", "Ranked #5 on Maxim magazine's Hot 100 Women of 2014 list.", "On the set of _The Hunger Games (2012)_ (qv), she showed up to set a couple times with the same blood and scar makeup from the day before. Because of this, 'Elizabeth Banks' (qv) gave her the nickname Katpiss Neverclean.", "Said in an interview that since she and _The Hunger Games (2012)_ (qv) co-star 'Josh Hutcherson' (qv) are such good friends, she decided to buy a house down the street from him.", "Was in on-off relationship with 'Nicholas Hoult' (qv) from 2011 to 2014.", "Was in a relationship with 'Chris Martin' (qv) from June to October 2014.", "Closed 2014 as the highest-grossing actor of the year in Hollywood, her movies having grossed over $1.4 billion worldwide at the box office (Forbes magazine).", "Was among the people affected by the hack of private pictures of various celebrities, mostly women, and with many containing nudity, which were posted on the website 4chan and where later distributed by other Internet networks. The event was nicknamed \"The Fappening\" by the media. The hack started whole new discussions about privacy in the Internet age as well as people unfairly and unnecessarily criticizing the victims for taking the pictures in the first place and putting them on their computer devices. In an interview with Vogue magazine in 2014, Lawrence commented on the hacks for the first time: \"It is not a scandal. It is a sex crime [...] It is a sexual violation. It's disgusting. The law needs to be changed, and we need to change.\".", "She gave her Oscar to her parents, who keep it in their home in Louisville, Kentucky, because she felt \"odd\" having it in her own house.", "Auditioned for the role of Bella Swan in _Twilight (2008)_ (qv), but lost to 'Kristen Stewart' (qv).", "Is one of 25 actresses who have received an Academy Award for their performance in a comedy; hers being for (_Silver Linings Playbook (2012)_ (qv)). The others in chronological order, are: 'Claudette Colbert' (qv) (_It Happened One Night (1934)_ (qv)), 'Loretta Young' (qv) (_The Farmer's Daughter (1947)_ (qv)), 'Josephine Hull' (qv) (_Harvey (1950)_ (qv)), 'Judy Holliday' (qv) (_Born Yesterday (1950)_ (qv)), 'Audrey Hepburn' (qv) (_Roman Holiday (1953)_ (qv)), 'Goldie Hawn' (qv) (_Cactus Flower (1969)_ (qv)), 'Glenda Jackson' (qv) (_A Touch of Class (1973)_ (qv)), 'Lee Grant' (qv) (_Shampoo (1975)_ (qv)), 'Diane Keaton' (qv) (_Annie Hall (1977)_ (qv)), 'Maggie Smith' (qv) (_California Suite (1978)_ (qv)), 'Mary Steenburgen' (qv) (_Melvin and Howard (1980)_ (qv)), 'Jessica Lange' (qv) (_Tootsie (1982)_ (qv)), 'Olympia Dukakis' (qv) (_Moonstruck (1987)_ (qv)), 'Cher' (qv) (_Moonstruck (1987)_ (qv)), 'Jessica Tandy' (qv) (_Driving Miss Daisy (1989)_ (qv)), 'Mercedes Ruehl' (qv) (_The Fisher King (1991)_ (qv)), 'Marisa Tomei' (qv) (_My Cousin Vinny (1992)_ (qv)), 'Dianne Wiest' (qv) (_Bullets Over Broadway (1994)_ (qv)), 'Mira Sorvino' (qv) (_Mighty Aphrodite (1995)_ (qv)), 'Frances McDormand' (qv) (_Fargo (1996)_ (qv)), 'Helen Hunt' (qv) (_As Good as It Gets (1997)_ (qv)), 'Judi Dench' (qv) (_Shakespeare in Love (1998)_ (qv)), 'Gwyneth Paltrow' (qv) (_Shakespeare in Love (1998)_ (qv)), and 'Penélope Cruz' (qv) (_Vicky Cristina Barcelona (2008)_ (qv)).", "Is one of 14 actresses to have won both the Best Actress Academy Award and the Best Actress in a Comedy/Musical Golden Globe for the same performance; hers being for _Silver Linings Playbook (2012)_ (qv). The others, in chronological order, are: 'Judy Holliday' (qv) for _Born Yesterday (1950)_ (qv), 'Julie Andrews' (qv) for _Mary Poppins (1964)_ (qv), 'Barbra Streisand' (qv) for _Funny Girl (1968)_ (qv), 'Liza Minnelli' (qv) for _Cabaret (1972)_ (qv), 'Glenda Jackson' (qv) for _A Touch of Class (1973)_ (qv), 'Diane Keaton' (qv) for _Annie Hall (1977)_ (qv), 'Sissy Spacek' (qv) for _Coal Miner's Daughter (1980)_ (qv), 'Cher' (qv) for _Moonstruck (1987)_ (qv), 'Jessica Tandy' (qv) for _Driving Miss Daisy (1989)_ (qv), 'Helen Hunt' (qv) for _As Good as It Gets (1997)_ (qv), 'Gwyneth Paltrow' (qv) for _Shakespeare in Love (1998)_ (qv), 'Reese Witherspoon' (qv) for _Walk the Line (2005)_ (qv), and 'Marion Cotillard' (qv) for _La Vie en Rose (2007)_ (qv).", "She filmed a cameo as Fraida Felcher in a flashback of the sequel _Dumb and Dumber To (2014)_ (qv), but she later requested the cameo be pulled.", "When she first started playing Mystique in _X-Men: First Class (2011)_ (qv), she wore full-body prosthetics which she found uncomfortable. She got to where a special body suit in _X-Men: Days of Future Past (2014)_ (qv) which she found more comforting to wear.", "Revealed during an appearance on _Watch What Happens: Live (2009)_ (qv) in December 2015, that she has kissed her co-star 'Liam Hemsworth' (qv) off-camera. She also admitted in the same interview to smoking pot with her brother before attending The Oscars.", "When asked to gain weight for her role as Tiffany Maxwell in Silver Lining Playbook, after slimming down to play Katniss Everdeen in The Hunger games, her response was \"Hell ya!\".", "Shared the cover of Vanity Fair magazine's 2016 Hollywood issue with, 'Jane Fonda' (qv), 'Viola Davis' (qv), 'Cate Blanchett' (qv), 'Charlotte Rampling' (qv), 'Rachel Weisz' (qv), 'Lupita Nyong'o' (qv), 'Brie Larson' (qv), 'Alicia Vikander' (qv), 'Gugu Mbatha-Raw' (qv), 'Helen Mirren' (qv), 'Diane Keaton' (qv) and 'Saoirse Ronan' (qv). Photographed by 'Annie Leibovitz' (qv).", "She and 'Jeremy Renner' (qv) are fifth cousins, once removed. In 2015, the research team at Ancestry.com discovered that they share an ancestor in Kentucky, farmer Robert Tague, who is Lawrence's fifth great-grandfather, while he's Renner's fourth. Lawrence and Renner worked together in _American Hustle (2013)_ (qv).", "Has gained a large fan base in China since her breakthrough performance in Winter's Bone, Chinese net citizens now refer to her with the nick name \"Da Biao Jie\", which reads like \"Big (female) Cousin\" which would give a cordial, intimate feeling of a girl next door. However as it is explained by online encyclopedia and forums, because her name Lawrence is similar to famous brand watch \"Laureus\", some fans come up the idea of a shorter, catchy and intimate nick name to do with such similarity, thus nick-naming her \"Big Watch Sister\" (Big in Chinese reads \"Da\", Watch reads \"Biao\", and sister reads \"Jie\", thus \"Da Biao Jie\"). On a promotional tour to China for Hunger Games: Mocking Jay Part 2, she mentioned being confused and not totally impressed with this nick name in an interview.", "As a young person, she wanted to be a doctor.", "Is at her most comfortable simply being a homebody, either alone, or entertaining close friends.", "Counts _Terms of Endearment (1983)_ (qv) and _Cool Runnings (1993)_ (qv) among her favorite films.", "According to Forbes she was the highest paid actress for 2015 and 2016.", "She is the first, and thus far only, person born in the 1990s to have received an acting Oscar (Best Actress for Silver Linings Playbook, 2012).", "Third highest paid actress of 2017 with $24 million.", "Auditioned for 'Blake Lively' (qv)'s _Gossip Girl (2007)_ (qv) role and according to the show's creator Josh Schwartz she was really upset that she didn't get the role.", "Is a fan of 'Marion Cotillard' (qv).", "No relation to director 'Francis Lawrence' (qv), although they have worked together in four movies: _The Hunger Games: Catching Fire (2013)_ (qv), _The Hunger Games: Mockingjay - Part 1 (2014)_ (qv), _The Hunger Games: Mockingjay - Part 2 (2015)_ (qv) and _Red Sparrow (2018)_ (qv).", "As of 2018, has appeared in three Best Picture Oscar nominated films: _Winter's Bone (2010)_ (qv), _Silver Linings Playbook (2012)_ (qv) and _American Hustle (2013)_ (qv), and given an Oscar nominated performance in each. She won Best Actress for her performance in Silver Linings Playbook.", "Is a descendant of a paternal uncle of Thomas Jefferson, Virginia Delegate to the Second Continental Congress, 2nd Governor of Virginia, Virginia Delegate to the Congress of the Confederation, Minister Plenipotentiary for Negotiating Treaties of Amity and Commerce, 2nd United States of America Minister to France, 1st United States of America Secretary of State, 2nd Vice-President of the United States of America and 2nd Speaker of the Senate of the United States of America and 3rd President of the United States of America.", "Is a supporter of Planned Parenthood for its support in contraception and female health care, namely to teenagers.", "She is left-handed.", "Daughter of Gary Lawrence (b. Kentucky, 1956), construction worker, and wife (m. August 3, 1979) Karen Koch (b. Kentucky, 1956), summer camp manager, both raised in Kentucky, and younger sister of Benjamin \"Ben\" and Blaine. Has English, German, Irish, Scottish, Scots-Irish (Northern Irish), distant Welsh and remote French and Swiss-German descent.", "Paternal granddaughter of David Vernon Lawrence (b. Kentucky) (son of Francis Marion \"Frank\" Lawrence and wife Bessie Steger, paternal grandson of James Ogden Lawrence and wife Penelope Nellie Burroughs and maternal grandson of Samuel Jefferson Steger and wife Ida Louisa O'Banion) and wife Doris Shrader (b. Kentucky) (daughter of William Martin Shrader and wife Reva Mae Adams, paternal granddaughter of John William Shrader and wife Permelia Alice \"Allie\" Martin and maternal granddaughter of John Thadius Adams and wife Lena Rivers Tague). Her patrilineal line can be traced back to Robert Lawrence, who was born, c. 1589, in Chelsea, Middlesex, England, and who died, c. 1682, in Nansemond, Virginia.", "Maternal granddaughter of Charles J. Koch (b. Ohio) (son of Charles A. Koch and wife Mary P. Sheehan, paternal grandson of Charles Koch, of German descent, and wife Anna \"Annie\" Kleinhens or Kleinhenz, of German descent, and maternal grandson of Martin J. Sheehan, of Irish descent, and wife Mary Elizabeth Broderick, of Irish descent) and wife Carolyn M. Mongtomery (b. Kentucky) (daughter of Robert C. Montgomery and wife Esta M. White, paternal granddaughter of Charles Arthur Montgomery and wife Leona or Leana M. Blocher and maternal granddaughter of Hiram M. White and wife Viola Agnes Gregory).", "Of the Lawrence Coat of Arms. Descendant in female lines of the Montgomery Coat of Arms and of English Landed Gentry and Peerage.", "Auditioned for the role of Olive in _Easy A (2010)_ (qv) but lost to 'Emma Stone' (qv).", "Announced her engagement to art gallery director 'Cooke Maroney' (qv) in February 2019.", "Became a member of the Academy of Motion Picture Arts and Sciences in 2011.", "Her mother Karen once stole her Oscar ballot and tried to vote. Lawrence was aghast to learn that her mother filled out the official ballot and mailed it in - only to find it returned to their home because it was mailed to the wrong address. She and mom did not agree on her picks."], "quotes": ["[on auditions and meetings]: The miserable ones are the ones where all the girls auditioning are in the same room. There's no talking in those rooms. I've tried.Yesterday, I had to do an interview. I was in a horrible mood. I couldn't think of basic words. I could see my publicist in the background, mouthing things to say. They want you to be likable all the time, and I'm just not.", "I'm excited to be seen as sexy. But not slutty.", "Where are the 'Robert Redford' (qv)s and 'Paul Newman' (qv)s of my age group? I love 'James Franco' (qv), but where's the next 'James Franco' (qv)? Where are the hunks who can act?", "There are actresses who build themselves, and then there are actresses who are built by others. I want to build myself.", "... I have this feeling of protectiveness over characters I want to play. I worry about them - if someone else gets the part, I'm afraid they won't do it right; they'll make the character a victim or they'll make her a villain or they'll just get it wrong somehow.... When I get like that, anything's possible.", "[on her role in _Winter's Bone (2010)_ (qv)]: I'd have walked on hot coals to get the part. I thought it was the best female role I'd read - ever. I was so impressed by Ree's tenacity and that she didn't take no for an answer. For the audition, I had to fly on the redeye to New York and be as ugly as possible. I didn't wash my hair for a week, I had no makeup on. I looked beat up in there. I think I had icicles hanging from my eyebrows.", "When I first got to New York, my feet hit the sidewalk and you'd have thought I was born and raised there. I took over that town. None of my friends took me seriously. I came home and announced, \"I'm going to move to New York,\" and they were like \"Okay.\" Then when I did, they kept waiting for me to fail and come back. But I knew I wouldn't. I was like \"I'll show you.\".", "I never felt like I completely, 100% understood something so well as acting.", "I'd like to direct at some point. But I don't know because 10 years ago I would have never imagined that I'd be here. So in 10 years from now, I might be running a rodeo.", "[on being a sudden sex symbol]: It feels weird. But [it's] not bad at all.", "I don't really diet or anything. I'm miserable when I'm dieting and I like the way I look. I'm really sick of all these actresses looking like birds... I'd rather look a little chubby on camera and look like a person in real life, than look great on screen and look like a scarecrow in real life.", "_Winter's Bone (2010)_ (qv) wasn't a fun, easy movie to make by any means. But I didn't do it to have fun.", "I like when things are hard; I'm very competitive. If something seems difficult or impossible, it interests me.", "[on not wanting to be famous] I look at 'Kristen Stewart' (qv) now and I think, \"I'd never want to be that famous.\" I can't imagine how I'd feel if all of a sudden my life was pandemonium.", "I'm doing what I love, and then I get months and months of rest. I have a lot of money for a 21-year-old. I can't stand it when actors complain.", "I hate saying, \"I like exercising.\" I want to punch people who say that in the face. But it's nice being in shape for a movie, because they basically do it all for you. It's like \"Here's your trainer. This is what you can eat.\" I don't diet. I do exercise! But I don't diet. You can't work when you're hungry, you know?", "[on being asked if _The Hunger Games (2012)_ (qv) transitioned her too quickly into stardom]: I think about this all the time. But when you get a promotion at your job, you don't go \"That was too fast. Can I stay in the mailroom a while longer?\". You take it.", "[on posing in an Esquire magazine photo shoot to try and help shake up her public image] A lot of people said, \"Oh, now we have a great actress come along and she's showing her boobs.\" But that's exactly what I had to do so I could keep working. Honestly, that photo shoot is what helped me get X-Men [_X-Men: First Class (2011)_ (qv)].", "There's just no imagination in Hollywood. I wanted to show people _Winter's Bone (2010)_ (qv) for the performance, but it ended up having the opposite effect. People were like \"No, she's not feminine, she's not sexual.\".", "[on referring to the characters she has played in _Winter's Bone (2010)_ (qv) and _The Hunger Games (2012)_ (qv)] I don't know what it is with me and maternal wilderness girls, I just love 'em. Even before Winter's Bone, the first movie I ever did, _The Poker House (2008)_ (qv), I was caring for my younger siblings in a tough, dark situation.", "[on suffering through school] I always felt dumber than everybody else. I hated it. I hated being inside. I hated being behind a desk. School just kind of killed me.", "I think it gets so much easier to let things roll off your back. It's such a business of hurry up and wait, and if you let it get to you it will drive you absolutely insane. Like \"Why was I called in at four in the morning and I haven't been used until one in the afternoon?\". And \"Why are we shooting this a million times when we have five other scenes to shoot?\". But you get to the point where you just say \"This is filmmaking. This is what you get paid for. Everybody is doing the best they can. It's what you have to live with.\".", "It's always been about the script and the director, for me. There are directors that I want to work with and that I admire. You can love a script, but if it doesn't have a good director, it won't be that. I like to adapt to a director's way of working. I love doing that. Each director is so different, and you have to adapt to this new way of doing something. That's what's amazing to me. That's why I love directors. I don't want the director to have to work around me. I think it's more fun for me to come in on their thing.", "[on her acting method] To you it looks emotionally straining, but I don't get emotionally drained, because I don't invest any of my real emotions. I don't take any of my characters' pain home with me, I don't even take it to craft services. I've never been through anything that my characters have been through. And I can't go around looking for roles that are exactly like my life. So I just use my imagination. If it ever came down to the point where, to make a part better, I had to lose a little bit of my sanity, I wouldn't do it. I would just do comedies.", "[on owning her own bow and arrows] One time, I actually used it for defense. I pulled into my garage and I heard men in my house. And I was like \"I'm not letting them take my stuff. I had just gotten back from training, so I had the bow and arrows in the back of my car. I went to my car and I put this quiver on me and I had my bow and I loaded it and I'm walking up the stairs. And I look, and my patio doors were open, and there were guys working right there, and I was like 'Hey, how you doin'?' They [her friends] were like 'We've got to stage someone to break into your house and you can kill them!' That would be the funniest news ever. Katniss Everdeen actually kills someone with a bow and arrow!\".", "Not to sound rude, but [acting] is stupid. Everybody's like \"How can you remain with a level head?\". And I'm like \"Why would I ever get cocky? I'm not saving anybody's life. There are doctors who save lives and firemen who run into burning buildings. I'm making movies. It's stupid.\".", "[on meeting/being wowed by acting idols] Once I'm obsessed with somebody, I'm terrified of them instantly. I'm not scared of them - I'm scared of me and how I will react. Like, for instance, one time someone was introducing me to 'Bill Maher' (qv), and I saw 'Meryl Streep' (qv) walk into the room, and I literally put my hand right in 'Bill Maher' (qv)'s face and said, \"Not now, Bill!\", and I just stared at 'Meryl Streep' (qv). [when asked if she met 'Meryl Streep' (qv)] Of course not. I just creepily stared at her.", "[on the moral of _The Poker House (2008)_ (qv)] Things can happen to you, but they don't have to happen to your soul.", "[on forgetting to thank 'Harvey Weinstein' (qv) in her Best Actress acceptance speech at the 85th Academy 'Awards' (qv) (2013)] It's been fun. I guess I'll never work again.", "[when asked in the Oscar Press Room, about what happened when she tripped on the stairs while accepting the award for Best Actress] Was that on purpose? Absolutely!... What do you mean what happened? Look at my dress! I tried to walk up stairs in this dress, that's what happened. Yeah, I think I just stepped on the fabric and... they waxed the stairs.", "Don't worry about the bitches - that could be a good motto, because you come across people like that throughout your life.", "I never play characters that are like me because I'm a boring person. I wouldn't want to see me in a movie.", "In Hollywood, I'm obese. I'm considered a fat actress. I eat like a caveman. I'll be the only actress that doesn't have anorexia rumors! I'm never going to starve myself for a part. I'm invincible. I don't want little girls to be like \"Oh, I want to look like Katniss, so I'm going to skip dinner!\".", "[on her dancing ability] I'm a horrible dancer!... I'm like a dad at prom... I look like Gumby getting electrocuted.", "As soon as somebody farts around me, I think it's hilarious. This is something my brothers did that now the boys at work are obsessed with. You cup it, and then you throw it in someone's face and say, \"Take a bite out of that cheeseburger!\".", "The best birthday present I ever received was a T-shirt my friend had made that said \"I passed out in Disneyland '07\" (I had heat stroke in Disneyland).", "I am just a normal girl and a human being, and I haven't been in this long enough to feel like this is my new normal.", "I'm still getting used to everything. It still makes me a little emotional, just to see how quickly everything kind of changes -- that it changes so fast.", "[on mental illness] It's just so bizarre in this world; if you have asthma, you take asthma medicine. If you have diabetes, you take diabetes medicine, but as soon as you have to take medication for your mind it's... there's such a stigma behind it.", "My parents saw me so truly happy that they sacrificed everything for my happiness. Without my family, I would be nothing.", "Maybe one day, I'll turn into an asshole. But there are too many out there already.", "[on fame] I'm from Kentucky. I used to be very personable and make eye contact and smile at people, and now all I do is look down. When I'm at dinner and one person after another keeps interrupting to take pictures, it's like \"I can't live like this.\".", "[on being dubbed the \"Sexiest Woman in the World\" by FHM magazine] It's the lie heard around the world. I know the truth. I know Beyoncé is the queen of the world.", "[on 'Josh Hutcherson' (qv)] Whenever Josh is like \"I don't think you should do it like that.\" And then I'm like \"Oh, really? Do you wanna tell that to my Oscar?\".", "[on her experiences on the set of _The Hunger Games: Catching Fire (2013)_ (qv)] Everybody told me there were no spiders, so when I saw three, I started crying. Jungles are not easy when you're afraid of everything. I think I am a legitimate alcoholic. No, what's it called? An arachnophobic.", "[on 'Mother!' being controversial] - It's certainly not a darling. Every time you make a movie you hope everyone likes it. It's your only thought. That never crossed our minds. It's an assault. I think it's necessary. I'm proud of us, I'm proud of Darren [Aronofsky] and I'm proud of banding together to deliver something we believe in. That CinemaScore [F]-we're fine with it.", "[on politics] I was raised a Republican, but I just can't imagine supporting a party that doesn't support women's basic rights. It's 2015 and gay people can get married and we think that we've come so far, so, yay! But have we? I don't want to stay quiet about that stuff. My view on the [2016 US presidential election] is pretty cut-and-dried: If 'Donald Trump' (qv) is president of the United States, it will be the end of the world. And he's also the best thing to happen to the Democrats ever.", "[on 'Mother!'] - I never lose myself in a movie. This is the only time I've lost myself. I couldn't tell my body that none of it was real. I kept on hyperventilating.", "I feel like I'm reacting as things are happening and growing and developing and you know, making mistakes is very helpful for that. But also having in mind; this is important for growing up; Is like, having in mind who you want to be. I want to be the kind of person who will say that thing that's really hard to say. That's really awkward and really difficult. One day I want to be able to just say it, and not make a joke and not try to make it cute, but to just say it. And I remember thinking that but not being able to do it. And then slowly developing and growing and eventually, and now I say all sorts of awkward things.", "[on _Phantom Thread (2017)_ (qv)] I got through about three minutes. I put in a good solid three... I'm sorry to anybody who loved that movie. I couldn't give that kind of time. It was three minutes and I was just like oof... I mean, is it just about clothes? Is he ['Daniel Day-Lewis' (qv)'s character] kind of like a narcissistic sociopath and he's like an artist so every girl falls in love with him because he makes her feel bad about herself and that's the love story? I've been down that road, I know what that's like, I don't need to watch that movie. [Feb.2018]", "[on the importance of The Poker House rape scene] I think that the most important thing that Lori did in the movie, which I respect so much, is at the end when my character is raped by this man. This horrible thing has happened to her but it didn't happen to her soul. He had that moment and he had that time, but she didn't let him have even the rest of that night. I think and I hope so badly, that anybody who's been hurt in any way like that can get inspiration or help from that, that you can go on.", "I dropped out of middle school. I don't technically have a GED or a diploma. I am self-educated."], "salary history": ["_Winter's Bone (2010)_ (qv)::$3,000 a week (scale)", "_X: First Class (2011)_ (qv)::$250,000", "_The Hunger Games (2012)_ (qv)::$500,000 plus escalators that equal to $1,000,000", "_The Hunger Games: Catching Fire (2013)_ (qv)::$10,000,000 (combination of salary, bonuses and escalators)", "_American Hustle (2013)_ (qv)::$1,250,000 + 7% gross point", "_X-Men: Days of Future Past (2014)_ (qv)::$6,000,000", "_The Hunger Games: Mockingjay - Part 1 (2014)_ (qv)::$7,500,000", "_The Hunger Games: Mockingjay - Part 2 (2015)_ (qv)::$7,500,000", "_Joy (2015)_ (qv)::$15,000,000", "_X-Men: Apocalypse (2016)_ (qv)::$8,000,000", "_Passengers (2016)_ (qv)::$20,000,000", "_Mother! (2017)_ (qv)::$8,000,000", "_Red Sparrow (2018)_ (qv)::$15,000,000"], "birth date": "1990-08-15", "birth notes": "Louisville, Kentucky, USA", "_actorID": "28", "_source": "IMDB", "actorID": "2225369", "created_utc_dt": "09/14/2019, 13:01:38"}