{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQ2MjgyNjk3MV5BMl5BanBnXkFtZTcwNTA3NTY5Mg@@._V1_UY98_CR2,0,67,98_AL_.jpg", "birth name": "Ian Murray McKellen", "height": "5' 11\" (1.8 m)", "mini biography": ["Widely regarded as one of greatest stage and screen actors, both in his native Great Britain and internationally, twice nominated for the Oscar and recipient of every major theatrical award in UK and US, Ian Murray McKellen was born on May 25, 1939 in Burnley, Lancashire, England, to Margery Lois (Sutcliffe) and Denis Murray McKellen, a civil engineer. He is of Scottish, Northern Irish, and English descent. During his early childhood, his parents moved with Ian and his sister Jean to the mill town of Wigan. It was in this small town that young Ian rode out World War II. He soon developed a fascination with acting and the theater, which was encouraged by his parents. They would take him to plays, those by 'William Shakespeare' (qv), in particular. The amateur school productions fostered Ian's growing passion for theatre.When Ian was of age to begin attending school, he made sure to get roles in all of the productions. At Bolton School in particular, he developed his skills early on. Indeed, his first role in a Shakespearian play was at Bolton, as Malvolio in \"Twelfth Night\". Ian soon began attending Stratford-upon-Avon theater festivals, where he saw the greats perform: 'Laurence Olivier' (qv), 'Wendy Hiller' (qv), 'John Gielgud' (qv), 'Ralph Richardson' (qv) and 'Paul Robeson' (qv). He continued his education in English Drama, but soon it fell by the wayside as he concentrated more and more on performing. He eventually obtained his Bachelor of Arts in 1961, and began his career in earnest.McKellen began working in theatre over the next few years. Very few people knew of Ian's homosexuality; he saw no reason to go public, nor had he told his family. They did not seem interested in the subject and so he saw no reason to bring it up. In 1988, Ian publicly came out of the closet on the BBC Radio 4 program, while discussing 'Margaret Thatcher' (qv)'s \"Section 28\" legislation, which made the promotion of homosexuality as a family relationship by local authorities an offense. It was reason enough for McKellen to take a stand. He has been active in the gay rights movement ever since.Ian resides in Limehouse, where he has also lived with his former long-time partner 'Sean Mathias' (qv). The two men have also worked together on the film _Bent (1997)_ (qv) as well as in exquisite stage productions. To this day, McKellen works mostly in theater, and was knighted by 'Queen Elizabeth II' (qv) in 1990 for his efforts in the arts. However, he has managed to make several quite successful forays into film. He has appeared in several productions of Shakespeare's works including his well received _Richard III (1995)_ (qv), and in a variety of other movies. However, it has only been recently that his star has finally begun to shine in the eyes of North American audiences. Roles in various films, _Cold Comfort Farm (1995)_ (qv), _Apt Pupil (1998)_ (qv) and _Gods and Monsters (1998)_ (qv), riveted audiences. The latter, in particular, created a sensation in Hollywood, and McKellen's role garnered him several of awards and nominations, including a Golden Globe and an Oscar nod. McKellen, as he continues to work extensively on stage, he always keeps on 'solidifying' his 'role' as 'Laurence Olivier' (qv)'s worthy 'successor' in the best sense too, such as _King Lear (2008)_ (qv) / _Great Performances: King Lear (2008)_ (qv) directed by 'Trevor Nunn' (qv) and in a range of other staggering performances full of generously euphoric delight that have included \"Peter Pan\" and 'Noël Coward' (qv)'s \"Present Laughter\", as well as 'Samuel Beckett' (qv)'s \"Waiting for Godot\" and 'Harold Pinter' (qv)'s \"No Man's Land\" (_National Theatre Live: No Man's Land (2016)_ (qv)), both in acclaimed productions brilliantly directed by 'Sean Mathias' (qv).McKellen found mainstream success with his performance as Magneto in _X-Men (2000)_ (qv) and its sequels. His largest mark on the big screen may be as Gandalf in \"The Lord of the Rings\" film trilogy directed by 'Peter Jackson' (qv), which he reprised in \"The Hobbit\" trilogy. He also reprised the role of 'King Lear' with new artistic perspectives in _National Theatre Live: King Lear (2018)_ (qv) offering an invaluable mesmerizing experience as a natural force of stage - and screen - of infinite generosity through his unsurpassable interpretation of the titanically vulnerable king.::Peacham and Markos."], "trade mark": ["Rich and flawless voice, combined with Shakespearean bearing.", "Distinctively calm style of speaking.", "Deep, blue eyes"], "trivia": ["He was appointed Knight Bachelor in the 1991 Queen's New Year Honours List for his services to drama.", "Has played the vampire in the music video \"Heart\" by 'Pet Shop Boys' (qv).", "Originated the role of 'Antonio Salieri' (qv) in the Broadway production of \"Amadeus\".", "Had a tattoo of the Elvish character for 9 along with seven other members of the fellowship in _The Lord of the Rings: The Fellowship of the Ring (2001)_ (qv).", "Was offered the part of Mission Commander Swanbeck in _Mission: Impossible II (2000)_ (qv). He was not able to accept the role, due to a prior theatre engagement in London. The part eventually went to 'Anthony Hopkins' (qv).", "He was awarded the CBE (Commander of the Order of the British Empire) in the 1979 Queen's Birthday Honours List for his services to drama.", "Has played 'Maggie Smith' (qv) in a \"Weekend Update\" skit on an episode of _Saturday Night Live (1975)_ (qv) that he hosted.", "While being a guest on 'Jay Leno' (qv) (December 26, 2003), he said that he had not seen _X2: X-Men United (2003)_ (qv) when it opened in theaters, he only saw it when the DVD hit the stores. He then called up 'Bryan Singer' (qv) and asked, \"Is there going to be X-Men 3?\" Singer replied, \"Yes\". In his excitement, he got Singer six theater tickets to go see _The Lord of the Rings: The Return of the King (2003)_ (qv). As it turned out, _X-Men: The Last Stand (2006)_ (qv) would not be directed by Singer.", "According to an interview, one of the last things 'Margaret Thatcher' (qv) did as Prime Minister was recommending him for a knighthood.", "The original Lord of the Rings books, and X-Men comics, both feature a character named Sauron, and a book entitled \"The Return of the King\". The X-Men graphic novel \"The Return of the King\" is, appropriately, about the return of Magneto.", "He was awarded the 'Laurence Olivier' (qv) Theatre Award in 1985 (1984 season) for Best Actor in a Revival for \"Wild Honey\".", "He was awarded the 'Laurence Olivier' (qv) Theatre Award in 1991 (1990 season) for Best Actor in \"Richard III\" at the Royal National Theatre.", "Before performing the role of Gandalf, he listened to a recording of 'J.R.R. Tolkien' (qv) reading Gandalf lines from the novel. He used this as a base for creating the character, and imitated the accent used by Tolkien in the recording.", "Began acting as a means of escape from mourning after his mother's death and constant bullying at school from fellow students.", "He was awarded the 1989 London Evening Standard Theatre Award for Best Actor for his performance in \"Othello\".", "He was awarded the 1984 London Evening Standard Theatre Award for Best Actor for his performance in \"Coriolanus\".", "He was awarded the 1989 London Critics Circle Theatre Award (Drama Theatre Award) for Best Actor for his performance in \"Othello\".", "Graduated with a 2:2 in English from Cambridge University.", "Studied at St. Catharine's College, University of Cambridge, when he was 18, with Sir 'Derek Jacobi' (qv), and with whom he had been \"desperately in love\", as he confessed on _Inside the Actors Studio (1994)_ (qv). In an article in \"The Advocate\", issue dated December 11, 2001, he further explained that what he had felt for Jacobi in their youth was \"a passion that was undeclared and unrequited\".", "Originally aspired to be a journalist.", "Shares his middle name, Murray, with both 'Michael Hordern' (qv) (Michael Murray Hordern), his predecessor in the role of Gandalf, and 'F. Murray Abraham' (qv), his successor in the role of 'Antonio Salieri' (qv).", "Was a member of the Royal Shakespeare Company (RSC) in Stratford-upon-Avon at the same time as 'Patrick Stewart' (qv).", "Wore a prosthetic nose to play Gandalf in the Lord of the Rings trilogy.", "Has played cult characters in two of the biggest franchises; he played Gandalf in the Lord of the Rings trilogy and Magneto in the X-Men film series.", "Was set to play Antonio in 'Michael Radford' (qv)'s adaptation of 'William Shakespeare' (qv)'s _The Merchant of Venice (2004)_ (qv), but had to drop at the last minute due to scheduling conflicts.", "Won Broadway's 1981 Tony Award as Best Actor (Play) for originating the role of 'Antonio Salieri' (qv) in \"Amadeus\". He was nominated in the same category in 1984 for \"'Ian McKellen' (qv) Acting Shakespeare\".", "He used the phrase \"old friend\" in both the X-Men film series and the Lord of the Rings trilogy. In both cases (to 'Christopher Lee' (qv) as Saruman in the Lord of the Rings and 'Patrick Stewart' (qv) as Xavier in X-Men) it is said to an ally who has become a nemesis and \"old friend\" is said mockingly.", "Has worked with two Faramirs. Prior to appearing in the Lord of the Rings films with 'David Wenham' (qv), he appeared in the film _Plenty (1985)_ (qv), with 'Andrew Seear' (qv). Seear played Faramir in the BBC radio adaptation, opposite 'Ian Holm' (qv).", "He said that appeal of the X-Men films to him was the concept of mutants being shunned, something he says he identifies with as he was repeatedly shunned as an open homosexual.", "Like his _The Da Vinci Code (2006)_ (qv) character, Sir Leigh Teabing, he has been knighted. As such, prior to being cast, he spotted two errors in the book's portrayal of Knighthood. Knights neither receive ID badges nor are granted any of the special privileges Teabing demands as a result of Knighthood.", "Has appeared with 'Bruce Davison' (qv) in four different films: _Six Degrees of Separation (1993)_ (qv), _Apt Pupil (1998)_ (qv), _X-Men (2000)_ (qv) and _X2: X-Men United (2003)_ (qv). The first of these is the only one not directed by 'Bryan Singer' (qv).", "Only performer to receive an acting Academy Award nomination for 'Peter Jackson' (qv)'s Lord of the Rings trilogy.", "Has appeared in the Lord of the Rings and X-Men, both of which required a lead character to be recast soon after production started. In the Lord of the Rings, 'Stuart Townsend' (qv) was replaced by 'Viggo Mortensen' (qv), and in _X-Men (2000)_ (qv), 'Dougray Scott' (qv) was replaced by 'Hugh Jackman' (qv).", "Says the same line, \"The war has begun\", in the trailers of both the major, unrelated blockbusters _X2: X-Men United (2003)_ (qv) and _The Lord of the Rings: The Two Towers (2002)_ (qv).", "In the Independent of Sunday 2006 Pink List - a list of the most influential gay men and women - he came no. 1, up from no. 2, knocking 'Elton John' (qv) from top spot.", "When he appeared on \"Desert Island Discs\" (the long-running BBC radio program that asks prominent people what eight pieces of music they would take to a deserted island), the pieces he chose were: 1. \"Stars and Stripes Forever\" ('John Philip Sousa' (qv)) performed by 'Vladimir Horowitz' (qv); 2. Part of \"Adagio for Strings\" (Barber) performed by the Philharmonia Orchestra conducted by Geoffrey Simon; 3. Part of 2nd movement of Late Quartet No.13 in B flat Opus 130 ('Ludwig van Beethoven' (qv)) performed by the Lindsay String Quartet; 4. \"Rose's Turn\" ('Jule Styne' (qv) and 'Stephen Sondheim' (qv)) performed by 'Ethel Merman' (qv); 5. \"Stormy Weather\" (Koehler/Arlen) performed by 'Lena Horne' (qv); 6. \"Mississippi Goddam\" ('Nina Simone' (qv)) performed by Simone; 7. \"Harrison's Clocks (Birtwhistle) performed by Joanna McGregor; 8. \"Dancing Queen\" (B. Andersson/S.Andersson/Ulvaeus) performed by 'ABBA' (qv); His one allowed book was \"A Dictionary of Flora and Fauna\", and his luxury was a grand piano.", "Has played both a Holocaust victim (_X-Men (2000)_ (qv)) and a Nazi (_Apt Pupil (1998)_ (qv), both in movies directed by 'Bryan Singer' (qv).", "He was awarded the Companion of Honour in the 2008 Queen's New Year Honours List for his services to drama and to equality.", "Is good friends with 'Monica Lewinsky' (qv). The two met at the The 71st Annual Academy 'Awards' (qv) (1999). She accompanied him to the London premiere of _Gods and Monsters (1998)_ (qv).", "Ranked #45 in the 2008 Telegraph's list \"the 100 most powerful people in British culture\".", "Was Head boy at Bolton School.", "Marched at London's Gay Pride Parade July 5, 2008.", "Had not read either \"The Golden Compass\" (aka \"Northern Lights\") by 'Philip Pullman' (qv), or any of the Lord of the Rings books by 'J.R.R. Tolkien' (qv) before he was cast in the movie adaptations.", "Played Magneto in three consecutive films - the only other actors to play comic book criminals in three films, as of 2008, are 'James Franco' (qv) as Harry Osborn, 'Gene Hackman' (qv) as Lex Luthor and his _X-Men (2000)_ (qv) co-star, 'Rebecca Romijn' (qv) as Mystique.", "Close friends with 'Rachel Weisz' (qv), 'Patrick Stewart' (qv) and 'Laura Linney' (qv), whom he befriended through mutual acquaintance 'Armistead Maupin' (qv).", "Received an honorary doctorate from the University of Ulster on February 3, 2013.", "Had 'Maggie Smith' (qv) play his mother in _Richard III (1995)_ (qv), and then played her on an episode of \"Saturday Night Live\". In the BBC Radio production of \"Goldfinger\", he worked with her real son, 'Toby Stephens' (qv). Smith's former husband, Sir 'Robert Stephens' (qv), also played Aragorn in the BBC Radio version of \"The Lord of the Rings\".", "Has English, Northern Irish, and Scottish ancestry.", "At 74 years old, he is the oldest actor to be cast in the role of Sherlock Holmes.", "Revealed in December 2012 that he has been diagnosed with prostate cancer.", "\"The Bells of Hell Go Ting-a-ling-a-ling\" (with 'Gregory Peck' (qv)) in 1966 would have been his feature film debut but for the hostile snowy Swiss location weather. The production, a World War I film with a script by 'Roald Dahl' (qv) to be directed by 'David Miller' (qv), was abandoned after 5 weeks filming.", "Performed Ibsen's \"An Enemy of the People\" at the National Theatre in London with a young 'Johnny Neal' (qv). Johnathon also appeared in _A Christmas Carol (1999)_ (qv) with 'Patrick Stewart' (qv), one of Sir Ian's closest friends.", "He has made six films with 'Hugh Jackman' (qv): _X-Men (2000)_ (qv), _X2: X-Men United (2003)_ (qv), _X-Men: The Last Stand (2006)_ (qv), _Flushed Away (2006)_ (qv), _The Wolverine (2013)_ (qv) and _X-Men: Days of Future Past (2014)_ (qv).", "He played the British Conservative MP 'John Profumo' (qv) in _Scandal (1989)_ (qv) and the British film director 'James Whale' (qv) in _Gods and Monsters (1998)_ (qv). Both of these men had connections to 'Valerie Hobson' (qv): Profumo was married to Hobson from December 31, 1954 until her death on November 13, 1998 while Whale directed her in _Bride of Frankenstein (1935)_ (qv).", "Along with 'Cate Blanchett' (qv), he is one of only two actors to appear in all six of 'Peter Jackson' (qv)'s Middle-earth films: _The Lord of the Rings: The Fellowship of the Ring (2001)_ (qv), _The Lord of the Rings: The Two Towers (2002)_ (qv), _The Lord of the Rings: The Return of the King (2003)_ (qv), _The Hobbit: An Unexpected Journey (2012)_ (qv), _The Hobbit: The Desolation of Smaug (2013)_ (qv) and _The Hobbit: The Battle of the Five Armies (2014)_ (qv).", "He has three Shakespearean roles in common with 'Laurence Olivier' (qv) in filmed performances: (1) Olivier played Hamlet in _Hamlet (1948)_ (qv) while McKellen played him in _Hamlet (1970)_ (qv), (2) Olivier played King Richard III in _Richard III (1955)_ (qv) while McKellen played him in _Richard III (1995)_ (qv) and (3) Olivier played King Lear in _King Lear (1983)_ (qv) while McKellen played him in _King Lear (2008)_ (qv). The two great actors also played the role of Creakle in TV adaptations of 'Charles Dickens' (qv)'s \"David Copperfield\" ('Laurence Olivier' (qv) in _David Copperfield (1970)_ (qv) and 'Ian McKellen' (qv) in _David Copperfield (1999)_ (qv)).", "Although he was 56 when he played the title character in _Richard III (1995)_ (qv), King Richard III was only 32 years old when he died on August 22, 1485.", "He has two roles in common with 'Michael Fassbender' (qv): (1) McKellen played Macbeth in _A Performance of Macbeth (1979)_ (qv) while Fassbender played him in _Macbeth (2015)_ (qv) and (2) McKellen played Erik Lehnsherr / Magneto in _X-Men (2000)_ (qv), _X2: X-Men United (2003)_ (qv), _X-Men: The Last Stand (2006)_ (qv), _The Wolverine (2013)_ (qv) and _X-Men: Days of Future Past (2014)_ (qv) while Fassbender played him in _X-Men: First Class (2011)_ (qv), _X-Men: Days of Future Past (2014)_ (qv), _X-Men: Apocalypse (2016)_ (qv), _The Gifted (2017)_ (qv), and _Dark Phoenix (2019)_ (qv). They also each share the role of Macbeth with their respective Professor X's, 'James McAvoy' (qv) and 'Patrick Stewart' (qv).", "Although he played 'Maggie Smith' (qv)'s son in _Richard III (1995)_ (qv), he is less than five years her junior in real life.", "He was offered the role of King Charles VI of France in _Henry V (1989)_ (qv) but he turned it down. 'Paul Scofield' (qv) was eventually cast.", "Was considered for the role of Clayton in _Tarzan (1999)_ (qv).", "Turned down the role of Albus Dumbledore in Harry Potter and the Prisoner of Azkaban (2004). He was quoted saying \"I had enough trouble living up to one legend. Two would be too much to hope for.\" (referring to his role as Gandalf in \"Lord of the Rings\").", "Was considered for the role of Judge Claude Frollo in _The Hunchback of Notre Dame (1996)_ (qv).", "He was awarded he 1998 Back Stage Garland Award for Outstanding Performance for \"An Enemy of the People\" in a Royal National Theatre production at the Ahmanson Theatre in Los Angeles, California.", "Was offered $1.5 million by 'Sean Parker' (qv) to officiate at his Tolkien-themed wedding in 2013, in costume as Gandalf, but declined, saying \"Gandalf doesn't do weddings\".", "His grand grand father on his mother side, Robert Lowes had been an active member of a institution, that campaigned to get \"half of a day\" holiday on Fridays for workers of industrial age in Manchester in 1890's. This campaign, that had got successful and underlie weekend concept of modern times.", "Strangest career encounters usually involve avid fans who tell him that they've seen and love all the Harry Potter films.", "Ian's mother Margery died when he was 12 and his father Denis died when Ian was 24 .", "One of his biggest film career regrets was turning down the offer to play Kenneth Halliwell opposite 'Gary Oldman' (qv)'s Joe Orton in 'Stephen Frears' (qv)' _Prick Up Your Ears (1987)_ (qv).", "Began and abandoned work on his autobiography, returning a million dollar advance from his publisher, after he found the experience of researching his life too painful.", "Of Clan McQuillan."], "quotes": ["[on his first theatre experience, \"Peter Pan\"] I wasn't over-impressed. For one thing it wasn't a real crocodile and I could see the wires.", "I think it's one thing to declare your sexuality, if you care about what that is. It's another thing to start talking in public about what you do in private and who you do it with. It's not that they [my significant others] don't want to be identified as gay, but that they don't want to be identified as ... with me.", "Many unthinking people just don't like the idea of gays joining in their games, nor in the military and, it would seem, in the movies.", "When I, as Gandalf, meet Bilbo or Frodo at home, I bump my head on the rafters. ['J.R.R. Tolkien' (qv)] didn't think to mention it.", "I am encouraged by the theatricality of ['J.R.R. Tolkien' (qv)'s] readings - full of rhythm and humor and characterization. Without question Gandalf is like Tolkien but then so, I suspected, are Frodo and Aragorn.", "I've had enough of being a gay icon! I've had enough of all this hard work, because, since I came out, I keep getting all these parts, and my career's taken off. I want a quiet life. I'm going back into the closet. But I can't get back into the closet, because it's absolutely jam-packed full of other actors.", "I ... think of the Bible as great literature rather than great history; great imagination rather than reliable witness. Whatever, it is not as a law book that I respect the Bible.", "Acting is no longer about lying. It's now about revealing the truth. People are at ease with me now. Honesty is the best policy.", "\"The Lord of the Rings\" is a mythology, it is a fairy tale, it's an adventure story. It never happened. Except somewhere in our hearts.", "It wasn't exactly a mistake, but if there's anything I regret, it's probably having disguised my own native accent. Actors of my generation all tended to speak RP [received pronunciation]. Of course, it's all different now and drama students are encouraged to keep their regional accents and be able to do RP when required. Even at the BBC these days there's no standardised accent, and I rather think that's a good thing.", "[12/5/03, about the cheering fans outside the InterContinentel Hotel, where he was staying in Wellington, New Zealand:] It's like several Christmases all come at once. They all love Gandalf, but I'm like Father Christmas in the shop. I'm not the real one.", "[12/5/03, on initially thinking it crazy to release the LOTR trilogy 12 months apart] I thought people wouldn't remember what happened a year ago. But I hadn't factored that they would be so successful at the box office, and that so many people would buy the DVD and videos in between the release of each film. I had thought the whole enterprise was doomed, because of the release pattern. I'm very happy to have been proved wrong.", "They'll let me play a gray-bearded wizard, but they still wouldn't cast a young gay actor - who was out - in a straight romantic lead.", "They didn't call it marriage, although you can call it anything you want. The one thing you cannot mention is God, that is absolutely verboten. I suppose I'm a bit mean-spirited, but I really can't see why the government couldn't just say gay people can get married - that would have been true equality and so much simpler. But that hasn't been done because they couldn't face the furore. So they've passed a law that is not available to straight people - straight people cannot have a civil partnership, they have to get married - extraordinary.", "If _The Da Vinci Code (2006)_ (qv) had been filming in a place where it rains a lot, I probably wouldn't have done it. Quite low down in the list is \"How much am I going to be paid?\" I'd say I was quite cheap, but my main feeling about money is that I don't want to feel as though I'm being taken advantage of. Certainly, I'm cheaper than 'Anthony Hopkins' (qv). The other actors they asked to play Gandalf wouldn't go to New Zealand on that money for that length of time. I thought it would be a bit of an adventure. Tony Hopkins didn't think it would be an adventure. Tony is part of Hollywood. I'm an eccentric English actor, and there's a lot of us around.", "If I was a star, it would be difficult to go off and do _Coronation Street (1960)_ (qv). So I guess I'm not a star.", "Nobody has ever looked to Hollywood for social advance. Hollywood is a dream factory. I love the way that conservatives think that Hollywood is a bed of radicalism - it couldn't be more staid and old-ladyship if it tried. The audience don't give a blind whatever about the sexuality of actors. Gay people fancy straight people and vice-versa. It's all in the head, so what does it matter? You're not going to meet 'Heath Ledger'. You're not going to find out . . . It's the image you're looking at and falling in love with. There will be girls who go and see those two unhappy gay cowboys and go home and have fantasy dreams about them. Lovely!", "It may be my rather puritanical upbringing at odds with my inborn laziness that makes me feel guilty at the end of the day, unless I am able to point at some achievement. But this need be no more impressive than cooking a meal or going for a long walk.", "I don't make much distinction between being a stand-up comic and acting Shakespeare - in fact, unless you're a good comedian, you're never going to be able to play Hamlet properly.", "I've often thought the Bible should have a disclaimer at the front saying, \"This is fiction.\" I mean, walking on water? I mean, it takes an act of faith.", "It is very, very, very difficult for an American actor who wants a film career to be open about his sexuality. And even more difficult for a woman if she's lesbian. It's very distressing to me that that should be the case. The film industry is very old fashioned in California.", "My confidence only really peaked when I was 49 and said, \"Yes, I'm gay.\"", "In theatre, I have been able to take parts I didn't think I could do - you have time to rehearse and learn. In movies, they want you to do what they know you can do - there isn't the time.", "I looked down from my terrace hanging over the Thames one morning. It was low tide and there, stranded on the pebbles, was a four-legged corpse - hairless, white and bloated. Was it a calf or a sheep or a goat or a dog? I stared at it until the tide rose and washed it away. For 24 hours I was off my food. When I started eating again, I couldn't face meat - fresh or tinned. Overnight I was vegetarian and I have been for 15 years or more. I've seen the pictures of factory farming and followed the politics of mad cow disease and felt effortlessly superior. Yet it's not reason or conscience that keeps me off meat and fowl--and these days fish, too--just a memory of that unidentifiable, decomposing body on the beach.", "About the 2008 death of 'Brad Renfro' (qv): \"I first caught sight of 'Brad Renfro' (qv) when he was kicking a football around with 'Bryan Singer' (qv) on the half-built set of _Apt Pupil (1998)_ (qv) in Hollywood. He was a kid having fun and that's how I shall always remember him. But he was more than that. He was a proper actor and when we worked together he was determined to be accepted as such. On set, he was blusteringly confident although it was obvious he would have benefited from training as an actor. Yet, as Todd, the disturbed teenager in Apt Pupil, he tapped into an inner demonic world and carried the film on his young shoulders. He longed to belong in the alien world which perhaps in the end overwhelmed him. He was only 25 and it is dreadful we shan't see all that he might have achieved.\"", "I didn't like my character. He didn't seem very deep. He just seemed a representative of evil. - On _Apt Pupil (1998)_ (qv).", "When I act, some people fancy me and some of them are women. There we are! What's the problem? They don't believe me when I say I am in love with a woman?...They don't believe me when I say I am a wizard? They believe me even though they know I am not. It's all nonsense. Everyone knows we are acting. [In a Reuters interview, responding to those who say that gay actors shouldn't come out because then no one will find them believable in romantic scenes with actors of the opposite gender.]", "Don't give up the projects you really want for some extra time with your girlfriend or because you don't want to miss a holiday with your family. They'll understand. Just don't have any regrets.", "I often get mistaken for 'Dumbledore'. One wizard is very much like another.", "[on 'coming out' as being gay] I immediately felt better in every way. I felt relieved that I wasn't lying. You know, when I was growing up in England, there were no gay clubs I knew about. There were no bars. Homosexuals were shamed publicly and imprisoned. You were on your own, looking over your shoulder all the time, hoping in the handshake of a stranger that he might be somebody gay. The first film role I deliberately chose to play after I came out was a raging heterosexual, 'John Profumo' (qv). I was just a little bit worried about whether I could carry out the bed scenes.", "I'm a snob about standards. But I don't find anything odd at all in being known for playing Gandalf. I couldn't be happier about it. Other people tend to get snobbish on my behalf. 'It must be dreadful to always be thought of as Gandalf', they say. Well I can't always be thought of as Richard III.", "Peter [Jackson] and I were just so thrilled that Gandalf the White wasn't in 'The Hobbit'. We prefer Gandalf the Grey. He can have a smoke and a drink and a chat , and do a few little tricks. It was a great relief.", "I don't approve of titles. I think they get in the way. I do however approve of medals for public service, and that's how I choose to look at it.. [But] other actors said to me, 'Please we need a knighthood. Because when a knight knocks on the door of a government office, it has to open'.", "I like fantasy movies, I like musicals, I like variety shows, I like 'Tony Bennett' (qv) - it's all the same to me. The fact that some things are more popular than others doesn't make them better, and it certainly doesn't make them worse.", "I get offered a lot of parts that require long beards. I've turned down God on a number of occasions.", "[at a reunion, to observer 'Michael Fassbender' (qv)] I just want to say how lovely it is to be back in California. I feel safe here now that you've got rid of Proposition 8. I'm looking for a husband. It's great to meet you Michael.", "I don't think I'm top choice. In theatre - for Shakespeare - I'm quite near the top, but not for all directors. In film, I'm way, way down. Spielberg's never asked to work with me, Tarantino has never asked, 'Sam Mendes' (qv) has never asked. It isn't as if there's a long list of films I've turned down but there are plenty I wish I'd had a go at. That's the truth.", "I've always loved dictionaries and encyclopedias. Now you get all that on your computer. It's fantastic. You're looking up something about Dickens and you're invited to explore more and more. I don't know if that's wasting time or not but it doesn't help me to learn lines.", "[on the Oscars] My speech has been in two jackets ... 'I'm proud to be the first openly gay man to win the Oscar.' I've had to put it back in my pocket twice. [2016]", "[on the Academy 'Awards' (qv)] If you are trying to have a career, as a black or Hispanic actor in a state - California - where white people are now the minority, and you are being judged by an Academy where the vast majority are white, male, middle-aged and old ... well, perhaps that is the wrong yardstick. [2016]", "Before 'Michael Mann' (qv) had devised _Miami Vice (1984)_ (qv) he directed _The Keep (1983)_ (qv) and produced it and wrote it. He cast me as the heroine's father, a Romanian academic who gets caught up with Nazis and a monster trapped deep in the Keep. Ever-diligent, I had specially made my first trip to Bucharest and then had a couple of lessons from a dialect coach in London. So by the first day of filming I was ready to sound and feel authentically Romanian. Just before my first take as Dr. Cuza, Michael said: \"Drop the accent - make him more Chicago.\" Well, if the writer/producer/director makes a request, you jump to it. [June 2000]"], "salary history": ["_The Lord of the Rings: The Fellowship of the Ring (2001)_ (qv)::£4,000,000", "_The Lord of the Rings: The Two Towers (2002)_ (qv)::£5,000,000"], "birth date": "1939-05-25", "birth notes": "Burnley, Lancashire, England, UK", "_actorID": "43", "_source": "IMDB", "actorID": "0005212", "created_utc_dt": "09/14/2019, 13:01:51"}