{"headshot": "https://m.media-amazon.com/images/M/MV5BNTAzMzA3NjQwOF5BMl5BanBnXkFtZTgwMDUzODQ5MTI@._V1_UY98_CR7,0,67,98_AL_.jpg", "birth name": "Thomas Stanley Holland", "height": "5' 8\" (1.73 m)", "mini biography": ["Thomas Stanley Holland was born in Kingston-upon-Thames, Surrey, to Nicola Elizabeth (Frost), a photographer, and 'Dominic Holland' (qv) (Dominic Anthony Holland), who is a comedian and author. His paternal grandparents were from the Isle of Man and Ireland, respectively. He lives with his parents and three younger brothers - Paddy and twins Sam and Harry. Tom attended Donhead Prep School. Then, after a successful eleven plus exam, he became a pupil at Wimbledon College. Having successfully completed his GCSEs, in September 2012 Tom started a two-year course in the BRIT School for Performing Arts & Technology notable for its numerous famous alumni.Holland began dancing at a hip hop class at Nifty Feet Dance School in Wimbledon, London. His potential was spotted by choreographer Lynne Page (who was an Associate to Peter Darling, choreographer of Billy Elliot and Billy Elliot the Musical) when he performed with his dance school as part of the Richmond Dance Festival 2006. After eight auditions and subsequent two years of training, on 28 June 2008 Tom made his West End debut in Billy Elliot the Musical as Michael, Billy's best friend. He gave his first performance in the title role of Billy on 8 September 2008 getting rave reviews praising his versatile acting and dancing skills.In September 2008 Tom (together with co-star Tanner Pflueger) appeared on the news programme on channel FIVE and gave his first TV interview. In 2009 Tom was featured on ITV1 show \"The Feel Good Factor\". At the launch show on 31 January he and two other Billy Elliots, Tanner Pflueger and Layton Williams, performed a specially choreographered version of Angry Dance from Billy Elliot the Musical, after which Tom was interviewed by host Myleene Klass. Then he became involved into training five ordinary British schoolboys learning to get fit and preparing their dance routine (fronted by Tom) for the final \"The Feel Good Factor\" show on 28 March 2009. On 11 March 2010, Tom, along with fellow Billy Elliots Dean-Charles Chapman and Fox Jackson-Keen appeared on The Alan Titchmarsh Show on ITV1.On 8 March 2010, to mark the fifth anniversary of Billy Elliot the Musical, four current Billy Elliots, including 'Tom Holland' (qv), were invited to 10 Downing Street to meet the Prime Minister Gordon Brown. It was 'Tom Holland' (qv) who was chosen to be a lead at the special fifth anniversary show on 31 March 2010. Elton John, Billy Elliot the Musical composer, who was at the audience, called Tom's performance \"astonishing\" and said that he was \"blown away\" by it. Holland had been appearing on a regular basis as Billy in Billy Elliot the Musical rotating with three other performers till 29 May 2010 when he finished his run in the musical.In two months after leaving Billy Elliot the Musical, Holland successfully auditioned for a starring role in the film The Impossible (directed by Juan Antonio Bayona) alongside Naomi Watts and Ewan McGregor. The Impossible was based on a true story that took place during the 2004 Indian Ocean earthquake. The film premiered at the Toronto International Film Festival on September 9, 2012, and was released in Europe in October 2012, and in North America in December 2012.Tom has received universal praise for his performance, in particular: \"What a debut, too, from 'Tom Holland' (qv) as the eldest of their three lads\" (The Telegraph); \"'Tom Holland' (qv), making one of the finest feature debuts in years\" (HeyUGuys); \"the excellent 'Tom Holland' (qv)\" (The Guardian); \"The child performers are uncanny and there is an especially terrific performance from 'Tom Holland' (qv) as the resourceful, levelheaded Lucas terrified but tenacious in the face of an unspeakable ordeal\" (Screen Daily); \"Young Holland in particular is astonishingly good as the terrified but courageous Lucas.\" (The Hollywood Reporter); \"However, the real acting standout in The Impossible is the performance of 'Tom Holland' (qv) as the eldest son Lucas. His portrayal is genuine, and at no moment does it feel melodramatic and forced. The majority of his scenes are separate from the lead actors and for the most part it feels like The Impossible is Holland's film\" (Entertainment Maven); \"Mr. Holland, meanwhile, matures before our eyes, navigating the passage from adolescent self-absorption to profound and terrible responsibility. He is a terrific young actor\" (New York Times).Tom has given a number of interviews about his role in The Impossible. In particular, he talked on video to Vanity Fair Senior West Coast editor Krista Smith and with IAMROGUE's Managing Editor Jami Philbrick. He has also given interviews to The Hollywood Reporter, to the MovieWeb, to Today Show on NBC and to other outlets. Tom's director and co-stars have also talked about him. Juan Antonio Bayona: \"He had this extraordinary ability to get into the emotion and portray it in a very, very easy way. The best I'd ever seen in a kid.\" Ewan McGregor: \"It was wonderful watching Tom who had never worked in front of a camera before, to see him really get it and grow as a film actor as he went along. He's really talented and polite to everyone. It's very easy for children to lose perspective but he's absolutely on the right road and a brilliant actor.\" Naomi Watts: \"He has an incredible emotional instrument and an unbelievable sense of himself... 'Tom Holland' (qv) and I had a couple of moments where we came together and I could just tell how wonderful he was and what a beautiful instrument he had. It was just easy to work with him, that was one of the greatest highlights for me: discovering a friendship with Tom off-screen and this beautiful relationship between mother and son on-screen. The intimacy that develops through the course of the film between Lucas and Maria, I just loved that relationship. I mean, Tom is a beyond gifted actor. He's just a raw, open talent that is just so easy to work with. And Tom, he's inspiring, he kind of lifts everyone's game around him because he can do nothing but tell the truth. He was great.\"In his turn, 'Tom Holland' (qv) has returned favours to Naomi Watts when he was asked to present Desert Palm Achievement Award to her at Palm Springs International Film Festival. According to HitFix: \"One recurring theme of the night was how the introductions were often better than actual winner's speeches... The best intro, however, had to go to 16-year-old 'Tom Holland' (qv) who intro'd his \"Impossible\" co-star Watts. Holland admitted of all of Watts' great performances his dad had only let him see \"King Kong\" and while they spent six weeks shooting in a water tank he didn't know it was \"difficult\" because he actually \"loved it\"... Most important, this was Holland's first film role and he sweetly noted, \"From the moment I met you, you took my hand and you never let go.\" Cue the \"awwww\" from the audience.\" The presentation is available on video.In 2011, Holland was cast in British version of the animation film Arrietty, produced by Japan's cult Studio Ghibli. He has provided voice over for the principal character Sho. In 2012 'Tom Holland' (qv) played the starring role of Isaac in the film \"How I lived Now\", (directed by Kevin Macdonald) alongside Saoirse Ronan. The film was released in 2013.On 17 October 2012, Holland became a recipient of Hollywood Spotlight Award for his role in The Impossible. \"We are very excited that we will be able to recognize acting talents that are on the road to discovery and stardom,\" said Carlos de Abreu, founder and executive director of the Hollywood Film 'Awards' (qv) in a statement. On 6 December 2012 it was announced that Holland became a winner of the National Board of Review award in the \"Breakthrough Actor\" category. In the end of December 2012, Holland was voted a winner for the year's Best Youth Performance in Nevada Critics 'Awards' (qv).In December 2012, Holland received a number of nominations for his role in The Impossible: for the 18th annual Critics' Choice Movie 'Awards' (qv), in the \"Best Young Acror/Acress\" category; for Chicago Film Critics Association 'Awards' (qv) 2012 in the \"Most Promising Performer\" category; for the 27th Goya 'Awards' (qv) in the \"Best New Actor\" category; for the Washington D.C. Area Film Critics Association 'Awards' (qv) 2012 in the \"Best Youth Performance\" category; for the London Film Critics Circle 'Awards' (qv) 2012 in the \"Young British Performer of the Year\" category.Kristopher Tapley, Editor-at-Large of HitFix, reported on 27 August 2012 that Summit Entertainment, the company responsible for distribution of The Impossible in USA, would be campaigning Holland rather than McGregor as the lead, and strongly argued that 'Tom Holland' (qv) deserved to be nominated for an Academy Award in the Best Actor category. The fact of long-listing for an Academy Award was confirmed in the article in the Hollywood Reporter: \"And though McGregor stars as his father in the film, Holland has been submitted as the lead actor for awards consideration. Regardless if he receives any nominations, his performance as the strong-willed and determined eldest son is garnering critical acclaim.\"As one of the most promising young actors, Holland was featured in Screen International's \"UK Stars of Tomorrow - 2012\" and in Variety's \"Youth Impact Report 2012\". Holland has been signed up by William Morris Endeavor (WME) global talent agency and is represented by Curtis Brown literary and talent agency.In 2015, Tom was cast as Peter Parker/Spider-Man in Sony and Marvel's films. He has played the role in _Captain America: Civil War (2016)_ (qv), _Spider-Man: Homecoming (2017)_ (qv), and _Avengers: Infinity War (2018)_ (qv).::Anonymous"], "trade mark": ["Mostly portrays inexperienced and enthusiastic kids", "Fluent American accent"], "trivia": ["He is the son of 'Dominic Holland' (qv), a top comic in the UK and a regular panelist on the Channel 5 topical discussion series _The Wright Stuff (2000)_ (qv).", "Since March 2011, his father had been writing the blog \"Eclipsed\", which was a weekly renewed sequential story narrating how a \"somewhat famous comedian is being outshone by his more illustrious son\". The blog described in detail the main events in Holland's past and present professional life. The blog came to conclusion in December 2012 when _The Impossible (2012)_ (qv) premiered in Los Angeles.", "He became best known for playing the title role in Billy Elliot the Musical at the Victoria Palace Theatre, London, as well as for starring in the _The Impossible (2012)_ (qv). For the latter role, he became a winner of the Hollywood Spotlight Award, as well as of the National Board of Review's award in the \"Breakthrough Actor\" category.", "He was featured in Screen International's \"UK Stars of Tomorrow - 2012\" and in Variety's \"Youth Impact Report 2012\".", "His favorite film is _Saving Private Ryan (1998)_ (qv).", "His paternal grandfather, John Charles Anthony Holland, was from the Isle of Man, and his paternal grandmother, Teresa Quigley, was from Ireland. On his mother's side, Tom is the grandson of Robert Walter Frost and Christina Winifred Berry.", "He was cast for the role as \"Billy Elliot\" on stage because he reminded 'Stephen Daldry' (qv) of _Billy Elliot (2000)_ (qv) star 'Jamie Bell' (qv).", "He is the first actor to play a film incarnation of Peter Parker/Spider-Man who was also a teenager at the time of casting, having turned 19 shortly before the formal announcement in June 2015.", "He is the first non-U.S-born actor to play a film incarnation of Peter Parker/Spider-Man. His predecessor, 'Andrew Garfield' (qv), was also raised in the U.K., but was born in the United States.", "He is a supporter of the Arsenal Football Club.", "He can perform back, side and front flips.", "His favorite screen acting performance is 'Edward Norton' (qv) in _Primal Fear (1996)_ (qv).", "Like his predecessor 'Andrew Garfield' (qv), he was a huge fan of Spider-Man before he played the role and said that playing the role in the Marvel Cinematic Universe was a dream come true for him.", "Based his performance as Peter Parker/Spider-Man on 'Michael J. Fox' (qv).", "Broke his nose on the last day of filming _The Lost City of Z (2016)_ (qv).", "Broke his nose for the second time during the first week of filming _Chaos Walking (2020)_ (qv), after getting punched in the face by a stuntman.", "He beat out 'Timothée Chalamet' (qv), 'Charlie Plummer' (qv), 'Judah Lewis' (qv), 'Matt Lintz' (qv) and 'Charlie Rowe' (qv) for the role of Spider-Man.", "Was offered a role in the film _Bad Times at the El Royale (2018)_ (qv), but turned it down.", "He was originally cast as Seaplane McDonough/Alex in _Jumanji: Welcome to the Jungle (2017)_ (qv), but had to drop out of the film due to scheduling conflicts with _Spider-Man: Homecoming (2017)_ (qv).", "He has 3 younger brothers, twins named 'Harry Holland' (qv) and 'Sam Holland' (qv) and youngest brother 'Paddy Holland' (qv).", "Owns a pit bull named Tessa.", "Despite being best known for playing Spider-Man, he has said that he has a very strong fear of spiders in real life.", "Is not to be confused with famous Horror-Writer/Director 'Tom Holland' (qv).", "Was considered for the lead role in _1917 (2019)_ (qv), but dropped out due to scheduling conflicts.", "A leaked casting sheet revealed that he was considered for the voice of Sonic in _Sonic the Hedgehog (2020)_ (qv).", "He broke 'Tobey Maguire' (qv)'s record of portraying Spider-Man in a live action film after portraying the character for a fourth time in _Avengers: Endgame (2019)_ (qv)."], "quotes": ["I think the important thing is to just take in one step at a time. I think if you rush into fame, then that's where it can be really affecting, and if you take it for granted it can be really affecting.", "Civil War will be a brilliant movie, a huge movie and I'll have the support of the success of that movie so that I can go on to my own.", "I'm taking every day as it comes and there's very little preparation that you can do apart from making sure you remain grounded and keep the people that are close to you close and my main goal at the moment is to make sure my work doesn't fall below a certain calibre.", "When Ron Howard rings you up and says \"I'd like you to do my film\", you do it. I mean, he's Ron Howard. But for me, I was very interested in Thomas Nickerson and very interested to learn about what it is these men went through. I just knew it was going to be an amazing adventure, I knew it was something I was gonna be very proud of and I knew it was gonna be a challenge. I personally think if something's not a challenge there's no point doing it because you're not gonna learn much. I knew this film was gonna teach me a lot.", "I've always been a huge fan of Spider-Man and growing up, I had countless Spider-Man costumes. Only two years ago did I go to a fancy dress party dressed as Spider-Man. I had this awesome morph suit where you can put your phone on your chest and spiders would crawl across the costume, it was awesome! He's always been a big part of my life and a big part of a lot of boys' lives, because everyone can kind of relate to him.", "At the moment, I'm sort of developing some of my own little short film ideas, and trying to get into the directing side of things, just as an interest really, to see what it's like.", "The way Ron [Howard] likes to work is that he likes to create an environment that is authentic, and he likes to create an environment where the actors are comfortable so that they can explore new ways of performing."], "salary history": ["_Billy Elliot the Musical Live (2014)_ (qv)::$500,000", "_Captain America: Civil War (2016)_ (qv)::$250,000", "_Spider-Man: Homecoming (2017)_ (qv)::$1,500,000"], "birth date": "1996-06-01", "birth notes": "Kingston upon Thames, England, UK", "_actorID": "74", "_source": "IMDB", "actorID": "4043618", "created_utc_dt": "09/14/2019, 13:02:21"}