{"headshot": "https://m.media-amazon.com/images/M/MV5BMjExNzA4MDYxN15BMl5BanBnXkFtZTcwOTI1MDAxOQ@@._V1_UY98_CR2,0,67,98_AL_.jpg", "birth name": "Mark Sinclair", "height": "5' 11¾\" (1.82 m)", "mini biography": ["'Vin Diesel' (qv) was born Mark Sinclair in Alameda County, California, along with his fraternal twin brother, 'Paul Vincent' (qv). He was raised by his astrologer/psychologist mother, Delora Sherleen (Sinclair), and adoptive father, Irving H. Vincent, an acting instructor and theatre manager, in an artists' housing project in New York City's Greenwich Village. He never knew his biological father. His mother is white (with English, German, Scottish, and Irish ancestry), and his adoptive father is African-American; referring to his biological father's background, Diesel has said that he himself is \"definitely a person of colour\".His first break in acting happened by chance, when at the age of seven he and his friends broke into a theatre to vandalize it. A woman stopped them and offered them each a script and $20, on the condition that they would attend everyday after school. From there, Vin's fledgling career progressed from the New York repertory company run by his father, to the Off-Off-Broadway circuit. At age seventeen and already sporting a well-honed physique, he became a bouncer at some of New York's hippest clubs to earn himself some extra cash. It was at this time that he changed his name to 'Vin Diesel' (qv).Following high school, Vin enrolled as an English major at Hunter College, but dropped out after three years to go to Hollywood to further his acting career. Being an experienced theatre actor did not make any impression in Hollywood and after a year of struggling to make his mark, he returned to New York. His mother then gave him a book called \"Feature Films at used Car Prices\" by Rick Schmidt. The book showed him that he could take control of his career and make his own movies. He wrote a short film based on his own experiences as an actor, called _Multi-Facial (1995)_ (qv), which was shot in less than three days at a cost of $3,000. _Multi-Facial (1995)_ (qv) was eventually accepted for the 1995 Cannes Film Festival where it got a tumultuous reception.Afterwards, Vin returned to Los Angeles and raised almost $50,000 through telemarketing to fund the making of his first feature, _Strays (1997)_ (qv). Six months after shooting, the film was accepted for the 1997 Sundance Film Festival, and although it received a good reception, it did not sell as well as hoped. Yet again Vin returned disappointed to New York only to receive a dream phone call. 'Steven Spielberg' (qv) was impressed by _Multi-Facial (1995)_ (qv) and wanted to meet Vin, leading him to be cast in _Saving Private Ryan (1998)_ (qv). _Multi-Facial (1995)_ (qv) earned Vin more work, when the director of _The Iron Giant (1999)_ (qv) saw it and decided to cast Vin in the title role. From there, Vin's career steadily grew, with him securing his first lead role, as Richard B. Riddick in the sci-fi film _Pitch Black (2000)_ (qv). The role has earned him a legion of devoted fans and the public recognition he deserves.Since then, he has headlined a series of blockbusters, often but not only centered on fast-driving motor vehicles: _The Fast and the Furious (2001)_ (qv), _xXx (2002)_ (qv), _The Pacifier (2005)_ (qv), _Fast & Furious (2009)_ (qv), _Fast Five (2011)_ (qv), _Fast & Furious 6 (2013)_ (qv), and _Furious 7 (2015)_ (qv). He also voiced Groot in _Guardians of the Galaxy (2014)_ (qv) and starred in the lower-budgeted courtroom drama _Find Me Guilty (2006)_ (qv), the latter directed by 'Sidney Lumet' (qv).::Lilith <webmistress@vindiesel.co.uk>"], "trade mark": ["Shaves his head", "Muscular physique", "Deep, gravelly, powerful voice", "Big, lanky boots"], "trivia": ["He worked as a bouncer in New York at the famous nightclubs Tunnel (which has since closed) and Mars.", "Has a fraternal twin brother, 'Paul Vincent' (qv), who is a film editor.", "Has an Italian Mastiff named \"Roman\".", "Has a younger sister, 'Samantha Vincent' (qv), and a younger brother, in addition to his fraternal twin Paul.", "Ranked #46 in Premiere magazine's 2003 annual Power 100 List. Had ranked #95 in 2002.", "Is an admitted fan of \"Dungeons and Dragons\", and, according to an interview on _Late Night with Conan O'Brien (1993)_ (qv), had then-played it for 24 years.", "Was offered the role of Matt Murdock/Daredevil in _Daredevil (2003)_ (qv) that eventually went to 'Ben Affleck' (qv).", "Born Mark Sinclair in Alameda County, CA (where his mother was also born). He later moved to New York City, where he was raised. His mother has English, German, Scottish and Irish ancestry, while his biological father's identity and background are not publicly known. He has described himself as \"definitely a person of color\". He was raised by his Caucasian mother and African-American stepfather.", "Producing partner with 'George Zakk' (qv). Their company is called One Race Productions. Also owns a record label called Racetrack Records.", "Wrote an original screenplay titled \"Doormen\" (based on his experiences as a bouncer) as a follow-up to _Strays (1997)_ (qv), his directorial debut. However, his acting career exploded and his plans to direct the film fell by the wayside. The concept eventually developed into the Fox Digital Entertainment web series _The Ropes (2011)_ (qv), which Diesel created and produced.", "During his teens, he performed breakdancing in an instructional video on the subject.", "Credits the book \"Feature Filmmaking at Used Car Prices\" by Rick Schmidt as the one resource above all upon which he built his career. This book, according to Diesel, gave him the tools, knowledge, and most importantly, the inspiration to develop his short film _Multi-Facial (1995)_ (qv), which he wrote, produced, directed and starred in.", "He was cast opposite 'Ben Affleck' (qv) in _Reindeer Games (2000)_ (qv), but left the production shortly after filming began over concerns with the quality of 'Ehren Kruger' (qv)'s screenplay and creative differences with director 'John Frankenheimer' (qv).", "Revolution Studios wanted him for the title role in _Hellboy (2004)_ (qv), but director 'Guillermo del Toro' (qv) thought that 'Ron Perlman' (qv) was the perfect choice for the role, and would not direct the movie if he was not cast.", "Was listed as a potential nominee on both the 2003 and 2004 Razzie Award nominating ballots. He was listed as a suggestion for the Worst Actor category on the 2003 ballot for his performances in the films _Knockaround Guys (2001)_ (qv) and _xXx (2002)_ (qv). And was listed as a suggestion again on the nominating ballot in the Worst Actor category the next year for his role in _A Man Apart (2003)_ (qv). He did not receive either nomination. The following year though, he finally received his first Razzie nomination for Worst Actor in the film _The Chronicles of Riddick (2004)_ (qv). However, he did not \"win\".", "Is the cousin of rapper/producer 'Kwamé' (qv) \"The Boy Genius\". Kwame says if you watch his old videos, you'll see Vin in a few of them.", "Once worked as a telemarketer, selling light bulbs.", "In addition to being considered for the role of Hellboy in 2004, he was also considered for the part of Abe Sapien.", "He gained 35 pounds so he could portray Fat Jackie in _Find Me Guilty (2006)_ (qv).", "Attended Hunter College and got his jump start by 'Steven Spielberg' (qv) just like fellow actors 'Sam Feuer' (qv) and 'Edward Burns' (qv).", "He and his girlfriend, 'Paloma Jiménez' (qv), welcomed their first child, daughter Hania Riley, on April 2, 2008.", "Started the video game company Tigon Studios in 2002. It in turn worked on the movie-based game _The Chronicles of Riddick: Escape from Butcher Bay (2004)_ (qv). Tigon is working on more next-gen games as well as having a hand in all Diesel-based games.", "Revealed that the daughter he welcomed in April 2008, is named Hania Riley. [September 2008]", "Wrote a three-page letter to director 'Steven Spielberg' (qv) expressing his admiration for his work, particularly _Schindler's List (1993)_ (qv). Spielberg was impressed with the heartfelt prose, prompting him to invite Diesel into the star-studded cast of _Saving Private Ryan (1998)_ (qv).", "Lives in Los Angeles, CA.", "Vin revealed in several interviews that he has remained extremely close to friend and _The Fast and the Furious (2001)_ (qv) co-star 'Michelle Rodriguez' (qv). His children even refer to her as their aunt.", "Traded a cameo in _The Fast and the Furious: Tokyo Drift (2006)_ (qv) for the rights to the character Riddick from _Pitch Black (2000)_ (qv) and _The Chronicles of Riddick (2004)_ (qv).", "Was considered to voice the role of Ultron in _Avengers: Age of Ultron (2015)_ (qv) before 'James Spader' (qv) was cast.", "He was awarded a Star on the Hollywood Walk of Fame at 7000 Hollywood Blvd. on August 26, 2013.", "His third child, a daughter, is named Pauline after late best friend and co-star 'Paul Walker' (qv). Mother is 'Paloma Jiménez' (qv).", "His second child, a boy named Vincent Sinclair, was born in 2010. Mother is 'Paloma Jiménez' (qv).", "Despite being only 5' 11¾\" (1.82 m) his muscular physic makes him look bigger and taller.", "He had two movies released on the same day in 200 boiler room and pitch black both came out on February 18 2000.", "Both of his movies that came out in 2000 came out on same day boiler room and pitch black were both released on February 18 2000."], "quotes": ["Well, I've worked out for years. For a long time it was my only sense of gratification.", "I would get into fights with other bouncers when a guy was already on the floor and the other guys thought it was alright to jump up in the air and land on the guy's head.", "[on why he didn't do the \"Fast and the Furious\" sequel] I was being offered three franchises at the same time: _Pitch Black (2000)_ (qv), _xXx (2002)_ (qv) and _The Fast and the Furious (2001)_ (qv) -- and I had to choose. I couldn't do all three. [he has since appeared in sequels to all three franchises]", "[on the _xXx (2002)_ (qv) poster and what it means for his career] This isn't a poster. This is a declaration of war!", "[on his mysterious ethnicity] I am definitely a person of color.", "[on the planned \"Chronicles of Riddick\" trilogy] We gave the script to the studio, I bought three leather binders. One said C1, one said C2 and one said C3. They all had locks on them and we only gave the key to C1 to the studio\"", "In the next film, Riddick is going to go to the underverse. Riddick will act with new elementals. Not air elementals [as 'Judi Dench' (qv)'s character is] but fire and water. It'll come full circle in C3 when he must return to Furya.", "[on _The Chronicles of Riddick (2004)_ (qv)] The concept behind switching genres was to create a film that you could continue exploring. In the ending of this movie, it's not just something that says we're opening it up so we can tell another story, it's very specific. A very daring ending because it's left open-ended.", "From the very very beginning, when everyone thought it was crazy, I was thinking of _The Chronicles of Riddick (2004)_ (qv) as a trilogy. That would start with the movie you saw, and _Pitch Black (2000)_ (qv) would act as a prequel that introduced you to the character. So in simple terms, in Chronicles 2 we venture to the Underverse. We knew we could get away with a PG-13 on the first one, but once you go to the Underverse it's rated R, because it's a place where war is the norm and there is constant, constant battling. Then on Chronicles 3 we will see Riddick return to Furya, to deal with the homeland.", "I was a bouncer for nine years - it was all I knew how to do - and my training was not to talk loosely... That's still my thought process: Shut your mouth, watch your back and keep working 'til your ass falls off.", "With age, you get to a place where you don't want to knock people out. You just want to give people a hug.", "When people view me, they don't necessarily see a black man. For that reason, a film like _Guess Who's Coming to Dinner (1967)_ (qv) or _Driving Miss Daisy (1989)_ (qv) could never work with me in it.", "I am truly multi-racial. I never knew my biological father. I've always had less information than I would have liked to have had. All I know from my mother is that I have connections to many different cultures.", "[on _Multi-Facial (1995)_ (qv)] That film is my tribute to my background. The man who raised me is black. Culturally, he made me who I am. He was a theatre director, so he also guided me artistically.", "I act because it's the one time I'm sure of my identity. There's no doubt. It's on paper.", "We're in a gaming society now, so people are conditioned to work a little bit for their story. People like to be rewarded for whatever equity they put into your universe.", "[on the Fast & Furious and Riddick franchises]: My whole approach to making these movies and to creating these sagas is saying to the studio, 'The audience is paying attention to the nuances and all the story points that lead up to this film. The more you acknowledge that, the better movie you have.'", "[on _Multi-Facial (1995)_ (qv)] I guess I've always looked past the exterior and the ambiguity that my existence represents. When I was in my mother's stomach, it was still illegal in parts of America for people of color and white people to procreate. Everyone had known me just as a bouncer in New York because I wasn't able to get any work. There was something too ambiguous about the way I look that would prevent me from ever getting a star.", "My mom used to say that I became a fighter and a scrapper and a tough guy to protect whom I am at my core. This exterior means that I am actually one of the few people who can show love without coming across as soft."], "salary history": ["_Saving Private Ryan (1998)_ (qv)::$100,000", "_The Fast and the Furious (2001)_ (qv)::$2,000,000", "_xXx (2002)_ (qv)::$10,000,000", "_A Man Apart (2003)_ (qv)::$2,500,000", "_The Chronicles of Riddick (2004)_ (qv)::$11,500,000", "_Fast Five (2011)_ (qv)::$15,000,000 (including producer fee)", "_Furious Seven (2015)_ (qv)::$47,000,000 (including producer fee)"], "birth date": "1967-07-18", "birth notes": "Alameda County, California, USA", "_actorID": "15", "_source": "IMDB", "actorID": "0004874", "created_utc_dt": "09/14/2019, 13:01:25"}