{"headshot": "https://m.media-amazon.com/images/M/MV5BZmRlOTBlZWItMzE4Mi00YTUzLTgwYzAtY2U1ZDJlMjJlODU4XkEyXkFqcGdeQXVyNjk1MjYyNTA@._V1_UY98_CR2,0,67,98_AL_.jpg", "nick names": ["Nic"], "birth name": "Nicholas Kim Coppola", "height": "6' (1.83 m)", "mini biography": ["'Nicolas Cage' (qv) was born Nicolas Kim Coppola in Long Beach, California, the son of comparative literature professor 'August Coppola' (qv) (whose brother is director 'Francis Ford Coppola' (qv)) and dancer/choreographer Joy Vogelsang. He is of Italian (father) and Polish, German, and English (mother) descent. Cage changed his name early in his career to make his own reputation, succeeding brilliantly with a host of classic, quirky roles by the late 1980s.Initially studying theatre at Beverly Hills High School (though he dropped out at seventeen), he secured a bit part in _Fast Times at Ridgemont High (1982)_ (qv) -- most of which was cut, dashing his hopes and leading to a job selling popcorn at the Fairfax Theater, thinking that would be the only route to a movie career. But a job reading lines with actors auditioning for uncle Francis' _Rumble Fish (1983)_ (qv) landed him a role in that film, followed by the punk-rocker in _Valley Girl (1983)_ (qv), which was released first and truly launched his career.His one-time passion for method acting reached a personal limit when he smashed a street-vendor's remote-control car to achieve the sense of rage needed for his gangster character in _The Cotton Club (1984)_ (qv).In his early 20s, he dated 'Jenny Wright' (qv) for two years and later linked to 'Uma Thurman' (qv). After a relationship of several years with 'Christina Fulton' (qv), a model, they split amicably and share custody of a son, 'Weston Cage Coppola' (qv) (b.1992). In 2004, he married 'Alice Kim Cage' (qv), with whom he has a son.::Dan Hartung <dhartung@mcs.com>"], "spouse": ["'Erika Koike' (qv)::(23 March 2019 - present) ( separated)", "'Alice Kim Cage' (qv)::(30 July 2004 - 2016) ( divorced) ( 1 child)", "'Lisa Marie Presley' (qv)::(10 August 2002 - 16 May 2004) ( divorced)", "'Patricia Arquette' (qv)::(8 April 1995 - 18 May 2001) ( divorced)"], "trade mark": ["Often plays flamboyant and/or eccentric characters (Ronny Cammareri in _Moonstruck (1987)_ (qv), Sailor Ripley in _Wild at Heart (1990)_ (qv), Ben Sanderson in _Leaving Las Vegas (1995)_ (qv), Charlie Kaufman / Donald Kaufman in _Adaptation. (2002)_ (qv)).", "Often plays eccentric wisecracking characters", "Sharp, dark, pointy eyebrows and striking blue eyes", "Low-sounding voice."], "trivia": ["His father was of Italian descent. His maternal grandfather was of approximately three quarters German and one quarter British Isles (English, Scottish) ancestry. His maternal grandmother was of Polish descent.", "2000: Filed divorce papers in February, withdrew them in April.", "October 1997: Ranked #40 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list.", "Was engaged to 'Kristen Zang' (qv).", "Nephew of 'Francis Ford Coppola' (qv) and 'Talia Shire' (qv).", "Got 'Johnny Depp' (qv) his first acting job.", "Close friend of 'Tom Waits' (qv), 'Crispin Glover' (qv) and 'Rush' (qv) drummer 'Neil Peart' (qv).", "Stage name taken from comic book character Luke Cage.", "Owns a Lamborghini that used to belong to 'Prince Ali-Reza Pahlavi' (qv), the former prince of Iran.", "Younger brother of 'Marc Coppola' (qv) and 'Christopher Coppola' (qv).", "Grandson of 'Carmine Coppola' (qv).", "Proposed to 'Patricia Arquette' (qv) on the day he met her in the early 1980s. Arquette thought he was a bit strange but played along with his antics by creating a list of things Cage would have to fulfill to win her. When he started to work his way through the list, Arquette got scared and avoided him. They met again many years later and later went on to marry.", "1997: He lived in a fake castle on the outskirts Los Angeles. He wants to import an authentic one from overseas.", "Loves to improvise, ocassionally to the annoyance of other cast members.", "Collects comic books and sees them as being today's equivalent of mythology.", "The _Wild at Heart (1990)_ (qv) movie poster lists his name as both \"'Nicolas Cage' (qv)\" and \"Nicholas Cage\".", "Ranked #37 in Premiere's 100 most powerful people in Hollywood in 1998.", "1984: Listed as one of 12 \"Promising New Actors of 1984\" in John Willis' Screen World, Vol. 36.", "'Tim Burton' (qv) cast Cage in his doomed Superman project. Cage even did fittings of the costume.", "On his upper back he has a tattoo of monitor lizard with a top hat.", "2001: Announced that he is dating 'Lisa Marie Presley' (qv), daughter of 'Elvis Presley' (qv). They later married.", "Cousin of 'Robert Schwartzman' (qv), who changed his name to 'Robert Schwartzman' (qv)-Cage inspired by Nicolas.", "May 2001: Awarded an Honorary Doctorate in Fine Arts by California State University, Fullerton and also spoke at the commencement.", "Father, 'August Coppola' (qv), was formerly a professor at Cal State Long Beach and Dean of Creative Arts at San Francisco State University.", "During an A&E 'Biography' (qv) on him, the host explained that Cage was director 'Sam Raimi' (qv)'s first choice to play Norman Osborn/Green Goblin in the movie _Spider-Man (2002)_ (qv). Apparently this was before he met 'Willem Dafoe' (qv).", "Graduated UCLA School of Theater, Film, and Television.", "Cousin of 'Sofia Coppola' (qv), 'Jason Schwartzman' (qv) and 'Roman Coppola' (qv).", "On _The Tonight Show with Jay Leno (1992)_ (qv), he told Jay that he took the name \"Cage\" from a comic book character named Luke Cage, the \"first black superhero.\" This is not accurate; the first black superhero in mainstream comics was Marvel's Black Panther, introduced in 1966. Luke Cage, introduced in 1972, was also preceded by: Marvel's Falcon, introduced in 1969; the black western hero, Lobo, from Dell Comics in 1965 (the first black character to star in his own title); the title character of \"Waku, Prince of the Bantu,\" an African chieftain, introduced as part of the Atlas Comics anthology title \"Jungle Tales\" in 1954. When asked which of the powers he would prefer to have, he said flight was his desire.", "One of three actors (with 'Lee Marvin' (qv) [_Cat Ballou (1965)_ (qv)] and 'Peter Sellers' (qv) [_Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964)_ (qv)]) with an Oscar nomination for playing multiple characters in a film (in _Adaptation. (2002)_ (qv), he plays two characters, Donald and Charlie). Marvin is the only one who actually won one for a double role.", "Former cousin, by marriage, of director 'Spike Jonze' (qv).", "Met his future wife, 'Alice Kim Cage' (qv), at a sushi bar where she was a waitress. When they married she was only 20 years old.", "Went to the same high school as 'Angelina Jolie' (qv), 'Michael Klesic' (qv), 'Lenny Kravitz' (qv), 'David Schwimmer' (qv), 'Jonathan Silverman' (qv), 'Gina Gershon' (qv), 'Rhonda Fleming' (qv), 'Jackie Cooper' (qv), 'Rob Reiner' (qv), 'Antonio Sabato Jr.' (qv), 'Pauly Shore' (qv), 'Michael Tolkin' (qv), 'Betty White' (qv), 'Corbin Bernsen' (qv), 'Elizabeth Daily' (qv), 'Albert Brooks' (qv) and 'Crispin Glover' (qv).", "Ate a real cockroach in the film _Vampire's Kiss (1988)_ (qv), it reportedly took three takes. He once said about the experience, \"Every muscle in my body didn't want to do it, but I did it anyway.\"", "Attended Justin-Siena High School in Napa, CA, during the early '80s.", "His is (along with his cousin 'Sofia Coppola' (qv)) the third generation of Oscar winners in the Coppola family. His uncle, 'Francis Ford Coppola' (qv) and his grandfather, 'Carmine Coppola' (qv), are the other two generations. They are the second family to do so, the first family is the Hustons - 'Anjelica Huston' (qv), 'John Huston' (qv) and 'Walter Huston' (qv).", "Became a father for the 2nd time at age 41 when his 3rd wife 'Alice Kim Cage' (qv) gave birth to their son 'Kal-El Cage' (qv) on October 3, 2005. Just as Nick was named after a comic book character, \"Luke Cage\", so he has named his son after the comic book character \"Kal-el\" (aka Superman).", "Trains in Brazilian Jiu-Jitsu under 'Royce Gracie' (qv) 'Nicolas Cage' (qv) also trains in Wing Chun, Karate, & Jeet Kune Do.", "Referred to as the \"Jazz musician of acting\" by 'David Lynch' (qv).", "Former stepfather of 'Patricia Arquette' (qv)'s son 'Enzo Rossi' (qv), 'Riley Keough' (qv) and 'Benjamin Keough' (qv).", "July 2006: Bought Schloss Neidstein, a mini castle in the Bavarian village of Etzelwang.", "After his first film role (in _Fast Times at Ridgemont High (1982)_ (qv)), he adopted the stage name of Cage, because he wanted to assure himself that any success he had was based on his own merits, not the fame of his uncle, 'Francis Ford Coppola' (qv).", "Was a very close friend of late 'Johnny Ramone' (qv).", "Big fan of 'Elvis Presley' (qv).", "Considered \"Blue\" before settling on \"Cage\" as his surname.", "2006: He purchased a home on the former property of 'John Wayne' (qv) in Newport Beach, CA, for a record-setting $24 million.", "Said in a Reader's Digest interview that his wife, Alice, is into designing jewelry and has no interest whatsoever in being an actress.", "Offered the role of Green Goblin/Norman Osborn in _Spider-Man (2002)_ (qv).", "Was originally considered for the role of Brad Hamilton in _Fast Times at Ridgemont High (1982)_ (qv), but after his audition the studio thought his performance was too dark and the role went, instead, to 'Judge Reinhold' (qv). Additionally, Cage was 17 at the time and could not work as many hours as actors over 18. In this film, he is credited under the name Nicolas Coppola for the first and only time.", "1999: Was among the guests at the wedding of 'Spike Jonze' (qv) and 'Sofia Coppola' (qv). Others were 'George Lucas' (qv), 'Jason Schwartzman' (qv), 'Bo Barrett' (qv), 'Kirsten Dunst' (qv) and 'Tom Waits' (qv).", "Auditioned for the role of Joel in _Risky Business (1983)_ (qv), which eventually went to 'Tom Cruise' (qv) and helped launch his career.", "He said he realized that all great movie stars, such as 'Spencer Tracy' (qv), had had recognizable voices, so he has stylized his to be distinctive.", "Great-grandson of 'Francesco Pennino' (qv).", "Owns a home in New Orleans.", "Devoted 'Elvis Presley' (qv) fan that he is, in _Wild at Heart (1990)_ (qv) he performed the Elvis classic \"Love Me\" with uncanny aplomb.", "Former son-in-law of 'Elvis Presley' (qv) and 'Priscilla Presley' (qv).", "2007: Bought Midford Castle (though not an actual castle) near Bath, England for an estimated price £5 million (about $10 million).", "In 2006, he donated $2 million to Amnesty International for a fund to help child soldiers.", "Owns homes in Los Angeles, San Francisco, Las Vegas, New Orleans, New York City and in one in Middletown, Rhode Island, which he purchased in 2007.", "Owns the rights of the original _The Courtship of Eddie's Father (1963)_ (qv) movie, which he bought from 'Ted Turner' (qv), with the intention of turning it into a movie.", "While making an appearance on _Late Show with David Letterman (1993)_ (qv) for the film _Knowing (2009)_ (qv), he mentioned that he is fascinated with hang-gliding.", "Is an alumnus of the children's theatre group MET2 along with 'Adam Lambert' (qv), 'Sofia Coppola' (qv), Matt McFarland, 'Kylie Tyndall' (qv), 'Keaton Tyndall' (qv), 'Vivian Bayubay' (qv), 'Nathan Norton' (qv), 'Derek Klena' (qv), 'Lauren Klena' (qv), & 'Roma Watkins' (qv).", "The historic LaLurie House on the corner of Royal and Gov. Nicholls St. in New Orleans, which Cage bought for $3,450,000 in 2007, is reputed to be haunted by the many slaves tortured and killed by Delphine LaLurie in the 1830s.", "When Cage was arrested in New Orleans and charged with alleged domestic violence against his wife, Alice, and disturbing the peace. The $11,000 needed to bail him out was posted by 'Duane 'Dog' Chapman' (qv), better known as \"Dog the Bounty Hunter\". [April 2011]", "Ex-girlfriend 'Christina Fulton' (qv) hit Cage with a $13 million lawsuit in 2009, regarding a property transfer. They negotiated a settlement in June 2011.", "Despite playing her father in _Peggy Sue Got Married (1986)_ (qv), Cage is 1 year younger than 'Helen Hunt' (qv).", "He named his five favorite films as _East of Eden (1955)_ (qv), _A Streetcar Named Desire (1951)_ (qv), _2001: A Space Odyssey (1968)_ (qv), _A Clockwork Orange (1971)_ (qv) and _The Wizard of Oz (1939)_ (qv).", "Was originally cast as \"Randy 'The Ram' Robinson\" in _The Wrestler (2008)_ (qv). However, Cage dropped out of the film because he felt he didn't have time to bulk up for the part and director 'Darren Aronofsky' (qv)'s heart was set on 'Mickey Rourke' (qv). Mickey would go on to win a Golden Globe and be nominated for an Oscar for his performance.", "March 2009 - Sold Schloss Neidstein, a castle in the Bavarian village of Etzelwang.", "On Reddit, he has an entire community devoted to him called \"One True God.\".", "Stated that the reason he owned so many pieces of property in the past--including multiple castles, mansions, and an island--was to protect his money without buying stock or relying on a bank, believing that real estate was the most trustworthy way to accomplish this. However, after the real estate bubble collapsed, he sold most of his property at a loss and rescinded on his belief. He now owns a modest amount of property: a house in Las Vegas near his friends and a small cottage near Glastonbury, England.", "Became a father for the 1st time at age 26 when his girlfriend 'Christina Fulton' (qv) gave birth to their son 'Weston Cage Coppola' (qv) on December 26, 1990.", "He's selling the sprawling Gray Craig estate in Middletown, Rhode Island. [October 2008]", "Filming _Ghost Rider: Spirit of Vengeance (2011)_ (qv) in Turkey. [January 2011]", "Bought the sprawling Gray Craig estate in Middletown for $15.7 million, a purchase price that ranks among the highest ever for a home in Rhode Island. [August 2007]", "Anchorage, AK, USA: acting in _The Frozen Ground (2013)_ (qv). [November 2011]", "Became a grandfather for the 1st time at age 50 when his son 'Weston Cage Coppola' (qv) welcomed a son, Lucian Augustus Coppola Cage on July 1, 2014.", "Once woke up in his house at Orange County in the middle of the night to find a naked man eating a fudgesicle in front of his bed. The man was arrested by police but Cage pressed no charges.", "Was to have starred in 'Superman Lives' to be directed by 'Tim Burton' (qv) but Warners canceled it.", "His birthday is one day before 'Elvis Presley' (qv)'s, of whom he is a fan.", "In 'American Horror Story', Season 3, Episode 1, whilst taking a tour of The LaLaurie Mansion on Royal Street in New Orleans, 'Madison Montgomery' (Emma Roberts), asks \"Wasn't this house owned by the guy in 'Face/Off'? The tour guide replies, \"Correct! The actor 'Nicolas Cage' (qv), was a previous owner\". Cage did in-fact purchase the house in 2007. The house is considered by many, to be the most Haunted House in America.", "Is fond of the vibrant, multicultural city of New Orleans and frequently makes films there.", "Mentioned in an interview that he's a massive fan of 'Quentin Tarantino' (qv) and expresses great interest in working with him in the future.", "'Nicolas Cage' (qv) separated from wife of 12 years, Alice Kim, on 26th June, 2016. They share 10 year-old son, Kal-El.", "'Nicolas Cage' (qv) and wife, Alice Kim, secretly separated in early January, 2016, after 11 years of marriage. They would have celebrated their 12th wedding anniversary, in August, 2016.", "Frequently stars in films set in Las Vegas (\"Honeymoon In Vegas\", \"Con Air\", \"Next\", \"The Trust\", \"Leaving Las Vegas\").", "Reserved a permanent tomb for himself in Saint Louis Cemetery, New Orleans, Louisiana.", "One of the reasons he divorced 'Lisa Marie Presley' (qv) was because her first husband 'Danny Keough' (qv) lived in a guest house on their property and Cage found that highly inappropriate.", "Filed for an annulment in Las Vegas from 'Erika Koike' (qv) just four days after they married in Las Vegas, claiming that they were \"drinking to the point of intoxication\" to understand what they were doing. The Blast reports that Koike agrees the marriage was a mistake as well, and will not contest the annulment or a divorce. Cage also claims fraud because Koike didn't disclose to him the extent of another relationship she was in, and an on-going criminal matter.", "He turned in a world-wide Internet meme after a still frame from his movie _Vampire's Kiss (1988)_ (qv), where Cage's character Peter Loew is telling his secretary Alva Restrepo ('Maria Conchita Alonso' (qv)) that she is the lowest employee on the totem pole."], "quotes": ["To be a good actor you have to be something like a criminal, to be willing to break the rules to strive for something new.", "There's a fine line between the Method actor and the schizophrenic.", "I am not a demon. I am a lizard, a shark, a heat-seeking panther. I want to be 'Bob Denver' (qv) on acid playing the accordion.", "[about his marriage to 'Lisa Marie Presley' (qv)] I'm sad about this, but we shouldn't have been married in the first place.", "Hollywood didn't know if I was an actor or a nut or if I was this crazy character I was playing. I had developed an image of being a little bit unusual, different and wild.", "I'm at the point now where I know I'm doing something right when a movie gets mixed reviews, because then I'm not in the box. I don't want to make it too easy for people and I don't want to make it too easy for myself. I want to try something unusual. I feel good about the bad reviews because I feel like I've affected them on some level. They may not know what I was trying to do but they felt something.", "I want to make all kinds of movies. I do want to make big movies that are a lot of fun to go to, but I also want to make movies that are going to stimulate some thought and maybe raise some awareness. And so please don't think you're gonna go on a roller-coaster ride with those movies.", "It's very risky for an actor who's a bankable star to make pictures like _The Weather Man (2005)_ (qv) or _Lord of War (2005)_ (qv) because they inevitably promote them like big studio releases. And they're not big studio movies, they're more edgy, thought-provoking, independent-spirited films. What happens is, it goes into the computer, and everyone says they can't open the movie because they thought it was X when it actually was Y.", "I needed to change my name just to liberate myself and find out I could do it without walking into a Hollywood casting office with the name Coppola.", "['Pablo Picasso' (qv)] said art is a lie that tells the truth. What if you just want to tell the truth and not lie about it?", "It's good to make movies that are tragedies, where people can think about things in life that are undeniable, that everyone has to deal with. But at the same time, it's also healing to make movies that are entertaining, that are a lot of fun, where you don't have to think about your problems.", "When I did _Vampire's Kiss (1988)_ (qv), I got so wound up. It was so important to me that this vision I had of Peter Lowe's character get on film exactly the way that I wanted it, that I frankly don't think I was very easy for anyone to live with. Certainly, I was not easy for myself to live with. I remember that I wasn't drinking or anything at the time. One night I felt so wound up that I was about to snap. I ordered a martini. And I just relaxed, and I could tell my body really needed a rest. From then on, I learned you can do good work without torturing yourself.", "What happens is, you become different people in your path as an actor. When I was doing those things, I was a very new actor. I didn't have a lot of training, and I was trying to make some sort of impact, because that was what was important for me at the time - to get on the map. There were things I would do that were more shocking, or approaches I would do to try and live the character, because I didn't have the training. But then, as I went on, I started to find other methods, ways to get into characters that weren't exactly destroying my life. (On the wild eccentrics he used to get into character earlier in his career)", "I remember when I met 'Johnny Depp' (qv), he was a guitar player from Florida, and he had no idea he could be an actor. I said, \"I really think you are an actor, that you have that ability.\" That was just from playing one game of Monopoly with him. I sent him to my agent and he has gone on to carve out a successful career.", "There is a method of thought that says it's better to stay mysterious, make yourself an event so when you come out, people have a hunger to see you again. I can think of some superstars who adopt that principle, where they are very selective. But we are all going to get older, and there is something to be said about doing some of your best work when you are younger, when you still have that virility, something visceral and raw. I've heard there have been some actors who've regretted not doing more work when they were under fifty. (On why he works so much)", "[on making his character in _Knowing (2009)_ (qv) a single father] I have seen a lot of movies with single mothers and their children. They're good, but there are not so many with capable single fathers. There seems to be this archetype that if you're a man and single, you're incapable of raising a child, which I think needs to be broken. If you find yourself in that position - like I have - it's important not to give up because of what people tell you.", "[on _Face/Off (1997)_ (qv)] Without tooting my own horn - I think it's a masterpiece.", "I was being stalked by a mime - silent but maybe deadly. Somehow, this mime would appear on the set of set of _Bringing Out the Dead (1999)_ (qv) and start doing strange things. I have no idea how it got past security. Finally, the producers took some action and I haven't seen the mime since. But it was definitely unsettling.", "(The hardest part was) trying to figure out how I was going to entertain you while playing a guy who was completely out of his mind on crack. At the same time, trying to be responsible so it didn't become an advertisement for doing drugs. The other thing is, I wasn't sure I could play the part totally sober, which I was. In _Leaving Las Vegas (1995)_ (qv), I had a few drinks between scenes to get to a certain feeling, to get to a certain truth. But with this I was trying to look at it more impressionistically from a landscape of maybe 25 years ago to see what would come out of that filter of my imagination. -- on the toughest aspect of preparing for _Bad Lieutenant: Port of Call New Orleans (2009)_ (qv)", "So many directors are so arrogant. For example, 'Klaus Kinski' (qv) -- who 'Werner Herzog' (qv) has a legacy with -- he was very frustrated with the arrogance. We always hear Werner's side of the story about \"Klaus was this and Klaus was that\" but you never get to here Klaus' side of the story. I was doing a scene (on \"Bad Lieutenant\") -- it was in my second day of shooting -- and we all know the imagination and preparation (required) to think I was on cocaine (for the character). There was a little bottle of baby powder, and I'm snorting that. I'm psyching up, I'm psyching up, and he comes up and says (in German accent), \"Now Nicolas, what is in that vial?\" And I was like, \"Are you kidding me? After four hours of this you're gonna actually ask me that? Take me out of my preparation? You would think the director would understand the actor's process and give us the space and the room to do what it is we need to do.", "I don't want to minimize the effort that goes into having a career, but now with the video age, let's face it, you can write your own stories and you can make your own movies and get it out. Or go on stage somewhere in a small venue off-off-off-Broadway.", "Usually it's very cathartic. The hard stuff is when you're not feeling great and you have to do a really happy scene. -- on the personal toll acting can take on a person.", "'James Dean' (qv) in _East of Eden (1955)_ (qv), the scene where he's trying to give 'Raymond Massey' (qv) the money on his father's birthday. I was 14, I was at the New Beverly Cinema, and I said, \"Oh, no, that is exactly how I feel. Oh my God, I have to do this. Nothing else ever affected me as strongly. -- on if there were any moments in his life when he realized he was going to be an actor.", "{on the recession] People are losing their jobs because of what's going on in the economy, but I want to make movies that give families something to look forward to.", "(1996 quote) 'Jim Carrey' (qv) and I went to 'George Hamilton' (qv)'s wine bar. He's an interesting one. He was there and had some fun stories. I told him how he was one of my heroes from the time he played 'Evel Knievel' (qv). We had cigars, and very expensive bottles of wine were opened, and Jim and I were going, \"This is great, man.\" At the end of the night we got slapped with an $8,000 bill. It was at that point that George became the fox in the Pinocchio story. He happens to look quite a bit like that fox. I would not want to play cards with 'George Hamilton' (qv).", "(1996) I remember my prom was a complete disaster. I used bonds my grandmother had given me to rent a tuxedo and a limousine so I could go to the prom with this beautiful girl. And at the end of the night I went to kiss her and she responded. I was so nervous that my stomach got really nauseous and I said, \"Excuse me\" and just threw up on the street all over my shoes and my rented tux. The limo driver wouldn't let me in the car. He split and I had to walk home. That was my prom night.", "(1996, on if he wants to do theater work) No, I have stage fright. I don't like it. I've never gotten over it.", "(1996) I do not have a religion in my life, I wasn't raised that way. My father always believed that if I was going to have a religion I should discover it on my own and not have it crammed down my throat at a young age. I kind of wish I had some religion.", "(1996) If I thought about awards, I would not have been able to do a movie like Leaving Las Vegas, because the word around town was that Mike [Figgis] and I were making the most unreleasable movie in Hollywood. I had some fear that the movie would not get released.", "(1996, on his life) I know what I want to do, I'm doing it, but I'm still very much a student of the craft and I think I can go further. I still torment myself. I have a lot of self-doubt.", "(1998 quote) I was once surrounded by rattlesnakes in a rattlesnake patch with my cousin Roman when we were 16 or 17. We were fishing in Napa Valley and walked right into it. There was a huge one coiled in front of us. A bigger one, to the left, was uncoiled, so I knew he wasn't a problem. We had to go over the coiled one, so we felt trapped and paralyzed with fear. There was nowhere to run, we were surrounded. I saw this pole with a nail through it, and I knew that I had to do something, so I grabbed the pole and pounded the snake. Then it came up and started rattling and was about to strike. I killed it, but felt bad about it. I felt anything you kill you've got to eat, so I took it home, cut the poison glands out, took the rattles off and cooked it.", "(1998, on the scariest thing that has happened to him) Years ago I was driving a car I'd bought, an Austin Healey with a V-8 engine, sort of a makeshift Cobra. I had taken it to a mechanic to put an automatic shifter in it. The mechanic did a really sloppy job. If you barely knocked the shifter it would go into separate gears. I was driving on the Hollywood Freeway and I accidentally bumped it into park. I was doing 80 mph at 10 p.m. and I started doing 360s. I wound up facing traffic, and then a Mack truck was coming at me. I thought, 'This is it, I'm dead'. The truck driver had a CB radio and said, \"Put the car in reverse.\" I did and drove backwards until I got off at the exit, backwards!", "(1998 quote) What I like so much about Warhol-and he's actually influenced my acting, especially with _Wild at Heart (1990)_ (qv)-is that he takes these icons and makes them his own, which is a brave thing to do. With acting it's not something you're supposed to do-you're never supposed to mimic or copy another person. For _Wild at Heart (1990)_ (qv) I thought, 'Let's be Elvis'. I've always called that my Warhol performance, because I tried to subvert the image.", "(1998, Movieline Magazine) I did not want to be in _Peggy Sue Got Married (1986)_ (qv). I turned it down three times. Francis said, \"I really need you to be in the movie.\" I read the script, which was a perfectly romantic film, but the character he wanted me to play was boring. He was the babe to 'Kathleen Turner' (qv)'s starring role. Just like women don't want to play the babe in movies, I didn't want to be 'Kathleen Turner' (qv)'s babe. I just wanted to play a character. So I thought, How can I make this guy really far out? I asked Francis about it on the phone and he said, Absolutely. I said, \"I want to go really far out.\" He asked, \"How far do you want to go?\" I said, \"I want to talk like Pokey\" Because to me it was funny. And also, it was the way a lot of guys in high school sounded before their voices changed-they always had this high-sounding voice that would crack. When I see the movie now I'm really happy that I did that. I really am.", "(1998, Movieline Magazine) I see 'Miles Davis' (qv) as a surrealist father of mine. He was the first person to believe in me as an actor, the one who first said he understood what I was talking about. It was on _The Dick Cavett Show (1968)_ (qv). Before we went on he said to me, \"Why aren't you wearing your leather jacket? Didn't you learn anything from 'Dennis Hopper' (qv)?\" Because I was wearing a suit. Then I went out and started talking about how if Picasso could paint surreal, why couldn't actors try to achieve that as well? Then Miles came on, and he was very considerate and he said, \"I hear what you're saying.\" He kept looking at me like we had our own connection. Ever since then he stayed in my thoughts. He said the words I needed to hear to keep going with my choices. It's weird because my surrealist name, Cage, is actually taken from a black character, Luke Cage.", "The first time that I played _Ghost Rider (2007)_ (qv). Blaze was easy; I knew he was a man who had been living with a curse for 8 years of having his head light on fire, and the tone that would take. I compared him to a cop, or a paramedic who develops a dark sense of humour to cope with the horrors he has seen. But Blaze has also caused the horrors, so he's hiding out because he doesn't want to hurt anyone else. Ghost Rider was an entirely new experience, and he got me thinking.", "I think that _Ghost Rider: Spirit of Vengeance (2011)_ (qv) was mentally taxing, if only because I had to go to a Christmas party shortly after I had wrapped photography in Romania at 2 in the morning as the Ghost Rider. The invitation had a Christmas ornament on it with Ghost Rider's face on it as a tree. I had a couple of schnapps and went to the party; I had not entirely let go of whatever magic I had been channelling, and all hell broke lose. In fact, I think I kept saying over and over: \"Merry Christmas, you assholes!\" I am lucky I'm not in a Romanian prison.", "Superman is an American myth. Like the English have Shakespeare.", "I would like to see a sequel to _Lord of War (2005)_ (qv). I think it would work really well, especially in this day and age where guns are at the center of political discussion. And also the boy in the movie, my son, there's this idea that he grows up and he goes into the trade and then I'm trying to get him out of it. I think that could be a very interesting movie.", "I hate violence. I just hate it. I read the paper every day - the New York Times, The Guardian - and I feel it, you know? It gets inside. I'm amazed that people are capable of those kinds of things to children and women.", "I'm up for anything that will get me to the truth of a performance.", "There's very few things that make me laugh. 'Mike Myers' (qv) as Austin Powers makes me laugh - that was genius - and Daffy Duck makes me laugh, but I like odd behavior. I don't like hip dialogue and one-liners and all that sort of cool, sophomoric comedy. It's just not for me.", "I'm one of those guys where the more coffee I drink, the more stunts I do, the more relaxed I get.", "[on having a stalker] That was horrible. I mean, that's as bad as it gets: 2am and there's a naked man standing in front of your bed watching you sleep. It's not funny, but somehow people find it amusing.", "Halloween is a great holiday for any actor if you think about it. It's all about dress-up and playing characters. So yeah, it's always had a special place for me.", "[on the most haunted place he's ever been to] There's a house I used to live in called The LaLaurie Mansion on Royal Street in New Orleans, and it's notorious as the most haunted house in the United States. I spent time in there alone in total darkness to get some inspiration to write the great American horror novel, but I didn't get far. I'm not gonna go into detail.", "Film acting is one of the only industries where you're criticized for working hard. In any other industry it's considered a quality and something to behold.", "I haven't isolated myself. I am not living on a yacht somewhere. I am not tucked away or behind a gate somewhere. I am not flying on a private plane. I am going to the airport, I am with people, some of the interactions are good, some of them are not so good, but it keeps me in touch with being, you know, part of society. And I think that's necessary to stay relevant to be able to tell stories about people, which is what actors do.", "Sometimes your very own family that you're close to can be toxic. They take your success or your potential as a personal insult on their failure, and they beat you up or they say you'll never make it.", "Now even the art of film criticism... now in the LA Times, the critic who reviewed _Bad Lieutenant: Port of Call New Orleans (2009)_ (qv), incorporated how many homes I bought or sold into the review. What the hell does 'Lindsay Lohan' (qv)'s personal life have to do with her performance in _The Canyons (2013)_ (qv)? It should always be about the work itself. What difference does it make if 'Bill Clinton' (qv) had an affair -- how does that affect his performance as President?", "I started acting because I wanted to be 'James Dean' (qv). I saw him in _Rebel Without a Cause (1955)_ (qv), _East of Eden (1955)_ (qv). Nothing affected me -- no rock song, no classical music -- the way Dean affected in \"Eden.\" It blew my mind. I was like, \"That's what I want to do.\" This was before everyone had a thing called a Smartphone, and before the advent of the \"celebutard\" -- just being famous for famous' sake. I'm not complaining, but it really sucks to be famous right now.", "I am in the process of reinventing myself. I am returning to my roots, which is independently spirited, dramatic characters. I had taken a year off to re-evaluate everything I had done, different kinds of performances I had done, the more operatic and more baroque stuff like _Ghost Rider: Spirit of Vengeance (2011)_ (qv), _Drive Angry (2011)_ (qv) or _Season of the Witch (2011)_ (qv). I wanted to find something where I could use my life experience, my memories and my emotions.\"", "I started acting because I wanted to be 'James Dean' (qv). I saw him in _Rebel Without a Cause (1955)_ (qv), _East of Eden (1955)_ (qv). Nothing affected me - no rock song, no classical music - the way Dean affected in Eden. It blew my mind. I was like, 'That's what I want to do.' This was before everyone had a thing called a Smartphone - just being famous for famous' sake. I'm not complaining, but it really sucks to be famous right now.", "I don't take criticism seriously and I don't take praise seriously, both would be a mistake. If you buy into the negative that is the Internet today, or the cynical critic, it's not unlike listening to an abusive father that's trying to cave you in and you can't function. If you buy into praise, to people who adore you, you might get lazy and say, 'Well, I'll just keep doing that.' You have to stay uncomfortable. I learned that from 'David Bowie' (qv). I said, 'How do you do it? How do you keep reinventing yourself?' He said, 'I just never got comfortable with anything I was doing.' I knew those were words of wisdom from a great artist and I took those words seriously.", "I'd love to make a movie with 'Jack Nicholson' (qv). I don't know why it hasn't happened yet! But I think the two of us together, would [laughs] ... I'm sure it would be something to talk about! I feel very comfortable with him and I think we would do something special together.", "[on being sought by 'Cher' (qv) to join the cast of _Moonstruck (1987)_ (qv)] I don't really know why she wanted me in the movie. She kept fighting for me. She saw me in _Peggy Sue Got Married (1986)_ (qv) and said it was like watching a two-hour train wreck. It was pretty intimidating to be her leading man.", "[on developing performance style] I [wanted]to get more 'quietude' - what Hemingway would call the taut fishing line. I wanted to have that simplicity again. _Joe (2013)_ (qv) gave me the opportunity to explore that.. I see myself as a student. I'll hopefully do more seasoned kinds of performance as I get older.", "[advice to aspiring screen actors] If you're doing something really extraordinary, chances are you'll be an original. That might scare some people in the casting office. They might not know what to do with that. What I would suggest is to put a frame on it. Tape your audition. Put your performance in a frame so they can see it, and then go into the office. But I would send the tape. If you are genuinely talented, you are to be doing things that are special. So put a frame on it.", "When I did _Joe (2013)_ (qv) it was an opportunity for me to get what I call 'naked' as a film presence. It was time to not put things on top of a performance, but take things off - where I could take my life experience of the last years and find a script where I didn't have to act. Where I could just be, and not think too much about it. What was a great compliment was when my wife saw it with me in Venice and said, 'That's you'.", "I try to pick ans choose my material based on what I can do to challenge myself and make myself uncomfortable. Always stay a student, never be a maestro.", "There is a mischievous mind at work on _The Wicker Man (2006)_ (qv), you know? You know what I mean? And I finally kind of said, 'I might have known that the movie was meant to be absurd.' But saying that now after the fact is OK, but to say it before the fact is not, because you have to let the movie have its own life.", "(On The Coen Brothers) \"Joel and Ethan have a very strong vision and I've learned how difficult it is to accept another artist's vision. They have an autocratic nature.\"", "(On eating a live cockroach for _Vampire's Kiss (1988)_ (qv)) \"Every muscle in my body didn't want to do it, but I did it anyway.\"", "I would like to hook up with one of the great Japanese filmmakers, like the master that made _Ringu (1998)_ (qv), and I would like to take _The Wicker Man (2006)_ (qv) to Japan, except this time he's a ghost.", "(On _The Wicker Man (2006)_ (qv)) \"'I might have known that that movie was meant to be absurd.\"", "[on 'Kathleen Turner' (qv)] I think we were a little bit in love with each other, to be entirely honest.", "What originally attracted me to _Bringing Out the Dead (1999)_ (qv) was the opportunity to work with 'Martin Scorsese' (qv)."], "salary history": ["_Valley Girl (1983)_ (qv)::$5,000", "_Vampire's Kiss (1988)_ (qv)::$40,000", "_Leaving Las Vegas (1995)_ (qv)::$240,000", "_The Rock (1996)_ (qv)::$4,000,000", "_Face/Off (1997)_ (qv)::$6,000,000", "_Snake Eyes (1998)_ (qv)::$16,000,000", "_Bringing Out the Dead (1999)_ (qv)::$10,000,000", "_Gone in Sixty Seconds (2000)_ (qv)::$20,000,000", "_Captain Corelli's Mandolin (2001)_ (qv)::$7,000,000", "_Windtalkers (2002)_ (qv)::$20,000,000", "_Adaptation. (2002)_ (qv)::$2,000,000", "_National Treasure (2004)_ (qv)::$20,000,000", "_The Bad Lieutenant: Port of Call - New Orleans (2009)_ (qv)::$2,000,000", "_The Sorcerer's Apprentice (2010)_ (qv)::$12,000,000", "_Drive Angry (2011)_ (qv)::$6,000,000", "_Seeking Justice (2011)_ (qv)::$12,000,000", "_Trespass (2011)_ (qv)::$7,000,000", "_Ghost Rider: Spirit of Vengeance (2011)_ (qv)::$7,500,000", "_The Croods (2013)_ (qv)::$1,000,000"], "birth date": "1964-01-07", "birth notes": "Long Beach, California, USA", "_actorID": "26", "_source": "IMDB", "actorID": "0000115", "created_utc_dt": "09/14/2019, 13:01:36"}