{"headshot": "https://m.media-amazon.com/images/M/MV5BMTI5ODY0NTAwOF5BMl5BanBnXkFtZTcwOTI3NjQxMw@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["The Tool Man"], "birth name": "Timothy Alan Dick", "height": "5' 10½\" (1.79 m)", "mini biography": ["Timothy Allen Dick was born on June 13, 1953, in Denver, Colorado, to Martha Katherine (Fox) and Gerald M. Dick. His father, a real estate salesman, was killed in a collision with a drunk driver while driving his family home from a University of Colorado football game, when Tim was eleven years old. His mother, a community service worker, remarried her high school sweetheart, an Episcopalian deacon, two years after Tim's father's death. He was raised with his many siblings and step-siblings. When Tim was young, his family moved to Birmingham, Michigan.In high school, his favorite subject was shop, of course, and after high school, he attended Western Michigan University and graduated with a degree in Television Production in 1975. In 1978, he was arrested on drug charges and spent two years in jail. Upon his release, he had a new outlook on life and on a dare from a friend, started his comedy career at the Comedy Castle in Detroit. Later, he went on to do several cable specials, including, _Comedy's Dirtiest Dozen (1988)_ (qv) and 'Tim Allen' (qv): Men Are Pigs (1990). In 1991, he became the star of his own hit television series on ABC called _Home Improvement (1991)_ (qv). While continuing to film his television series throughout most of the 1990s, he starred in a string of blockbuster movies, including _The Santa Clause (1994)_ (qv), _Toy Story (1995)_ (qv), _Toy Story 2 (1999)_ (qv) and _Galaxy Quest (1999)_ (qv). In August 1996, he developed and unveiled his own signature line of power tools, manufactured by Ryobi. On top of all that, he has his own racing team, 'Tim Allen' (qv)/Saleen RRRRacing. In May 1999, he ended his series _Home Improvement (1991)_ (qv) after eight seasons and in 2001, he filmed such movies as _Big Trouble (2002)_ (qv) and _Joe Somebody (2001)_ (qv).::TrendEkiD@aol.com"], "spouse": ["'Jane Hajduk' (qv)::(7 October 2006 - present) ( 1 child)", "'Laura Diebel' (qv)::(7 April 1984 - 1 March 2003) ( divorced) ( 1 child)"], "trade mark": ["Radio disc jockey voice", "Neanderthal-type grunts when happy or excited", "Usually plays somewhat incompetent or snarky characters", "Often plays fathers or family men", "His catchphrase: \"It's Tool Time!\""], "trivia": ["On May 24, 1997, he was arrested in Bloomfield Hills, Michigan, for drunk driving.", "Spent 28 months in jail after being arrested for attempted drug-dealing (1978).", "Has nine brothers and sisters.", "Paid $2 million for 26 acres of Michigan campground with the intention of keeping it in its natural, undeveloped state.", "Received his Bachelor of Science degree in Communications from Western Michigan University in Kalamazoo, Michigan (1976).", "His ex-wife, 'Laura Diebel' (qv), is the CEO for 'Tim Allen' (qv) Signature Tools.", "Has one daughter with ex-wife 'Laura Diebel' (qv): Katherine 'Kady' Allen.", "Was a stand-up comic at 'Mark Ridley' (qv)'s \"Comedy Castle\" in Detroit, Michigan, featuring the talents of 'Kevin Pollak' (qv) and 'D.B. Dickerson' (qv).", "During the run of _Home Improvement (1991)_ (qv), he was often sent shirts and sweaters by various colleges to wear on the air, and he did.", "Tim Taylor, Allen's character on _Home Improvement (1991)_ (qv), was ranked #20 in TV Guide's list of the \"50 Greatest TV Dads of All Time\" [June 20, 2004 issue].", "His character in _Big Trouble (2002)_ (qv) is a composite of humor columnist 'Dave Barry' (qv). The movie is adapted from one of 'Dave Barry' (qv)'s humor books.", "Began his career as a stand-up comedian. His comedy career began on a dare from a friend at the \"Comedy Castle\" in Detroit, Michigan.", "Was a member of Toastmasters.", "Stand up routine consisted of jokes comparing the differences between men and women. This theme continued on his television series _Home Improvement (1991)_ (qv).", "Attended and graduated from Seaholm High School in Birmingham, Michigan (1971).", "In 2006, he co-starred in three Disney movies with actor 'Spencer Breslin' (qv): _The Shaggy Dog (2006)_ (qv), _Zoom (2006)_ (qv) and _The Santa Clause 3: The Escape Clause (2006)_ (qv). He also was in _The Santa Clause 2 (2002)_ (qv) with Breslin.", "Tim and his wife, 'Jane Hajduk' (qv), became the parents of their first child, a daughter Elizabeth Allen on March 28, 2009 in Los Angeles, California.", "Publicist is 'Marleah Leslie' (qv).", "For one week in November 1994, he had the #1 rated television series (_Home Improvement (1991)_ (qv), the #1 movie at the box office (_The Santa Clause (1994)_ (qv)), and the #1 book on the best seller's list (\"Don't Stand Too Close to a Naked Man\").", "He was awarded the 2000 Saturn Award for Best Actor as Jason Nesmith (Commander Peter Quincy Taggart) in the sci-fi parody _Galaxy Quest (1999)_ (qv).", "Became the celebrity spokesperson for Pure Michigan (2013).", "Being thanked at the prestigious Conservatory Theatre Ensemble for his inspirational work [October 2006]", "Has English, German, Irish, Scots-Irish/Northern Irish, Scottish, and distant Welsh, ancestry.", "He was awarded a Star on the Hollywood Walk of Fame at 6834 Hollywood Boulevard in Hollywood, California on November 19, 2004.", "Shares his birth last name, \"Dick\", with the leader of the rock group 'Paul Revere & The Raiders' (qv), who was born 'Paul Revere' (qv) Dick.", "Shares a hometown (Denver, Colorado) with his _Last Man Standing (2011)_ (qv) character, Mike Baxter, and the sitcom, which is set in Denver, though it is shot at CBS Studio Center, 4024 Radford Avenue, Studio City, Los Angeles, California.", "His character on _Last Man Standing (2011)_ (qv) is an avid amateur radio operator. In September 2014, took and passed the Technician Class exam to become a real ham radio operator. His FCC issued license call sign is KK6OTD issued under his real name, Tim Dick.", "Is an avid science fiction fan. His favorite movies in the genre are _The Day the Earth Stood Still (1951)_ (qv), _20,000 Leagues Under the Sea (1954)_ (qv), _Forbidden Planet (1956)_ (qv), _Alien (1979)_ (qv), _Predator (1987)_ (qv) and _Terminator 2: Judgment Day (1991)_ (qv). His favorite science fiction books are \"The Stars My Destination\" (1957) by 'Alfred Bester' (qv), \"Dune\" (1965) by 'Frank Herbert' (qv), and \"Ringworld\" (1970) by Larry Niven.", "He turned down the role of Dave Seville in _Alvin and the Chipmunks (2007)_ (qv), which went to 'Jason Lee' (qv).", "Announced his support for Republican candidate 'John Kasich' (qv), and later 'Donald Trump' (qv), for the 2016 election.", "Is a Republican. Attended 'Donald Trump' (qv)'s 2017 Presidential inauguration.", "Friends with 'Steve Harvey' (qv).", "Owns production company Boxing Cat Films."], "quotes": ["Men are pigs. Too bad we own everything.", "Women now have choices. They can be married, not married, have a job, not have a job, be married with children, unmarried with children. Men have the same choice we've always had: work, or prison.", "[November 2016] What I find odd in Hollywood is that they didn't like Trump ['Donald Trump' (qv)] because he was a bully. But if you had any kind of inkling that you were for Trump, you got bullied for doing that. And it gets a little bit hypocritical to me.", "Women are like cars: we all want a Ferrari, sometimes want a pickup truck, and end up with a station wagon.", "My wife loves cars, but the difference is she doesn't have 20 years of understanding the background of them. She basically drives them and uses her gut feelings as to which is best.", "I have to get a license to drive a motorcycle to protect myself and the people around me. I am adamant there should be some sort of licensing required to have children.", "The world's a mean place. It's unfair, then it's fair. It's hateful, then it's loving. It's a very peculiar place on philosophical and metaphysical and religious levels.", "Men are liars. We'll lie about lying if we have to. I'm an algebra liar. I figure two good lies make a positive.", "My mom said the only reason men are alive is for lawn care and vehicle maintenance.", "Electricity can be dangerous. My nephew tried to stick a penny into a plug. Whoever said a penny doesn't go far didn't see him shoot across that floor. I told him he was grounded.", "In the last three years of racing, I've met as many women fans as men fans, and in NASCAR it's the same thing.", "I'm a creative guy, artistically with graphics. I have a thing for tools.", "Dad needs to show an incredible amount of respect and humor and friendship toward his mate so the kids understand their parents are sexy, they're fun, they do things together, they're best friends. Kids learn by example. If I respect Mom, they're going to respect Mom.", "I like Pixie Sticks. Yeah, screw the middle man. Just a tube of sugar... I'd pour two of those in a big 12 ounce coke. And I'd go out to catechism class and try to concentrate on the priest. I saw Jesus several times. I swear I did.", "I think women like Ferraris. A Ferrari is everybody's car.", "In my experience, it's all wonderful with girls until about 16. Around that time, boys kind of calm down and start focusing their testosterone. Girls get a little challenging, especially for fathers.", "I don't understand why it has to be either - or - either socialism or democracy. Why can't we combine things to get the best of each system?", "You don't know what people are really like until they're under a lot of stress.", "I love doing logos. I've been a graphic artist all my life.", "I was gone so much in my first marriage. I love the moments when I engage with my youngest daughter now. It's not my thing to sit on the ground and play tea party, but I'll do it because it's a moment that will stick with me forever.", "Never comment on a woman's rear end. Never use the words 'large' or 'size' with 'rear end'. Never. Avoid the area altogether. Trust me.", "When somebody tells you they're not very smart, they're saying exactly the opposite.", "I have an only child. She's so independent and good with adults.", "While awaiting sentencing, I decided to give stand-up comedy a shot. The judge had suggested I get my act together, and I took him seriously.", "In marriage, compromise nurtures the relationship. Comedy is the ultimate anarchist.", "I have irrational fears, and they all go back to losing my father as a kid. I've never gotten over it.", "It's true; I have a skill and it's... it has not related to acting, it's not related to auditions, it's not related to studios, not related to public whim. It's whether I'm funny or not and whether I can entertain people.", "I always do ask - whoever put me here; The Builder - what did You want me to do? I just want a relationship with Whoever built me. This is too much; too weird that it happened by accident. I don't believe that I happened by accident.", "Nothing's as easy as it is on a sitcom. Issues that we take care of in 20 minutes on the show can stretch out over years in real families.", "The big advantage to playing the Venetian in Las Vegas - where it's a beautiful theater - is that unlike other places, even many other nice venues, I can do a set and lighting cues, I can put on a real show. I can dress up, wear a tux.", "For years, I just did not like this idea of God, church.", "[on having conservative views in Hollywood] You've gotta be real careful around here. You get beat up if don't believe what everybody believes. This is like 1930s in Germany. I don't know what happened. If you're not part of the group, you know what we believe is right, I go, \"Well, I might have a problem with that\"."], "salary history": ["_Home Improvement (1991)_ (qv)::$1,250,000 /episode (1998-1999 season)", "_Home Improvement (1991)_ (qv)::$200,000 /episode + executive consultant fees (1996)", "_Toy Story (1995)_ (qv)::$50,000", "_Toy Story 2 (1999)_ (qv)::$5,000,000", "_Galaxy Quest (1999)_ (qv)::$2,000,000", "_Joe Somebody (2001)_ (qv)::$12,000,000"], "birth date": "1953-06-13", "birth notes": "Denver, Colorado, USA", "_actorID": "73", "_source": "IMDB", "actorID": "0000741", "created_utc_dt": "09/14/2019, 13:02:20"}