{"headshot": "https://m.media-amazon.com/images/M/MV5BMTc0MDMyMzI2OF5BMl5BanBnXkFtZTcwMzM2OTk1MQ@@._V1_UX67_CR0,0,67,98_AL_.jpg", "height": "6' 2\" (1.88 m)", "mini biography": ["With an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born on June 1, 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended Los Angeles City College before serving several years in the US Air Force as a mechanic between 1955 and 1959. His first dramatic arts exposure was on the stage including appearing in an all-African American production of the exuberant musical Hello, Dolly!.Throughout the 1970s, he continued his work on stage, winning Drama Desk and Clarence Derwent 'Awards' (qv) and receiving a Tony Award nomination for his performance in The Mighty Gents in 1978. In 1980, he won two Obie 'Awards' (qv), for his portrayal of Shakespearean anti-hero Coriolanus at the New York Shakespeare Festival and for his work in Mother Courage and Her Children. Freeman won another Obie in 1984 for his performance as The Messenger in the acclaimed Brooklyn Academy of Music production of 'Lee Breuer' (qv)'s The Gospel at Colonus and, in 1985, won the Drama-Logue Award for the same role. In 1987, Freeman created the role of Hoke Coleburn in 'Alfred Uhry' (qv)'s Pulitzer Prize-winning play Driving Miss Daisy, which brought him his fourth Obie Award. In 1990, Freeman starred as Petruchio in the New York Shakespeare Festival's The Taming of the Shrew, opposite 'Tracey Ullman' (qv). Returning to the Broadway stage in 2008, Freeman starred with 'Frances McDormand' (qv) and 'Peter Gallagher' (qv) in 'Clifford Odets' (qv)' drama The Country Girl, directed by 'Mike Nichols' (qv).Freeman first appeared on TV screens as several characters including \"Easy Reader\", \"Mel Mounds\" and \"Count Dracula\" on the Children's Television Workshop (now Sesame Workshop) show _The Electric Company (1971)_ (qv). He then moved into feature film with another children's adventure, _Who Says I Can't Ride a Rainbow! (1971)_ (qv). Next, there was a small role in the thriller _Blade (1973)_ (qv); then he played Casca in _Julius Caesar (1979)_ (qv) and the title role in _Coriolanus (1979)_ (qv). Regular work was coming in for the talented Freeman and he appeared in the prison dramas _Attica (1980)_ (qv) and _Brubaker (1980)_ (qv), _Eyewitness (1981)_ (qv), and portrayed the final 24 hours of slain Malcolm X in _Death of a Prophet (1981)_ (qv). For most of the 1980s, Freeman continued to contribute decent enough performances in films that fluctuated in their quality. However, he really stood out, scoring an Oscar nomination as a merciless hoodlum in _Street Smart (1987)_ (qv) and, then, he dazzled audiences and pulled a second Oscar nomination in the film version of _Driving Miss Daisy (1989)_ (qv) opposite 'Jessica Tandy' (qv). The same year, Freeman teamed up with youthful 'Matthew Broderick' (qv) and fiery 'Denzel Washington' (qv) in the epic Civil War drama _Glory (1989)_ (qv) about freed slaves being recruited to form the first all-African American fighting brigade.His star continued to rise, and the 1990s kicked off strongly with roles in _The Bonfire of the Vanities (1990)_ (qv), _Robin Hood: Prince of Thieves (1991)_ (qv), and _The Power of One (1992)_ (qv). Freeman's next role was as gunman Ned Logan, wooed out of retirement by friend William Munny to avenge several prostitutes in the wild west town of Big Whiskey in 'Clint Eastwood' (qv)'s de-mythologized western _Unforgiven (1992)_ (qv). The film was a sh and scored an acting Oscar for 'Gene Hackman' (qv), a directing Oscar for Eastwood, and the Oscar for best picture. In 1993, Freeman made his directorial debut on _Bopha! (1993)_ (qv) and soon after formed his production company, Revelations Entertainment.More strong scripts came in, and Freeman was back behind bars depicting a knowledgeable inmate (and obtaining his third Oscar nomination), befriending falsely accused banker 'Tim Robbins' (qv) in _The Shawshank Redemption (1994)_ (qv). He was then back out hunting a religious serial killer in _Se7en (1995)_ (qv), starred alongside 'Keanu Reeves' (qv) in _Chain Reaction (1996)_ (qv), and was pursuing another serial murderer in _Kiss the Girls (1997)_ (qv).Further praise followed for his role in the slave tale of _Amistad (1997)_ (qv), he was a worried US President facing Armageddon from above in _Deep Impact (1998)_ (qv), appeared in 'Neil LaBute' (qv)'s black comedy _Nurse Betty (2000)_ (qv), and reprised his role as Alex Cross in _Along Came a Spider (2001)_ (qv). Now highly popular, he was much in demand with cinema audiences, and he co-starred in the terrorist drama _The Sum of All Fears (2002)_ (qv), was a military officer in the 'Stephen King' (qv)-inspired _Dreamcatcher (2003)_ (qv), gave divine guidance as God to 'Jim Carrey' (qv) in _Bruce Almighty (2003)_ (qv), and played a minor role in the comedy _The Big Bounce (2004)_ (qv).2005 was a huge year for Freeman. First, he he teamed up with good friend 'Clint Eastwood' (qv) to appear in the drama, _Million Dollar Baby (2004)_ (qv). Freeman's on-screen performance is simply world-class as ex-prize fighter Eddie \"Scrap Iron\" Dupris, who works in a run-down boxing gym alongside grizzled trainer Frankie Dunn, as the two work together to hone the skills of never-say-die female boxer 'Hilary Swank' (qv). Freeman received his fourth Oscar nomination and, finally, impressed the Academy's judges enough to win the Best Supporting Actor Oscar for his performance. He also narrated 'Steven Spielberg' (qv)'s _War of the Worlds (2005)_ (qv) and appeared in _Batman Begins (2005)_ (qv) as Lucius Fox, a valuable ally of 'Christian Bale' (qv)'s Bruce Wayne/Batman for director 'Christopher Nolan' (qv). Freeman would reprise his role in the two sequels of the record-breaking, genre-redefining trilogy.Roles in tentpoles and indies followed; highlights include his role as a crime boss in _Lucky Number Slevin (2006)_ (qv), a second go-round as God in _Evan Almighty (2007)_ (qv) with 'Steve Carell' (qv) taking over for 'Jim Carrey' (qv), and a supporting role in 'Ben Affleck' (qv)'s directorial debut, _Gone Baby Gone (2007)_ (qv). He co-starred with 'Jack Nicholson' (qv) in the breakout hit _The Bucket List (2007)_ (qv) in 2007, and followed that up with another box-office success, _Wanted (2008)_ (qv), then segued into the second Batman film, _The Dark Knight (2008)_ (qv).In 2009, he reunited with Eastwood to star in the director's true-life drama _Invictus (2009)_ (qv), on which Freeman also served as an executive producer. For his portrayal of 'Nelson Mandela' (qv) in the film, Freeman garnered Oscar, Golden Globe and Critics' Choice Award nominations, and won the National Board of Review Award for Best Actor.Recently, Freeman appeared in _RED (2010)_ (qv), a surprise box-office hit; he narrated the _Conan the Barbarian (2011)_ (qv) remake, starred in 'Rob Reiner' (qv)'s _The Magic of Belle Isle (2012)_ (qv); and capped the Batman trilogy with _The Dark Knight Rises (2012)_ (qv). Freeman has several films upcoming, including the thriller _Now You See Me (2013)_ (qv), under the direction of 'Louis Leterrier' (qv), and the science fiction actioner _Oblivion (2013)_ (qv), in which he stars with 'Tom Cruise' (qv).::firehouse44@hotmail.com"], "spouse": ["Myrna Colley-Lee::(16 June 1984 - 15 September 2010) ( divorced)", "Jeanette Adair Bradshaw::(22 October 1967 - 18 November 1979) ( divorced) ( 2 children)"], "trade mark": ["Frequently plays characters with calm demeanor", "[Narration] Often provides narration for his films, as either himself or the character he is playing.", "Often plays authorative leaders that seem highly trustworthy (even when they are not)", "Deep authoratitve voice", "Rich yet mellow voice"], "trivia": ["Ranked #31 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Village Voice Obie for _Coriolanus (1979)_ (qv) and \"Mother Courage\". [1980]", "Village Voice Obie for _Great Performances: The Gospel at Colonus (1985)_ (qv). [1986]", "Village Voice Obie for _Driving Miss Daisy (1989)_ (qv). [1990]", "Father of 'Alfonso Freeman' (qv) from his relationship with Loletha Adkins and Saifoulaye Freeman (born 1960) from another previous relationship.", "Father of 'Morgana Freeman' (qv) with Jeanette Adair Bradshaw. He also adopted his first wife's daughter, Deena.", "Received the \"Hollywood Outstanding Achievement in Acting\" Award on August 7, 2000.", "He was (along with director/actress 'Billie Allen' (qv), director/playwright 'Garland Thompson' (qv), and journalist Clayton Riley') a founding member of the 'Frank Silvera' (qv) Writers' Workshop, named after noted Black actor 'Frank Silvera' (qv).", "Has reprised the same character three times. He played Dr. Alex Cross in _Kiss the Girls (1997)_ (qv) and then reprised the role in _Along Came a Spider (2001)_ (qv). He also played God in _Bruce Almighty (2003)_ (qv) and then reprised that role in _Evan Almighty (2007)_ (qv). Finally, he played Lucius Fox in both _Batman Begins (2005)_ (qv) and _The Dark Knight (2008)_ (qv).", "Considered joining the Air Force to become a fighter pilot but opted to stay with acting instead.", "Worked as a mechanic in the United States Air Force.", "Has recorded a new radio public service announcement about the national parks.", "Recently earned a Private Pilot license.", "Broadway debut in the musical \"Hello, Dolly!\" with 'Pearl Bailey' (qv) and 'Cab Calloway' (qv).", "Has his own production company, Revelation Entertainment.", "Has starred in two movies based on 'Stephen King' (qv) books: _Dreamcatcher (2003)_ (qv) and _The Shawshank Redemption (1994)_ (qv).", "Has appeared in two films opposite a main character named Jack Ryan: _The Sum of All Fears (2002)_ (qv) and _The Big Bounce (2004)_ (qv).", "Owns a boat which is berthed in the Caribbean. His busy schedule, however, only allows him to go sailing on it once a year.", "During an interview with 'Charlie Rose' (qv) regarding the 10th year anniversary of _The Shawshank Redemption (1994)_ (qv), Freeman said he regarded that film, _Glory (1989)_ (qv), _Driving Miss Daisy (1989)_ (qv), and _Unforgiven (1992)_ (qv) as the highlights of his career.", "Is often called the greatest living actor in film, a title he humbly waves off and says he is just \"lucky\".", "Was nominated for Broadway's 1978 Tony Award as Best Actor (Feature Role - Play) for \"The Mighty Gents\".", "Said in an issue of Life magazine (February 2005) that he can be seen as an extra in _The Pawnbroker (1964)_ (qv).", "Arrived in Los Angeles, California in 1959 and his first job was as a clerk typist.", "Speaks French fluently. He gave an introductory speech in French to the crowd of extras gathered in Montreal's Olympic Stadium to portray the Baltimore Super Bowl audience in _The Sum of All Fears (2002)_ (qv).", "In May 2005, he won the right to the Internet domain name www.morganfreeman.com from the company Mighty LLC, of Charlestown, Saint Kitts and Nevis in a UN panel.", "Received a trademark on his name from the U.S. Patent and 'Trademark' (qv) Office on September 19, 2006.", "Most of the characters he has played are not written specifically for an African-American actor.", "Keeps his Oscar statuette inside a cabinet which resides in his office. The cabinet was built by a good friend of his in 1998 especially for the Oscar that his friend predicted he would win. It even came with a plaque that read: \"No Parking. Reserved for Oscar.\"", "Member of the jury at the Berlin International Film Festival in 1994.", "Has played three men who teach someone to box in three separate films. First, he played Geel Piet in _The Power of One (1992)_ (qv), he then played Alex Cross in _Kiss the Girls (1997)_ (qv) where, at the beginning of the film, he was teaching a group of young boys how to box, and he also played Eddie \"Scrap Iron\" Dupree in _Million Dollar Baby (2004)_ (qv).", "Is the only African-American actor to appear in three Best Picture Oscar Winners: _Driving Miss Daisy (1989)_ (qv), _Unforgiven (1992)_ (qv) and _Million Dollar Baby (2004)_ (qv).", "His performance as Fast Black in _Street Smart (1987)_ (qv) is ranked #77 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "In January 2001, opened Madidi, a fine-dining restaurant in Clarksdale, MS, with local attorney and businessman, Bill Lucket. They also co-own Ground Zero Blues Club, a blues bar and grill that opened in May 2001.", "Three films of his are on the American Film Institute's 100 Most Inspiring Movies of All Time. They are: _Driving Miss Daisy (1989)_ (qv) at #77, _Glory (1989)_ (qv) at #31 and _The Shawshank Redemption (1994)_ (qv) at #23.", "Narrated two Academy Award-winning feature-length documentaries: _The Long Way Home (1997)_ (qv) and _March of the Penguins (2005)_ (qv).", "Attended the 2004 and 2005 Dubai International Film Festival in the United Arab Emirates.", "Works closely with screenwriter 'Grant Boucher' (qv).", "Has said that watching 'Gary Cooper' (qv)'s films in his youth inspired him to become an actor.", "In addition to his role as Lucius Fox in the current Batman franchise, Freeman previously acted alongside another Batman: 'Michael Keaton' (qv) in _Clean and Sober (1988)_ (qv).", "Broke his arm and shoulder when he flipped his car near his home of Charleston, Mississippi on August 3, 2008.", "Though he was born in Memphis, he actually grew up in the Mississippi Delta region. He moved back to Mississippi to open a blues club and restaurant in 2001.", "Friends with 'Kenny Chesney' (qv).", "Resides in Charleston, Mississippi and New York City.", "Was honored with the American Film Institute's 39th Lifetime Achievement Award on June 9, 2011.", "Listed his five favorite films as _King Kong (1933)_ (qv), _High Noon (1952)_ (qv), _Moulin Rouge (1952)_ (qv), _The Outlaw Josey Wales (1976)_ (qv) and _Moby Dick (1956)_ (qv).", "Received the 2012 'Cecil B. DeMille' (qv) Award at the Golden Globe 'Awards' (qv) ceremony in January 2012.", "The longest he has gone without an Oscar nomination is 10 years, between _The Shawshank Redemption (1994)_ (qv) and _Million Dollar Baby (2004)_ (qv).", "Favorite films include the original films _King Kong (1933)_ (qv) and _Moulin Rouge (1952)_ (qv).", "He was awarded a Star on the Hollywood Walk of Fame at 7021 Hollywood Boulevard in Hollywood, California on March 18, 2003.", "Has purchased the film rights to Orange Crushed, a mystery novel by an African-American writer, Pamela Thomas-Graham. (Thomas-Graham is also the CEO of cable news channel CNBC.) Orange Crushed features an African-American heroine, Professor Nikki Chase. [June 2004]", "As of 2014, has appeared in four movies that were nominated for the Best Picture Oscar: _Driving Miss Daisy (1989)_ (qv), _Unforgiven (1992)_ (qv), _The Shawshank Redemption (1994)_ (qv) and _Million Dollar Baby (2004)_ (qv). With the exception of _The Shawshank Redemption (1994)_ (qv), all the other films won in the category. He gave Oscar nominated performances in all of these except Unforgiven, and won Best Supporting Actor for Million Dollar Baby.", "Recently became a beekeeper.", "His grandfather was Morgan Herbert Freeman. His father was Morgan Porterfield Freeman. He has said that his parents forgot to give him a middle name.", "Son 'Alfonso Freeman' (qv) (actor) was born in Los Angeles, September 13, 1959 to Morgan and Loletha Adkins (Polk). Alfonso first met his father in 1984.", "Has appeared in three Best Picture Academy Award winners: _Driving Miss Daisy (1989)_ (qv), _Unforgiven (1992)_ (qv) and _Million Dollar Baby (2004)_ (qv). 'Clint Eastwood' (qv) also appeared in and directed the latter two films.", "Accredits his voice to studying at the LACC Theater Academy. Other alumni include 'Clint Eastwood' (qv), 'Mark Hamill' (qv), 'Cindy Williams' (qv), 'Donna Reed' (qv) and 'Rene Michelle Aranda' (qv).", "20 years later, winner for Vintage Performance by an Actor in 1995, for his role as Detective Somerset in _Se7en (1995)_ (qv) at the first Vintage Film 'Awards' (qv).", "Is one of two African American actors in the top 5 highest grossing actors of all time, the other actor is 'Eddie Murphy' (qv).", "Ranked fourth highest grossing actor of all time with his previous films grossing $4.3 billion.", "Attended the premiere of _Jack Reacher: Never Go Back (2016)_ (qv) , in London.", "Narated the video introduction of Hillary Clinton at the 2016 Democratic National Convention.", "Youngest of five children.", "Rose to the rank of airman first class in the air force.", "Turned down a drama scholarship to join the air force in 1955.", "Owned a restaurant called Madidi but it closed down in 2012.", "Endorsed Barack Obama for the 2008 presidential election.", "Plays golf.", "His movie have grossed $10.24 billion worldwide.", "His net worth is $150 million.", "First American to record a par score on the 19th hole at the the Legend Golf and Safari Resort in the Entabeni Safari Conservatory, Limpopo South Africa.", "Friends with Rita Moreno.", "He has appeared in three films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _The Pawnbroker (1964)_ (qv), _Unforgiven (1992)_ (qv) and _The Shawshank Redemption (1994)_ (qv).", "The scrapped Disney project 'King of the Elves' had the protagonist modeled on him."], "quotes": ["I gravitate towards gravitas.", "[on his hesitation to do _Along Came a Spider (2001)_ (qv)] I had a philosophic aversion to it. I didn't want to do the same thing twice. Then I realized that my philosophical aversion was bullshit. I realized I liked Alex Cross. And the fact that he's black is totally incidental. That's a rare thing for a black actor to find.", "[on the failure of _The Big Bounce (2004)_ (qv)] It was a wonderful experience. 'Steve Bing' (qv) was the producer and was very generous. But the movie didn't turn out very well. The director ['George Armitage' (qv)] fell ill and we shut down production for a few weeks while he recuperated. And I think when he came back he just didn't pick up the ball and run with it the way he should have, and the movie suffered greatly for that..", "I've been living with myself all of my life, so I know all of me. So when I watch me, all I see is me. It's boring. - on why he dislikes watching his own films.", "I'm not intimidated by lead roles. I'm better in them. I don't feel pressure - I feel released at times like that. That's what I'm born to do.", "I was in Africa when I got the call for _Unforgiven (1992)_ (qv). Clint called my agency and made an offer for a western. I was like \"He called for me?\" It was jaw-dropping.", "[on the box-office failure of _The Shawshank Redemption (1994)_ (qv)] It took a long time for word of mouth to kick in because no one could say it. It was \"The Shimshunk Reduction\", \"The Hudsucker Redemption\"; I mean people just couldn't say it, which really made me angry because I knew that at the time! The movie we made was called \"Rita Hayworth and the Shawshank Redemption\". Isn't that a great title? But they were like \"That won't fit on the marquee\". So it took a year or two for people to say it. Some people still can't say it.", "[on the violence in _Se7en (1995)_ (qv)] If you don't show the actual violence and the audience provides their own violence, it's much more gruesome. This is a guy who spent a lot time planning and preparing, and what was he doing? He was punishing people for their sins. He had a moral agenda. A twisted moral agenda, but do you know how many people do? People in high places.", "[on the box-office failure of _Amistad (1997)_ (qv)] People thought it was a picture about slavery. But it wasn't about slavery at all. It was about American jurisprudence. The point of the film ultimately was that the President in not the king. But I think people were like \"Jesus, not another movie about slavery!\" We really do have a negative response to negative history. Which is a shame.", "[on the failure of _The Bonfire of the Vanities (1990)_ (qv)] I knew that movie wasn't going to work. I don't think 'Brian De Palma' (qv) had a clue. It struck me that he didn't read the book - or that he didn't like the book. It was the one time 'Tom Hanks' (qv) was awfully miscast. Originally, they hired 'Alan Arkin' (qv) to play my role. I thought that was perfect casting. But then they thought they had to be politically correct and make the judge black. So they fired 'Alan Arkin' (qv) and hired me. Not a great way to get a role. I was kind of a suck-a-- for not turning it down, but they weren't going to give it back to Alan anyway. I never did get around to seeing the movie.", "[on the character Hoke Colburn in _Driving Miss Daisy (1989)_ (qv)] It's a tricky character, right on the edge of Uncle Remus. But I knew how to play him right away. I knew when I read it. I just saw him -- the dignity in the character. The only time I ever worried about it was when I was doing the show Off-Broadway, and all these Southerners would come back wiping their eyes and talking about how nostalgic it made them feel. How their grandmother had a chauffeur just like that. I was like \"God damn it! I made these people nostalgic for the good ol' days!\" But, then, I had some black friends see it, and they said, 'Oh, my grandfather was exactly like that.' So that made me feel okay..", "[on working on _The Shawshank Redemption (1994)_ (qv)] That was a strange production. There were moments of extreme tension on the set. Between the producers and actors, between the director and actors, between everybody. Just this personality stuff between different groups. Very strange. Let's stop talking about that one.", "[on _Se7en (1995)_ (qv)] There's all this loss and angst and death and sense of helplessness in that movie - if I saw it in the theater, I probably wouldn't have liked it. I saw _Fight Club (1999)_ (qv) and I didn't like it much. It's a great movie, well made, fabulous acting, but it just made me feel so bad. But 'David Fincher' (qv) is an extraordinarily good director.", "When I was doing press for _Deep Impact (1998)_ (qv), reporters would always ask me how it felt to play the first black president, and I'd tell them, \"I'm not playing the first black president. I'm playing a president who happens to be black.\" Or they'd ask me what sort of research I did for the role. Research? What kind of research do you need to play the president? He's a guy. Besides, we all know what presidents are like standing up there in a press conference. Hell, you don't have to do any research to play a president.", "I saw 'Neil LaBute' (qv)'s first movie, _In the Company of Men (1997)_ (qv), and I thought it sucked deeply. I mean, talk about a couple of scuzzy guys. Man, they were turds. But I was intrigued by the mind that would think this up and film it. Then I saw LaBute's second movie, _Your Friends & Neighbors (1998)_ (qv). Not any better, but still intriguing. So then I got the script for _Nurse Betty (2000)_ (qv), and I loved it and I went and met him. And it turns out he's married, has these lovely kids. He's just this big bear of a man. Cuddly, even. It didn't take any persuading to convince me to do the film.", "When I got nominated for the Oscar [for _Street Smart (1987)_ (qv)], it put rocket boosters in my career. Since childhood, all I wanted to do was make movies. I love the stage, but I wanted to be a movie actor.", "Is there a movie I think I should have won the Oscar for? Yeah. All of them.", "I don't know what my favorite film of mine is... But I think the most important film I was in was _Glory (1989)_ (qv).", "It was my idea to just do _The Electric Company (1971)_ (qv) for a couple of years and go on. But you get trapped by that money thing. It's golden handcuffs. It gets a lot of people, including soap opera actors and commercial actors. Then, they don't want to see you in serious work. That was going to be me, having people come up to me saying \"My kids love you!\" I was there three years too long.", "I find it difficult to watch myself... I find it boring.", "I was talking to Bob Hoskins when we were making Unleashed together. We were talking about the joy of doing bad guys. And he confirmed exactly what I was thinking. With bad guys you get to let it all out. All those dark places in your psyche? You can let 'em go. When you play good guys, it's kind of boring. It's one note.", "Once you've gotten the job, there's nothing to it. If you're an actor, you're an actor. Doing it is not the hard part. The hard part is getting to do it.", "[Accepting his UCLA Tracy award]: To be included among this group of highly accomplished actors is just magical.", "I'm very worried about what's going on in the world at the moment because we have this Napoleonic president; by Napoleonic I mean he's a man who just seems to need to search himself. It doesn't make sense. I don't have any love lost on 'Saddam Hussein' (qv). If he needs to be removed from office, fine. You have to find the right way to do it, but going to war, nah, with the people. To do what. What is the real reason? Because he's harboring weapons of mass destruction? So it is with North Korea. Why are we acting to acquiesce to this? We do not need the Iraqi oil. We have Kuwait oil. It's the same pool. That's why Kuwait's there. That's why Kuwait was set up. You think that country could exist there without somebody backing it? We're talking about a piece of Iraq. So, we keep this. That's my noise. I am terribly upset about the whole thing.", "You know, I was hanging out with 'Sidney Poitier' (qv) and we were trying to decide if he or I were the better actor. We decided it was me as I convinced the world I could sing. (Freeman debuted on Broadway in 1968 in \"Hello, Dolly!\")", "Stop talking about it. I'm going to stop calling you a white man. And I'm going to ask you to stop calling me a black man. - when asked how to get rid of racism in an interview with 'Mike Wallace' (qv) on _60 Minutes (1968)_ (qv).", "Ridiculous... I don't want a Black History Month. Black history is American history. - when asked what he thinks of Black History Month on _60 Minutes (1968)_ (qv).", "The American Indians have this saying. 'Look at the day, look at the sunlight, the grass and the trees! It's a good day to die!'", "You couldn't possibly try to entertain all of the people who seem to be offering you entertainment. Because most of them want some compensation for it.", "[upon waking up face down in a door way and not knowing how he got there] I recognised that it had become a problem, so I just quit. I do have self-control. Once I realise that I've got to change something I just do it.", "If you wake up and the snow is knee-deep outside, you are not filled with rage. It's just something that you've got to cope with. If you're living in a situation it's the only situation that you know, and you've got to deal with it.", "I don't have to work. I could stop and never have to worry about paying the rent. I'm working for the joy of doing it.", "Sometimes, you want to upset an audience so you can engage them. I've done so-called Hollywood films, and I know that it's all about wanting the audience to feel upbeat, give them a happy ending. But they also like complete stories. If your story's complete it doesn't have to have a happy ending.", "They say there's no fool like an old fool. But blessings be upon my wife because I think without her, I'd be somebody's fool by now.", "If you live a life of make-believe, your life isn't worth anything until you do something that does challenge your reality. And to me, sailing the open ocean is a real challenge, because it's life or death.", "[upon getting work as an off-Broadway actor in 1967] I made $70 a week as an actor and I'd been making $60 in L.A. Making more than that as an actor was just unbelievable to me. I never went back to typing but had some real lean times in-between. But I didn't have to go to work for anybody else. I didn't have to wash dishes, I didn't have to wait tables, I didn't have to drive a cab or wash cars. I deliberately left myself nothing to fall back on. If you've got a cushion, where you land, you stay. You can't climb a mountain with a net. If you've got the net, you'll let go.", "I work about half the year. I'm just a guy who enjoys his work and enjoys working with people who enjoy their work. When that happens you get a bonding situation and if it come out with a good product, then that ties you even closer together. It's almost like a great love affair.", "I've never been a mechanic. Throughout my life, what I have been is an actor, a pretender. I do have the wife and the family and the stuff like that but on the other hand, I'm - knock on wood - outstandingly healthy.", "I think we all have a private bucket list. It may not be written down, but I'm constantly checking them off. I just checked off 'Jack Nicholson' (qv). Every day was a holiday because I've been praying at the temple of Jack ever since _Five Easy Pieces (1970)_ (qv). I had a chance to ride with him on the Warner Brothers plane with Clint [Eastwood]. I got to jawing what a fan I was, and as actors will do, he expressed how he liked my work. Then we started talking about how we could make a sequel to [the 1973 Nicholson film] _The Last Detail (1973)_ (qv). But that didn't pan out.", "My aim in life, when I graduated from high school, was to get out of Mississippi. I started coming back [to Mississippi] in about 1979, because my parents moved back, which I couldn't understand. What in the world would make you come back here? It took me about 20 years to figure that out.", "I'm not a campaigner or a crusader for ending racism, or anything for that matter. I believe you should live your life according to your own tenets. If there are people you don't like, avoid them. But not liking people based on generalities is stupid.", "No, but a lot of roles I refuse because it's not me. -- on if he ever feels he's been miscast.", "Isn't there a big, 800-pound gorilla missing here? Money, money, money. You work all your life so you don't have to wash dishes or sweep floors or pump gas, and still pay the rent. That's very germane to what you call a career.", "I don't know about anyone else, but my kids didn't have me. I was busy trying to be somebody. Now I have all these debts to pay. -- on the personal toll being an actor can take on a person.", "I don't think that anything where you start off with something is an art form. If you start off with a blank page or a blank canvas or a blank slab or a blank stone, you're going to create something. If someone brings it to you and says, \"Can you enlarge upon it?\".", "I'm not good at anything else. Certainly not golf. -- on why he is an actor.", "The fact that the people who are making the decisions about moviemaking are not moviemakers is a big problem.", "I don't do accents. But I was going to have to do some sort of accent and do my best to sound like Mandela. I really fretted over that because he's an iconic figure. If you screw it up you've screwed it up. But once we got into production, it all fell into place. -- on the toughest aspect of preparing for \"Invictus\"", "I don't like tension on a set -- at all, of any kind.", "_Glory (1989)_ (qv) does what I think movies are best at, and that is giving you a lesson in history. Glory is a story that nobody knew. It's American history that was completely ignored, and there is an awful lot of that. It is because the people who tell the story tell their own story. So if you ever ask, any time down the line, that's always the film I'll be most proud of.", "[on _The Shawshank Redemption (1994)_ (qv)] That is the film that most people will mention. It's not the only one, but it's the most common. I think more people have seen Shawshank than have seen anything else bar _Casablanca (1942)_ (qv). Me, I just take the compliment.", "I never think about awards or anything like that when I do a job. I was first named a best actor when I was 12 years old and it doesn't really mean anything when you get down to it, because there is no best. I don't get all that involved. My chest puffs up as much as I can puff it up but I am not trying to be better than the person I am acting with. I am trying to be at least as good. That's how it works.", "[on 'Michael Wincott' (qv)] Michael is a sweetheart, he has an enormous power. He is one of those people who's totally dedicated to what he's doing. I certainly get enjoyment out of working with him. He's great to rehearse with, he's always got ideas and this incredible sense of humor and this kind of outlandish take on things.", "I never wanted to be a movie star. I never wanted to be a personality. Then all you do is turn yourself into what the audience wants and play it over and over. That's what movie stars do.", "[on the assassination of 'John F. Kennedy' (qv) in 1963] On that dreadful afternoon I, along with most of the other people in New York, found myself on the street, wandering in a daze, shocked to realize the enormity of the act. I think that's when America began to lose her way.", "Stillness. It's what I learn from the actors I work with. That's all, and that's the hardest thing.", "[on _The Power of One (1992)_ (qv)] I think that movie was one of those things where....well, the script read so well and it looked so wonderful. I had a beautiful expectation for it, but it didn't evolve to be what it was supposed to be. It wasn't as good as I had hoped it would be. I can't say particularly why, but I wasn't as moved as when I was reading the script."], "salary history": ["_Kiss the Girls (1997)_ (qv)::$5,000,000"], "birth date": "1937-06-01", "birth notes": "Memphis, Tennessee, USA", "_actorID": "60", "_source": "IMDB", "actorID": "0000151", "created_utc_dt": "09/14/2019, 13:02:07"}