{"headshot": "https://m.media-amazon.com/images/M/MV5BMTkzNjE5MzY5M15BMl5BanBnXkFtZTgwMDI5ODMxODE@._V1_UY98_CR37,0,67,98_AL_.jpg", "nick names": ["Pominator"], "height": "5' 7\" (1.7 m)", "mini biography": ["'Pom Klementieff' (qv) (born 3 May 1986) is a French actress. She was trained at the Cours Florent drama school in Paris and has appeared in such films as Loup (2009), Sleepless Night (2011) and Hacker's Game (2015). She plays the role of Mantis in the Marvel Cinematic Universe films Guardians of the Galaxy Vol. 2 (2017), Avengers: Infinity War (2018) and Avengers: Endgame (2019).'Pom Klementieff' (qv) was born in Quebec City, Canada, to a Korean mother and French-Russian father, who was working there as a consul with the French government. Her parents chose the name \"Pom\" because it is similar in pronunciation to the Korean words for both \"spring\" and \"tiger\". Klementieff lived in Canada for one year before her family traveled extensively due to her father's job. They lived in Japan and the Ivory Coast, before settling in France.Klementieff's father died of cancer when she was 5, and her mother had schizophrenia and was unable to care for children, so Klementieff was raised by her paternal uncle and aunt. Her uncle, whom she described as \"like [her] second father\", died on her 18th birthday, and her older brother committed suicide just seven years later, this time on her 25th birthday. Klementieff briefly attended law school after her uncle's death to appease her aunt but did not find the career path appealing. She also worked as a waitress and saleswoman in France. She started acting at age 19 at the Cours Florent drama school in Paris. A few months into her education, she won a theater competition that awarded her free classes for two years with the school's top teachers.Klementieff's first professional acting job was the French independent film Après lui (2007), portraying the stepdaughter of the protagonist played by Catherine Deneuve. Filming for her scenes took three days. During one scene, Klementieff was supposed to push someone down a set of stairs but accidentally fell down the stairs herself, and director Gaël Morel kept that shot in the final film. Her first leading role was in Loup (2009), a French film about a tribe of reindeer herders in the Siberian mountains. During filming, Klementieff stayed in a camp, hours from the nearest village, where temperatures dropped well below zero. During filming she befriended nomads who lived there, worked with real wolves, rode reindeer, and swam with a horse in a lake.Klementieff made her Hollywood debut in Spike Lee's Oldboy (2013), a remake of the South Korean film of the same name. She portrayed Haeng-Bok, the bodyguard of the antagonist played by Sharlto Copley. A fan of the original film, Klementieff heard about the part through Roy Lee, a producer with the remake, and took boxing lessons after learning the role involved martial arts. After showcasing her boxing skills during her audition, Lee asked her to go home and come back wearing a more feminine outfit and make-up, like her character in the film. She contributed some of her own clothes to the character's wardrobe, and trained three hours a day for two months for an on-screen fight with star Josh Brolin. Klementieff came up with the name Haeng-Bok, Korean for \"happiness\", herself after Lee asked her to research possible names for the character.Klementieff moved to Los Angeles after Oldboy was filmed and began pursuing more Hollywood auditions. She continued taekwondo after the film, and has a purple belt as of the summer of 2014. Her next acting role was the film Hacker's Game (2015), in which she plays a hacker she compared to Lisbeth Salander from the novel The Girl with the Dragon Tattoo. Klementieff used her boxing skills again in the film, and due to the movie's low budget, she had to do her own make-up and choose her own wardrobe. It was her idea to dye her hair purple for the role, to which the directors first objected but later acquiesced. She joined the Marvel Cinematic Universe in the role of Mantis in Guardians of the Galaxy Vol. 2 (2017) and appeared in the same role in the film Avengers: Infinity War (2018) and Avengers: Endgame (2019).::ahmetkozan"], "trivia": ["Her father was Russian and French; her mother was Korean.", "Her mother named her \"Pom\" because it sounds similar to the Korean words for \"spring\" and \"tiger\".", "Her family lived in Canada, Japan, and the Ivory Coast before finally settling in France.", "Her father died when she was five years old.", "Her brother committed suicide on her 25th birthday.", "She was raised by her paternal uncle and aunt. Her uncle died on her 18th birthday."], "quotes": ["My job, challenges, and simple things like waking up, going to my patio, and seeing that an hibiscus or a camellia opened during the night. It just makes me happy.", "Being resilient is the essence of my life.", "I look at the tattoo inside my left wrist. It's my brother's name, he committed suicide two years ago. Just before the second anniversary of his death, I tattooed his name. I miss him, of course, and I decided I would live for me, and for him.", "What doesn't kill you makes you stronger, everybody knows this!", "In everyday life, I use positive thoughts, sense of humor, Taekwondo, running, and yoga to make me stronger.", "Everything makes me vulnerable, you just have to use it as an actor. It's a constant balance.", "There are so many forms of love. Spending time with friends, love stories. I enjoy showing my love by baking a cake for somebody and writing his or her name on it, and seeing his or her reaction. I love to offer flowers too!", "I never believed in God and I will never believe in it.", "I want to grow up as an actress and as a woman. Be independent.", "My mother is schizophrenic. I would love to be brave enough to learn more about it. I try to understand her, I try to be positive about it. She can be so absent and tired by her medication; sometimes she's so lucid, funny, and smart."], "birth date": "1986-05-03", "birth notes": "Quebec City, Quebec, Canada", "_actorID": "71", "_source": "IMDB", "actorID": "2962353", "created_utc_dt": "09/14/2019, 13:02:17"}