{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQ3ODE2NTMxMV5BMl5BanBnXkFtZTgwOTIzOTQzMjE@._V1_UY98_CR6,0,67,98_AL_.jpg", "nick names": ["Em"], "birth name": "Emma Charlotte Duerre Watson", "height": "5' 5\" (1.65 m)", "mini biography": ["Emma Charlotte Duerre Watson was born in Paris, France, to English parents, Jacqueline Luesby and Chris Watson, both lawyers. She moved to Oxfordshire when she was five, where she attended the Dragon School. From the age of six, Emma knew that she wanted to be an actress and, for a number of years, she trained at the Oxford branch of Stagecoach Theatre Arts, a part-time theatre school where she studied singing, dancing and acting. By the age of ten, she had performed and taken the lead in various Stagecoach productions and school plays.In 1999, casting began for Harry Potter and the Sorcerers (2001), the film adaptation of British author J.K. Rowling's bestselling novel. Casting agents found Emma through her Oxford theatre teacher. After eight consistent auditions, producer David Heyman told Emma and fellow applicants, 'Daniel Radcliffe' (qv) and 'Rupert Grint' (qv), that they had been cast for the roles of the three leads, Hermione Granger, Harry Potter and Ron Weasley. The release of _Harry Potter and the Sorcerer's Stone (2001)_ (qv) was Emma's cinematic screen debut. The film broke records for opening-day sales and opening-weekend takings and was the highest-grossing film of 2001. Critics praised the film and the performances of the three leading young actors. The highly distributed British newspaper, 'The Daily Telegraph', called her performance \"admirable\". Later, Emma was nominated for five awards for her performance in the film, winning the Young Artist Award for Leading Young Actress in a Feature Film.After the release of the first film of the highly successful franchise, Emma became one of the most well-known actresses in the world. She continued to play the role of Hermione Granger for nearly ten years, in all of the following Harry Potter films: _Harry Potter and the Sorcerer's Stone (2001)_ (qv), _Harry Potter and the Chamber of Secrets (2002)_ (qv), _Harry Potter and the Prisoner of Azkaban (2004)_ (qv), _Harry Potter and the Goblet of Fire (2005)_ (qv), _Harry Potter and the Order of the Phoenix (2007)_ (qv), _Harry Potter and the Half-Blood Prince (2009)_ (qv), _Harry Potter and the Deathly Hallows: Part 1 (2010)_ (qv), and _Harry Potter and the Deathly Hallows: Part 2 (2011)_ (qv). Emma acquired two Critics' Choice Award nominations from the Broadcast Film Critics Association for her work in Harry Potter And The Prisoner Of Azkaban and Harry Potter And The Goblet Of Fire. The completion of the seventh and eight movies saw Emma receive nominations in 2011 for a Nickelodeon Kids' Choice Award, and for Best Actress at the Jameson Empire 'Awards' (qv). The Harry Potter franchise won the BAFTA for Outstanding British Contribution to Cinema in February 2011.2011 saw Emma in Simon Curtis's _My Week with Marilyn (2011)_ (qv), alongside a stellar cast of Oscar nominees including Michelle Williams as 'Marilyn Monroe' (qv) and 'Kenneth Branagh' (qv) as Sir Laurence Olivier, in addition to Eddie Redmayne, Dame Judi Dench, Dougray Scott, Zoe Wanamaker, Toby Jones and Dominic Cooper. Chronicling a week in 'Marilyn Monroe' (qv)'s life, the film featured Emma in the supporting role of Lucy, a costume assistant to Colin Clark (Redmayne). The film was released by The Weinstein Company and was nominated for a Golden Globe for Best Motion Picture - Comedy or Musical. In 2012 Emma was seen in Stephen Chbosky's adaptation of his coming-of-age novel _The Perks of Being a Wallflower (2012)_ (qv), starring opposite 'Logan Lerman' (qv) and 'Ezra Miller' (qv). This independent drama centered around Charlie (Lerman), an introverted freshman who is taken under the wings of two seniors (Watson and Miller) who welcome him to the real world. The film premiered at the 2012 Toronto International Film Festival and received rave reviews. The film won the People's Choice Award for Favourite Dramatic Movie and Emma also picked up the People's Choice Award for Favourite Dramatic Movie Actress. Emma was awarded a second time for this role with the Best Supporting Actress Award at the San Diego Film Critics Society 'Awards' (qv) where the film also won the Best Ensemble Performance Award.In summer 2013, Emma starred in 'Sofia Coppola' (qv)'s American satirical black comedy crime film, _The Bling Ring (2013)_ (qv), opposite 'Katie Chang' (qv) and 'Israel Broussard' (qv). The film took inspiration from real events and followed a group of teenagers who, obsessed with fashion and fame, burgled the homes of celebrities in Los Angeles. The film opened the Un Certain Regard section of the 2013 Cannes Film Festival. Emma also appeared in a cameo role as herself in Seth Rogen's apocalypse comedy This Is The End (2013). The film tells the story about what happens to some of Hollywood's best loved celebrities when the apocalypse strikes during a party at James Franco's house.In 2014, Emma was seen in 'Darren Aronofsky' (qv)'s _Noah (2014)_ (qv), opposite 'Russell Crowe' (qv), 'Jennifer Connelly' (qv), 'Ray Winstone' (qv), 'Douglas Booth' (qv), 'Logan Lerman' (qv), and 'Anthony Hopkins' (qv). The film told the epic, biblical tale of Noah and the ark. Emma plays the role of Ila, a young woman who develops a close relationship with Noah's son, Shem (Booth). Noah made an outstanding $300m since its release in March. In 2015, Emma starred in _Regression (2015)_ (qv), written and directed by Alejandro Amenábar. Also headlined by Oscar-nominated Ethan Hawke, and set in Minnesota in 1990, Regression tells the story of Detective Bruce Kenner (Hawke), who investigates the case of young Angela, played by Emma, who accuses her father of sexual abuse.In 2012, Emma was honored with the Calvin Klein Emerging Star Award at the ELLE Women in Hollywood 'Awards' (qv). In 2013, Emma was awarded the Trailblazer Award at the MTV Movie 'Awards' (qv) in April and was honored with the GQ Woman of the Year Award at the GQ 'Awards' (qv) in September. Further to her acting career, Emma is a Goodwill Ambassador for the UN, promoting gender equality and the empowerment of women. Emma graduated from Brown University in May 2014.In 2017, Emma starred in the live-action Disney fantasy _Beauty and the Beast (2017)_ (qv), one of the biggest movies of all time in the U.S., and the dramatic thriller _The Circle (2017)_ (qv).::Anonymous"], "trivia": ["Has two cats, one is named Bubbles and the other is named Domino.", "Favorite Harry Potter book is Harry Potter and the Prisoner of Azkaban.", "She served on a jury to select the 2004 teen-aged film-makers' First Light Film 'Awards' (qv). The ceremony was held in London's Leicester Square. Other jurors included 'Pierce Brosnan' (qv), 'Kenneth Branagh' (qv), and 'Samantha Morton' (qv).", "She was named after her paternal grandmother, born Freda Emma Duerre who, after marriage, became Freda Emma Duerre Watson.", "At the age of fifteen became the youngest person to appear on the cover of Teen Vogue magazine.", "She and her Harry Potter co-stars 'Daniel Radcliffe' (qv) and 'Rupert Grint' (qv) were named #9 on Entertainment Weekly's Best Entertainers of the Year in 2005.", "She achieved eight A* and two A passes in her GCSEs (exams British school pupils take in their last compulsory year of secondary school).", "Attended The Dragon School, a renowned preparatory school in Oxford, between September 1995 and July 2001. She then went on to attend Headington School, a private all-girls school, between September 2001 and July 2006.", "Her parents are both British, and were living in Paris at the time of Emma's birth. Emma lived in France until the age of five, when her family returned to Britain.", "Was born at 6:00pm (GMT + 1 hour) on a Sunday.", "Enjoys playing field hockey, netball and tennis (for school and local teams), skiing, painting, cooking, singing, and dancing (has twice competed with her school in Rock Challenge 2006 and 2007).", "Took AS levels in English, Geography, Art, and History of Art in May 2007, and has now dropped History of Art to pursue the three A levels.", "Was ranked #15 on Forbes List of The 20 Top-Earning Young Superstars. [2007]", "Was ranked #26 on Empire Magazine's '100 Sexiest Movie Stars' (2007).", "Was ranked #3 on 'Yahoo! List of the 10 Most Popular Stars of 2007'.", "Was ranked #97 on Forbes List of The Celebrity 100. [2007]", "In 2007, Forbes Magazine estimated her earnings for the year at $4 million.", "Emma's favorite movies include _Notting Hill (1999)_ (qv), _Love Actually (2003)_ (qv), _Bridget Jones's Diary (2001)_ (qv), _Four Weddings and a Funeral (1994)_ (qv), _About Time (2013)_ (qv), _Giant (1956)_ (qv), _Breathless (2008)_ (qv), _Amélie (2001)_ (qv), _Pan's Labyrinth (2006)_ (qv), _The Fountain (2006)_ (qv), _The Shawshank Redemption (1994)_ (qv), _Gladiator (2000)_ (qv), _Braveheart (1995)_ (qv), _The Curious Case of Benjamin Button (2008)_ (qv), _Philomena (2013)_ (qv), _Blue Jasmine (2013)_ (qv), _Rush (2013)_ (qv), _12 Years a Slave (2013)_ (qv), _The Great Beauty (2013)_ (qv), _The Woodmans (2010)_ (qv), _Closer (2004)_ (qv), _Pretty Woman (1990)_ (qv), _Chicago (2002)_ (qv), _Romeo + Juliet (1996)_ (qv), _Moulin Rouge! (2001)_ (qv), _Dirty Dancing (1987)_ (qv), _Grease (1978)_ (qv), _Shrek (2001)_ (qv), _Ice Age (2002)_ (qv), and _Finding Nemo (2003)_ (qv).", "Was ranked #28 on Entertainment Weekly's '30 Under 30' the actress list. [2008]", "Ranked #94 on the Maxim magazine Hot 100 of 2008 list. [2008]", "Is a fan of _The Golden Compass (2007)_ (qv) and the rest of the fantasy trilogy 'His Dark Materials' by 'Philip Pullman' (qv).", "Ranked #4 by Portrait Magazine for favorite celebrities by fans' vote. Her Harry Potter co-star 'Bonnie Wright' (qv) Had also Ranked #5.", "Her parents divorced in 1995; each parent has since remarried. On her father's side, she has a younger half-brother, Toby, born 2003, and half-sisters (identical twins) Lucy and Nina, born in 2004. Lucy and Nina played the younger version of her character Pauline in _Ballet Shoes (2007)_ (qv). She also has two stepbrothers through her mother's remarriage.", "Was ranked #3 on Moviefone's '25 Hottest Actors Under 25'. [2008]", "In 2008, BoyDestiny wrote and sang the song \"You Got Me Going\", also known as The 'Emma Watson' (qv) Song.", "Radio One's movie critic James King named \"Ron Weasley\" and \"Hermione Granger\", played by 'Rupert Grint' (qv) and 'Emma Watson' (qv), as number 4 in his Top 5 Movie Couples list on _The Colin and Edith Show (2006)_ (qv).", "Entering Brown University, Rhode Island, U.S.A. after completion of the Harry Potter Movies (July 21, 2009).to study literature.", "Was ranked #8 in Portrait Magazine's 'Top 30 Under 30' (2009). 'Harry Potter' cast mates 'Evanna Lynch' (qv), 'Rupert Grint' (qv), 'Bonnie Wright' (qv), 'Tom Felton' (qv) and 'Daniel Radcliffe' (qv) also made the list on the 3rd, 5th, 7th, 14th and 18th place respectively.", "Has said that she'd like to work with directors 'Alfonso Cuarón' (qv) and 'Guillermo del Toro' (qv).", "Was Entertainment Weekly's \"Entertainer of the Month\" for the month of July (2009).", "Was ranked #3 on Empire Magazine's '100 Sexiest Movie Stars' list.", "She was ranked #6 on MSN's list of 'Best Dressed Stars of 2009'.", "Was named the face of the 2009 Fall/Winter Burberry Campaign. [2009]", "She was ranked #8 on Portrait Magazine's 'Top 30 Under 30' list. [2009]", "She was ranked #3 on Teen Vogue's list of the Best Dressed celebrities of 2009.", "Announced that she would be would collaborating with People Tree, a Fair Trade Fashion Company, as a creative advisor for the new Spring/Summer collection. [2009]", "Was named the 'Highest Grossing Actress of the Decade' by the Guiness Book of World Records. Her film work in the past decade has grossed over 5.4 billion dollars worldwide (2009).", "When she made a promotional appearance on a Dutch TV talk show for _Harry Potter and the Order of the Phoenix (2007)_ (qv), the interview ended with her joining the Dutch illusion act Magic Unlimited, who sawed her in half.", "(April 24, 2011) Her publicist, 'Vanessa Davies' (qv), said that Emma will transfer from Brown University to another school in the Fall of 2011.", "Was ranked #69 on Maxim magazine's Hot 100 women of 2011 list.", "Best friends with Harry Potter co-stars 'Daniel Radcliffe' (qv) and 'Rupert Grint' (qv) after practically growing up with them on the Harry Potter set. She calls them her 'brothers'.", "Both of her parents are lawyers.", "Has worked closely with the organic and fair trade pioneer People Tree.", "Ranked #15 in the 2011 FHM Australia of \"100 Sexiest Women\".", "Ranked #23 in the 2011 FHM list of \"100 Sexiest Women in the World\".", "Ranked #29 in the 2010 FHM UK list of \"100 Sexiest Women in the World\".", "Ranked as having one of the most beautiful famous faces by \"The Annual Independent Critics List of the 100 Most Beautiful Famous Faces From Around the World.\" She was ranked #2 in 2010, #12 in 2009, #27 in 2008, #30 in 2007, and #54 in 2006.", "Voted #17 on Ask Men's top 99 'most desirable' women of 2012.", "Is the former roommate and current best friend of _America's Next Top Model (2003)_ (qv) Cycle 18 winner, 'Sophie Sumner' (qv).", "Ranked #29 on Askmen's list of the Top 99 Most Desirable women for 2013.", "Was offered the titled lead in _Cinderella (2015)_ (qv) but turned it down.", "Was in a relationship with Will Adamowicz from 2012-2013. The couple met while studying at Oxford University in 2011.", "She enrolled in a Shakespeare course at The Royal Academy of Dramatic Arts during the summer of 2008.", "Emma's style icons include 'Jean Seberg' (qv), 'Mia Farrow' (qv), 'Kate Bosworth' (qv), 'Diane Kruger' (qv), 'Jane Birkin' (qv), 'Edie Sedgwick' (qv), 'Grace Kelly' (qv), 'Audrey Hepburn' (qv), 'Lauren Bacall' (qv), 'Sofia Coppola' (qv), 'Cate Blanchett' (qv), 'Tilda Swinton' (qv), 'Françoise Hardy' (qv), 'Charlotte Rampling' (qv) and 'Michelle Obama' (qv).", "Emma's favorite actors are 'Johnny Depp' (qv) and 'Russell Crowe' (qv).", "Emma's favorite actresses are 'Julia Roberts' (qv), 'Renée Zellweger' (qv), 'Sandra Bullock' (qv), 'Rebel Wilson' (qv), 'Goldie Hawn' (qv), 'Nicole Kidman' (qv), 'Cate Blanchett' (qv), 'Helena Bonham Carter' (qv), 'Natalie Portman' (qv) and 'Meryl Streep' (qv).", "Emma's favorite television shows include _Friends (1994)_ (qv), _Sex and the City (1998)_ (qv), _Girls (2012)_ (qv), _Gossip Girl (2007)_ (qv), _America's Next Top Model (2003)_ (qv), _Mad Men (2007)_ (qv), _House of Cards (2013)_ (qv) and _Pride and Prejudice (1995)_ (qv).", "Emma's favorite filmmakers are 'Richard Curtis' (qv), 'Alfonso Cuarón' (qv), 'Guillermo del Toro' (qv), 'Sofia Coppola' (qv), 'Darren Aronofsky' (qv), 'Danny Boyle' (qv), 'David Fincher' (qv), 'Lynne Ramsay' (qv), 'Ang Lee' (qv), and 'Tom Hooper' (qv).", "'Emma Watson' (qv) has stated that, since her audition at age 9 through the completion of 8 Harry Potter features by age 22, the hectic, educational experience consumed over half her life.", "Passed her driving test in the U.S. in 2008 and drives a Toyota Prius.", "Includes 'Justin Timberlake' (qv) and 'Alanis Morissette' (qv) among her favorite singers.", "Has kept a painstakingly detailed log of her everyday life since her film career took off, as many as 30 journals in total.", "Was offered the role of Mia in _La La Land (2016)_ (qv) but turned it down to play Belle in Disney's live-action _Beauty and the Beast (2017)_ (qv). The role then went to 'Emma Stone' (qv), who won an Academy award for her performance. Ironically, she replaced Stone for the role of Meg March in 'Greta Gerwig' (qv)'s _Little Women (2019)_ (qv) after Stone was unable to take the part due to her scheduling conflicts in promoting _The Favourite (2018)_ (qv).", "Auditioned eight times (at age 9) for the role of Hermione Granger in the Harry Potter films, playing opposite five prospective sets of Harry's before landing the part.", "Has the same birthday as her Beauty and the Beast co-stars: 'Luke Evans' (qv) and her Harry Potter collaborator 'Emma Thompson' (qv).", "Has combined type ADHD and has been taking Ritalin for it since childhood.", "Has almost 24 million Twitter followers. [February 2017]", "Prefers to sign autographs for fans rather than taking pictures with them.", "Is taking legal action after private photos of her trying on various outfits were stolen and posted online. [March 2017]", "Once accidentally mistook 'Jimmy Fallon' (qv) for 'Jimmy Kimmel' (qv).", "(May 25, 2014) Graduated from Brown University with a bachelor's degree in English literature.", "Sixth highest paid actress of 2017 with $14 million.", "Named #1 on 'Sexiest Movie Stars\" Poll on Empire Magazine voted by over 50 000 people around the world.", "Has spoken in the United Nations Organization in favour of Women's Rights, including abortion.", "Is a certified yoga and meditation instructor."], "quotes": ["[in response to a reporter asking her whether she always wore pigtails]: I never wear pigtails, I wear plaits.", "[Hardest scene]: Neville comes up to me with his toad, Trevor, and says, \"Do you want to kiss Trevor goodnight?\" Every time he did this I burst into laughter. I was supposed to give him an \"I hate you\" look, but I couldn't help myself. It took me about eight takes to get it.", "It was unbelievable seeing me as an action figure! In a few months, toddlers all around the country will be biting my head off!", "[on kissing her co-stars]: Oh my God, no, no chance, no chance. That's not in my contract!", "My friends are all really nice about my fame, they're just curious really, they ask lots of questions.", "[on how her character, Hermione Granger, has matured]: She's rock and roll. She's feisty. Girl power!", "[on reporters asking the same questions over and over]: That's the good thing about them! They all ask exactly the same questions and you can say exactly the same answers! You don't have to think, you can just stand there like a broken record going LALALA.", "[on working with boys]: I like being around mixed company. Dan ('Daniel Radcliffe' (qv)) and Rupert ('Rupert Grint' (qv)) definitely make their fair share of cheeky comments about me being girlie, but it's all in good fun.", "It took me three films to get Hermione in jeans. To get out of the robes with the tights and the itchy jumpers. Whoo-hoo!", "I hope my head doesn't get very big. I'm just going to keep my feet on the ground, stick to friends and family and try and lead a normal life.", "I love fashion. I think it's so important, because it's how you show yourself to the world.", "[on being a known actress]: Most people are really nice but some stare, like you're some kind of zoo exhibit and not a real person with real feelings. Even when you take away all the glamour and attention and premieres and everything, it still comes down to the fact that I'm acting.", "Hermione uses all these big long tongue twister words, I don't know what she's going on about half the time!", "I could be 100 years old and in my rocker, but i'll still be very proud that I was part of the Harry Potter films.", "[on her co-stars 'Daniel Radcliffe' (qv) and 'Rupert Grint' (qv), who play Harry and Ron]: More than just friends, they've become like brothers. Or sisters, I don't know. In fact, I don't see them like normal boys. I mean that I cannot imagine me going out with one of them. For me, they are like my best friends. I can laugh and talk about everything with them without any taboo. I really like them a lot.", "[on other roles]: Now that I've played the snotty, bossy, posh Hermione Granger, I'd like to play some American high school girl. I want to play something totally different. I want to play every kind of character and every point of view, but I'm probably going to be playing Hermione for a while.", "[If she'd sooner have a great Hollywood career or a great marriage]: Hmmmmm... Can't I have both? But if I would really have to choose, then I'd pick a great marriage. I think it would be amazing if I would get to play beautiful parts and win Oscars, but that would all mean nothing if my parents and friends weren't there with me. What is success when you don't have anybody to love? No, I'd rather be happily married.", "[on watching the earlier movies]: It's like baby photos... I look like a chipmunk!", "I get sent Bibles. I have a collection of about 20 in my room. People think I need to be guided.", "The most challenging aspect of this film was the fact that I was trying to take my A-levels at the same time I was filming. So my life was crazy. One minute I was on set, and the next minute I was doing an exam, or reading a textbook, or doing something, so I was a bit all over the place. Sometimes it's kind of hard to juggle both aspects of my life.", "If someone asked me to do something that was beneficial to a cause, then maybe I'd consider it, but not just [to be able to say] 'Look at me! I've got my own line!'", "Acting never was about the money for me. ... Maybe in 10 years, I'll be able to appreciate the fact that I am financially stable and independent and I don't have to make bad choices. I can be very picky.", "I'm very crafty! One time I made a television set out of a cardboard box - Everybody thought it was a lark! This was the beginning of a love affair with the arts. I'm now studying art in Brown, a fancy American school.", "I love painting and have a need to do it.", "Free handbags are lovely, but that's not what I see as the benefits of being famous. It means I can do things I really care about, like _The Perks of Being a Wallflower (2012)_ (qv), which might not have been made otherwise. Being a teenager is quite lonely, particularly for my generation. There's a sense of people being cut off and in isolation. And when I read the script, it just made me feel less alone. My character says this line: 'You accept the love you think you deserve', and that just hit me like a steam train.", "I don't want other people to decide who I am. I want to decide that for myself. I want to avoid becoming too styled and too \"done\" and too generic. You see people as they go through their career and they just become more and more like everyone else. They start out with something individual about them but it gets lost. 'Natalie Portman' (qv) is an exception. I'm in awe of how she's handled herself. And 'Agyness Deyn' (qv) is cool, really individual.", "Each of the Harry Potter directors looked as if they had aged about 10 years by the time they'd finished. It's a huge burden to carry.", "I remember reading this thing that 'Elizabeth Taylor' (qv) wrote. She had her first kiss in character. On a movie set. It really struck me. I don't know how or why, but I had this sense that if I wasn't really careful, that could be me. That my first kiss could be in somebody else's clothes. And my experiences could all belong to someone else.", "[on _Noah (2014)_ (qv)] I was so physically and emotionally exhausted by just the process of making the film. I just didn't leave my apartment for a few weeks afterwards, walked around in my pajamas for a few days in a row. I just needed some time to sort of put myself back together a bit.", "[on childhood fame]: If I went to somewhere busy, I wouldn't last very long. I can't go to a museum, I'll last 10 or 15 minutes in a museum. The problem is that when one person asks for a photograph, then someone sees a flash goes off, then everyone else sort of... It's sort of like a domino effect. And then very quickly the situation starts to get out of control to a point where I can't manage it on my own.", "I guess, weirdly in my head, I knew what I wanted. I didn't know how it would, or if it would, ever happen. But before _The Bling Ring (2013)_ (qv) I said I'd really wanted to meet 'Sofia Coppola' (qv) and - this is before I knew that she had a film in mind - ended up meeting her. And Darren was someone who actually I met a good year ago. And then I'm doing a film with 'Guillermo del Toro' (qv) next summer, and I went to him and said Warner Brothers have given me the script for 'Beauty and the Beast,' but the only way I'd really want to do it is if you did it. And then miraculously he said, 'Oh, funnily enough 'Beauty and the Beast' is my favorite fairy tale, I can't let anyone else do this, I'll start putting a team together.'", "[on fame and her parents] They gave me the best advice they could, and I think they gave me very good advice. But my mum particularly said, 'Right, you're going to go into these interviews and they're going to ask you anything they feel like asking you, and every time they ask you a question, think about whether you'd be comfortable discussing it with a stranger.'", "My first two years at Brown weren't easy, not because I was bullied or because anyone gave me a particularly hard time, but just because, you know, without the collegiate system... and at Brown everyone does completely different things and very much chooses their own path, which is great, but it's also much more difficult, too. You're not with a group of people all the time at one time.", "My grandma said - when I was really young and I'd sing along to the radio - why do you sing in an American accent? I guess it was because a lot of the music I was listening to had American vocalists. And that was something Steve said to me as well: try singing the lines in an American accent. That kind of opened me up. Then I worked with a dialogue coach and I just put in the time to really, really listen and just go over it and over it and over it until I could do it without thinking about it too hard. And I just knew it was really important.", "I don't date people who are famous. I don't think it's fair that, all of a sudden, intimate details of their personal life are public as a direct result of me. I wish I could protect them.", "If I've learned anything, it's really just to stop trying to find answers and certainties.", "In my downtime, I don't sex myself up much. Sometimes I have a hard time convincing directors that I can play adult roles.", "I'm a feminist, but I think that romance has been taken away a bit for my generation. I think what people connect with in novels is this idea of an overpowering, encompassing love - and it being more important and special than anything and everything else.", "You can't go to the pharmacy without someone saying, \"Hey, you're the girl from Harry Potter!\" and I'm like 'Yeah! Just buying tampons, see you in a bit!'", "The saddest thing for a girl to do is to dumb herself down for a guy.", "I like men with quick wit, good conversation and a great sense of humour. I love banter. I want a man to like me for me - I want him to be authentic.", "Don't feel stupid if you don't like what everyone else pretends to love.", "Fighting for women's rights has too often become synonymous with man hating. This has got to stop.", "[on being cast as Belle in _Beauty and the Beast (2017)_ (qv)] I had to fight for the role. I had to audition. I had to prove I could sing. I really had to go for it. You can't have doubts when you're singing in front of a set of 200 people in one of the biggest musicals of all time", "No one likes feeling vulnerable and uncomfortable and weak. But I really have found that it's in those moments when I go there that there's a kind of magic.", "I'm the girl who will get up and dance with zero alcohol in her system. You need give me no excuse.", "When men don't have to be aggressive to be accepted, women won't feel compelled to be submissive.", "Acting is telling the truth under imaginary circumstances. Also, I'm the worst liar ever.", "I'm aware that I'm kind of a paradox, and at times a bit ill-suited to my profession. But there's something that brings me back. There's something in me that feels like I have to do this, that this is what I'm meant to be doing.", "[2007] It's nice to be able to ask questions and share experiences [with my Harry Potter co-stars]. They have been really important in making me feel better, not worse.", "[2007] I was thinking, 'Am I doing it right?' and 'Am I good enough?' [on the set of the first two Harry Potter movies].", "[2007] It's [acting] a career where you just have to see what comes up.", "[2007] I like to think we [her and her Harry Potter co-stars] are still all who we were. We are who we are.", "[2007] Before, Hermione would rather die than be expelled. It's nice to see she's come to a state in life where she's prepared to question authority.", "[2007] But now I am hearing she's [Hermione Granger] going to die. I don't deserve that. As soon as the book is released it'll be sent to us. I'll be reading it, I so want to know what happens, I really do.", "[2007] You are careful not to do it in the public eye. You have your first cigarette or first glass of alcohol in a safe environment with your close friends. If you live low-key, normal lives, the press don't get a chance to find out about it."], "salary history": ["_Harry Potter and the Sorcerer's Stone (2001)_ (qv)::$125,000", "_Harry Potter and the Chamber of Secrets (2002)_ (qv)::$125,000", "_Harry Potter and the Prisoner of Azkaban (2004)_ (qv)::$125,000", "_Harry Potter and the Order of the Phoenix (2007)_ (qv)::$4,000,000", "_Harry Potter and the Deathly Hallows: Part 1 (2010)_ (qv)::$15,000,000", "_Harry Potter and the Deathly Hallows: Part 2 (2011)_ (qv)::$15,000,000", "_Beauty and the Beast (2017)_ (qv)::$15,000,000"], "birth date": "1990-04-15", "birth notes": "Paris, France", "_actorID": "20", "_source": "IMDB", "actorID": "0914612", "created_utc_dt": "09/14/2019, 13:01:30"}