{"headshot": "https://m.media-amazon.com/images/M/MV5BNzEzMTI2NjEyNF5BMl5BanBnXkFtZTcwNTA0OTE4OA@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["DJ Big Driis"], "birth name": "Idrissa Akuna Elba", "height": "6' 2½\" (1.89 m)", "mini biography": ["An only child, Idrissa Akuna Elba was born and raised in London, England. His father, Winston, is from Sierra Leone and worked at Ford Dagenham; his mother, Eve, is from Ghana and had a clerical duty. Idris attended school in Canning Town, where he first became involved in acting, before he dropped out. He gained a place in the National Youth Music Theatre - thanks to a £1,500 Prince's Trust grant. To support himself between acting roles, he worked in jobs such as tyre-fitting, cold call advertising sales, and working night shifts at Ford Dagenham. He worked in nightclubs under the nickname DJ Big Driis at age 19, but began auditioning for television roles in his early-twenties.His first acting roles were on the soap opera _Family Affairs (1997)_ (qv), the television serial _Ultraviolet (1998)_ (qv), and the medical drama _Dangerfield (1995)_ (qv). His best known roles are as drug baron Russell \"Stringer\" Bell on the HBO series _The Wire (2002)_ (qv), as DCI John Luther on the BBC One series _Luther (2010)_ (qv), and as Heimdall in the Marvel Cinematic Universe. He later starred in the films _Daddy's Little Girls (2007)_ (qv), _Prom Night (2008)_ (qv), _RocknRolla (2008)_ (qv), _The Unborn (2009)_ (qv) and _Obsessed (2009)_ (qv). He also appeared in the films _American Gangster (2007)_ (qv), _Takers (2010)_ (qv), _Thor (2011)_ (qv), _Prometheus (2012)_ (qv), _Pacific Rim (2013)_ (qv), _Thor: The Dark World (2013)_ (qv), _Beasts of No Nation (2015)_ (qv) and _Star Trek Beyond (2016)_ (qv). He voiced Chief Bogo in _Zootopia (2016)_ (qv), Shere Khan in _The Jungle Book (2016)_ (qv), and Fluke in _Finding Dory (2016)_ (qv).'Idris Elba' (qv) was appointed Officer of the Order of the British Empire (OBE) by Queen Elizabeth II in the 2016 New Years Honours for his services to drama.::Kad"], "spouse": ["'Sabrina Dhowre' (qv)::(26 April 2019 - present)", "Sonya Hamlin::(9 April 2006 - 11 August 2006) ( divorced)", "Kim Nørgaard::(June 1999 - 2003) ( divorced) ( 1 child)"], "trade mark": ["Deep baritone voice", "Strong London accent"], "trivia": ["Disc jockey under the name \"Big Driis the Londoner\".", "Has appeared on the cover of Essence magazine's \"Hot Hollywood Men\" issue. [April 2004]", "Has one daughter with his ex-wife Hanne \"Kim\" Norgaard: 'Isan Elba' (qv) (born 2002); Isan currently resides with her mother in Atlanta, Georgia.", "Is an only child of African immigrants to England. His father was from Sierra Leone and his mother was from Ghana. His name is of Krio African origin.", "He appeared on the Black Entertainment Television (BET) special _Black Men: The Truth (2007)_ (qv).", "He co-produced and performed the intro on rapper 'Jay Z' (qv)'s album \"American Gangster\" (2007).", "Former member of the National Youth Music Theatre.", "Has been a huge fan of Arsenal Football Club since age 15, although admits only to having gone to two matches. His father is a supporter of Manchester United Football Club (interview on arsenal.com website February 2010).", "Named one of People magazine's 100 Most Beautiful People in the World. [May 2007]", "Became a father for the second time at age 41 when his girlfriend Naiyana Garth gave birth to their son Winston Elba on April 17, 2014.", "In April 2009, The Prince's Trust, which Elba credits with helping to begin his career, appointed him their Anti-Crime Ambassador. In July 2010, he announced his support for Oona King in her campaign to become the Labour Party candidate for Mayor of London in 2012.", "He broke a land speed record, drove a dragster, and piloted an airplane in his miniseries 'Idris Elba' (qv): No Limits (2015). An avid rally fan, he competed in the Irish Tarmac Rally Championship as well as starred in the miniseries, where he races a rally car with help from 'Ari Vatanen' (qv).", "He was awarded the OBE (Officer of the Order of the British Empire) in the 2016 Queen's New Years Honours List for his services to drama. He is an actor in London, England.", "For his work in _Beasts of No Nation (2015)_ (qv), he's the first (and, as 2016, the only) winner of the SAG award for Best Supporting Actor in a motion picture not to receive an Oscar nomination for the same performance.", "Has worked with 'Tom Hardy' (qv) in the crime comedy _RocknRolla (2008)_ (qv). Both stars appeared in the very popular Star Trek series. Tom appeared in _Star Trek: Nemesis (2002)_ (qv) and Idris appeared in _Star Trek Beyond (2016)_ (qv).", "Has played a spaceship commander in two sci-fi films: Captain Janek of the spaceship Prometheus in the movie _Prometheus (2012)_ (qv), and Captain Balthazar Edison of the starship USS Franklin in _Star Trek Beyond (2016)_ (qv).", "Is a member of the Academy of Motion Picture Arts and Sciences (AMPAS) since 2016.", "Named one of Time magazine's 100 Most Influential People in the World. [April 2016]", "Is the only male that has ever appeared on the cover of Maxim magazine.", "'Daniel Craig' (qv) is the person who suggested that Idris could be the next James Bond, saying he would be fantastic.", "Revealed (by not denying) on _The Graham Norton Show (2007)_ (qv) that he has a foot fetish. 'Kate Winslet' (qv) discovered this while filming a love scene for _The Mountain Between Us (2017)_ (qv).", "When he first moved to New York City as a budding actor in the late 1990s, he worked for a time as a bouncer at \"Caroline's Comedy Club\" on Broadway. Has no formal acting training.", "Named one of Time Out magazine's 50 Londoners who made the city awesome and helped to shape the city's cultural landscape for the magazine's 50th anniversary. [September 2018]", "In June 2016, Elba announced his support for the vote to remain in the European Union (EU) for the 2016 United Kingdom European Union membership referendum.", "Nominated for the 2011 Primetime Emmy Award in the Outstanding Guest Actor in a Comedy Series category for his role as Lenny Charles in _The Big C (2010)_ (qv), but lost to 'Justin Timberlake' (qv).", "First met his wife-to-be 'Sabrina Dhowre' (qv) at a party while on location in Vancouver, British Columbia shooting _The Mountain Between Us (2017)_ (qv). In February 2018, the couple announced their engagement in London (UK) and married the following year.", "Not only did he and fiancée 'Sabrina Dhowre' (qv) attend the Royal Wedding of 'Prince Harry' (qv) and 'Meghan Markle' (qv) in May 2018, but Idris also DJ'd the reception at the invitation of Harry and Meghan delivering a customized playlist as ordered by the bride.", "Friends with 'Jamie Foxx' (qv) and 'Chiwetel Ejiofor' (qv).", "Born on the same date as 'Justina Machado' (qv) and 'Anika Noni Rose' (qv)."], "quotes": ["[on the differences between him and his character Stringer Bell from _The Wire (2002)_ (qv)] Stringer is very calculating and he has to be for so many reasons. He will calculate the next steps, shipments, inventory, pays workers... all that. But the wicked part is that he can plan murders because that's a part of his business. I'll tell you, if I, Idris, had to contract for murders as part of my job, I couldn't do it because I have a heart. I have no stomach for ordering other people's deaths. Stringer just gets in there, orders the deed and bam... that's it... it's done and he doesn't think twice about it. There's no way I could be that cold. I'm also a more lively kid out there, doing stuff and I can't just do one thing forever. Stringer is committed to his job and business so much so he doesn't have much of a personal life so he's more one dimensional. As for me I have a child, a life, thirst for travel, you know I'm curious... whereas Stringer is more interested in being the best business person and his interests don't go further than that.", "[on why he uses his American accent when talking to fans of _The Wire (2002)_ (qv)] Wherever I go, the real hardcore drug dealers come up to me and confide in me. I almost feel guilty turning around and saying: \"Ello, mate. My name's Idris and I'm from London.\" I don't want to break the illusion.", "[on the diversity of projects he's been involved with and if there's any kind of role that frightens him] I would never be fearful of any character. I think there's a tendency for actors like myself, and I don't mean to generalize myself, but I've played \"men's men\", if you will, characters that are simmering rage and calculated. There's a trend not to play anything that is opposed to that. I remember when I left Stringer [on HBO's _The Wire (2002)_ (qv)], one of the films I did was Tyler Perry's _Daddy's Little Girls (2007)_ (qv), which was about a man doting over his three little girls. I remember there was talk, \"Why? Would would you do that? Play gangsters. Play ruthless.\" It's really funny because the same people who loved me as Stringer Bell were the same people that were watching Daddy's Little Girls literally in tears. Some people don't like the film, but some of the guys that came up to me and said, \"Yo, I want to see you play gangsters\" were the same ones that were in tears because they had either strained relationships with their children, or they loved their children so much and they were watching a character that they could relate to. I don't mind playing characters that are opposite of what people think I am.", "... For me, it's entertainment. Every single film I've done, it's about the character. I chose these roles, whether it's _Obsessed (2009)_ (qv), whether it's _The Gospel (2005)_ (qv). Not everything is going to be as powerful as some of the more iconic roles. I mean, my two biggest performances to date: One film is called _Sometimes in April (2005)_ (qv), which is a really important film about the Rwandan Genocide, and people don't ever speak about that role, or that film and what it meant to the people of Rwanda. And I have a film that's out now, a small film called _Legacy: Black Ops (2010)_ (qv) [he stars as a former black-ops soldier who was captured and tortured, and returns home to struggle with his paranoia and anxiety and a political conspiracy], but not one bit of acclaim. We actually sent a screener to Roger Ebert this week because he expressed his wish to see it. Not to say he's given his iconic two thumbs up, yet. But I really hope that he does. Michael Moore saw it and loved it. It's a film that critically, in the festival world, has done really well, but again, it's a tiny film and no one wants to write about it because no one really wants to support small-timey films. This character holes himself up in a room for a week, and in this room, he starts to unravel who he is and where he's been. You start to understand that this is a man who's not very well. And then you realize that you're not sure if some of the things we're seeing are real, and in the end, there's a twist. I'm so proud of it, because we made it for no money. [He was also an executive producer on the film.] But I'm also proud of it because it actually does resonate for people who have someone like that in their family, someone who worked in the armed forces and the person that left and the soldier that came back are different. I get criticized for taking roles in films like Ghost Rider 2, but if you look at my résumé, dude, I've mixed it up as much as I can. [laughs] I love to play different roles. That's just the kind of actor I am.", "I'd had three or four years of unemployment, not getting acting jobs. I was watching 'Denzel Washington' (qv) and 'Wesley Snipes' (qv) and saying, \"I can do that. I can be right there with them.\" My wife was about eight and a half months pregnant by the time I got the news I was going to be on _The Wire (2002)_ (qv). If I didn't get it, I was going to leave the US. We knew that if I didn't have acting work after my daughter was born we would be up shit street.", "By the way, you know I've never watched _The Wire (2002)_ (qv). I've seen a full episode at screenings but never at home. I've never watched an entire season. I've not seen any episode of season two, most of season three and none of seasons four and five. I'm supercritical of my own work. As an actor, if you're being told how wonderful you are, what do you need to strive for? I don't know if I'm good just because some critic says I am in the press.", "[on being considered a sex symbol] Look, when I wasn't on television or in films, I didn't get any special attention when I went out. Some beautiful people always attract attention. I didn't until I got on television. So I'm on these lists only because I'm on television. It happens to me all the time, still. I'll sit in a pub and nobody will recognize me. I might see an attractive woman, but she doesn't recognize me, so I'm not getting any love. Then one person goes, \"Oh, it's you,\" and suddenly, they all overhear and start asking questions. It's bullshit.", "[on creating the persona of 'Nelson Mandela' (qv) for the screen biography] Not having met the man, my dad does remind me of what I imagine him to be in person: the presence, the humor and the way he moves - elegant, but at the same time sturdy, a rock-solid guy. I channeled my dad's energies because he was a big fan of Mr. Mandela and a union guy who struggled for the working man. Instead of a liberation struggle, his struggle was \"My guys deserve steel-toed boots and a lunch break.\" But Mandela was always part of the discussion.", "[on spending a night alone on Robbens Island in what was once 'Nelson Mandela' (qv)'s isolated cell for 18 years] The place is haunted. At one point, I started to nod off, and this freezing breeze passed my face - it was the end of summer, not cold out at all - and it woke me up, the hairs on the back of my neck standing up. I guarantee you it was a spirit.", "[on shooting _Ghost Rider: Spirit of Vengeance (2011)_ (qv)] 'Nicolas Cage' (qv) came back one day on set, and he came down to set and he looked a little bit tired, a little bit - kind of like he had been up all night. So I was like \"Hey Nic, man, how you doing man?\" and he said \"I'm alright,\" and I said \"You seem a little spooked out,\" and he said \"Yeah man, I went up to Dracula's castle... the ruins up in the mountains, and I stayed the night,\" and I said \"What?! Why?\" and he said \"I just had to channel the energy, and it was pretty spooky up there.\" We were shooting in Romania, Transylvania, and he just went up there to spend the night, as you do. And then he walked away. True story.", "The underlying issues of _The Wire (2002)_ (qv) are not a million miles from what British kids are dealing with today. The show is recognized for its realistic portrayal of urban life where kids hang around on corners with nothing to do. They are handpicked by gangsters that offer them quick money for dirty jobs - this is very similar to the gang and drug culture emerging in some of the UK's biggest cities.", "[on his role in _Star Trek Beyond (2016)_ (qv)] I play Krall. This is a man with a definite purpose. I say a man, but he's not a man. Or is he? What's interesting about him is that he has a real beef with what the Enterprise stands for. Krall's a character who's deeply steeped in hatred - in my opinion, a well-earned hatred - for the Federation. It felt quite political. There's a relatability to what's happening in our world. Not everybody's happy with what everybody calls the good guys."], "birth date": "1972-09-06", "birth notes": "Hackney, London, England, UK", "_actorID": "90", "_source": "IMDB", "actorID": "0252961", "created_utc_dt": "09/14/2019, 13:02:35"}