{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQwMTk3NDU2OV5BMl5BanBnXkFtZTcwNTA3MTI0Mw@@._V1_UY98_CR1,0,67,98_AL_.jpg", "nick names": ["Sly", "Michael", "The Italian Stallion", "Binky", "Sly Stallone"], "birth name": "Sylvester Enzio Stallone", "height": "5' 9½\" (1.77 m)", "mini biography": ["This athletically built, dark-haired American actor/screenwriter/director may never be mentioned by old-school film critics in the same breath as, say, 'Richard Burton' (qv) or 'Alec Guinness' (qv); however, movie fans worldwide have been flocking to see Stallone's films for over 30 years, making \"Sly\" one of Hollywood's biggest-ever box office draws.'Sylvester Stallone' (qv) was born on July 6, 1946, in New York's gritty Hell's Kitchen, to 'Jackie Stallone' (qv) (née Labofish), an astrologer, and 'Frank Stallone' (qv), a beautician and hairdresser. His father was an Italian immigrant, and his mother's heritage is half French (from Brittany) and half German. The young Stallone attended the American College of Switzerland and the University of Miami, eventually obtaining a B.A. degree. Initially, he struggled in small parts in films such as the soft-core _The Party at Kitty and Stud's (1970)_ (qv), the thriller _Klute (1971)_ (qv) and the comedy _Bananas (1971)_ (qv). He got a crucial career break alongside fellow young actor 'Henry Winkler' (qv), sharing lead billing in the effectively written teen gang film _The Lords of Flatbush (1974)_ (qv). Further film and television roles followed, most of them in uninspiring productions except for the opportunity to play a megalomaniac, bloodthirsty race driver named \"Machine Gun Joe Viterbo\" in the 'Roger Corman' (qv)-produced _Death Race 2000 (1975)_ (qv). However, Stallone was also keen to be recognized as a screenwriter, not just an actor, and, inspired by the 1975 'Muhammad Ali' (qv)-'Chuck Wepner' (qv) fight in Cleveland, Stallone wrote a film script about a nobody fighter given the \"million to one opportunity\" to challenge for the heavyweight title. _Rocky (1976)_ (qv) became the stuff of cinematic legends, scoring ten Academy Award nominations, winning the Best Picture Award of 1976 and triggering one of the most financially successful movie franchises in history! Whilst full credit is wholly deserved by Stallone, he was duly supported by tremendous acting from fellow cast members 'Talia Shire' (qv), 'Burgess Meredith' (qv) and 'Burt Young' (qv), and director 'John G. Avildsen' (qv) gave the film an emotive, earthy appeal from start to finish. Stallone had truly arrived on his terms, and offers poured in from various studios eager to secure Hollywood's hottest new star.Stallone followed _Rocky (1976)_ (qv) with _F.I.S.T. (1978)_ (qv), loosely based on the life of Teamsters boss \"Jimmy Hoffa\", and _Paradise Alley (1978)_ (qv) before pulling on the boxing gloves again to resurrect Rocky Balboa in the sequel _Rocky II (1979)_ (qv). The second outing for the \"Italian Stallion\" wasn't as powerful or successful as the first \"Rocky\"; however, it still produced strong box office. Subsequent films _Nighthawks (1981)_ (qv) and _Victory (1981)_ (qv) failed to ignite with audiences, so Stallone was once again lured back to familiar territory with _Rocky III (1982)_ (qv) and a fearsome opponent in \"Clubber Lang\" played by muscular ex-bodyguard 'Mr. T' (qv). The third \"Rocky\" installment far outperformed the first sequel in box office takings, but Stallone retired his prizefighter for a couple of years as another mega-franchise was about to commence for the busy actor.The character of Green Beret \"John Rambo\" was the creation of Canadian-born writer 'David Morrell' (qv), and his novel was adapted to the screen with Stallone in the lead role in _First Blood (1982)_ (qv), also starring 'Richard Crenna' (qv) and 'Brian Dennehy' (qv). The movie was a surprise hit that polarized audiences because of its commentary about the Vietnam war, which was still relatively fresh in the American public's psyche. Political viewpoints aside, the film was a worldwide smash, and a sequel soon followed with _Rambo: First Blood Part II (1985)_ (qv), which drew even stronger criticism from several quarters owing to the film's plotline about American MIAs allegedly being held in Vietnam. But they say there is no such thing as bad publicity, and \"John Rambo's\" second adventure was a major money spinner for Stallone and cemented him as one of the top male stars of the 1980s. Riding a wave of amazing popularity, Stallone called on old sparring partner Rocky Balboa to climb back into the ring to defend American pride against a Soviet threat in the form of a towering Russian boxer named \"Ivan Drago\" played by curt 'Dolph Lundgren' (qv) in _Rocky IV (1985)_ (qv). The fourth outing was somewhat controversial with \"Rocky\" fans, as violence levels seemed excessive compared to previous \"Rocky\" films, especially with the savage beating suffered by Apollo Creed, played by 'Carl Weathers' (qv), at the hands of the unstoppable \"Siberian Express\".Stallone continued forward with a slew of macho character-themed films that met with a mixed reception from his fans. _Cobra (1986)_ (qv) was a clumsy mess, _Over the Top (1987)_ (qv) was equally mediocre, _Rambo III (1988)_ (qv) saw Rambo take on the Russians in Afghanistan, and cop buddy film _Tango & Cash (1989)_ (qv) just did not quite hit the mark, although it did feature a top-notch cast and there was chemistry between Stallone and co-star 'Kurt Russell' (qv).Philadelphia's favorite mythical boxer moved out of the shadows for his fifth screen outing in _Rocky V (1990)_ (qv) tackling Tommy \"Machine\" Gunn played by real-life heavyweight fighter 'Tommy Morrison' (qv), the great-nephew of screen legend 'John Wayne' (qv). Sly quickly followed with the lukewarm comedy _Oscar (1991)_ (qv), the painfully unfunny _Stop! Or My Mom Will Shoot (1992)_ (qv), the futuristic action film _Demolition Man (1993)_ (qv), and the comic book-inspired _Judge Dredd (1995)_ (qv). Interestingly, Stallone then took a departure from the gung-ho steely characters he had been portraying to stack on a few extra pounds and tackle a more dramatically challenging role in the intriguing _Cop Land (1997)_ (qv), also starring 'Robert De Niro' (qv) and 'Ray Liotta' (qv). It isn't a classic of the genre, but _Cop Land (1997)_ (qv) certainly surprised many critics with Stallone's understated performance. Stallone then lent his vocal talents to the animated adventure story _Antz (1998)_ (qv), reprised the role made famous by 'Michael Caine' (qv) in a terrible remake of _Get Carter (2000)_ (qv), climbed back into a race car for _Driven (2001)_ (qv), and guest-starred as the \"Toymaker\" in the third chapter of the immensely popular \"Spy Kids\" film series, _Spy Kids 3-D: Game Over (2003)_ (qv). Showing that age had not wearied his two most popular franchises, Stallone has most recently brought back never-say-die boxer Rocky Balboa to star in, well, what else but _Rocky Balboa (2006)_ (qv), and Vietnam veteran _Rambo (2008)_ (qv) will reappear after a 20-year hiatus to once again right wrongs in the jungles of Thailand.Love him or loathe him, 'Sylvester Stallone' (qv) has built an enviable and highly respected career in Hollywood; plus, he has considerably influenced modern popular culture through several of his iconic film characters.::firehouse44@hotmail.com"], "spouse": ["'Jennifer Flavin' (qv)::(17 May 1997 - present) ( 3 children)", "'Brigitte Nielsen' (qv)::(15 December 1985 - 13 July 1987) ( divorced)", "'Sasha Czack' (qv)::(28 December 1974 - 14 February 1985) ( divorced) ( 2 children)"], "trade mark": ["Deep resonant voice and mumbling", "Very muscular physique", "Roles as John Rambo and Rocky Balboa", "Crooked mouth"], "trivia": ["Oil paints in his spare time and considers 'Leonardo Da Vinci' his personal hero.", "On 27 June 1998, his second daughter, 'Sistine Rose Stallone' (qv) was born to third wife, 'Jennifer Flavin' (qv).", "Ranked #92 in Empire (UK) magazine's list of \"The Top 100 Movie Stars of All Time\". [October 1997]", "Daughter 'Sophia Rose Stallone' (qv), 2-1/2, by wife 'Jennifer Flavin' (qv). undergoes open heart surgery at UCLA Medical Center. The procedure went well. [November 1996]", "On August 27th, 1996, his first daughter 'Sophia Rose Stallone' (qv) was born with fiancée, 'Jennifer Flavin' (qv).", "Was part owner of the Planet Hollywood restaurant chain with 'Bruce Willis' (qv) and 'Arnold Schwarzenegger' (qv).", "Birth complications, caused by forceps, resulted in paralysis of the lower left side of his face, manifested by a perennial snarl and slurred speech.", "He sued writer Peter \"Taki\" Theodoracopulos and the British magazine \"The Spectator\" in 1991 for suggesting he acted in a cowardly and hypocritical way when he \"ducked the Vietnam War.\" He won the case.", "At 15, his classmates voted him the one \"most likely to end up in the electric chair.\"", "Second son 'Seargeoh Stallone' (qv) (b. 1979) is autistic.", "Stallone was paid a mere $60,000 to do _Cop Land (1997)_ (qv). It is said that he did the film to play a serious role and escape his action hero cast type.", "Listed as one of twelve \"Promising New Actors of 1976\" in John Willis' Screen World, Vol. 28.", "Brother of 'Frank Stallone' (qv), 'Toni D'Alto' (qv) and Dante Stallone.", "Father of 'Sage Stallone' (qv), who has acted with him in _Rocky V (1990)_ (qv) and also _Daylight (1996)_ (qv).", "Cousin of 'Paul Dion Monte' (qv).", "His Miami 24,000-square-foot villa and its three guest houses sold after two years on the market for $24 million.", "Dislikes his first name, usually referred to as \"Sly.\"", "His mother, 'Jackie Stallone' (qv), is a fan of 'Jackie Chan' (qv). Chan and Stallone are very good friends.", "Sued by model Margie Carr, who contends that he tried to force her to have physical relations with him last year at a Santa Monica Gym. [February 2001]", "Born on the same day as President 'George W. Bush' (qv) and 'Fred Dryer' (qv).", "14 February 2002 - Sylvester sued his former business manager, Kenneth Starr, for giving him bad business advice. He claims $17M in damages. Part of the advice was for him to hold onto his shares in Planet Hollywood, the now bankrupt restaurant chain, despite it already being in a financial bind.", "His father 'Frank Stallone' (qv) was a hairdresser and mother 'Jackie Stallone' (qv) is a larger-than-life eccentric who's also sought fame as an astrologer and women's wrestling promoter. Her maiden name is Labofish.", "Created and produced a TV series pilot called \"Father Lefty\", with star 'Danny Nucci' (qv) as an offbeat Miami priest. The pilot aired on CBS in 2002, but was not picked up as a series.", "Has a half-sister 'Toni D'Alto' (qv) (Toni Anne Filiti), the daughter of his mother 'Jackie Stallone' (qv) and her second husband, Tony Filiti.", "3rd child 'Scarlet Rose Stallone' (qv), with wife 'Jennifer Flavin' (qv), was born on 25 May 2002 in Los Angeles, weighing 7 lbs, 8 oz.", "Has a total of five children: 'Sage Stallone' (qv) and 'Seargeoh Stallone' (qv) with first wife 'Sasha Czack' (qv) and 'Sophia Rose Stallone' (qv), 'Sistine Rose Stallone' (qv) and 'Scarlet Rose Stallone' (qv) with third wife 'Jennifer Flavin' (qv).", "Former brother-in-law of 'Louis D'Alto' (qv) and 'Markus Schaub' (qv).", "Was 23 years old when he got his first starring role in the softcore porno _The Party at Kitty and Stud's (1970)_ (qv) (which was re-released and renamed \"The Italian Stallion\" after his success with _Rocky (1976)_ (qv)), in which he played the role of Stud The Italian Stallion. He was paid $200 to play the sex-craved gigolo and appeared nude.", "Sylvester's father, 'Frank Stallone' (qv), was an Italian emigrant, born in Gioia del Colle, Apulia, to Silvestro Stallone and Pulcheria Nicastri. Sylvester's mother, 'Jackie Stallone' (qv), was born Jacqueline Labofish in Washington, D.C. Sylvester's maternal grandfather, John Paul Labofish, was born in Pennsylvania, to emigrants from the Russian Empire, Charles Schachan Labofish/Labofisz and Rose Ethel Lemlich/Lamlec. Sylvester's maternal grandmother, Jeanne Victoria Adrienne Anne Clérec, was French, born in Brittany, France, to Louis Victor Clérec and Marie Pauline Rodrigue.", "Attended the University of Miami on an athletic scholarship", "Went to Montgomery Blair High School in Silver Spring, Maryland. Among his classmates were 'Goldie Hawn' (qv), 'Carl Bernstein' (qv) and 'Ben Stein' (qv).", "On 5 June 1994 he broke up with then-girlfriend 'Jennifer Flavin' (qv) by sending her a \"Dear Jane\" letter via FedEx. They reconciled after one year, on 5 June 1995 and married on 17 May 1997.", "Has his look-alike puppet in the French show _Les Guignols de l'info (1988)_ (qv).", "Entered into the house of Big Brother VIP 2 (Mexico) for a few minutes as a special guest. He was in Mexico promoting _Spy Kids 3-D: Game Over (2003)_ (qv) and was invited to participate.", "He was considered for 'Patrick Swayze' (qv)'s role in _Next of Kin (1989)_ (qv).", "As of 2004 is the all time Razzie Award champion, with a record 30 nominations and 10 \"wins\", more than any other person in history.", "Mother 'Jackie Stallone' (qv) was a fan of 'Tyrone Power' (qv) and had originally named him Tyrone Stallone, but when she got the birth certificate it had been changed by Sly's father 'Frank Stallone' (qv) to Sylvester Gardenzio Stallone.", "Has the distinction of appearing in three of the 100 Most Enjoyably Awful Movies of All Time as listed in Razzie Award-founder 'John Wilson' (qv)'s book, \"The Official Razzie Movie Guide\": _Rhinestone (1984)_ (qv), _Rambo: First Blood Part II (1985)_ (qv)) and _The Specialist (1994)_ (qv). He is thus tied with 'Joseph Cotten' (qv) for having the second most titles among the 100. 'Ernest Borgnine' (qv) has the most, appearing in four of the 100 titles.", "Stepson of Anthony 'Tony' Filiti & Stephen Marcus Levine.", "Oddly, 1994 was one of the few years he was not nominated for an acting Razzie Award, even though he had appeared in both _Cliffhanger (1993)_ (qv) and _Demolition Man (1993)_ (qv), which had been nominated, with \"Cliffhanger\" receiving a nomination for Worst Screenplay, which Stallone had written himself.", "The ten awards from the Razzies that he's \"won\" so far are Worst Actor of 1985 for _Rhinestone (1984)_ (qv), Worst Actor of 1986 for both _Rambo: First Blood Part II (1985)_ (qv) and _Rocky IV (1985)_ (qv), Worst Director of 1986 for _Rocky IV (1985)_ (qv), Worst Screenplay of 1986 with 'James Cameron' (qv) and 'Kevin Jarre' (qv) for _Rambo: First Blood Part II (1985)_ (qv), Worst Actor of 1989 for _Rambo III (1988)_ (qv), Worst Actor of the Decade (1980s), Worst Actor of 1993 for _Stop! Or My Mom Will Shoot (1992)_ (qv), Worst Screen Couple of 1995 with 'Sharon Stone' (qv) in _The Specialist (1994)_ (qv), Worst Actor of the Century, and Worst Supporting Actor of 2004 for _Spy Kids 3-D: Game Over (2003)_ (qv).", "According to Anthony Holden's \"Behind the Oscar\" (New York: Simon & Shuster, 1993), the great 'Frank Capra' (qv) was enlisted in the Oscar campaign for the original _Rocky (1976)_ (qv). Capra was quoted as saying, \"I think it's the best picture in the last ten years. It's got my vote for the Oscars all the way down the line.\"", "He joins 'Roberto Benigni' (qv), 'Prince' (qv), 'Kevin Costner' (qv), 'William Shatner' (qv), and 'Tom Green' (qv) as being the only actors to direct themselves in performances that would \"win\" them a Razzie Award for Worst Actor.", "Attended the first inauguration of President 'George W. Bush' (qv) along with other long-time Republican supporters 'Chuck Norris' (qv) and 'Robert Duvall' (qv). (January 20th 2001)", "In April 2004 he formed his own nutrition company InStone, that produces protein pudding, a testosterone booster, an energy booster and two different protein shakes.", "On 8 March 2005 he appeared in his first magazine issue of Sly which came out monthly. He was on the cover of every magazine and did most of the articles and interviews himself.", "On 10 May 2005 he published his book \"Sly Moves: My Proven Program to Lose Weight, Build Strength, Gain Will Power, and Live Your Dream\".", "Listed as one of the top heroes of all time by the American film Institute (AFI) on 2003, he listed seventh behind 'Gregory Peck' (qv), 'Harrison Ford' (qv), 'Sean Connery' (qv), 'Humphrey Bogart' (qv), 'Gary Cooper' (qv) and 'Jodie Foster' (qv).", "Had a huge fan following from Bollywood Asia. Film stars like 'Salman Khan' (qv), 'Sunny Deol' (qv), 'Bobby Deol' (qv), 'Dharmendra' (qv), 'Sanjay Dutt' (qv), 'Sunil Shetty' (qv) and 'Hrithik Roshan' (qv) are his die-hard fans. 'Sunny Deol' (qv) even named one of his sons \"Rocky\".", "A noted fan of cigar smoking, he quit smoking cigarettes while filming _Rocky (1976)_ (qv) when he was thirty after he found himself getting out of breath in the ring.", "Is a fan of \"Bollywood\" movies", "Holds the record for the longest unbroken streak of nominations at the Razzie 'Awards' (qv) - thirteen straight years. He received a Razzie Nomination every year (mostly for Worst Actor) from 1985 to 1997.", "Did all of his own singing in _Rhinestone (1984)_ (qv).", "In 1988 he was offered $4 million to do an advert for an American beer commercial under the condition that he cut his hair; when he refused they offered a further $1 million to go to the barber - he still refused.", "Stallone has never recaptured the critical success he won initially after _Rocky (1976)_ (qv), when 'Roger Ebert' (qv) said he could be the next 'Marlon Brando' (qv). He has been nominated a record 30 times for the Golden Raspberry 'Awards' (qv), usually in the \"Worst Actor\" category, and has won 10 times. The Golden Raspberry Award Foundation awarded him a special \"Worst Actor of the Century\" award in 2000.", "The voice of Lou the cop in _The Simpsons (1989)_ (qv) is based on him.", "Was said to have only $106 in his bank account at the time the _Rocky (1976)_ (qv) project was given the green light by producer 'Irwin Winkler' (qv).", "He was presented with a certificate of recognition by California Gov. 'Arnold Schwarzenegger' (qv) for filming _Rocky Balboa (2006)_ (qv) in Los Angeles at a time when other filmmakers are moving their business to cheaper states or overseas locations to cut costs. (22 December 2005).", "Along with 'Bruce Willis' (qv), he is a staunch supporter of the Republican party.", "In the 1950s he and his brother 'Frank Stallone' (qv) lived in Philadelphia with their mother 'Jackie Stallone' (qv) for approximately two years and attended Notre Dame Academy, a private Catholic school on Rittenhouse Square in center city (no longer there). It is the same school that 'John Barrymore' (qv) and 'Ethel Barrymore' (qv) had once attended.", "In 1986, following the enormous success of _Rambo: First Blood Part II (1985)_ (qv), Stallone was received at the White House by President 'Ronald Reagan' (qv).", "Turned down the lead role in _Coming Home (1978)_ (qv) (for which 'Jon Voight' (qv) won an Oscar).", "Received the first Boxing Writers Association of America's award for lifetime cinematic achievement in boxing at the organization's 81st annual 'Awards' (qv) Dinner at the Mandalay Bay Resort and Casino in Las Vegas. (5 May 2006)", "Moved to Philadelphia in the early 1960s, living in Frankford and Rittenhouse Square. He went to Lincoln High School but never completed 10th grade. In 1963 he enrolled in the Devereux Manor High School in Berwyn, Chester County, a school for emotionally troubled youths.", "At the age of five, he returned to live with his parents and younger brother 'Frank Stallone' (qv), this time in Silver Springs, Maryland. After his parents divorced, he moved with his mother and her new husband, a pizza manufacturer, Anthony 'Tony' Filiti, to Philadelphia.", "He was honored by the Video Dealers Software Association when he was presented with the \"Action Star of the Millennium Award\" at the organization's 21st Annual Convention in Las Vegas, NV. [July 2002]", "In 1971 he auditioned for a small part in 'Francis Ford Coppola' (qv)'s _The Godfather (1972)_ (qv) but didn't get it. He decided he might have better luck as a writer. He wrote the screenplay for the modestly successful _The Lords of Flatbush (1974)_ (qv) and had a featured role in the film.", "He was a manager for the 'Lee Canalito' (qv) vs. Curtis Whitner Boxing Match on his 36th birthday in July 6th, 1982, at the Tropicana Hotel & Casino, Atlantic City, NJ. His brother 'Frank Stallone' (qv) was a corner man for Canalito in this match.", "He and 'Dolly Parton' (qv) honored with stars on the Hollywood Walk of Fame (June 14, 1984).", "His performance as Rocky Balboa in the \"Rocky\" movies is ranked #64 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "_Rocky (1976)_ (qv) is ranked #4 on the American Film Institute's 100 Most Inspiring Movies of All Time.", "The wax figure portraying Stallone as Rocky Balboa at the now defunct Movieland Wax Museum (Buena Park, California) was 5' 7\" tall.", "His full frontal nude scene was edited out of _Demolition Man (1993)_ (qv) prior to release, but can be viewed on the Internet.", "He turned down 'Jon Voight' (qv)'s role in _Coming Home (1978)_ (qv).", "A lifelong Republican, he is one of President 'George W. Bush' (qv)'s two favorite actors. The other is fellow action hero and conservative Republican 'Chuck Norris' (qv). Both men attended Bush's inauguration as President in 2001.", "Despite his long association with the Republican Party, Stallone supported President 'Bill Clinton' (qv) during his impeachment trial and hosted a Democratic fund raiser at his Miami home on 9 July 1998.", "Supported Republican candidate 'Arnold Schwarzenegger' (qv) in his re- election bid for Governor of California in 2006, and donated $15,000 to his campaign.", "Godfather of his son 'Sage Stallone' (qv) was his best friend 'Joe Spinell' (qv).", "In 1998, following the murder of his friend 'Phil Hartman' (qv), Stallone, then living in England, called for America to ban all guns. This caused some controversy, since he had used guns in many of his movies.", "All his children's names begin with the letter \"S\": Sage, Sargeoh, Sophia, Sistine and Scarlet.", "Is a fan of the English soccer team Everton FC.", "Was offered the role of Stuntman Mike in _Death Proof (2007)_ (qv), but turned it down.", "Pleaded guilty to bringing vials of restricted muscle-building hormones into Australia and faces sentencing next week. Lawyers for Stallone entered the guilty pleas on behalf of the actor, who did not appear before Sydney's Downing Center Local Court. The star was accused of bringing banned substances into Australia after a customs search of his luggage during a 16 February 2007 visit to Sydney revealed 48 vials of the human growth hormone product, Jintropin. (14 May 2007).", "Stallone claims to have been able to bench press 385-400 lbs (174.6-181.4 kg) and squat 500 lbs (226.8 kg) in his prime. While in a bench pressing contest with former Mr Olympia 'Franco Columbu' (qv), he severely tore his pectoral muscle and needed over 160 stitches on it. This is why one half of his chest is more veiny than the other.", "Is a close friend and fan of Sir 'Elton John' (qv).", "Was 'Joel Schumacher' (qv)'s second choice to play Mr. Freeze in _Batman & Robin (1997)_ (qv).", "Turned down 'Christopher Reeve' (qv)'s role in _Superman (1978)_ (qv).", "Publicly endorsed Senator 'John McCain' (qv) as his choice for Republican candidate in the 2008 presidential election.", "Expelled from 14 schools for antisocial and violent behavior before the age of 13.", "Born in the charity ward of a hospital in the New York ghetto of Hell's Kitchen. At his birth, the doctor's forceps accidentally severed a nerve in his cheek, leaving him with his trademark droopy mouth.", "Was voted the pupil most likely to die in the electric chair.", "Along with 'Jon Voight' (qv) and 'Paula Abdul' (qv), took part in a fundraising, solidarity concert for the besieged Israeli city of Sderot, which has been hit by more than 7,000 Kassam rockets in the past seven years. Entitled \"Live for Sderot,\" the concert features a performance by Israeli singer 'Ninet Tayeb' (qv). (2 March 2008).", "Was considered for the role of \"Joey Zasa\" in _The Godfather: Part III (1990)_ (qv).", "Dated 'Janice Dickinson' (qv) from December 1993 to July 1994. Sly thought that he was the father of her daughter 'Savannah Rodin' (qv), but when he discovered that the real father of girl was 'Michael Birnbaum' (qv), he left her.", "He was considered for 'Michael Douglas' (qv)' roles in _Fatal Attraction (1987)_ (qv) and _Basic Instinct (1992)_ (qv).", "Turned down the 'Dudley Moore' (qv) role in _Arthur (1981)_ (qv).", "Turned down the role played by 'Keith Carradine' (qv) in _Pretty Baby (1978)_ (qv).", "Turned down the roles played by 'Richard Gere' (qv) in _American Gigolo (1980)_ (qv), _An Officer and a Gentleman (1982)_ (qv) and _Pretty Woman (1990)_ (qv).", "He will receive the prestigious Jaeger-LeCoultre Glory to the Filmmaker Award, at the Venice Film Festival in September 2009, which is awarded to an artist who has \"left his mark in contemporary cinema\" and has previously been given to cinema heavyweights such as 'Takeshi Kitano' (qv) and 'Abbas Kiarostami' (qv). The prize intends to celebrate Stallone's stature as a filmmaker. A festival spokesman said: \"Stallone has shown an original eye and an auteur's determination.\".", "Lives in Beverly Hills, California.", "_The Expendables (2010)_ (qv) opened at number one at the U.S. box office with a first weekend gross of $35 million. This makes 'Sylvester Stallone' (qv) the only person in Hollywood history to have starred in films that have opened atop the box office charts over five consecutive decades.", "In 1992, he was due to star in a feuding neighbors comedy with 'John Candy' (qv) called Bartholomew vs Neff. The script was written by the late 'John Hughes' (qv) for the then-mighty Carolco studios. Stallone chose to do _Cliffhanger (1993)_ (qv) for Carolco instead and the project was shelved after 'John Candy' (qv) died in 1994 and Carolco went bust in 1996. The movie remains unproduced to this day.", "Was inspired in high school to adopt bodybuilding into his lifestyle, after watching 'Steve Reeves' (qv)' film, _Hercules Unchained (1959)_ (qv).", "Before _Rocky (1976)_ (qv), he played a character, nicknamed \"Rocky\", in the _Police Story (1973)_ (qv) episode, _Police Story: The Cutting Edge (1975)_ (qv).", "Is good friends with 'Arnold Schwarzenegger' (qv) 'Bruce Willis' (qv), 'Don Johnson' (qv), 'Milo Ventimiglia' (qv), and 'Tom Arnold' (qv).", "His son, 'Sage Stallone' (qv), was found dead on July 13, 2012 in Los Angeles.", "His publicist is 'Michelle Bega' (qv).", "Since his evolution to fame and fortune, he stopped going to church. But in 2006, he came back to the Catholic church when he started filming \"Rocky Balboa\".", "The longest he has gone without a Razzie nomination is 7 years, between _Spy Kids 3-D: Game Over (2003)_ (qv) and _The Expendables (2010)_ (qv).", "After 7 years of fruitless struggle and with only $115 in the bank he turned down a $330,000 offer for his Rocky screenplay and earned $230 a week starring in it himself.", "He turned down the lead role in _The Driver (1978)_ (qv) as he was busy with _F.I.S.T. (1978)_ (qv).", "He was inducted 'Hulk Hogan' (qv) (Terry Bolea) in the WWE Hall of Fame, as part of the Class of 2005. This is the first time between these two that wrestling fans had seen them together since _Rocky III (1982)_ (qv).", "He was considered for 'Arnold Schwarzenegger' (qv)'s roles in _Conan the Barbarian (1982)_ (qv), _Black Rain (1989)_ (qv), and _The Terminator (1984)_ (qv).", "Only Hollywood star to have box office hit movies in each of 5 consecutive decades (1970s-2010s).", "Stallone reportedly turned down playing Stanley in a remake of _A Streetcar Named Desire (1984)_ (qv), a part eventually played by 'Treat Williams' (qv).", "He auditioned for the roles of Paulie Gatto and Carlo Rizzi in _The Godfather (1972)_ (qv) before 'John Martino' (qv) and 'Gianni Russo' (qv) were cast respectively.", "The middle name of his late son 'Sage Stallone' (qv) was Moonblood.", "He said it was a stroke of good luck that got _Rocky (1976)_ (qv) made. He met with the producers to audition for another film, but was turned down for the part. In the course of conversation Stallone said that he was not only an actor, but also a writer. As he started to leave the room, the producers asked him if he was working on any scripts. That's when Stallone pitched them the story for _Rocky (1976)_ (qv) and the producers asked to read the script. Stallone has mentioned this anecdote as an example of the adage \"Luck happens when preparation meets opportunity.\".", "Along with 'Barry Fitzgerald' (qv) and 'Al Pacino' (qv), he is one of only three actors to receive Oscar nominations for both Best Actor and Best Supporting Actor for playing the same character: (1) Fitzgerald was nominated for both awards for playing Father Fitzgibbon in _Going My Way (1944)_ (qv), (2) Pacino was nominated for Best Supporting Actor for playing Michael Corleone _The Godfather (1972)_ (qv) and Best Actor for the same role in _The Godfather: Part II (1974)_ (qv) and (3) Stallone was nominated for Best Actor for playing Rocky Balboa in _Rocky (1976)_ (qv) and Best Supporting Actor for the same role in _Creed (2015)_ (qv).", "He is only one of six performers to be nominated for an Oscar twice for playing the same role in two separate films. He was nominated as Rocky Balboa in _Rocky (1976)_ (qv) and _Creed (2015)_ (qv). The other five are 'Bing Crosby' (qv) as Father O'Malley in _Going My Way (1944)_ (qv) and _The Bells of St. Mary's (1945)_ (qv), 'Peter O'Toole' (qv) as Henry II in _Becket (1964)_ (qv) and _The Lion in Winter (1968)_ (qv), 'Al Pacino' (qv) as Michael Corleone in _The Godfather (1972)_ (qv) and _The Godfather: Part II (1974)_ (qv), 'Paul Newman' (qv) as Fast Eddie Felson in _The Hustler (1961)_ (qv) and _The Color of Money (1986)_ (qv), and 'Cate Blanchett' (qv) as Elizabeth I in _Elizabeth (1998)_ (qv) and _Elizabeth: The Golden Age (2007)_ (qv). Of these, 'Sylvester Stallone' (qv) is the only one not to be nominated for acting in any other movie role.", "The 39-year hiatus between his Academy Award nominations (_Rocky (1976)_ (qv); _Creed (2015)_ (qv)) is a record. The previous record of 38 years was held by 'Helen Hayes' (qv) (1931/32; 1970), 'Jack Palance' (qv) (1953; 1991) and 'Alan Arkin' (qv) 1968; 2006).", "He has played the same character (Rocky Balboa) in films released in five different decades from the 1970s to the 2010s: _Rocky (1976)_ (qv), _Rocky II (1979)_ (qv), _Rocky III (1982)_ (qv), _Rocky IV (1985)_ (qv), _Rocky V (1990)_ (qv), _Rocky Balboa (2006)_ (qv) and _Creed (2015)_ (qv).", "Oscar-nominated a second time in 2016 for his performance as Rocky Balboa in _Creed (2015)_ (qv) at the age of 69, the same age as 'Burgess Meredith' (qv) when he was nominated for his performance as Mickey Goldmill in _Rocky (1976)_ (qv), and also for playing the coach.", "Two of his real life sons played his character Rocky Balboa's son Robert Balboa, Jr. in the \"Rocky\" film series: 'Seargeoh Stallone' (qv) in _Rocky II (1979)_ (qv) and 'Sage Stallone' (qv) in _Rocky V (1990)_ (qv).", "Holds the record for the longest unbroken streak of nominations at the Razzie awards (13 years). He was nominated every year from 1985 to 1997.", "He became a boxing promoter in the 1980s. His boxing promoting company, \"Tiger Eye Productions\", signed world champion boxers Sean O'Grady and Aaron Pryor.", "Was going to have a cameo in _UHF (1989)_ (qv) as a ticket taker for the helicopter rides (in the _Rambo (1987)_ (qv) spoof) but was unavailable.", "After Stallone's request that his acting and life experiences be accepted in exchange for his remaining needed college credits to graduate, he was granted a Bachelor of Fine Arts (BFA) degree by the president of the University of Miami, in 1999.", "In 1994, Stallone contributed $1,000 to the campaign of then-Congressman Rick Santorum, who was then running for the United States Senate in Pennsylvania.", "He turned down 'John Travolta' (qv)'s role in _Face/Off (1997)_ (qv).", "In 2009, he was going to direct and star in _Death Wish (2018)_ (qv). He backed out due to \"creative differences\".", "In November 2017, a woman accused Stallone of sexually assaulting her at his Santa Monica office in the early 1990s. Stallone denied the claim.", "His 48-year-old half-sister, Toni Ann Filiti, died of lung cancer on August 26, 2012, six weeks after the death of his son, Sage. She died at their mother 'Jackie Stallone' (qv)'s Santa Monica home, after choosing to leave UCLA hospital.", "He turned down 'Jean-Claude Van Damme' (qv)'s role in _Sudden Death (1995)_ (qv) because he didn't like the quality of the script.", "During the filming of _Victory (1981)_ (qv), Stallone broke a finger trying to save a penalty kick from 'Pelé' (qv).", "In 2007, customs officials in Australia discovered 48 vials of the synthetic human growth hormone Jintropin in his luggage.", "He mentioned that he would like to adapt 'Nelson DeMille' (qv)'s novel, \"The Lion's Game\", and 'James Byron Huggins' (qv)' novel, \"Hunter\", for which he had the film rights several years; he originally planned to use the plot from \"Hunter\" for _Rambo: Last Blood (2019)_ (qv).", "He turned down 'Harrison Ford' (qv)'s role in _Witness (1985)_ (qv).", "He turned down 'Samuel L. Jackson' (qv)'s role in _Rules of Engagement (2000)_ (qv).", "Despite his otherwise Republican views, he is an advocate for gun control and has been described as \"the most anti-gun person working in Hollywood today\".", "Stallone has continued to express his passion in directing a film on 'Edgar Allan Poe' (qv)'s life, a script he has been preparing for years.", "In December 2016, he declined an offer to become Chair of the National Endowment for the Arts, citing a desire to work on issues related to veterans.", "He was considered for the lead role in _They Live (1988)_ (qv).", "He turned down 'Bruce Willis' (qv)'s roles in _Die Hard (1988)_ (qv) and _Pulp Fiction (1994)_ (qv).", "Was due to be the lead in _Beverly Hills Cop (1984)_ (qv) but due to differences he was dropped and replace by 'Eddie Murphy' (qv).", "Has played four different characters in recurring roles: Rocky Balboa (Rocky), John Rambo (Rambo), Ray Breslin (Escape Plan) and Barney Ross (The Expendables)."], "quotes": ["Once in one's life, for one mortal moment, one must make a grab for immortality; if not, one has not lived.", "That's what _Rocky (1976)_ (qv) is all about: pride, reputation, and not being another bum in the neighborhood.", "I'm not handsome in the classical sense. The eyes droop, the mouth is crooked, the teeth aren't straight, the voice sounds like a Mafioso pallbearer, but somehow it all works.", "[Explaining to The New York Times how he wrote the script for _Rocky (1976)_ (qv) in three days] I'm astounded by people who take 18 years to write something. That's how long it took that guy ['Gustave Flaubert' (qv)] to write \"Madame Bovary\". And was that ever on the best-seller list? No. It was a lousy book and it made a lousy movie.", "[In 1976, after completing production on _Rocky II (1979)_ (qv)] But there'll never be a \"Rocky IV.\" You gotta call a halt.", "I'm not right wing, I'm not left wing. I love my country.", "[on 'Arnold Schwarzenegger' (qv)'s campaign for Governor of California in 2003] I think it's very dangerous waters. In that particular field you can't yell \"Action!\" and \"Cut!\" and \"Take two!\" and \"Take three!\". I personally think actors should remain actors, but I know he's always had blind ambition for that, so maybe it'll work out for him.", "[Talking about the proliferation of guns in the U.S., following the murder of 'Phil Hartman' (qv) in 1998, who was shot to death by his wife] Until America, door to door, takes every handgun, this is what you're gonna have. It's pathetic. It really is pathetic. It's sad. We're living in the Dark Ages over there. It has to be stopped, and someone really has to go on the line, a certain dauntless political figure, and say, \"It's ending, it's over, all bets are off.\" It's not 200 years ago, we don't need this any more, and the rest of the world doesn't have it. Why should we?", "I had no idea 'Ellen Barkin' (qv) was in the restaurant. If she was coughing or dying, she was doing it politely. I would have been more than happy to reach down her throat or squeeze her hard. Sat there dumbfounded? Please! I would have rallied round - just to avoid paying the bill.", "[1991] I'm 5'10\" and weigh 177 pounds. I'm pleased with my body now.", "People accept Rocky Balboa as authentic. I can't tell you how many people have come up to me and asked about my boxing career. It's like they really want to believe that Rocky exists. You know, I'm amazed by all of this. At one time I thought people would get over their fascination with the character and move on. Didn't happen. After 30 years, Rocky has taken hold to a degree I never could have imagined.", "[Following 'John Ritter' (qv)'s death in 2003] It's a huge shock. It just makes me realize how fragile life is.", "I'm not a genetically superior person. I built my body.", "[2002] We're talking about doing another Rambo because I think it's time to combine action with politics.", "I'll just go on playing Rambo and Rocky. Both are money-making machines that can't be switched off.", "I'm a very physical person. People don't credit me with much of a brain, so why should I disillusion them?", "[1999] After I made _Cop Land (1997)_ (qv) in which I played a timid, overweight cop, all of Hollywood turned their back. I'm surprised they even gave me this table. I'm like driftwood in here.", "I know I cannot hold on to them forever, but I will as long as I can. I pity the first boy to knock on the door for a date. I'm gonna buy ten more Rambo outfits just to make sure they're too scared to put a foot wrong. They will probably all run a mile, which suits me just fine. I know I won't be able to help myself playing the worried dad. My girls were born with the flirt gene. It's very funny, but it also worries me about what a handful I will have in a few years time. I know it's stupid - I just don't want them to grow up. I love my family. I can't imagine life without them all in the house.", "I really am a manifestation of my own fantasy.", "All art, in this business, is a matter of compromise. It's not one man's vision unless he takes very weak actors.", "I'd say between 3 pm and 8 pm I look great. After that it's all downhill. Don't photograph me in the morning or you're gonna get 'Walter Brennan' (qv).", "No one likes to fail at anything, but I believe I'm a better person for it. I learned life's lessons. You're given certain gifts and that's what you should try to be.", "[on his marriage to 'Jennifer Flavin' (qv)] It's been a fantastic revival of my life. As you know, my first marriage didn't go so well, though I have a relationship with my sons, but this marriage has been a second beginning. I used to think my career was number one, so I was gone nine months out of a year, but I learned the hard way that the most important thing is that you start at home and then comes the career.", "I think the people who have been so supportive and loyal will be happy with the final chapter in Rocky Balboa's life because I think we bring the character to a final and noble conclusion.", "I enjoy comedy very much, but it just wasn't right for me. Sometimes it's better to just stay focused and do what you're really passionate about.", "You wake up one morning and you go, \"What happened? Where did it all go so fast? There are many more things I want to do.\" And I figure a lot of people feel the same. A lot of people have so much they want to do, but society says, \"Step back, youth must be served.\" I say, \"You're right, youth must be served - after us. Get in line. We're coming back for seconds and thirds, and when we're finished helping ourselves, it's your turn.\" Just because people get older doesn't mean they abandon their dream or their ability to want to do something, so Rocky is symbolic of still wanting to participate. Rocky says the last thing to age is the heart, so I wanted to do a film that shows our generation is not on the outside looking in; it's still vital and wants to be part of the parade, not watching the parade. I want to show that life is not over at 50. People say, \"Come on, grow old gracefully.\" No, why? I'm not ready. I know people will think Rocky is my story, but it's also my generation's story.", "[on _Rocky Balboa (2006)_ (qv)] I knew I would go through the embarrassment of hearing all the jokes about me. My wife begged me not to do it, and that's why I wrote a line . . . that I'd rather do something I love badly than to feel bad about not doing something I love.", "[on _Rocky Balboa (2006)_ (qv) and _Rambo (2008)_ (qv)] Maybe these movies wouldn't have been as interesting five years ago, but look what's happened in the world in that time. It's a whole different climate, now.", "I'm now starting _Rambo (2008)_ (qv) and I'm looking for a young actor to star opposite me. I've been looking for the next 'Robert Mitchum' (qv) or 'Steve McQueen' (qv), but the fact is they just don't exist. Tough guys today are getting their hair done at Hollywood hairdressers. Whatever happened to having a beer and scratching your balls?", "[on _Rhinestone (1984)_ (qv)] You'd have thought we all got together and decided how we could fastest ruin our careers.", "I abused my body so much throughout my career that I am literally held together by glue. The stuff I took thickens the bones and reinforces the tendons.", "I never had extraordinary genes or great bone structure, and I'm still very thin. What I try to do is create a body that every man can look at and say, \"You know, with a certain amount of dedication I can achieve the same thing.\" I try to keep it in the realm of athletic, rather than unapproachable.", "[speaking of his life with a wife and three daughters] Living in a house where you are the only man is a little like being the only guy left at The Alamo. They just rule. Even our dogs are female. So there is no chance.", "There's something about matching the character with the script. And right now, the script that's being written, and reality, is pretty brutal and pretty hard-edged, like a rough action film, and you need somebody who's been in that to deal with it. - On Senator 'John McCain' (qv).", "I look back on _Judge Dredd (1995)_ (qv) as a real missed opportunity. It seemed that lots of fans had a problem with Dredd removing his helmet, because he never does in the comic books. But, for me, it is more about wasting such great potential there was in that idea... it didn't live up to what it could have been. It probably should have been much more comic, really humourous, and fun. What I learned out of that experience was that we shouldn't have tried to make it \"Hamlet\", it's more \"Hamlet & Eggs\".", "If I have a regret, it's that I didn't expand my acting when I was building my career. It often sounds pathetic when you hear actors say that they feel sorry for themselves - I've been very very blessed, believe me - but if I had to do it all over again I could have done both. You can do commercial films and then do small, independent, acting films. 'Bruce Willis' (qv) has done it well, so it's possible. I wish I had done it, but that wasn't the style back then. You were either a studio actor or an independent actor. So I regret that.", "I'm often asked whether Rocky is an extension of myself. But the truth is I wish I could be as noble as Rocky. He never says a bad word about anyone, and he never complains. He's lost 24 times, his record is 54 and 24, he's lost a lot but he's philosophical and knows there will be another day. I'm not that. I wish I were.", "Rocky gives out such a good vibe, while Rambo's the 'Prince' (qv) of Darkness. The new Rambo is not a feelgood movie. Every actor would like to say that they're 'Daniel Day-Lewis' (qv) and that they have this incredible palette, but quite often you're known for certain things. I accepted that. So I said to myself, \"Boy, if I could end my career on something, I'd like to finish up the loose ends on Rambo, because the last one in Afghanistan didn't work.\"", "Making _Victory (1981)_ (qv) (aka Escape to Victory) was hard work. I thought _Rocky (1976)_ (qv) was tough, but I'd never trained so hard in my life. My waist went down from 33 to 29 inches; I ran every morning, because I was trying to look a little gaunt. We were POWs, after all.", "During _Rocky IV (1985)_ (qv), 'Dolph Lundgren' (qv) had hit me so hard I had swelling around the heart and had to stay in intensive care at St. John's Hospital for four days.", "[at Rambo UK Premiere, 2008) I feel like I'm 20 again - but with arthritis!", "[on 'Mickey Rourke' (qv) in _The Wrestler (2008)_ (qv)] Mickey, if anybody deserves an Oscar, it's you. No question about it. You lived it. You earned it. You deserve it. You're an incredibly talented man. It's about time everyone says, 'You know what? Give it to the winner.'", "[on what fans can expect from _The Expendables (2010)_ (qv)] Let's say we dug up _The Wild Bunch (1969)_ (qv) and gave them one more shot.", "The whole thing about _Rocky (1976)_ (qv) wasn't about him boxing. It was about aging -- that was what made the movie. It wasn't him. It was about her -- him finding love, him making someone's life better -- and, before you know it, the audience identified with it.", "[on _The Expendables (2010)_ (qv)] I guess it's kinda like _The Dirty Dozen (1967)_ (qv), or one of those films that comes along every once in a while, like _The Magnificent Seven (1960)_ (qv), to try to take that old formula and move it into a modern era. We accomplished it; I'm very, very happy with the film.", "The trouble with remakes is that people fall in love with the original. It's like peanut butter. If you try to change the taste of peanut butter, you're in trouble.", "[on the character of Rocky Balboa] I have always seen him as a 20th Century gladiator in a pair of sneakers.", "95% of the time, women are right. They can be emotional, but when they say your shoes are shit or your tie is wrong, they're often right.", "[on the difference between filmmaking and painting] Movies are a vision dependent upon 300 or 400 people to accomplish it. So there's great compromising. And so much is lost in the translation. So when you get up there, it's maybe 40% of the way you envisaged it. Because of the finance thing, and the actor doesn't interpret it properly. Or the director isn't on form that day and he missed the whole point. Whereas painting is all you do. It either soars or it crashes. There's no one to blame but one person.", "[on 'Arnold Schwarzenegger' (qv)] He's my best friend now. It's strange, given what big rivals we used to be. He's still ridiculously competitive, though. See this watch? This is the only one of its kind in the world, so I wore it to our last lunch. Arnold was desperate for me to get him one but I had to explain that wasn't possible. He was so mad!", "[on filming his scene in _The Expendables (2010)_ (qv) with pals 'Bruce Willis' (qv) and 'Arnold Schwarzenegger' (qv)] Bruce's character, who hires me to do the job the film's based on, turns to me and says, 'Look, there's one person I need to talk with before I give you the job.' At which point Arnold, who plays my oldest rival, walks out. And it's clear we have a lot of history there. So I tell him I should have shot him a long time ago when I had the chance. And the scene goes from there. But man, those guys were up for it. They got out of bed at 5.30am just to shoot a small five-minute scene.", "[on _The Expendables (2010)_ (qv)] Man, it was seven guys, kicking each other's a**, one guy tougher than the next. No joke, our stunt guys were begging for mercy. Actually, my fight with Stone Cold 'Steve Austin' (qv) was so vicious that I ended up getting a hairline fracture in my neck. I'm not joking. I haven't told anyone this, but I had to have a very serious operation afterwards. I now have a metal plate in my neck.", "[on _Rocky IV (1985)_ (qv)] 'Dolph Lundgren' (qv) and I always went for it. I gave him orders to try to knock me out while the cameras were rolling. At one point, he hit me so hard on the head I felt my spine compress. He then hit me with an almighty uppercut. That night my chest started to swell, and I had to be helicopter-ambulanced from my hotel to a nearby emergency room. I was told that Dolph had punched my rib cage into my chest, compressing my heart. If it had swollen any more, I would have died. After that, I was like, 'Dolph, it's only a movie, bro.'", "[on working with 'Richard Gere' (qv) on _The Lords of Flatbush (1974)_ (qv)] Gere would strut around in his oversized motorcycle jacket like he was the baddest knight at the round table. (Having lunch in a Toyota) I was eating a hot dog and he climbs in with a half a chicken covered in mustard with grease nearly dripping out of the aluminum wrapper. I said, 'That thing is going to drip all over the place.' He said, 'Don't worry about it.' I said, 'If it gets on my pants you're gonna know about it.' He proceeds to bite into the chicken and a small, greasy river of mustard lands on my thigh. I elbowed him in the side of the head and basically pushed him out of the car. The director had to make a choice: one of us had to go, one of us had to stay. Richard was given his walking papers, and to this day, seriously dislikes me. He even thinks I'm the individual responsible for the gerbil rumor. Not true, but that's the rumor.", "[on retiring from acting] I'm on borrowed time. At this age I hear the ticking clock and it's as loud as the gong on Big Ben. The ultimate ambition is to follow in 'Clint Eastwood' (qv)'s footsteps and move on to directing films without me having to be in them. I'm on borrowed time and know my longevity will be predicated on being able to make that move.", "I am under pressure to perform. If I didn't have this goal I would be more than happy to throw 25 croissants down my throat and wash it down with a pint of beer, trust me. It is very, very hard to stay in shape.", "I have become more cynical as I have got older. Everything you were promised as a young person, it doesn't really come true.", "[on 'Arnold Schwarzenegger' (qv)] I see him every Saturday, at Café Roma in Beverly Hills. It's funny because we used to be so competitive in the Eighties and now we're the best buddies in the world.", "[on Rambo] He'd murder Jason Bourne. I'm only kidding. Maybe the other guy...the one in _The Transporter (2002)_ (qv), 'Jason Statham' (qv).", "I made some truly awful movies. _Stop! Or My Mom Will Shoot (1992)_ (qv) was the worst. If you ever want someone to confess to murder just make him or her sit through that film. They will confess to anything after 15 minutes.", "[on 'Dolph Lundgren' (qv)]: Dolph, I think, is a fantastically cooperative, excellent guy.", "[on his screen test for the part of Han Solo in _Star Wars: Episode IV - A New Hope (1977)_ (qv)] It didn't meet with much approval since when I stood in front of 'George Lucas' (qv) he didn't look at me once. Well, obviously I'm not the right type... It all worked out for the best since I don't look good in spandex holding a ray gun!", "[on his failed audition for a part in _The Godfather (1972)_ (qv)] I couldn't even be an extra at the wedding, that's how far down the food chain I was.", "People that spend time in a foxhole - they're never going to find that relationship anywhere else again...everything else pales next to that. When you think about the second World War vets - more than even the Vietnam vets - there's a brotherhood. They're 90 years old now, and they're still wearing the hats. The way they feel about each other. Time stopped. That was the ultimate of life. Everything after it was anticlimactic. After that it just wasn't the same.", "[on a shocking ad-lib by 'Bruce Willis' (qv) in the scene with 'Sylvester Stallone' (qv) and 'Arnold Schwarzenegger' (qv) in _The Expendables (2010)_ (qv)] He goes, 'Why don't you just suck each other's c**ks?' I thought, 'You can't tell Rambo and The Terminator to suck each other's c**ks!' I said to the guys, 'You know what, that's worth the price of admission alone!'", "[on his 1980s rivalry with 'Arnold Schwarzenegger' (qv)] He was far more diligent than me; I was too reckless. He's very machine-like and I did consider him an enemy. But, looking back, it was a good enemy.", "The one thing in my films... I only kill people that need to be killed. Let me put it this way, the ones that deserve it get it and they get it good and the ones that go after women really get it, you know what I mean? Really get it.", "I've made a lot of career mistakes - a lot! Sometimes you're making a film and you go, 'It's a turkey and it's not even Thanksgiving.' It's bad.", "[on being asked about themes in his movies at a press conference] I always try to deal with redemption. I think everyone in this room like everyone on the planet has regret, that one moment when they made the wrong decision, sometimes you just never get your life back on course, and that theme from Rocky Balboa to Rambo, it just haunts me.", "I'm past my prime in doing dramatic films, I think it becomes maybe, almost a pathetic cry out to be recognized as a serious actor. I did my little moment. I'm very proud of the drama in _Rocky Balboa (2006)_ (qv), its about as deep as I can go, and _Cop Land (1997)_ (qv). I would much rather just direct dramas.", "[on wanting 'Arnold Schwarzenegger' (qv) for _The Expendables (2010)_ (qv) sequel] I would love to get him in the next one. I really think so. He's been out of the limelight a long time, and I think this is the kind of film that would be a nice intro. I saw his eyes light up. It's one thing to run a state, but it's another thing to get back to what you're really known for. Certain actors you're never going to see come down the pike again, and he's one of them.", "[on _Rocky Balboa (2006)_ (qv)] I haven't seen a dime yet. It made nearly $200 million. That's life, eh? That's how it works these days. They have this thing called 'back end' You can make a movie for $12 million that makes $250 million, but it still ends up in the red. The studios say they added $50 million in publicity in the Ukraine or somewhere, and you're like, 'What?'", "Exercise, I tell people, can kill you. It's double-edged. It's good for you but you've got to know what you're doing. Your joints become fragile after a certain point. When you're 20, they're like rubber. But now...there's no way I can do the old squats and stuff. No way. Can't do it.", "I eat healthy Monday to Friday, pig out on the weekend, gain pounds, then lose it again Monday to Friday. No need to starve, or suffer!", "[on 'Arnold Schwarzenegger' (qv)] When people ask me who is the most extraordinary guy I've ever met, I answer that it's him. Think about it - the force of will and the fact that he is successful in three diverse and impossibly difficult areas. The politics of bodybuilding? Forget about it. And he was and is the most influential bodybuilder who ever lived, by far. Then, in Hollywood, with his background of being Austrian and all this baggage of not being American, and he became No. 1. And then politics, it's off-the-chart hard, he's the governor of California. That's all, just the governor of the biggest state in population. This is not some city council somewhere. And he would make it as a presidential candidate. It's mind-blowing.", "If politicians really told the truth they'd be fired and Washington would be an overgrown parking lot. Sad but true.", "You have to grab life by the throat and squeeze before it grabs you by your neck and breaks it. Own your destiny.", "Being ignorant is like getting dressed for Prom Night in the dark. You think you are looking good until somebody turns your lights on.", "Doing _The Expendables (2010)_ (qv) was brutal; no time, no rest and more difficult then the last three Rambos put together.", "Halloween is the only time people can become what they want to be without getting fired.", "[on _Rocky (1976)_ (qv)] It's a film I wanted to go to. It's an audience's inalienable right, when they go to a theater, to see something truly extraordinary, something that borders on day-dreamism.", "I like a good adversary. It makes you lose sleep and want to get up on the morning and go to the gym.", "Rambo is me before coffee in the morning. Rocky is me after coffee. Rambo has reverted into kind of like an id: primitive, reactive and instinctual - almost like an animal. I love this character because because he hasn't quite been fleshed out. He's like an errant knight, looking to die in a glorious fashion. He has no desire to go into old age or have a family. Rocky is the antithesis: he cannot live without a family. So you've got the American Frankenstein monster, then you have the American dream.", "Regular artists borrow, geniuses steal.", "[on _First Blood (1982)_ (qv)] In the book, Rambo gets killed. I thought it was not the proper message. There had been close to 200,000 suicides by returning Vietnam vets. I said, \"Why don't we take him right to the edge without annihilating him?\" 'Quentin Tarantino' (qv) said, \"You're a coward, you should have killed him!\" I said, \"Quentin, you're a lunatic. I want to do some sequels, brother.\"", "[on the possibility of 'Mel Gibson' (qv) directing _The Expendables 3 (2014)_ (qv)] Mel is a magnificent director! Pure passion on every level. We'd be blessed to have him. A real long shot, but life is a long shot - right?", "[on gun control] I know people get upset and go, 'They're going to take away the assault weapon'. But who needs an assault weapon? Like really, unless you're carrying out an assault. You can't hunt with it. Who is going to attack your house - an army?", "Every time I use social media I get really in trouble! I think 'George Clooney' (qv) said it best when he said you've got to be an idiot to be a celebrity and use Twitter. You wake up in the morning when you're sober and your career is over! You've got to be really, really careful. You think you're a genius up there in the middle of the night and you wake up an idiot.", "I turned down _Witness (1985)_ (qv), which was great because I've never had a love affair with an Amish chick!", "[on working with 'Robert De Niro' (qv) on _Grudge Match (2013)_ (qv)] He was much more of a fearless actor early on. I'm doing _Rocky (1976)_ (qv) and the next theatre over it's _Taxi Driver (1976)_ (qv) - he was there with the mohawk, bloody nose, that took some guts to do. I really admire that he just wants to keep going. It was great working with Bobby because he's the complete antithesis of who I am. He's modest, he's quiet, he's reserved and I learned a lot from him.", "[advice to actors who are training to appear as boxers in a musical version of _Rocky (1976)_ (qv)] The hardest thing to do is to sell the punch. You can teach a guy to punch, but the person receiving it has to have the body movement. It starts with the feet, the swivelling of the ankles, the knees and the hips, and then the head goes last. If you just throw punches using your arms it looks like flailing.", "[on casting _The Expendables 3 (2014)_ (qv) and possible future Expendables movies] I was going to go call up 'Jack Nicholson' (qv) and we just got there a little too late, because actually he had said he might be interested in it. So there are still interesting avenues out there. I want to get, if possible, the most unique actors from the past and just put 'em out there once and for all, you know? It just seems like an interesting... quest to do that, because I don't know if it's ever going to happen again. And we're certainly not getting any younger. Well, you know 'Clint Eastwood' (qv) is so involved with what he's doing, so that's kind of a pipe dream.", "[on _The Expendables 3 (2014)_ (qv)] We're trying to make an Event Movie - like _The Avengers (2012)_ (qv). And I think we've accomplished it.", "People think it's easy to make a sequel. It's not, because you've lost the element of surprise. How do you keep putting on layers without getting too pretentious or trying too hard - you know, when in doubt, shout.", "[on _The Expendables 3 (2014)_ (qv)] I believe we finally got it right in the third one - kind of like marriage.", "'Steven Seagal' (qv) said that he, 'Didn't associate with that kind of element' - meaning me. So I slammed him up against a wall. At that time, our testosterone was running full bore. He was full of his height and I was full of... Myself. But we made up. He can be very abstract.", "I am an artistic businessman, both. I think you have to be. It's a matter of self-preservation.", "I was taken off the streets and put into the limos and then groomed and pushed out in poster sales and advertising sporting equipment and whatever... It just kept building and building - I thought everybody liked me; this is the thing to do. Success is like a jet stream; it just sucks you along.", "[on the character of Rocky] It's odd - I don't know if it's the first time in the cinema, but it's like I have to live up to the ethics of a fictional character. The identification is so close that I had to stop smoking 'cause people were so offended. They'd say, 'You aren't in training? Rocky wouldn't smoke...' I find it to be so fascinating now. I have been so rewarded by the character. I can't bite the hand that feeds me. It's a fact of life; it's something that I'll always be judged against. Every film I do is going to be judged against _Rocky (1976)_ (qv). It's a fact. I can't fight it anymore.", "[on who intimidated him at the Oscars in 1976] Actually, the person I talked to first, was 'John Wayne' (qv). I didn't know anybody so I was sort of in the corner, feeling very awkward. He walked over and said, \"I'd like to introduce myself. My name is 'John Wayne' (qv).\" I said, \"I recognized you, slightly.\" He was just so humble, and he goes, \"Welcome to the industry. I saw your film, and you were very good.\" That took away my breath, but I relaxed after that, thinking I was just going to sit back and enjoy the show.", "[on _Warrior (2011)_ (qv)] My God, I thought that was amazing. I felt like I knew exactly what those guys were feeling at night. Incredible dedication. 'Joel Edgerton' (qv), those were real performances. I think that the way it was positioned was, just a fight film. But what 'Tom Hardy' (qv), 'Joel Edgerton' (qv) and 'Nick Nolte' (qv) did was, fantastic acting. I was taken aback by how good they were. I think if people had seen it in a Cain and Abel context, it might have been perceived as more of a cautionary tale rather than just a fight film.", "[on directing _Rocky II (1979)_ (qv)] I didn't want to do it; John did a great job and won an Oscar. What had happened is, he didn't quite agree with the subject matter on the second one and just said, \"I don't want to do it.\" Then the producers said, \"Why don't you direct it?\" I said, \"Excuse me?\" That was the adventurousness of 'Irwin Winkler' (qv) and Bob Chartoff. \"You wrote it, you understand it. Why not direct it.\" They gave me the nerve to do it. _Paradise Alley (1978)_ (qv) hadn't come out yet. I started directing _Rocky II (1979)_ (qv) and decided to work backwards, doing the fight first. So I'm directing that and we move to Philadelphia, and I'm nervous because, how can I come close to Rocky, as a director, but I'm trying. _Paradise Alley (1978)_ (qv) comes out, and I go to see it during lunch and there are four people in the theater. Four. In Philadelphia, of all places. I went \"Oh my God.\" I had to go back to the set. It didn't work out that badly for Paradise Alley, but my confidence was at an all-time low that day, and I had to tell myself, just keep punching.", "[on _Nighthawks (1981)_ (qv)] Yeah, I remember Nighthawks. Again, a film that didn't find an audience, but I thought 'Rutger Hauer' (qv) was incredible. Maybe it was that urban terrorism wasn't perceived as a serious threat then, and they said, \"Well, this so far-fetched,\" but I liked that film a lot. That was a tough movie. We shot nights, like 40 in a row. The shoot lived up to its title.", "[on pushing himself too hard in the gym] It came right before _Cop Land (1997)_ (qv). I had pushed a little too far and had an erratic heartbeat. So I said, maybe I should do a film that I can have pancakes and French Toast every morning and not stay on a treadmill for hours a day. That was _Cop Land (1997)_ (qv). I had a great time working with Jim Mangold, De Niro and Keitel, and 'Ray Liotta' (qv). This was such a blessing, and I enjoyed it so much. If I could have stayed there, I would have. I loved doing ensemble work with Mangold and 'Harvey Weinstein' (qv) really made a solid film. _Creed (2015)_ (qv) has left me with the same good feeling.", "[on if having action hero status hurt acting opportunities] Absolutely. I think that there's a preconceived notion that an action film is a mindless exercise in visual dexterity. Quite often, they're right. But when you do it in a proper way, say like _The Bourne Identity (2002)_ (qv), it's really intriguing, isn't it? You're able to combine all the different skill sets, acting, visual, and the kinetic energy. But it doesn't happen very often, and when you hear the word, \"Action,\" you say, \"Okay, the guy really can't act; all he can do is be very, very physical,\" In a sense you are considered more of an empty vessel. I get that just comes with the territory, and that if you stick around too long, it becomes kind of your epithet.", "The best thing about getting older is...nothing. There's zero good in getting older.", "[Golden Globe Award 2016, thank you speech] I wanna thank my imaginary friend Rocky Balboa, for being the best friend I ever had.", "I love 'Donald Trump' (qv). He's a great Dickensian character. You know what I mean? There are certain people like Arnold, 'Babe Ruth' (qv), that are bigger than life. But I don't know how that translates to running the world.", "I've always thought of Rocky as an individual that was chosen to take a journey that would bring together many \"broken\" people, including himself, and this group would achieve success because of their newfound self-respect. Good old-fashioned Christian values, nothing wrong with that.", "(_Judge Dredd (1995)_ (qv)) From what I recall, the whole project was troubled from the beginning. The philosophy of the film was not set in stone - by that I mean \"Is this going to be a serious drama or with comic overtones\" like other science fiction films that were successful? So a lotta pieces just didn't fit smoothly. It was sort of like a feathered fish. Some of the design work on it was fantastic and the sets were incredibly real, even standing two feet away, but there was just no communication. I knew we were in for a long shoot when, for no explainable reason 'Danny Cannon' (qv), who's rather diminutive, jumped down from his director's chair and yelled to everyone within earshot, \"FEAR me! Everyone should FEAR me!\" then jumped back up to his chair as if nothing happened. The British crew was taking bets on his life expectancy.", "(Asked if he'd ever play a villain) I wouldn't be opposed to playing a truly horrific individual. God knows I saw enough of that growing up. The thing is... whether he's a bloodthirsty, flesh-ripping, Son of Sam-type or more psychologically sadistic, I would definitely opt for the latter. Maybe a remake of When Harry Beat Sally.", "(On writing controversies) First of all, as for 'Chuck Wepner' (qv), he knows the truth and it had nothing do to do with his \"personal life.\" I even regret the fact that he and _Rocky (1976)_ (qv) are associated because the two people couldn't be more diverse. Second of all, I suppose 'James Cameron' (qv) has a point, but in his original draft it took nearly 30-40 pages to have any action initiated and Rambo was partnered with a tech-y sidekick. So it was more than just politics that were put into the script. There was also a simpler story line. If 'James Cameron' (qv) says anything more than that, then he realizes he's now doing the backstroke badly in a pool of lies. And finally, 'Joe Eszterhas' (qv) wrote a script that was nearly 400 pages and was more of a novel than a shootable screenplay. A great deal of work was done by myself, along with Norman Jewison, to hammer it into shape, but Joe had conceived a great concept.", "(Asked if 'James Cameron' (qv) was going to direct _Rambo: First Blood Part II (1985)_ (qv)) No, I think that 'James Cameron' (qv) is a brilliant talent, but I thought the politics were important, such as a right-wing stance coming from Trautman and his nemesis, Murdock, contrasted by Rambo's obvious neutrality, which I believe is explained in Rambo's final speech. I realize his speech at the end may have caused millions of viewers to burst veins in their eyeballs by rolling them excessively, but the sentiment stated was conveyed to me by many veterans.", "(On _Paradise Alley (1978)_ (qv)) I wrote the book first, then the screenplay. Both I wrote before I'd even thought about _Rocky (1976)_ (qv), so originally they were done in 1974. But I was very broke and I optioned the screenplay of _Paradise Alley (1978)_ (qv) to a real... how should I say this... maggot, who put his hooks in so deep I could never get it away from him. So the first time I went in to meet Chartoff and Winkler, I was there on an acting job. I didn't get it, but on the way out I said, \"I have this screenplay called _Paradise Alley (1978)_ (qv).\" They said to bring it over and I did. They wanted to make it, but the other cretin that I had optioned it to was so obnoxious, so overbearing, that the producers wanted nothing to do with me or the screenplay. So on the way out, they said, \"If you have any ideas, we'd be happy to look at them.\" That night I went home - even a fire extinguisher couldn't cool the burning in my brain. The door of opportunity was wide open and I had nothing to carry over its threshold. That's when I started to write _Rocky (1976)_ (qv). So thank God for the maggot; otherwise I never would've written the story of Mr. Balboa.", "It's very simple why _Eye See You (2002)_ (qv) landed in limbo. A film is a very delicate creature. Any adverse publicity or internal shake-up can upset the perception of - and studio confidence in - a feature. For some unknown reason the original producer pulled out and right away the film was considered damaged goods; by the time we ended filming there was trouble brewing on the set because of overages and creative concerns between the director and the studio. The studio let it sit on the shelf for many months and after over a year it was decided to do a re-shoot. We screened it, it tested okay, 'Ron Howard' (qv) was involved with overseeing some of the post-production... but the movie had the smell of death about it. Actually, if you looked up, you could see celluloid buzzards circling as we lay there dying on the distributor's floor. One amusing note: It was funny, when we were met at the airport by the teamsters they'd have a sign in front of them saying Detox, and all these actors like 'Kris Kristofferson' (qv), 'Tom Berenger' (qv) and myself looked like we were going into rehab rather than a film shoot.", "(On his early days) I do remember the windows and they were painted black, simply because my life was dedicated to writing since acting jobs had eluded me. But make no mistake about it, my writing was pretty atrocious in the beginning and my style left a lot to be desired. For example, I would begin writing at 11:00 at night as I listened to 'The Bee Gees' (qv)' Odessa album over and over and over until 5:00 in the morning. The writing never amounted to much, but I memorized all the words to the album. It's safe to say I've long since abandoned that method of writing. The reason I painted the windows is, I didn't want any distractions or excuses to distract me from trying to work, such as, \"My, what a nice day, I think I'll go outside and beg for food.\"", "(On his worst injury from a Rocky film) Well, the worst pre-injury was the torn chest muscles competing in the bench press competition before _Rocky II (1979)_ (qv), and the worst was in _Rocky IV (1985)_ (qv). In the first round, I thought these two characters should hate each other so much that they should just attack each other like pit dogs... professionalism be damned. So what you see in the first twenty seconds is real, and after the third take of taking body blows, I felt a burning in my chest, but ignored it. Later that night I couldn't breathe very well, and they took me to the emergency room. My blood pressure was 200+, and the next thing I knew I was on a low-altitude flight from Canada to St. John's Hospital in Santa Monica, and there I resided in intensive care for eight days. What had happened is he struck me so hard in the chest that my heart slammed against my breastbone and began to swell, so the beating became labored, and without medical attention the heart would've continued to swell until it stopped. Many people that have car accidents die like this when the steering wheel slams into their chest. So in a sense I was hit by \"a streetcar named Drago.\"", "(Challenging 'Carl Weathers' (qv)'s statement that in a no holds bar match between himself and the other boxng stars of the Rocky) films and he said it would be 'Mr. T' (qv), him, 'Dolph Lundgren' (qv) and Stallone) First of all, my brother Frank used to spar with Carl and chase him around the ring like a fox running from a hound. I saw 'Dolph Lundgren' (qv) pick up Carl and heave him three feet into the corner when I was directing the scene between them; rather than retaliate, Carl got out of the ring and said something ferocious like, \"I'm calling my agent... I quit!\" So in order of boxing skills and fighting ability, I would say 'Dolph Lundgren' (qv), myself, 'Mr. T' (qv), Paulie, and then Apollo Creed.", "(If he directed _Over the Top (1987)_ (qv)) I would have made it less glossy and set it more in an urban environment, for one. Next, I would've not used a never-ending stream of rock songs, but scored music instead, and most likely would've made the event in Vegas more ominous - not so carnival-like.", "(On getting into shape for _First Blood (1982)_ (qv)) The burnt toast rumour is false. I ate perhaps 10-12 eggs per day and only dined on fish so my body was getting ridiculously thin. If I had to do it over again, I would've definitely thrown in some good ol' pasta into that formula, because a strict diet of protein provides no warmth, and let me be clear, that was one cold and brutal shoot.", "I grew up not very confident. I had tons of self-doubt and wasn't physically strong either, so the world appeared to be an extremely large and intimidating sphere. All my life, I always thought that I was alone in these disturbing thoughts, but the older I grew, the more I realized the world is made up of victims, victims of harsh reality, victims of inequality. I thought the most tragic thing one could be confronted with is the prospect of loneliness and the second, the lack of opportunity to prove one's self-worth. So Rocky was just a manifestation of all the underdogs who dream of one day having the opportunity to reach for the stars. They may not get there, but at least the opportunity to show what's in a person's heart is the main goal.", "(On the shower scene with 'Sharon Stone' (qv) in _The Specialist (1994)_ (qv)) Let it be known, I didn't want to do this scene because Sharon was not cooperating. We get to the set and she decides not to take her robe off. The director asks only a few of the crew to remain, and she still won't take it off. I promised her I wouldn't take any liberties, so what's the problem? She said, \"I'm just sick of nudity.\" I asked her if she could get sick of it on someone else's film. She was having none of it, so I went down to my trailer, brought back a bottle of Black Death vodka that was given to me by 'Michael Douglas' (qv) and after half-a-dozen shots we were wet and wild.", "(If he'd ever reunite with 'Kurt Russell' (qv)) No, the chances of that are pretty slim. The idea is intriguing, but it might look a little weathered, like two old ventriloquist dummies trying to play leading men. But thanks for suggesting it because I had a lot of great times on that film. Kurt nailed some of those scenes, like the pro he is.", "(If the Director's Cut of _Cliffhanger (1993)_ (qv) will be released)) No, actually the director's cut was met with a lot of disapproval at the screening and received some alarmingly low scores. Mainly because the stunts were absurdly overblown. For example, the average man can jump maybe twelve feet across a gorge, and the stunts had me leaping maybe three hundred feet or more, so situations like that had to be pared down and still then were fairly extreme... so you're probably better off with this cut. By the way, the 2nd unit crew that filmed the majority of the action was extraordinary.", "(If he's embarrassed by his early films) No, in the early films, I have to admit I enjoyed watching them, only because they were completely carefree and devoid of any movie-star acting tricks, simply because I didn't know any. So it's fun to watch a natural performance without any ego attached. I particularly enjoyed working on _Capone (1975)_ (qv), because it was like the cheesy, mentally challenged inbred cousin of _The Godfather (1972)_ (qv).", "(On 'Burgess Meredith' (qv)) I remember the way Burgess played the scene with me in the apartment in the first _Rocky (1976)_ (qv), and I had never seen such great character work up close. He was just eating me alive with his intensity and nuance. I asked him how did he do that, and he said, \"Because I'm a better pretender than you are.\" I said, \"Pretending?\" and he said, \"Yes, acting - it's just a child's game played by grownups. The biggest child usually wins.\" So from that day on, I tried to specialize in being very immature.", "I love 'Joe Spinell' (qv) and considered him a dear friend and would do anything for him. We had met when I had one or two lines in _Farewell, My Lovely (1975)_ (qv). He was truly one of a kind, but he had some very deep personal problems on the set of _Nighthawks (1981)_ (qv) and became distant. It was around that time his mother also passed away, who he lived for and Joe was never the same.", "(1980 interview with 'Roger Ebert' (qv)) \"It's incredibly difficult to direct yourself in boxing scenes. You're getting the crap beat out of you and trying to think about camera placement at the same time. And another thing, in _Rocky III (1982)_ (qv) the pace is going to have to be quickened. It shouldn't be more than 90 minutes long. In the first two films, Rocky dictated his own pace. This time, like with any heavyweight champion, his pace is being dictated by the people around him. And we'll have a lot of action and be conservative with the dialogue. And also I hope I get out in one piece. For _Rocky II (1979)_ (qv), I got a torn pectoral muscle, I got all beat up inside, I had to have an operation to splice things back together. The mouthpiece saved my teeth. For this one, basically what I need is a mouthpiece for my whole body.\"", "(On _Paradise Alley (1978)_ (qv) being re-edited) \"I'll never forgive myself for the way I allowed myself to be manipulated during the editing of that film. There were a lot of scenes in there to give atmosphere and character, and they wanted them out just to speed things along. They removed 40 scenes, altogether. I put 10 of them back in for the version shown on TV. For example, the whole sequence of the soldier without legs, sitting in a bar eating peanuts.\"", "Most successful art reflects the exact ideas of the viewer - whether or not the viewer knows it, of course. Paintings that endure are paintings that inspire people to say, hey, that's the way I feel; those are the colours I see in my dreams. Even abstract art depends on that. When you get right down to it, _Rocky (1976)_ (qv) said exactly the same things to a 5-year-old that it said to adults. There was nothing complicated about it.", "(On stunts) \"The way they usually do it is they show you the double taking the hit, and then they cut in for a close-up of the actor's face. It's so phony you can smell it with the cable car sequence in _Nighthawks (1981)_ (qv) for example, it's so phony to show some stuntman hanging from a cable and then cut to the inside of the car and it's me coming in the window. You have to do it on one unfaked take so the audience can see the actor is really doing it.\"", "(1980 interview with 'Roger Ebert' (qv)) \"If I have the nerve, if I have real nerve, Rocky should die at the end of the third film. I was originally thinking in more grandiose terms - the Coliseum and everything - but _Rocky III (1982)_ (qv) should end with more than a fight. It should end with Rocky's life coming full cycle, The way I imagine it, after the fight, he's riding home in a cab, with the roar of the people chanting 'Rocky!' still in his ears. And he just drops over dead. In other words, he has achieved everything possible and he dies when he's on top. I don't think people want to see Rocky when he's 80. I don't know if I'll go with that ending, and him dying. But I know I'll have to film it. I'll have to shoot it for myself, whether or not I use it.\"", "(1980 interview with 'Roger Ebert' (qv)) \"When I'm on a location I pick a restaurant that's close and private and eat all my meals there. This table we're sitting at is directly above my room. That's all the farther I want to go. When I was a kid, my mother used to feed me mashed-potato sandwiches, brussels sprout sandwiches, my brain cells were starving from lack of food. I'll eat anything. I'll eat dirt.\"", "Now, working with 'John Huston' (qv), I'm biting my lip to keep from giving suggestions. There's a misconception that I can't work with other directors. With Huston, he's so into it, he sits back, you don't even think he's working, he's so smooth, but all the time the incubation process is taking place. And he lets you come to him with input if he doesn't like your suggestion, you get a single 'no' and that's it.", "(On doing stunts in _Nighthawks (1981)_ (qv)) \"I take those chances for myself,\" he said. \"I've never been so scared in my life, as when I was dangling from that helicopter. I have a fear of heights that borders on mania. I had to do something like this once in my life. So there I was, hanging 250 feet up over the East River, with the wind blowing me back and forth and the constant danger that if the steel cable hit something it could shear in two. The day before, see, a guy had jumped off the bridge we were working next to. We all saw it happen. He hit the water and exploded. His body broke into several pieces, and the current was so fast that this was the 59th St. Bridge and they pulled the remains out of the water seven minutes later at the 20th St. Pier. I saw that, and had to go up the next day. There was a fireboat down below with two divers in it. I made the mistake of calling them 'lifeguards.' It was explained to me that they were not lifeguards. They were there to retrieve my body, if necessary. If you see the movie and look closely, you'll see that I'm holding a knife in the scene. My theory was that if I fell, the cable would make me sink unless I could cut the harness loose. After I saw that guy hit the water like it was cement, I changed my plan. The knife was to plunge into my heart a second before I hit.\"", "(On 'John Huston' (qv)) \"There are some directors you just almost automatically jump at the chance to work with.\"", "(On getting into shape for _Victory (1981)_ (qv)) \"My waist is down from 33 to 29 inches, I run every morning, I'm trying to look a little gaunt. I thought _Rocky (1976)_ (qv) was tough, but I've never trained so hard. I thought soccer was a sissy sport until they kicked the ball into my stomach and I crossed the border into Austria with hematomas on both hips.\"", "We all really only want one thing. To be happy, and to achieve total fulfillment on all conscious levels.", "\"Part of the problem is being identified so completely with a character. People are nuts about Rocky. The first movie just opened here in Hungary recently. You should have seen the posters: I'm in the ring with my hat on, I look like some kind of clown. And yet, the other day we went to the Hungarian-Austrian soccer game, and coming out of the stadium I thought our car would be mobbed. If I'd have gotten out of that car, I would have been goulash.", "There's a price you pay. Working in this business, I've met some of the champions, and tried to figure out how they do it. Training for _Rocky (1976)_ (qv), I boxed with 'Muhammad Ali' (qv). Learning how to play soccer...tomorrow morning, I'm gonna get lessons from 'Pelé' (qv). What's next? I need a little quiet. Maybe chess with Bobby Fischer.", "I got into a lot of trouble with the first interviews I started giving after _Rocky (1976)_ (qv) came out,\" he said. \"I kept some tapes of some of them and I was listening to them the other day. I come over with a pretty big opinion of myself, and I said a lot of things that were supposed to be funny but weren't. I got the critics down on me and they retaliated by attacking _Paradise Alley (1978)_ (qv). Call it insatiable retribution.\"These days, I'm not one-half as aggressive as I was. I've been working on it. People have seemed to notice it. My energy level is just as high, but I can be more impersonal about myself. I'm learning to take life at face value. Instead of my greed, my demands, I'm turning things over to fate. I was always so serious about everything! Who was I trying to impress? I brought a lot of trouble down on myself. If you're too envious, too hostile, it all comes pouring down on you. There's a natural law of karma that vindictive people, who go out of their way to hurt others, will end up broke and alone.", "All basic laws are very simple. Working on _Nighthawks (1981)_ (qv), for example, I spent 15 weeks in almost, total seclusion in my hotel room, between scenes. Those were the most stressful moments of my life. There had to be another answer. Not drugs: They're a psychological elevator. They move you up, they move you down, but they don't move you ahead. I finally just realized I was taking everything so damned seriously that I was wrecking my own peace of mind. I had to learn to let go.", "(On 'Russell Mulcahy' (qv) directing _Rambo III (1988)_ (qv)) I remember calling him from an editing room and telling him what a wonderful job he had done. He answered back in a bored fashion \"Why thank you darling.\" So I hired him. He went to Israel two weeks before me with the task of casting two dozen vicious looking Russian troops. These men were suppose to make your blood run cold. When I arrived on the set, what I saw was two dozen blond, blue-eyed pretty boys that resembled rejects from a surfing contest. Needless to say Rambo is not afraid of a little competition but being attacked by third rate male models could be an enemy that could overwhelm him. I explained my disappointment to Russell and he totally disagreed, so I asked him and his chiffon army to move on.", "_Nighthawks (1981)_ (qv) was a very difficult film to make namely because no one believed that urban terrorism would ever happen in New York thus felt the story was far fetched. _Nighthawks (1981)_ (qv) was even a better film before the studio lost faith in it and cut it to pieces. What was in the missing scenes was extraordinary acting by 'Rutger Hauer' (qv), 'Lindsay Wagner' (qv), and the finale was a blood fest that rivaled the finale of _Taxi Driver (1976)_ (qv). But it was a blood fest with a purpose. The stunts in the film were pretty extraordinary because they were invented along the way. Running through the tunnels of an un-built subway station was very dangerous, but exciting and we were only given one hour to do it. So that made for an interesting evening. Hanging from the cable car was probably one of the more dangerous stunts I was asked to perform because it was untested and I was asked to hold a folding Gerber knife in my left hand so if the cable were to snap, and I survived the 230 foot fall into the East River with its ice cold 8 mile an hour current, I could cut myself free from the harness because the cable when stretched out weighed more than 300 lbs. I tell you this because it's so stupid to believe that I would survive hitting the water so to go beyond that is absurd. So I actually thought the smart move would be to commit hari-kari on the way down and let the cards fold as they may. P.S. Several years later this cable did snap while testing it on a 100lb bag of sand.", "(On The Hungerford Massacre) 'I carry the can for every lunatic in the world who goes crazy with a gun. 'But it wasn't Rambo who sent Michael Ryan mad. In fact Rambo is the opposite of people like Ryan. He is always up against stronger opposition and never shoots first. Murderers are always saying, \"God told me to kill\" or \"Jesus ordered me to kill\" - so should the rest of us stop praying? There are always sick people out there who will hang their illness on to your hook.'", "Well I mostly keep the memories of the films that were enjoyable to do close to my heart, such as the Rockys, _Paradise Alley (1978)_ (qv), _F.I.S.T. (1978)_ (qv), _Cliffhanger (1993)_ (qv), _Demolition Man (1993)_ (qv), but the most fun I ever had on a movie was with 'Dolly Parton' (qv) on _Rhinestone (1984)_ (qv). I must tell everyone right now that originally the director was supposed to be 'Mike Nichols' (qv), that was the intention and it was supposed to be shot in New York, down and dirty with Dolly and I with gutsy mannerisms performed like two antagonists brought together by fate. I wanted the music at that time to be written by people who would give it sort of a bizarre edge. Believe it or not, I contacted 'Whitesnake' (qv)'s management and they were ready to write some very interesting songs alongside Dolly's. But, I was asked to come down to Fox and out steps the director, 'Bob Clark' (qv). Bob is a nice guy, but the film went in a direction that literally shattered my internal corn meter into smithereens. I would have done many things differently. I certainly would've steered clear of comedy unless it was dark, Belgian chocolate dark. Silly comedy didn't work for me. I mean, would anybody pay to see 'John Wayne' (qv) in a whimsical farce? Not likely. I would stay more true to who I am and what the audience would prefer rather than trying to stretch out and waste a lot of time and people's patience.", "(On 'Andrey Konchalovskiy' (qv)) Andrei was a real gentleman and I thought his take on _Tango & Cash (1989)_ (qv) was very good and would've been infinitely more realistic had he been allowed to continue. His replacement was more attuned to comic pop culture so the film had a dramatic shift into a more light hearted direction.", "I would love to work with 'Quentin Tarantino' (qv) and had heard rumours about this World War II epic. I would be insane not to work with such a brilliant filmmaker. I was hoping to work with Quentin in his new _Grindhouse (2007)_ (qv) film, but unfortunately Rocky and _Rambo (2008)_ (qv) duties prevented that from happening.", "Once you've been at the helm of a film and understand the basics of 101 filmmaking, you watch other directors with an educated eye. Its like if a film is going out of control, you want to contribute and quite often, a director resists any help because it usurps his power. I can understand this. I remember my first day on _Judge Dredd (1995)_ (qv) when 'Danny Cannon' (qv) had been chosen as the director. I knew there was going to be difficulties in communication between actors, director and crewmembers, and that's exactly what happened. So I believe the film reflects that lack of unity.", "(If he'd do anything from his films differently) I would've played _Oscar (1991)_ (qv) incredibly cynical like the original French version and I would've gone back to my original premise of _Rambo III (1988)_ (qv), which was more in keeping with the theme of _Tears of the Sun (2003)_ (qv), but set in Afghanistan.", "(If he was asked to appear in _Terminator Salvation (2009)_ (qv)) No, that has never happened and I believe that's sacred ground for Arnold and would be an insult to encroach on his territory.", "The worst film I've ever made by far... maybe one of the worst films in the entire solar system, including alien productions we've never seen... a flatworm could write a better script then _Stop! Or My Mom Will Shoot (1992)_ (qv). In some countries - China, I believe - running _Stop! Or My Mom Will Shoot (1992)_ (qv) once a week on government television has lowered the birth rate to zero. If they ran it twice a week, I believe in twenty years China would be extinct.", "(On writing _Driven (2001)_ (qv)) I'd gone through - and this is not bragging but showing my inadequacies in being able to get it right - about 25 drafts. And of those, about 20 were about this one man's journey, myself, through this film, and all his trials and tribulations. He'd fallen from a great height career-wise. He was a drunkard with all these problems and accidents because he and his wife Cathy, who's played by 'Gina Gershon' (qv), had this very tumultuous relationship. (Laughs) I'm giving you a little biographical hint here. And he just started to come apart. So he was brought back as kind of like how people should never be. It's like taking kids who are truants and then taking them to prison to see where they'll end up and scaring them straight.So I was brought back to basically prove to young Jimmy Bly how he should never be, as a bad example. And then the more we worked on it, it became the dark side, a little seedy, and I didn't know where the upside of it was ever going to be. So we began to reduce his role and make it more of an ensemble, so he's just there as a guy who did his job, wasn't very spectacular, would race like hell, sometimes he'd win, sometimes lose, but he had a certain work ethic code, that old school that could be applied to Jimmy. So that all made it more ensemble, and then in the editing we reduced it even more. I originally had a relationship going with the reporter. But that began to de-emphasise the other people, so we put that on the back burner.", "(On changing _Rambo (2008)_ (qv)'s title) \"You know Lionsgate jumped the gun on this. I just was thinking that the title John Rambo was derivative of _Rocky Balboa (2006)_ (qv) and might give people the idea that this is the last Rambo film, and I don't necessarily feel that it will be. He's not an athlete, there's no reason he can't continue onto another adventure. Like 'John Wayne' (qv) with _The Searchers (1956)_ (qv).\"", "(On Adrian's death in _Rocky Balboa (2006)_ (qv)) \"In the original script, she was alive,\" reveals Stallone, 60. \"But it just didn't have the same dramatic punch. I thought, 'What if she's gone?' That would cut Rocky's heart out and drop him down to ground zero.\"", "(On _Driven (2001)_ (qv)) A lot of it's autobiographical. Racing's very much like the world of acting. You have your front runners and you have guys that are there for the long race, and you have other guys that block for other people, that are called supporting and character actors. It's all the same kind of situation. And you realize that you can't always be No. 1. You just can't be the guy in front all the time. So what you can do is lend support to, and help and nourish and encourage someone else. So it's like your experiences live on in someone else. If you can find some young actor and you can say, 'Listen, don't do this and don't do that and avoid this and that,' and share your experiences, and he does succeed, you can say, 'You know what, I kind of contributed to that.' As an actor did you have to learn you can't always be No.1 the hard way? (Laughs) Unfortuantely I did.", "(On which films he wished he hadn't done) Let me think..._Stop! Or My Mom Will Shoot (1992)_ (qv), _Oscar (1991)_ (qv), _Get Carter (2000)_ (qv), _Driven (2001)_ (qv), _Eye See You (2002)_ (qv) and certainly _Rhinestone (1984)_ (qv), which I wish had been _Romancing the Stone (1984)_ (qv).", "\"_Rocky (1976)_ (qv) was probably the purest of all my performances and the most insightful. It was far better received than I ever thought it would be. Being naive, I thought I was basically doing a film to while away the summer.The most important scene was going to be cut for lack of money [Rocky's prefight crisis of confidence, when he confides to 'Talia Shire' (qv)'s Adrian, \"I can't beat him. Who'm I kidding? All I want to do is go the distance.\"]. They were literally packing up the equipment. But I stood my ground. So they said, 'Okay, you only get one take, no angles, no coverage.' The next day, they said, 'You know, Sly, that's the most important scene in the movie.' I said, 'Thank you.\"'", "(On _Rocky II (1979)_ (qv)) \"Once you've tasted success, to follow that up is almost as interesting. Of the Rockys, it was kind of overlooked, but I think it was one of the better written ones. Everyone had their characters so down, all I had to do was say, 'Action.\"'", "(On _Paradise Alley (1978)_ (qv)) \"Also one of my better performances. The character I play is kind of distasteful, but I never worked more on trying to catch the Damon Runyonesque speech pattern. I loved directing. It just seemed to go naturally with my hyperactivity. Again - I use the word a lot - there was that naivete. But that's what was special about the early years before I became the old pro.\"", "(On _The Lords of Flatbush (1974)_ (qv)_) \"I have very fond memories of it. The acting was very naturalistic because we were really winging it, and I didn't know any 'cinema tricks.\"'", "(On _F.I.S.T. (1978)_ (qv)) A real eye-opener. That was the beginning of me understanding that I'd been typecast as _Rocky (1976)_ (qv). _F.I.S.T. (1978)_ (qv) and _Nighthawks (1981)_ (qv) people bring up the most as my most forgotten films.\"", "(On _First Blood (1982)_ (qv)) \"I thought it was going to be the end of my career. The book was interesting, but I thought he was such a psychopath, it would never fly. Every day I worried. When we saw the first cut it was devastatingly bad. My agent said, 'Maybe we can buy it back.' But we cut it to about 90 minutes, and the result was, I think, one of the better vehicles I've ever been in.\"", "(On _Rocky III (1982)_ (qv)) \"To me, it's the smoothest of them all. Again I went back into my life. Now Rocky'd become very successful, and he'd lost his eye of the tiger, his edge. He'd developed fear of trying to do things new and unknown. That movie was kind of a psychodrama for me.\"", "(On _Staying Alive (1983)_ (qv)) \"I liked John, so I thought, okay, I'll do the script. But the story was very negative - he'd gotten into drugs, his girlfriend was a prostitute. So I rewrote it from page one.\"", "(On _Nighthawks (1981)_ (qv)) \"It was a little bit ahead of its time in that I was dealing with urban terrorism. Now, with the World Trade Center, it's happening. At the time, people couldn't relate to it, and the studio [Universal] didn't believe in it. 'Rutger Hauer' (qv)'s performance held it together - he was an excellent villain.\"", "(On _Victory (1981)_ (qv)_) Working with 'John Huston' (qv) was the enticement. At time, he was not feeling very well. I envisioned it to be like a _Stalag 17 (1953)_ (qv), a depressive prisoner-of-war camp. What came out was like a holiday camp. It was just a little too benign.", "\"I started to fall prey to 'He doesn't take any chances,' and that's when I did _Rhinestone (1984)_ (qv). I thought it was going to be like a droll 'Mike Nichols' (qv) comedy, but it turned into _Porky's (1981)_ (qv) of the South. I came to the conclusion that if I want to stretch, I'll go to a gymnasium\".", "(On _Over the Top (1987)_ (qv)) \"It was not a very good experience. It was something I shouldn't have done. It caught me at a weak moment. There was a lot of money involved. And at the time I thought I could make anything work. It was just foolish.\"", "(On _Rocky IV (1985)_ (qv)) \"I knew we'd done everything possible with the Rockys, so I tried to call upon a historical event - the Joe Louis- Max Schmeling fight. Also, it was kind of like tying it to my life when you sometimes get bigger than you really are. The character overwhelms the small man who created it. Dolph was a godsend. I had looked all over for big men - but he was the perfect creature.\"", "(On _Rambo: First Blood Part II (1985)_ (qv)) \"It was released on the 10th anniversary of the end of the Vietnam war, and America was going through this sabre-rattling stage. So we just let it fly. I wrote the line, and I tried to live up to it, \"To win a war, you have to become war.\" I tried to play him as a complete machine - no sense of feelings, pain, or fear of death.\"", "(On _Cobra (1986)_ (qv)) \"My outlook at the time on police enforcement: If you play by the rules with felons, they're always going to win. So I created a character that basically gets down on their level - he was your first rock & roll cop. I tell you, if I had paid more attention to that character, he could have gone on to bigger and better things. I dropped the ball on that one.\"", "(On _Lock Up (1989)_ (qv)) \"Not a film that was produced and performed with enough maturity to really make a significant impact on the audience or my career. And that's the truth.\"", "(_Tango & Cash (1989)_ (qv)) \"Even though it had conceptual contradictions, it was a thoroughly enjoyable experience with a truly great friend in 'Kurt Russell' (qv).\"", "(On _Rambo III (1988)_ (qv)) \"There was a stunt I'm so incredibly proud of. I was on a horse and I had to reach down and pick up this sheep at a full gallop. I tore a muscle that took two years to come back. I don't know what I was thinking.\"The movie came out just when we wanted to treat the Russians as our friends. That hurt. I think if we had done the film a year earlier, the results would have been a lot different. So I've learned not to do geopolitical stories anymore.\"", "(1993) \"_Rocky V (1990)_ (qv) I loved. It lacked the fireworks, but it was the truthful segue into his life postfighting. Rocky I and Rocky V - I think they were good bookends.\"", "(On his comedies) \"The participants originally involved never came through, and I ended up working with different people, different concepts, and different scripts. I thought _Stop! Or My Mom Will Shoot (1992)_ (qv) would be a throwback to _Where's Poppa? (1970)_ (qv) And with _Oscar (1991)_ (qv), I thought I'd be doing something like _The Lavender Hill Mob (1951)_ (qv). I've studied farce - farce is a constant revving at 150 miles per hour. Those movies just went on and on with no laughs.\"", "[on his tattoos] I have all kinds of chest injuries; I tore my vein during _Rocky II (1979)_ (qv) and had 60 stitches. If you've seen _Rocky Balboa (2006)_ (qv), you'll know how bad they look. It got worse and worse, and people were saying, \"Ugh, has he got varicose veins?\" So I thought, fuck it, and covered them with a tattoo of my wife. Then the tattoo started to grow and it went to a skull and before I knew it, I was a mural.", "[in People magazine, 1985] I am not the richest, smartest or most talented person in the world, but I succeed because I keep going and going and going."], "salary history": ["_The Party at Kitty and Stud's (1970)_ (qv)::$200", "_Death Race 2000 (1975)_ (qv)::$700", "_Rocky (1976)_ (qv)::$23,000", "_Rocky III (1982)_ (qv)::$7,000,000", "_First Blood (1982)_ (qv)::$3,500,000", "_Staying Alive (1983)_ (qv)::$10,000,000", "_Rhinestone (1984)_ (qv)::$4,000,000", "_Rocky IV (1985)_ (qv)::$12,000,000", "_Cobra (1986)_ (qv)::$13,000,000", "_Over the Top (1987)_ (qv)::$13,000,000", "_Rambo III (1988)_ (qv)::$16,000,000", "_Lock Up (1989)_ (qv)::$15,000,000", "_Tango & Cash (1989)_ (qv)::$15,000,000", "_Rocky V (1990)_ (qv)::$15,000,000", "_Oscar (1991)_ (qv)::$15,000,000", "_Cliffhanger (1993)_ (qv)::$15,000,000", "_Demolition Man (1993)_ (qv)::$15,000,000", "_The Specialist (1994)_ (qv)::$12,000,000", "_Judge Dredd (1995)_ (qv)::$15,000,000", "_Assassins (1995)_ (qv)::$15,000,000", "_Daylight (1996)_ (qv)::$17,500,000", "_Cop Land (1997)_ (qv)::$60,000", "_Driven (2001)_ (qv)::$20,000,000", "_D-Tox (2002)_ (qv)::$20,000,000", "_The Expendables 2 (2012)_ (qv)::$15,000,000", "_Bullet to the Head (2012)_ (qv)::$12,000,000", "_Escape Plan (2013)_ (qv)::$10,000,000", "_The Expendables 3 (2014)_ (qv)::$15,000,000"], "birth date": "1946-07-06", "birth notes": "New York City, New York, USA", "_actorID": "65", "_source": "IMDB", "actorID": "0000230", "created_utc_dt": "09/14/2019, 13:02:12"}