{"headshot": "https://m.media-amazon.com/images/M/MV5BNWYwODAyZjAtOTQ1My00MDY2LTg0NDQtZGFiMDRiYzY4ZmM2XkEyXkFqcGdeQXVyNjg2NjQwMDQ@._V1_UY98_CR2,0,67,98_AL_.jpg", "nick names": ["Hiddles"], "birth name": "Thomas William Hiddleston", "height": "6' 2\" (1.88 m)", "mini biography": ["Thomas William Hiddleston was born in Westminster, London, to English-born Diana Patricia (Servaes) and Scottish-born James Norman Hiddleston. His mother is a former stage manager, and his father, a scientist, was the managing director of a pharmaceutical company. He started off at the preparatory school, The Dragon School in Oxford, and by the time he was 13, he boarded at Eton College, at the same time that his parents were going through a divorce. He continued on to the University of Cambridge, where he earned a double first in Classics. He continued to study acting at the Royal Academy of Dramatic Art, from which he graduated in 2005.Whilst at University of Cambridge, he was seen by the agency 'Hamilton Hodell' in the play \"A Streetcar Named Desire\" and was signed. Following this, he was cast in his first television role in _The Life and Adventures of Nicholas Nickleby (2001)_ (qv). Hiddleston won his first film role as Oakley in Joanna Hogg's award-winning first feature, _Unrelated (2007)_ (qv). His breakthrough role came when he portrayed the nemesis Loki in the Marvel Cinematic Universe feature film _Thor (2011)_ (qv). He reprised the character in _The Avengers (2012)_ (qv), _Thor: The Dark World (2013)_ (qv), _Thor: Ragnarok (2017)_ (qv) and _Avengers: Infinity War (2018)_ (qv).He has also appeared in 'Steven Spielberg' (qv)'s _War Horse (2011)_ (qv), _The Deep Blue Sea (2011)_ (qv), 'Woody Allen' (qv)'s romantic comedy _Midnight in Paris (2011)_ (qv), and the romantic vampire film _Only Lovers Left Alive (2013)_ (qv). On television, he appeared on the BBC series _The Hollow Crown (2012)_ (qv), in the adaptations of Shakespeare's \"Henry IV\" and \"Henry V\". In theatre, he has been in the productions of \"Cymbeline\" (2007) and \"Ivanov\" (2008). In December 2013, he starred as the title character in the Donmar Warehouse production of \"Coriolanus\" which played until February 2014. He won the Laurence Olivier Award for Best Newcomer in a Play for his role in \"Cymbeline\" while also being nominated for the same award the same year for his role as Cassio in \"Othello\".::Kad"], "trade mark": ["Self-described blond curly \"'Gene Wilder' (qv)\" hair.", "His wide, warm smile", "Expressive blue-green eyes", "Deep smooth voice", "Extremely polite, articulate and friendly personality"], "trivia": ["Brother of 'Emma Hiddleston' (qv) and 'Sarah Hiddleston' (qv).", "He played rugby at Cambridge University but gave up for his love of acting.", "He grew up in Wimbledon in London, and was sent to boarding school in Oxfordshire (called the Dragon School) at the age of seven. His family moved from London to Oxfordshire three years later. When he was 13 he started at Eton College, where he was also a boarder.", "His parents divorced when he was 13.", "His favorite film is _Heat (1995)_ (qv).", "He screen tested for the title role in _Thor (2011)_ (qv), maintaining a strict diet and gaining 20 pounds in muscle. However, 'Kenneth Branagh' (qv) decided he was more suitable for the role of Loki.", "His maternal great-grandfather, Reginald Maxwell Servaes, was a prominent Vice Admiral, a Flag Officer commanding the Reserve Fleet, and his maternal great-great-grandfather was importer Sir 'Edmund Vestey' (qv), 1st Baronet.", "Won Third Prize at the Ian Charleson 'Awards' (qv) in 2007.", "Won Best Supporting Actor in a Play at the Whatsonstage.com Theatregoers' Choice 'Awards' (qv) in 2009.", "Won Rising Star Award at the Richard Attenborough UK Regional Film Critics' 'Awards' (qv) in 2012.", "Won Best Male Newcomer at the Jameson Empire 'Awards' (qv) in 2012.", "As well as younger sister, Emma, he also has an older sister named Sarah.", "His favorite superhero is Superman.", "Very good friends with 'Chris Hemsworth' (qv).", "His father is Scottish. His mother is English, and has English, and some German and Scottish, ancestry. One of Tom's maternal great-great-grandfathers was of German origin.", "Ranked #2 on Empire magazine's 100 Sexiest Movie Stars list (2013).", "Graduated from the University of Cambridge with a double first in Classics.", "Graduated from Royal Academy of Dramatic Art (RADA) in London, England.", "His mother is a former stage manager and still (as of 2018) works in arts marketing and fund-raising. His father is a scientist and was the director of a pharmaceutical company.", "His great-great-grandfather was Sir 'Edmund Vestey' (qv), 1st Baronet, an English importer who was created a Baronet for supplying food to British troops during the First World War.", "Won the Laurence Olivier Award for Best Newcomer in a Play (2008), an esteemed honor that recognizes the best in London theatre.", "In January 2013, he traveled with UNICEF UK to Guinea, West Africa, to visit children, families and communities. He continues to remain involved with the organization.", "Nominated for the Laurence Olivier Award for Best Actor, for playing the title role in Shakespeare's \"Coriolanus\" at Domnar Warehouse (2014).", "Won Best Actor Award at the 2014 Evening Standard Theatre 'Awards' (qv), for playing the title role in Shakespeare's \"Coriolanus\" at Donmar Warehouse.", "Won Best Male Principal Performance Award at the 2014 Falstaff 'Awards' (qv), for playing the title role in Shakespeare's \"Coriolanus\" at Donmar Warehouse.", "He speaks some conversational French and Spanish (but is not fluent in either language), and learned Latin and Greek at university. He generally tries to learn a few words or phrases in the language of any country he visits, and is a quick learner with a keen ear for languages. Contrary to fan reports he does not speak Italian, as there is a video of him saying a few words in Italian and admitting that is all the Italian he knows.", "Was in the same class as both 'Prince William' (qv) and 'Eddie Redmayne' (qv) at the boarding school Eton College.", "As of 2015, he has appeared in two films which were nominated for the Academy Award for Best Motion Picture of the Year: _Midnight in Paris (2011)_ (qv) and _War Horse (2011)_ (qv).", "He read \"The Politics of the Family and Other Essays\" by 'R.D. Laing' (qv) in preparation for his role in _Crimson Peak (2015)_ (qv).", "His favorite music video is \"Weapon of Choice\" by 'Fatboy Slim' (qv).", "His favorite books are \"Anna Karenina\" by 'Leo Tolstoy' (qv) and \"Any Human Heart\" by 'William Boyd' (qv).", "He generally runs five miles every morning, however, in preparation for _I Saw the Light (2015)_ (qv), he ran ten miles each morning, and also cycled in order to gain a pencil-thin figure for his role as 'Hank Williams' (qv).", "His eyes water involuntarily when he is spooked.", "He viewed an autopsy to prepare for his role as a physiologist in _High-Rise (2015)_ (qv).", "A cousin of 'Edmund Vestey' (qv) and 'Samuel Vestey' (qv). Tom's great-great grandfather and Edmund's grandfather, Edmund Hoyle Vestey (1866-1953), was the co-founder of international food product giant Vestey Brothers (later renamed The Vestey Group) with his brother, William (Samuel's grandfather). Edmund Hoyle Vestey and William Vestey were each created Baronets by 'King George V' (qv) for their services in supplying food to British troops during the First World War.", "Math is the one subject he has not excelled in.", "Plays the piano and is a keen guitar player having learned for the movie I Saw the Light. He also played the trumpet as a child, and had to learn how to play the drums and the lute for Only Lovers Left Alive.", "His more avid fans are often referred to as \"Hiddlestoners\".", "Won Best Actor Award at the 2016 National Film 'Awards' (qv) UK for his role in _High-Rise (2015)_ (qv).", "Was once considered to portray James Bond after Daniel Craig.", "Learned to surf in Hawaii while filming 'Kong: Skull Island'.", "Sang all his own vocals for his performance as 'Hank Williams' (qv) in 'I Saw the Light'. Most of the songs he previously recorded in studio and lip synced will filming but two of the songs he sang live on camera while filming.", "Is a massive Shakespeare fan, he claims he feels most alive while preforming Shakespeare.", "Is a master celebrity impressionist and is often asked in interviews and fan events to do them. He even once did a 'Robert De Niro' (qv) impression for 'Robert De Niro' (qv).", "Knows how to juggle.", "Has selachophobia, the fear of sharks.", "Loves to dance.", "He played with 'Eddie Redmayne' (qv) in a school production of 'a passage to India' by E.M. Forster. He played the front right leg of the elephant that rode to the Marabar caves. The elephant consisted of 4 actors, a table with a cushion and a tablecloth. On top of the elephant sat 'Eddie Redmayne' (qv) who played the female lead."], "quotes": ["Showing young children in these communities, that there are outlets for their feelings, that there is room in a space for their stories to be told, and that they will be applauded-and it's not about ego, it's about connection: that their pain is everybody else's pain.", "Never stop. Never stop fighting. Never stop dreaming. And don't be afraid of wearing your heart on your sleeve - in declaring the films that you love, the films that you want to make, the life that you've had, and the lives you can help reflect in cinema. For myself, for a long time... maybe I felt inauthentic or something, I felt like my voice wasn't worth hearing, and I think everyone's voice is worth hearing. So if you've got something to say, say it from the rooftops.", "I am very proud of my work for the BBC, but I never wanted to stay stuck in the past. Loki has set me free from a particular casting type. But the work is the same. Rigor, discipline, humility, punctuality, above all: truthfulness. [CNN.com, 9 May 2012]", "[on working on _War Horse (2011)_ (qv) and _Midnight in Paris (2011)_ (qv)] I'm enormously proud of it because I'm a significant part of both those films.", "[on being directed by 'Steven Spielberg' (qv) and 'Woody Allen' (qv) for their Oscar-nominated movies] It was a massive honor to work with Woody and Steven.", "I'm so moved and humbled by [the fans] responses to _The Hollow Crown (2012)_ (qv) and Henry IV. I've never worked harder on anything in my life. It means the world.", "[on being a part of a movement of young and interesting British actors] If I'm a part of it, I'm flattered. It's interesting, because I used to look up for inspiration, like every actor does, to people like 'Daniel Day-Lewis' (qv), 'Robert De Niro' (qv), 'Kenneth Branagh' (qv)... Now I look sideways. I worked with 'Benedict Cumberbatch' (qv) on _War Horse (2011)_ (qv), then he went off to do _Tinker Tailor Soldier Spy (2011)_ (qv). He was so good. I was so proud to call him my friend - it's one of the most electrifying performances by an actor this year. 'Tom Hardy' (qv) - he's doing things that I think no British actor has ever done. His performance in _Warrior (2011)_ (qv) was visceral, pure and muscular, and it made me cry. 'Michael Fassbender' (qv) has had an annus mirabilis with _A Dangerous Method (2011)_ (qv) and his studio breakthrough in _X-Men: First Class (2011)_ (qv), where, hands down, he and 'James McAvoy' (qv) were the best things in it.", "To have compassion for a character is no different from having compassion for another human being.", "I gave myself permission to care, because there are a lot of people in this world who are afraid of caring, or afraid of showing that they care because it's uncool. It's uncool to have passion. It's so much easier to lose when you've shown everyone how much you don't care if you win or lose. It's much harder to lose when you show that you care, but, you'll never win, unless you also stand to lose. Don't be afraid of your passion.", "[on coping with the end of a long shoot] You get used to it - you have to - otherwise you'd spend your life being heartbroken. But it never stops being sad because for that short time you become a family. You do, you see the same people every day for sixteen hours a day, for months on end, and you're so bound together by your common purpose, which is to make a great film.", "I get asked to play a lot of complex people, which is great because I think that people are complex, much more so than any of us are really willing to let on. There is an enormous pressure to conform to what's conventional now, and I think people are quite afraid of individuality, actually.", "[on shooting _Thor: The Dark World (2013)_ (qv) in Iceland] Iceland is one of the few places on earth that looks like another world because the landscape is so extraordinary. The dimensions are bigger, the proportions are bigger, a big hill is absolutely enormous, and the colour of the water has a translucency that I've never seen before. The sky seems twice the size, and some of it looks like a moonscape to me... You still walk down the street in Reykjavik and run into five people who are called Thor. To be on the land that invented this mythology was extraordinary.", "[on portraying Loki, the legendary Nordic god of mischief] The key thing about any character I play is I have to start from a place of compassion. My stepping into the silhouette comes from attempting to understand his point-of-view. So even though he is and has been regarded as villain, antagonist, antihero, in my mind - as I play him - I have to fight in his corner. Having said that, from an objective intellectual standpoint, Loki is a deeply mixed-up cat.", "[observation, 2014] All the greatest actors allow themselves to grow. I don't know which way the wind will blow for me, but I know that I'm along for the ride.", "[PopcornTaxi, 10/8/2013] I suppose if I have one fear in my life, it's a fear of wasting time. And um, I don't want to look back at my life and think \"God, I wish I had done all of this stuff.. that I always wanted to do-- but I didn't do it because I was afraid, or because someone was gonna take a pot shot at me, or because I might fail.\" Or, um--that's, to me, that is the greatest tragedy: is to look back and say \"I wish I had, and I didn't.\" Em, and I think, at a certain time, I just refused to let that be a factor in anything.", "[on being a fan of Michael Haneke's Amour] That film is like a mountain. It's a piece of wisdom that is in the background every day and Haneke has just shown it, saying, \"So you know, this is what you want. This is the intimacy that you'll be lucky to have when you get to the end of your life...\" When I saw it, I couldn't stop thinking about that film for an entire month. It just made everything else seem so flippant and disposable. It is really truly a perfect movie.", "My experience is that camera has an extraordinary truthfulness and you can't lie in front of it. Terence Davies, the director, said to me once, \"The camera captures the truth, but it also captures falsity. So if you don't feel it, don't do it.\".", "The reason I became an actor is because I sat in the audience of... you know... in cinema audience, and also in the theater, and... I love it when you go to see something, and you enter as an individual and you leave as a group, because you all been bound together by the same experience.", "[on the challenge of wrestling with language in Shakespeare] Yes, there's a rigour to it. But it's all about readiness. If you have done the work, then it's easier. If it's in your hard drive then you're away. I compare it to Happy Birthday. If I asked you to recite that, you wouldn't have to think about it. It's just inside you. If I asked you to sing it a different way, you wouldn't have to think. That's my approach to Shakespeare: know it that well."], "salary history": ["_The Avengers (2012)_ (qv)::$160,000"], "birth date": "1981-02-09", "birth notes": "Westminster, London, England, UK", "_actorID": "46", "_source": "IMDB", "actorID": "1089991", "created_utc_dt": "09/14/2019, 13:01:55"}