{"headshot": "https://m.media-amazon.com/images/M/MV5BMjE5NDU2Mzc3MV5BMl5BanBnXkFtZTcwNjAwNTE5OQ@@._V1_UY98_CR3,0,67,98_AL_.jpg", "nick names": ["D"], "birth name": "Denzel Hayes Washington Jr.", "height": "6' 1\" (1.85 m)", "mini biography": ["Denzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis, from Georgia, and a Pentecostal minister father, 'Denzel Washington' (qv), Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University, intent on a career in journalism. However, he caught the acting bug while appearing in student drama productions and, upon graduation, he moved to San Francisco and enrolled at the American Conservatory Theater. He left A.C.T. after only one year to seek work as an actor. His first paid acting role was in a summer stock theater stage production in St. Mary's City, Maryland. The play was \"Wings of the Morning\", which is about the founding of the colony of Maryland (now the state of Maryland) and the early days of the Maryland colonial assembly (a legislative body). He played the part of a real historical character, Mathias Da Sousa, although much of the dialogue was created. Afterwards he began to pursue screen roles in earnest. With his acting versatility and powerful presence, he had no difficulty finding work in numerous television productions.He made his first big screen appearance in _Carbon Copy (1981)_ (qv) with 'George Segal' (qv). Through the 1980s, he worked in both movies and television and was chosen for the plum role of Dr. Philip Chandler in NBC's hit medical series _St. Elsewhere (1982)_ (qv), a role that he would play for six years. In 1989, his film career began to take precedence when he won the Oscar for Best Supporting Actor for his portrayal of Tripp, the runaway slave in 'Edward Zwick' (qv)'s powerful historical masterpiece _Glory (1989)_ (qv).Washington has received much critical acclaim for his film work since the 1990s, including his portrayals of real-life figures such as South African anti-apartheid activist Steve Biko in _Cry Freedom (1987)_ (qv), Muslim minister and human rights activist 'Malcolm X' (qv) in 'Malcolm X' (qv) (1992), boxer Rubin \"Hurricane\" Carter in _The Hurricane (1999)_ (qv), football coach 'Herman Boone' (qv) in _Remember the Titans (2000)_ (qv), poet and educator Melvin B. Tolson in _The Great Debaters (2007)_ (qv), and drug kingpin Frank Lucas in _American Gangster (2007)_ (qv). 'Malcolm X' (qv) and The Hurricane garnered him Oscar nominations for Best Actor, before he finally won that statuette in 2002 for his lead role in _Training Day (2001)_ (qv).Through the 1990s, Denzel also co-starred in such big budget productions as _The Pelican Brief (1993)_ (qv), _Philadelphia (1993)_ (qv), _Crimson Tide (1995)_ (qv), _The Preacher's Wife (1996)_ (qv), and _Courage Under Fire (1996)_ (qv), a role for which he was paid $10 million. He continued to define his onscreen persona as the tough, no-nonsense hero through the 2000s in films like _Out of Time (2003)_ (qv), _Man on Fire (2004)_ (qv), _Inside Man (2006)_ (qv), and _The Taking of Pelham 123 (2009)_ (qv). Cerebral and meticulous in his film work, he made his debut as a director with _Antwone Fisher (2002)_ (qv); he also directed _The Great Debaters (2007)_ (qv) and _Fences (2016)_ (qv).In 2010, Washington headlined _The Book of Eli (2010)_ (qv), a post-Apocalyptic drama. Later that year, he starred as a veteran railroad engineer in the action film _Unstoppable (2010)_ (qv), about an unmanned, half-mile-long runaway freight train carrying dangerous cargo. The film was his fifth and final collaboration with director 'Tony Scott' (qv), following _Crimson Tide (1995)_ (qv), _Man on Fire (2004)_ (qv), _Déjà Vu (2006)_ (qv) and The Taking of Pelham 1 2 3. He has also been a featured actor in the films produced by 'Jerry Bruckheimer' (qv) and has been a frequent collaborator of director 'Spike Lee' (qv).In 2012, Washington starred in _Flight (2012)_ (qv), for which he was nominated for an Academy Award for Best Actor. He co-starred with 'Ryan Reynolds' (qv) in _Safe House (2012)_ (qv), and prepared for his role by subjecting himself to a torture session that included waterboarding. In 2013, Washington starred in _2 Guns (2013)_ (qv), alongside 'Mark Ryan Walberg' (qv). In 2014, he starred in _The Equalizer (2014)_ (qv), an action thriller film directed by 'Antoine Fuqua' (qv) and written by 'Richard Wenk' (qv), based on the television series of same name starring 'Edward Woodward' (qv). During this time period, he also took on the role of producer for some of his films, including The Book of Eli and Safe House.In 2016, he was selected as the recipient for the Cecil B. DeMille Lifetime Achievement Award at the 73rd Golden Globe 'Awards' (qv).He lives in Los Angeles, California with his wife, 'Pauletta Washington' (qv), and their four children.::Tom McDonough and Pedro Borges"], "spouse": ["'Pauletta Washington' (qv)::(25 June 1983 - present) ( 4 children)"], "trade mark": ["Often portrays real people: Rubin \"Hurricane\" Carter in _The Hurricane (1999)_ (qv), 'Malcolm X' (qv) in 'Malcolm X' (qv) (1992), 'Herman Boone' (qv) in _Remember the Titans (2000)_ (qv), Frank Lucas in _American Gangster (2007)_ (qv), Steve Biko in _Cry Freedom (1987)_ (qv) and Melvin Tolson in _The Great Debaters (2007)_ (qv).", "Frequently plays military commanders and law enforcement officers", "In almost all the films - e.g. _Man on Fire (2004)_ (qv), _American Gangster (2007)_ (qv), _John Q (2002)_ (qv) - where he handles or uses sidearms (usually a 9mm Beretta or similar pistols), there's a scene of him swiftly ejecting a bullet from the loaded chamber by pulling back the slide assembly and subsequently catching the bullet before it falls to the ground.", "Fiery anger-driven tirades", "Frequently works with directors 'Spike Lee' (qv), 'Tony Scott' (qv), 'Edward Zwick' (qv), and 'Antoine Fuqua' (qv)", "Frequently when his character is making a decision or changing his course of action, he will say, \"Okay. Okay.\""], "trivia": ["Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#77) (1995).", "Son, Malcolm, was named in honor of 'Malcolm X' (qv).", "To prepare for his role as boxer 'Rubin 'Hurricane' Carter' (qv) in _The Hurricane (1999)_ (qv), Washington worked out for a year with Los Angeles boxing trainer 'Terry Claybon' (qv).", "Received his Bachelor's degree in Journalism from Fordham University in New York City.", "1996 Harvard Foundation Award", "In a 'News' (qv)week cover story about the biological basis of the perception of beauty, he was used as a key example in a scientific explanation why he is considered an extremely handsome man.", "Chosen by People magazine as one of the 50 Most Beautiful People in the World (1990).", "According to a 1995 Premiere magazine article, Denzel confronted director 'Quentin Tarantino' (qv) when he visited the set of _Crimson Tide (1995)_ (qv). Quentin had done an uncredited rewrite of the script. Denzel lambasted Tarantino about his use of racial slurs in his films. Tarantino got embarrassed and wanted to move the conversation to a more private area. Denzel said, \"No, if we're going to discuss it, let's discuss it now.\" Denzel later said he still felt that Quentin was \"a fine artist\".", "Denzel is named after his father who was in turn named after the doctor, Doctor Denzel, who had delivered him.", "In the early 1980s, years before he portrayed 'Malcolm X' (qv) in the 'Spike Lee' (qv) film 'Malcolm X' (qv) (1992), Washington portrayed Malcolm in the off-Broadway production of \"When the Chickens Came Home to Roost\", at the Henry Street Theatre in New York City.", "Frequent collaborator of 'Spike Lee' (qv).", "Named one of E!'s \"top 20 entertainers of 2001\".", "Supports charities such as the 'Nelson Mandela' (qv) Children's Fund, and the Gathering Place (an AIDS hospice).", "Met his wife 'Pauletta Washington' (qv) in 1977 when both had small roles in the television movie _Wilma (1977)_ (qv) (she was billed as Pauletta Pearson), the story of runner 'Wilma Rudolph' (qv). They wed five years later.", "His father was a Pentecostal minister; his mother a beautician and former gospel singer. They divorced when he was 14.", "Is a spokesperson for the Boys and Girls Clubs of America, having been a member of the Boys Club once himself.", "Only the second black actor (after 'Sidney Poitier' (qv)) to win the Academy Award for Best Actor in a Leading Role (for _Training Day (2001)_ (qv)). Poitier received the honorary Academy Award that same year.", "Named by People magazine as one of the 50 Most Beautiful People in the World (2002).", "Ranked #28 in Premiere magazine's 2003 annual Power 100 List. Had ranked #40 in 2002.", "Cousin is newsman 'Ukee Washington' (qv), who co-anchors the news on the CBS affiliate in Philadelphia.", "He and his family are members of the same church as actors 'Dwayne Winstead' (qv), 'Sy Richardson' (qv), 'Marvin Wright-Bey' (qv) and 'Fitz Houston' (qv).", "Was awarded the title of \"Police Chief for a Day\" when he was a member of The Boys and Girls Club of America as a child. The photo was shown during his latest appearance on _Live! with Kelly (1988)_ (qv).", "'Tom Hanks' (qv) said working with Washington on _Philadelphia (1993)_ (qv) was like \"going to film school\". Hanks said he learned more about acting by watching Denzel than from anyone else.", "He was at his mother's beauty parlor, when a woman getting her hair done saw him and told someone to get her a piece of paper and she wrote at the top \"Prophecy\" and then wrote that Denzel would grow up and one day speak to millions. Denzel kept the bit of paper in his wallet. The woman was known as a prophetess in their church and community.", "Cites star-athletes like 'Jim Brown' (qv) and 'Gale Sayers' (qv) as the role models of his youth.", "First studied Biology in hopes of becoming a doctor, then switched to Political Science then to a Journalism/Drama major in college.", "Has worn some kind of military uniform in at least six of his films.", "Ranked #59 on VH1's 100 Hottest Hotties", "Premiere magazine ranked him as #39 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature (2005).", "Chosen as People magazine's Sexiest Man Alive (1996).", "Is the first African-American actor to receive two Academy 'Awards' (qv).", "Has played two soldiers who have suffered traumatic, life-changing experiences while fighting in the 1991 Persian Gulf War: Lt. Colonel Nathaniel Serling in _Courage Under Fire (1996)_ (qv) and Major Ben Marco in _The Manchurian Candidate (2004)_ (qv).", "Though his first theatrical film was a comedy (_Carbon Copy (1981)_ (qv)), he has only done three more since. Has mentioned that he's always wanted to do a great one.", "He and his family visited the troops at Brook Army Medical Center, in San Antonio, Texas (BAMC). There are some buildings there called Fisher Houses. The Fisher House is a Hotel where soldiers' families can stay, for little or no charge, while their soldier is staying in the Hospital. BAMC has quite a few of these houses on base, but as you can imagine, they are almost filled most of the time. He was given a tour of one of the Fisher Houses and subsequent to his visit sent them one of the largest donations they've ever received.", "Is the second of three children.", "As of 2018, he is the most Oscar-winning (two) and most nominated (nine) black actor/actress in Academy history.", "Son 'John David Washington' (qv) recently signed as a running back with the St. Louis Rams. [May 2006]", "Has two films on the American Film Institute's 100 Most Inspiring Movies of All Time. They are: _Glory (1989)_ (qv) at #31 and _Philadelphia (1993)_ (qv) at #20.", "Has worked with both 'Ridley Scott' (qv) and 'Tony Scott' (qv). Ridley directed him in _American Gangster (2007)_ (qv). He has worked with Ridley's brother, Tony, on five films, which are: _Crimson Tide (1995)_ (qv), _Man on Fire (2004)_ (qv), _Deja Vu (2006)_ (qv), _The Taking of Pelham 123 (2009)_ (qv) and _Unstoppable (2010)_ (qv).", "Turned down _Se7en (1995)_ (qv). He opted to do another detective thriller that year, _Devil in a Blue Dress (1995)_ (qv).", "Claims his personal favorite performances are his works in _Cry Freedom (1987)_ (qv), _Glory (1989)_ (qv), 'Malcolm X' (qv) (1992) and _Training Day (2001)_ (qv).", "Turned down the role of Detective David Mills in _Se7en (1995)_ (qv), which went to 'Brad Pitt' (qv).", "Turned down the role of Cinque in _Amistad (1997)_ (qv), which went to 'Djimon Hounsou' (qv).", "His daughter, 'Katia Washington' (qv), currently attends Yale University.", "Good friends with actress 'Julia Roberts' (qv).", "Voted as America's Favorite Movie Star in the 2006 and 2007 Harris Polls.", "At one point, was to star as Dr. Alex Cross in _Kiss the Girls (1997)_ (qv), but had to drop out due to scheduling conflicts.", "Received an honorary degree (Doctor of Humane Letters) from Morehouse College in Atlanta, Georgia on May 20, 2007.", "Son of 'Lennis Washington' (qv), a beautician and former Gospel singer.", "Almost every summer he and his family go to Italy on vacation.", "For _Courage Under Fire (1996)_ (qv), he trained at the National Training Center at Fort Irwin in California, where he qualified on the M1A1 tank and the 120mm gun, participated in battle games and listened to audiotapes of tank battles in Desert Storm.", "To prepare for his attorney role in _Philadelphia (1993)_ (qv), he met with two lawyers who were about to become celebrities in their own right: 'Johnnie L. Cochran Jr.' (qv) and 'Carl Douglas' (qv).", "He spent months on the beat with Washington Post reporters to prepare for _The Pelican Brief (1993)_ (qv).", "Has worked with both Fanning sisters. He worked with 'Dakota Fanning' (qv) in _Man on Fire (2004)_ (qv); he worked with (although did not have any scenes with) 'Elle Fanning' (qv) in _Deja Vu (2006)_ (qv).", "According to Forbes, for each dollar he got paid, his movies averaged $10 of gross income. [December 2007]", "In 2006, he donated $1 million to Save Africa's Children.", "When Washington won the Best Actor Oscar for _Training Day (2001)_ (qv), 'Halle Berry' (qv) won the Best Actress Oscar for _Monster's Ball (2001)_ (qv), and 'Sidney Poitier' (qv) won the Honorary Award (2001), 2002 marked the first time in Academy 'Awards' (qv) history that three African-Americans so dominated the Oscar ceremonies (2002).", "Is a huge fan of the television series _Monk (2002)_ (qv). He requested 'Ted Levine' (qv) to play a role in _American Gangster (2007)_ (qv) because he was a fan of the series. He also worked with 'Tony Shalhoub' (qv) in _The Siege (1998)_ (qv).", "Named 'Gene Hackman' (qv), 'Angelina Jolie' (qv) and 'Dakota Fanning' (qv) as the most talented actors he has ever worked with.", "The actors he most wants to work with are 'Al Pacino' (qv) and 'Robert De Niro' (qv). The director he most wants to work with is 'Martin Scorsese' (qv).", "He turned down 'Brad Pitt' (qv)'s role in _Se7en (1995)_ (qv), telling Entertainment Weekly that the film was too \"dark and evil.\" Washington later regretted his decision upon seeing a screening.", "Was the original choice to play the title character in _Blade (1998)_ (qv), which went to 'Wesley Snipes' (qv).", "Was considered for the role of Detective Ricardo Tubbs on _Miami Vice (1984)_ (qv), which went to 'Philip Michael Thomas' (qv).", "Broke the pinky finger of his right hand during a childhood basketball accident and never had it set correctly, resulting in the finger healing in a crooked position. The finger is still crooked to this day, bent at the bottom knuckle a full 45 degrees outward from his other fingers.", "(November 11, 2008) Attended the star-studded opening of Dubai's lavish Atlantis Palms resort. Guests were welcomed in style with a display of one million fireworks, said to be visible from space.", "As of 2019, 'Denzel Washington' (qv), 'Mahershala Ali' (qv) and sound engineers 'Willie D. Burton' (qv) and 'Russell Williams II' (qv) are the only African-Americans to win two Oscars.", "Brother-in-law of actress 'Rita Pearson' (qv).", "His performance as 'Malcolm X' (qv) in 'Malcolm X' (qv) (1992) is ranked #17 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "Was considered for the role of Curtis Taylor Jr. in _Dreamgirls (2006)_ (qv). However, 'Jamie Foxx' (qv) was cast instead.", "Performed all of his own stunts for the hand to hand fight sequences in the post-apocalyptic action film _The Book of Eli (2010)_ (qv).", "He has served as the national spokesperson for Boys & Girls Clubs of America since 1993 and has appeared in public service announcements and awareness campaigns for the organization. In addition, he has served as a board member for Boys & Girls Clubs of America since 1995. Due to his philanthropic work with the Boys & Girls Club, PS 17X, a New York City Elementary School decided to officially name their school after Washington.", "Lives in Los Angeles, California.", "Likes to point out the difference between his father's and his first name: Denzel. Though both are spelled the same, his dad's name is pronounced with the stress on the first syllable - DEN-zel, whereas the actor's name is pronounced - den-ZEL.", "Among his favorite black actors are - 'Idris Elba' (qv) and 'Chiwetel Ejiofor' (qv) - who happen to be British, and both of whom co-starred with Washington in _American Gangster (2007)_ (qv).", "Has worked twice with 'Chiwetel Ejiofor' (qv). In _Inside Man (2006)_ (qv), they played police detectives; in _American Gangster (2007)_ (qv), they played criminals.", "Has starred in four remakes of films, _The Manchurian Candidate (2004)_ (qv), _The Taking of Pelham 123 (2009)_ (qv), _Man on Fire (2004)_ (qv), and _The Magnificent Seven (2016)_ (qv), and one of a television series, _The Equalizer (2014)_ (qv) (and its sequel _The Equalizer 2 (2018)_ (qv)).", "The longest he has gone without an Oscar nomination is 11 years, between _Training Day (2001)_ (qv) and _Flight (2012)_ (qv).", "Won the 2010 Tony Award for Best Actor in a Play for \"Fences\".", "'Eva Mendes' (qv) and 'Paula Patton' (qv) have each played his love interest twice - Mendes in _Training Day (2001)_ (qv) and _Out of Time (2003)_ (qv), and Patton in _Deja Vu (2006)_ (qv) and _2 Guns (2013)_ (qv).", "Became a father for the 1st time at age 29 when his wife 'Pauletta Washington' (qv) gave birth to their son 'John David Washington' (qv) on July 28, 1984.", "Revealed on _The Graham Norton Show (2007)_ (qv) that he dislocated his right hand little finger while playing football, so much so that it frequently pops out of joint. In several of his films, this would happen in the middle of a take, so he can frequently be seen fidgeting to conceal or fix it. He has since had the condition surgically corrected.", "Became a father for the 2nd time at age 32 when his wife 'Pauletta Washington' (qv) gave birth to their daughter 'Katia Washington' (qv) on November 27, 1987.", "Became a father for the 3rd and 4th time at age 36 when his wife 'Pauletta Washington' (qv) gave birth to their twins Malcolm Washington and 'Olivia Washington' (qv) on April 10, 1991.", "Became only the sixth actor to win both leading and supporting acting Oscars. The other five are 'Robert De Niro' (qv), 'Gene Hackman' (qv), 'Kevin Spacey' (qv), 'Jack Lemmon' (qv) and 'Jack Nicholson' (qv).", "He was the recipient of the Cecil B. DeMille Award at the 73rd Golden Globe 'Awards' (qv).", "Dropped out of junior college with a 1.7 GPA.", "Directed 2 actors to an Oscar nominated performance: 'Viola Davis' (qv) and himself. Davis won for her performance in _Fences (2016)_ (qv).", "Friends with 'Samuel L. Jackson' (qv), 'Viola Davis' (qv), 'Daryl Mitchell' (qv), 'Michelle Pfeiffer' (qv), 'Mykelti Williamson' (qv), and 'Tom Hanks' (qv).", "As of 2018, has appeared in only two Oscar Best Picture nominees: _A Soldier's Story (1984)_ (qv) and _Fences (2016)_ (qv), the fewest among male actors with at least four acting Oscar nominations.", "As of 2018, has never appeared in a Best Picture Oscar winner.", "The September 25, 1985, edition of Variety announced the film \"Reunion\" directed by 'Reggie Life' (qv) had begun filming in Trenton, NJ, and New York. Actors were 'Denzel Washington' (qv)n and 'Terry Alexander' (qv). The film was never released.", "Universal Pictures approached him for the role of Mr. Nobody in _Furious 7 (2015)_ (qv), but he turned down the role. So 'Kurt Russell' (qv) was cast instead.", "He was considered for 'Wesley Snipes' (qv)' roles in _Jungle Fever (1991)_ (qv), _White Men Can't Jump (1992)_ (qv) and _Blade (1998)_ (qv)."], "quotes": ["(In 1998) Acting's like someone asking you for years to write the characters, but they write the book.", "I'm very proud to be black, but black is not all I am. That's my cultural historical background, my genetic makeup, but it's not all of who I am nor is it the basis from which I answer every question.", "[on where he likes to keep his Oscars] Next to each other.", "[on approaching 50] I have a friend who says \"The first 50 was for them, this 50's for me.\" I like that. The weirdest part of it, or even the saddest part, is that you start to see people die. You go \"Man! He wasn't even that old.\" I lost a friend recently who died of a heart attack. He was 58. When I was 20, 58 was old. It ain't now.", "[on working with young female co-stars] That ain't fair, really. 'Michelle Pfeiffer' (qv) hasn't been finding a lot of work recently because she doesn't like what a woman her age is offered. That's a real double standard. You get 'Sean Connery' (qv), who gets older and older, still playing opposite young ladies, but it doesn't work the other way around.", "[on shooting action scenes] I have to try and find a way to remain positive because those days are boring to me, really, just hanging off the side of a building, fighting or grunting.", "People say, \"Congratulations, you finally got the Oscar\", and I have to correct them: \"Actually, it's my second one. I won for _Glory (1989)_ (qv) in 1989.\" Some people say, \"Yeah, but that was for a supporting actor role\", but for me, it's the same thing.", "[on what roles he would like to redo] Probably Shakespeare. I did \"Othello\" in college, and \"Richard III\", and those are the two roles I'd like to revisit. Movies? There's a couple I wish I hadn't done. I won't say which ones, but there are a couple of mistakes there.", "[on being late for the 1987 Oscars] I was a mess. I don't know if I ate bad food or if it was too much tension, but I got sick. There was a huge traffic jam, and I remember saying \"Look, it took me all this time to get here - I'm showing up in a limousine and I don't care how late I am.\" By the time I got there, there was no red carpet. Everyone was inside because the show had already started.", "(when asked which does he call home, Los Angeles or New York City) I root for the Knicks. I root for the Yankees.", "(when asked what prompted him to go to Hollywood) The only way I'm going to L.A. is with a job.", "I remain thankful for the gifts that I've been given and I try to use them in a good way, in a positive way.", "Acting is just a way of making a living, the family is life.", "For the movie _Glory (1989)_ (qv), before going out to shoot the whipping scene, I'm backstage in a room, and I'm thinking, how am I gonna do this scene? All I did - you know people ask me, how did you prepare? - I say, I prayed. And I got on my knees and they were waiting for me, and I prayed. And then I prayed to all the spirits. I said, \"Look fellas, ladies\" and I'm talking about those who have been, and I said, \"Look I don't know, I'm just rolling with you all. Just whatever happens, I'm going. And I said are you with me? Come on!\" I'm serious! And I went out there and what hit me was, I'm in charge. Never put my head down. This isn't the first time this has happened to me, the character - and ,in fact, I had the guy build all the scars to put on my back - and I went out there with an attitude that I'm going to take this and not fold. But it hurt. And the tear was actually real. You know, you just allow it and you're thankful for it. It's not technical. It's not science. It's spirit.", "(on refusing the role in _Amistad (1997)_ (qv)) I just didn't see myself in _Amistad (1997)_ (qv). I ain't putting no chains around my neck. I'm not in the mood right now, too edgy. It just wasn't for me. I'm not having it. I'm like, \"Yeah, that's what happened then, but how about me cutting everybody's head off and end the movie there?\".", "(on making movies) It's simple: You get a part. You play a part. You play it well. You do your work and you go home. And what is wonderful about movies is that once they're done, they belong to the people. Once you make it, it's what they see. That's where my head is at.", "(1998 quote on his career) With four children I have to maximize the work I do now financially. It's like I have to do one film for financial reasons, as opposed to when I was single, or before we had all of these children. I find that I'm not as good at not working as I thought I would be. I get itchy. My wife also says I'm only good for about three weeks of downtime. But I'm learning a decent pace now. I try to take four or five months off between jobs.", "(1998 quote on his long-standing marriage) She puts up with me. I think, also, in a way the traveling helps. We're able to travel together and also be apart sometimes. Not everybody gets to live like that. Twenty years now. It's like you start to pat yourself on the back when you look around you and you see that very few people have 20 years into a marriage.", "(on what he enjoys about making films) The magic. There's fun creating that magic. Bringing something to life, whatever. Putting together a character. The twists and the turns that people don't expect. So to sit around and talk about it before someone sees it is boring. I think there should be some mystery in it. Who wants to know everything about it? I think it ruins movies when you know everything about how the movie was made and put together. If you explain, it's like showing you the trick before I show you the magic. Let me explain to you how it works. All right, now come see the show. It's supposed to be magic. And being an actor is about creating that magic.", "(on what inspires him as an actor) I like to go to new places. To specify, it is to say that I like not knowing. I like knowing when I get there. I know when it starts coming around and it raises the hair or it doesn't. I was trained in the theater. So it was instilled in me as a young performer to take chances and not to worry about all that, because failure is a part of growth. If you're gonna fail, fail big and take chances. So I've done that, or I've tried to do that.", "(1998 quote on his career) In any craft or artistic endeavor you want to do different things. You want to go to different places, you want to find different ways to go about it. You may have your constants, but you're looking to go into new territories, new angles, new challenges. So that's how it is for me as an actor. I couldn't play the same guy eight times and I don't have to. I think I've said all of my career, I'm not a celebrity. I'm not a movie star. I'm just an actor who is more popular right now. I don't even know what a movie star is. And one of the reasons why I keep on going back to make movies that don't have such huge budgets is that it's not as much pressure. You feel like you can take more chances.", "(on having to do publicity) I'm an actor, so that's the bottom line. I'm not a marketing whatever. My strength does not lie in marketing a product called \"Denzel\". That's not what I do. My strength lies in playing a part and hopefully entertaining and affecting people on some level. Now I'm not being naive. I know that marketing comes into play when you're spending 50 or 60 million dollars of other people's money to make a film. You have to be involved in marketing that product. But the publicity gets to be boring. How many times can I tell the same story? I understand the importance of doing publicity for a film, so I'm willing to do that, but I don't want to sit around talking about myself. That's not a great day for me. That's not my idea of fun.", "The acting coach Stanislavsky talks about cutting 90 percent. So you do research, research, research, then you drop it and listen when you're in the scene and know who you are. You never know how it's gonna come around. That's why you go out there and find out. It's because you need the human beings that hook you into the character. Maybe I'm not as imaginative as the average actor. I need some kind of a hook sometimes.", "Man gives you the award but God gives you the reward.", "[on the 2002 Academy 'Awards' (qv) and his win] - I didn't want to go to the Oscars. After Hurricane, I was like, \"I don't feel like dealing with these people. I'm just not going to go.\" In order to protect yourself, you almost have to not care. So that night I didn't care -- and, of course, they go, \"Here\".", "[on _The Book of Eli (2010)_ (qv)] - We shot in New Mexico, and the environment definitely helped. It was bleak. It got chilly and windy. The wind was the biggest deal. You'd have to wash the sand out of your nose and eyes. The world that the movie takes place in, the opportunity to do all this \"Blade\" kind of martial-arts stuff, working with the Hughes brothers -- it was an interesting combination of things.", "[on _Training Day (2001)_ (qv)] - My son talked me into doing that movie. He was like, 'Dad, you've never done anything like this'. I just hadn't been asked before. The only film that was sort of dark that I'd turned down was __Se7en (1995)_ (qv)_. They offered me the 'Brad Pitt' (qv) part, but I was like, \"This is so dark and evil.\" Then when I saw the movie, I was like, \"Oh, shoot\".", "[on the supposed factual inaccuracies of _The Hurricane (1999)_ (qv)] - I heard that. We'll never know, will we? The film was touchy because people were murdered and a lot of people felt that Rubin did it. So you're opening old wounds. 'Malcolm X' (qv) (1992) was more dangerous, but _The Hurricane (1999)_ (qv) might have been more controversial.", "[on _Philadelphia (1993)_ (qv)] - [Director] 'Jonathan Demme' (qv) said to me, 'Look, we don't want your character to go 360 degrees. It's not like by the end of the movie he's leading a gay and lesbian parade'. If we'd done that, it would have let people like this character off the hook. But at the end, he touches ['Tom Hanks' (qv)' character] -- and that's huge for him. [Pauses, then laughs] I used to mess with Tom. He was barely eating at all, and I would put out, like, 200 Almond Joys in his drawer to give him a hard time. I'd pretend to sneeze and all these Snickers would fall on the ground. I'm sure he laughed all the way up to the podium when he won the Oscar.", "[on the whipping scene in _Glory (1989)_ (qv)] - I remember walking around before that scene, just praying and calling on the spirits of all the slaves, because I didn't know how to play it. I was like, \"Okay, fellas, just tell me what to do.\" And I went out there with an arrogance. I spit on the ground. I had this attitude and this strength -- it all came out of this meditation. It wasn't calculated. It was organic. That whip actually hurt, but I was like, \"Don't let him win.\"", "(1995 quote) It was never my dream to be famous. I didn't start acting to be a movie star. I started in the theater and my desire was to get better at my craft. It's still my desire. I don't consider myself a movie star, nor do I really have the desire to be one. I'm just an entertainer. An actor who works hard at his craft. Whatever labels people give me, that's not really me or part of my process. Come and talk with me again on my 50th birthday and I may feel differently, but right now, I'm just taking the lesson from one of my old teachers who said, \"Don't be afraid to fail big.\".", "(1995 quote) This \"famous\" stuff, I guess you can get caught up in it. You can even get caught up in fighting it, pretending it doesn't exist. But it already alters who you are, just in the fact that you're trying to deny it. I just turned 40 and my wife and I had a quiet getaway. I didn't want a big party or anything. I just wanted to reflect on what I've done with the first 40 years and what I want to do now. I think I'm just starting to figure out how to do it, you know, how to simplify things in life. Around my birthday, I was listening to this motivational speaker, Les Brown, who made this analogy about ghosts around his bed. He was saying when you die, imagine you had these ghosts around your bed that represent your unfulfilled potential. Things that should have been done, should have been experienced. How many ghosts are going to be around your bed when your time comes? People can say about me or anyone, \"Oh, you're great at this\", but you have to look at yourself and say, \"How do I feel about what I've done?\". That's all that matters.", "Long ago, I made a commitment to completely cut out drinking and anything that might hamper me from getting my mind and body together. And the floodgates of goodness have opened upon me, spiritually and financially.", "'Tony Scott' (qv) was a great director, a genuine friend, and it is unfathomable to think that he is now gone. He had a tremendous passion for life and for the art of filmmaking, and was able to share this passion with all of us through his cinematic brilliance.", "[on _Flight (2012)_ (qv)] If it ain't on the page, it ain't on the stage. I read tons of scripts, and I know it's very rare, but this is like a 'Eugene O'Neil' (qv) play - the tears are on the page.", "I started on the stage. I prefer the stage. I'd never thought that what has happened would happen. Get on the stage. You learn how to act on stage. Not in film, not in TV. [2015]", "[Excerpt from his commencement speech to the 2015 graduates of Dillard University] Just because you're doing a lot more, doesn't mean you're getting a lot more done.", "[from his commencement speech to the 2015 graduates of Dillard University] Put God first: Everything that I have is by the grace of God, understand that. It's a gift. I didn't always stick with Him, but He stuck with me.", "[Excerpt from his commencement speech to the 2015 graduates of Dillard University] Don't be afraid to fail big, to dream big, but remember, dreams without goals, are just dreams. And they ultimately fuel disappointment. I try to give myself a goal every day, sometimes it's just not to curse somebody out.", "[Excerpt from his commencement speech to the 2015 graduates of Dillard University] You'll never see a U-Haul truck behind a hearse, I don't care how much money you make, you can't take it with you. ... It's not about how much money you have, it's what you do with it.", "[Excerpt from his commencement speech to the 2015 graduates of Dillard University] While you're on your knees in the morning, say thank you. Say thank you in advance for what is already yours. ... True desire in the heart for anything good is God's proof to you sent beforehand that it's already yours. ... When you get it, reach back, pull someone else up. Each one, teach one. Don't just aspire to make a living, aspire to make a difference.", "The secret to a happy marriage? Do whatever your wife tells you 'Yes dear.' And breathe.", "Quite simply, you can't win with the news. If you read the papers, you're misinformed. If you don't read them, you're uninformed."], "salary history": ["_Virtuosity (1995)_ (qv)::$7,500,000", "_Courage Under Fire (1996)_ (qv)::$10,000,000", "_Fallen (1998)_ (qv)::$12,000,000", "_The Siege (1998)_ (qv)::$12,000,000", "_The Hurricane (1999)_ (qv)::$10,000,000", "_Training Day (2001)_ (qv)::$12,000,000", "_Out of Time (2003)_ (qv)::$20,000,000", "_Man on Fire (2004)_ (qv)::$20,000,000", "_American Gangster (2007)_ (qv)::$40,000,000", "_2 Guns (2013)_ (qv)::$20,000,000", "_The Equalizer (2014)_ (qv)::$20 .000.000"], "birth date": "1954-12-28", "birth notes": "Mount Vernon, New York, USA", "_actorID": "40", "_source": "IMDB", "actorID": "0000243", "created_utc_dt": "09/14/2019, 13:01:48"}