{"headshot": "https://m.media-amazon.com/images/M/MV5BNjcwNzg4MjktNDNlMC00M2U1LWJmMjgtZTVkMmI4MDI2MTVmXkEyXkFqcGdeQXVyMjI4MDI0NTM@._V1_UY98_CR3,0,67,98_AL_.jpg", "nick names": ["Favs", "Mark Johnstan"], "birth name": "Jonathan Kolia Favreau", "height": "6' 1\" (1.85 m)", "mini biography": ["Initially an indie film favorite, actor 'Jon Favreau' (qv) has progressed to strong mainstream visibility into the millennium and, after nearly two decades in the business, is still enjoying character stardom as well as earning notice as a writer/producer/director.The amiable, husky-framed actor with the tight, crinkly hair was born in Queens, New York on October 19, 1966, the only child of Madeleine (Balkoff), an elementary school teacher, and Charles Favreau, a special education teacher. His father has French-Canadian, German, and Italian ancestry, and his mother was from a Russian Jewish family. He attended the Bronx High School of Science before furthering his studies at Queens College in 1984. Dropping out just credits away from receiving his degree, Jon moved to Chicago where he focused on comedy and performed at several Chicago improvisational theaters, including the ImprovOlympic and the Improv Institute. He also found a couple of bit parts in films.While there, he earned another bit role in the film, _Rudy (1993)_ (qv), and met fellow castmate 'Vince Vaughn' (qv). Their enduring personal friendship would play an instrumental role in furthering both their professional careers within just a few years. Jon broke into TV with a role on the classic series, _Seinfeld (1989)_ (qv) (as \"Eric the Clown\"). After filming rudimentary roles in the movies _Mrs. Parker and the Vicious Circle (1994)_ (qv), _Notes from Underground (1995)_ (qv) and _Batman Forever (1995)_ (qv), he decided to do some risk taking by writing himself and friend Vaughn into what would become their breakthrough film. _Swingers (1996)_ (qv), which he also co-produced, centers on Jon as a luckless, struggling actor type who is emotionally shattered after losing his girlfriend, but is pushed back into the L.A. social scene via the help of cool, worldly, outgoing actor/buddy Vaughn. These two blueprint roles went on to define the character types of both actors on film.In 1997, Jon appeared favorably on several episodes of the popular TV sitcom, _Friends (1994)_ (qv), as \"Pete Becker\", the humdrum but extremely wealthy suitor for 'Courteney Cox' (qv)'s \"Monica\" character, and also appeared to fine advantage on the _Tracey Takes On... (1996)_ (qv) comedy series. He later took on the biopic mini-movie, _Rocky Marciano (1999)_ (qv), portraying the prizefighter himself in a highly challenging dramatic role and received excellent reviews. Other engagingly offbeat \"everyman\" films roles came Jon's way -- the ex-athlete in the working class film, _Dogtown (1997)_ (qv); a soon-to-be groom whose bachelor party goes horribly awry in the comedy thriller _Very Bad Things (1998)_ (qv); a newlywed opposite 'Famke Janssen' (qv) in _Love & Sex (2000)_ (qv); a wild and crazy linebacker in _The Replacements (2000)_ (qv); as 'Ben Affleck' (qv)'s legal partner in _Daredevil (2003)_ (qv); and another down-and-out actor in _The Big Empty (2003)_ (qv). He wrote and directed himself and Vaughn as two fellow boxers who involve themselves in criminal activity in _Made (2001)_ (qv). Both he and Vaughn produced. He also directed the highly popular 'Will Ferrell' (qv) comedy _Elf (2003)_ (qv), in which he had a small part.Jon went on to re-team favorably with his friend, 'Vince Vaughn' (qv), who enjoyed a meteoric rise into the comedy star ranks, in such light-weight features as _The Break-Up (2006)_ (qv), _Four Christmases (2008)_ (qv) and _Couples Retreat (2009)_ (qv), the last of which he co-wrote with Vaughn. He also made great strides as a producer/director in recent years with the exciting mega-box office action-packed _Iron Man (2008)_ (qv), starring 'Robert Downey Jr.' (qv) and its sequel, _Iron Man 2 (2010)_ (qv).Favreau's marriage to Joya Tillem on November 24, 2000, produced son Max and two daughters, Madeleine and 'Brighton Rose' (qv). Joya is the niece of KGO (AM) lawyer and talk show host, Len Tillem. On the sly, the actor/writer/producer/director enjoys playing on the World Poker Tour.::Gary Brumburgh / gr-home@pacbell.net"], "spouse": ["Joya Tillem::(24 November 2000 - present) ( 3 children)"], "trade mark": ["Frequently appears in his own films"], "trivia": ["Jon is an alumnus of Chicago's ImprovOlympic improvisation troupe. Fellow members include the late 'Chris Farley' (qv), 'Ian Gomez' (qv), 'Pat Finn' (qv), 'Tim Meadows' (qv), 'Rachel Dratch' (qv), 'Mike Myers' (qv) and 'Horatio Sanz' (qv).", "Has three children with wife Joya Tillem: 'Max Favreau' (qv) (born July 25, 2001), 'Madeleine Favreau' (qv) (born April 2003) and 'Brighton Rose' (qv) Favreau (born August 30, 2006).", "Wrote script for _Swingers (1996)_ (qv) on computer software given to him by his father.", "Met his close friend and on-screen partner 'Vince Vaughn' (qv) when both secured supporting roles in _Rudy (1993)_ (qv).", "Is the first person to appear in a Marvel Comic film adaptation, (Foggy Nelson in _Daredevil (2003)_ (qv)) as well as direct one (_Iron Man (2008)_ (qv) and _Iron Man 2 (2010)_ (qv)). Is also the first person to play two unrelated Marvel characters with Favreau portraying the Iron Man character Harold \"Happy\" Hogan in Iron Man and Iron Man 2.", "Began a career at Bear Stearns on Wall Street in the 1980s. He then quit and even considered becoming a New York City fireman.", "Says he considered renaming _Cowboys & Aliens (2011)_ (qv), when audiences initially laughed at the trailer thinking it was a parody.", "His wife, Joya Tillem, is a physician.", "Parents are Charles and 'Madeleine Favreau' (qv).", "Attended and graduated from the Bronx High School of Science in 1984.", "Attended Queens College, City University of New York, but dropped out.", "His father has French-Canadian, German, and Italian ancestry, and his mother was from a Jewish family.", "Inducted as a Disney Legend in 2019."], "quotes": ["I've always wanted to call the shots because I would rather fail than not have a chance to figure it out on my own. I'm a very lazy person by nature. I have to be really engaged, and then I go straight from lazy to obsessive. I couldn't study chemistry, but I could memorize all the books for Dungeons and Dragons. It was ridiculous. The trick is to find what I like to do.", "I don't 'handle' people. It's so much easier to manipulate actors than to really have an earnest discussion with them. It's very easy to say whatever's going to appease them and then turn around and do whatever you want to do. It's difficult to be forthright with people, because the job does not lend itself to that.", "I wanted to do a Christmas movie. I had been offered _Surviving Christmas (2004)_ (qv), and I opted not to pursue that one any further. And then _Elf (2003)_ (qv) came along and I thought it really plays into my sensibilities. I thought the one thing about 'Will Ferrell' (qv) that I had not seen him do a lot was show his heart as a person and a performer. In developing the script, although it was edgy and irreverent at times, I wanted to keep it a PG movie, not a PG-13 movie that made fun of Christmas.", "(On directing 'Mickey Rourke' (qv)): There was a maze of things that had to be worked through, but it was usually because I was not accurate enough in what I was asking for. To simply say to an actor like 'Mickey Rourke' (qv), ''Stand there and say what's in this comic-book movie,'' is not going work. That ain't why you hire 'Mickey Rourke' (qv).", "(on briefly working in banking): I gave two weeks' notice a week before Black Monday. But it was very strange because I thought I would be working on Wall Street my whole life. It was the go-go '80s; there were yellow ties. It was just an exciting moment. And although I wasn't involved in the trading side of things, I was still around that culture, and I ultimately decided it just wasn't for me. As a matter of fact, I wanted to be a New York City firefighter. I didn't make it in, though.", "[on his film _Chef (2014)_ (qv)] It was nice to work on a little movie like this again, where I have so many responsibilities between writing and directing and acting, and you live and die by your own talents. I missed the feeling of doing something small and personal, where I wouldn't have to explain my vision to anyone but the people I was collaborating with."], "salary history": ["_Cowboys & Aliens (2011)_ (qv)::$10,000,000"], "birth date": "1966-10-19", "birth notes": "Queens, New York City, New York, USA", "_actorID": "97", "_source": "IMDB", "actorID": "0269463", "created_utc_dt": "09/14/2019, 13:02:41"}