{"headshot": "https://m.media-amazon.com/images/M/MV5BMTg4NTExODc3Nl5BMl5BanBnXkFtZTgwODUyMDEzMDE@._V1_UY98_CR3,0,67,98_AL_.jpg", "nick names": ["Dan"], "birth name": "Daniel Jacob Radcliffe", "height": "5' 5\" (1.65 m)", "mini biography": ["Daniel Jacob Radcliffe was born on July 23, 1989 in Fulham, London, England, to casting agent 'Marcia Gresham' (qv) (née Jacobson) and literary agent 'Alan Radcliffe' (qv). His father is from a Northern Irish Protestant background, while his mother was born in South Africa, to a Jewish family (from Lithuania, Poland, Russia, and Germany). Daniel began performing in small school productions as a young boy. Soon enough, he landed a role in _David Copperfield (1999)_ (qv), as the young David Copperfield. A couple of years later, he landed a role as Mark Pendel in _The Tailor of Panama (2001)_ (qv), the son of Harry and Louisa Pendel ('Geoffrey Rush' (qv) and 'Jamie Lee Curtis' (qv)). Curtis had indeed pointed out to Daniel's mother that he could be Harry Potter himself. Soon afterwards, Daniel was cast as Harry Potter by director, 'Chris Columbus' (qv) in the film that hit theaters in November 16, 2001, _Harry Potter and the Sorcerer's Stone (2001)_ (qv). He was recognized worldwide after this film was released. Pleasing audiences and critics everywhere, filming on its sequel, _Harry Potter and the Chamber of Secrets (2002)_ (qv), commenced shortly afterwards. He appeared again as Harry in _Harry Potter and the Prisoner of Azkaban (2004)_ (qv) directed by 'Alfonso Cuarón' (qv), and then appeared in _Harry Potter and the Goblet of Fire (2005)_ (qv) directed by 'Mike Newell' (qv). Shortly afterwards, he finished filming _December Boys (2007)_ (qv) in Adelaide, Australia, Kangaroo Island, and Geelong, Australia which began on the 14 November 2005 and ended sometime in December. On January 27, 2006, he attended the South Bank 'Awards' (qv) Show to present the award for \"Breakthrough Artist of the Year\" to 'Billie Piper' (qv). Daniel reprised his famous character once again for the next installment of the Harry Potter series, _Harry Potter and the Order of the Phoenix (2007)_ (qv). In February 2007, he took on his first stage role in the West End play Equus, to worldwide praise from fans and critics alike. Also that year, he starred in the television movie _My Boy Jack (2007)_ (qv), which aired on 11 November 2007 in the UK.After voicing a character in an episode of the animated television series The Simpsons in late 2010, Radcliffe debuted as J. Pierrepont Finch in the 2011 Broadway revival How to Succeed in Business Without Really Trying, a role previously held by Broadway veterans Robert Morse and Matthew Broderick. Other cast members included John Larroquette, Rose Hemingway and Mary Faber. Both the actor and production received good reviews, with USA Today commenting: \"Radcliffe ultimately succeeds not by overshadowing his fellow cast members, but by working in conscientious harmony with them - and having a blast in the process.\" Radcliffe's performance in the show earned him Drama Desk Award, Drama League Award and Outer Critics Circle Award nominations. The production itself later received nine Tony Award nominations. Radcliffe left the show on 1 January 2012. His first post-Harry Potter project was the 2012 horror film The Woman in Black, adapted from the 1983 novel by Susan Hill. The film was released on 3 February 2012 in the United States and Canada, and was released on 10 February in the UK. Radcliffe portrays a man sent to deal with the legal matters of a mysterious woman who has just died, and soon after he begins to experience strange events from the ghost of a woman dressed in black. He has said he was \"incredibly excited\" to be part of the film and described the script as \"beautifully written\".In 2013, he portrayed American poet Allen Ginsberg in the thriller drama _Kill Your Darlings (2013)_ (qv), directed by John Krokidas. He also starred in an Irish-Canadian romantic comedy film The F Word directed by Michael Dowseand written by Elan Mastai, based on TJ Dawe and Michael Rinaldi's play Toothpaste and Cigars and then he starred in an American dark fantasy horror film directed by Alexandre Aja Horns. Both of the films premiered at the 38th Toronto International Film Festival. Radcliffe also performed at the Noël Coward Theatre in the stage play revival of Martin McDonagh's dark comedy The Cripple of Inishmaan as the lead, Billy Claven, for which he won the WhatsOnStage Award for Best Actor in a Play. In 2015, Radcliffe starred as Igor in a science fiction horror film _Victor Frankenstein (2015)_ (qv), directed by Paul McGuigan and written by Max Landis, which was based on contemporary adaptations of Mary Shelley's 1818 novel Frankenstein. In 2016, he appeared as a wealthy villain in the mystery/action film _Now You See Me 2 (2016)_ (qv), and as an oftentimes mobile corpse in the indie fantasy _Swiss Army Man (2016)_ (qv).Now being one of the world's most recognizable people, Daniel leads a somewhat normal life. He has made friends working on the Harry Potter films, which include his co-stars 'Rupert Grint' (qv) and 'Emma Watson' (qv).::The Icegirl and Pedro Borges"], "trade mark": ["Blue eyes"], "trivia": ["Liked to play pranks when he was 10. He took co-star 'Robbie Coltrane' (qv)'s cellular phone and changed it so all the messages were in Turkish.", "Has two border terriers named Binka and Nugget.", "Tried reading the first Harry Potter book when he was 8 years old, but was unable to finish it. Finally read the entire book when he was cast in the lead role of the film.", "Has never actually seen the film _The Tailor of Panama (2001)_ (qv) in which he appeared.", "His favorite book from the Harry Potter series so far is number three, Harry Potter and the Prisoner of Azkaban.", "He was nominated for and won \"Best Newcomer\" at the Variety Club Award ceremonies. [February 2002]", "Received the Sir 'James Carreras' (qv) Award for Outstanding New Talent for his role in Harry Potter at The Variety Club Show Business 'Awards' (qv) 2002.", "Voted Person of the Year 2002 by Time Kids.", "Has stated that _12 Angry Men (1957)_ (qv) is the first black-and-white film he ever saw and is also his favorite film.", "'David Heyman' (qv), the producer for the Harry Potter films happened to be at a play that both Dan and Dan's father, 'Alan Radcliffe' (qv), were at. After Heyman spotted Radcliffe, since both men knew each other, he was introduced to his son and when Heyman saw Daniel he thought he looked perfect for the part. In fact, that night at the play, Heyman couldn't help just staring at Dan because he thought he was perfect to play Harry. Daniel auditioned for and got the part that he is now most recognized for, Harry Potter.", "A February 23, 2004 article in British newspaper The Sun listed him as Britain's third richest teenager behind only 'Prince Harry' (qv) and 'Charlotte Church' (qv). He is said to be worth 5 million pounds.", "Has earned 6 million pounds so far portraying Harry Potter, making him the second richest teenager in Britain behind 'Prince Harry' (qv)'s 14 million pounds (2004).", "Can rotate his arm 360 degrees.", "Is a huge fan of 'Gary Oldman' (qv), his co-star in _Harry Potter and the Prisoner of Azkaban (2004)_ (qv), _Harry Potter and the Goblet of Fire (2005)_ (qv), and _Harry Potter and the Order of the Phoenix (2007)_ (qv).", "Is a supporter of Fulham Football Club although he doesn't enjoy playing football himself. Fellow fans include 'Elizabeth Hurley' (qv), 'Lily Allen' (qv), 'Pierce Brosnan' (qv), 'Hugh Grant' (qv), 'Benicio Del Toro' (qv), 'Hugh Laurie' (qv), 'Andrew Johnston' (qv), and the late 'Michael Jackson' (qv).", "Is a huge fan of 'Red Hot Chili Peppers' (qv) and attended their London concert in June 2004.", "Favorite actors include 'Aishwarya Rai Bachchan' (qv), 'Christina Ricci' (qv), 'Cameron Diaz' (qv), 'Scarlett Johansson' (qv), and 'Ben Stiller' (qv).", "He originally disliked the \"Harry Potter\" books when he first read them.", "Especially likes the music group 'Sex Pistols' (qv). He also plays the bass guitar.", "Is a huge fan of indie rock. Some of his favorite bands include: 'The Zutons' (qv), 'Razorlight' (qv), 'The Libertines' (qv), 'Bloc Party' (qv), 'Hope of the States' (qv), 'The Futureheads' (qv), and 'Kaiser Chiefs'.", "Delays between filming the second and third Harry Potter movies were caused because his parents wanted him to be able to attend normal school for a while.", "Says he does not read any articles or reviews about himself or his movies.", "He supports Demelza House Children's Hospice, which is a charity that cares for terminally-ill children in the Kent, East Sussex and South London areas of Britain. Dan always asks his fans to donate to the charity every Christmas and on his birthday instead of sending him gifts. In the book \"Harry Potter and the Half-Blood Prince\", the author 'J.K. Rowling' (qv) named the character Demelza Robins after the charity.", "He likes the music of 'The Strokes' (qv), 'The Clash' (qv) and 'Pixies' (qv).", "He sat his AS Levels in English Literature, History, Religion and Philosophy for his AS levels (First year college exams). [June 2006]", "Named Britain's richest teenager with an astounding 23 million pound fortune, after he signed on a 8 million pound deal to make the fifth movie of the Harry Potter series.", "Dan scared the make-up department crew when he came on set with bloodied sticking plasters on his face claiming that he had been fighting the previous day (just for a laugh).", "His parents are 'Alan Radcliffe' (qv), a literary agent, and 'Marcia Gresham' (qv), a casting director.", "Is also a huge fan of 'The Killers' (qv) and 'John Wayne' (qv).", "Before working with 'Brendan Gleeson' (qv) in the Harry Potter series, he worked with him in _The Tailor of Panama (2001)_ (qv).", "On July 23, 2007, he appeared on BBC Radio's Test Match Special, from Lords, London, on the final day of the England vs. India test match. It was his 18th birthday and he was a guest on \"View from the Boundary\" hosted by 'Jonathan Agnew' (qv), the BBC's cricket correspondent. He talked about his career to date, his love of cricket and his admiration for the grit of his favorite player Paul Collingwood. He appeared a second time in 2009 accompanied by fellow Harry Potter cast member 'Tom Felton' (qv) who plays Draco Malfoy.", "Is very close to actor 'Gary Oldman' (qv).", "His agent 'Sue Latimer' (qv) is the mother (and agent) to his friend and fellow actor 'Freddie Highmore' (qv).", "Ranked #6 on Forbes magazine's list of The 20 Top-Earning Young Superstars. [2007]", "Named #23 on Empire magazine's 100 Sexiest Movie Stars. [2007]", "Ranked #10 on Yahoo! List of 10 Most Popular Stars of 2007 on Yahoo! Movies. [2007]", "Ranked #79 on Forbes magazine's list of The Celebrity 100. [2007]", "Forbes magazine estimated his earnings for the year at $15 million. [2007]", "Ranked #29 on Entertainment Weekly's \"30 Under 30\" the actors list (2008).", "Ranked #3 on TV Guide's Top 10 Teen Star Countdown. [2008]", "Ranked #8 on Moviefone's \"The 25 Hottest Actors Under 25\" list. [2008]", "Named as one of London's 1000 Most Influential People of 2008.", "Ranked #11 on MSN's top searched for stars under age 25. [2008]", "Ranked #1 on MSN's top searched for male. [2007]", "In the 2003 Comic Relief fundraiser, a lock of Dan's hair sold at auction for 751 British pounds, the highest amount raised.", "In 2008, Dan and the cast of Equus raised $203,746 for the charity, BroadwayCares/EquityFightsAids 20th Gypsy of the Year competition, setting a record for the most ever raised by a Broadway play. They not only beat the amount raised by other Broadway musicals but also came runner up for the best presentation, again beating out every other musical with their own song and dance. (The winning presentation was the Lion King's). Dan wrote and sang the song. http://www.broadwaycares.org/events/gypsy.cfm.", "The Guardian (UK) reported that Radcliffe has published some poetry under the pen name Jacob Gershon. Jacob is his middle name, and Gershon is the original Yiddish name from which his mother's maiden name, Gresham, was derived.", "The Trevor Project announced that 'Daniel Radcliffe' (qv) had made a \"major\" donation to them and joined their \"Circle of Hope\", a group of their high-donating supporters. The Trevor Project operates a national (US) crisis and suicide prevention helpline for lesbian, gay, bisexual, transgender and questioning (LGBTQ) youth (who are four times more likely to attempt suicide than heterosexual children and teens). The Trevor Project was inspired by the short film _Trevor (1994)_ (qv), about a gay boy who attempts suicide; the organization was started by the film's creators in 1998. [August 2009]", "Is a huge fan of mathematician/singer/songwriter 'Tom Lehrer' (qv) and can recite his famous \"The Elements\" song.", "Is the only child of Alan George Radcliffe and Marcia Jeannine Gresham.", "Is allergic to Nickel and suffers from Dyspraxia, a motor skills development disorder.", "Is a huge fan of cricket legend 'Sachin Tendulkar' (qv) and waited in line for his autograph after the Lords test in July 2007. Sachin obliged without actually looking up.", "He plays the son of 'Adrian Rawlins' (qv) in the Harry Potter films. _The Woman in Black (2012)_ (qv) is a remake of an earlier film (_The Woman in Black (1989)_ (qv)), in which Radcliffe takes over the role originally played by Rawlins.", "When he was first cast as Harry Potter, the filmmakers tried using contact lenses to make his eyes appear green; as they are described in the books; rather than their natural blue. Daniel suffered a painful allergic reaction when he tried them on, so the idea was scrapped. The filmmakers then considered digitally altering his eyes in post-production, but knew this would be a tedious process. The filmmakers then approached 'J.K. Rowling' (qv) with their problem, and she thankfully told them that it was not essential for Harry to have green eyes, merely that he have his mother's eyes, much to the relief of all involved.", "Became the youngest non-royal to have an individual portrait displayed in London's prestigious National Portrait Gallery. Radcliffe was only 14-years-old, when he posed for artist 'Stuart Pearson Wright' (qv) during a break from filming Harry Potter.", "Godfather of 'Misha Handley' (qv), who played his son in _The Woman in Black (2012)_ (qv).", "Ranked #5 on the VH1 list of 100 Greatest Kid Stars. [2012]", "Was in a relationship with 'Rosie Coker' (qv) from 2010 until November 2012.", "Has frequently been mistaken for 'Elijah Wood' (qv) (and vice versa). Once in Japan, a huge fan handed Radcliffe a photo of 'Elijah Wood' (qv) to sign. He wrote, \"I am not 'Elijah Wood' (qv), love, 'Daniel Radcliffe' (qv)\".", "Daniel's father is of Northern Irish Protestant descent, and was the son of Elsie May and Teddy Radcliffe. Daniel's mother was born in South Africa, to a Jewish family (they moved from Lithuania, Germany and Poland, to South Africa and England). Daniel's maternal grandparents were Wilfred Jacobson (born in South Africa) and Muriel Jean Patricia Gresham (who was born in Rochford, Essex, England; she was born under the surname \"Gershon\", later Anglicized by her family to \"Gresham\"). While he is not religious, Daniel has described himself as Jewish.", "Received a star on the Hollywood Walk of Fame at 6801 Hollywood Boulevard in Hollywood, California on November 12, 2015.", "When 'Chris Columbus' (qv) was asked what type of child he wanted to play Harry Potter, he used a clip of 'Daniel Radcliffe' (qv) from _David Copperfield (1999)_ (qv) to show them what he wanted.", "Revealed in a 2014 interview that he started to develop an alcohol problem while filming _Harry Potter and the Half-Blood Prince (2009)_ (qv), and freely admitted that his performance in the film suffered as a result. He voluntarily got sober in August 2010 on his own when he realized he was becoming too reliant on it for his daily functioning.", "Long-time friends with British writer-actor 'Stephen Fry' (qv).", "'Chris Columbus' (qv) was amazed how beautifully Radcliffe, 'Emma Watson' (qv) and 'Rupert Grint' (qv) matured over the Harry Potter series, compared to some child actors who start out adorable and then either lose that or become bad actors as they grow older.", "Casting an actor to play Harry Potter was a big challenge; they saw 5000 auditions and none of them felt right. Director 'Chris Columbus' (qv) saw Radcliffe in _David Copperfield (1999)_ (qv) and showed it to the film's casting director and said Radcliffe was the one and that he was amazing. But she said they wouldn't get him because his parents want him to focus on his schoolwork and not acting, as well as all the attention he'd get. So they interviewed Harry Potters of different nationalities all over the world and still didn't find him. She got frustrated with Columbus because he had his heart set on Radcliffe. By sheer coincidence, the producer and screenwriter of the Philosopher's Stone went to the theatre and in the front row was Radcliffe with his father, so they talked and slowly persuaded him to cast Radcliffe.", "Dan to his friends.", "Close friends with David Holmes, who was his stunt double for the first six Harry Potter films.", "He has expressed a desire to play Robin opposite Ben Affleck in a Batman film.", "Is allergic to eye contacts.", "In 2018, Radcliffe played a fact-checker in the Broadway play \"The Lifespan of a Fact.\" While promoting the play, he spent some time shadowing real fact-checkers at the New Yorker magazine (which has arguably the most famous fact-checking department of any American magazine). During his time there, he actually fact-checked one real article, Hannah Goldfield's restaurant review titled \"Oxomoco Balances Hipster Bait with Mexican Tradition,\" published in the October 8, 2018, issue. That process, in turn, was recounted in the October 15, 2018, New Yorker article \"'Daniel Radcliffe' (qv) and the Art of the Fact-Check: Researching his role in 'The Lifespan of a Fact,' the actor embeds in The New Yorker's fact-checking department\" by Michael Schulman. Radcliffe said that before Schulman's article ran, he was first called by a fact-checker to verify that everything in it was true, an experience he characterized as \"very meta.\"."], "quotes": ["After being cast as Harry Potter: I think I'm a tiny bit like Harry 'cos I'd like to have an owl. Yeah, that's the tiny bit, actually.", "I don't know. People tell me I look mournful. They say, \"Cheer up, Dan, it's not that bad!\" Sometimes, I just look into space, which freaks people out. If I was ever required to do anything other than look haunted, I could. I'm a happy person. Though I don't, like, dot my \"I's\" with hearts or anything - that would be too happy.", "I'm not much of a cake person.", "But I don't think it's going to happen. I don't think I'll do all of them - I'll probably get too spotty or too tall or I'll shrink or something.", "[on believing in magic] Absolutely. 100 percent.", "I was in the bath at the time, and my dad came running in and said, \"Guess who they want to play Harry Potter!?\" and I started to cry. It was probably the best moment of my life.", "I'm not clumsy, I'm just accident prone.", "Upon seeing the movie: I'm a bit nervous about whether people will like it, but I've seen it, and I'm sure they will. It's really good - it's quite scary, it's quite emotional. Even I cried and I don't cry easily! I cried at the end credits when my name came up, and I was, like \"Oh my God! I can't believe that's my name!\" I've met so many people since we started filming and it's been wonderful. I've progressed so far and changed so much since the beginning. It's been like a real journey.", "[on considering himself as a heartthrob] Personally, I can't see it, but if other people can, fine. Cool!", "I would consider doing any part as long as the script is good and the film has an interesting director.", "[on the bats on the set] I like them, but it's hard to concentrate when the bats fly about, and they pee while they fly.", "I've never been one of the cool people at school, but then again, I don't get the people who are cool. It's not that I don't like them, it's just that they don't interest me.", "[on math] Too many little numbers on one page!", "Stage is much more intimidating than going before the cameras, because you can really screw up, and can't do a retake.", "When I go back to school everyone asks a lot of questions. Then, after about a week, when I've answered everything, we get back to normal.", "It's too far down the road to decide about a fifth movie. I'm still the same age Harry is, and I haven't actually grown that much.", "Fans are really important for me. And if they take pains to write me, it's the minimum that I answer myself.", "I think I'm highly normal. I'm attending school after acting, I'm going out with friends, going to the cinema - I'm just doing everything a normal teenager does. People think I can't leave the house without being in a crowd of fans - but that's not true. I'm able to do more things than people might think.", "I'm thrilled of the acceptance I get abroad. The people are so hearty, warm and grateful and I feel privileged having seen so many countries and some of the greatest monuments.", "When I get into trouble at school I'd like to take an invisibility cloak, drape it over me and sneak out the door. Or I'd like to have a 3-headed-dog because then no one would argue with me.", "I played a trick on the make-up department where I put a fake blood capsule in my mouth, pretended to trip on the stairs and let the blood come out of my mouth. They really fell for it, then they chased after me with a water pistol.", "Everyone on the set has a mobile phone, and I found by pushing a few buttons, they could be programmed into different languages. I fixed Robbie's (Coltrane) to speak in Turkish.", "I don't understand girls, but I'm slowly learning.", "[on saying that he'll do all of the Harry Potter movies] Ultimately, it comes down to whether we're still enjoying it. If we are then I think we would be sort of stupid not to do them. As long as I'm doing other stuff around the same time, I think it'll be fine. Also, I sort of try to read the books when they come out impartially and not make up my mind, but the fact is when I was reading the sixth, Harry Potter and the Half-Blood Prince, there were bits in there where I was going, \"God, I would love to do that because it's so good.\".", "[on whether he is religious] I'm not a religious person. My mom was of Jewish blood and my dad was Protestant... I'm very interested in religion as something to study, but I'm not a religious person in the slightest.", "I didn't look at the nudity and go, oh great. But it's the same as doing a role with an accent or a particular affectation. You look at the character first. Lots of the actors that I've admired have at one stage or another taken their kit off. It's a rite of passage. That iconic scene is the physical and emotional climax of the play. So if I do that with pants on, it would be crap.", "I feel okay about my body. Not totally, of course, no one my age does... but I've gone to the gym to make sure. And many of the actors I admire, like 'Gary Oldman' (qv), have gone naked.", "People will always remember Harry, but I think if I work hard enough other characters will stick in their minds as well.", "[on the \"Equus\" paparazzi]: They were outside the theatre every single night, but we came up with a cunning ruse. I would wear the same outfit every time - a different T-shirt underneath, but I'd wear the same jacket and zip it up so they couldn't see what I was wearing underneath, and the same hat. So they could take pictures for six months, but it would look like the same day, so they (photos) became unpublishable. Which was hilarious, because there's nothing better than seeing paparazzi getting really frustrated.", "What everybody would love to see is me having ditched school and then just going wild. That's what I'm determined not to give them.", "It's not so much that they don't want me to grow up. It's that they're annoyed that I'm growing up adjusted. They'd much rather I was growing up and going wild and crashing cars.", "I'm lucky enough to have a job that I love, and a relatively down-to-earth life.", "[on being bullied in school] Some people did get very aggressive. People say it was just jealousy, but I don't think it is jealousy. I think it's just \"We can have a crack at the kid who plays Harry Potter.\" As Eddie Izzard says, these people always hang about in fives, because these people have a fifth of a personality each.", "I hate celebrity culture but I'm unavoidably part of it. These people are celebrities as a by-product of what they do. People read every little thing about 'Peter Andre' (qv) and 'Katie Price' (qv) and I couldn't care less. They don't want to work, have no interests, no passions, nothing and yet they seem to be held up on pedestals. I don't think they should be trying to push themselves onto us. It does annoy me of course, but I'm part of it.", "[on quitting drinking alcohol]: I became so reliant on (alcohol) to enjoy stuff. There were a few years there when I was just so enamored with the idea of living some sort of famous person's lifestyle that really isn't suited to me. As much as I would love to be a person that goes to parties and has a couple of drinks and has a nice time - that doesn't work for me. I do that very unsuccessfully. I'd just rather sit at home and read, or go out to dinner with someone, or talk to someone I love, or talk to somebody that makes me laugh.", "When growing up, I thought of marriage as being very official, drawing up a contract. It seemed slightly clinical to me. But then you meet somebody that you really love and you think, \"Actually, I wouldn't mind standing up in front of my friends and family and telling them how much I love you and that I want to be with you forever.\".", "We like tearing down our own in England. If you look at what happened to Ken Branagh in the 1990s: all of the newspapers built him up, the new Olivier, and then destroyed him and his personal life. Not that I have been treated that badly, but I think a lot of people would like to write that story.", "[on receiving the script for _The Woman in Black (2012)_ (qv)] It was a page-turner. What I liked about it was that it was a horror film, but it was unusual for a horror film to be so character-driven, to have such deep and affecting themes - themes of loss and what happens when we fail to move on from the loss.", "[on occasionally being drunk while impersonating Harry Potter] I can point to many scenes where I am just gone. Dead behind the eyes.", "I don't have an entourage in my personal life. I get driven here and I get driven home, but that's it. I hate that kind of dropping-a-name-to-get-a-table stuff. Maybe it's an English thing that there's some sort of embarrassment saying, \"Hello, I'm 'Daniel Radcliffe' (qv), does that make a difference to you?\".", "[on many parents' objecting to _The Woman in Black (2012)_ (qv)] I do take a small tincture of pride about it being the most complained-about film. I would have thought from the trailer that you could see what kind of a movie it was going to be. I said at the time, if your kid is under twelve I would advise them not to see this film. Apparently, there was a girl at the British premiere who fainted and when I heard that, I was like \"We did something right.\".", "I'm scared of any sort of expression looking like a Harry expression, and so I think that the journey for me in the last year is kind of about acceptance, of going, \"This is my face and it was also the face that played Harry Potter.\".", "[on whether he identifies as Jewish] Absolutely. I really do. My dad is Northern Irish and my mum is Jewish. That's working blood. Though I am not religious in the least, I am very proud to be Jewish.", "[on rumors he was going to play 'Freddie Mercury' (qv) in a biopic] There is no truth to it at all. It's one of those very, very funny things: it came out of a story in the Daily Star and then you see newspapers like The Guardian using The Star as their source, and it grows and grows [until] it's \"Dan Radcliffe is playing 'Freddie Mercury' (qv)!\", which I was never going to do. Everyone on the Internet who I presume is saying I'm totally wrong for that part is correct. I AM completely wrong for that part!", "I don't have Twitter and I don't have Facebook and I think that makes things a lot easier, because if you go on Twitter and tell everybody what you're doing moment to moment and then claim you want a private life, then no one is going to take that request seriously.", "[on shooting _What If (2013)_ (qv) in Dublin, Ireland] Dublin looks awesome; it's not hard to make Dublin look really pretty but it looks great in the movie.", "I like action movies and I feel there used to be lots of really witty ones, like _Die Hard (1988)_ (qv) and _Lethal Weapon (1987)_ (qv) and the Bourne movies, but the good ones are few and far between now.", "I used to be self-conscious about my height, but then I thought, fuck that, I'm Harry Potter.", "I'm 5-foot-5, and I'll wear a big parka and put the hood up, and nobody gives me a second glance.", "There's this idea that 'Emma Watson' (qv), Rupert and myself are the best of friends who always hang out together. I'm just going to put [it] out there - Emma and I text all the time but Rupert and I never text each other, we never see each other. If I see him every six months or so, it's a friendly \"Hello, how's things with you?\" But that's about it.", "I can probably tell this story now because at the time my parents didn't know that I smoked, but they do now. At the time when I was in theater, I would sneak up to Lorenzo's [Lorenzo Pisoni] room and ask if I could jump out on his fire escape to smoke. Again, maybe I shouldn't be saying this. [Pisoni wasn't smoking, Radcliffe clarified.] He was literally like, 'Yeah, fine, you can use my fire escape.' I had had my first cigarette before that, but I won't say when. I will spare my parents' retroactive disapproval."], "salary history": ["_Harry Potter and the Sorcerer's Stone (2001)_ (qv)::$1,000,000 USD", "_Harry Potter and the Chamber of Secrets (2002)_ (qv)::$3,000,000 USD", "_Harry Potter and the Goblet of Fire (2005)_ (qv)::$11,000,000 USD", "_Harry Potter and the Order of the Phoenix (2007)_ (qv)::$14,000,000 USD", "_Harry Potter and the Deathly Hallows: Part 1 (2010)_ (qv)::$20,000,000 USD", "_Harry Potter and the Deathly Hallows: Part 2 (2011)_ (qv)::$33,000,000 USD"], "birth date": "1989-07-23", "birth notes": "Fulham, London, England, UK", "_actorID": "33", "_source": "IMDB", "actorID": "0705356", "created_utc_dt": "09/14/2019, 13:01:43"}