{"headshot": "https://m.media-amazon.com/images/M/MV5BMjM0OTIyMzY1M15BMl5BanBnXkFtZTgwMTg0OTE0NzE@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Coop"], "birth name": "Bradley Charles Cooper", "height": "6' 1\" (1.85 m)", "mini biography": ["Bradley Charles Cooper was born on January 5, 1975 in Philadelphia, Pennsylvania. His mother, Gloria (Campano), is of Italian descent, and worked for a local NBC station. His father, Charles John Cooper, who was of Irish descent, was a stockbroker. Immediately after Bradley graduated from the Honors English program at Georgetown University in 1997, he moved to New York City to enroll in the Masters of Fine Arts program at the Actors Studio Drama School at New School University. There, he developed his stage work, culminating with his thesis performance as John Merrick in 'Bernard Pomerance' (qv)'s \"The Elephant Man\", performed in New York's Circle in the Square.While still in school, Bradley began his professional career, appearing opposite 'Sarah Jessica Parker' (qv) on _Sex and the City (1998)_ (qv) and on the drama series _The Beat (2000)_ (qv). His weekends were spent with LEAP (Learning through the Expanded Arts Program), a non-profit organization that teaches acting and movement to inner city school children. The summers took him all across the globe, from kayaking in British Columbia with Orca Whales to ice-climbing in the Peruvian Andes, while hosting Lonely Planet's _Treks in a Wild World (2000)_ (qv) for the Discovery Channel. Bradley had to miss his graduation ceremony from the Actors Studio in order to star in his first feature _Wet Hot American Summer (2001)_ (qv). After finishing his second feature _Bending All the Rules (2002)_ (qv), his plans to relocate to Los Angeles were delayed when 'Darren Star' (qv) hired him to star on the drama series _The $treet (2000)_ (qv).Bradley went on to win the role of young law student Gordon Pinella in _Changing Lanes (2002)_ (qv), starring 'Ben Affleck' (qv) and 'Samuel L. Jackson' (qv), and also played Travis Paterson in _My Little Eye (2002)_ (qv). He finally decided that it was time to forgo his other New York projects and move to Los Angeles when he was cast on _Alias (2001)_ (qv). After supporting roles in _Wedding Crashers (2005)_ (qv), _Failure to Launch (2006)_ (qv), _The Comebacks (2007)_ (qv), _The Rocker (2008)_ (qv) and _Yes Man (2008)_ (qv), Cooper broke out with major roles in _He's Just Not That Into You (2009)_ (qv), _The Hangover (2009)_ (qv) and _Valentine's Day (2010)_ (qv). He co-starred in the action film _The A-Team (2010)_ (qv) and headlined the thriller film _Limitless (2011)_ (qv).Cooper received an Academy Award nomination for Best Actor after starring opposite 'Jennifer Lawrence' (qv) in 'David O. Russell' (qv)'s _Silver Linings Playbook (2012)_ (qv). He then received two more consecutive Oscar nominations, Best Supporting Actor for playing Richie DiMaso in Russell's _American Hustle (2013)_ (qv) (again opposite Lawrence, though their characters shared no significant screen time), and Best Actor for playing Navy SEAL Chris Kyle in 'Clint Eastwood' (qv)'s _American Sniper (2014)_ (qv), the highest grossing film of 2014. During this time period, Cooper also reprised his role in _The Hangover Part II (2011)_ (qv) and _The Hangover Part III (2013)_ (qv), turned in another strong dramatic turn in _The Place Beyond the Pines (2012)_ (qv), and voiced Rocket Raccoon in the third highest grossing film of 2014, _Guardians of the Galaxy (2014)_ (qv).In 2015, Bradley headlined two comedies, 'Cameron Crowe' (qv)'s _Aloha (2015)_ (qv), set in Hawaii, and 'John Wells' (qv)' _Burnt (2015)_ (qv), set in London, and starred opposite 'Jennifer Lawrence' (qv) again in 'David O. Russell' (qv)'s _Joy (2015)_ (qv).Bradley has a daughter (born 2017) with his former partner, model 'Irina Shayk' (qv).::Pedro Borges"], "spouse": ["'Jennifer Esposito' (qv)::(21 December 2006 - 10 November 2007) ( divorced)"], "trade mark": ["Piercing blue eyes", "Often plays devious yet charming characters", "Often works with his hero and idol 'Robert De Niro' (qv), 'David O. Russell' (qv) and 'Jennifer Lawrence' (qv).", "Alcoholic or drug addicted characters (e.g. Limitless, Burnt, A Star is Born)"], "trivia": ["Was a medalist on the Men's Heavyweight Crew team at Georgetown University.", "Had to miss his graduation commencement to film _Wet Hot American Summer (2001)_ (qv).", "Considers 'Daniel Day-Lewis' (qv) the world's greatest actor.", "Attended and graduated from Germantown Academy in Fort Washington, Pennsylvania (1993).", "His father, Charles \"Charlie\" Cooper, was of Irish heritage, and worked as a stockbroker with Merrill Lynch. His mother, Gloria Cooper (née Campano), is of Italian heritage, and worked for an NBC station.", "Cooper has spent many weekends with the Learning through the Expanded Arts Program (LEAP), which is a non-profit organization that teaches inner-city school children about acting.", "Has an older sister: Holly Cooper.", "Speaks French fluently. He even did an interview, promoting _The Hangover Part II (2011)_ (qv) entirely in French.", "Auditioned for the lead role of Hal Jordan in _Green Lantern (2011)_ (qv), which went to 'Ryan Reynolds' (qv).", "Was in a relationship with 'Renée Zellweger' (qv) (July 2009-March 2011).", "In the 'Steven Spielberg' (qv) episode of _Inside the Actors Studio (1994)_ (qv), Cooper appears in the audience about 15 minutes into the episode.", "Member of the same Los Angeles gym as 'Ryan Gosling' (qv), 'Jason Sarayba' (qv), 'Jodie Foster' (qv), 'Michelle Monaghan' (qv), 'Christopher Mintz-Plasse' (qv) and 'Ashley Tisdale' (qv).", "Became close friends with 'Victor Garber' (qv) during production on _Alias (2001)_ (qv).", "While a guest on _Live! with Kelly (1988)_ (qv) (aka \"Live with Regis & Kelly\"), Cooper was asked which of the actresses he has co-starred with was his favorite on-screen kisser. Instead of an actress, he chose 'Michael Ian Black' (qv), with whom he shared a love scene in _Wet Hot American Summer (2001)_ (qv).", "Drives a 2007 black Prius, and a 2004 G55 AMG Mercedes truck. He also owns a Vespa, which was a gift from _The Hangover Part II (2011)_ (qv) director, 'Todd Phillips' (qv) (2011).", "For six months prior to filming _The A-Team (2010)_ (qv) and during the shoot, he cut out sugar, salt and flour and underwent grueling two-hour workouts with a trainer every day.", "Admitted that in the beginning of his career casting agents tended to peg him as just a 'pretty boy', which made finding meaningful roles challenging.", "Claimed that watching 'David Lynch' (qv)'s production of _The Elephant Man (1980)_ (qv) on television is what inspired him to be an actor. He later played the title character of John Merrick on stage for his graduate thesis at the Actors Studio, which he attended after graduating from Georgetown in 1997. He also went to London just to research the role, rather obsessively.", "Was named \"The Sexiest Man Alive\" by People magazine. [November 2011]", "Is the first alumnus of the Actors Studio to be interviewed as a guest on _Inside the Actors Studio (1994)_ (qv). Cooper can be seen in the audience on two episodes, one with guest 'Robert De Niro' (qv), and again with 'Sean Penn' (qv). Cooper put himself on tape to audition for a role as De Niro's son in _Everybody's Fine (2009)_ (qv) (with his own mother playing the role of De Niro), but lost out to 'Sam Rockwell' (qv). Cooper eventually starred with De Niro in _Limitless (2011)_ (qv), and again as father and son in _Silver Linings Playbook (2012)_ (qv). The film was released to great critical acclaim, and both actors earned Academy Award nominations for their performances.", "Was cast as Lucifer in an adaptation of Paradise Lost (directed by 'Alex Proyas' (qv)). The movie was canceled four months before filming due to budget conflicts.", "Ranked #10 on the Empire Online list of the 100 Sexiest Movie Stars (2013).", "Once had a job that required him to take out a $50,000 life insurance policy.", "During an interview on the French television show \"Le Journal de 19:45\", he stated his desire to work with French director 'Guillaume Canet' (qv). [February 2014]", "After graduating from Germantown Academy (1993), he attended Villanova University for his first year, then transferred to Georgetown University, from which he graduated with honors with a B.A. in English (1997). Later in 2000, he received an M.F.A. in acting from Actors Studio Drama School at the New School in New York City.", "While he was studying at the New School, Cooper worked as a doorman at the Morgans Hotel.", "Received his first two Oscar nominations in films directed by 'David O. Russell' (qv) and with 'Jennifer Lawrence' (qv) as his co-star (_Silver Linings Playbook (2012)_ (qv) and _American Hustle (2013)_ (qv)).", "Grew up in Jenkintown, in Montgomery County, a couple miles out of Philadelphia.", "Joined forces with Miramax co-chairman Harvey Weinstein to make a short film that was critical of then-Presidential candidate Mitt Romney in the runup to the 2012 election (both Cooper and Weinstein supported President Barack Obama), but the project was ignored after completion when Romney lost to Obama.", "Was considered for the lead role in Steve 'Job' (qv)s (2015), which went to 'Michael Fassbender' (qv).", "Is a registered Democrat. Many fans of his work in _American Sniper (2014)_ (qv) were confused and/or angry when he attended the 2016 Democratic National Convention, having wrongly assumed that Cooper was a conservative Republican because his character in that movie, Chris Kyle, was one in real life.", "Can impersonate 'Robert De Niro' (qv), 'Owen Wilson' (qv), 'Christopher Walken' (qv) and 'Bill Clinton' (qv) after having met them and/or worked with them.", "He added 37 pounds for his role as Navy SEAL Chris Kyle in _American Sniper (2014)_ (qv) through two intense weight training workouts and consuming 6,000 calories a day.", "When the media asked why he was not in a romantic relationship with his frequent co-star 'Jennifer Lawrence' (qv), he said it was because she's too young. However, he revealed to 'Howard Stern' (qv) it was just something he said to get them off his back.", "Attended the 2016 Democratic National Convention in his hometown of Philadelphia, but was taken aback that conservatives threatened to boycott him since he portrayed Chris Kyle. He describes President Obama as an \"incredible\" president and even helped get him onto Between Two Ferns with Zach Galifianakis which helped skyrocket the number of young people who signed up for www.healthcare.gov. He was also a special guest at a BET tribute concert for President Obama, which Dave Chappelle joked about a week earlier on Saturday Night Live.", "For starring in the Broadway revival of the play \"The Elephant Man,\" Cooper was nominated for the 2014 Tony Award for Best Actor in a Play.", "He didn't like _All About Steve (2009)_ (qv) but he was happy to work with 'Sandra Bullock' (qv).", "Friends with 'Cameron Diaz' (qv), 'Amy Adams' (qv), 'Eva Longoria' (qv), 'Anne Hathaway' (qv), 'Dave Bugliari' (qv), 'Chris Tucker' (qv) and 'Dennis Quaid' (qv).", "He sought and campaigned for the role of Bruce Wayne/Batman in _Batman v Superman: Dawn of Justice (2016)_ (qv). The role went to his _He's Just Not That Into You (2009)_ (qv) co-star 'Ben Affleck' (qv).", "Has contemplated going back to school to receive his Ph.D. in English and teaching literature.", "Became a father for the first time at age 42 when his now ex-girlfriend 'Irina Shayk' (qv) gave birth to their daughter Lea de Seine Shayk Cooper in March 2017.", "As of 2017, has appeared in 4 Oscar Best Picture nominees: _Silver Linings Playbook (2012)_ (qv), _American Hustle (2013)_ (qv), _American Sniper (2014)_ (qv), and _A Star Is Born (2018)_ (qv) and given an Oscar-nominated performance in each.", "Nominated for the 2019 Golden Globe Award in the Best Performance by an Actor in a Motion Picture - Drama category for his role as Jack in _A Star Is Born (2018)_ (qv), but lost to 'Rami Malek' (qv) for _Bohemian Rhapsody (2018)_ (qv).", "Directed 3 actors in Oscar nominated performances: 'Lady Gaga' (qv), 'Sam Elliott' (qv), and himself.", "Counts directors 'Sidney Lumet' (qv) and 'Hal Ashby' (qv) among his greatest inspirations as a filmmaker.", "Nominated for a 2019 Academy Award in the Best Actor in a leading Role category for his role as Jack in _A Star Is Born (2018)_ (qv) but lost to 'Rami Malek' (qv) for _Bohemian Rhapsody (2018)_ (qv).", "Current and longtime student of David Gideon in New York City."], "quotes": ["There was a lot of Sack Lodges at my high school. - Sack Lodge is his character from _Wedding Crashers (2005)_ (qv).", "[on getting the script for _Kitchen Confidential (2005)_ (qv)] I was in New York shooting _Law & Order (1990)_ (qv) and the script came along, and I completely connected to it. From the first page, when he says, \"Ever since I was eight years old, I knew what I wanted to be.\" When I was eight years old, I wanted to be a chef or an actor. I used to cook all the time. I worked in restaurants the first half of my life. (November 2005)", "I had size 12 feet when I was 10, so I thought I was going to be 6' 8\". My goal was to be able to dunk a basket. I wound up being 6' 1\" with size 14 feet. I got the raw end of the deal.", "[2010, on his younger years] I never lived the life of \"Oh, you're so good-looking.\" People thought I was a girl when I was little, because I looked like a girl - maybe because my mother would keep my hair really long in a bowl cut. I was in a coffee shop once and the waitress was like \"What do you want, Miss?\" I was 10 or 11 - the worst age to have that happen. I had a jean jacket on and a Metallica pin. I thought I was really cool.", "[2010, on the incredible shape he got into for _The A-Team (2010)_ (qv) ] As the movie progressed, I got in increasingly better shape. There's this one fight scene with 'Liam Neeson' (qv) toward the end, where it's, like, the apex of the work. We finished and 'Joe Carnahan' (qv)'s like \"Brother, come here, look at this,\" and he played it back, and I swear to God, it looked like my head was digitally superimposed onto someone else's body. I was like \"This cannot be me - that's the way I look?\" It was so fucking surreal, 'cause as a kid I only fantasized about looking that way. Remember Soloflex commercials? That was huge when I was a kid. It was like \"I wanna be the Soloflex guy. Mom, can we get the Soloflex?\".", "[2010, on having to put himself on tape to send to casting directors when auditioning for roles as an aspiring actor] I'd love not to have to do that (anymore). I did it for this movie about UFC fighters a few years ago, and I didn't know anything about UFC fighters. I wore biking shorts. I was outside in my backyard in Venice, and I was, like kicking the trash cans and shit. I didn't know what I was doing. I would love to fucking see that tape.", "(2011) 'Todd Phillips' (qv) gave Vespas to the cast of _The Hangover Part II (2011)_ (qv) when we finished shooting. And I thought, a Vespa? What the heck kind of gift is that? I mean, it's nice, but I'll never drive it. But I tell you, I cannot stop riding that Vespa. I dream about it when I'm away. It's gotten to the point where I think I'm screwed: I'm starting to look at motorcycles.", "[2009, on his 'nice guy' role on _Alias (2001)_ (qv) and how it nearly typecast him] I remember that after I left Alias, people wouldn't even see me. I'd put myself on tape at home for all these roles because they were like \"Oh, no, no. Bradley. He's such a good guy. He can't play that.\" Then it was 'David Dobkin' (qv), I went in for him on _Wedding Crashers (2005)_ (qv) and he had no idea what 'Alias' was or anything. So he hired me right away and that was the major break. Then after that everyone was like \"Well, isn't he kind of an asshole? I mean, really. I think he's kind of an asshole.\" Elia Kazan always said that if you're going to play a cowboy you better show up with a horse because no one sees anything but what you bring. It's funny but sometimes people stop me and they're amazed that I'm not a complete asshole. They expect me to be an asshole right away. I gained a lot of weight to do 'Wedding Crashers' too and they're like \"Oh man, I thought you were bigger\" because I was 215 lbs for that movie and I'm usually 185 lbs. But to be opposite 'Vince Vaughn' (qv) and believe that I could destroy him in a football game...", "(2009, on his pets) I have two beautiful dogs that I cherish. Samson is a 14-year-old German short hair pointer and Charlotte is a 6 or 7 year-old Chow Retriever mix. They are both rescue dogs and they are the best ... I'm sort of a hybrid of both my dogs. Samson is stoic and makes me earn it and Charlotte loves me undyingly. They're my kids.", "(2009) I seriously love to cook ... My grandmother was an amazing cook. As a kid, I used to help her make handmade pasta, cavatelli and ravioli. It was one of my favorite things to do. I love the idea of making whatever is in the fridge into something.", "(2011, on being considered a very successful actor after _The Hangover (2009)_ (qv) become a huge hit) It doesn't feel that way. Thank you for saying that. Not the case, I gotta say, but it certainly provided more opportunities. Everybody who was a part of that movie, because it was so financially lucrative, benefited from it but I still put myself on tape for movies and try to get roles. It's the same, you know? It's the same. I mean, look, more doors have been opened for sure but it's not like I sit back with a cigar on Monday morning and go through the scripts that have been offered - no, that's not the case.", "(2011, on how he spends his spare time) Eating. I eat a lot of food. I am a big eater.", "[on the characters in _Silver Linings Playbook (2012)_ (qv)] The fact that these guys are trying to adopt a positive attitude was really important to me. As 'Jack Nicholson' (qv) always says, 'Try to incline yourself upwards as much as possible' because it is too easy in this world to incline yourself downwards. These people have every reason to incline themselves downwards, but they're trying to rebuild the economy of their lives. And that's why (they) aren't so fringy to me: they become the most sane people in the room.", "Filming a movie with 'David O. Russell' (qv) is an athletic endeavor. You are utterly drained at the end of the day because you have to be present at every turn, as if you're on a sports field. That high-octane rhythm demands that you stay in the moment and get out of your head. It's the only way you can be successful as an athlete. That's very scary for an actor.", "[2012, on quitting drinking at age 29] I was at a party and deliberately bashed my head on the concrete floor. Like \"Hey, look how tough I am!\" I did it again. I spent the night at St. Vincent's Hospital with a sock of ice, waiting for them to stitch me up... I don't drink or do drugs anymore. Being sober helps a great deal... I remember looking at my life, my apartment, my dogs [when I was still using], and I thought, \"What's happening?\" I was so concerned what [people] thought of me, how I was coming across, how I would survive the day. I always felt like an outsider. I just lived in my head. I realized I wasn't going to live up to my potential, and that scared the hell out of me. I thought, \"Wow, I'm actually gonna ruin my life. I'm really gonna ruin it.\".", "[on shooting _The Hangover (2009)_ (qv) in Las Vegas] People did not react to us. That's the one thing about Vegas: They were completely indifferent. We would go in the elevator at 5 in the morning after shooting, and I had huge scratches on my head, full make-up, and they don't give a fuck. It was unbelievable.", "I plead guilty to the accusation of working with people again and again. That's the goal, to create an artistic circle that works. If you look at any period of art that's really exploding, it's people collaborating again and again.", "I don't see myself as a ladies' man, but I love women.", "[on his approach to acting] I don't see a difference between a dramatic role and a comedic role, because they're all characters I play, and people that are not me.", "[To 'Howard Stern' (qv) on why he and frequent co-star 'Jennifer Lawrence' (qv) never had any romantic relationship]: I said that once on the carpet as a diffuse thing and then it became a big thing because the girl I was seeing was as young as she was. It just didn't happen, it's just not the way we are together. She's absolutely not [too young]. That's insulting, that hurt. (laughs)", "I've always known I wanted to direct. Always. So it was about facing the fear of doing it. I said by forty if I hadn't taken a shot, shame on me.", "[on 'Lady Gaga' (qv)] I love her so deeply. It's because we were st our most vulnerable together."], "salary history": ["_The Hangover (2009)_ (qv)::$600,000", "_The Hangover Part II (2011)_ (qv)::$5,000,000", "_The Hangover Part III (2013)_ (qv)::$15,000,000", "_American Hustle (2013)_ (qv)::$2,500,000 + 9% gross point"], "birth date": "1975-01-05", "birth notes": "Philadelphia, Pennsylvania, USA", "_actorID": "5", "_source": "IMDB", "actorID": "0177896", "created_utc_dt": "09/14/2019, 13:01:15"}