{"headshot": "https://m.media-amazon.com/images/M/MV5BMTY4OTAxMjkxN15BMl5BanBnXkFtZTgwODg5MzYyMTE@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Chocolate Droppa"], "birth name": "Kevin Darnell Hart", "height": "5' 4\" (1.63 m)", "mini biography": ["'Kevin Hart' (qv) was born on July 6, 1979 in Philadelphia, Pennsylvania, USA as Kevin Darnell Hart. He is a producer and actor, known for _Ride Along (2014)_ (qv), _Central Intelligence (2016)_ (qv) and _Grudge Match (2013)_ (qv). He has been married to 'Eniko Parrish' (qv) since August 13, 2016. They have one child. He was previously married to 'Torrei Hart' (qv).::Anonymous"], "spouse": ["'Eniko Parrish' (qv)::(13 August 2016 - present) ( 1 child)", "'Torrei Hart' (qv)::(22 May 2003 - 13 November 2011) ( divorced) ( 2 children)"], "trade mark": ["Short stature"], "trivia": ["Has three children: Heaven Lee Hart (born 2005), Hendrix Hart (born October 8, 2007), and Kenzo Kash Hart (born November 21, 2017). His first two children are with his former wife, Torrei, and his third with his wife 'Eniko Parrish' (qv).", "After graduating from high school, he moved to New York City to attend community college.", "Once worked as a shoe salesman. He quit the job to work full-time in comedy clubs.", "Close friend of 'Anthony Anderson' (qv), 'Dwayne Johnson' (qv), 'Ludacris' (qv), 'Usher Raymond' (qv),and 'Nick Cannon' (qv).", "Is good friends with 'Jason Segel' (qv).", "Engaged to model 'Eniko Parrish' (qv) on August 14, 2014. They married in 2016.", "He was awarded a Star on the Hollywood Walk of Fame for Live Theatre at 7013 Hollywood Boulevard in Hollywood, California on October 10, 2016.", "Son of Henry Robert Witherspoon and Nancy Hart."], "quotes": ["I think if someone gets kicked in the face it is their fault- they watched the foot come towards their face.", "[on being asked if there were any topics he would not joke about] Uh, yes. Rape. Rape would be one of them. I also stay clear of homosexuality or anything dealing with that right now, because it's such a sensitive topic in today's times. There are words I've used in the past that I wouldn't use now because of the attention those words get.", "[on discovering his comic side] I was probably around eleven. My mom was about to whup me, whup me with a belt. I said something she couldn't help but laugh at, and I thought I might be funny. Cause if I could stop a whupping with comedy, I'm doing the right thing.", "A reputation as a hard worker is a good reputation to have. It's also about being professional and very loyal to the people who put me here, which would be my fans. I feel like I have a job to do, like I constantly have to reinvent myself. The more I up the ante for myself, the better it is in the long run. I try to interact with my fans as much as possible. It's good that the person I'm being onstage isn't really an act. It's really me.", "Here's the thing. We do a movie with a predominantly black cast and it's put in a category of being a black film. When other movies are done with a predominantly white cast, we don't call them a white film. I'm trying to remove the stigma off things they call black films.", "[on his relationship with his father] My dad said I was supposed to be on drugs. I was like \"Dad, shut up,\" but then I thought about it and, and it was stupid, but it made sense. He was saying that basically he was my example to never go down that road.", "I don't like to alienate anybody with my comedy. I don't want to disengage audiences. I want to appeal to everyone and take them minds away from their issues with a lot of laughter. It's about providing some escape."], "salary history": ["_Think Like a Man (2012)_ (qv)::$10,500,000 (including bonuses)"], "birth date": "1979-07-06", "birth notes": "Philadelphia, Pennsylvania, USA", "_actorID": "68", "_source": "IMDB", "actorID": "0366389", "created_utc_dt": "09/14/2019, 13:02:15"}