{"headshot": "https://m.media-amazon.com/images/M/MV5BNjUzMDIzNjkxMl5BMl5BanBnXkFtZTgwNjgyNzA0MjI@._V1_UY98_CR40,0,67,98_AL_.jpg", "height": "6' 3¼\" (1.91 m)", "mini biography": ["'Paul Bettany' (qv) is an English actor. He first came to the attention of mainstream audiences when he appeared in the British film _Gangster No. 1 (2000)_ (qv), and director 'Brian Helgeland' (qv)'s film _A Knight's Tale (2001)_ (qv). He has gone on to appear in a wide variety of films, including _A Beautiful Mind (2001)_ (qv), _Master and Commander: The Far Side of the World (2003)_ (qv), _Dogville (2003)_ (qv), _Wimbledon (2004)_ (qv), and the adaptation of the novel _The Da Vinci Code (2006)_ (qv). He is also known for his voice role as J.A.R.V.I.S. in the Marvel Cinematic Universe, specifically the films _Iron Man (2008)_ (qv), _Iron Man 2 (2010)_ (qv), _The Avengers (2012)_ (qv), _Iron Man 3 (2013)_ (qv), and _Avengers: Age of Ultron (2015)_ (qv), in which he also portrayed the Vision, for which he garnered praise. He reprised his role as the Vision in _Captain America: Civil War (2016)_ (qv).Bettany was born in Harlesden, London, England, into a theatre family. His father, 'Thane Bettany' (qv), died in 2015, and his mother, 'Anne Kettle' (qv), has retired from acting. His maternal grandmother, 'Olga Gwynne' (qv) (her maiden and stage name), was a successful actress, while his maternal grandfather, Lesley Kettle, was a musician and promoter. He has an older sister who is a writer. Paul was brought up in North West London and, after the age of nine, in Hertfordshire (Brookmans Park). Immediately after finishing at 'Chang-Ren Nian' (qv), he went into the West End to join the cast of \"An Inspector Calls\", though when asked to go on tour with this play, he chose to stay in England.Paul is married to American actress 'Jennifer Connelly' (qv), with whom he has two children.::Anonymous and Pedro Borges"], "spouse": ["'Jennifer Connelly' (qv)::(1 January 2003 - present) ( 2 children)"], "trade mark": ["Scene-stealing supporting characters", "Towering height and slender frame"], "trivia": ["Son of 'Thane Bettany' (qv) and 'Anne Kettle' (qv). Has one older sister named Sarah, who lives in Cornwall (England) with her daughter Emaly.", "Developed laryngitis after filming _A Knight's Tale (2001)_ (qv) because of all the yelling he had to do as Geoffrey Chaucer.", "Also plays the guitar, and used to busk on Westminster Bridge in London.", "Acted for a year with the Royal Shakespeare Company.", "Has a stepson named 'Kai Dugan' (qv) (mother is 'Jennifer Connelly' (qv)).", "August 5, 2003 - his wife, 'Jennifer Connelly' (qv), gave birth to their first child, a boy.", "Son's name is 'Stellan Bettany' (qv), named after the actor 'Stellan Skarsgård' (qv) who acted with him in _Kiss Kiss (Bang Bang) (2001)_ (qv), _Dogville (2003)_ (qv) and _Avengers: Age of Ultron (2015)_ (qv).", "Apparently turned down the role of the Tooth Fairy in _Red Dragon (2002)_ (qv) (most probably offered to him after his frightening appearance as psycho gangster in _Gangster No. 1 (2000)_ (qv)) in favour of a much more poorly paid role in 'Lars von Trier' (qv)'s _Dogville (2003)_ (qv).", "Has appeared in many theatre productions, debuting in 'Stephen Daldry' (qv)'s production of \"An Inspectors Calls,\" grabbing the American film industry's attention in 'Joe Penhall' (qv)'s \"Love and Understanding.\" He also appeared in \"One More Waster Year\" and \"Stranger's House.\"", "Nominated for Best Actor for his role in Gangster No1 by London Film Critics Circle 'Awards' (qv).", "Paul's \"acting heroes\" are 'Humphrey Bogart' (qv), 'Al Pacino' (qv), 'Robert De Niro' (qv), 'Peter O'Toole' (qv) and 'Vincent Cassel' (qv).", "When he was 16, his younger brother Matthew, who was 8, died in a fall. Consequently, he claimed to be obsessed with having lots of children.", "Won Evening Standard Film Award 2001 for Best Supporting Actor for his role as Geoffrey Chaucer in _A Knight's Tale (2001)_ (qv).", "Writer/director 'Brian Helgeland' (qv) wrote the role of Chaucer in _A Knight's Tale (2001)_ (qv) specifically for Paul. He \"refused\" to do the movie without him. The production companies did not think Bettany was known well enough, Helgeland thought that if he backed down on his choice of Bettany, he would have to back down on everything else.", "Was invited to join the Academy of Motion Picture Arts and Sciences (AMPAS) in June 2004.", "He had to wear a wig for _The Da Vinci Code (2006)_ (qv) because, when they bleached his hair, the bleach burned bleeding holes in his head.", "Gave up smoking in 2005 after seeing his 2 year-old son, Stellan, imitating him with a pen.", "His son's godfather is the actor 'Charlie Condou' (qv) who starred with him in _Dead Babies (2000)_ (qv) and _Euston Road (2004)_ (qv).", "Grandson of 'Olga Gwynne' (qv) and Lesley Kettle.", "His wife, 'Jennifer Connelly' (qv), is expecting their second child, her third [December 14, 2010].", "His wife 'Jennifer Connelly' (qv) gave birth to their daughter Agnes Lark Bettany at home in New York City via a scheduled water birth (31 May 2011).", "Was the first choice to portray King George VI in _The King's Speech (2010)_ (qv) but after he turned it down 'Colin Firth' (qv), who went on to win the Best Actor Oscar for his performance, was cast instead.", "Decided at the age of 19 that he wanted to be an actor.", "Has acted in several religion-themed movies or played the part of a religious character, including: _Priest (2011)_ (qv) and _The Reckoning (2002)_ (qv) where he plays Priests who question their faith and go off on their own tangent; _Legion (2010)_ (qv) where he plays the Archangel Michael who also questions his moral fibre and risks disobedience to God to do what he feels is right; and _The Da Vinci Code (2006)_ (qv) where he plays an obsessive Monk who will do all he can to protect the secrets of Christianity.", "Was considered for the role of Lord Asriel in _The Golden Compass (2007)_ (qv). Some reports claimed that 'Nicole Kidman' (qv) was eager to star in the film as she wished to work with him again, having previously co-starred with him in _Dogville (2003)_ (qv).", "In February 2014 it was announced that Bettany would be playing Vision in Marvel's _Avengers: Age of Ultron (2015)_ (qv). This marks not only his first on screen appearance in a Marvel movie but he will also be playing a dual role since he will also be voicing 'Jarvis' Tony Stark/Iron Man's cyber man servant a role he has played four times previously.", "Turned down the starring role of Dr. William Masters in _Masters of Sex (2013)_ (qv) that went to 'Michael Sheen' (qv).", "He and his wife 'Jennifer Connelly' (qv) have played characters in films based on Marvel comic book characters. Bettany plays the voice of \"Jarvis\" in the \"Iron Man\" films as well as the live-action role of \"Vision\" in _Avengers: Age of Ultron (2015)_ (qv). Connelly played Betty Ross, the love interest of Bruce Banner in _Hulk (2003)_ (qv), and had a voice role in _Spider-Man: Homecoming (2017)_ (qv)."], "quotes": ["The world is split into two kinds of people, those who would go out for a drink with 'John Lennon' (qv), and those who'd choose 'Paul McCartney' (qv) ... After 'The Beatles' (qv) came back from India, Lennon wrote \"Happiness Is a Warm Gun\" and McCartney wrote \"Ob-La-Di, Ob-La-Da\". End of argument.", "My plan - well, it isn't much of a plan, but it's mine and I like it - is to try to do lots of different things.", "I love the way British people see ourselves. We say, 'He's like us, a bit of a loser.'", "A woman, who shall remain nameless, said to me, 'You're going to love LA, Paul, because over here ambition is not a dirty word.' And I thought, 'Well, you've named one of the things that I feel quite patriotic about.' It's still a little bit embarrassing in Britain if you're seen to try.", "One of my film heroes is 'Peter Weir' (qv), who made _Fearless (1993)_ (qv) but also made _Green Card (1990)_ (qv). 'Ang Lee' (qv) makes a western, he makes a Seventies psycho movie, a costume drama and a monster movie. I wanted to be like that. I finished this in October and I haven't worked since, because my wife [the actress 'Jennifer Connelly' (qv)] had just had the baby and I wanted to be with them. But I've just taken on a film called _Firewall (2006)_ (qv), which is a thriller with 'Harrison Ford' (qv). I'm doing it because I've never done a thriller before and I just get ... I just get bored if I don't do different things.", "People like 'Cary Grant' (qv), 'Will Smith' (qv) and 'Hugh Grant' (qv) do it brilliantly. They are just relentlessly charming and self-deprecating. I found that really difficult. But there may be other reasons for that.", "I wouldn't want to tumble with 'Harrison Ford' (qv) in real life. He's a tough son of a bitch. I threw that man through a window seven times and he landed on his head, got up, rebuilt the window with the crew and then got thrown through it again. I hit that man in the stomach and he said, 'Could you just land it a bit harder so I could feel it?' So I landed it a bit harder and he wanted a bit more so he could react to it. Finally, I just wound one up and let loose on him and he said, 'That's it!' It was the most humiliating day of my life.", "I'm English, so I can't wear a baseball cap. I'd look like white trash, like I should have a beer and a dog called Skeeter.", "Recalling once attending a photo-shoot with Connelly where she was asked to wear just a bra: And she said, 'No, no, not gonna do it,' and so they asked her to wear a man's dinner jacket. And I'm thinking, 'How many times have I seen this, you unimaginative bastards?' So she does it, and then the magazine cover gets pulled, 'cos she wouldn't wear the bra. Because that's what's men's magazines that are sort of soft porn want. They're more insidious than porn magazines.", "On how Hollywood treats its female actors: In general it's so much more of an objectification. You know the drill, it's a true story. For instance, if I am being asked to have a picture taken on the cover of a magazine, maybe they're wanting me to look sexy, maybe they're wanting me to look rugged, maybe they're wanting me to look fragile. With a woman, they want you to look available, essentially, that you are in some way inviting. And that's just fucking depressing.", "(On _The Da Vinci Code (2006)_ (qv)) I'd love to make a movie that shakes the world and offends people, but I really. Didn't think it was going to be this one. I think next to _The Last Temptation of Christ (1988)_ (qv), it's Tonka Toys. Nobody seemed to get offended by 'Martin Scorsese' (qv)'s movie, no one seemed to get offended when 'Francis Ford Coppola' (qv) made a movie where he suggested that the Mafia and the Vatican were in cahoots. Nobody picketed that. I play a monk who murders people, but it's no more a comment on monks than it is on people who wear sandals. Or big long brown dresses.", "... reading to both my kids has always been important. My wife, Jennifer, and I read to them every night. It's the most delicious time of the day when your child is all sleepy and cuddly and they get to snuggle up and you read them a bedtime story. It's the bit of parenting that makes up for when they're screaming and shouting at you.", "I do love to make music. When I was younger, growing up in London, I'd go to Westminster Bridge and play guitar to pick up a few coins from passersby. Every year we have a band that gets together and plays rock songs. This year, my stepson joined the band for the first time playing guitar and it was such a lovely, moving experience.", "[on \"Charles Darwin\", whom he plays in _Creation (2009)_ (qv)] - I couldn't believe the amount of violence that you can find on the Internet directed at a man who's been dead for a very long time. There's vicious diatribes full of hatred for Darwin. Actually, he was, by all accounts, one of the sweetest human beings you can possibly imagine. But there are still a lot of people who just can't accept his thinking without getting irrational. He was an atheist and so am I, but I don't think that makes me immoral.", "When I was a kid I took some martial arts classes, but on _Legion (2010)_ (qv) the stunt coordinators made you look like you can do the things that you can't, which is fantastic. I had an embarrassing amount of fun. It was like playing with a bunch of 10-year-olds who don't mind if you hit them. I had a scene where I threw a child zombie in the air who was attacking me. Actually, it was a small stunt person who was an adult. Everybody shot him and we were all giggling, even the poor guy who was being thrown. You can't take that stuff seriously.", "I did _Legion (2010)_ (qv) so I could shoot a big gun and channel 'Jackie Chan' (qv). I wouldn't lie to you. I don't like real guns, but the fake firearms are fantastic. My machine gun was huge and made a lot noise, but it didn't hurt anybody. I'm usually the bad guy in movies like this, so I got a kick out of being the hero.", "My dad made a lot of stories up at bedtime. He would create these wild stories about this elephant. As I got older, I remember him reading Lord of the Rings. My strongest memory was the moment when you think Frodo is dead and I forced him to read about 250 more pages until you realized he was okay.", "[on his film _Priest (2011)_ (qv)] The vampires in our film are creatures, they are full-on monsters and full-on ferocious, formidable beasts. They're really not your romantic idea of what the vampire is. This is a species that, in our world, has coexisted with human beings forever and we have just been managing a war forever...Now the war is over and the vampires are contained and the priests are relics. It's over for them, a little like Vietnam veterans...rendered totally unfit for normal life due to their experiences.", "I love westerns and the reason I love really good westerns is because they are really classical. Their structure is like a Roman tragedy. Lots of violence, lots of vengeance and occasionally redemption. They are wonderfully brutal.", "For some ungodly reason, I end up being naked in a lot of stuff. But there is a certain grace and kudos that come with taking your clothes off the first day, a respect that is given by the rest of the cast.", "[on if there's anything about being a musician that prepares one for being an actor] Well, it's interesting. You know, I was able to look at a group of kids that were sitting on the stairs when I used to busk, which is play music, and I'd be able to judge whether they were French or, you know, what their nationality was. So if they were French, I would think, \"Well, the Cure are huge in France, so I'll play a bunch of Cure songs.\" So I suppose in sort of recognizing what your audience wants, but I say that with trepidation because I'm not sure we should necessarily give the audience what they want. [laughs] You know what I mean? We live in a world where you make a film -- you spend two years in development, and then you spend six months in prep, then you shoot it for four months, and then spend another year editing it, and then you take it to a small town outside San Diego and show it to 60 teenagers, and then change your movie depending on what they say. I'm lost. Now you've lost me, because, you know, every 16-year-old boy is going to say, \"I think it should be a bit more like Underworld,\" you know what I mean? Should we then make every film a bit more like Underworld? I'm not sure that that's a great way to go about creating new stuff.", "[on if he likes to play characters who only see in black and white] No, I don't. I think, conversely, I sort of see the job of my life being a process of becoming less judgmental as I get older. That's what I want to do. Acting has so many vain and awful things about it, but one of the really edifying things about it is you can, at times, get the opportunity to put yourself imaginatively in another human being's position and try to see things from their perspective. I see that as a real gift, and I hope that this is part of making me a better human being, whatever that f---ing means. But I mean it, you know? I do at least mean it. I really want to make films that I care about, and this film [\"Margin Call\"] really sparked an awakening in me, just remembering all of the reasons I initially wanted to be an actor. It was just a fantastic experience. Seventeen days, we shot this f---ing movie; it was just unbelievable. It was an unbelievable comradely experience, and I hanker after it. You know, I've been on jobs that were seven months long, and I have many more memories of this job than those.", "[on _Raging Bull (1980)_ (qv)] I defy anybody to point out one thing that's wrong with it. It's just perfect.", "[on 'Daniel Day-Lewis' (qv) and his performance in _In the Name of the Father (1993)_ (qv)] It is one of the most exquisite performances of all time. I saw it when I was a student of acting, and there was lots of people to admire; there was 'Robert De Niro' (qv), and there was 'Al Pacino' (qv), and here was an English person, making such a complete and visceral transformation in character that you just went, \"Oh my God, we're allowed to do that sort of thing, too?\" That felt really empowering.", "[on villainy in the movies] A good villain has to have a clear philosophy about how the universe operates. They can't just be doing bad things because they're evil. They have to be thinking, Everyone else is getting theirs, so why can't I get mine?"], "birth date": "1971-05-27", "birth notes": "Harlesden, London, England, UK", "_actorID": "50", "_source": "IMDB", "actorID": "0079273", "created_utc_dt": "09/14/2019, 13:01:58"}