{"headshot": "https://m.media-amazon.com/images/M/MV5BMjMyOTM2OTk1Ml5BMl5BanBnXkFtZTgwMTI3MzkyNjM@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Steven John Carell", "height": "5' 9\" (1.75 m)", "mini biography": ["'Steve Carell' (qv), one of America's most versatile comics, was born Steven John Carell on August 16, 1962, in Concord, Massachusetts. He is the son of Harriet Theresa (Koch), a psychiatric nurse, and Edwin A. Carell, an electrical engineer. His mother was of Polish descent and his father of Italian and German ancestry (Steve's grandfather had changed the surname from \"Caroselli\" to \"Carell\"). Steve was educated at The Fenn School, an all-boys private school in Concord, Massachusetts, then at Middlesex School in Concord. After graduating from Denison University in Granville, Ohio, he moved to Chicago where he taught an improvisational comedy class and performed with The Second City troupe, alongside 'Stephen Colbert' (qv).Carell made his film debut as \"Tesio\" in _Curly Sue (1991)_ (qv). In 1996, he became a cast member of _The Dana Carvey Show (1996)_ (qv), and provided the voice for Gary, opposite Colbert in \"The Ambiguously Gay Duo\". This animated short series produced by 'Robert Smigel' (qv) continued on _Saturday Night Live (1975)_ (qv), but Carell has joked that he auditioned for SNL and lost the job to 'Will Ferrell' (qv). Carell made a number of guest appearances on such shows as _Come to Papa (2004)_ (qv), _Just Shoot Me! (1997)_ (qv), and _Watching Ellie (2002)_ (qv), before landing a regular stint as a correspondent on _The Daily Show (1996)_ (qv) from 1999 until 2005.Carell played Evan Baxter opposite 'Jim Carrey' (qv) in _Bruce Almighty (2003)_ (qv), and Uncle Arthur opposite 'Nicole Kidman' (qv) and 'Will Ferrell' (qv) in _Bewitched (2005)_ (qv). He broke out as a leading man after starring in the summer box-office hit _The 40-Year-Old Virgin (2005)_ (qv), which he also co-wrote; the film was chosen as one of the Top Ten movies of 2006 by the American Film Institute. He next starred in the critically acclaimed _Little Miss Sunshine (2006)_ (qv), an indie dark comedy which became a surprise hit and earned four Oscar nominations, and won two (Best Supporting Actor for 'Alan Arkin' (qv) and Best Screenplay for 'Michael Arndt' (qv)). In 2007, Carell reprised his role as Evan Baxter, filling 'Jim Carrey' (qv)'s leading-man shoes as a politician asked by God to build a giant ark in _Evan Almighty (2007)_ (qv), the second installment of the \"Almighty\" franchise, co-starring 'Lauren Graham' (qv) and 'Morgan Freeman' (qv). In 2008, he re-united with 'Jim Carrey' (qv) in the highly successful animation hit _Horton Hears a Who! (2008)_ (qv), then appeared as Agent Maxwell Smart in the popular comedy _Get Smart (2008)_ (qv).Throughout this time, Carell maintained a successful career in television, starring as Michael Scott in the American remake of the Britain's existential comedy, _The Office (2005)_ (qv). He received the Golden Globe Award for Best Actor in Television Comedy for this leading role in 2006, and earned both Emmy and Golden Globe nominations each consecutive show until he departed in 2011.In 2010, Carell announced he was leaving \"The Office\" to concentrate on his film career, and has made steady appearance in such films as _Date Night (2010)_ (qv), _Despicable Me (2010)_ (qv), _Crazy, Stupid, Love. (2011)_ (qv), and _Seeking a Friend for the End of the World (2012)_ (qv). Carell's most recent roles are the comedies _Despicable Me 2 (2013)_ (qv), _Anchorman 2: The Legend Continues (2013)_ (qv), and _Alexander and the Terrible, Horrible, No Good, Very Bad Day (2014)_ (qv), and the drama _Foxcatcher (2014)_ (qv), and the more serious _Beautiful Boy (2018)_ (qv) and _Vice (2018)_ (qv).'Steve Carell' (qv) has been enjoying a happy family life with his wife, actress 'Nancy Carell' (qv), whom he met when she was a student in an improv class he was teaching at The Second City comedy troupe in Chicago. The couple have two children, daughter Elizabeth (born in May 2001), and son John (born in June 2004). 'Steve Carell' (qv) lives with his family in Los Angeles, California.::Jane McKnight"], "spouse": ["'Nancy Carell' (qv)::(5 August 1995 - present) ( 2 children)"], "trade mark": ["Frequently works with 'Will Ferrell' (qv) and 'Stephen Colbert' (qv)", "Often plays characters who derive humor from awkward situations", "Often plays characters who are oblivious or have a lack of self awareness."], "trivia": ["Attended and graduated from Denison University in Granville, Ohio (1984).", "Has two children: Elisabeth Anne Carell (b. May 2001) and John Carell (b. June 2004).", "Married to actress/writer 'Nancy Carell' (qv), whom he met while both were writer/performers with the famed Second City comedy troupe in Chicago, Illinois.", "When he attended the premiere for _Bruce Almighty (2003)_ (qv), he came to the screening with the impression that his scenes were left on the cutting-room floor. However, his scenes were in the film, and he was pleasantly surprised.", "His paternal grandfather, Ernest Caroselli, was an Italian emigrant, from Bari, Italy, and his paternal grandmother, Marie G. Egle, was of German ancestry. Steve's maternal grandparents Zigmund Koch and Frances Victoria Tolosky were of Polish origin. Steve's father was born under the surname \"Caroselli\", which he changed to \"Carell\" before Steve was born.", "Was once a reporter for _The Daily Show (1996)_ (qv).", "Provides the voice of Gary on \"The Ambiguously Gay Duo\" cartoons on _Saturday Night Live (1975)_ (qv).", "Originally wanted to be a lawyer, but he reached a question on an application form that said, \"Why do you want to be a lawyer?\". He could not think of anything.", "Has the rare distinction of being in two movies that opened on the same day in the United States - _Anchorman: The Legend of Ron Burgundy (2004)_ (qv) and _Sleepover (2004)_ (qv) (July 9, 2004).", "Was on three failed sitcoms before he starred on NBC's version of the sitcom _The Office (2005)_ (qv).", "Worked the overnight shift in a Store 24 in Maynard, Massachusetts, and takes many of his characters from this experience.", "Denison Univerisity is not only the alma mater of 'Steve Carell' (qv) and 'Jennifer Garner' (qv), it is also the alma mater of 'Hal Holbrook' (qv), 'John Davidson' (qv), 'John Schuck' (qv) and 'Tom Cotter' (qv).", "Is a member of what the media refers to as the Frat Pack, along with 'Jack Black' (qv), 'Ben Stiller' (qv), 'Vince Vaughn' (qv), 'Will Ferrell' (qv), 'Owen Wilson' (qv) and 'Luke Wilson' (qv). The Frat Pack name is a reference to the film _Old School (2003)_ (qv), featuring Vaughn, Ferrell and Wilson, due to the wide number of films featuring the seven actors. Carell's Frat Pack films include _Anchorman: The Legend of Ron Burgundy (2004)_ (qv), _Bewitched (2005)_ (qv) and _Melinda and Melinda (2004)_ (qv).", "Grew up in Newton, Massachusetts.", "Editor-in-Chief of his high school newspaper, Newton South's \"The Lion's Roar\".", "Attended Middlesex School in Concord, Massachusetts.", "The scene in _The 40-Year-Old Virgin (2005)_ (qv), where Andy has his chest hair removed, required five cameras set up for the shot. It was Carell's real chest hair which was ripped out in the scene. Carell told director 'Judd Apatow' (qv) just before shooting the scene: \"It has to be real. It won't be as funny if it's mocked up or if it's special effect. You have to see that this is really happening.\" The scene had to be done in one shot.", "Good friends with fellow former _The Daily Show (1996)_ (qv) correspondent 'Stephen Colbert' (qv).", "Was offered a role in _Talladega Nights: The Ballad of Ricky Bobby (2006)_ (qv) with 'Will Ferrell' (qv) but could not accept due to scheduling conflicts.", "Was a member of Burpee's Seedy Theatrical Company, Denison University's improv-comedy group and the oldest collegiate improv group in the country.", "Is one of 115 people invited to join the Academy of Motion Picture Arts and Sciences (AMPAS) in 2007.", "He and 'Jim Carrey' (qv) were both ice hockey goalies in their childhood.", "Worked for a brief period at a post office in Massachusetts where he delivered mail using his own car since the post office did not have mail carrier vehicles. When he resigned from the position to move to Chicago, for months afterward he continued to find undelivered mail under his car seats.", "He was nominated for a 1993 'Joseph Jefferson' (qv) Award for Actor in a Revue for \"Truth, Justice, or the American Way\", at the Second City Theatre in Chicago, Illinois.", "He was nominated for a 1994 'Joseph Jefferson' (qv) Award for Actor in a Revue for \"Are You Now or Have You Ever Been Mellow?\", at the Second City Theatre in Chicago, Illinois.", "Owns and operates the Marshfield Hills General Store in Marshfield, Massachusetts, where he has a summer home.", "Received a star on the Hollywood Walk of Fame at 6708 Hollywood Boulevard in Hollywood, California on January 6, 2016.", "First rock concert he ever attended featured 'Jethro Tull' (qv).", "As of 2019, he has been in 3 films that were Oscar nominated for Best Picture: _Little Miss Sunshine (2006)_ (qv), _The Big Short (2015)_ (qv), and _Vice (2018)_ (qv)."], "quotes": ["I have no idea where my pathetic nature comes from. If I thought about it too long, it would depress me.", "I think a character in a comedy should not know they're in a comedy.", "I don't think of myself as funny - I don't fill up a room with my humor... I would fail miserably as a stand-up comedian.", "You can't seem to have any sort of inhibition. Or shame. Or absolute horror at your own physical presence. I know I'm not a woman's fantasy man; I don't have to uphold this image of male beauty, so that's kind of a relief in a way.", "When they approached me about who I would want writing _Get Smart (2008)_ (qv), I suggested B.J. The episodes that he's written walk the line between intensely funny and slightly offensive. But they always fall on the side of being funny. I also suggested him because I think he's going to be someone I'll be working for someday, and I want to get on his good side now - on his _The Office (2005)_ (qv) co-star and co-writer 'B.J. Novak' (qv).", "[on life since _The 40-Year-Old Virgin (2005)_ (qv) made his a movie star.] I have a helluva lot more money than I used to! That's the only perceivable difference. I will definitely be able to send my kids to college now, which was a question before. (2007)", "[on playing Maxwell Smart in the upcoming _Get Smart (2008)_ (qv)] I am sort of billing it as a comedic \"Bourne Identity\". [referring to _The Bourne Identity (2002)_ (qv)] (2007)", "[on being a father] I'm already seeing my daughter's cynical sense of humor and she's six! I bought these shoes, and I'm thinking I'm a cool dad, I'm going to show her my new half-boot shoes. So I said, \"What do you think of these?\" And she's like, \"Mmm no, not liking them.\" (2007)", "(2005, on a pre-acting job) I worked the third shift at a convenience store for a few months. At four in the morning most people are looking for cigarettes, porn or one of those shriveled, angry-looking hot dogs from the rotating grill. One night, though, a woman came in during the wee hours. She looked a bit distraught as she paid at the counter. She paused for a moment, looked up at me and asked, \"Do you think I'm pretty?\" As it turned out, she had just walked in on her boyfriend with another woman. We proceeded to have a lengthy conversation about a person's self-worth, fidelity, trust and relationships. And then I treated her to a slushy blue frozen drink.", "(2005, on originally wanting to be a lawyer) Being a lawyer just sounded good to me. Kind of like how being a doctor or being an astrophysicist or a microbiologist sounds good. But it took a complete turn when I was filling out my law-school application. I couldn't answer the essay question, which was, Why do you want to be an attorney? I had absolutely no idea. Uh, to make a lot of money and sue people? To be hated based solely on my job title? I couldn't come up with one good reason. That ended my law career rather quickly.", "(2005, on performing announcing duties for the video games, Outlaw Golf and Outlaw Volleyball) Who wouldn't want to get paid for spending a couple of hours in a sound booth? I went in thinking, Yeah, free money! But it was so much harder than I thought it'd be. There are thousands of possible scenarios in a video game, and you have to do lines for all of them. It was pretty taxing. Then again, it's not like I was chopping down trees or anything. That sounds pretty whiny, doesn't it? \"I had to say so many words. It was haaaard! Waaaah!\"", "[on his character from _The Daily Show (1996)_ (qv)] In my mind, he was a guy who had done national news reporting but had fallen from grace somehow and was now relegated to this terrible cable news show and was very bitter about it and thought he was better, but he wasn't.", "[on whether he feared being typecast in comedy roles] I've done big commercial movies and little independent movies, and I've played jerks and suicidal Proust scholars, and I feel like I've been really lucky to play all the different types of characters. So, no, I don't worry about that. If I do get pigeonholed, it's nothing I can really control.", "[on his surprise at hearing so much laughter in _Foxcatcher (2014)_ (qv)] The way Bennett [Miller] describes the humor is that it's funny until it's not anymore, and if this story didn't have the outcome that it does, it could just be an absurd, ridiculous story. But the fact it ends up where it does, and that there's this pall that hangs over the entire narrative, changes everything. But some of it so absurd you can't help but laugh because it seems too strange to be true.", "[on male bonding in _Foxcatcher (2014)_ (qv)] It's about offering up yourself to vulnerability. I think Bennett presents all this things in a very open way and allows the viewer to draw their own conclusion. He was finding it, as we were finding it, and I think that's an extremely exciting aspect of working like this."], "salary history": ["_The Office (2005)_ (qv)::$297,000 /episode (2010-11)", "_The Office (2005)_ (qv)::$175,000 per episode (season 3)", "_The 40 Year Old Virgin (2005)_ (qv)::$500,000", "_Evan Almighty (2007)_ (qv)::$5,000,000", "_Date Night (2010)_ (qv)::$12,500,000", "_Despicable Me (2010)_ (qv)::$500,000", "_Dinner for Schmucks (2010)_ (qv)::$12,000,000", "_Crazy, Stupid, Love. (2011)_ (qv)::$15,000,000 (including producing fee)"], "birth date": "1962-08-16", "birth notes": "Concord, Massachusetts, USA", "_actorID": "25", "_source": "IMDB", "actorID": "0136797", "created_utc_dt": "09/14/2019, 13:01:35"}