{"headshot": "https://m.media-amazon.com/images/M/MV5BMTM3OTUwMDYwNl5BMl5BanBnXkFtZTcwNTUyNzc3Nw@@._V1_UY98_CR7,0,67,98_AL_.jpg", "birth name": "Scarlett Ingrid Johansson", "height": "5' 3\" (1.6 m)", "mini biography": ["'Scarlett Johansson' (qv) was born in New York City. Her mother, 'Melanie Sloan' (qv), is from a Jewish family from the Bronx, and her father, 'Karsten Johansson' (qv), is a Danish-born architect, from Copenhagen. She has a sister, 'Vanessa Johansson' (qv), who is also an actress, a brother, Adrian, a twin brother, 'Hunter Johansson' (qv), born three minutes after her, and a paternal half-brother, Christian. Her grandfather was writer 'Ejner Johansson' (qv).Johansson began acting during childhood, after her mother started taking her to auditions. She made her professional acting debut at the age of eight in the off-Broadway production of \"Sophistry\" with 'Ethan Hawke' (qv), at New York's Playwrights Horizons. She would audition for commercials but took rejection so hard her mother began limiting her to film tryouts. She made her film debut at the age of nine, as John Ritter's character's daughter in the fantasy comedy _North (1994)_ (qv). Following minor roles in _Just Cause (1995)_ (qv), as the daughter of 'Sean Connery' (qv) and Kate Capshaw's character, and _If Lucy Fell (1996)_ (qv), she played the role of Amanda in _Manny & Lo (1996)_ (qv). Her performance in Manny & Lo garnered a nomination for the Independent Spirit Award for Best Lead Female, and positive reviews, one noting, \"[the film] grows on you, largely because of the charm of ... 'Scarlett Johansson' (qv)\", while San Francisco Chronicle critic Mick LaSalle commentated on her \"peaceful aura\", and wrote, \"If she can get through puberty with that aura undisturbed, she could become an important actress.\"After appearing in minor roles in _Fall (1997)_ (qv) and _Home Alone 3 (1997)_ (qv), Johansson garnered widely spread attention for her performance in _The Horse Whisperer (1998)_ (qv), directed by 'Robert Redford' (qv), where she played Grace MacLean, a teenager traumatized by a riding accident. She received a nomination for the Chicago Film Critics Association Award for Most Promising Actress for the film. In 1999, she appeared in _My Brother the Pig (1999)_ (qv) and in the music video for Mandy Moore's single, \"Candy\". Although the film was not a box office success, she received praise for her breakout role in _Ghost World (2001)_ (qv), credited with \"sensitivity and talent [that] belie her age\". She was also featured in the Coen Brothers' dark drama _The Man Who Wasn't There (2001)_ (qv), opposite Billy Bob Thornton and Frances McDormand. She appeared in the horror comedy _Eight Legged Freaks (2002)_ (qv) with 'David Arquette' (qv) and 'Kari Wuhrer' (qv).In 2003, she was nominated for two Golden Globe 'Awards' (qv), one for drama (_Girl with a Pearl Earring (2003)_ (qv)) and one for comedy (_Lost in Translation (2003)_ (qv)), her breakout role, starring opposite 'Bill Murray' (qv), and receiving rave reviews and a Best Actress Award at the Venice Film Festival. Her film roles include the critically acclaimed Weitz brothers' film _In Good Company (2004)_ (qv), as well as starring opposite 'John Travolta' (qv) in _A Love Song for Bobby Long (2004)_ (qv), which garnered her a third Golden Globe Award nomination.She dropped out of _Mission: Impossible III (2006)_ (qv) due to scheduling conflicts. Her next film role was in _The Island (2005)_ (qv) alongside 'Ewan McGregor' (qv) which earned weak reviews from U.S. critics. After this, she appeared in 'Woody Allen' (qv)'s _Match Point (2005)_ (qv) and was nominated again for a Golden Globe Award. In May 2008, she released her album \"Anywhere I Lay My Head\", a collection of 'Tom Waits' (qv) covers featuring one original song. Also that year, she starred in Frank Miller's _The Spirit (2008)_ (qv), the 'Woody Allen' (qv) film _Vicky Cristina Barcelona (2008)_ (qv), and played Mary Boleyn opposite 'Natalie Portman' (qv) in _The Other Boleyn Girl (2008)_ (qv).Since then, she has appeared as part of an ensemble cast in the romantic comedy _He's Just Not That Into You (2009)_ (qv), the action superhero film _Iron Man 2 (2010)_ (qv), the comedy-drama _We Bought a Zoo (2011)_ (qv) and starred as the original scream queen, 'Janet Leigh' (qv), in _Hitchcock (2012)_ (qv). She then played her character, Black Widow, in the blockbuster action films _The Avengers (2012)_ (qv), _Captain America: The Winter Soldier (2014)_ (qv), _Avengers: Age of Ultron (2015)_ (qv), _Captain America: Civil War (2016)_ (qv), _Avengers: Infinity War (2018)_ (qv), and _Avengers: Endgame (2019)_ (qv), and also headlined the sci-fi action thriller _Lucy (2014)_ (qv), a box office success. With more than a decade of work already under her belt, Scarlett has proven to be one of Hollywood's most talented young actresses. Her other starring roles are in the sci-fi action thriller _Ghost in the Shell (2017)_ (qv) and the dark comedy _Rough Night (2017)_ (qv).Scarlett and Canadian actor 'Ryan Reynolds' (qv) were engaged in May 2008 and married in September of that year. In 2010, the couple announced their separation, and subsequently divorced a year later. In 2013, she became engaged to French journalist Romain Dauriac, the couple married a year later. In January 2017, the couple announced their separation, and subsequently divorced in March of that year. They have a daughter, Rose Dorothy Dauriac (born 2014).::Pedro Borges"], "spouse": ["Romain Dauriac::(1 October 2014 - 12 September 2017) ( divorced) ( 1 child)", "'Ryan Reynolds' (qv)::(27 September 2008 - 1 July 2011) ( divorced)"], "trade mark": ["Often plays characters who look and act older than their age", "Full lips and green eyes", "Seductive husky voice", "Contralto singing voice"], "trivia": ["Received an \"introducing\" credit for _The Horse Whisperer (1998)_ (qv) although this was her seventh feature film.", "Attended and graduated from Professional Children's School in Manhattan, New York City (2002).", "Granddaughter of writer 'Ejner Johansson' (qv).", "Scarlett's mother, 'Melanie Sloan' (qv), who is from the Bronx, is from an Ashkenazi Jewish family (from Poland, Belarus and Russia). Scarlett's father, 'Karsten Johansson' (qv), is Danish (his own paternal grandfather was Swedish, while his other family is Danish).", "Invited to join the Academy of Motion Picture Arts and Sciences (AMPAS) in June 2004.", "Applied to New York University's Tisch School of the Arts for the fall 2003 semester, but was not accepted. The rejection allowed her to focus on her career, which blossomed soon after.", "Shortly after _Lost in Translation (2003)_ (qv) was released, she said she had a connection to older men and could not see herself dating anyone under 30. True to her word, she had a relationship with actor 'Benicio Del Toro' (qv), who is 17 years her senior.", "She was cast as Rebecca in the comedy film _Thumbsucker (2005)_ (qv), but dropped out before filming commenced and was replaced by 'Kelli Garner' (qv).", "Her father 'Karsten Johansson' (qv), a New York architect, and mother 'Melanie Sloan' (qv), her manager, now divorced, separated when she was age 13.", "Campaigned for 'John Kerry' (qv) in the 2004 Presidential Election.", "Celebrated her 20th birthday at Disneyland on November 22, 2004.", "Auditioned for a role in _The Parent Trap (1998)_ (qv), which finally went to 'Lindsay Lohan' (qv).", "Has an older half-brother ('Christian Johansson' (qv)), an older sister ('Vanessa Johansson' (qv)), an older brother ('Adrian Johansson' (qv)), and a younger twin brother ('Hunter Johansson' (qv)).", "Planned to attend Purchase University to study film.", "Her older sister 'Vanessa Johansson' (qv) is also an actress.", "Prepared for her role in _Lost in Translation (2003)_ (qv) by living on Hokkaido with then-boyfriend Faiz Ahmad.", "Is three minutes older than her twin brother 'Hunter Johansson' (qv). She says these three minutes are the most important in her life.", "First role (uncredited) was in a skit, during the first year of _Late Night with Conan O'Brien (1993)_ (qv), at age 8. She relived this moment during an interview with Conan on July 12, 2005, twelve years later. Also in the skit was 11-year-old 'Melissa Claire Egan' (qv).", "Ranked #9 in the 2005 FHM list of \"100 Sexiest Women in the World\". And was also the highest ranking new entry to the list.", "Is often ranked on Maxim magazine's Hot 100 Women list. She was ranked #63 in 2002, #13 in 2004, #24 in 2005, #6 in 2006, #3 in 2007, #2 in 2008, #34 in 2009, #14 in 2011, #17 in 2012, #15 in 2013 and #2 in 2014.", "Director 'Sofia Coppola' (qv) directed both Scarlett and her boyfriend 'Josh Hartnett' (qv), but not in the same movie. Scarlett was in Coppola's _Lost in Translation (2003)_ (qv) and Hartnett starred in _The Virgin Suicides (1999)_ (qv)", "She donated many items to 'Rocky Stone' (qv) to be given to less fortunate kids as part of the Toy Mountain Campaign.", "Chosen by FHM readers as \"Sexiest Woman Alive\" in the 2006 FHM list of \"100 Sexiest Women in the World\".", "Has a cat named Trooper and a chihuahua named Maggie.", "Named \"Sexiest Woman Alive\" by Esquire magazine. [October 2006]", "Named #1 in FHM magazine's \"100 Sexiest Women in the World 2006\" supplement.", "Was a member of the jury at the Venice Film Festival in 2004.", "Has been named the Sexiest Celebrity of 2007 by Playboy magazine.", "Is a huge fan of 'Woody Allen' (qv).", "She was considered for the role of Susan Storm/Invisible Girl in _Fantastic Four (2005)_ (qv), which went to 'Jessica Alba' (qv).", "She was offered the role of Lindsey Farris in _Mission: Impossible III (2006)_ (qv), which went to 'Keri Russell' (qv).", "She was offered the role of Evey in _V for Vendetta (2005)_ (qv), which went to 'Natalie Portman' (qv).", "She was offered the role of Lois Lane in _Superman Returns (2006)_ (qv), which went to 'Kate Bosworth' (qv).", "Is an alumna of the 'Lee Strasberg' (qv) Institute such as actors 'Frank Miranda' (qv), 'Mickey Rourke' (qv), 'Rosario Dawson' (qv), 'Dennis Hopper' (qv), 'Julia Roberts' (qv).", "Ranked #12 on Forbes magazine's list of the 20 Top-Earning Young Superstars (2007).", "In 2006, she was earning $2 million per year representing L'Oreal cosmetics.", "In 2007, Forbes magazine estimated her earnings for the year at $5 million.", "Supports 'Barack Obama' (qv).", "Was ranked #1 on Entertainment Weekly's '30 Under 30' the actress list (2008).", "Raised money for international relief organization Oxfam by auctioning off two tickets for _He's Just Not That Into You (2009)_ (qv) on eBay, giving the winning bidders the opportunity to mingle with her. By January 2014, she has severed her connection with Oxfam. [March 2008]", "(May 5, 2008) Announced her engagement to 'Ryan Reynolds' (qv), having been in a relationship with him since February 2007.", "Was in a relationship with 'Josh Hartnett' (qv) (2005-2007).", "(September 27, 2008) Married fiancé 'Ryan Reynolds' (qv) in a quiet ceremony in Canada.", "An avid fan of 'Tom Waits' (qv), she recorded an album comprised entirely of 'Tom Waits' (qv) covers, titled \"Anywhere I Lay My Head\". The album was released on May 16, 2008, but was not widely recognized.", "Replaced Brazilian 'Gisele Bündchen' (qv) as the face of \"Dolce & Gabbana\" perfumes (2009).", "The French synth band The Teenagers wrote a song about her called \"Starlett Johansson\".", "According to a poll of 5000 people conducted by Glamour magazine, Johansson was voted as having the \"World's Sexiest Body\".", "She was cast as Natasha Romanoff in _Iron Man 2 (2010)_ (qv) after 'Emily Blunt' (qv) dropped out due to other commitments.", "Has another sister named Fenan. She was adopted by Johansson's mother 'Melanie Sloan' (qv) from Ethopia in May 2010.", "In 2010, she won a Tony Award for Best Performance by a Featured Actress in a Play after making her Broadway debut in 'Arthur Miller' (qv)'s \"A View from the Bridge\".", "Johansson was named by GQ (men's magazine) as \"Babe of the Year\" for 2010.", "Her husband, 'Ryan Reynolds' (qv) was named as the \"Sexiest Man Alive\" by People magazine (2010) during the same time that Johansson was named as \"Babe of the Year\" by GQ magazine.", "Has been the ambassador of Moet & Chandon Champagne since 2009.", "(December 14, 2010) Her husband 'Ryan Reynolds' (qv) filed for divorce, citing irreconcilable differences.", "Has appeared in advertising campaigns for 'Calvin Klein' (qv), L'Oreal and Louise Vuitton. In 2009, she was also the face of Dolce & Gabbana make-up.", "In 2009, she became the face of Spanish clothing company Mango.", "Ranked #7 on Ask men's top 99 \"most desirable\" women of 2011.", "She was considered for the role of Dr. Ryan Stone in _Gravity (2013)_ (qv), but 'Sandra Bullock' (qv) was cast instead.", "In 2006, she signed an endorsement deal with cosmetics brand L'Oreal for $4,000,000.", "_The Looney Tunes Show (2011)_ (qv) created a character called Starlet Johansson in _The Looney Tunes Show: Casa de Calma (2011)_ (qv) who resembles her.", "Johansson was voted as the \"World's Most Natural Beauty\" according to a UK poll (2011).", "Voted as having the \"Best Breasts\" in Hollywood by In Touch magazine (2006) and the \"Best Female Bum\" according to a British poll.", "Named \"Hollywood's Most Natural Beauty\" by a survey of make-up artists (2006).", "Ranked #32 in the 100 Hot Girls list by FHM UK (2011). Previously, she was ranked #23 in 2010, #13 in 2009, #6 in 2008, #5 in 2007, #3 in 2006 and #68 in 2005.", "Named one of the Most Beautiful People in the World by People magazine (2007 and 2010).", "Ranked #22 in Who magazine's \"Most Beautiful People\" (2010).", "Named one of the \"Twenty Most Beautiful People of the Decade\" by Interview magazine (2009).", "Ranked #3 in the 2009 FHM list of \"100 Sexiest Women in the World\".", "Ranked #5 in the 2008 FHM list of \"100 Sexiest Women in the World\".", "Ranked #4 Sexiest Woman in the World (2011) by the Spanish version of DT magazine.", "Italian artist 'Francesco Clemente' (qv) included a portrait of Scarlett in his deck of 78 custom-painted tarot cards, with her portrayed as the Queen of Swords.", "Often ranked as having one of the \"Most Beautiful Famous Faces\" by \"The Annual Independent Critics List of the 100 Most Beautiful Famous Faces From Around the World\". She was ranked #42 in 2010, #71 in 2009, #72 in 2008, #34 in 2007, #43 in 2006, #39 in 2005, #37 in 2004, #45 in 2003, and #48 in 2002.", "She was considered for the role of Maggie Beauford in _Lawless (2012)_ (qv), but 'Jessica Chastain' (qv) was cast instead.", "Auditioned for the role of Lisbeth Salander in _The Girl with the Dragon Tattoo (2011)_ (qv). However, she did not get the role because she was considered too attractive for this. 'Rooney Mara' (qv) was cast instead.", "Featured in \"The Beauty Book for Brain Cancer\", a 312-page coffee-table book by photographer 'Darren Tieste' (qv). The book features photos of celebrities, musicians and models who donated their time to bring attention to brain cancer. 'Scarlett Johansson' (qv) was also chosen to be on the cover of the book (2011).", "In 2008, a UK-based bidder paid £20,000 British pounds on an eBay auction to benefit Oxfam, winning a pair of tickets to accompany Johansson on a 20-minute date to the world premiere of the film _He's Just Not That Into You (2009)_ (qv).", "Has been an ambassador for Oxfam International since 2005.", "Ranked #12 in Men's Health 100 Hottest Women of All Time (2011).", "Ranked #7 on Ask men's top 99 \"most desirable\" women of 2012.", "She was awarded a Star on the Hollywood Walk of Fame at 6931 Hollywood Boulevard in Hollywood, California on May 2, 2012. At the ceremony were her mother 'Melanie Sloan' (qv), grandmother, sister 'Vanessa Johansson' (qv) and her _The Avengers (2012)_ (qv) co-star 'Jeremy Renner' (qv).", "She appeared as Natasha Romanoff / Black Widow in eight films: _Iron Man 2 (2010)_ (qv), _The Avengers (2012)_ (qv), _Captain America: The Winter Soldier (2014)_ (qv), _Avengers: Age of Ultron (2015)_ (qv), _Captain America: Civil War (2016)_ (qv), _Avengers: Infinity War (2018)_ (qv), _Captain Marvel (2019)_ (qv) and _Avengers: Endgame (2019)_ (qv).", "Very close friends with her co-star, 'Chris Evans' (qv), with whom she has appeared in nine films: _The Perfect Score (2004)_ (qv), _The Nanny Diaries (2007)_ (qv), _The Avengers (2012)_ (qv), _Captain America: The Winter Soldier (2014)_ (qv), _Avengers: Age of Ultron (2015)_ (qv), _Captain America: Civil War (2016)_ (qv), _Avengers: Infinity War (2018)_ (qv), _Captain Marvel (2019)_ (qv) and _Avengers: Endgame (2019)_ (qv).", "She appeared with 'Samuel L. Jackson' (qv) in eight films: _The Spirit (2008)_ (qv), _Iron Man 2 (2010)_ (qv), _The Avengers (2012)_ (qv), _Captain America: The Winter Soldier (2014)_ (qv), _Avengers: Age of Ultron (2015)_ (qv), _Avengers: Infinity War (2018)_ (qv), _Captain Marvel (2019)_ (qv) and _Avengers: Endgame (2019)_ (qv).", "Named as one of the \"most desirable\" famous women for 2013 by Ask men's list of the top 99 \"most desirable\" women.", "Lives in ultra trendy Los Angeles neighborhood, Los Feliz. 'Giovanni Ribisi' (qv), 'Bo Barrett' (qv), 'Brad Pitt' (qv), 'Chris Pine' (qv), 'Ryan Reynolds' (qv), 'Mark Ruffalo' (qv), 'Kristen Stuart' (qv), 'Michael Cera' (qv) and 'Robert Pattinson' (qv) are among the other actors who also call Los Feliz home.", "She recorded the single \"Before My Time\" to the documentary _Chasing Ice (2012)_ (qv) and the song was eventually nominated for Best Original Song at _The Oscars (2013)_ (qv). Subsequently, she was approached to perform the song at the show, but was prevented to do so, due to her commitments with \"Cat on a Hot Tin Roof\" on Broadway.", "Was romantically involved with 'Jack Antonoff' (qv) of indie/folk band, 'Steel Train' (qv). The songs, \"Better Love\", \"2 O'Clock\", \"I Feel Weird\" and \"Dig\", all contain references to Scarlett.", "She auditioned for the roles of Judy Shepherd in _Jumanji (1995)_ (qv) and Claire Colburn in _Elizabethtown (2005)_ (qv). Both roles went to 'Kirsten Dunst' (qv) instead.", "Ex-girlfriend of 'Jared Leto' (qv) (2004-2005).", "Dislikes the nickname \"ScarJo\" that is commonly used by the media in reference to her.", "Along with her siblings, attended the Junior School at the Neighborhood Playhouse School of the Theatre as a young actor taking classes in acting, singing and dancing.", "Mr. Skin ranked her nude scenes from _Under the Skin (2013)_ (qv) at #1 on their list of \"The Top 150 Greatest Celebrity Nude Scenes of All Time\". [August 2014]", "Her great-uncle, 1st Lt Philip Schlamberg, US Army Air Force, was a P-51 Mustang pilot with the 15th Fighter Group at Iwo Jima in World War II and died over Japan on August 14, 1945, the day the Japanese surrendered.", "Suffers from a morbid fear of birds (ornithophobia) and cockroaches (katsaridaphobia).", "Had to have several stunt doubles whilst filming _Avengers: Age of Ultron (2015)_ (qv) due to her pregnancy.", "Is the first woman to play Kaa the python, in _The Jungle Book (2016)_ (qv).", "Her favorite movie is the comedy film _Auntie Mame (1958)_ (qv).", "Has appeared on screen with 'Chris Evans' (qv) more than any other leading man thus far.", "Highest-grossing actress of all time and 10th highest grossing actor of all time, bringing in $3.327 billion to the box office. In 2016 alone, she added $1.2 billion to that record which can possibly move her up to the top three highest grossing actors of all time. She was the highest grossing actor of the year.", "Twice chosen as the Sexiest Woman Alive by Esquire magazine.", "Has a daughter with her ex-second husband Romain Dauriac: Rose Dorothy Dauriac (born in September 2014).", "(March 7, 2017) Filed for divorce from her second husband of two years Romain Dauriac following the separation since last summer.", "Is the only actress to play an alien (_Under the Skin (2013)_ (qv)), a snake (_The Jungle Book (2016)_ (qv)), and a robot (_Ghost in the Shell (2017)_ (qv)).", "Funko manufactured and released POP! action figures of 'Scarlett Johansson' (qv)'s character Natasha Romanoff/Black Widow from the Marvel Cinematic Universe and The Major from _Ghost in the Shell (2017)_ (qv).", "She learned on the program _Finding Your Roots with Henry Louis Gates, Jr. (2012)_ (qv) that her maternal great-grandfather's brother, Mosze Szlamberg, was killed in the Holocaust in Poland, along with at least two of his children, Zlata and Mandlit.", "She auditioned for the role of Fantine in _Les Misérables (2012)_ (qv), which went to 'Anne Hathaway' (qv).", "She appeared in 'Justin Timberlake' (qv)'s music video \"What Goes Around... Comes Around\" (2007).", "Has appeared tied up with her mouth gagged in _Just Cause (1995)_ (qv). She was also tied to a chair in _The Avengers (2012)_ (qv).", "She wore her hair with a fringe in five films: _Lost in Translation (2003)_ (qv), _The Perfect Score (2004)_ (qv), _Chef (2014)_ (qv), _Under the Skin (2013)_ (qv) and _Ghost in the Shell (2017)_ (qv).", "Sir 'Sean Connery' (qv), who played her father in _Just Cause (1995)_ (qv), starred as the main antagonist in _The Avengers (1998)_ (qv) based on the classic British television series. 'Scarlett Johansson' (qv) later went on to play Natasha Romanoff/Black Widow in _The Avengers (2012)_ (qv) based on the Marvel comic book.", "Confirmed in December 2017 that she had begun a relationship with _Saturday Night Live (1975)_ (qv) co-head writer and \"Weekend Update\" co-host 'Colin Jost' (qv).", "Is left-handed.", "(May 19, 2019) Johannson has announced her engagement to 'Colin Jost' (qv), after a 2-year relationship."], "quotes": ["I'm so tired of hearing casting directors ask if I have a sore throat. The people who have told me that my voice is distinctive, it's unusual... those people have always been close to my heart.", "[on why she was glad that the drama _Girl with a Pearl Earring (2003)_ (qv) was a small foreign production] It would be hellish to have the pressure of putting on a Hollywood ending or putting in a scene where Vermeer sees Griet washing her breasts.", "I always check in the mirror to make sure nothing is see-through.", "I have a lot of actor friends who worked with their parents closely and have had really horrible experiences. They end up suing or being emancipated. The wonderful thing about my mom [who is also her manager] is that she completely respects my creative weirdness and supports any decision I make.", "As long as people keep buying tabloids, they will keep harassing people in the public eye. They will make up stories.", "[on 'David Hasselhoff' (qv), after they had both worked on _The SpongeBob SquarePants Movie (2004)_ (qv)] I so fancied him when I was young, that to see my name on the credits next to his makes me go all girly. He was a hunk back in those days.", "I have an obsessive character. I manicure my nails at three in the morning because nobody else can do it the right way. Maybe that's the secret to my success.", "It's a great thing to get older and learn. I don't feel bound in any way by how many years I've lived. I identify just as much with my 86-year-old grandmother as I do with my sister.", "People forget what it's like to be a child. When you're a child actress, people sometimes regress into being obnoxious and patronizing. But there's no reason to dumb things down just because you're working with kids.", "What I respect most in people is naturalness and authenticity. I like to be able to see into their soul. I aspire to being a truthful person.", "The most precious moment in life is when you're about to fall in love. You're lying in bed together and he's gazing at you and you're gazing at him and there's a sense that something truly wondrous is about to happen. It's a nervous moment - but it's exhilarating.", "I am very independent. I can look after myself but I still need a lot of love and care.", "I don't talk about my personal relationships, it always ends up kicking you in the face. But I've read a lot of things about myself and think, \"Wow! That girl sounds really saucy.\".", "I think that I sort of see other actresses are kind of proud of the way they look and show it off. That's never really been my style. I really don't think that it's disgusting or wrong, if you're 18 you're 18, it's your body, it's your right to show yourself, however, I don't really take a part in that. I like to look nice, but I think that there's ways of doing it that are more tasteful than just wearing a bikini wherever you go.", "I don't know if I've got swept up. It's so shocking when you hear that 'Calvin Klein' (qv) wants you for their new campaign. You're like \"who me?\". I guess you have to decide where you draw the line between you saying, this is fun, pretty and fabulous, and being over-exposed.", "Well, you put a little piece of yourself into every character that you do. Even if you're playing some psychotic person, which of course I'm not, some part of you is in that character and it's hopefully believable. I always come back to the fact that my own instinct is better than something I build in my mind.", "Tons of that stuff comes to me, but a lot of it is awful. All these teenage slaying movies, and movies about girls that have deformities that become cheerleaders and then marry the prom king!", "I always had the chance to do whatever I wanted to do, my parents were very open about that. Acting has been a passion of mine. I wanted to be in musicals as a kid, and took tap dance, so for me it's a dream come true, my childhood was filled with things that I loved to do, and also very normal things: I lived in New York, I have a family life and went to a regular school. If anything, I look back and think, \"Wow, I did a lot of things that a lot of people don't get to do in their lifetime.\".", "It's a place of solace. I love London, it's an amazing city. I've met some wonderful people there and I also have some family there. I'm from New York, so I feel very at home in London. It's like a metropolitan breeding ground for culture, art, music and diversity. It's a beautiful city, with beautiful history. In Hollywood, it's hard to step outside of the circle once you're in it. But in London, I was really moved by how accepted I felt there. There was definitely less need to wear my big sunglasses!", "[on filming _The Island (2005)_ (qv)] I came home and I thought I was going to die. I was in agony. I had muscles that had atrophied. I couldn't run any longer and it was only the first day. But actually, Ewan was in the same boat. He had black and blue marks all over him. So it wasn't so bad since someone else was in agony.", "I don't think there's any kind of preparation for sudden celebrity. I think you almost have this slight nervous breakdown when that kind of media attention happens. I mean, you're doing the same kind of thing that you do all the time, only you have to make these weird adjustments. Like, you're buying a slice of pizza and somebody's outside photographing you which is weird - that's not normal! It's very uncomfortable.", "Everyone in Hollywood is so damn skinny and you constantly feel like you're not skinny enough. But I have 'fat days' and I accept that I'm never going to be rail thin. It's hard not to feel pressure in this industry and I already use anti-aging products on my skin. I try not to let the pressure get to me but Los Angeles is a very hard place to be unless you have people here that love you. It can be very, very lonely, and it can eat you up if you don't take care of yourself.", "I was driving through Los Angeles and I look up and see the biggest photo of me I have ever seen in my life on a massive ad space. I screamed and slammed on the brakes. I couldn't believe it. It's very strange to see my cleavage the size of a brontosaurus. My breasts were huge. I had long hair and my goodness, I couldn't get past the cleavage.", "I don't think human beings are monogamous by nature. It's difficult - you have to put a lot of effort into a relationship. I think it's hard for actors to date each other because they are so damn moody. You are away from people constantly and having a relationship that is strictly by phone, it is miserable. Or if you say to him/her, \"Hey, (even though) I am doing a very sexy scene with this very sexy girl/boy, I love you and I'm going to be thinking of you when I am rolling around in bed with this person!\".", "We are supposed to be liberated in America but if our President had his way, we wouldn't be educated about sex at all. Every woman would have six children and we wouldn't be able to have abortions.", "Whose life would I like to step into for the day? The president's. I could probably get some things done in the Oval Office.", "Do I ever get nervous about this, right now, being the pinnacle of my career? Yeah, I do. At the end of (filming) every movie I think, \"Wow - this is the last one! Nice working with you.\".", "[on 'Woody Allen' (qv)] I just adore Woody. We have a lot in common. We're New Yorkers, Jewish. We have a very easygoing relationship.", "[on getting to entertain US troops in the Persian Gulf in 2008] This USO tour to the Gulf region truly means a lot. I've wanted to go over and visit for some time, and now my moment has arrived. It's one thing to reply to a letter or extend your thanks to service members in a speech, but it's another thing to visit them and spend time with those that do so much for us back home.", "[on comparisons with 'Marilyn Monroe' (qv)] I love Marilyn. I think she was incredibly beautiful and a very underrated actress. I am a curvy woman who is blonde, and perhaps we are both comfortable in our femininity, but I think that is as far as the comparison goes.", "My natural hair color is dirty blonde. I've been a bottle blonde before, very yellow - and a white blonde. My dad is Danish and he's a natural blonde. I've even taken a clipping from his hair to the salon so I can have it tinted the same color!", "[on 'Katy Perry' (qv)'s song, \"I Kissed a Girl\", which was inspired by 'Scarlett Johansson' (qv)] That's flattering, but my lips are kind of taken.", "[on her trip to Rwanda and initiative to help fight against AIDS in Africa] It was important for me to come here and see the issues we're up against firsthand. I came here with an open mind, wanting to listen, understand and learn; I leave with the overwhelming understanding that the small action of making a (RED) choice in your purchases... has an enormous impact on the lives of people in countries like Rwanda.", "I read a lot of things about myself that aren't true... I've read that I've been with people I've never met. It's not nice to have any attachment, but likewise, it's nice to have a boyfriend. I'm open to that. But it's hard, when you're working constantly, to spend enough time with someone.", "There was this rumor mill cranking out stories that I had lost 14 pounds - I could never lose 14 pounds. I can't look at somebody who is 6 feet tall and 120 pounds and say, I'm going to get that body. That's just never going to happen. You have to work with what you've got.", "[on her marriage to 'Ryan Reynolds' (qv)] I never really thought about getting married - it just kind of happened. It seemed natural, the right thing to do. It was kind of a celebration of the time... I'm kind of making my own little family now, which is funny. It's like a little bit of a tribe. You hope that a relationship makes you better, that you learn things about yourself.", "I would love to work on Broadway, but I don't know that it would manifest itself in musical theater... I have terrible stage fright that I'd have to get over. It came on when I was a teenager, and I think it somehow sticks with you. There are plenty of moments on stage where you think, \"If one of my boobs just fell out right now...\"", "I love to get ready for the red carpet, but being on it is very uncomfortable. It's so freakish and weird. I get flop sweats, dry mouth, heart palpitations, all-over panic!", "I try to stay fit and eat healthily, but I am not anxious to starve myself and become unnaturally thin. I don't find that look attractive on women and I don't want to become part of that trend. It's unhealthy and it puts too much pressure on women in general who are being fed this image of the ideal, which it is not. I think America has become obsessed with dieting rather than focusing on eating well, exercising and living a healthy life. I also think that being ultra-thin is not sexy at all. Women shouldn't be forced to conform to unrealistic and unhealthy body images that the media promote. I don't need to be skinny to be sexy.", "[on winning a Tony Award] Being welcomed into this community has been a dream come true for me. Ever since I was a little girl, I wanted to be on Broadway, and here I am.", "[on working on Broadway] It was strange to think that this show is going to go on whether it's good or bad. They will let the audience in at some point, and they will see it, and we are going to be exposed for better or for worse.", "[on how she spends her free time] I'm still trying to figure out what to do when I'm not making movies. I just don't do that many things.", "[on being the face of Moet & Chandon Champagne] I am honored to have been chosen as their ambassador and to make history with the brand, as the first celebrity face of champagne.", "[on her 2011 photo shoot for Mango clothing] Yes, it has been great working with Mango. I loved working with the whole team - I think between Mario, the makeup and hairdressing teams and the stylist, we have created something special.", "Sharing food is one of life's pleasures. On a global scale, we don't share fairly. Close to a billion people go to bed hungry every night. The fact is: the global food system is a broken one. All of us, from Kentucky to Kenya, deserve enough to eat. That's why I'm joining Oxfam's Grow campaign.", "I'm curvy - I'm never going to be 5' 11' and 120 pounds. But I feel lucky to have what I've got. I feel comfortable as a young woman - a young, modern, liberal person. I feel comfortable with my sexuality. However, I am protective of my private life. I don't think that if you are in the public eye, your life is public. I am an actor. But you can't take things too seriously.", "I don't feel mature. I always feel about the age I am. I know 'Robert Redford' (qv) described me as, '13 going on 30', but that's not how I felt at the time. I am still dorky. I watch cheesy television with TV dinners and, at one point, could not stop watching 'Jerry Springer' (qv).", "I started acting when I was seven. I had a couple of lines in this play called \"Sophistry\" with 'Ethan Hawke' (qv). I studied at the 'Lee Strasberg' (qv) Institute, and that really gave me an opportunity to perform before live audiences. There's absolutely a difference between that and working in film... like you can mess up in film and not worry about it.", "[on the alleged nude photos of her which were stolen by hackers] Just because you're in the spotlight, or just because you're an actor or making films or whatever, doesn't mean that you're not entitled to your own personal privacy. I think no matter what the context, if that is besieged in some way, it feels unjust. It feels wrong.", "[on her divorce in 2011] At first, I was quite depressed. After about a week or so, I pulled myself together and started to go to the gym all the time. Luckily, I've got a few very close girlfriends who have been by my side for 15 years now, whom I can talk to about everything and confide in. I have a close relationship with my twin brother Hunter as well. And then there's my grandmother Dorothy. She's an incredibly sweet, lovely and wise woman.", "I don't have a Facebook or a Twitter account, and I don't know how I feel about this idea of, \"Now, I'm eating dinner, and I want everyone to know that I'm having dinner at this time,\" or \"I just mailed a letter and dropped off my kids.\" That, to me, is a very strange phenomenon. I can't think of anything I'd rather do less than have to continuously share details of my everyday life. I guess they [celebrities] use it in a way that works for them. But I'd rather that people had less access to my personal life. If I could keep it that way, I'd be a happy lady.", "There's a lot of things that I want to pursue and hopefully, eventually will when all of this falls apart. I work with a lot of nongovernmental organizations. I don't know if I'd want to start my own, but I think I'd dedicate more of my time to that. It'd also be nice to have a vineyard somewhere, an organic farm or something like that. That's like a hippie-dippy wish - but a really good one.", "One of the most exciting thing about _The Avengers (2012)_ (qv), is that in my opening scene the first thing you see is my character getting punched in the face. Everybody's like \"Damn, it's nice to see a girl get the shit kicked out of her.\".", "Unfortunately, my generation had a shitty time. Horrible bubblegum pop boy bands and rap metal. It just wasn't my scene. There was some good hip hop, though, like 'Fugees' (qv).", "When I was 13, I loved 'Radiohead' (qv)'s The Bends and I loved 'Nine Inch Nails' (qv). When I graduated to a CD player, I'd listen to a lot of old 'Depeche Mode' (qv) and 'New Order' (qv), actually. I'd start rummaging through what my older brother had and discover all this weird progressive new wave music that he'd been listening to 10 years prior.", "The first time I had a really private experience with an album was when I was 10 and somebody gave me an Abbey Road cassette tape as a Christmas stocking stuffer. I knew that goddamn tape backwards and forwards. I had one of those Walkmans that you didn't have to flip over. It had auto reverse and would just play over and over.", "I wanted to be 'Frank Sinatra' (qv) and sing like him. He's got a voice like gold bullion. His voice is like velvet cake. I loved all the Vegas stuff, but I liked the polka dot and moonbeams stuff best. Early Frank, when he was just \"Frankie\", a whisper of what he would someday be. I was a ham as a kid. I loved musical theater, so from a young age, I admired how show-stopping Sinatra was.", "My parents' music became my music.", "One of my favorite Waits ('Tom Waits' (qv)) songs is \"Burma Shave\". We tried to do that... and couldn't. I asked myself, \"What is the essence of this song?\" and I realized that I couldn't do it because it's Tom. Tom is the essence.", "A song like \"Who You Are\" is such a personal thing for 'Tom Waits' (qv). I can't even pretend to imagine what it was born out of. I would never try to interpret somebody else's emotion. I can only read the lyrics and associate them with my own life experience. I had to sing them from my own gut. The same way you would take somebody's written dialogue and breathe your own life into it. I have the perspective that I have and I can only work through that.", "I grew up in a household that was very politically conscious... it was just understood that it was important, that it was our responsibility.", "My brother was totally geeked-out by 'Katie Couric' (qv). I think he followed her around the entire night. I was chasing after him, and I turned around, and I had a bunch of Republican senators chasing after me.", "I think I understand my emotional state and my complexities now in a much clearer way, and I can put them to rest in a way that there's almost a catharsis that happens through the work, where I can do it and then find myself again.", "[on being thought of as a sex symbol] Are you asking me if I feel objectified? I think that, sure, I've been a 'victim' of that, if you want to call it that, but only as much as anyone else. I don't feel particularly singled out more than any other person. All you have to do is go to a nightclub to see that happening every day. A man is not always trying to undress a woman's brain first.", "[on varying the roles she accepts] It would be such a waste to just continue to do the same thing and not take a risk. I don't have anything to lose, really. Even if it doesn't work out, the gain if it does is so much greater. Taking those risks is something I feel more and more comfortable with.", "I just didn't think that I would be able to stay in that kind of twisted frenzy that a lot of actors feel they need in order to work.", "I was always terrible at commercials because my voice was so deep. At the age of 9, I sounded like a whiskey-drinking, chain-smoking fool.", "With _Her (2013)_ (qv), it was about finding the shape of things and building this character that's almost a babe - but just fresh out of the package in every way.", "'Jonathan Glazer' (qv) is such a sensitive, engaged, funny person. But then you see the film and you're like \"Jesus, is that what's in his mind all the time?\".", "I associate [ScarJo] with, like, pop stars. It sounds tacky. It's lazy and flippant... And there's something kind of violent about it. There's something insulting about it.", "[on her role as Natasha Romanoff] Well you know, I don't think I have never really seen a film of this genre, where the female characters' sex appeal sort of came second. I mean of course they're sexy characters. When you have a sexy secretary, or a girl swinging around by her ankles in a catsuit, you know that's innately sexy, but the fact is that these characters are intelligent. They're ambitious. They're motivated and calculated to some degree.", "I wouldn't say I'm a particular sci-fi fan. I mean, I guess I like some sci-fi movies, but I think it's sort of a trend that reflects the time that we're living in, the question of identity, [...] as we kind of advance in this digital age and how it affects our own identity.", "[on backing out to portray Dante \"Tex\" Gill for the canceled Rub & Tug film] While I would have loved the opportunity to bring Dante's story and transition to life, I understand why many feel he should be portrayed by a transgender person, and I am thankful that this casting debate, albeit controversial, has sparked a larger conversation about diversity and representation in film. I have great admiration and love for the trans community and am grateful that the conversation regarding inclusivity in Hollywood continues."], "salary history": ["_Iron Man 2 (2010)_ (qv)::$400,000", "_The Avengers (2012)_ (qv)::$6,000,000", "_Avengers: Age of Ultron (2015)_ (qv)::$20,000,000", "_Ghost in the Shell (2017)_ (qv)::$10,000,000", "_Avengers: Endgame (2019)_ (qv)::$35,000,000 back-end payment", "_Black Widow (2020)_ (qv)::$20,000,000 +back end"], "birth date": "1984-11-22", "birth notes": "New York City, New York, USA", "_actorID": "3", "_source": "IMDB", "actorID": "0424060", "created_utc_dt": "09/14/2019, 13:01:13"}