{"headshot": "https://m.media-amazon.com/images/M/MV5BNzg1MTUyNDYxOF5BMl5BanBnXkFtZTgwNTQ4MTE2MjE@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Bob", "RDJ"], "birth name": "Robert John Downey Jr", "height": "5' 8½\" (1.74 m)", "mini biography": ["'Robert Downey Jr.' (qv) has evolved into one of the most respected actors in Hollywood. With an amazing list of credits to his name, he has managed to stay new and fresh even after over four decades in the business.Downey was born April 4, 1965 in Manhattan, New York, the son of writer, director and filmographer 'Robert Downey Sr.' (qv) and actress 'Elsie Downey' (qv) (née Elsie Ann Ford). Robert's father is of half Lithuanian Jewish, one quarter Hungarian Jewish, and one quarter Irish, descent, while Robert's mother was of English, Scottish, German, and Swiss-German ancestry. Robert and his sister, 'Allyson Downey' (qv), were immersed in film and the performing arts from a very young age, leading Downey Jr. to study at the Stagedoor Manor Performing Arts Training Center in upstate New York, before moving to California with his father following his parents' 1978 divorce. In 1982, he dropped out of Santa Monica High School to pursue acting full time. Downey Sr., himself a drug addict, exposed his son to drugs at a very early age, and Downey Jr. would go on to struggle with abuse for decades.Downey Jr. made his debut as an actor at the age of five in the film _Pound (1970)_ (qv), written and directed by his father, 'Robert Downey Sr.' (qv). He built his film repertoire throughout the 1980s and 1990s with roles in _Tuff Turf (1985)_ (qv), _Weird Science (1985)_ (qv), _True Believer (1989)_ (qv), and _Wonder Boys (2000)_ (qv) among many others. In 1992, Downey received an Academy Award nomination and won the BAFTA (British Academy Award) for Best Actor for his performance in the title role of _Chaplin (1992)_ (qv).In 'Robert Altman' (qv)'s _Short Cuts (1993)_ (qv), he appeared as an aspiring film make-up artist whose best friend commits murder. In 'Oliver Stone' (qv)'s _Natural Born Killers (1994)_ (qv), with 'Woody Harrelson' (qv) and 'Juliette Lewis' (qv), Downey starred as a tabloid TV journalist who exploits a murderous couple's killing spree to boost his ratings. For the comedy _Heart and Souls (1993)_ (qv), Downey starred as a young man with a special relationship with four ghosts. In 1995, Downey starred in _Restoration (1995)_ (qv), with 'Hugh Grant' (qv), 'Meg Ryan' (qv) and 'Ian McKellen' (qv), directed by 'Michael Hoffman' (qv). Also that year, he starred in _Richard III (1995)_ (qv), in which he appears opposite his _Restoration (1995)_ (qv) co-star McKellen.In 1997, Downey was seen in 'Robert Altman' (qv)'s _The Gingerbread Man (1998)_ (qv), alongside 'Kenneth Branagh' (qv), 'Daryl Hannah' (qv) and 'Embeth Davidtz' (qv); in _One Night Stand (1997)_ (qv), directed by 'Mike Figgis' (qv) and starring 'Wesley Snipes' (qv) and 'Nastassja Kinski' (qv); and in _Hugo Pool (1997)_ (qv), directed by his father, 'Robert Downey Sr.' (qv) and starring 'Sean Penn' (qv) and 'Patrick Dempsey' (qv). In September of 1999, Downey appeared in _Black & White (1999)_ (qv), written and directed by 'James Toback' (qv), along with 'Ben Stiller' (qv), 'Elijah Wood' (qv), 'Gaby Hoffmann' (qv), 'Brooke Shields' (qv) and 'Claudia Schiffer' (qv). In January of 1999, he starred with 'Annette Bening' (qv) and 'Aidan Quinn' (qv) in _In Dreams (1999)_ (qv), directed by 'Neil Jordan' (qv).In 2000, Downey co-starred with 'Michael Douglas' (qv) and 'Tobey Maguire' (qv) in _Wonder Boys (2000)_ (qv), directed by 'Curtis Hanson' (qv). In this dramatic comedy, Downey played the role of a bisexual literary agent. In 2001, Downey made his prime-time television debut when he joined the cast of the Fox-TV series _Ally McBeal (1997)_ (qv) as attorney \"Larry Paul\". For this role, he won the Golden Globe Award for Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for Television, as well as the Screen Actors Guild Award for Outstanding Performance by a Male in a Comedy Series. In addition, Downey was nominated for an Emmy for Outstanding Supporting Actor in a Comedy Series.The actor's drug-related problems escalated from 1996 to 2001, leading to arrests, rehab visits and incarcerations, and he was eventually fired from _Ally McBeal (1997)_ (qv). Emerging clean and sober in 2003, Downey Jr. began to rebuild his career.He marked his debut into music with his debut album, titled \"The Futurist\", on the Sony Classics Label on November 23rd, 2004. The album's eight original songs, that Downey wrote, and his two musical numbers debuting as cover songs revealed his sultry singing voice and his musical talents. Downey displayed his versatility in two different films in October 2003: the musical/drama _The Singing Detective (2003)_ (qv), a remake of the BBC hit of the same name, and the thriller _Gothika (2003)_ (qv) starring 'Halle Berry' (qv) and 'Penélope Cruz' (qv). Downey starred in powerful yet humbling roles inspired by real-life accounts of some of history's most precious kept secrets, including 'Richard Linklater' (qv)'s _A Scanner Darkly (2006)_ (qv) in 2006 co-starring 'Keanu Reeves' (qv), 'Winona Ryder' (qv) and 'Woody Harrelson' (qv), and _Fur: An Imaginary Portrait of Diane Arbus (2006)_ (qv) co-starring 'Nicole Kidman' (qv), a film inspired by the life of Diane Arbus, the revered photographer whose images captured attention in the early 1960s. These roles exhibited Downey's momentum from the previous year of 2005, in which he starred in the Academy Award®-nominated feature film _Good Night, and Good Luck. (2005)_ (qv), directed by 'George Clooney' (qv) and in 'Shane Black' (qv)'s action comedy _Kiss Kiss Bang Bang (2005)_ (qv) co-starring 'Val Kilmer' (qv). In 2007, he co-starred in 'David Fincher' (qv)'s suspenseful _Zodiac (2007)_ (qv), alongside 'Jake Gyllenhaal' (qv) and 'Mark Ruffalo' (qv), about the notorious serial killer who haunted San Francisco during the 1970s.In May 2008, Downey achieved critical acclaim and worldwide box office success for his starring role in _Iron Man (2008)_ (qv), 'Jon Favreau' (qv)'s big-screen rendering of the Marvel comic book superhero. The film co-starred 'Gwyneth Paltrow' (qv), 'Jeff Bridges' (qv) and 'Terrence Howard' (qv). In August of 2008, Downey starred with 'Ben Stiller' (qv) and 'Jack Black' (qv) in the comedy _Tropic Thunder (2008)_ (qv), and went on to receive an Academy Award®-nomination for Best Supporting Actor for his, Kirk Lazarus.In December 2009, Downey starred in the action-adventure _Sherlock Holmes (2009)_ (qv). The film, directed by 'Guy Ritchie' (qv), co-starred 'Jude Law' (qv) and 'Rachel McAdams' (qv) and earned Downey a Golden Globe for Best Performance by an Actor in a Motion Picture - Comedy or Musical in January of 2010. In early Summer 2010, Downey re-teamed with director 'Jon Favreau' (qv) and reprised his role as \"Tony Stark/Iron Man\" in the hugely successful sequel to the original film, _Iron Man 2 (2010)_ (qv), starring 'Gwyneth Paltrow' (qv), 'Scarlett Johansson' (qv), 'Samuel L. Jackson' (qv) and 'Mickey Rourke' (qv).Downey next starred in _Due Date (2010)_ (qv), a comedy directed by 'Todd Phillips' (qv), in which he plays the role of an expectant father on a road trip racing to get back in time for the birth of his first child. _Due Date (2010)_ (qv), starring _The Hangover (2009)_ (qv)'s 'Zach Galifianakis' (qv), was released in November 2010.Downey was honored by Time Magazine's \"Time 100\" in 2008, an annual list of the 100 most influential people in the world. His laurels include two Academy Award nominations, three Golden Globe wins, numerous other award nominations and wins, and tremendous popular and commercial success, particularly in his roles as Sherlock Holmes and Tony Stark (the latter of which he has so far played in _Iron Man (2008)_ (qv), _Iron Man 2 (2010)_ (qv), _The Avengers (2012)_ (qv), _Iron Man 3 (2013)_ (qv), and _Avengers: Age of Ultron (2015)_ (qv). For three consecutive years, from 2012 to 2015, Downey has topped the Forbes list of Hollywood's highest-paid actors, making an estimated $80 million in earnings between June 2014 and June 2015.In 2005, Downey Jr. married 'Susan Downey' (qv), with whom he has two children. Downey also has another son, 'Indio Falconer Downey' (qv), born 1993, from his first marriage to 'Deborah Falconer' (qv), from whom he was officially divorced in 2004.Robert has jump-started the Team Downey Production Company with wife 'Susan Downey' (qv).::Anonymous, Rogers & Cowan, and Pedro Borges"], "spouse": ["'Susan Downey' (qv)::(27 August 2005 - present) ( 2 children)", "'Deborah Falconer' (qv)::(29 May 1992 - 26 April 2004) ( divorced) ( 1 child)"], "trade mark": ["Known for not being especially humble", "Sarcastic humorous deliveries while remaining completely stonefaced", "Distinctive drawling voice", "Frequently plays egotistical but likable scoundrels", "Frequently plays intelligent but eccentric characters"], "trivia": ["(August 2, 2000) Released from jail on $5,000 bail.", "(March 31, 1998) Released from jail to complete his six-month jail sentence at a drug rehabilitation center. Downey caused a stir when he was freed to work on a movie.", "(February 13, 1998) He got into fight with another inmate at the Los Angeles County Jail, where he was serving time for a probation violation, and was treated for a cut over his nose.", "Jailed for 180 days for violating probation. [December 1997]", "(October 17, 1997) Probation revoked after continued drug use.", "Remanded to a secure drug rehabilitation center. [August 1996]", "During traffic stop for speeding, he was arrested for drunk driving, possession of heroin, and possession of an unloaded pistol in his pickup truck. This was his first reported brush with the law at age 31. He was given a suspended prison sentence of three years, and granted probation with requirements of random drug testing and drug counselling. [August 1996]", "Names 'Peter O'Toole' (qv) as his favorite actor.", "Lived with 'Sarah Jessica Parker' (qv) for seven years during the 1980s.", "Son of 'Robert Downey Sr.' (qv).", "Son 'Indio Falconer Downey' (qv), with his first wife 'Deborah Falconer' (qv), was born on September 7, 1993.", "Attended Stagedoor Manor.", "(June 22, 1999) Sent to a rehab center at the Los Angeles County jail while waiting for an August 5 hearing.", "His father introduced him to drugs, offering him a marijuana joint when he was age 8.", "While drunk, he wandered into a neighbor's Malibu home that he thought was his own, and fell asleep in their child's bed. He was arrested for being under the influence of drugs, which was a third violation of his probation.", "He took daily drug tests during the filming of _Two Girls and a Guy (1997)_ (qv).", "Once worked as a piece of living art in a SoHo nightclub in New York City.", "(August 6, 1999) After Downey's three violations of probation for drug and alcohol abuse in a three-year span of time since he was spared a prison sentence and placed on probation, Malibu Judge Lawrence Mira stated that he was out of options. He was sentencing Downey to prison, he said, to save his life, because he would not take the responsibility of refraining from alcohol and drug use on his own. The Judge invoked the three years' sentence in state prison that had been suspended in 1996.Downey spent two weeks in a state prison reception center at Wasco, California, for orientation. On August 25, 1999, he was transferred to a Department of Corrections prison named \"SATF\" (Substance Abuse Treatment Facility) for drug dependent prisoners in Corcoran California. Scheduled release date: November 2, 2000. SATF is across the street from the other Corcoran Prison, where inmates were shot to death on the exercise yard during fights in the 1990s. Downey's lawyers have approached the Malibu judge several times in the last 11 months to request Downey's release, but the Judge has refused.", "Downey's lawyers petitioned the State Court of Appeals in Los Angeles, stating that Downey had already served enough time because the Malibu judge had made errors in calculating his sentence. He had not given credit for the several times Downey spent in lockdown rehab units and in pre-sentencing confinement. Downey's lawyers claimed that he should have been released in February 2000.", "(November 25, 2000) Downey re-arrested on drugs and weapons charges in Palm Springs, California, at the luxurious 'Merv Griffin' (qv) resort, after an anonymous tip to police. Downey was found alone, with cocaine and methamphetamines. He cooperated with police, spent the night in jail, and was released the next morning on $15,000.00 bail. Downey had been on a career upswing with his successful stint on _Ally McBeal (1997)_ (qv), and his upcoming stage performance as Hamlet, set for January 2001 in Los Angeles, to be directed by his friend 'Mel Gibson' (qv).", "(April 24, 2001) Arrested for being under the influence of a controlled substance in Los Angeles after he was found wandering in an alley. He was fired from the television series _Ally McBeal (1997)_ (qv) by producer 'David E. Kelley' (qv) after the arrest.", "(March 15, 2001) Downey's attorneys advised the judge that they could not reach a plea bargain in his November 2000 drug arrest.", "(May 24, 2001) Downey pleaded not guilty to the November 2000 drug charges. He is being held in a drug rehab center until his case is decided.", "(July 16, 2001) Downey pleaded no contest to drug charges. The judge sentenced him to remain in rehabilitation for one year and to three years' probation.", "His parents divorced when he was age 11.", "Kept a great deal of the authentic vintage clothing he wore in the movie _Chaplin (1992)_ (qv).", "In a symbolic attempt to bury his decadent 1980s Brat Pack image and begin a new phase of his life and career after filming _Chaplin (1992)_ (qv) in 1991, he (literally) buried the clothes that he wore in _Less Than Zero (1987)_ (qv) in the backyard of his house.", "As a result of his father's work ('Robert Downey Sr.' (qv) was (and is) an independent filmmaker), Downey the younger spent a great deal of his childhood on the move. He lived at various points in Connecticut, New York, California, London, Paris and Woodstock.", "At the age of 10, while living in London, Robert attended the Perry House School in Chelsea and studied classical ballet.", "Married his first wife after dating her for only 42 days.", "Dropped out of Santa Monica High School at age 17 and moved to New York to become an actor. First jobs in the city included bussing tables at Central Falls restaurant, working in a shoe store, and performing as \"living art\" at SohHo's notorious underground club Area.", "Downey enjoyed working with the director of the 'Elton John' (qv) music video - contemporary artist 'Sam Taylor-Johnson' (qv) - so much that he suggested that they work together again on an art piece. The result was an art video called \"Pietà\", made in the manner of Michelangelo's famous Pietà sculpture in Rome. It was included in 'Sam Taylor-Johnson' (qv)'s exhibition \"Mute\" at the White Cube 2 art gallery in London, November 23 to January 12, 2002.", "Starred in 'Elton John' (qv)'s music video for the song \"I Want Love\". Downey was let out of rehab for one day in late July specifically to shoot the video (which was filmed in one long continuous take at Greystone Manor in Beverly Hills). This was Downey's first work since being fired from the television series _Ally McBeal (1997)_ (qv) in April 2001.", "Starred briefly with his first wife 'Deborah Falconer' (qv) in the 'Robert Altman' (qv) movie _Short Cuts (1993)_ (qv).", "Childhood friends with Richard Hall, better known as 'Moby' (qv).", "He married his second wife, _Gothika (2003)_ (qv) producer 'Susan Downey' (qv), at Amagansett, New York on August 27, 2005.", "Was approached to play the role as Zaphod Beeblebrox in _The Hitchhiker's Guide to the Galaxy (2005)_ (qv).", "Is the first regular cast member of _Saturday Night Live (1975)_ (qv) to be nominated for an Academy Award in the category \"Best Actor in a Leading Role\". 'Joan Cusack' (qv) and 'Dan Aykroyd' (qv) were also nominated for Academy 'Awards' (qv) some years before Downey, but both were nominated for supporting roles.", "Was in attendance at 'Chris Penn' (qv)'s funeral at Holy Cross Cemetery in Culver City, California.", "Met wife 'Susan Downey' (qv) on the set of _Gothika (2003)_ (qv).", "He proposed to 'Susan Downey' (qv) on her 30th birthday.", "'Sting' (qv) (\"Every Breath You Take\") and 'Billy Idol' (qv) performed at his wedding to 'Susan Downey' (qv).", "Before he starred as _Iron Man (2008)_ (qv), Downey had done films with three of the actors who played Batman: with 'George Clooney' (qv) in _Good Night, and Good Luck. (2005)_ (qv); with 'Val Kilmer' (qv) in _Kiss Kiss Bang Bang (2005)_ (qv); and with 'Michael Keaton' (qv) in _Game 6 (2005)_ (qv).", "On the set of _A Guide to Recognizing Your Saints (2006)_ (qv) he took co-star 'Adam Scarimbolo' (qv) under his wing.", "Ranked #60 in Time magazine's 100 Most Influential People in the World (2008).", "Downey's paternal grandfather, Robert Elias, was of Lithuanian Jewish descent, while Downey's paternal grandmother, model Betty McLoughlin, was of half Irish and half Hungarian Jewish ancestry. Downey's mother's lineage was English, Scottish, German, and Swiss-German.", "Close friends with 'Anthony Michael Hall' (qv) and 'Ramon Estevez' (qv).", "Gave life to the same character (Tony Stark) in two movies in the same year (_Iron Man (2008)_ (qv) and _The Incredible Hulk (2008)_ (qv)) produced by the same studio (Marvel Studios).", "Has worn lifts at his directors' requests in his recent leading man roles, namely _Iron Man (2008)_ (qv) and its sequel and in _Sherlock Holmes (2009)_ (qv), in order to enhance his height.", "Signed on to voice \"The Devil\" on the animated series _God, the Devil and Bob (2000)_ (qv). Shortly thereafter, Downey was jailed, so he was replaced by 'Alan Cumming' (qv).", "In order to get over his drug addiction, he began studying Wing Chun in 2003 under Sifu Eric Oram, who served as a fight and martial arts consultant on 'Guy Ritchie' (qv)'s _Sherlock Holmes (2009)_ (qv).", "According to an interview he gave to 'News' (qv)week in February 2009, when Downey went to Japan for their opening of _Iron Man (2008)_ (qv), he was detained on entry because Japanese authorities ran his passport and found it linked to some incredible criminal activity (namely Downey's multiple arrests and incarcerations on drug-related charges in the 1990s and 2000s). For failing to disclose these convictions, Downey was interrogated for six hours and was almost barred from entry into Japan. It was finally decided that he could enter Japan for the Iron Man premiere but he is never to be allowed into Japan again.", "Godfather of his son 'Indio Falconer Downey' (qv) is close friend 'Anthony Michael Hall' (qv).", "Was roommates with 'Kiefer Sutherland' (qv) in the early 1980s.", "Attended Junior High School 104 in Manhattan with fellow actors 'Jon Cryer' (qv), 'Erica Gimpel' (qv) and 'Kadeem Hardison' (qv).", "Filmed his role in _Hail Caesar (1994)_ (qv) in one day.", "Lives in Venice and Malibu, California.", "Is the first, and thus far only, actor to win a Golden Globe for portraying Sherlock Holmes.", "Honoured at the 25th American Cinematheque Award on October 14, 2011 in Los Angeles.", "Mentioned in a November 2010 interview with Playboy magazine that he studies Kung Fu at the L.A. Wing Chun Kung Fu Academy in West Los Angeles three times a week for three hours a session.", "Starred in the film, _Chances Are (1989)_ (qv), and, years later, sang 'Bob Seger' (qv) and 'Martina McBride' (qv)'s song \"Chances Are\" while appearing on the television series _Ally McBeal (1997)_ (qv).", "Placed his hand and footprints in concrete in front of Grauman's Chinese Theater in 2010.", "Was a huge fan of the Iron Man comics as a child.", "Has stated on _Jimmy Kimmel Live! (2003)_ (qv) that he is not a method actor.", "Robert and wife 'Susan Downey' (qv) had their first child, Exton Elias Downey, on February 7, 2012. He weighing in at 7 lbs. 5 oz. and measuring 20 inches.", "Is good friends with _Due Date (2010)_ (qv) and _The Soloist (2009)_ (qv) co-star, 'Jamie Foxx' (qv).", "He was offered the lead role in _Oz the Great and Powerful (2013)_ (qv), but declined, as he was not interested.", "He travelled around the world promoting _Iron Man 3 (2013)_ (qv) with back-to-back visits to Seoul, South Korea; Beijing, China; Moscow, Russia; Berlin, Germany; Paris, France and London, England. [April 2013]", "He was considered for the role of Billy \"The Kid\" Hicks in _St. Elmo's Fire (1985)_ (qv), which went to 'Rob Lowe' (qv). Prophetically, the character has a substance abuse problems.", "He was originally set to star in _Cowboys & Aliens (2011)_ (qv), but had to drop out due to his commitment to _Sherlock Holmes: A Game of Shadows (2011)_ (qv). The role went to 'Daniel Craig' (qv).", "He was considered for the lead role in _Ferris Bueller's Day Off (1986)_ (qv), which went to 'Matthew Broderick' (qv).", "He was considered for 'Tom Cruise' (qv)'s roles in _Legend (1985)_ (qv) and _Top Gun (1986)_ (qv).", "He missed out on 'John Cusack' (qv)'s roles in _Say Anything... (1989)_ (qv) and _The Grifters (1990)_ (qv).", "Before he starred as _Iron Man (2008)_ (qv), he had done films with three of the actors who played Batman: 'George Clooney' (qv), 'Val Kilmer' (qv) and 'Michael Keaton' (qv). In _Iron Man 3 (2013)_ (qv), he worked with Clooney's cousin, 'Miguel Ferrer' (qv).", "Wife 'Susan Downey' (qv) gave birth to baby girl, Avri Roel Downey at 3:22 a.m. on November 4, 2014.", "Has worked with four \"Doctor Watsons\". In his own portrayal of Sherlock Holmes, he worked with 'Jude Law' (qv). In _Iron Man 3 (2013)_ (qv), he worked with 'Ben Kingsley' (qv). In _Captain America: Civil War (2016)_ (qv), he worked with 'Martin Freeman' (qv). In _The Judge (2014)_ (qv), he worked with 'Robert Duvall' (qv).", "During the promotion of _Avengers: Age of Ultron (2015)_ (qv), famously walked out of an interview with 'Krishnan Guru-Murthy' (qv) when pressed about his \"dark\" past because he felt it was inappropriate that children would be watching. He told 'Howard Stern' (qv) he would leave again if that ever happened in the future.", "He was considered for the role of Batman/Bruce Wayne in _Batman (1989)_ (qv), which went to 'Michael Keaton' (qv). He would, of course, play a different superhero.", "He was almost cast as Duckie in _Pretty in Pink (1986)_ (qv), when the ending had Andie getting together with Duckie. Per 'Molly Ringwald' (qv), this ending may have stuck if Downey won the role, because he didn't give her the \"brother vibe\" 'Jon Cryer' (qv) did.", "He was considered for the title role in _Edward Scissorhands (1990)_ (qv), which went to 'Johnny Depp' (qv).", "Good friends with: 'Mel Gibson' (qv), 'James Spader' (qv), 'Mark Ruffalo' (qv), 'Gwyneth Paltrow' (qv), 'Ben Stiller' (qv), 'Scarlett Johansson' (qv), 'Rob Lowe' (qv) and 'Johnny Depp' (qv).", "Good friends with Marvel Cinematic Universe cast: 'Scarlett Johansson' (qv), 'Elizabeth Olsen' (qv), 'Jeremy Renner' (qv), 'Chris Evans' (qv), 'Jon Favreau' (qv), 'Paul Bettany' (qv), 'Don Cheadle' (qv) and 'Cobie Smulders' (qv).", "As a five-year-old Robert uttered his very first words of dialog on film in his father 'Robert Downey Sr.' (qv)'s _Pound (1970)_ (qv): \"Have any hair on your balls?\".", "Maintained a professional work ethic when he was a drug addict.", "In _The Nice Guys (2016)_ (qv) played cameo of corpse, Sid Shattuck.", "He is a cousin of crooner 'Harry Connick Jr.' (qv), news woman 'Barbara Walters' (qv) and stunt pro Garner Ted Aukerman.", "He came dead last in Rolling Stone's ranking of all 141 castmembers of _Saturday Night Live (1975)_ (qv).", "Is an avid collector of exotic watches including such brands as, Breitling, Omega, Jaeger-LeCoultre, Rolex, Patek Philippe, Baume & Mercier (his grandfather's) etc.", "He was approached for the role of Megamind in _Megamind (2010)_ (qv), but turned it down due to scheduling conflicts. So the role was given to 'Will Ferrell' (qv).", "Has played the role of Tony Stark/Iron Man a total of ten times: _Iron Man (2008)_ (qv), _The Incredible Hulk (2008)_ (qv) in a cameo, _Iron Man 2 (2010)_ (qv), _The Avengers (2012)_ (qv), _Iron Man 3 (2013)_ (qv), _Avengers: Age of Ultron (2015)_ (qv), _Captain America: Civil War (2016)_ (qv), _Spider-Man: Homecoming (2017)_ (qv) in a small role, Avengers: Infinity War (2018) and Avengers: Endgame (2019). Six of those ten films grossed over $1 billion at the worldwide box office."], "quotes": ["I've always felt like such an outsider in this industry. Because I'm so insane, I guess.", "The higher the stakes, the happier I am, the better I will be.", "I'm not used to feeling like I belong where I am.", "A lot of my peer group think I'm an eccentric bisexual, like I may even have an ammonia-filled tentacle or something somewhere on my body. That's okay.", "I've become a picky little bitch. I've never bothered to plan projects before. I just used to throw the script across the room and say, \"Why do they keep sending me this horseshit?\" And then I'd start rehearsals two weeks later.", "[on his addiction to drugs] It's like I have a loaded gun in my mouth, and I like the taste of metal.", "It's a blanket statement to say, \"That guy's really sharp and amicable and nice,\" because there's a little bit of asshole in every nice guy, and there's a little bit of genius in every moron.", "[on his music] I am putting together some ideas for two or three more things I want to do. Maybe a CD of just my kind of standards, which would be 'Supertramp' (qv) and 'Steely Dan' (qv) covers with an orchestra. I'm deep into old 'Genesis' (qv). I'm sorry, but these are songs that mean something to me. \"Follow You Follow Me\" is a song that's about something to me.", "I know very little about acting. I'm just an incredibly gifted faker.", "It was so nice to go into this fake courtroom [on _Ally McBeal (1997)_ (qv)]. I immediately went up into the judge's chair. Nice view. A preferable perspective.", "What I usually hate about these movies when suddenly the guy that you were digging turns into Dudley Do-Right, and then you're supposed to buy into all his \"Let's go do some good! That Eliot Ness-in-a-cape-type thing. What was really important to me was to not have him change so much that he's unrecognizable. When someone used to be a schmuck and they're not anymore, hopefully they still have a sense of humor. [on superhero movies]", "[on _Black & White (1999)_ (qv)] A stage slap from 'Mike Tyson' (qv) is like a shovel whack from a normally fortified male.", "The great thing about _Saturday Night Live (1975)_ (qv) was being at 30 Rockefeller Center. And having Belushi and Aykroyd's old office. And me and Michael ['Anthony Michael Hall' (qv)] saying, \"We want bunk beds. With NFL Sheets. And we want them now.\" And Michael was like \"Man, it's gonna be great, we're gonna be buddies, we're gonna do a show together, we're gonna ...\" Then, \"I'm gonna do _Out of Bounds (1986)_ (qv)\" and he left. As for me, I was doing _Back to School (1986)_ (qv) and Saturday Night Live at the same time. So I'd fly back to Los Angeles for a couple of days during the week to shoot the movie and then fly back and, \"Live from New York, it's a tired young man!\"", "I had four weeks' work in _Baby It's You (1983)_ (qv), and I told all my friends I was now, officially, a major talent and film star. And then they cut my scenes out. You don't even see me except in one scene - you see me in the background until this self-indulgent actress leans forward to try and get more camera time. They cut all my scenes out and my friends go, \"Hey, Robert - maybe it's you!\" Now I don't tell people that I'm in a film until I see it on videocassette.", "Tofu is the root of all evil, and there's only one thing that can change a man's mind, and that's a modified Uzi with an extra-long clip.", "I did _Air America (1990)_ (qv) for two reasons: to be in a movie with 'Mel Gibson' (qv) and to make a bunch of money. And then underneath there was the hope that in doing this formulaic thing I would be launched into a whole new realm of opportunity to do A-list movies. By the time we were done, the only positive thing was meeting 'Mel Gibson' (qv).", "[on why he did _Danger Zone (1996)_ (qv)] Five hundred grand for two weeks.", "[on _Restoration (1995)_ (qv)] I just thought ['Hugh Grant' (qv)] was a dick, that's all. And I still do. You know, and that could be something that has to do with me, or it could just be that not everyone in this industry is someone I'd care to hang out with.", "[on _Weird Science (1985)_ (qv)] I defecated in ['Renee Props' (qv)'s] trailer, much to the chagrin of 'Bill Paxton' (qv) and 'Robert Rusler' (qv). It was a real bad scene. 'Joel Silver' (qv) freaked. I never admitted it. Joel said, \"Downey, did you do it?\" and I said I wish I had. Because I'd been threatening everyone that if they didn't treat me right, I was going to take a dump in their trailer, or that I'd go take a shit in Joel's office, on his desk or something.", "[on his childhood] I didn't want to talk about what my dad did because it wasn't like he was directing _All in the Family (1971)_ (qv) or anything. He was doing these crazy films. Mom would pick me up at school wearing this big quilted cape. I felt like I was in a 'J.D. Salinger' (qv) story. Dad's Jewish and Irish, Mom's German and Scotch. I couldn't say I was anything. My last name isn't even Downey. My dad changed his name when he wanted to get into the Army and was underage. My real name is Robert Elias. I feel like I'm still looking for a home in some way.", "[on 'Sean Penn' (qv)] In a relatively short time he was a better friend than some people I'd known for ages. I remember him saying three or four years ago, \"You have two reputations. I think you know what both of them are, and I think you'd do well to get rid of one of those reputations. If you don't, it will get rid of the other one.\" And I was like, \"Two reputations, I'll be right back.\" Just hearing him say that reminded me that I should go score. After that, he was like, forget it. It sucks, too, because someone as honorable as he is, I really should have responded. Jesus, I grew up idolizing this guy. Not only does he consider me a friend, but he's taking time. He's got a family. He's got a career that's going well. He's living his dreams and making time for me, and I'm like, \"I can't, I just can't - sorry, busy.\"", "As soon as I started smoking heroin instead of smoking coke, everything was different, and I knew it was. And it happened around the time I was doing _Home for the Holidays (1995)_ (qv). Home for the Holidays is, for me, one of the most relaxed performances in the history of cinema. I can't attribute that to the fact that I was at a serene place in my life, or that there was a real warm feeling on the set. This is a problem for me because I glamorize this stuff. I can't say that it wasn't real dark, real evil and real hurtful to those around me. And yet, practically every take of that film was a print. God bless 'Jodie Foster' (qv). When does she have time to do a handwritten letter telling someone how she genuinely cares about them? She said, \"Listen, I'm not worried about you on this film. You're not losing it or nodding out, and you're giving a great performance. I'm worried about your thinking you can get away with doing this on another film.\"", "[on _Chaplin (1992)_ (qv)] When I accepted the part, they didn't tell me that I also had to do the acrobatic stuff of Charlie. That has cost me a lot of blood, sweat and tears. Though I now can say, 'I did all my stunts myself.' Working on Chaplin was really intensive and cost me years of my life, but if I could do it all over again, no doubt I would do it the same way.", "[on _Chaplin (1992)_ (qv)] Chaplin was the culmination of an opportunity, and the biggest humiliation I've ever experienced. It was like winning the lottery, then going to prison. I realized that nothing that had worked for me before was going to work here. I'd watch one of Charlie's films, but by the end of it I was wildly depressed, because I realized that what he'd done in this twenty-minute short was more expressive and funnier than everything I've thought about doing my whole life.", "[on _U.S. Marshals (1998)_ (qv)] Possibly the worst action movie of all time, and that's just not good for the maintenance of a good spiritual condition. You've had a traumatic year, you've been practically suicidal - what do you think would be really healing for you? How about like twelve weeks of running around as Johnny Handgun? I think that if you talk to a spirit guide, they would say, \"That'll kill you.\"", "[on _U.S. Marshals (1998)_ (qv)] I thought maybe there was something I was missing, and what I really needed to do was to be in one of those films that I love taking my kid to. It would end up being really depressing. I'd rather wake up in jail for a TB test than have to wake up another morning knowing I'm going to the set of U.S. Marshals.", "I don't want to go all 'Michael Jackson' (qv) on you, but I never really had a childhood.", "I have a sense of destiny that you are led to the things you are supposed to do.", "[on 'Mickey Rourke' (qv)] He's so good. And he's formidable and he's very much reminding me of that kind of charming, confident guy that we know.", "[on _Iron Man 2 (2010)_ (qv)] I've never been in a sequel and it's very daunting because I feel the expectation of the millions of people who watched it and enjoyed it and told me that it was a little different than your usual genre picture and that they expected us to not screw it up. So I actually have taken _Iron Man 2 (2010)_ (qv) probably more seriously than any movie I've ever done, which is appropriately ridiculous for Hollywood.", "'Mel Gibson' (qv) cast me in _The Singing Detective (2003)_ (qv), even though an insurance company wouldn't cover it because it was my first film after my release from behind bars. The best part was when Mel gave me a motorcycle while we still had two weeks left to shoot. I go,\"'Are you trying to ruin this movie? What if I have an accident?\" He goes, \"No, no. I figure if you made it two-thirds of the way through, you can't do anything wrong.\"", "What do you say, though -- if you want to make God laugh, tell him your plan.", "[his Golden Globe acceptance speech for Best Actor-Comedy or Musical] If you start playing violins, I will tear this joint apart. First of all, I want to thank my wife 'Susan Downey' (qv) for telling me 'Matt Damon' (qv) was going to win so don't bother to prepare a speech. That was at about 10 a.m. I don't have anybody to thank. I'm sorry. Everyone's been so gratuitous, it was a collaboration, we all did this together. Certainly not going to thank Warner Brothers, 'Alan Horn' (qv), and my god, robbing off these guys. They needed me. _Avatar (2009)_ (qv) was going to take us to the cleaners. If they didn't have me, we didn't have a shot buddy. What am I going to do? I'm not going to be able to thank 'Joel Silver' (qv). I mean the guy has only restarted my career twelve times since I began twenty-five years ago. I really don't want to thank my wife because I could be busing tables at the daily groom right now if not for her. Jesus, what a gig that would be. 'Guy Ritchie' (qv) had a great vision for this film and a lot of great people came together and we worked our asses off. It's just a privilege. The Hollywood Foreign Press has a quote by Sir 'Arthur Conan Doyle' (qv), who was a genius by the way, and he said \"Art is the blood, Is libel to take to the strongest forms.\" That is also why I would like to thank, or not thank, the Hollywood Foreign Press because they are a strange bunch of people and now I'm one of them. Thank you.", "[on his role as an Australian actor playing a black man in _Tropic Thunder (2008)_ (qv)] I thought it was a completely incendiary idea and I blame it all on 'Ben Stiller' (qv) and DreamWorks.", "[on why some of his political opinions now lean more conservative then they used to] I have a really interesting political point of view, and it's not always something I say too loud at dinner tables here, but you can't go from a $2,000-a-night suite at La Mirage to a penitentiary and really understand it and come out a liberal. You can't. I wouldn't wish that experience on anyone else, but it was very, very, very educational for me and has informed my proclivities and politics every since. [\"The New York Times\", 2008]", "[on producer 'Joel Silver' (qv)] Joel just kept telling me. We've got to get your gun in your hand. Joel is one of the few relationships I care to have with a producer. Look he's vast and voracious, and he definitely has the ability to break into a scream about a point he would like to make. But he can also be incredibly warm and generous.", "[on winning an Oscar] As long as I stick around I'm going to end up with a bunch of them anyway as they're going to run out of people to give them to. And I'm probably going to win it one year when someone else deserves to win it. Why? Because it's my time, goddammit. And that's the way shit works around here. I'm just an uptight mutt at the top of his game. Welcome to Hollywood, bitch! I'll see you at the Vanity Fair party and I'll be holding that golden statue you deserve 'cause guess what? It happened to me too!", "[on 'Mel Gibson' (qv)] He's a stand-up guy - he's always has been for me - and certainly when I was not hire-able, he put his ass on the line and said, \"I'll take that chance.\" He will always have my friendship, and that's just talking about business and Hollywood stuff, which to me is nowhere as important as friendship.", "[2010, on his past problems] Sometimes it's necessary to compartmentalize the different stages of your evolution, both personally and objectively, for the people you have to love and tolerate. And one of those people, for me, is me. I have a very strong sense of that messed-up kid, that devoted theater actor, that ne'er-do-well 20-something nihilistic androgyne and that late-20s married guy with a little kid, lost, lost in narcotics-all as aspects of things I don't regret and am happy to keep a door open on. More than anything I have this sense that I'm a veteran of a war that is difficult to discuss with people who haven't been there. I feel for the kind of zeitgeist diagnoses that are being applied to certain of my peers lately, and I think it's unconscionable.", "[2010, on landing _Iron Man (2008)_ (qv)] I prepared for the screen test so feverishly that I literally made it impossible for anybody to do a better job. I had never worked on something that way before; I was so familiar with six or nine pages of dialogue, I had thought of every possible scenario. At a certain point during the screen test, I was so overwhelmed with anxiety about the opportunity that I almost passed out. I watched it later, and that moment came, fluttered and wasn't even noticeable. But to me, it was this stretched-out moment of what keeps people from doing theater for 30 years - just an unadulterated fear of failure.", "[2010] Discipline for me is about respect. It's not even about self-respect; it's about respect for life and all it offers. And not indulging. I have happily reconsidered my position on a bunch of things I didn't want on my \"no\" list despite all evidence that I couldn't handle them. At the end of the day, anything I think I'm sacrificing I'm just giving up because it makes me feel better.", "[2010] I've noticed that worrying is like praying for what you don't want to happen. I don't worry, but I observe where my mind tends to go. I have such an overwhelming sense that if you're in the right state of heart, which I have been for a little while, the next right thing appears to you.", "[2010] I find myself fascinated with shows like _Bad Girls (1999)_ (qv) and _Jerseylicious (2010)_ (qv), and also _Inside American Jail (2007)_ (qv) and _Lockup (2005)_ (qv). The best one's in the U.K.; I watch it when I'm over there doing Sherlock. It's called _Locked Up Abroad (2007)_ (qv), which means \"locked up\". \"Locked Up Abroad\" is always fun.", "[on never winning an Oscar] I know it's going to happen. That's just a fact... because it just doesn't make sense. That's why I don't mind showing up and watching everybody else get them... Look, even if I don't get one directly, eventually they're just going to have to give me one when I get old. So no matter how you slice it, I'm getting one... I should probably have more, but zero's fine.", "[on the Oscars ceremony] It is amazing to see how people are literally hyperventilating when they get up there, because they have such an attachment to this outcome.", "Nobody has cornered Halloween as a market since _Halloween (1978)_ (qv).", "It's hard for me to watch _Kiss Kiss Bang Bang (2005)_ (qv) and not get nostalgic about it. It's not perfect but in some ways, I think it's the best thing I've ever done. I don't know why.", "My intent is to dominate the playing field for as long as I can, with my own challenges, with myself.", "I don't drink these days. I am allergic to alcohol and narcotics. I break out in handcuffs.", "[his acceptance speech for the American Cinematheque Award]  I asked Mel (Gibson) to present this award for me for a reason. When I couldn\u0092t get sober, he told me not to give up hope and encouraged me to find my faith. It didn\u0092t have to be his or anyone else\u0092s as long as it was rooted in forgiveness. And I couldn\u0092t get hired, so he cast me in the lead of a movie that was actually developed for him. He kept a roof over my head and food on the table and most importantly he said if I accepted responsibility for my wrongdoing and embraced that part of my soul that was ugly \u0096 hugging the cactus he calls it \u0096 he said that if I hugged the cactus long enough, I\u0092d become a man. I did and it worked. All he asked in return was that someday I help the next guy in some small way. It\u0092s reasonable to assume at the time he didn\u0092t imagine the next guy would be him or that someday was tonight. So anyway on this special occasion and in light of the recent holidays including Columbus Day, I would ask that you join me, unless you are completely without sin in which case you picked the wrong fucking industry, in forgiving my friend his trespasses and offering him the same clean slate you have me, allowing him to continue his great and ongoing contribution to our collective art without shame. He\u0092s hugged the cactus long enough.", "[his experience working on _One Night Stand (1997)_ (qv)] I'm really struggling with something right now and it was kind of cathartic to play that part in the film because it was someone who's own proclivities and own sexual promiscuity and own desire to \"eat life live fast\" was the reason he wasn't going to be there for his friend when he might have enjoyed him most", "It's all about not getting your own way and that's what we try to instill in each other in ourselves with how do you become less encumber so you be in service to this fantastic medium that we get a chance in doing there's people throughout time who have been notorious and I get to be one of them to say it got in the way would be to say what I was \"expressing\" didn't have the validity for the suffering I chose to put myself through if it's all for nothing then it's a tragedy then if you put it down and move on its a way to demonstrate that when something occurs there's really nothing that anybody can do but survive as long as they survive"], "salary history": ["_Richard III (1995)_ (qv)::$50,000", "_Danger Zone (1996)_ (qv)::$500,000", "_Game 6 (2005)_ (qv)::$100 /day", "_Iron Man (2008)_ (qv)::$500,000", "_Sherlock Holmes (2009)_ (qv)::$9,000,000", "_Iron Man 2 (2010)_ (qv)::$10,000,000", "_Due Date (2010)_ (qv)::$12,000,000", "_Sherlock Holmes: A Game of Shadows (2011)_ (qv)::$15,000,000", "_The Avengers (2012)_ (qv)::$50,000,000 (once box-office bonuses and backend compensation are factored in)", "_Iron Man Three (2013)_ (qv)::$50,000,000", "_Spider-Man: Homecoming (2017)_ (qv)::$10,000,000"], "birth date": "1965-04-04", "birth notes": "Manhattan, New York City, New York, USA", "_actorID": "1", "_source": "IMDB", "actorID": "0000375", "created_utc_dt": "09/14/2019, 13:01:12"}