{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQ3NzMzOTQ3MF5BMl5BanBnXkFtZTcwOTE0MzY1Mw@@._V1_UY98_CR3,0,67,98_AL_.jpg", "birth name": "Michael Kirk Douglas", "height": "5' 9\" (1.75 m)", "mini biography": ["An actor with over forty years of experience in theatre, film, and television, 'Michael Douglas' (qv) branched out into independent feature production in 1975 with the Academy Award-winning _One Flew Over the Cuckoo's Nest (1975)_ (qv). Since then, as a producer and as an actor-producer, he has shown an uncanny knack for choosing projects that reflect changing trends and public concerns. Over the years, he has been involved in such controversial and politically influential motion pictures as _One Flew Over the Cuckoo's Nest (1975)_ (qv), _The China Syndrome (1979)_ (qv) and _Traffic (2000)_ (qv), and such popular films as _Fatal Attraction (1987)_ (qv) and _Romancing the Stone (1984)_ (qv).'Michael Douglas' (qv) was born in New Brunswick, New Jersey, to actors 'Diana Douglas' (qv) (Diana Love Dill) and 'Kirk Douglas' (qv) (born Issur Danielovitch). His paternal grandparents were Belarusian Jewish immigrants, while his mother was born in Bermuda, the daughter of a local Attorney General, Lieutenant Colonel Thomas Melville Dill; Diana's family had long been established in both Bermuda and the United States. Douglas's parents divorced when he was six, and he went to live with his mother and her new husband. Only seeing Kirk on holidays, Michael attended Eaglebrook school in Deerfield, Massachusetts, where he was about a year younger than all of his classmates.Douglas attended the elite preparatory Choate School and spent his summers with his father on movie sets. Although accepted at Yale, Douglas attended the University of California, Santa Barbara. Deciding he wanted to be an actor in his teenage years, Michael often asked his father about getting a \"foot in the door\". Kirk was strongly opposed to Michael pursuing an acting career, saying that it was an industry with many downs and few ups, and that he wanted all four of his sons to stay out of it. Michael, however, was persistent, and made his film debut in his father's film _Cast a Giant Shadow (1966)_ (qv).After receiving his B.A. degree in 1968, Douglas moved to New York City to continue his dramatic training, studying at the American Place Theatre with 'Wynn Handman' (qv), and at the Neighborhood Playhouse, where he appeared in workshop productions of Pirandello's Six Characters in Search of an Author (1976) and 'Thornton Wilder' (qv)'s Happy Journey (1963). A few months after he arrived in New York, Douglas got his first big break, when he was cast in the pivotal role of the free-spirited scientist who compromises his liberal views to accept a lucrative job with a high-tech chemical corporation in the CBS Playhouse production of 'Ellen M. Violett' (qv)'s drama, The Experiment, which was televised nationwide on February 25, 1969.Douglas' convincing portrayal won him the leading role in the adaptation of John Weston's controversial novel, _Hail, Hero! (1969)_ (qv), which was the initial project of CBS's newly organized theatrical film production company, Cinema Center Films. Douglas starred as a well-meaning, almost saintly young pacifist determined not only to justify his beliefs to his conservative parents but also to test them under fire in the jungles of Indochina. His second feature, _Adam at Six A.M. (1970)_ (qv) concerned a young man's search for his roots. Douglas next appeared in the film version of 'Ron Cowen' (qv)'s play _Summertree (1971)_ (qv), produced by ''Kirk Douglas' (qv)'' Bryna Company, and then _Napoleon and Samantha (1972)_ (qv), a sentimental children's melodrama from the Walt Disney studio.In between film assignments, he worked in summer stock and off-Broadway productions, among them \"City Scenes\", 'Frank Gagliano' (qv)'s surrealistic vignettes of contemporary life in New York, 'John Patrick Shanley' (qv)'s short-lived romance \"Love is a Time of Day\" and 'George Tabori' (qv)'s \"Pinkville\", in which he played a young innocent brutalized by his military training. He also appeared in the made-for-television thriller, \"When Michael Calls\", broadcast by ABC-TV on February 5, 1972 and in episodes of the popular series \"Medical Center\" and \"The FBI\".Impressed by Douglas' performance in a segment of The F.B.I. (1965), producer 'Quinn Martin' signed the actor for the part of 'Karl Malden' (qv)'s sidekick in the police series \"The Streets of San Francisco\", which premiered September of 1972 and became one of ABC's highest-rated prime-time programs in the mid-1970s. Douglas earned three successive Emmy Award nominations for his performance and he directed two episodes of the series.During the annual breaks in the shooting schedule for The Streets of _San Francisco (1972)_, Douglas devoted most of his time to his film production company, Big Stick Productions, Ltd., which produced several short subjects in the early 1970s. Long interested in producing a film version of 'Ken Kesey' (qv)'s grimly humorous novel _One Flew Over the Cuckoo's Nest (1975)_ (qv), Douglas purchased the movie rights from his father and began looking for financial backing. After a number of major motion picture studios turned him down, Douglas formed a partnership with 'Saul Zaentz' (qv), a record industry executive, and the two set about recruiting the cast and crew. Douglas still had a year to go on his contract for \"The Streets of San Francisco\", but the producers agreed to write his character out of the story so that he could concentrate on filming \"Cuckoo's Nest\".A critical and commercial success, _One Flew Over the Cuckoo's Nest (1975)_ (qv) won five Academy 'Awards' (qv), including Best Picture, Best Director, Best Screenplay, Best Actor and Best Actress, and went on to gross more than $180 million at the box office. Douglas suddenly found himself in demand as an independent producer. One of the many scripts submitted to him for consideration was Mike Gray's chilling account of the attempted cover-up of an accident at a nuclear power plant. Attracted by the combination of social relevance and suspense, Douglas immediately bought the property. Deemed not commercial by most investors, Douglas teamed up with 'Jane Fonda' (qv) and her own motion picture production company, IPC Films.A 'Michael Douglas' (qv)-IPC Films co-production, _The China Syndrome (1979)_ (qv) starred 'Jack Lemmon' (qv), 'Jane Fonda' (qv), and ''Michael Douglas' (qv)' and received Academy Award nominations for Lemmon and Fonda, as well as for Best Screenplay. The National Board of Review named the film one of the best films of the year.Despite his success as a producer, Douglas resumed his acting career in the late 1970s, starring in Michael Crichton's medical thriller _Coma (1978)_ (qv) with Genevieve Bujold, Claudia Weill's feminist comedy _It's My Turn (1980)_ (qv) starring 'Jill Clayburgh' (qv), and 'Peter Hyams' (qv)' gripping tale of modern-day vigilante justice, \"The Star Chamber\" (1983). Douglas also starred in _Running (1979)_ (qv), as a compulsive quitter who sacrifices everything to take one last shot at the Olympics, and as Zach the dictatorial director/choreographer in 'Richard Attenborough' (qv)'s screen version of the Broadway's longest running musical _A Chorus Line (1985)_ (qv).Douglas' career as an actor/producer came together again in 1984 with the release of the tongue-in-cheek romantic fantasy \"Romancing the Stone\". Douglas had begun developing the project several years earlier, and with Kathleen Turner as Joan Wilder, the dowdy writer of gothic romances, 'Danny DeVito' (qv) as the feisty comic foil Ralphie and Douglas as Jack Colton, the reluctant soldier of fortune, \"Romancing\" was a resounding hit and grossed more than $100 million at the box office. Douglas was named Producer of the Year in 1984 by the National Association of Theater Owners. Douglas, Turner and DeVito reteamed in 1985 for the successful sequel _The Jewel of the Nile (1985)_ (qv).It took Douglas nearly two years to convince Columbia Pictures executives to approve the production of _Starman (1984)_ (qv), an unlikely tale of romance between an extraterrestrial, played by 'Jeff Bridges', and a young widow, played by Karen Allen. _Starman (1984)_ (qv) was the sleeper hit of the 1984 Christmas season and earned an Oscar nomination for Best Actor for 'Jeff Bridges'. In 1986 Douglas created a television series based on the film for ABC which starred 'Robert Hays'.After a lengthy break from acting, Douglas returned to the screen in 1987 appearing in two of the year's biggest hits. He starred opposite Glenn Close in the phenomenally successful psychological thriller, \"Fatal Attraction\", which was followed by his performance as ruthless corporate raider Gordon Gekko in ''Oliver Stone' (qv)''s _Wall Street (1987)_ (qv), earning him the Academy Award for Best Actor.Douglas next starred in 'Ridley Scott' (qv)'s thriller _Black Rain (1989)_ (qv) and then teamed up again with 'Kathleen Turner' and 'Danny DeVito' (qv) in the black comedy _The War of the Roses (1989)_ (qv) which was released in 1989.In 1988 Douglas formed Stonebridge Entertainment, Inc. which produced _Flatliners (1990)_ (qv), directed by 'Joel Schumacher' (qv) and starred 'Kiefer Sutherland' (qv), ''Julia Roberts' (qv)', 'Kevin Bacon' and 'William Baldwin' and _Radio Flyer (1992)_ (qv) starring Lorraine Bracco and directed by Richard Donner. Douglas followed with David Seltzer's adaptation of Susan Issac's best-selling novel, \"Shining Through\", opposite Melanie Griffith. In 1992 he starred with 'Sharon Stone' (qv) in the erotic thriller from ''Paul Verhoeven' (qv)' _Basic Instinct (1992)_ (qv), one of the year's top grossing films.Douglas gave one of his most powerful performances opposite Robert Duvall in 'Joel Schumacher' (qv)'s controversial drama _Falling Down (1993)_ (qv). That year he also produced the hit comedy \"Made in America\" starring Whoopi Goldberg, Ted Danson and Will Smith. In 1994/95 he starred with Demi Moore in Barry Levinson's \"Disclosure,.\" based on the best seller by Michael Crichton. In 1995 Douglas portrayed the title role in 'Rob Reiner' (qv)'s romantic comedy _The American President (1995)_ (qv) opposite Annette Bening, and in 1997, starred in _The Game (1997)_ (qv) directed by 'David Fincher' (qv) and co-starring 'Sean Penn'.Douglas formed Douglas/Reuther Productions with partner Steven Reuther in May 1994. The company, under the banner of Constellation Films, produced, _The Ghost and the Darkness (1996)_ (qv), starring Douglas and 'Val Kilmer' (qv), and 'John Grisham' (qv)'s _The Rainmaker (1997)_ (qv), based on 'John Grisham' (qv)'s best selling novel, directed by Francis Ford Coppola and starring 'Matt Damon' (qv),'Claire Danes' (qv), 'Danny DeVito' (qv), 'Jon Voight' (qv), 'Mickey Rourke' (qv), 'Mary Kay Place' (qv), 'Virginia Madsen' (qv), 'Andrew Shue' (qv), 'Teresa Wright', 'Johnny Whitworth' (qv) and 'Randy Travis'.'Michael Douglas' (qv) and Steve Reuther also produced John Woo's action thriller _Face/Off (1997)_ (qv) starring 'John Travolta' and 'Nicolas Cage' (qv), which proved to be one of '97's major hits.In 1998, ' 'Michael Douglas' (qv)' starred with Gwyneth Paltrow and Viggo Mortensen in the mystery thriller _A Perfect Murder (1998)_ (qv), and formed a new production company, 2000 was a milestone year for Douglas. \"Wonder Boys\" opened in February 2000 to much critical acclaim. Directed by Curtis Hanson and co-starring 'Tobey Maguire' (qv), 'Frances McDormand' (qv), 'Robert Downey Jr.' (qv) and 'Katie Holmes', Douglas starred in the film as troubled college professor Grady Tripp. Michael was nominated for a Golden Globe and a BAFTA Film award for his performance.\"Traffic\" was released by USA Films on December 22, 2000 in New York and Los Angeles went nationwide in January 2001. Douglas played the role of Robert Wakefield, a newly appointed drug czar confronted by the drug war both at home and abroad. Directed by 'Steven Soderbergh' (qv) and co-starring Don Cheadle, Benicio del Toro, Amy Irving, 'Dennis Quaid' (qv) and 'Catherine Zeta-Jones' (qv), \"Traffic\" was named Best Picture by New York Film Critics, won Best Ensemble Cast at the SAG 'Awards' (qv), won four Academy 'Awards' (qv) (Best Screenplay, Best Editing, Best Director, and Best Supporting Actor for Benicio del Toro) and has been recognized over on over 175 top ten lists.In 2001, Douglas produced and played a small role in USA Films' outrageous comedy \"One Night at McCool's\" starring Liv Tyler, Matt Dillon, John Goodman, Paul Reiser, and was directed by Harald Zwart. \"McCool's\" was the first film by Douglas' company Furthur Films. Also in 2001, Douglas starred in \"Don't Say A Word\" for 20th Century Fox. The psychological thriller, directed by Gary Fleder, also starred 'Sean Bean' (qv), Famke Janseen and Brittany Murphy.In 2002, Douglas appeared in a guest role on the hit NBC comedy \"Will & Grace\", and received an Emmy Nomination for his performance.Douglas starred in two films in 2003. MGM/BVI released the family drama \"It Runs in the Family\", which Douglas produced and starred with his father 'Kirk Douglas' (qv), his mother 'Diana Douglas' (qv) and his son 'Cameron Douglas' (qv), Rory Culkin and Bernadette Peters. He also starred in the Warner Bros. comedy \"The-In Laws\", with Albert Brooks, Candice Bergen Ryan Reynolds.In 2004 Douglas, along with his father Kirk, filmed the intimate HBO documentary \"A Father, A Son... Once Upon a Time in Hollywood\". Directed by award-winning filmmaker Lee Grant, the documentary examines the professional and personal lives of both men, and the impacts they each made on the motion picture industry.In summer 2005, Douglas produced and starred in \"The Sentinel\", which was released by 20th Century Fox in spring 2006. Based on the Gerald Petievich novel and directed by Clark Johnson, \"The Sentinel\" is a political thriller set in the intriguing world of the Secret Service. Douglas stars with Keifer Sutherland, Eva Longoria and Kim Bassinger. Douglas filmed \"You, Me & Dupree\", starring with Owen Wilson, Kate Hudson and Matt Dillon. The comedy is direct by Anthony and Joe Russo, and was released by Universal Pictures during the summer of 2006. In 2007 he made \"King of California\", co-starring Evan Rachel Wood and is written and directed by Michael Cahill, and produced by Alexander Payne and Michael London.Michael had two films released in early '09, \"Beyond A Reasonable Doubt\" directed by 'Peter Hyams' (qv) and \"Ghosts of Girlfriend's Past\" starring Matthew McConaughey and Jennifer Garner directed by Mark Waters. He followed with the drama \"Solitary Man\" directed by Brian Koppelman and David Levien, co-starring Susan Sarandon, 'Danny DeVito' (qv), Mary Louise-Parker, and Jenna Fischer, produced by Paul Schiff and 'Steven Soderbergh' (qv) and in Fall '10 starred in \"Wall Street 2 - Money Never Sleeps\" reprising his Oscar winning role as Gordon Gekko and once again was nominated for a Golden Globe for his performance. Again directed by 'Oliver Stone' (qv), he co-starred with Shia Labeouf, Cary Mulligan, Josh Brolin, Frank Langella and Susan Sarandon.Douglas had a cameo role in 'Steven Soderbergh' (qv)'s action thriller \"Haywire.\" \"Behind the Candelabra\" based on the life of musical '70's/80's icon 'Liberace' (qv) and his partner Scott Thorson, directed by 'Steven Soderbergh' (qv) costarring 'Matt Damon' (qv), premiered on HBO in May 2013. Douglas won an Emmy, Golden Globe and SAG Award as Best Actor in a television movie or mini series for his performance as the famed entertainer. He followed with the buddy comedy \"Last Vegas\" directed by John Turtletaub co-starring Robert DeNiro, Morgan Freeman and Kevin Kline and the romantic comedy \"And So It Goes\" co-starring Diane Keaton directed by 'Rob Reiner' (qv).Douglas recently starred in and producing the thriller \"Beyond The Reach\" directed by Jean-Baptiste Leonetti costarring Jeremy Irvine and portrays Dr. Hank Pym in Marvel's \"Ant Man\" opposite Paul Rudd. It will be his first venture into the realm of comic book action adventure. Most recently he completed a spy thriller \"Unlocked\" co-starring Noomi Rapace, Orlando Bloom, John Malkovich and is directed by Michael Apted. In 1998 Douglas was made a United Nations Messenger of Peace by Kofi Annan. His main concentrations are nuclear non-proliferation and the control of small arms. He is on the Board of Ploughshares Foundation and The Nuclear Threat Initiative.'Michael Douglas' (qv) was recipient of the 2009 AFI Lifetime Achievement as well as the Producers Guild Award that year. In Spring '10 he received the New York Film Society's Charlie Chaplin Award.Douglas has hosted 11 years of \"'Michael Douglas' (qv) and Friends\" Celebrity Golf Event which has raised over $6 million for the Motion Picture and Television Fund. Douglas is very passionate about the organization, and each year he asks his fellow actors and to come out and show that \"we are an industry that takes care of own\".Douglas is married to 'Catherine Zeta-Jones' (qv). The couple has one son, Dylan, and one daughter, Carys. Douglas also has one son, Cameron, from a previous marriage.::Alburry and James Briggs"], "spouse": ["'Catherine Zeta-Jones' (qv)::(18 November 2000 - present) ( 2 children)", "'Diandra Luker' (qv)::(20 March 1977 - 1 June 2000) ( divorced) ( 1 child)"], "trade mark": ["Often plays very successful, wisecracking, in control business executives and political figures", "Gravelly smoke-burnished voice", "Often plays fathers with one daughter and no sons, for example, _Fatal Attraction (1987)_ (qv), _Falling Down (1993)_ (qv), _The American President (1995)_ (qv), _Traffic (2000)_ (qv), and _King of California (2007)_ (qv)", "His famous stereotypical capitalist character, Gordon Gekko"], "trivia": ["Son of 'Kirk Douglas' (qv) and 'Diana Douglas' (qv). Stepson of 'Anne Douglas' (qv).", "Named a United Nations Messenger of Peace. His mission: to focus worldwide attention on nuclear disarmament and human rights (1998).", "Ranked #74 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Was roommates with 'Danny DeVito' (qv) in a $150-a-month New York City apartment when Michael first began his career in the late 1960s.", "Received his Bachelor's degree from the University of California, Santa Barbara _(1968)_ (qv) as did singer 'Jack Johnson' (qv) and actor 'Ossie Beck' (qv).", "Older brother of 'Joel Douglas' (qv). Older half-brother of 'Peter Douglas' (qv) and 'Eric Douglas' (qv).", "Attended and graduated from the Choate Rosemary Hall.", "Attended and graduated from Eaglebrook School in Deerfield, Massachusetts.", "Michael is exactly twenty-five years older than his wife, 'Catherine Zeta-Jones' (qv). The two of them share a birthday: September 25th.", "His paternal grandparents, Herschel Danielovitch and Bryna Sanglel, were Jewish emigrants from Belarus, who moved to the United States c. 1912. His mother, who was born in Devonshire, Bermuda, was of English, French, Irish, Welsh, Dutch, Scottish and Belgian ancestry.", "As of 2002, he and Sir 'Laurence Olivier' (qv) are the only two people in history to win Academy 'Awards' (qv) for both Best Picture and Best Actor (although Olivier won them simultaneously for the same film).", "Initially turned down the role of Judge Wakefield in _Traffic (2000)_ (qv). He later accepted only after the script underwent extensive rewrites.", "In 1975, he quit the television series _The Streets of San Francisco (1972)_ (qv) to produce the film _One Flew Over the Cuckoo's Nest (1975)_ (qv).", "On December 11, 2003, he was host, together with wife 'Catherine Zeta-Jones' (qv), at the 2003 Annual Nobel Peace Prize Concert in Oslo Spectrum in Oslo, Norway.", "Has worked with three actors who share roles with his father. 'Kirk Douglas' (qv) played Doc Holliday in _Gunfight at the O.K. Corral (1957)_ (qv). 'Val Kilmer' (qv) played the role in _Tombstone (1993)_ (qv) and then appeared with Michael in _The Ghost and the Darkness (1996)_ (qv). 'Dennis Quaid' (qv) also played Holliday in _Wyatt Earp (1994)_ (qv) and appeared with Michael in _Traffic (2000)_ (qv). Kirk played Ulysses (Odysseus) in _Ulysses (1954)_ (qv), based on The Odyssey. Michael appeared in _Don't Say a Word (2001)_ (qv) with 'Sean Bean' (qv), who played Odysseus in _Troy (2004)_ (qv).", "Five days after completing _Black Rain (1989)_ (qv), he started filming _The War of the Roses (1989)_ (qv).", "In 1980, he was involved in a serious skiing accident, which sidelined his acting career for three years.", "Underwent treatment for alcohol and substance abuse at Sierra Tucson Center. [September 1992]", "Was named to Quigley Publications' Top 10 Poll of Money-Making Stars six times between 1985 and 1995, hitting a high of #2 in 1987. Surprising, despite a career that has spanned seven decades, his father, 'Kirk Douglas' (qv), never made the list, the annual poll of movie exhibitors that ranks the top stars in terms of box-office drawing power.", "He and _The China Syndrome (1979)_ (qv) co-stars 'Jane Fonda' (qv) and 'Jack Lemmon' (qv) have all won Academy 'Awards' (qv) for leading roles. Douglas won for _Wall Street (1987)_ (qv), Fonda for _Klute (1971)_ (qv), and Lemmon for _Save the Tiger (1973)_ (qv).", "Turned down the role of Oliver Barrett in _Love Story (1970)_ (qv) despite being offered 10% of the gross. The role went to 'Ryan O'Neal' (qv).", "He endorsed Representative 'Richard Gephardt' (qv) (D-MO) in the 2004 Democratic primaries.", "His performance as Gordon Gekko in _Wall Street (1987)_ (qv) is ranked #25 on Premiere magazine's 100 Greatest Movie Characters of All Time.", "Has been active in handgun control since 'John Lennon' (qv)'s murder on December 8, 1980.", "Reason for being born in New Brunswick, New Jersey: His parents (who had a small apartment in Greenwich Village, New York) were visiting his mother's sister (who was married to one of the founders of Johnson & Johnson which is headquartered in New Bruswick) when he arrived prematurely.", "Has residences in both New York City and Bermuda. [September 2007]", "On April 29, 2009, he was recovering from knee replacement surgery.", "On July 20, 2009, he wrote the obituary tribute for friend and _The Streets of San Francisco (1972)_ (qv) co-star 'Karl Malden' (qv) in Time magazine's \"Milestones\" section.", "The Sunday Times estimated his and wife 'Catherine Zeta-Jones' (qv)' net worth at $278 million (2009).", "Studied acting with Michael Howard in New York City.", "Friends with New York Jets owner 'Woody Johnson' (qv).", "On August 16, 2010, he has a tumor in his throat and will undergo weeks of radiation and chemotherapy, but expected to make a full recovery.", "On August 31, 2010, he announced on _Late Show with David Letterman (1993)_ (qv) that he had Stage IV throat cancer and that he has started radiation and chemotherapy.", "He was nominated for the 2011 New Jersey Hall of Fame for his contributions to the Arts and Entertainment.", "Brazilian soccer star Maicon was supposed to be named after 'Michael Douglas' (qv). His father was a huge fan of 'Kirk Douglas' (qv) and wanted to name his own son after Kirk's son. However, he could not read or write and a clerk spelled Michael as Maicon. His full name is Maicon Douglas Sisenando.", "Is fourteen years older than his first wife Diandra. He was 33 and she was 19 when they married.", "He was inducted into the 2012 New Jersey Hall of Fame for his contributions to Arts and Entertainment.", "On December 14, 2011, he will receive the 'Eugene O'Neill' (qv) Theater Center's 12th annual \"Monte Cristo\" award in April 2012.", "In the late 1960s, Michael shared a New York apartment with fellow actor 'Danny DeVito' (qv) at 338 West 89th Street in Manhattan where the rent was $75 each per month.", "His acting mentor and best friend, 'Karl Malden' (qv), died on July 1, 2009, at age 97.", "Has 3 children: son, 'Cameron Douglas' (qv) (b. December 13, 1978) with ex-wife: 'Diandra Luker' (qv) and son, 'Dylan Douglas' (qv) (b. August 8, 2000) & daughter, 'Carys Douglas' (qv) (b. April 20, 2003) with wife: 'Catherine Zeta-Jones' (qv).", "As of 2014, has appeared in two films that were nominated for the Best Picture Oscar: _Fatal Attraction (1987)_ (qv) and _Traffic (2000)_ (qv). And produced Best Picture winner _One Flew Over the Cuckoo's Nest (1975)_ (qv).", "His acting mentor was the late 'Karl Malden' (qv), whom he credits as his favorite acting mentor/best friend.", "Revealed that he had a wonderful working relationship with 'Karl Malden' (qv) on _The Streets of San Francisco (1972)_ (qv).", "Once said in an interview that he preferred to make films for adult audiences because he felt couples, particularly parents with kids, deserved to have a night out.", "Resided with actress 'Brenda Vaccaro' (qv) for several years in the 1970s after meeting on the set of _Summertree (1971)_ (qv).", "Dislikes making historical films--has made one World War II movie; prefers to make films with contemporary themes.", "Denied newspaper reports that his cancer had returned. [March 2016]", "Awarded Israel's Genesis Prize by Prime Minister 'Benjamin Netanyahu' (qv) in 2015 for his role as an actor, producer, and peace activist who has been actively promoting not just the culture but the real values of the Jewish community. Douglas said he will donate the money to activities designed to raise awareness about inclusion and diversity in Jewish life, and to finding innovative solutions to pressing global and community problems. Michael's son Dylan had his Bar Mitzvah ceremony in Israel.", "Had known his surrogate father 'Karl Malden' (qv) through his father's family, since he was a little boy, and until his mentor's death in 2009.", "In 2013, he said he actually had tongue cancer, not throat cancer.", "Counts _Ballad of a Soldier (1959)_ (qv) as the first movie that made him cry.", "Was named Mobil Man of the Month when he worked at a gas station at age 20.", "Douglas avoids doing historical movies because, \"I'm a contemporary guy.\".", "The only time he was billed as M.K. Douglas was when he appeared in an episode of \"CBS Playhouse\" (1969).", "On April 4, 2003, he underwent a face augmentation at the St Regis Hotel in Century City, Los Angeles.", "Has taken part in fundraisers for Montreal's General Jewish Hospital.", "Friends with 'Rob Reiner' (qv), 'Larry Manetti' (qv), 'Dick Van Patten' (qv) and 'Nick Ashford' (qv).", "In 2016, he visited three college campuses in the United States to speak to students about Israel and modern anti-Semitism.", "Became a grandfather for the first time at age 73 when his son 'Cameron Douglas' (qv) and his girlfriend 'Viviane Thibes' (qv) welcomed a daughter, Lua Izzy Douglas, on December 18, 2017.", "During the 2018 Live from the TCM Film Festival special, Douglas revealed that 'Steven Soderbergh' (qv) first brought up the idea that Douglas should play pianist 'Liberace' (qv), while they were filming the movie, _Traffic (2000)_ (qv), together. Douglas later played the real-life person in the HBO telefilm, _Behind the Candelabra (2013)_ (qv).", "He was awarded a Star on the Hollywood Walk of Fame at 6259 Hollywood Boulevard in Hollywood, California on November 6, 2018."], "quotes": ["I'm not a big filmophile. I don't watch movies a lot for a hobby. I spend all my time watching sporting events. Because, opposed to movies, you can never tell how they're going to end.", "[on _Inside the Actors Studio (1994)_ (qv), answering an actor's question about whether to move from New York City to Los Angeles] Don't go to L.A. unless there's work. It's one of the most frustrating and depressing places to be an actor. The problem is that it has no center. I would try to do something here first.", "When you're making pictures out of heartfelt passion, it hurts when someone calls them a calculated business move.", "I'm impressed with the people from Chicago. Hollywood is hype, New York is talk, Chicago is work.", "[on wife 'Catherine Zeta-Jones' (qv)] She is not only beautiful but also very deep and we understand each other extremely well. I love her above all. Catherine is the woman of my life. A dream.", "I don't know about 'Brad Pitt' (qv), leaving that beautiful wife to go hold orphans for Angelina ['Angelina Jolie' (qv)]. I mean, how long is that going to last? I mean, don't ask me what happened with 'Renée Zellweger' (qv). I don't know how you get married for four months. And Julia ['Julia Roberts' (qv)] with Lyle ['Lyle Lovett' (qv)].", "From the moment I met Catherine [wife 'Catherine Zeta-Jones' (qv)] and we formed our family, I was a new man, very different from the one I used to be. This is the result of my everyday life with her, of the intense love we have for each other, of the great need for each other that we have, and of the great respect that we have for one another. There is a time when you become sarcastic, you lose the passion, and, when you are blessed again, and you have the fortune to love somebody the way I love my wife, you understand that you have to nurture your partner and not take everything for granted. What a marvelous gift!", "[1980] The exciting thing about making movies today is that everything is up for grabs. And you had better grab.", "Revenge is a very good motivation if you can direct it. It's healthy. Very healthy.", "_Wonder Boys (2000)_ (qv) was a huge disappointment personally. I loved the movie and we didn't even get critically acknowledged as far as awards go. I thought it was a fucking disgrace. I'll be honest--it really hurt my confidence. It was a punch in the gut. In fact, it was my father ['Kirk Douglas' (qv)] who helped me through it. His favorite movie is _Lonely Are the Brave (1962)_ (qv). Nobody saw that when it came out, nobody's seen it since. My father's disappointment in that movie helped me get over mine.", "When my daughter Carys wants to get married I'll be as rough with the guy as Catherine's [wife 'Catherine Zeta-Jones' (qv)] dad was when he checked me out. He gave me the once over and then some.", "Having a little girl is incredible. I tell you it's an insight. I think guys who have sisters have a big advantage, understanding the female psyche.", "As soon as I met Catherine ['Catherine Zeta-Jones' (qv)] I told her I wanted to have babies with her, and the moment I found out that she had the same birthday as me--tadaah! Then when I discovered she loved golf, I realized all my fantasies had come true. I've lucked out at this time in my life. I just lucked out. I'm so impressed by her intelligence, sense of humor and work ethic.", "Times have changed and sex sells. Around 1990 I voluntarily went into rehab because I was drinking too much and some smart-ass editor said, \"Oh, another boring story about an actor going to rehab. Let's give him sex addiction.\" Then it became, \"Self-confessed sex addict!\".", "My life does take a bit of work. I certainly know how much guys like Catherine ['Catherine Zeta-Jones' (qv)], and well deserved. She's fantastic and beautiful inside and out, she's a talented, talented actress, really good mom and a heck of a wife.", "I was there the night 'John Lennon' (qv) was shot, three blocks away. It left a lasting impression on me. It motivated me to do whatever I could to lobby for small-arms control.", "I admire 'Albert Finney' (qv) very much, his performances always look so effortless. And of course, my good friend 'Jack Nicholson' (qv), who lives life to the full, and who never ever does things by halves. He's a real hero!", "When you are a second-generation success, you are provided for. And that certainly was a big opportunity. But you don't have that \"rags-to-riches\" story, which is always a much more dramatic story to plot. Your success is not one that is as easily accepted by the people outside. Or they don't really have an appreciation of what you have accomplished. As a producer, my successes came fairly early in my career; as an actor, they came much later. Winning the Academy Award for _Wall Street (1987)_ (qv) really helped me to finally overcome that \"second generation\" thing. It's hard for people, no matter how generous and gracious they are, to really allow you any slack. They say, \"Oh, it must have been hard to be 'Kirk Douglas' (qv)' son\", but they don't really want to accept it. You grow up in this business and all that means is that you don't get the joy of succeeding. If you succeed, it's expected. If you look around you can see that there are hardly any second-generation people that have succeeded at all. It's a minefield of disasters, of broken careers and self-destruction out there. The public's perception is that you didn't have to do anything. So if you succeed, it's just assumed. If you don't get success, you're an asshole like everybody else.", "[1998] I create challenges by the roles I take. I'm sort of proud of the fact that I'm not really typecast. People are always trying to get a handle on what you do. With me, either it's my sex trilogy: _Fatal Attraction (1987)_ (qv), _Basic Instinct (1992)_ (qv) and _Disclosure (1994)_ (qv)--or my businessman trilogy: _Wall Street (1987)_ (qv), _The Game (1997)_ (qv) and this picture I'm doing now called _A Perfect Murder (1998)_ (qv). I've been fortunate that, within those categories, I've been able to choose different types of roles, and I am proud that the audience has been able to accept me in whatever type of role I play. They are not the typical \"movie star\" roles. They're more ambivalent characters. Sometimes they are morally depraved. They are not the outright positive type of images that you attribute to selecting a \"star\"-type role. And the pictures themselves are more oddball. I've been very fortunate in that area, too. I've taken chances and so far the audiences have basically condoned those choices. They have allowed me to do those different types of roles. I do pictures for myself, because I figure if I like them, some other crazy people out there might like them, too. You know, once you've gained your confidence and done some bizarre, strange films with some roles that have been successful, it gives you the confidence to go out there and take more chances.", "Actors are paid to be selfish and self-involved.", "Those British film certificates explained in full: \"Oh, I get it, it's simple. PG means the hero gets the girl, 15 means that the villain gets the girl, and 18 means everybody gets the girl.\".", "[on his career and his favorite films] I always say you work as hard on your failures as your successes. I like my track record, I like my batting average. I got a real good batting average. A lot of movies. Not a lot of grand-slam home-runs, lot of singles, doubles, triples. Lot of hits, you know? Small but kind of ultimately worked out. Kind of fiduciary responsibilities and budgets. The ones that stick out are the ones nobody wanted to make, from _Falling Down (1993)_ (qv) to _Fatal Attraction (1987)_ (qv), things like that. Or ones that were so bizarre. _The War of the Roses (1989)_ (qv), _Wonder Boys (2000)_ (qv).", "[on if he enjoys working on indie films] It's challenging, and as I say, it makes you go back to being much more instinctual and not overly planning or overly preparing. You do your homework before and just go, but it's really sort of where the pictures lie that you just wanna do. You try to mix it up, anyway. You always try to get a commercial picture or so-called \"commercial\" film in there from time to time, mixed up with an independent or a smaller or a character piece. So yeah, I'm pretty flexible. I enjoy it, I really do. It's something I like and am passionate about.", "[on researching his characters] With _Black Rain (1989)_ (qv) I spent a lot of time with homicide detectives, and I spent a lot of time with different brokers on _Wall Street (1987)_ (qv). It helps get the rhythm of the piece and the tone, and how overplayed or underplayed it might be. That's also the magic of movies: You get to hang out and live these different lives. I think a certain amount of that helps the verisimilitude.", "_King of California (2007)_ (qv) was just, I thought, a really great, fresh, original kind of script. I loved the tone, the mix of tragedy, comedy and drama, and that it was a good part. Kind of a challenge, and I was excited to work on it.", "[on _Basic Instinct 2 (2006)_ (qv)] Yes, they asked me to do it a while ago, I thought we had done it very effectively. 'Paul Verhoeven' (qv) is a pretty good director. I haven't seen the sequel. I've only done one sequel in my life, _The Jewel of the Nile (1985)_ (qv), from _Romancing the Stone (1984)_ (qv). Besides, there were age issues, you know? ['Sharon Stone' (qv)] still looks fabulous. The script was pretty good. Good for her, she's in her late 40s and there are not a lot of parts around. The first one was probably the best picture of her career--it certainly made her career and she was great in it.", "It's hard in my business to find new friends because you're always suspect of what their motives might be. And while I don't like that about myself, I tend to get a little more cautious about making new friends. The people that you knew either when you were starting out in your career or in college didn't take your success as part of the equation of your friendship. They are the ones you love and trust. I would like to be more open about meeting people, but it's hard.", "I do most of my preparation before the filming process starts. Your principal choices are done beforehand and then if you feel like you've nailed it, and you have adequate time, then you get to try something else. One of the biggest lessons I have learned as an actor is that it's all just celluloid, it's all disposable. They only use a little bit and you try to remind yourself of that so that you can take chances and burn film if you've got to. Make a fool of yourself. Do something that's not right. And that's the biggest risk and opportunity.", "Unlike your average profession, acting usually comes in concentrated doses. When you're an actor, it's anywhere from two and a half to five months of intense work and then it's done. That's the hardest part of film acting. There is no audience response, so you really don't get any immediate satisfaction. What I really love is the feeling of nailing something. You nail the scene. Most of the time you don't shoot movies in continuity, you only do things in parts, so nailing a scene is really a rewarding sensation.", "The process of making a movie continues to amaze me. There is a certain magic that happens. And you never know when it's going to be. But while a writer is alone with their word processor, or a painter is alone in a studio, or a musician is working on a song, movie making is a big kind of collaborative family. Certainly it starts with the written word, but then it becomes a collaborative art and that process never ceases to amaze me. It's almost mystical. It's something that is really alive and fresh.", "I do pictures for myself, because I figure if I like them, some other crazy people out there might like them, too. You know, once you've gained your confidence and done some bizarre, strange films with some roles that have been successful, it gives you the confidence to go out there and take more chances.", "[on the death of 'Karl Malden' (qv) in 2009] It was Karl who, more than anyone, got me to understand that an actor is just one part of a whole team that makes a television series or movie work. And thanks to him, I learned about the dichotomy of standing alone in a craft where one must collaborate.", "[on his decision to give the lead role in _One Flew Over the Cuckoo's Nest (1975)_ (qv) to 'Jack Nicholson' (qv) instead of his father 'Kirk Douglas' (qv)] My father has played up his disappointment with that pretty good. God bless him, he's 93. I finally said, \"Dad, I worked six years getting this together . . . \" I have to remind him, I shared part of my producing back-end [credit] with him, so he ended up making more money off that movie than he had in any other picture.", "[on the sequel _Wall Street: Money Never Sleeps (2010)_ (qv)] There was a recession when the first movie arrived in 1987. There's a recession now. Greed, which Gordon Gekko declared as being good, hasn't just survived but has thrived amid easy credit, sub-prime mortgages and an America that ignored the signs of an oncoming market collapse. We brought 'Oliver Stone' (qv) a script. Stone, the son of a stockbroker, wanted to do it.", "[on 'Karl Malden' (qv)] He was fantastic. He just had a tremendous discipline, tremendous ethics. He insisted that next's week's script would be there when we were shooting that week's script. Every time between setups, between breaks, we'd go in the trailer and run lines for the next's week's show. That's the kind of discipline, training I got from Karl.", "Not going public with having cancer was not much of an option, even if I had objected. When you are a celebrity, nothing remains secret for very long. If it helps bring attention, then that is a major upside to this whole thing. Millions of families are going through the same thing my family and I are now going through. If I can bring any relief or encouragement to those suffering, that's the good news.", "[on his on- and off-screen chemistry with 'Karl Malden' (qv), who played Lt. Mike Stone on _The Streets of San Francisco (1972)_ (qv)] I've had mentors. 'Karl Malden' (qv) was clearly a mentor and one of the most important people in my professional career. He was a tremendous influence on me in so many areas--such as work ethic. But I think that's probably why I do all these grey characters, I don't see a lot of heroes around.", "[on dropping out of _Cutthroat Island (1995)_ (qv)] I was fairly far down the road with that film, but I didn't pull out right before production--it was four or five months before. I just didn't feel comfortable doing a picture with the director married to the leading lady. After a couple of drafts, I didn't like where it was going. There was all this momentum to go ahead, but it didn't smell good.", "[2001, on wrapping _Falling Down (1993)_ (qv) the same day the 'Rodney King' (qv) riots began] You know, as we finished that film the riots were going on in L.A. I'll never forget the last day of shooting--that's literally when it all started. We were working in the Valley [L.A.'s San Fernando Valley] and, when we finished, I headed to the airport. It was a war zone. You could see dots of fires all over the place, all heading for the west side of town. I got my family on a plane--I didn't even know where it was going.", "[2001, on why he thinks _Black Rain (1989)_ (qv) didn't do better at the box office] It was hard to know who to root for. And people here were uncomfortable with race stuff and talking about the bomb. There was a critic, who'll remain nameless, who called it a racist film. I called him up and asked, \"Have you ever been to Japan?\". He said, \"No\", and I said, \"Then what the hell are you talking about?\". The Japanese loved it. I loved it--I thought it rocked from top to bottom.", "[2001, on his sex scene with 'Jeanne Tripplehorn' (qv) in _Basic Instinct (1992)_ (qv)] In a scene like that, what I try always to do is make the actress feel comfortable, let her know that I will be looking out for her. Okay, I'm going to touch your breast here. So there's none of that where she feels, \"Hey, what are you doing?\" It's sort of like doing fight sequences. You go through the beats. I'm going to go boom, kiss, kiss, rip. Then it's action and you do it. It's the most unspontaneous thing in the world. The difficulty of doing a sex scene is that sex is the one thing in movies that your entire audience knows about. Nobody in the audience has been killed and most haven't taken a bullet or been in any brutal fights. Lovemaking, everybody's an expert.", "[2001, on why he and 'Catherine Zeta-Jones' (qv) sold photos of their newborn baby] It seems odd, I guess, for the United States. But Catherine [wife 'Catherine Zeta-Jones' (qv)] is an international star and, in England, the paparazzi become like bounty hunters and go to extraordinary extremes to take a photograph they can sell. When you spend your whole life protecting your name and likeness, how do you deal with these people? I've been really open about it, saying, \"Look, you want to take a photograph of me and sell it? We'll split the money, and I'll give my half to charity.\" When we were going to have a baby, we knew a bounty hunt would happen. So when we were contacted by a magazine about their doing a layout, paying us for it, then syndicating the photos--a fairly common practice in Europe as opposed to here--we simply saw it as a way to build financial security for our new son and control what was going to be a madhouse. I'd rather do that than have some guy harassing us, though that happens anyway.", "Catherine [wife 'Catherine Zeta-Jones' (qv)] was a tremendous surprise in my life. After my divorce, I was puttering along quite well as a single guy and couldn't believe how honest you could be with ladies, as long as you didn't date two of them in the same town at the same time. They knew I was seeing other people. Then I got struck down, I was just bowled over by Catherine, I was smitten with her. The age difference has been irrelevant to us.", "Kirk's [father 'Kirk Douglas' (qv)] career was constant, overwhelming. The guy didn't stop. Back then, they were doing five movies a year. My father did 90-plus films. He was _Spartacus (1960)_ (qv)! I always admired his tenacity and stamina but he was intimidating to me as a child. Like a lot of actors, he was consumed with ambition and his career. He was also consumed with guilt because of the time he spent away from the family. It took him a long time to come to terms with it. But we get on very well now.", "[on the 2008 financial crash] I lost 35-40% of my net worth. I decided to just weather out the storm. I waited, didn't do anything and the next year we kind of came back to where we were the year before, but I lost two years. Now I manage my own funds. I am much more conservative these days in my investments.", "I was always shocked when so many people who saw _Wall Street (1987)_ (qv) said I was the person who influenced them and inspired them to go into investment banking. I'd say, \"I was the villain,\" and they would say, \"No, no, no.\" They didn't see me that way, so it was all very seductive I guess.", "[ruling out a post-series _The Streets of San Francisco (1972)_ (qv) reunion movie] Like any great thing, like a fine wine, it's better off left alone.", "[on watching 'Liberace' (qv) on television] I never thought about the gayness. He just looked like he was having so much fun. And that whole idea of talking directly to the audience, you just went along with him. He made you happy.", "[on more films centering on seniors] Well, they're back in the theaters. We've done this full circle when movies were designed for kids, but now they all watch them on their iPads. The old folks want to get out of the house.", "[on _Behind the Candelabra (2013)_ (qv)] I just want to commend Matt because I don't think I would have had the courage at that point in my career to take this on.", "[on _Behind the Candelabra (2013)_ (qv)] I think the studios, in their infinite wisdom, even with Matt ['Matt Damon' (qv)], myself and ['Steven Soderbergh' (qv)] attached, thought it would only attract a gay audience. And with the cost of marketing movies and making them, they didn't want to take that risk. I see it as the studios' loss.", "It's a much smaller minority of people who think they still have to stay in the closet. It's quite interesting to see how fast it's all changed. Without naming names, I certainly think there are a couple of people out there who have not come out in the spirit of protecting their careers and livelihoods. It's probably a little bit more difficult going that way. I think that's true.", "[on 'Saul Zaentz' (qv)] Saul is a wonderful mixture--he's a street-smart guy from Jersey who has impeccable taste. There are a lot of people in this town who pretend to have both toughness and good taste, but with Saul it isn't pretense. His power comes from his joy and enthusiasm for a project.", ". . . in your career you can count on one hand the really good part. In _Wall Street (1987)_ (qv), I had the best part I ever had.", "I am not selfish enough to slow down. I hurt myself because I'm such a team player. I'm great to work with; I'm always looking out for other actor and making it work.", "A lot of directors aren't really keen on working with an actor who's also a producer. As if they're talking to you, and they feel like your wheels are going in the back of your head.", "One of the things I'm most proud about in _Fatal Attraction (1987)_ (qv) is you start off with an audience not liking you.", "There's something going on with young American actors--both men and women--because the Brits and Australians are taking many of the best American roles from them. Clearly, it breaks down on two fronts. In Britain, they take their training seriously, while in the States, we're going through a sort of social media image-conscious thing rather than formal training. Many actors are getting caught up in this image thing which is going on to affect their range. With the Aussies, particularly with the males, it's the masculinity. In the United States, we have this relatively asexual or unisex area with sensitive young men and we don't have many Channing Tatums or Chris Pratts, while the Aussies do. It's a phenomena. There's a crisis in young American actors right now. Everyone is much more image-conscious than they are about actually playing the part.", "[on his bout with cancer] It's been five years and I feel really good. But you have a new appreciation. I'm more motivated, more responsible. My younger kids could be my grandchildren. I want to be here awhile.", "It was a cathartic experience, to say, \"Hey, we acknowledge and recognize you as a Jew.\" It was a wonderful, emotional experience. I'm one of those who never felt accepted.", "So that is our challenge in 2015, and all of us must take it up. Because if we confront anti-Semitism whenever we see it, if we combat it individually and as a society, and use whatever platform we have to denounce it, we can stop the spread of this madness."], "salary history": ["_The China Syndrome (1979)_ (qv)::$262,000", "_Fatal Attraction (1987)_ (qv)::$13,000,000 -$15,000,000 (includes base salary and gross participation)", "_Basic Instinct (1992)_ (qv)::$15,000,000", "_Disclosure (1994)_ (qv)::$12,000,000", "_The American President (1995)_ (qv)::$15,000,000", "_The Game (1997)_ (qv)::$20,000,000", "_A Perfect Murder (1998)_ (qv)::$20,000,000", "_Wonder Boys (2000)_ (qv)::$5,000,000", "_Traffic (2000)_ (qv)::$10,000,000"], "birth date": "1944-09-25", "birth notes": "New Brunswick, New Jersey, USA", "_actorID": "80", "_source": "IMDB", "actorID": "0000140", "created_utc_dt": "09/14/2019, 13:02:26"}