{"headshot": "https://m.media-amazon.com/images/M/MV5BMDg4NWZjNmEtZWVmNC00MzdhLTlhOTEtZmViYjdmMzhjMTAyXkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_UY98_CR5,0,67,98_AL_.jpg", "birth name": "John Adedayo Adegboyega", "height": "5' 9\" (1.75 m)", "mini biography": ["'John Boyega' (qv) is a British actor, known for playing Finn in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv). Boyega rose to prominence in his native United Kingdom for his role of Moses in the 2011 sci-fi comedy film _Attack the Block (2011)_ (qv), before attaining international recognition for his work as Finn in the seventh film of the Star Wars series.Other credits include historical fiction drama film _Half of a Yellow Sun (2013)_ (qv), four episodes of the television series _24: Live Another Day (2014)_ (qv), and the drama films _Imperial Dreams (2014)_ (qv), _The Circle (2017)_ (qv), and _Detroit (2017)_ (qv).::Pedro Borges"], "trivia": ["Began acting at Theatre Peckham, a local performing arts centre in London for talented children aged 9 to 14. Boyega spent almost every day after school at the theatre, as well as weekends. At 16, he moved to South Thames College to study performing arts, and joined the Identity School of Acting in Hackney. He enrolled at Greenwich University but as his career took off, he left to concentrate on acting.", "Born and raised in Peckham, south-east London.", "Was chosen by Screen International as one of the \"UK Stars of Tomorrow 2011\" and appeared alongside two other actors on the front cover of that magazine in its July 2011 edition.", "The son of Nigerian immigrants; his father is a Pentecostal preacher and his mother works with the disabled.", "Has a pet cat named Oluwalogan, often referred to as just Logan.", "Auditioned for the role of Eggsy in _Kingsman: The Secret Service (2014)_ (qv), and was one of the three finalists along with 'Taron Egerton' (qv), who won the role.", "His character Finn is featured on a Star Wars postage stamp issued in October 2015 by the UK's Royal Mail postal service.", "One of the reasons 'J.J. Abrams' (qv) cast him as Finn in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv) was because of his performance in the sci-fi/action/comedy _Attack the Block (2011)_ (qv). Abrams is a big fan of the film.", "Established his own production company, UpperRoom Entertainment Limited, in January 2016.", "Can impersonate facial mannerisms and the voice of his Star Wars co-star Daisy Ridley.", "Counts _Sister Act 2: Back in the Habit (1993)_ (qv) as one of his favorite movies as a kid.", "His middle name means \"the crown has become joy\".", "In 2012, he went to a meeting at the Bad Robot studio. While he was waiting in the lobby, he saw 'J.J. Abrams' (qv) and 'Tom Cruise' (qv) walking out of an editing room. Upon seeing him, Abrams asked \"Boyega, right?\", which resulted in a small conversation. Abrams said that he was a huge fan of _Attack the Block (2011)_ (qv) (John's first film) and added \"We're gonna get you in something\". However, John was rather starstruck by Cruise and paid little attention to what Abrams just said. In 2014, he was cast in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv), which was directed by 'J.J. Abrams' (qv). When 'Tom Cruise' (qv) met John again at the Baftas, he asked \"So, Star Wars, huh?\", to which John happily replied \"Yeah, mate\".", "While filming _Star Wars: The Last Jedi (2017)_ (qv), he went to a strict diet and training regime. One day, he went to 'Carrie Fisher' (qv)'s trailer, telling her that he was fed up with eating healthy. She then offered him some candy that she had stashed inside her fridge. John compared that experience to walking right into a candy store. After that, he would often visit Fisher's trailer for occasional \"cheat days\"."], "quotes": ["_Attack the Block (2011)_ (qv) is an alien invasion film set in South London. It's about a group of kids who are some petty thugs, who have to find the hero in themselves, when they attack.", "I remember my manager telling me, 'Be myself, be humble, keep rooted, keep God first'. Those words were very helpful.", "My dad is a minister, and my mum is a worker with the less fortunate and the disabled. They're Nigerian natives. Their first language is Yoruba, and their second language is English.", "My dad's a Pentecostal minister, meaning that he's full of charisma. If he's telling a story about Noah's ark, you best know each tiger is going to be having their own little conversation and narrative.", "Acting careers don't come out fully formed - not unless your name is Jaden Smith and your dad has done it all.", "Film is just a great medium to express yourself and a great environment to work around.", "I know my movies. I love my movies.", "Hollywood has given me a great, warm hug.", "Being robbed hurts - not physically, but from what it does to your pride.", "I like my women very green; you know, eco-friendly.", "I'm a Michael Bay fanatic.", "I'd like to be in anything that tells a good story and has an interesting character.", "I'm a comic reader and a manga fan.", "I love London. I'm a London fanatic. That's my city.", "I've been getting diverse roles.", "There is a level of appreciation for brothers and sisters in the hood.", "The scripts that I've been getting are of epic proportion. People want me to lead the big armies.", "There's a difference between living somewhere and being part of somewhere.", "The 'block' in _Attack the Block (2011)_ (qv) is not just a physical thing. It's people; it's families.", "Portray the world for what it is, and you will find truth.", "In this life, it's not hard to do wrong.", "'Junkhearts' is a great story.", "I've had plenty of lessons about film acting and theatre acting.", "My biggest challenge is to not do urban movies for the rest of my life, those alpha hoodies.", "In the States, you have a little bit of freedom to audition for different kinds of roles.", "It's amazing that people still feel, 'Oh my gosh, it's a black guy.' We've been here for a long time; let's get used to it. Let's get used to other cultures.", "I've been acting since I was 5 years old, from primary school to secondary school, did training at drama school, which was the big thing for me because they trained me, put me out into the industry.", "Normally you hear about Southeast London, and you hear about all the stuff that goes on down there, all the negative things, and the tabloids kind of stay away from all the positive things that happen that I see every day, which kind of outshines the negative.", "You know, urban culture is fun; it's lovely.", "You know, we all can do bad, and we all can do good.", "Some people feel fulfillment from a bitter end - it gives them some sort of sense of reality. But, when you're dealing with reality, I feel like films should discover the part that is happy.", "I watched season four of 'The Wire.' They have subtle performances that they do through their eyes. You could watch season four with the audio off and still understand what's happening through their eyes.", "Who wouldn't want to be in 'Star Wars?' It'd be great."], "salary history": ["_Star Wars: Episode VII - The Force Awakens (2015)_ (qv)::$450,000 + percentage of box office"], "birth date": "1992-03-17", "birth notes": "Peckham, London, England, UK", "_actorID": "89", "_source": "IMDB", "actorID": "3915784", "created_utc_dt": "09/14/2019, 13:02:34"}