{"headshot": "https://m.media-amazon.com/images/M/MV5BNTUzOTMwNTM0OV5BMl5BanBnXkFtZTcwNDQwMTUxMw@@._V1_UY98_CR2,0,67,98_AL_.jpg", "birth name": "Mel Columcille Gerard Gibson", "height": "5' 9¾\" (1.77 m)", "mini biography": ["Mel Columcille Gerard Gibson was born January 3, 1956 in Peekskill, New York, USA, as the sixth of eleven children of 'Hutton Gibson' (qv), a railroad brakeman, and Anne Patricia (Reilly) Gibson (who died in December of 1990). His mother was Irish, from County Longford, while his American-born father is of mostly Irish descent.Mel and his family moved to Australia in the late 1960s, settling in New South Wales, where Mel's paternal grandmother, contralto opera singer Eva Mylott, was born. After high school, Mel studied at the University of New South Wales in Sydney, performing at the National Institute of Dramatic Arts alongside future film thespians 'Judy Davis' (qv) and 'Geoffrey Rush' (qv).After college, Mel had a few stints on stage and starred in a few TV shows. Eventually, he was chosen to star in the films _Mad Max (1979)_ (qv) and _Tim (1979)_ (qv), co-starring 'Piper Laurie' (qv). The small budgeted Mad Max made him known worldwide, while Tim garnered him an award for Best Actor from the Australian Film Institute (equivalent to the Oscar).Later, he went on to star in _Gallipoli (1981)_ (qv), which earned him a second award for Best Actor from the AFI. In 1980, he married Robyn Moore and had seven children. In 1984, Mel made his American debut in _The Bounty (1984)_ (qv), which co-starred 'Anthony Hopkins' (qv).Then in 1987, Mel starred in what would become his signature series, _Lethal Weapon (1987)_ (qv), in which he played \"Martin Riggs\". In 1990, he took on the interesting starring role in _Hamlet (1990)_ (qv), which garnered him some critical praise. He also made the more endearing _Forever Young (1992)_ (qv) and the somewhat disturbing _The Man Without a Face (1993)_ (qv). 1995 brought his most famous role as \"Sir William Wallace\" in _Braveheart (1995)_ (qv), for which he won two Oscars for Best Picture and Best Director.From there, he made such box office hits as _The Patriot (2000)_ (qv), _Ransom (1996)_ (qv), and _Payback (1999)_ (qv). Today, Mel remains an international superstar mogul, continuously topping the Hollywood power lists as well as the Most Beautiful and Sexiest lists.::TrendEkiD@aol.com -Rowspacing by Tony Hedlund"], "spouse": ["Robyn Moore::(7 June 1980 - 23 December 2011) ( divorced) ( 7 children)"], "trade mark": ["Often acts and directs stories involving an individual who is persecuted, and fights for justice", "Has often portrayed a widower, in films such as Mad Max (the sequels), Lethal Weapon film series, _Braveheart (1995)_ (qv), _The Patriot (2000)_ (qv), _Signs (2002)_ (qv), and _Edge of Darkness (2010)_ (qv).", "Often portrays men who seek revenge for the murder of family or friends", "Rugged, chiseled features", "Rich, gravelly voice", "Piercing blue eyes", "Often plays angry or deranged characters", "Intense acting style"], "trivia": ["Ranked #12 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Born at 4:45pm-EST.", "Chosen by People (USA) magazine as one of the \"50 Most Beautiful People\" in the world. [1996]", "Educated at University of New South Wales, Australia.", "Attended drama school with 'Judy Davis' (qv). They played Romeo and Juliet together.", "Chosen by People magazine as one of the \"50 Most Beautiful People\" in the world. [1991]", "Chosen by People magazine as one of the \"50 Most Beautiful People\" in the world. [1990]", "Trained at NIDA (National Institute of Dramatic Arts). As well as 'Judy Davis' (qv), other fellow students, during his time there, included 'Colin Friels' (qv).", "Awarded the AO (Officer of the Order of Australia), Australia's highest honor, in mid-1997.", "Roommates with 'Geoffrey Rush' (qv) after college (the National Institute of Dramatic Art) when they were in an acting company (called Jane Street) together that was affiliated with NIDA. 'Geoffrey Rush' (qv) trained at La Cocq Mime School in France.", "He took up acting only because his sister submitted an application behind his back. The night before an audition, he got into a fight, and his face was badly beaten, an accident that won him the role.", "Older brother of actor 'Donal Gibson' (qv).", "Chosen by Empire magazine as one of the \"100 Sexiest Stars\" in film history (#37). [1995]", "Chosen as People Magazine's first \"Sexiest Man Alive.\" [1985]", "Like his character Riggs in the Lethal Weapon Movie series he is a big fan of 'The Three Stooges' (qv).", "First studied drama at the New Zealand Drama School, Toi Whakaari in Wellington, New Zealand. After getting accepted he completed the course and used this as a foot-in into NIDA in Australia in 1975.", "He and his wife met through a dating service in Australia.", "Has a horseshoe kidney (two kidneys fused into one).", "Owns a production company, Icon International, with branches in the USA, Australia, and the UK.", "Ranked #15 in Premiere's 2003 annual \"Power 100\" list. Had ranked #17 in 2002.", "His voice in _Mad Max (1979)_ (qv) was dubbed for the film's US release.", "The doctor who delivered him into the world is believed to be Charles Sweet, grandfather of filmmaker 'Jay Ruzicka' (qv).", "He was a part of the movement dubbed the \"Australian New Wave\" by the press. They were a group of filmmakers and performers who emerged from Down Under at about the same time in the early 1980's and found work in other parts of the world. Other members included actress 'Judy Davis' (qv) and directors 'George Miller' (qv), 'Gillian Armstrong' (qv) and 'Peter Weir' (qv).", "He was the first Australian actor to be paid $1,000,000 for a film role.", "Almost turned down the role of William Wallace in _Braveheart (1995)_ (qv) because he thought he was too old for the role. He asked the producers if he could direct it instead. A compromise was made, he could direct the movie if he agreed to portray Wallace.", "His father, 'Hutton Gibson' (qv), moved the family from upstate New York to Sydney, New South Wales, Australia, in 1968 after winning as a contestant on _Jeopardy! (1964)_ (qv).", "For _The Passion of the Christ (2004)_ (qv), which he directed, wrote and produced, he spent 25 million dollars of his own money. Back in 1992, he started doing research for the movie that was not released until 2004.", "Has nine children from three women: seven children from his marriage to Robyn Gibson: daughter, 'Hannah Gibson' (qv) (born 1980); twin sons, 'Edward Gibson' (qv) and 'Christian Gibson' (qv) (born 1982); son, Willie Gibson (born 1985); son, Louis Gibson (born 1988); son, 'Milo Gibson' (qv) (born 1990); son, Tommy Gibson (born 1999); daughter, Lucia (born 2009), from his relationship with 'Oksana Grigorieva' (qv); and son, Lars (born 2017), with girlfriend 'Rosalind Ross' (qv).", "(Fall 2001) Son, 'Christian Gibson' (qv), is a freshman at the University of Colorado at Boulder.", "He was considered for the role of James Bond in both _The Living Daylights (1987)_ (qv) and _GoldenEye (1995)_ (qv) before 'Timothy Dalton' (qv) and 'Pierce Brosnan' (qv) were cast respectively. 'Albert R. Broccoli' (qv) turned him down for the former because he wasn't British and he turned down the latter because he was busy with _Braveheart (1995)_ (qv).", "Ranked #10 in Premiere's 2004 annual \"Power 100\" list. Had ranked #15 in 2003. He is the highest-ranked actor on the 2004 list.", "Has his own private chapel in his grounds, where he attends mass every day.", "He was voted the 48th \"Greatest Movie Star\" of all time by Entertainment Weekly.", "Ranked number 1 on Forbes's 2004 \"Celebrity 100 List\". He was the highest paid celebrity in 2004 with a reported $210,000,000 salary from his _The Passion of the Christ (2004)_ (qv) profits, plus a potential $150,000,000 that is yet to be accounted for. He made more money than 'Oprah Winfrey' (qv) ($210,000,000), 'J.K. Rowling' (qv) ($147,000,000), 'Tiger Woods' (qv) & 'Michael Schumacher' (qv) ($80,000,000 each) and 'Steven Spielberg' (qv) ($75,000,000) in 2004.", "In Portuguese, \"Mel\" means \"honey\".", "Was considered for the role of Batman/Bruce Wayne in _Batman (1989)_ (qv) (particularly with 'Richard Donner' (qv) directing), but he was busy with _Lethal Weapon 2 (1989)_ (qv).", "Was considered for the role of Wolverine in _X-Men (2000)_ (qv), but was deemed too expensive.", "Son of the controversial 'Hutton Gibson' (qv) and Anne Gibson.", "In the movie _Forever Young (1992)_ (qv), he needed to appear older in the last few scenes. Because his eyes were so bright blue, no matter how many wrinkles they put on him, he did not look authentically older. So, he had to wear gray contacts, in order to look old.", "Along with 'Warren Beatty' (qv), 'Clint Eastwood' (qv), 'Robert Redford' (qv), 'Richard Attenborough' (qv) and 'Kevin Costner' (qv) one of 6 people to win and Academy Award for \"Best Director\", though they are mainly known as actors.", "Was awarded an honorary Doctor of Humane Letters degree from Loyola Marymount University in Los Angeles in May 2003, and gave the commencement address.", "Ranked #15 on Premiere's 2005 Power 50 List. Had ranked #10 in 2004.", "His favourite films include, _The Big Country (1958)_ (qv), _Double Indemnity (1944)_ (qv), and _Spartacus (1960)_ (qv)", "His family line goes back several generations in Australia, but his ancestors originally came from Ireland, Scotland and England (ancestor of John Gibson, c. 1601).", "Was offered the role of Eliot Ness in _The Untouchables (1987)_ (qv), but had to decline because he was already working on _Lethal Weapon (1987)_ (qv).", "He turned down the role of Harvey Dent/Two Face in _Batman Forever (1995)_ (qv), due to scheduling conflicts with _Braveheart (1995)_ (qv).", "Sold his home in Connecticut in July 2010 to settle his divorce with ex-wife Robyn.", "When _Apocalypto (2006)_ (qv) is finished, he plans to donate six replicas of Mayan pyramids and several movie-set villages.", "In early December 2004, he flew to Fiji, where he bought the 2,160 hectare island of Mago from a Japanese hotel chain for $15 million. He plans to turn the Pacific paradise, which is home to forty residents (mostly coconut farmers and their families) into his own personal retreat. The South Pacific island boasts two lagoons and stunning white-sand beaches. The sale was finalized in March 2005.", "Gibson has been widely perceived as a conservative Republican, even though he has never identified himself as such. In March 2004 he expressed doubts over the Iraq war, in particular the failure to find weapons of mass destruction, although he maintained that President 'George W. Bush' (qv) had \"done a lot of good\" elsewhere. At the People's Choice 'Awards' (qv) ceremony in January 2005, Gibson again condemned the Iraq war and praised the liberal director 'Michael Moore' (qv) and his documentary film _Fahrenheit 9/11 (2004)_ (qv). Many of Gibson's positions are in accordance with traditional Catholicism. He released a statement in March 2005 condemning the euthanasia of Terri Schiavo, and has criticized stem cell research.", "He was the original choice to play Jack Stanton in _Primary Colors (1998)_ (qv) but lost out to 'John Travolta' (qv).", "He was named after the Church of St. Mel in Clonmel, Co. Tipperary, Ireland where his mother's family is from.", "Was spoofed in both _South Park (1997)_ (qv) and _Family Guy (1999)_ (qv), and both of the times he was spoofed, there was a reference to the Looney Tunes cartoons. In _South Park: The Passion of the Jew (2004)_ (qv), his character acts a lot like Daffy Duck in the cartoon _Yankee Doodle Daffy (1943)_ (qv), while scaring Stan and Kenny, in the hopes that they will both torture him. And in the _Family Guy: North by North Quahog (2005)_ (qv), he chases Peter and Lois Griffin to the top of Mount Rushmore and is tricked into walking off a ledge, to which he plummets to the ground, very much like Wile E. Coyote does in several cartoons.", "Separated from wife Robyn in June 2006. She finally filed for divorce in April 2009 but it wasn't finalized until December 2011, reportedly because it took them all that time to divide Gibson's estimated assets of $850 million. It is considered the biggest divorce payout in Hollywood history.", "His performance as \"Mad\" Max Rockatansky in the \"Mad Max\" trilogy is ranked #78 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "_Braveheart (1995)_ (qv) is ranked #62 on the American Film Institute's 100 Most Inspiring Movies of All Time.", "Ranked #17 on Premiere's 2006 \"Power 50\" list. Had ranked #15 in 2005.", "Turned down the role of Sgt. 'John McLoughlin' (qv) in _World Trade Center (2006)_ (qv) to direct _Apocalypto (2006)_ (qv) instead.", "On July 28, 2006, he was arrested for drunk driving in Malibu, California. He did three-year probation following the misdemeanor drunken driving arrest in which he made derogatory comments about Jews and women.", "On the 1st of August 2006, he checked himself into a recovery program for alcohol abuse. His wife, Robyn, separated from him that same month.", "Pleaded no contest to DUI on 17 August 2006 and was ordered to attend one year of Alcholics Anonymous meetings. For the first four-and-a-half months, he must attend those meetings five times a week, and for the remainder of the time, he must attend three times a week. Gibson was also ordered to pay $1200 in fines and penalties and $100 in restitution.", "Father-in-law of 'Kenny Wayne Shepherd' (qv).", "Played a pilot in four movies: _Bird on a Wire (1990)_ (qv), _Air America (1990)_ (qv), _Forever Young (1992)_ (qv) and _Ransom (1996)_ (qv).", "Has bipolar disorder.", "Moved to Sydney, Australia at age 12 with his family.", "Received the Chairman's Visionary Award from Latin Business Association Chairman Rick Sarmiento during the 2006 Latino Global Business Conference and Digital Expo in Beverly Hills, California, on 2 November 2006. Gibson's appearance marked his first public appearance since his DUI arrest on 28 July in Malibu.", "Director 'Martin Scorsese' (qv) sent him the script for _The Departed (2006)_ (qv), offering him the role of Ellerby. Gibson was unable to accept the role as he was starting production on _Apocalypto (2006)_ (qv) that same year. 'Alec Baldwin' (qv) later took the role.", "'Oliver Stone' (qv) has tried casting him twice. Once as 'Jim Garrison' (qv) in _JFK (1991)_ (qv), and another time as Sgt. 'John McLoughlin' (qv) in _World Trade Center (2006)_ (qv).", "Cited as America's Favorite Movie Star in Harris Polls conducted in 1996 and 2003.", "A chain smoker for most of his career, in 2004 Gibson's wife persuaded him to limit his addiction to just three cigarettes a day. However this did not last.", "Turned down the role of Kyle Reese in 'James Cameron' (qv)'s _The Terminator (1984)_ (qv).", "Actor 'Girard Swan' (qv) formerly worked as his stand in and photo double.", "Was considered for the role of Robert Clayton Dean in _Enemy of the State (1998)_ (qv).", "On 27 January 1997, nine lesbian and gay filmmakers met with Gibson on the set of _Conspiracy Theory (1997)_ (qv). Conceived and sponsored by GLAAD, the day long event gave the filmmakers the opportunity to meet with director 'Richard Donner' (qv), producer 'Joel Silver' (qv), and co-stars 'Patrick Stewart' (qv) and 'Julia Roberts' (qv). A 40-minute lunch with Gibson, however, found the filmmakers not only discussing the inner workings of the industry but also Gibson's troubled relationship with the lesbian and gay community.", "Endorsed the Republican candidate for lieutenant governor of California in the 2006 mid-term elections.", "In interviews promoting _The Passion of the Christ (2004)_ (qv), Gibson admitted that depression had led him to contemplate suicide, and that he made the film to \"heal\" himself.", "Along with 'Rolf Harris' (qv) and 'Clive James' (qv), Gibson publicly supported keeping 'Queen Elizabeth II' (qv) as head of state in an Australian poll in 1999.", "Voted the most powerful Christian in Hollywood in a poll by religious website Beliefnet.com in October 2007.", "He was awarded the honorary A.O. (Officer of the Order of Australia) in the 1997 Queen's Birthday Honours List for his services to the Australian film industry.", "In April, 2009, made a first public appearance together with his girlfriend, 'Oksana Grigorieva' (qv) who was then three-months pregnant with his child.", "Due to the worldwide recession in 2008, his personal fortune is reported to have declined from around $900 million to $650 million.", "He and 'Oksana Grigorieva' (qv) became the parents of a girl, Lucia, on October 30, 2009, in Los Angeles.", "_Mad Max 2: The Road Warrior (1981)_ (qv) (aka The Road Warrior) is his favorite out of the \"Mad Max\" series.", "Turned down the chance to voice a parody of himself in the _\"Family Guy\" (1999)_North by North-Quohag_. He later admitted in an interview that he regretted the decision because he thought the episode was hilarious.", "Split from 'Oksana Grigorieva' (qv) [April 14, 2010].", "Has been under restraining order since July, 2010, after an episode of domestic violence with his then girlfriend, 'Oksana Grigorieva' (qv). In return, he filed for a restraining order against ex-girlfriend 'Oksana Grigorieva' (qv). (June 2010).", "Was investigated for domestic violence by Malibu/Lost Hills station detectives, in reference to an incident between him an ex-girlfriend 'Oksana Grigorieva' (qv) on January 6, 2010. [July 2010]", "Appeared on the cover of GQ magazine four times: June '83, February '87, May '95 and November '96 (with 'Jerry Seinfeld' (qv) and 'Michael Jordan' (qv)).", "His mother was born in County Longford, Ireland and his father was born in Peekskill, New York. Mel's paternal grandmother, Eva Mylott, was an Australian contralto opera singer, whose own parents were Irish as well. Mel's paternal grandfather, John 'Hutton Gibson' (qv), was a wealthy American businessman from a family based in the American South; John was of mostly Irish descent, and also had English, Scottish, Scots-Irish (Northern Irish), and Welsh, roots.", "He was a mentor to the late actor 'Heath Ledger' (qv).", "According to fan magazines of the day, his father moved the family to Australia to lessen his sons' chances of serving in Vietnam.", "He turned down the role of John McClane in _Die Hard (1988)_ (qv).", "He was tested and rejected by 'Franco Zeffirelli' (qv) for the part of David Axelrod in _Endless Love (1981)_ (qv). However, Zeffirelli later cast him as the title character in _Hamlet (1990)_ (qv).", "He was considered to portray 'Henry Hill' (qv) in _Goodfellas (1990)_ (qv).", "Although he played 'Glenn Close' (qv)'s son in _Hamlet (1990)_ (qv), he is only nine years her junior in real life.", "Directed one Oscar nominated performance: 'Andrew Garfield' (qv) in _Hacksaw Ridge (2016)_ (qv).", "Is expecting his ninth child with girlfriend 'Rosalind Ross' (qv). It is the ninth child for him and the first child for her.[September 2016].", "Friends with 'Jodie Foster' (qv), and 'Robert Downey Jr.' (qv).", "Works with Survivor Mitzvah Project, a charitable group that brings emergency aid to Holocaust survivors in Eastern Europe.", "Has struggled with alcoholism.", "Of Clan Campbell or of Clan Buchanan or of Clan Macmillan."], "quotes": ["I like directing much better. It's more fun, that's all there is to it. It's essentially the same job, which is storytelling, but you have more control over the way you want to tell the story. It's a high. I love it.", "My fears: everything from being afraid that I'm going to run out of cream for my cornflakes right up to someone chopping my privates off.", "On his involvement in _Braveheart (1995)_ (qv) as actor, director and producer: \"If you're going to wear three hats, you'd better grow two more heads.\"", "There is no salvation for those outside the Church...I believe it. Put it this way. My wife is a saint. She's a much better person than I am. Honestly. She's like, Episcopalian, Church of England. She prays, she believes in God, she knows Jesus, she believes in that stuff. And it's just not fair if she doesn't make it, she's better than I am. But that is a pronouncement from the chair. I go with it.", "On his religious beliefs: \"I'm not a done deal. I'm a work in progress. I'm still extremely flawed.\"", "You can't live up to what people expect. Nobody can. But I guess that's my problem, not theirs.", "About the _The Passion of the Christ (2004)_ (qv): This movie is about faith, hope, love and forgiveness. Themes that are as important now as they were in Jesus' time.", "I wasn't exactly the most zealous keeper-of-the-flame, you know? I was a pretty wild boy quite frankly. Even now when I'm trying more than I was before, I still fail every day at some level, but that's being human.", "I'd like to be able to wake up early every morning, but I don't. I'd like to quit smoking. I'd like to never lose my temper. The list goes on and on. I'd even like to get dressed by myself, and not have other people watching me.", "I did a lot of crazy things so I'm surprised to be alive.", "On human embryonic stem cell research: \"I found that the cloning of human embryos will be used in the process and that, for me, I have an ethical problem with that. Why do I, as a taxpayer, have to fund something I believe is unethical?\"", "The fear mongering we depict in this film reminds me a little of President Bush and his guys. [on _Apocalypto (2006)_ (qv)]", "I feel a strange kinship with Michael [Moore]. They're trying to pit us against each other in the press, but it's a hologram. They really have got nothing to do with one another. It's just some kind of device, some left-right. He makes some salient points. There was some very expert, elliptical editing going on. However, what the hell are we doing in Iraq? No one can explain to me in a reasonable manner that I can accept why we're there, why we went there, and why we're still there.", "On his decision to cut a scene in which Caiaphas says \"his blood be on us and on our children\" soon Pontius Pilate washes his hands of Jesus: \"I wanted it in. My brother said I was wimping out if I didn't include it. But, man, if I included that in there, they'd be coming after me at my house. They'd come to kill me.\"", "Asked whether _The Passion of the Christ (2004)_ (qv) would be offensive to Jews today: \"It's not meant to. I think it's meant to just tell the truth. I want to be as truthful as possible. But when you look at the reasons Christ came, he was crucified - he died for all mankind and he suffered for all mankind. So that, really, anyone who transgresses has to look at their own part or look at their own culpability.\"", "Vatican II corrupted the institution of the church. Look at the main fruits: dwindling numbers and pedophilia. - Time, January 27, 2003.", "I might go and go somewhere no-one can find me. You know where that is? You know where the place is no-one can find you? I was thinking of pitching my tent right next to the weapons of mass destruction. Then no-one would find me.", "I got to a very desperate place. Very desperate. Kind of jump-out-of-a-window kind of desperate. And I didn't want to hang around here, but I didn't want to check out. The other side was kind of scary. And I don't like heights, anyway. But when you get to that point where you don't want to live, and you don't want to die, it's a desperate, horrible place to be. And I just hit my knees. And I had to use _The Passion of the Christ (2004)_ (qv) to heal my wounds.", "Asked whether his opposition to abortion and support for capital punishment makes him feel isolated in Hollywood: \"Some kind of a dinosaur? No, you know you have to have these opinions about these things. I'm pretty firm on stuff like that. I don't feel like I'm howling in a hurricane. I just try to do my bit the way I think it should be done.\"", "\"I probably sound like some egotist, you know, saying that the Roman Church is wrong, but I believe it is at the moment, since Vatican II.\" (1990)", "Opposition to _The Passion of the Christ (2004)_ (qv) kind of put me back on my heels a little bit ... I expected some level of turbulence because when one delves into religion and politics - people's deeply held beliefs -- you're going to stir things up ... But it was a surprise to have shots being fired over the bow while I was still filming, and then to have various loud voices in the press - people who hadn't seen the work - really slinging mud.", "Asked if he felt besieged by the opposition to _The Passion of the Christ (2004)_ (qv): Beseiged? No, not really. They're pretty pathetic actually. I sort of look at them now and feel sorry for them. They've given their best shot, they kind of came out with this mantra again and again and again, 'He's an anti-Semite, he's an anti-Semite, he's an anti-Semite, he's an anti-Semite.' I'm not. But they like to say that in newspapers. So it's kind of how those, anything repeated often enough slowly amalgamates into some sort of accepted truth.", "Obviously, nobody wants to touch something filmed in two dead languages. They think I'm crazy, and maybe I am. But maybe I'm a genius.", "There's something to do with the Federal Reserve that Lincoln did, Kennedy did and Reagan tried. I can't remember what it was. My dad told me about it. Everyone who did this particular thing that would have fixed the economy got undone. Anyway, I'll end up dead if I keep talking.", "My biggest weakness is that I'm excessive. Fortunately for everyone concerned, I'm not as excessive as I used to be.", "I think the Lethal Weapon movies contain my favorite performances. It sounds really crummy, I know, but although the work doesn't look hard, it's difficult to create effortless on screen.", "What worries me is that people will take this as fact. I'm not angry, per se, that it refutes everything I hold sacred, the foundations of my beliefs. _The Da Vinci Code (2006)_ (qv) is an admitted work of fiction but it cleverly weaves fact into maverick theories in a way that will appear plausible to some.", "To be certain, neither I nor my film is anti-Semitic. The Passion is a movie meant to inspire, not offend. My intention in bringing it to the screen is to create a lasting work of art and engender serious thought among audiences of diverse faith backgrounds, or none, who have varying familiarity with this story. If the intense scrutiny during my twenty-five years in public life revealed I had ever persecuted or discriminated against anyone based on race or creed, I would be all too willing to make amends. But there is no such record. Nor do I hate anybody - certainly not the Jews ... They are my friends and associates, both in my work and social life. Thankfully, treasured friendships forged over decades are not easily shaken by nasty innuendo. Anti-Semitism is not only contrary to my personal beliefs, it is also contrary to the core message of my movie ... For those concerned about the content of this film, know that it conforms to the narratives of Christ's passion and death found in the four Gospels of the New Testament ... This is a movie about faith, hope, love and forgiveness - something sorely needed in these turbulent times.", "I'm not a preacher, and I'm not a pastor. But I really feel my career was leading me to make _The Passion of the Christ (2004)_ (qv). The Holy Ghost was working through me on this film, and I was just directing traffic. I hope the film has the power to evangelize.", "[on his drunk driving relapse]: \"I acted like a person completely out of control when I was arrested and said things that I do not believe to be true and which are despicable. The arresting officer was just doing his job and I feel fortunate that I was apprehended before I caused injury to any other person. I disgraced myself and my family with my behavior and for that I am truly sorry. I have battled with the disease of alcoholism for all of my adult life and profoundly regret my horrific relapse.\"", "Hollywood is a factory. You have to realize that you are working in a factory and you're part of the mechanism. If you break down, you'll be replaced.", "The precursors to a civilization that's going under are the same, time and time again. What's human sacrifice if not sending guys off to Iraq for no reason?", "I'll always continue to work. I've never much depended on anyone but myself, as far as that goes. And, hey, I'm not under the illusion that everything's just going to be hunky-dory work-wise forever. I've never been under that illusion. Things could go away tomorrow.", "I was subjected to a pretty brutal public beating. The film came out and, you could have heard a pin drop. Not even the crickets weren't chirping. But the other thing I never heard was one single word of apology. I thought I dealt with that stuff. But the human heart can bear the scars of resentment, and it will come out when you're overwrought and you take a few drinks. - On the hostile critical response to _The Passion of the Christ (2004)_ (qv).", "My dad taught me my faith. I believe what he taught me. The man never lied to me in his life. People said, 'Well, he's just an old kook.' He's not an old kook. He's very intelligent. He's in complete possession of all his mental faculties. And if he says something he has a reason why he says it and he can back it up. Mensa wanted this guy, okay? He's very intelligent.", "They're not blameless in the Mideast conflict. Now when you're loaded the balance of how you see things comes out the wrong way. Let me be real clear, here. In sobriety here, in front of you, national television ... that I don't believe that Jews are responsible for all the wars in the world. I mean, that's an outrageous, drunken statement.", "\"Film-making is what I love now. I don't want to be the star of a movie anymore.\" (December 2006)", "I felt like sending 'Michael Richards' (qv) a note. I feel really badly for the guy. He was obviously in a state of stress. You don't need to be inebriated to be bent out of shape. But my heart went out to the guy. They'll probably torture him for a while and then let him go. I like him.", "[In response to winning more Oscars after his first]: \"It's a wonderful feeling, but I'm not gonna kill myself trying to win another one.\"", "I've been chased by automobiles doing dangerous things on the freeway. People have tried to spit on me. It's made me totally paranoid. One day a gay group confronted me. They had signs, they were screaming and frothing at the mouth - pure hatred. It was wild. - After making apparently homophobic remarks in a 1992 interview with a Spanish magazine.", "Everyone always presumes I'm a Republican. I'm not. I couldn't vote for either one of those guys in the last election. I looked at the pair of them and was like, 'What do you want to do - get punched or get kicked?' It was a terrible choice to have to make. So I found somebody else on the ballot who was an independent who I liked the sound of. I can't even remember his name.", "I am politically incorrect, that's true. Political correctness to me is just intellectual terrorism. I find that really scary, and I won't be intimidated into changing my mind. Everyone isn't going to love you all the time.", "I shouldn't have said it, but I was tickling a bit of vodka during that interview, and the quote came back to bite me on the ass. - On his controversial 1992 interview with a Spanish magazine.", "I had really good highs but some very low lows. I found out recently I'm manic depressive. (2002)", "It's a hard game and everybody gets knifed at some point. But what's become really clear to me is that it's not rocket science at the end of the day. I wish I had that youthful spring in my step I once had, but hopefully, in some ways, I'm a lot better as far as maturity goes. (2009)", "Some people said that in telling the story we messed up history. It doesn't bother me because what I'm giving you is a cinematic experience, and I think films are there first to entertain, then teach, then inspire. There probably were historical inaccuracies - quite a few. But maybe there weren't, who's to say, because there was very little history about the man. It wasn't necessarily authentic. In some of the stuff I read about him, he wasn't as nice as he was on film. We romanticised it a bit, but that's the language of film - you have to make it cinematically acceptable. Actually, he was a monster - he always smelled of smoke because he was always burning people's villages down. He was like what the Vikings called a 'berserker'. But we kind of shifted the balance a bit because somebody's got to be the good guy and somebody the bad guy, and every story has its own point of view. That was our bias. - On _Braveheart (1995)_ (qv).", "William Wallace was around 28 when he died and I was already ten years older than that, although at least my knees weren't wrinkly!", "When all's said and done, I did a pretty good hatchet job on my marriage. I'm to blame, if you're inclined to judge.", "Nobody is without sin. You have to try to make amends if you can. You have to shut up and move on and not whine about it. And you have to deal with it like a man. You've just got to accept your own culpability.", "I feel sorry for 'Tiger Woods' (qv). Why are we talking about this when we're sending 30,000 more troops to Afghanistan? He's being used as a diversion, and it just drives me crazy.", "I have aged. It's just a natural part of the holy human condition. What am I going to do? Get surgery? That just looks weird. Besides, that must hurt, so what's the point? I think I'm a lot better because maturity brings things out. I just wish I had that youthful spring again. But it's a trade-off, right?", "I did have bodyguards for a little while but it's a drag. If your number's up, its up. If I'm lying in bed and somebody comes into my room, I'll either wake up or I won't. And I'll either hit 'em with my big stick that I've got or my gun that I have stowed away... or they'll hit me. Look, in this day and age, you've got to be tooled up.", "I try and eat right but I don't work out much. I quit smoking so that's something in the right direction. I just don't do anything fun anymore. But that's dying, isn't it? You die in stages. You let things go in pieces. It's more than halfway through, right? Life's experiences, whether they be pleasant, unpleasant, torturous or excruciatingly wonderful and blissful, season you somehow and hopefully you learn from them. Isn't that what it's about?", "[on his return to acting after 8 years with _Edge of Darkness (2010)_ (qv)] I think any kind of hiatus one takes in an artistic journey is going to make a huge difference. The pause will inform the choices that you make. I kind of felt I was getting stale so being away for a while has been good.", "[on his infamous anti-semitic rant to police in 2006] It's said that I went into a rant, but I think it went on for about five words. I was drunk. It just turned into a big thing. I apologized profusely -- not once but three times. So what's the problem? It's four years ago. Do I need to apologize again?", "'Barack Obama' (qv) is a man with an impossible task on his hands. He got left a mess and I wish him all the best but I don't think he's going to fix it in five minutes and probably not in his entire tenure.", "[on why he temporarily quit acting after _Signs (2002)_ (qv)] I felt ham-fisted. 'M. Night Shyamalan' told me I was just doing too much. I looked around and I was the oldest guy on the set and I felt like the least sophisticated. I decided I needed to rethink everything. I got into this because I wanted to be good. I walked away because I don't know that I was bringing much new to anything. Another seven or eight years of living informs the choices one makes.", "You ask anybody what their number one fear is and it's public humiliation. Multiply that on a global scale and that's what I've been through. It changes you. What doesn't kill you makes you stronger. It's really that simple. You can't do anything but live in the moment and leave the future in the hands of providence and don't regret the past too much. Maybe just take a lesson from it.", "Feminists don't like me, and I don't like them. I don't get their point. I don't know why feminists have it out for me, but that's their problem, not mine.", "I've never treated anyone badly or in a discriminatory way based on their gender, race, religion, or sexuality - period. I don't blame some people for thinking that though, from the garbage they heard on those leaked tapes, which have been edited. You have to put it all in the proper context of being in an irrationally, heated discussion at the height of a breakdown, trying to get out of a really unhealthy relationship. It's one terribly, awful moment in time, said to one person, in the span of one day and doesn't represent what I truly believe or how I've treated people my entire life.", "Depression is like that. It's somewhere one can be caught. You can get stuck there. Initially, it does stem from a certain amount of egotism. What does it do to everyone around in the family? It is an illness. It is a disease. And, I think there is a better understanding of it. A guy said to me one time, something really profound, and it's so simple. It's that depression lies. It's a liar and you have to shut it down. There is nothing that alleviates it more than going out and doing something for someone else. It's almost like instant healing. Get away from yourself. People can't even get out of bed and it gets really severe. I've never been at that stage. Everyone goes through low and high and low and high and some people are blessed to be created on an even keel all the way through - but not me.", "[on 'Jodie Foster' (qv)] You couldn't get two people who are more diametrically opposed on everything that they think about religion and politics than we do. But there's a core of goodness there that's undeniable, and I just love her.", "[on 'Steven Spielberg' (qv)] The first film of Steven's I saw was _Duel (1971)_ (qv). It was amazing. I was 19 and I went to see it and it was really, really compelling. And then there were all these stories: \"The guy made it for no money!\" I'm like, \"Wow, that's kind of brilliant.\" And it was really brilliant. He's a master - so many great films. One of the best he made, people hardly recognized him for it: _Empire of the Sun (1987)_ (qv). Phenomenal movie! The thing that bothered me about that was it seemed like nobody noticed, but it was this masterpiece! [2009]", "[on the Mad Max movies] I like the second one, The Road Warrior. It's a great film. It still holds up because it's so basic. It didn't require any dialogue. Let the film do the talking. It's about energy, it didn't spare anyone - a girl gets it, a dog gets it. It was the first Mad Max film but done better. The third one, Thunderdome, didn't work at all.", "[on the death of 'Robin Williams' (qv)] It's unspeakably sad. He was an exceptional human being, an extraordinary talent, and he had no equal. He set his own benchmark and people have aspired to hit it. I don't think anyone quite did.", "[on his sister applying to the Sydney National Institute of Dramatic Arts on his behalf] I was wandering around without a purpose. So she pointed me in the right direction. I thought \"What the hell else am I going to do\". There really wasn't much I wanted to do, and I'd never done anything like acting before. The first time I had to go on stage I was physically ill and couldn't stand up. My legs wouldn't support me. I had to do it sitting down. It was blind terror.", "We're all a bunch of different and contradictory bits. I'm no closer to explaining who I am than anyone else is.", "[on 'George Miller' (qv) and 'Peter Weir' (qv)] I kicked off my career working with two of the world's greatest from home. How come those guys were there? Of course at the time I didn't know who they were. But I realized pretty quickly they were special.", "I've never treated anyone badly or in a discriminatory way based on their gender, race, religion or sexuality - period. I don't blame some people for thinking that though, from the garbage they heard on those leaked tapes, which have been edited. You have to put it all in the proper context of being in an irrationally, heated discussion at the height of a breakdown, trying to get out of a really unhealthy relationship. It's one terribly awful moment in time, said to one person, in the span of one day and doesn't represent what I truly believe or how I've treated people my entire life.", "(On _The Year of Living Dangerously (1982)_ (qv)) \"I didn't necessarily see my role as a great challenge. My character was, like the film suggests, a puppet. And I went with that. It wasn't some star thing, even though they advertised it that way.\"", "(On whether he'll return to action roles) \"I think I'm too old for that, but you never know. I just like telling stories. Entertainment is valid and I guess I'll probably do it again before it's over. You know, do something that people won't get mad with me for.\"", "(On 'Peter Weir' (qv)) \"I'd auditioned for an earlier film and he told me right up front, 'I'm not going to cast you for this part. You're not old enough. But thanks for coming in, I just wanted to meet you.' He told me he wanted me for _Gallipoli (1981)_ (qv) a couple of years later because I wasn't the archetypal Australian. He had 'Mark Lee', the angelic-looking, ideal Australian kid, and he wanted something of a modern sensibility. He thought the audience needed someone to relate to of their own time.\"", "(On his character in _The Year of Living Dangerously (1982)_ (qv)) \"He's not a silver-tongued devil. He's kind of immature and he has some rough edges and I guess you could say the same for me.\"", "(On his domestic abuse allegations) I was allowed to end the case and still maintain my innocence. It's called a West Plea and it's not something that prosecutors normally allow. But in my case, the prosecutors and the judge agreed that it was the right thing to do. I could have continued to fight this for years and it probably would have come out fine. But I ended it for my children and my family. This was going to be such a circus. You don't drag other people in your life through this sewer needlessly, so I'll take the hit and move on.", "(On philanthropy) \"It gives you perspective. It's one of my faults, you tend to focus on yourself a lot. Which is not always the healthiest thing for your psyche or anything else. If you take a little time out to think about other people, it's good. It's uplifting.\"", "I had really good highs but some very low lows. I found out recently I'm manic depressive.", "\"Alcoholism is something that runs in my family. It's something that's close to me. People do come back from it, and it's a miracle.\" (1992)", "The whole notion of politics is they always present you with this or this or this. I'll get a newspaper to read between the lines. Why do you have to adhere to prescribed formulas that they have and people argue over them and they're all in a box. And you watch Fox claw CNN, and CNN claw Fox. Sometimes I catch a piece of the news and it seems insanity to me. I quietly support candidates. I'm not out there banging a drum for candidates. But I have supported a candidate and it's a whole other world. Once you've been exposed to it, once or twice or however many times, if you know the facts and see how they're presented, it's mind-boggling. It's a very scary arena to be in, but I do vote. I go in there and pull the lever. It's kind of like pulling the lever and watching the trap door fall out from beneath you. Why should we trust any of these people? None of them ever deliver on anything. It's always disappointing.", "(On _The Bounty (1984)_ (qv)) \"I think the main problem with that film was that it tried to be a fresh look at the dynamic of the mutiny situation, but didn't go far enough. In the old version, Captain Bligh was the bad guy and Fletcher Christian was the good guy. But really Fletcher Christian was a social climber and an opportunist. They should have made him the bad guy, which indeed he was. He ended up setting all these people adrift to die, without any real justification. Maybe he'd gone island crazy. They should have painted it that way. But they wanted to exonerate Captain Bligh while still having the dynamic where the guy was mutinying for the good of the crew. It didn't quite work.\"", "(On _The Man Without a Face (1993)_ (qv)) \"I read the script first and that's what I liked. The book is just - I'm sorry, but the guy did it. And you know, like, why? I just wanted to say something a lot more positive.", "(On making _The Bounty (1984)_ (qv)) \"I went mad. They would hold their breath at night when I went off. One night I had a fight in a bar and the next day they had to shoot only one side of my face because the other was so messed up. If you see the film, you can see the swelling in certain scenes.\"", "(On the controversy of _The Year of Living Dangerously (1982)_ (qv)) \"It wasn't really that bad. We got a lot of death threats to be sure, but I just assumed that when there are so many, it must mean nothing is really going to happen. I mean, if they meant to kill us, why send a note?\"", "(On _Lethal Weapon (1987)_ (qv)) \"This particular story was a cut above others I had passed on, because the action is really a sideline which heightens the story of these two great characters. I picture Riggs as an almost Chaplinesque figure, a guy who doesn't expect anything from life and even toys with the idea of taking his own. He's not like these stalwarts who come down from Mt. Olympus and wreak havoc and go away. He's somebody who doesn't look like he's set to go off until he actually does.\"", "I think I've scratched the surface after twenty years of marriage. Women want chocolate and conversation.", "[on _Braveheart (1995)_ (qv)'s portrayal of the Prince of Wales, which was called homophobic] I'm just trying to respond to history. You can cite other examples - Alexander the Great, for example, who conquered the entire world, was also a homosexual. But this story isn't about Alexander the Great. It's about Edward II.", "[on _Braveheart (1995)_ (qv)'s portrayal of the Prince of Wales] We cut a scene out, unfortunately. . . where you really got to know that character [Edward II] and to understand his plight and his pain. . . . But it just stopped the film in the first act so much that you thought, 'When's this story going to start?'", "(On his character in _The Patriot (2000)_ (qv)) \"I think I would have made him a slave holder. Not to seems kind of a cop-out.\"", "(On _The Passion of the Christ (2004)_ (qv)) \"This is a movie about love, hope, faith and forgiveness. He [Jesus] died for all mankind, suffered for all of us. It's time to get back to that basic message. The world has gone nuts. We could all use a little more love, faith, hope and forgiveness.\"", "I love women. They're the best thing ever created. If they want to be like men and come down to our level, that's fine.", "[on _Hamlet (1990)_ (qv)] I mean, it's a great story. It's got some great things in it. I mean, there's something like eight violent deaths.", "[on filming Braveheart] When you're an actor and when filming is done, you can go home, but when you're directing, you're only half way through.", "[on the definition of \"ultimate love\" while filming Hacksaw Ridge] putting your life on the line for the other by saving your fellow brothers in arms when bullets are flying by your head on the battlefield.", "[advice he would give his younger self]Don't be so caught up in the little things. Take advantage of all the gifts the world has to offer. Live every day to the fullest, and then Shut the fuck up", "I like telling stories where no one says anything. [Hollywood Reporter, 2017]", "[on The three E's of filmmaking: Entertain, to Educate and to Elevate]if you can do all three of these you'll be ok in Hollywood and in filmmaking", "[on the 2016 Presidential campaign and the issue of building a wall]the good news is soon it will be over, and the bad news is that one of those people will be elected, with all this talk about building walls, I think it's worth remembering that if you look at the service men in this country a lot of them have names like Ramirez, Hernandez and Rodriguez, and it's interesting that many of these men and women fight and die for this country die and some of them don't get their citizenship until after they're dead", "Things got shaken up a little bit and there is a lot of light being thrown into places where there were shadows and that is kind of healthy. It's painful, but I think pain is a precursor to change.", "It was an unfortunate incident. I was loaded and angry and arrested. I was recorded illegally by an unscrupulous police officer who was never prosecuted for that crime. And then it was made public by him for profit, and by members of - we'll call it the press. So, not fair. I guess as who I am, I'm not allowed to have a nervous breakdown, ever.", "There's no more fun things left. I just don't do anything fun anymore; but that's dying isn't it? I mean you die in stages. You let things go in pieces. It's mostly over halfway through. It is a hellish habit to break. Your neurons are involved. My mother smoked when I was in her womb. I first had one when I was 9 years old and I thought, 'Yes, I missed this!' I knew I missed it. And 45 years later, after every single artistic decision; every decision I'd ever made was done with a cigarette. To not have that is pretty hectic. It's worse than crawling the walls, which I did for a while.", "[on the Holocaust] I mean when the war was over they said it was 12 million. Then it was six. Now it's four. I mean it's that kind of numbers game.", "I'll quit smoking for about three months, then I have a cigarette or two. Because it is bad for you. There's something about a cigarette that gives one the feeling of well-being and confidence. That's because it raises your blood sugar level. To a child's sensibilities, they hear \"cigarettes,' \"cancer,' \"death'. And that's forgetting \"varicose veins.' They hear that, and it's so real to them, they worry. They see you, and it's like they're watching you die in front of them. It's frightening. So you can't do that to them; that's cruel.", "The Second World War killed tens of millions of people. Some of them were Jews in concentration camps. Many people lost their lives. In the Ukraine, several million starved to death between 1932 and 1933. During the last century, 20 million people died in the Soviet Union.", "Nobody wants to have their name, you know, besmirched on the front of newspapers and people say wicked things about them and their family and call them all sorts of names, accuse them of being anti-Semitic and everything else. I mean that's not part of my design. I don't enjoy experiencing that. That's just coming from some place that I have no control over.", "I've quit smoking again, it was torture. The first three days I was like an axe murderer, day four, I'd be ready to come at you with a baseball bat, day five, I was dangerous with a lawnmower - it is a hellish habit to break.", "Surely if I was really what they say I was, some kind of hater, there'd be evidence of actions somewhere. There never has been. I've never discriminated against anyone or done anything that sort of supports that reputation. And for one episode in the back of a police car on eight double tequilas to sort of dictate all the work, life's work and beliefs and everything else that I have and maintain for my life is really unfair.", "Now, maybe it was just that very day that Lebanon and Israel were at it, you know.", "Let me be real clear here, in sobriety, sitting here, in front of you, national television, that I don't believe that Jews are responsible for all the wars in the world. I mean that's an outrageous, drunken statement.", "The other place it may have come from is, you know, as you know, a couple of years ago I released the film Passion. Even before anyone saw a frame of the film, for an entire year, I was subjected to a pretty brutal sort of public beating. During the course of that, I think I probably had my rights violated in many different ways as an American. You know. As an artist. As a Christian. Just as a human being, you know.", "[on \"The Passion of the Christ\"] The film came out. It was released, and you could have heard a pin drop, you know. Even the crickets weren't chirping. But the other thing I never heard was one single word of apology.", "[on his father's controversial Holocaust remarks] We're talking about me right now. And me taking responsibility for my words and actions. And I'm certainly not going to use him, to sort of put anything off of me. It isn't the explanation for what happened that night. It isn't. It has nothing to do with it. That's in my own heart. I was taught that there are good and bad people of any race and creed, you know.", "Ten years have gone by. I'm feeling good. I'm sober, all of that kind of stuff, and for me it's a dim thing in the past. But others bring it up, which kind of I find annoying, because I don't understand why after ten years it's any kind of issue.", "Well, strictly speaking, that's, that's not true because it takes two to tango. What are they responsible for? I think that they're not blameless in the conflict. There's been aggression, and retaliation and aggression. It's just part of being in conflict, and being at war. So they're not blameless.", "After drinking alcohol on Thursday night, I did a number of things that were very wrong and for which I am ashamed. I drove a car when I should not have, and was stopped by the L.A. County sheriffs. The arresting officer was just doing his job and I feel fortunate that I was apprehended before I caused injury to any other person. I acted like a person completely out of control when I was arrested and said things that I do not believe to be true and which are despicable. I am deeply ashamed of everything I said. Also, I take this opportunity to apologize to the deputies involved for my belligerent behavior. They have always been there for me in my community and indeed probably saved me from myself. I disgraced myself and my family with my behavior and for that I am truly sorry. I have battled the disease of alcoholism for all of my adult life and profoundly regret my horrific relapse. I apologize for any behavior unbecoming of me in my inebriated state and have already taken necessary steps to ensure my return to health."], "salary history": ["_Summer City (1977)_ (qv)::$400 (Australian)", "_Mad Max (1979)_ (qv)::$15,000 (Australia)", "_Attack Force Z (1981)_ (qv)::$A1000 / Week", "_Gallipoli (1981)_ (qv)::$A35,000", "_Mad Max 2 (1981)_ (qv)::$120,000 (Australia)", "_The River (1984)_ (qv)::$500,000", "_Mad Max Beyond Thunderdome (1985)_ (qv)::$1,200,000 (Australia)", "_Air America (1990)_ (qv)::$7,000,000", "_Lethal Weapon 3 (1992)_ (qv)::$10,000,000", "_Maverick (1994)_ (qv)::$15,000,000", "_Ransom (1996)_ (qv)::$20,000,000", "_Conspiracy Theory (1997)_ (qv)::$20,000,000", "_Lethal Weapon 4 (1998)_ (qv)::$25,000,000", "_Chicken Run (2000)_ (qv)::£1,000,000", "_The Patriot (2000)_ (qv)::$25,000,000", "_We Were Soldiers (2002)_ (qv)::$25,000,000", "_Signs (2002)_ (qv)::$25,000,000"], "birth date": "1956-01-03", "birth notes": "Peekskill, New York, USA", "_actorID": "61", "_source": "IMDB", "actorID": "0000154", "created_utc_dt": "09/14/2019, 13:02:09"}