{"headshot": "https://m.media-amazon.com/images/M/MV5BMTUwNjQ0ODkxN15BMl5BanBnXkFtZTcwMDc5NjQwNw@@._V1_UY98_CR3,0,67,98_AL_.jpg", "birth name": "John Joseph Travolta", "height": "6' 2\" (1.88 m)", "mini biography": ["John Joseph Travolta was born in Englewood, New Jersey, one of six children of 'Helen Travolta' (qv) (née Helen Cecilia Burke) and Salvatore/Samuel J. Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta started acting appearing in a local production of \"Who'll Save the Plowboy?\". His mother, herself an actress and dancer, enrolled him in a drama school in New York, where he studied voice, dancing and acting. He decided to combine all three of these skills and become a musical comedy performer. At 16 he landed his first professional job in a summer stock production of the musical \"Bye Bye Birdie\". He quit school at 16 and moved to New York, and worked regularly in summer stock and on television commercials. When work became scarce in New York, he went to Hollywood and appeared in minor roles in several series. A role in the national touring company of the hit 1950s musical \"Grease\" brought him back to New York. An opening in the New York production of \"Grease\" gave him his first Broadway role at age 18. After \"Grease\", he became a member of the company of the Broadway show \"Over Here\", which starred 'The Andrews Sisters' (qv). After ten months in \"Over Here\", he decided to try Hollywood once again. Once back in Hollywood, he had little trouble getting roles in numerous television shows. He was seen on _The Rookies (1972)_ (qv), _Emergency! (1972)_ (qv) and _Medical Center (1969)_ (qv) and also made a movie, _The Devil's Rain (1975)_ (qv), which was shot in New Mexico. The day he returned to Hollywood from New Mexico, he was called to an audition for a new situation comedy series ABC was planning to produce called _Welcome Back, Kotter (1975)_ (qv). He got the part of Vinnie Barbarino and the series went on the air during the 1975 fall season.He starred in a number of monumental films, earning his first Oscar and Golden Globe nominations for his role in the blockbuster _Saturday Night Fever (1977)_ (qv), which launched the disco phenomenon in the 1970s. He went on to star in the big-screen version of the long-running musical _Grease (1978)_ (qv) and the wildly successful _Urban Cowboy (1980)_ (qv), which also influenced trends in popular culture. Additional film credits include the 'Brian De Palma' (qv) thrillers _Carrie (1976)_ (qv) and _Blow Out (1981)_ (qv), as well as 'Amy Heckerling' (qv)'s hit comedy _Look Who's Talking (1989)_ (qv) and 'Nora Ephron' (qv)'s comic hit _Michael (1996)_ (qv). Travolta starred in _Phenomenon (1996)_ (qv) and took an equally distinctive turn as an action star in 'John Woo' (qv)'s top-grossing _Broken Arrow (1996)_ (qv). He also starred in the classic _Face/Off (1997)_ (qv) opposite 'Nicolas Cage' (qv), and _The General's Daughter (1999)_ (qv), co-starring 'Madeleine Stowe' (qv). In 2005, Travolta reprised the role of ultra cool Chili Palmer in the _Get Shorty (1995)_ (qv) sequel _Be Cool (2005)_ (qv). In addition, he starred opposite 'Scarlett Johansson' (qv) in the critically-acclaimed independent feature film _A Love Song for Bobby Long (2004)_ (qv), which was screened at the Venice Film Festival, where both Travolta and the films won rave reviews. In February 2011, John was honored by Europe's leading weekly program magazine HORZU, with the prestigious Golden Camera Award for \"Best Actor International\" in Berlin, Germany. Other recent feature film credits include box-office hit-comedy \"Wild Hogs\", the action-thriller _Ladder 49 (2004)_ (qv), the movie version of the successful comic book _The Punisher (2004)_ (qv), the drama _Basic (2003)_ (qv), the psychological thriller _Domestic Disturbance (2001)_ (qv), the hit action picture _Swordfish (2001)_ (qv), the infamous sci-fi movie _Battlefield Earth (2000)_ (qv), based upon the best-selling novel by 'L. Ron Hubbard' (qv), and _Lonely Hearts (2006)_ (qv).Travolta has been honored twice with Academy Award nominations, the latest for his riveting portrayal of a philosophical hit-man in 'Quentin Tarantino' (qv)'s _Pulp Fiction (1994)_ (qv). He also received BAFTA and Golden Globe nominations for this highly-acclaimed role and was named Best Actor by the Los Angeles Film Critics Association, among other distinguished awards. Travolta garnered further praise as a Mafioso-turned-movie producer in the comedy sensation _Get Shorty (1995)_ (qv), winning the Golden Globe Award for Best Actor in a Motion Picture, Musical or Comedy. In 1998, Travolta was honored by the British Academy of Film and Television Arts with the Britanna Award: and in that same year he received the Lifetime Achievement Award at the Chicago Film Festival. Travolta also won the prestigious 'Alan J. Pakula' (qv) Award from the US Broadcast Critics Association for his performance in _A Civil Action (1998)_ (qv), based on the best-selling book and directed by 'Steven Zaillian' (qv). He was nominated again for a Golden Globe for his performance in _Primary Colors (1998)_ (qv), directed by 'Mike Nichols' (qv) and co-starring 'Emma Thompson' (qv) and 'Billy Bob Thornton' (qv), and in 2008, he received his sixth Golden Globe nomination for his role as \"Edna Turnblad\" in the big-screen, box-office hit, _Hairspray (2007)_ (qv). As a result of this performance, the Chicago Film Critics and the Santa Barbara Film Festival decided to recognize Travolta with a Lifetime Achievement Award for his role.In addition, Travolta starred opposite 'Denzel Washington' (qv) in 'Tony Scott' (qv)'s remake _The Taking of Pelham 123 (2009)_ (qv), and he provided the voice of the lead character in Walt Disney Pictures' animated hit _Bolt (2008)_ (qv), which was nominated for a 2009 Academy Award for Best Animated Feature Film and a Golden Globe for Best Animated Film, in addition to Best Song for John and 'Miley Cyrus' (qv)' duet titled, \"I Thought I Lost You\".Next, Travolta starred in Walt Disney Pictures' _Old Dogs (2009)_ (qv), along with 'Robin Williams' (qv), 'Kelly Preston' (qv) and 'Ella Bleu Travolta' (qv), followed by the action thriller _From Paris with Love (2010)_ (qv), starring opposite 'Jonathan Rhys Meyers' (qv). In 2012, John starred alongside 'Taylor Kitsch' (qv), 'Blake Lively' (qv), 'Aaron Taylor-Johnson' (qv), 'Benicio Del Toro' (qv), 'Salma Hayek' (qv), 'Emile Hirsch' (qv) and 'Demián Bichir' (qv) in 'Oliver Stone' (qv)'s, _Savages (2012)_ (qv). The film was based on 'Don Winslow' (qv)'s best-selling crime novel that was named one of The New York Times' Top 10 Books of 2010. John was most recently seen in _Killing Season (2013)_ (qv), co-starring 'Robert De Niro' (qv), and directed by 'Mark Steven Johnson' (qv). John recently completed production on the Boston-based film, _The Forger (2014)_ (qv), alongside Academy Award winner 'Christopher Plummer' (qv) and Critic's Choice nominee 'Tye Sheridan' (qv). John plays a second-generation petty thief who arranges to get out of prison to spend time with his ailing son (Sheridan) by taking on a job with his father (Plummer) to pay back the syndicate that arranged his release. John has received 2 prestigious aviation awards: in 2003, the American Institute of Aeronautics and Astronautics Foundation Award for Excellence for his efforts to promote commercial flying, and, in 2007, The Living Legends Ambassador of Aviation award.John holds 11 jet licenses: 747, 707, Gulfstream II, Lear 24, Hawker 1251A, Eclipse Jet, Vampire Jet, Canadair CL-141 Jet, Soko Jet, Citation ISP and Challenger. Travolta is the Qantas Airways Global Goodwill \"Ambassador-at-Large\" and piloted the original Qantas 707 during \"Spirit of Friendship\" global tour in July/August 2002. John is also a business aircraft brand ambassador for Learjet, Challenger and Global jets for the world's leading business aircraft manufacturer, Bombardier. John flew the 707 to New Orleans after the 2005 hurricane disaster bringing food and medical supplies, and in 2010, again flew the 707, this time to Haiti after the earthquake, carrying supplies, doctors and volunteers.John, along with his wife, actress 'Kelly Preston' (qv), are also very involved in their charity, The 'Jett Travolta' (qv) Foundation, which raises money for children with educational needs.::Kim Mills and Samantha Mast @ Rogers & Cowan"], "spouse": ["'Kelly Preston' (qv)::(12 September 1991 - present) ( 3 children)"], "trade mark": ["Cleft chin and razor-sharp cheekbones", "Often works some sort of dance into his roles", "New Jersey accent", "Dark hair with widow's peak", "Sparkling blue eyes"], "trivia": ["Ranked #21 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "He appeared on the cover of \"Rolling Stone\" magazine four times, the most for any actor (through 1994).", "He was named Man of the Year by Harvard's Hasty Pudding Club in 1981.", "'Richard Gere' (qv) practically owes his film career to Travolta. Travolta turned down the leads for _Days of Heaven (1978)_ (qv), _American Gigolo (1980)_ (qv), _An Officer and a Gentleman (1982)_ (qv) and _Chicago (2002)_ (qv), all of which went to Gere.", "'John Travolta' (qv) married 'Kelly Preston' (qv) twice. Their first wedding on September 5, 1991, by a French Scientologist minister, was declared illegal. The couple met during the filming of _The Experts (1989)_ (qv).", "'John Travolta' (qv) and 'Kelly Preston' (qv) had a son, 'Jett Travolta' (qv) (April 13, 1992 - January 2, 2009).", "His son, 'Jett Travolta' (qv), was conceived during a weekend at the home of 'Demi Moore' (qv) and 'Bruce Willis' (qv). (source: Premiere August 1996, p.60).", "Brother of 'Joey Travolta' (qv), 'Ellen Travolta' (qv), 'Ann Travolta' (qv), 'Margaret Travolta' (qv) and 'Sam Travolta' (qv).", "Was the youngest of six children of Salvatore Travolta and 'Helen Travolta' (qv).", "During the filming of _The Boy in the Plastic Bubble (1976)_ (qv), he fell in love with 'Diana Hyland' (qv), 18 years his senior. She died of cancer in his arms in 1977.", "Pilots a multitude of jet aircraft. Most notable aviation feat is successful landing at Washington National of a Gulfstream IIB with complete electrical failure. Conditions at the time were night, IMC, icing. [December 1993]", "Listed as one of twelve \"Promising New Actors of 1976\" in John Willis' Screen World, Vol. 28.", "In July 1978, he became the very first male to make the cover of McCall's magazine.", "He pilots three Gulfstream jets and a Learjet. Also owns a Boeing 707.", "(April 3, 2000) His second child with 'Kelly Preston' (qv), daughter 'Ella Bleu Travolta' (qv) was born, weighing in at 4.08 kilos (nine pounds).", "Read for the 'Tom Hanks' (qv) role in _Splash (1984)_ (qv) but was discouraged by his agent from doing the film.", "Was signed on to play rock star 'Jim Morrison' (qv) in an early 1980s biopic about 'The Doors' (qv). Due to legal problems, the project was dropped.", "Did yoga and boxing to cut his love handles for the film _Swordfish (2001)_ (qv).", "Was told to gain thirty pounds for his role in the movie _Primary Colors (1998)_ (qv).", "Owns homes in Santa Barbara, California; Ocala, Florida; Maine; and in his wife's home state of Hawaii. Main residence is in Ocala, Florida where he owns a large home, complete with airstrip for his planes.", "Hit #106 on the Billboard Singles Charts in 1977 with \"Slow Dancing (Feels So Good)\" (Midland Int. 10977).", "According to the documentary _We Get to Win This Time (2002)_ (qv), the producers of _Rambo: First Blood Part II (1985)_ (qv) considered teaming up 'Sylvester Stallone' (qv) with 'John Travolta' (qv) as Rambo's young partner in rescuing the American POWs. 'Sylvester Stallone' (qv) nixed this idea when he decided it would be better to make the film a solo project.", "Spent nine months learning how to dance to disco music while filming _Saturday Night Fever (1977)_ (qv).", "He owns (and is qualified to fly as second in command) a Boeing 707-138, appropriately registered N707JT, first built in 1964 for QANTAS of Australia. Recently he had the aircraft painted in its original QANTAS paint-job and took it on a worldwide promotional tour for QANTAS and, in return, was trained as a 747-400 first officer with Qantas.", "He has also worked as a musician and released several albums. He claims that he got all his inspiration from one song only; the instrumental song \"Dreamstreet\", a song by 'Patrick Rondat' (qv).", "While filming the movie _Blow Out (1981)_ (qv), he suffered from insomnia, which he had since he was a child waiting up for his mother to come home from late acting jobs. He learned to play the violin to calm his nerves.", "In October 2004, he starred in a series of television commercials for Sky TV (meant for Italian TV). Directed by 'Harald Zwart' (qv), the television commercials play as a sitcom, where 'John Travolta' (qv) - as himself - moves in with a working-class family because they have Sky.", "He was voted the 64th Greatest Movie Star of all time by Entertainment Weekly.", "Ranked #3 in TV Guide's list of \"TV's 25 Greatest Teen Idols\" (January 23, 2005 issue).", "Has published two books: \"'John Travolta' (qv) Staying Fit!\", published by Simon and Schuster in 1984, and \"Propeller One-Way Night Coach, A Fable for All Ages\", published by Warner Books in 1997.", "His first released record came out in 1976 when he had a Top 20 hit single, \"Let Her In\". When record producers saw him in _Welcome Back, Kotter (1975)_ (qv) singing \"Barbara Anne\", originally by 'The Beach Boys' (qv), they signed him.", "After the \"Grease\" album was released, he came out with a deluxe 2-record set called: \"Travolta Fever\", which was released in 1978.", "His favorite movie is _A Man and a Woman (1966)_ (qv). His favorite movie as a child was _Yankee Doodle Dandy (1942)_ (qv).", "During the 1970s, he frequently watched foreign films. One of his favorites was _La Strada (1954)_ (qv).", "'Oprah Winfrey' (qv)'s favorite movie star.", "Best friends with 'Kirstie Alley' (qv).", "He frequently eats at Denny's in the middle of the night. Which is where he ate through the movie _Lucky Numbers (2000)_ (qv).", "Was friends with 'James Cagney' (qv), 'Cary Grant' (qv) and 'Barbara Stanwyck' (qv).", "His favorite actor growing up was 'James Cagney' (qv).", "Turned down the roles: _Splash (1984)_ (qv), _Apollo 13 (1995)_ (qv) and _Forrest Gump (1994)_ (qv). 'Tom Hanks' (qv) was cast as the lead.", "Owned a three-bedroom beach front oceanfront estate, on Oahu in Hawaii from 1986-2005. He and his wife 'Kelly Preston' (qv) sold it to 'Kathy Ireland' (qv) for $3 million U.S. and she plans to rent the private residence out as one of several 'Kathy Ireland' (qv) Worldwide company vacation villas.", "Turned down several offers from the producers of _Chicago (2002)_ (qv) to play the role of Billy Flynn. 'Richard Gere' (qv) accepted the role and won a Golden Globe for his performance.", "Got the role of Vincent Vega in _Pulp Fiction (1994)_ (qv) primarily because 'Michael Madsen' (qv), the actor for whom the role was written, was unavailable due to a prior film commitment. Vincent was the brother of 'Michael Madsen' (qv)'s character Vic Vega (aka Mr. Blonde in _Reservoir Dogs (1992)_ (qv)) and the role jump-started his career after a long slump.", "His father was of Italian descent and his mother was of Irish ancestry. John's father, Salvatore/Samuel J. Travolta, was born in New Jersey, the son of Salvatore/Samuel Travolta and Giuseppina/Josephine Marsala. John's mother was born Helen Cecilia Burke, also in New Jersey, and was the daughter of Charles Frederick Burke and Mary Ellen Murphy.", "Was considered for the role of 'Jim Morrison' (qv) in 'The Doors' (qv) (1991). The role went to 'Val Kilmer' (qv) instead.", "His performance as Tony Manero in _Saturday Night Fever (1977)_ (qv) is ranked #73 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "On the _Saturday Night Live (1975)_ (qv) episode, Saturday Night Live: 'John Travolta' (qv)/Seal (1994), he parodied his _Welcome Back, Kotter (1975)_ (qv) character Vinnie Barbarino.", "His characters make mention of an 'Al Pacino' (qv) film in at least three of his films: _Saturday Night Fever (1977)_ (qv), _Get Shorty (1995)_ (qv) and _Swordfish (2001)_ (qv).", "Owns a home in Ocala, Florida because of his wife's intense love of horses.", "He lost 20 pounds for his role in _Saturday Night Fever (1977)_ (qv).", "Was strongly in the running to play Larry Meadows in _The Last Detail (1973)_ (qv), only losing the role to 'Randy Quaid' (qv) at the last minute. This would have been his big-screen debut.", "Is good friends with actor 'Forest Whitaker' (qv) who appeared with him in _Phenomenon (1996)_ (qv) and _Battlefield Earth (2000)_ (qv).", "Was among the guests at 'Tom Cruise' (qv)'s and 'Katie Holmes' (qv)' wedding ceremony in Italy.", "(April 2, 2007) On his return flight from Germany to New York, the actor was forced to make an emergency landing in his Boeing 707 at Ireland's Shannon Airport. He'd been promoting his new movie in Europe and encountered technical difficulties on his return flight. Fortunately for the actor, he was flying over Ireland at the time he first detected his private jet's engine problems and was safely diverted to Shannon on Ireland's west coast. Not allowing himself to be fazed by the whole ordeal, Travolta grounded his 34-seater and continued his flight home on a commercial airline.", "Friends with actor 'Billy Lockwood' (qv).", "In 1985, 'Princess Diana' (qv) asked him to dance at a party at the White House.", "For his acting, drew inspiration from 'James Cagney' (qv), 'Al Pacino' (qv), 'Robert De Niro' (qv) and others.", "Master of Ceremony at the Centennial of Flight Celebration at Kitty Hawk in December 2003, where he presented to John Glenn aviation's highest award.", "Has been the Ambassador for Qantas since 2001.", "He also owns an Eclipse 500 twin turbofan aircraft.", "Has appeared in _Hairspray (2007)_ (qv), opposite 'Michelle Pfeiffer' (qv), whose debut film was _Grease 2 (1982)_ (qv), the sequel to _Grease (1978)_ (qv), in which Travolta appeared.", "Has claimed his favorite director to work with was 'Sylvester Stallone' (qv), for _Staying Alive (1983)_ (qv). He said Stallone knew how to make him look the best on screen.", "Stated that one of his favorite places is Gander, Newfoundland, Canada.", "'Jett Travolta' (qv), his 16-year-old son, died following a seizure at the family's Bahamas holiday retreat on January 2, 2009.", "His publicist is 'Paul Bloch' (qv).", "He was offered the role of Melvin Udall in _As Good as It Gets (1997)_ (qv), which went to 'Jack Nicholson' (qv).", "Close friends with 'Dakota Fanning' (qv) and 'Robin Williams' (qv).", "Was considered for the role of Lester Burnham in _American Beauty (1999)_ (qv) but 'Kevin Spacey' (qv), who went on to win a Best Actor Oscar for his performance, was cast instead.", "He was offered 'Richard Gere' (qv)'s role in _An Officer and a Gentleman (1982)_ (qv), and opted to go to American Airlines' jet pilot school, instead.", "Owns a vacation home on a small island in Maine's Penobscot Bay. The secluded 20-room château, surrounded by acres of pines, overlooks the ocean and comfortably accommodates up to 50 guests. He bought it because Christmas is his favorite holiday, and he wanted a place big enough to house his extended family.", "Was married to 'Kelly Preston' (qv) on September 5, 1991 at the Hotel de Crillon in Paris in a private ceremony. A small orchestra performed the main theme from _A Man and a Woman (1966)_ (qv), Travolta's favourite French film.", "He was due to have played the lead role in The Double, an adaptation of 'Fyodor Dostoevsky' (qv)'s novel about a man whose life is taken over by his doppelganger. He was being paid $17m and shooting was to have started in Paris in June 1996. Just days before principal photography was due to begin, he flew back to the United States following an argument with the film's director, 'Roman Polanski' (qv), over alleged changes to the script and the film collapsed shortly afterwards.", "Lives in Los Angeles, California and Anthony, Florida.", "(May 18, 2010) John and his wife, 'Kelly Preston' (qv), are expecting their third child.", "He was inducted into the 2011 New Jersey Hall of Fame for his contributions to the Arts and Entertainment.", "Third child, a son named Benjamin, was born in a Florida hospital on November 23, 2010 at 8 lbs. 3 oz.", "Stepbrother-in-law of 'Chris Palzis' (qv).", "Son-in-law of 'Peter Palzis' (qv).", "On _Inside the Actors Studio: Episode #9.13 (2003)_ (qv), he listed _Going Places (1974)_ (qv) as his favorite movie.", "John and his wife, 'Kelly Preston' (qv), have the distinction of having both starred in movies based on 'Stephen King' (qv) novels, where the title of each was a girl's name which began with the letter \"C\". John starred in _Carrie (1976)_ (qv) and Kelly starred in _Christine (1983)_ (qv).", "In 1986, he was slated to co-star with 'Whoopi Goldberg' (qv) in a buddy/action-comedy called \"Public Enemies\", produced by the Cannon Group. In it, he would have played a disgruntled cop who is teamed up with a reckless young rookie, played by Goldberg, to uncover the whereabouts of a notorious mob figure. 'Bud Yorkin' (qv) was attached to direct. Even though it was heavily publicized at the Cannes Film Festival, funding fell through and the project was scrapped.", "Although he is often cast as Italian-American and is of Italian descent on his father's side, he has stated that his family was invested more in his mother's Irish ancestry, and he grew up mostly around Irish culture.", "Was good friends with the late 'James Gandolfini' (qv). His father sold tires to James' father.", "Speaks French fluently.", "He was awarded a Star on the Hollywood Walk of Fame at 6901 Hollywood Boulevard in Hollywood, California on June 5, 1985.", "In honor of his 60th birthday on February 18, 2014, there was a special singalong showing of _Grease (1978)_ (qv) at the Million Dollar Theater in Los Angeles. Before the start of the movie a video tribute from 'Olivia Newton-John' (qv) was played followed by a thank you video from 'John Travolta' (qv).", "Has starred in films that appear in both IMDb's Top 250 and IMDb's Bottom 100. The highest of his IMDb Top 250 film is at 5th position with _Pulp Fiction (1994)_ (qv). The lowest of his entry in IMDb's Bottom 100 is on 73th (number 27 from the bottom) with _Battlefield Earth (2000)_ (qv). [March 2014]", "He auditioned to play Jesus Christ in _Jesus Christ Superstar (1973)_ (qv), which went to 'Ted Neeley' (qv).", "When introducing 'Idina Menzel' (qv) at the 2014 Academy 'Awards' (qv), he mistakenly pronounced her name as \"Adele Dazeem\". The flub has since drawn a lot of attention and ridicule (including a Twitter account for Adele Dazeem). Travolta apologized to Menzel and sent her a bouquet of flowers.", "He turned down the role played by 'Johnny Depp' (qv) in _Nick of Time (1995)_ (qv).", "He presented the Oscar for Best Actor at the 55th Academy 'Awards' (qv) in 1983. The winner was 'Ben Kingsley' (qv) for _Gandhi (1982)_ (qv).", "Travolta selected _Yankee Doodle Dandy (1942)_ (qv) as his all-time favorite film as part of an AFI poll.", "Turned down the role of \"Dave Seville\" in _Alvin and the Chipmunks (2007)_ (qv).", "Was offered the role of the \"Green Goblin\" in _Spider-Man (2002)_ (qv).", "'Michael Jackson' (qv)'s song \"Wanna Be Startin' Somethin'\" (1983) was originally written for Travolta but ultimately ended up as Michael's own personal recording from his 1982 \"Thriller\" album. Travolta would later appear as one of several celebrity cameos in 'Michael Jackson' (qv): Liberian Girl (1989).", "In 2014 John received the International Indian Film Academy (IIFA) Award for Outstanding Achievement in International Cinema.", "John stars in three of the top 150 Greatest Movies of All Time, as listed by Empire Magazine: _Blow Out (1981)_ (qv) (#139), _Carrie (1976)_ (qv) (#86), _Pulp Fiction (1994)_ (qv) (#9) [August 2015].", "'John Travolta' (qv) was recently named one of the Most Valuable Actors of All Time, with the total gross of his films coming in at $4.3 billion.", "'John Travolta' (qv) has had 5 songs on the Billboard Hot 100 chart from 1976-1978: \"Grease Lightnin\" (#47), \"Whenever I'm Away From You\" (#38), \"All Strung Out On You\" (#34), \"Let Her In\" (#10), and \"You're the One That I Want\", which peaked at #1 and was on the chart for 24 weeks.", "10 of John's films have grossed over $100 million in the US: _Grease (1978)_ (qv), _Wild Hogs (2007)_ (qv), _Saturday Night Fever (1977)_ (qv), _Look Who's Talking (1989)_ (qv), _Hairspray (2007)_ (qv), _Bolt (2008)_ (qv), _Face/Off (1997)_ (qv), _Pulp Fiction (1994)_ (qv), _Phenomenon (1996)_ (qv) and _The General's Daughter (1999)_ (qv); 8 of these have grossed over $200 million worldwide.", "After starting his career on the TV show _Welcome Back, Kotter (1975)_ (qv), 'John Travolta' (qv)'s film career took off in the late 1970's with starring roles in _Saturday Night Fever (1977)_ (qv), which earned him an Oscar nomination for best actor in a leading role, and _Grease (1978)_ (qv). Adjusted for inflation, these remain the two highest-grossing films of Travolta's career.", "John was the winner of the Juno Award for International Single of the Year for \"You're the One That I Want\" in 1979.", "Turned down the leading role in _Forrest Gump (1994)_ (qv), a decision he later admitted was a mistake.", "Has a dance scene in nearly all of his films.", "He was the youngest of 6 children - 3 boys and 3 girls. and was nick named 'Bone' when young because he was long and lean.", "His father was a former semi pro footballer.", "Offered roles in the films 'Arthur', 'Splash' and ' An Officer and a Gentleman' but passed on them."], "quotes": ["[on his role in _Carrie (1976)_ (qv)]: I wanted to work with 'Brian De Palma' (qv). I knew the film would be interesting and attract a lot of attention.", "I have fame on the level of a 'Marilyn Monroe' (qv) or an 'Elvis Presley' (qv), but part of the reason I didn't go the way they did was because of my beliefs. People make judgments about Scientology, but often they don't know what they're talking about.", "There is nothing gay in this movie (_Hairspray (2007)_ (qv)). I'm not playing a gay man. Scientology is not homophobic in any way. In fact, it's one of the more tolerant faiths. Anyone's accepted.", "When they asked me to be Edna Turnblad I said, \"Gee, 32 years as a leading man -- why me? What makes you think I'd be the perfect woman?\".", "As you get older, you have to force yourself to have new dreams. For instance, I've been flying for 37 years but now teaching others to fly is interesting for me. Sometimes, you have to find new angles on life to keep you interested, like sharing successes and inspiring and helping others. You have to go out of your way to activate your dreams and keep them going in this third chapter of your life.", "[on his role as Edna in _Hairspray (2007)_ (qv)] It was tough dancing in high heels, but we did change the heels to more of a dance shoe - like a Capezio. You know they kept giving me these skinny high heels and it's like, \"Okay, I understand those. My mother wore those.\" However, when I was growing up and I saw girls in the chorus, they had a thicker heel and it was a dance shoe and I kept telling them to find those shoes. I knew they existed, and finally they brought out a shoe and I said, \"That's the shoe! Now make it in many colors.\".", "[on _Saturday Night Fever (1977)_ (qv)]: I love being regarded as a sex symbol, but I can't take it too seriously.", "[on how the late 'James Gandolfini' (qv) consoled him after the death of his son] James went out of his way to come to Florida and he would not leave Florida until I was okay, or he felt that I would be fine. After a week I said, 'Jim you can really, you can, you know, we'll be fine. I've got a lot of support here.' But the idea that in our profession someone would go out of their way and not want to leave you until he felt you were okay, that's the kind of soul that 'James Gandolfini' (qv) was. My father sold tires to his father. I was his inspiration to get into the business. He would see pictures of me on the wall from movies and he decided that he wanted to be an actor. He was a people person first and then everything else. He was this beautiful man and I love him very much.", "[on being cast in _Pulp Fiction (1994)_ (qv)] There was a rumor that a young new director who had directed a film called _Reservoir Dogs (1992)_ (qv) was quite interested in working with me. And his name was 'Quentin Tarantino' (qv). I said, \"Sounds good. He's talented. I saw the movie. I would love to meet him, too.\" After six or seven hours of hanging out, he verbally presented two ideas to me. One was the vampire movie _From Dusk Till Dawn (1996)_ (qv) and the other one was Pulp Fiction. I responded to Pulp Fiction but I didn't respond to From Dusk Till Dawn, and he noticed that. So at the end of the meeting he said, \"I'm curious. You seem to like the Pulp Fiction one, but you did not respond as much to the other.\" I said, \"Well, it's simple, Quentin. I'm just not a vampire guy.\".", "To be honest, I thought \"Pulp\" would have the same fate as _Reservoir Dogs (1992)_ (qv), meaning it would be an art house movie that would have a smaller audience. I never thought it would have a mainstream audience; I thought it was too unique of a movie to hit a commercial note. And when it did, it surprised all of us, I think, because we were going to be fine with it having the same success as Reservoir Dogs. But that it would become _Forrest Gump (1994)_ (qv) was a whole other idea.", "My best quality? The transparency in my eyes. I only have to think a thought and it's seen.", "I don't think I'm very cool as a person. I'm just better than anyone else at acting cool.", "[on dancing with 'Princess Diana' (qv) at the White House in 1985] There really was something lovely and girlish about her and I felt that I had taken her back to her childhood when she had probably watched _Grease (1978)_ (qv) and for that moment I was her Prince Charming.", "[on his plans for after the 2014 Oscars ceremony] I don't drink very much, but I wait until Oscar night to have my drinks. So now I'm ready to stay out until five in the morning. We're gonna do Vanity Fair, then we're gonna do Madonna's party, and we're gonna have fun tonight. I'm not gonna be happy until we see the sun rise.", "Every time I did an interview after _Moment by Moment (1978)_ (qv), they went right for the negative things first. I feel that the criticism after the film became abusive. It went beyond mere criticism. You would have thought Lily (Tomlin) and I had committed murder. I thought, my God, don't ever do a movie people don't like; they'll murder you.", "One's own life is not as colourful as a character that's created in a movie because they go through a million colours in a short period of time. In one's own life, it may take four years to go through those colours.", "[on the death of his teenage son Jett] The worst thing that's ever happened in my life. The truth is, I didn't know if I was going to make it. Life was no longer interesting to me, so it took a lot to get me better.", "[on the death of 'Robin Williams' (qv)] I've never known a sweeter, brighter, more considerate person than Robin. Robin's commitment as an artist to lifting our mood and making us happy is compared to none. He loved us all and we loved him back.", "[2014] My films have an interesting continuous effect. _Grease (1978)_ (qv) for some reason never went away. Do you know that to this day, every year, the Hollywood Bowl charges $275 a ticket to sit in an audience with a 36-year-old film and sing along to it? I've never heard of anything like that in my life. So there is some magic to that particular film. There's other films like _The Wizard of Oz (1939)_ (qv) and _Gone with the Wind (1939)_ (qv) that don't end either, but this has a continuous new audience, as opposed to, \"oh, that's an old movie\". No one looks at Grease as an old movie. It just keeps on living. That's how I view it, as a gift to the public and myself as an ongoing thing.", "[2014] In the old days, you didn't do a movie three times a year; you did a movie once every year and a half or every three years. You had a lot of time between films. I remember taking violin lessons, painting lessons, French lessons, you know, to fill my time. Otherwise you get in trouble. But the memories of all the films are wonderful.", "My mother was an acting teacher. She taught more of the existentialist style, which was that acting is believing that you're in the moment with the other actor, and I like that. I'm more comfortable portraying what I'm feeling at the moment and not knowing what I'm going to do next.", "I watched this Fellini movie when I was five called _La Strada (1954)_ (qv) and I said to my father: \"Why did 'Giulietta Masina' (qv) die?\" and he said: \"She died of a broken heart.\" \"You can die of a broken heart?\" He said: \"Yes, you can be so sad that you can die of a broken heart.\" \"Without being ill?\" He said: \"Yes!\" It changed my whole life. I never wanted to break anyone's heart, for sure! But it made me consider that. Most kids were considering other things; I was considering 'Giulietta Masina' (qv) in a Fellini film."], "salary history": ["_Pulp Fiction (1994)_ (qv)::$150,000", "_White Man's Burden (1995)_ (qv)::$500,000", "_Get Shorty (1995)_ (qv)::$4,250,000", "_Broken Arrow (1996)_ (qv)::$8,000,000", "_Phenomenon (1996)_ (qv)::$8,000,000", "_Michael (1996)_ (qv)::$12,000,000", "_Face/Off (1997)_ (qv)::$20,000,000", "_Mad City (1997)_ (qv)::$20,000,000", "_Primary Colors (1998)_ (qv)::$17,000,000", "_A Civil Action (1998)_ (qv)::$20,000,000", "_The General's Daughter (1999)_ (qv)::$20,000,000", "_Battlefield Earth (2000)_ (qv)::$10,000,000 + Profit Points", "_Lucky Numbers (2000)_ (qv)::$22,000,000 plus 20% of gross", "_Swordfish (2001)_ (qv)::$20,000,000", "_Basic (2003)_ (qv)::$15,000,000", "_Ladder 49 (2004)_ (qv)::$20,000,000", "_Be Cool (2005)_ (qv)::$20,000,000", "_Hairspray (2007)_ (qv)::US$14,000,000 including ca. US$3,000,000 prerequisites"], "birth date": "1954-02-18", "birth notes": "Englewood, New Jersey, USA", "_actorID": "53", "_source": "IMDB", "actorID": "0000237", "created_utc_dt": "09/14/2019, 13:02:01"}