{"headshot": "https://m.media-amazon.com/images/M/MV5BMjI0MTg3MzI0M15BMl5BanBnXkFtZTcwMzQyODU2Mw@@._V1_UY98_CR3,0,67,98_AL_.jpg", "nick names": ["Leo", "Lenny D"], "birth name": "Leonardo Wilhelm DiCaprio", "height": "6' (1.83 m)", "mini biography": ["Few actors in the world have had a career quite as diverse as 'Leonardo DiCaprio' (qv)'s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom _Growing Pains (1985)_ (qv) and low budget horror movies, such as _Critters 3 (1991)_ (qv), to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as _Romeo + Juliet (1996)_ (qv) and _Titanic (1997)_ (qv), to then become a leading man in Hollywood blockbusters, made by internationally renowned directors such as 'Martin Scorsese' (qv) and 'Christopher Nolan' (qv).Leonardo Wilhelm DiCaprio was born November 11, 1974 in Los Angeles, California, the only child of 'Irmelin DiCaprio' (qv) (née Indenbirken) and former comic book artist 'George DiCaprio' (qv). His father is of Italian and German descent, and his mother, who is German-born, is of German and Russian ancestry. His middle name, \"Wilhelm\", was his maternal grandfather's first name. Leonardo's father had achieved minor status as an artist and distributor of cult comic book titles, and was even depicted in several issues of American Splendor, the cult semi-autobiographical comic book series by the late 'Harvey Pekar', a friend of George's. Leonardo's performance skills became obvious to his parents early on, and after signing him up with a talent agent who wanted Leonardo to perform under the stage name \"Lenny Williams\", DiCaprio began appearing on a number of television commercials and educational programs.DiCaprio began attracting the attention of producers, who cast him in small roles in a number of television series, such as _Roseanne (1988)_ (qv) and _The New Lassie (1989)_ (qv), but it wasn't until 1991 that DiCaprio made his film debut in _Critters 3 (1991)_ (qv), a low-budget horror movie. While _Critters 3 (1991)_ (qv) did little to help showcase DiCaprio's acting abilities, it did help him develop his show-reel, and attract the attention of the people behind the hit sitcom _Growing Pains (1985)_ (qv), in which Leonardo was cast in the \"Cousin Oliver\" role of a young homeless boy who moves in with the Seavers. While DiCaprio's stint on _Growing Pains (1985)_ (qv) was very short, as the sitcom was axed the year after he joined, it helped bring DiCaprio into the public's attention and, after the sitcom ended, DiCaprio began auditioning for roles in which he would get the chance to prove his acting chops.Leonardo took up a diverse range of roles in the early 1990s, including a mentally challenged youth in _What's Eating Gilbert Grape (1993)_ (qv), a young gunslinger in _The Quick and the Dead (1995)_ (qv) and a drug addict in one of his most challenging roles to date, Jim Carroll in _The Basketball Diaries (1995)_ (qv), a role which the late 'River Phoenix' (qv) originally expressed interest in. While these diverse roles helped establish Leonardo's reputation as an actor, it wasn't until his role as Romeo Montague in 'Baz Luhrmann' (qv)'s _Romeo + Juliet (1996)_ (qv) that Leonardo became a household name, a true movie star. The following year, DiCaprio starred in another movie about doomed lovers, _Titanic (1997)_ (qv), which went on to beat all box office records held before then, as, at the time, _Titanic (1997)_ (qv) became the highest grossing movie of all time, and cemented DiCaprio's reputation as a teen heartthrob. Following his work on _Titanic (1997)_ (qv), DiCaprio kept a low profile for a number of years, with roles in _The Man in the Iron Mask (1998)_ (qv) and the low-budget _The Beach (2000)_ (qv) being some of his few notable roles during this period.In 2002, he burst back into screens throughout the world with leading roles in _Catch Me If You Can (2002)_ (qv) and _Gangs of New York (2002)_ (qv), his first of many collaborations with director 'Martin Scorsese' (qv). With a current salary of $20 million a movie, DiCaprio is now one of the biggest movie stars in the world. However, he has not limited his professional career to just acting in movies, as DiCaprio is a committed environmentalist, who is actively involved in many environmental causes, and his commitment to this issue led to his involvement in The 11th Hour, a documentary movie about the state of the natural environment. As someone who has gone from small roles in television commercials to one of the most respected actors in the world, DiCaprio has had one of the most diverse careers in cinema. DiCaprio continued to defy conventions about the types of roles he would accept, and with his career now seeing him leading all-star casts in action thrillers such as _The Departed (2006)_ (qv), _Shutter Island (2010)_ (qv) and 'Christopher Nolan' (qv)'s _Inception (2010)_ (qv), DiCaprio continues to wow audiences by refusing to conform to any cliché about actors.In 2012, he played a mustache-twirling villain in _Django Unchained (2012)_ (qv), and then tragic literary character Jay Gatsby in _The Great Gatsby (2013)_ (qv) and 'Jordan Belfort' (qv) in _The Wolf of Wall Street (2013)_ (qv).DiCaprio is passionate about environmental and humanitarian causes, having donated $1,000,000 to earthquake relief efforts in 2010, the same year he contributed $1,000,000 to the Wildlife Conservation Society.::Pedro Borges"], "trade mark": ["Often appears in the films of 'Martin Scorsese' (qv)", "Often plays conflicted, tortured-by-their-own-demons characters, who need to deal with their past", "Often plays hard-edged anti-heroes", "Intense emotional acting style", "Often stars in period films or plays real-life individuals", "Frequently plays men who have suffered a loss or trauma", "Often plays characters who are ill-fated (e.g. The Quick and the Dead, Romeo + Juliet, Titanic, The Departed, The Great Gatsby etc.)", "Often plays troubled or twisted tycoons (The Aviator, The Great Gatsby, Django Unchained and The Wolf of Wall Street)", "Only uses his media presence for environmental or human rights causes."], "trivia": ["(April 16, 1999) While filming _The Beach (2000)_ (qv) off the coast of Thailand, Leonardo and others were swept off a camera boat by strong winds and waves. No one was injured.", "His first publicity spot was about MILK.", "In March 1998, he sued Playgirl magazine over plans to publish pictures -- including full frontal nudity -- of himself.", "Ranked #75 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Was considering starring in a movie about actor 'James Dean' (qv), but turned down the role because he felt he wasn't experienced enough to do the film. [1996]", "Auditioned for the role of Dick Grayson/Robin in _Batman Forever (1995)_ (qv), which went to 'Chris O'Donnell' (qv).", "Chosen by People Magazine as one of the 50 Most Beautiful People in the World. [1998]", "Younger stepbrother of 'Adam Farrar' (qv).", "He and his family funded a state-of-the-art computer center at the Los Feliz branch of the Los Angeles Public Library, which was rebuilt after the 1994 Northridge earthquake.", "A Manhattan appeals court decided to go ahead with a $45 million lawsuit against DiCaprio by actor and screenwriter 'Roger Wilson' (qv) for allegedly encouraging his friends in a street fight with Wilson over advances DiCaprio's friends made toward Wilson's girlfriend, 'Elizabeth Berkley' (qv), outside the midtown Manhattan restaurant Asia de Cuba in the early hours of May 4, 1998. In 2004, the lawsuit was dismissed. Judge Paula Omansky said the lawsuit could proceed against a fourth man, Todd Healy, who admitted to hitting Wilson, though Healy claimed the move was in self-defense when he thought he saw Wilson reaching for something, possibly a weapon. In dismissing the action against DiCaprio, the jurist said Healy never heard the actor's alleged remark, and therefore could not have been incited by it. [2000]", "At age 10, his agent advised him to change his name to a more American-friendly Lenny Williams. Needless to say, he did not follow that advice.", "Was initially set to star as Alan Jensen in _Harvard Man (2001)_ (qv), but the film's low budget could not afford to pay his salary, so he dropped out and 'Adrian Grenier' (qv) took the lead.", "Was initially cast as \"Patrick Bateman\" in _American Psycho (2000)_ (qv) - for which he was reputedly offered over $20 million - but had to drop out due to scheduling conflicts. 'Christian Bale' (qv) took the role instead.", "In January 1999, his lawyers filed an application to allow DiCaprio to copyright his own name.", "Attended Seeds Elementary School at UCLA where he took summer courses in performance art.", "Ranked #42 in Premiere's 2003 annual Power 100 List. Had ranked #74 in 2002 and #60 in 2001.", "Ranked #6 in Star TV's \"Top 10 Box Office Stars of the 1990s\" (2003).", "Childhood friends with 'Tobey Maguire' (qv) and the late 'Christopher Pettiet' (qv).", "When his camera went missing, he offered a substantial reward of many thousands of pounds for its return. [November 2003]", "Openly supported 'John Kerry' (qv) in the 2004 election. He went around 11 states and gave 20 speeches about the environment and how the Bush Administration has damaged it.", "Was offered the role of the porn star Dirk Diggler in _Boogie Nights (1997)_ (qv) at around the same time as he was offered his role in _Titanic (1997)_ (qv). The Dirk Diggler role eventually went to 'Mark Wahlberg' (qv).", "(December 23, 2004) Mentioned in an interview with 'Katie Couric' (qv) that while filming _The Aviator (2004)_ (qv), it brought back his own obsessive-compulsive disorder that he had as a child.", "He is an environmental conservationist and often advocates and supports natural causes.", "Was considered for the role of Peter Parker/Spider-Man in _Spider-Man (2002)_ (qv), which went to 'Tobey Maguire' (qv).", "Filed police charges after being attacked with a bottle by a Canadian ex-model while leaving a private party. Although the wound was very close to his jugular vein, it was not expected to delay production on his latest movie. [June 2005]", "Won the role of Arthur Rimbaud in _Total Eclipse (1995)_ (qv) after the death of actor 'River Phoenix' (qv) in 1993.", "'Robert De Niro' (qv) and 'Jack Nicholson' (qv) are his favorite actors.", "Was considered for the role of Anakin Skywalker for _Star Wars: Episode II - Attack of the Clones (2002)_ (qv), which went to 'Hayden Christensen' (qv).", "He and 'Jason Robards' (qv) received Oscar-nominations for portraying 'Howard Hughes' (qv). Robards played Hughes in _Melvin and Howard (1980)_ (qv) and Leonardo played him in _The Aviator (2004)_ (qv)", "Was originally cast in _The Good Shepherd (2006)_ (qv).", "Very good friends with actresses 'Kate Winslet' (qv) and 'Marion Cotillard' (qv) and actors 'Tom Hardy' (qv) and 'Vincent Gallo' (qv).", "He once said that playing Arnie in _What's Eating Gilbert Grape (1993)_ (qv) was \"the most fun I've ever had\".", "Has appeared on the television series _Parenthood (1990)_ (qv), in the role originally played by 'Joaquin Phoenix' (qv). In the original film, Phoenix's grandfather is played by 'Jason Robards' (qv), who, like DiCaprio, has played 'Howard Hughes' (qv).", "He purchased a 104-acre island off the coast of Belize in 2005 and plans to develop a resort with renewable energy sources. Purchase price for the island, Blackadore Caye, was estimated to be $1.75 million.", "Good friends with 'Lukas Haas' (qv), 'Mark Wahlberg' (qv) 'Kevin Connolly' (qv), and 'Alan Thicke' (qv).", "In 2006 in \"The Independent\", he named his ten favorite movies as: _Bicycle Thieves (1948)_ (qv), _Taxi Driver (1976)_ (qv), _Lawrence of Arabia (1962)_ (qv), _8½ (1963)_ (qv), _The Third Man (1949)_ (qv), _Yojimbo (1961)_ (qv), _Sunset Blvd. (1950)_ (qv), _The Shining (1980)_ (qv) and _East of Eden (1955)_ (qv).", "Was cast in the title role for 'Baz Luhrmann' (qv)'s doomed \"Alexander the Great\" project.", "In his childhood, he and his mother lived in poor neighborhoods in Los Angeles which he describes as \"Ghettos of Hollywood\".", "Early in his career he appeared as a contestant on a game show called \"Fun House\" where stunts were performed - his involved trying to catch fish in a small pool with only his teeth.", "Attended the Los Angeles Center for Enriched Studies and, later, John Marshall High School in Los Feliz. Other JMHS alums include 'Bo Barrett' (qv), 'Heidi Fleiss' (qv), 'Jonathan Park' (qv), 'Anne-Marie Johnson' (qv) and 'Julie Newmar' (qv). DiCaprio dropped out of Marshall High, but later earned his GED.", "Turned down 'Michael Pitt' (qv)'s role in _The Dreamers (2003)_ (qv) because he felt he was too old to play a twenty-year-old student.", "Was trained by renowned Hollywood Gun Coach 'Thell Reed' (qv), who has also trained such actors as: 'Brad Pitt' (qv), 'Val Kilmer' (qv), 'Edward Norton' (qv), 'Russell Crowe' (qv), 'Ben Foster' (qv) and 'Girard Swan' (qv).", "Has once said his favorite female performance is 'Gena Rowlands' (qv)' Mabel Longhetti in _A Woman Under the Influence (1974)_ (qv).", "Has said his two favorite performances are 'Robert De Niro' (qv)'s Travis Bickle in _Taxi Driver (1976)_ (qv) and 'James Dean' (qv)'s Cal Trask in _East of Eden (1955)_ (qv).", "'Martin Scorsese' (qv) is his favorite director.", "Named #36 on Empire Magazine's 100 Sexiest Movie Stars (2007).", "His German grandmother died at age 93 in August 2008.", "Has a Dutch song about him called \"Ik ben verliefd op 'Leonardo DiCaprio' (qv)/I'm in love with 'Leonardo DiCaprio' (qv)\" by Flemish girl band K3 ('Kathleen Aerts' (qv), 'Karen Damen' (qv), and 'Kristel Verbeke' (qv)).", "His father, 'George DiCaprio' (qv), is of German and Italian ancestry and is an underground writer, editor and distributor of comic books. His mother, 'Irmelin DiCaprio' (qv), is of German and Russian ancestry and a former legal secretary.", "In 1994, he became the seventh youngest actor ever to be nominated for an Academy Award for Best Supporting Actor at age 19. He was nominated for his performance in _What's Eating Gilbert Grape (1993)_ (qv).", "When he was a child, his favorite films were _Willy Wonka & the Chocolate Factory (1971)_ (qv), _Watership Down (1978)_ (qv), and _Bedknobs and Broomsticks (1971)_ (qv).", "Thanked by 'Blink-182' (qv) in the liner notes of their album \"Enema of the State\".", "Ranked #8 on VH1's 40 Hottest Hotties of the '90s.", "DiCaprio, along with 'Kate Winslet' (qv) and director 'James Cameron' (qv), publicly pledged to support the financial future of the last living Titanic survivor, Millvina Dean, after it was reported that she had been forced to sell her mementos to pay for nursing home bills. [May 2009]", "Bought 'Kate Winslet' (qv) an inscribed gold ring, after they finished filming _Revolutionary Road (2008)_ (qv) together. However, Winslet keeps the inscription a secret.", "Campaigned for the role of 'John Dillinger' (qv) in _Public Enemies (2009)_ (qv), but 'Johnny Depp' (qv) was cast in the role instead.", "He stated in a Rolling Stone interview that in his younger years his mother took him to Germany about 10 times to visit his grandmother.", "'Quentin Tarantino' (qv) considered casting Leo as SS Colonel Hans Landa in _Inglourious Basterds (2009)_ (qv), but he eventually chose 'Christoph Waltz' (qv) to play the role instead.", "Purchased a unit in Manhattan's new, eco-friendly Riverhouse development in Battery Park, paying $3,665,700. Other real estate holdings include: A 1765-square-foot house on Carbon Beach in Malibu that he purchased in 1998 for $1.6 million. A 2633-square-foot house in the Malibu Colony that he purchased in 2002 for exactly $6 million. A 4551-square-foot house in the Bird Streets area of Los Angeles' Hollywood Hills that he bought in late 1999 for $2,515,000. A 3980-square-foot house in the Bird Streets area of Los Angeles' Hollywood Hills (next door to the one mentioned above) that he purchased in the summer of 2003 for $3,780,000. A two-bedroom, 2374-square-foot contemporary-style oceanfront house in Malibu, California that he paid $6.350 million for in 2007. And in Las Vegas, he spent $1.5 million for two adjacent two-bedroom units at Las Vegas's Panorama Towers in 2004. [2008]", "His favorite actress of all time is 'Meryl Streep' (qv).", "Has been in a relationship with 'Bar Refaeli' (qv) twice. They began a relationship in December 2005, but separated in October 2007. However, they later reconciled in December 2007, only to separate again in May 2011.", "As a board member with World Wildlife Fund (WWF), he has traveled to such places as Bhutan, Nepal and Russia.", "While attempting to travel to St. Petersburg, Russia to attend the International Tiger Conservation Forum as a guest of the World Wildlife Fund (WWF), but he was held up not once, but twice by flights. The first, Delta Flight 30, which departed from JFK bound for Moscow, was forced to make an emergency landing back at JFK shortly after takeoff due to engine flame out and malfunction, later his replacement flight had to make an unscheduled landing in Helsinki, Finland to refuel due to strong winds over the Atlantic ocean that used up the plane's fuel. Prime Minister of Russia, Vladimir Putin, who hosted the event, acknowledged that a lesser man, \"could have read it as a sign - that it was not worth going,\" but instead Leo, who's late grandparents were Russian, made it to the summit and gained Putin's respect. The summit's aim is to double wild tiger populations worldwide from 3,500 to 7,000 by 2022. While in St. Petersburg, DiCaprio committed $1 million to WWF for urgent tiger conservation efforts through his Fund at the California Community Foundation. [November 2010]", "Has appeared three times on the cover of GQ magazine: December 2006, December 2008 and October 2011.", "Won the 2010 'Do Something' Award for his Haiti relief efforts and the television show \"Greensburg\".", "Has worked with numerous acclaimed directors: 'Martin Scorsese' (qv), 'Steven Spielberg' (qv), 'Woody Allen' (qv), 'Clint Eastwood' (qv), 'Ridley Scott' (qv), 'James Cameron' (qv), 'Christopher Nolan' (qv), 'Quentin Tarantino' (qv), 'Alejandro G. Iñárritu' (qv), 'Sam Mendes' (qv), 'Danny Boyle' (qv), 'Lasse Hallström' (qv), 'Baz Luhrmann' (qv), 'Sam Raimi' (qv), and 'Edward Zwick' (qv).", "'Kate Winslet' (qv) considers him the best actor of his generation.", "Celebrated his 37th birthday at New York City's Hotspot Avenue, which he rented out. Guests included pals 'Russell Simmons' (qv) and 'Bradley Cooper' (qv), and Leo's mother Irmelin. The party raised money for DiCaprio's various wildlife protection projects and disaster relief for Haiti. Moreover, his movie _J. Edgar (2011)_ (qv) was released to theaters in the United States and Canada on that same day. [November 2011]", "Owns a production company - Appian Way Productions.", "Is a staunch liberal Democrat who has been both personally and financially active in the campaigns and elections of 'Bill Clinton' (qv), 'Al Gore' (qv), 'John Kerry' (qv) and 'Barack Obama' (qv).", "Was named Commander of the Order of the Arts and Letters in France in the same day that 'Martin Scorsese' (qv) received the Legion of Honour. Recipients of the order are honored for their significant contribution to the enrichment of French culture. France's Culture Minister Renaud Donnedieu de Vabres described DiCaprio as an 'icon, little Hollywood prince, bad boy from Los Angeles, modern romantic hero, Peter Pan of American cinema'. [January 5, 2005].", "Was considered for the role of Roark Jr./ Yellow Bastard in _Sin City (2005)_ (qv), which went to 'Nick Stahl' (qv).", "(January 19, 2007) Attended _The Departed (2006)_ (qv) premiere in Tokyo, Japan.", "Attended the _Blood Diamond (2006)_ (qv) premieres in Madrid, Spain (January 26th) and London, England (January 23rd). [January 2007]", "American representative at Tiger Conservation Efforts At Russia Summit. Donated $1.000.000 to preservation of Asian Tiger. [November 2010]", "Attended the 2007 Cannes Film Festival in France. [May 2007]", "(November 4, 2008) Attended the _Body of Lies (2008)_ (qv) premiere in Rome, Italy.", "Attended the _Inception (2010)_ (qv) premiere in Tokyo, Japan. [July 2010]", "Attended the international premieres for _Catch Me If You Can (2002)_ (qv) in Paris, France (January 28th) and London, England (January 27th). [January 2003]", "(February 9, 2009) Attended the 59th Berlin International Film Festival.", "Attended the international premieres for _The Aviator (2004)_ (qv) in Madrid, Spain (January 11th) Paris, France (January 6th) and Rome, Italy (January 4th). [January 2005]", "(June 9, 2006) Attended the 2006 French Open in Paris, France.", "(October 15, 2006) Attended the 1st Annual Rome Film Festival in Italy.", "(January 19, 2009) Attended the London premiere of _Revolutionary Road (2008)_ (qv).", "Ranked #8 on Forbes list of Hollywood's Top Earning On-Screen Couples alongside 'Marion Cotillard' (qv) in 2012. They are the only couple from a non-franchise film: _Inception (2010)_ (qv), the film made $825 million at the global box-office.", "Bought a multi-million-dollar apartment, in Manhattan's Greenwich Village area, at 66 E. 11th Street. [November 2013]", "Optioned the 2013 biography of President 'Woodrow Wilson' (qv) by Pulitzer Prize-winner 'A. Scott Berg' (qv), and hopes to play the President himself. A previous biopic about the 28th U.S. president was made in 1944, but was a major failure with audiences despite being nominated for 10 Oscars, and being the costliest film ever made up to that point.", "Perhaps one of the most outrageous on-camera introductions ever given to a person (celebrity or otherwise) was the one co-host 'Tina Fey' (qv) bestowed on DiCaprio during the 2014 Golden Globes telecast when she asked the audience to give him the same type of warm welcome he's used to receiving from \"supermodels' vaginas.\".", "As of 2016, Leo has been nominated for 38 different awards (6 Academy 'Awards' (qv), 4 BAFTA 'Awards' (qv), 11 Golden Globe 'Awards' (qv), 9 Screen Actors Guild 'Awards' (qv), 7 Critics' Choice 'Awards' (qv) and 1 Emmy Award), but has only won 3 Golden Globes (the first was for _The Aviator (2004)_ (qv) in 2005, the second for _The Wolf of Wall Street (2013)_ (qv) in 2014 and the third for _The Revenant (2015)_ (qv) in 2016), 1 SAG Award (for The Revenant), 1 BAFTA award (for The Revenant) and 2 Critics' Choice awards (the first for The Wolf of Wall Street in 2014 and the second for The Revenant in 2016). He won his first Oscar for The Revenant on February 28, 2016, on his fifth acting nomination and 22 years after his first nomination for _What's Eating Gilbert Grape (1993)_ (qv).", "Mentioned in the song \"Eu Te Devoro\" by Brazilian singer/composer 'Djavan' (qv). [1998]", "The longest he has gone without an Oscar nomination is the 11 years between _What's Eating Gilbert Grape (1993)_ (qv) and _The Aviator (2004)_ (qv). His nomination for _The Wolf of Wall Street (2013)_ (qv) came 7 years after his previous nomination for _Blood Diamond (2006)_ (qv).", "As of 2018, has appeared in eight films that were nominated for the Best Picture Oscar: _Titanic (1997)_ (qv), _Gangs of New York (2002)_ (qv), _The Aviator (2004)_ (qv), _The Departed (2006)_ (qv), _Inception (2010)_ (qv), _Django Unchained (2012)_ (qv), _The Wolf of Wall Street (2013)_ (qv) and _The Revenant (2015)_ (qv). Of those, _Titanic (1997)_ (qv) and _The Departed (2006)_ (qv) are winners in the category. He was nominated for Best Actor in three of these: The Aviator, The Wolf of Wall Street and The Revenant (which he won).", "(December 26, 2012) Attended 'Kate Winslet' (qv) and Ned Rocknroll's wedding in a private ceremony in New York. He also gave the bride away.", "Ranked on Forbes' \"Highest-Paid Actors List\". He was ranked #5 in 2008, #5 in 2010, #1 in 2011, #2 in 2012, #6 in 2013, #4 in 2014 and #13 in 2015 - this year the list was changed from \"Hollywood's Highest-Paid Actors\" to \"The World's Highest-Paid Actors\", including actors who work in other countries.", "In 2012, he was featured on 'Kate Winslet' (qv)'s book \"The Golden Hat: Talking Back To Autism\", with celebrity self-portraits to raise awareness and support for autism.", "DiCaprio, 'Tilda Swinton' (qv), 'Marion Cotillard' (qv), 'Emma Thompson' (qv), 'Tom Hanks' (qv), 'Daniel Brühl' (qv), 'Jake Gyllenhaal' (qv) and 'Amy Adams' (qv) are the only actors to receive a Golden Globe, SAG, BAFTA and Critics' Choice Award nomination for the same performance and then fail to be Oscar-nominated for it: for their performances in _The Departed (2006)_ (qv), _We Need to Talk About Kevin (2011)_ (qv), _Rust and Bone (2012)_ (qv), _Saving Mr. Banks (2013)_ (qv), _Captain Phillips (2013)_ (qv), _Rush (2013)_ (qv), _Nightcrawler (2014)_ (qv) and _Arrival (2016)_ (qv), respectively.", "Attended amfAR Cinema Against Aids Gala in France [May 22, 2014].", "Attended FIFA World Cup Brazil 2014 opening ceremony in São Paulo, wearing a scarf with Brazil's flag. [June 12, 2014].", "Turned down the role of 'Steve Jobs' (qv) in 'Steve Jobs' (qv) (2015). 'Michael Fassbender' (qv) was cast instead.", "Hosted the first gala for the 'Leonardo DiCaprio' (qv) Foundation in Saint-Tropez, France on July 23, 2014. Over 500 guests attended the event, including 'Marion Cotillard' (qv), 'Jared Leto' (qv) and 'Bono' (qv). The event raised $25 million to help protect animals and plants from extinction.", "Turned down the role of Max in Disney's _Hocus Pocus (1993)_ (qv) in order to star in the indie flick _What's Eating Gilbert Grape (1993)_ (qv).", "Is named after Leonardo Da Vinci because he first kicked in his mother's womb when she saw Leonardo Da Vinci's artwork at the Uffizi Gallery, his artist father felt it was apt. His paternal grandfather's middle name happens to be Leon.", "Shares the 2015 Special Humanitarian Award with Veronica Grey for their environmental documentary _Worst Shark Attack Ever (2014)_ (qv). He was also awarded the Special Jury Award and Socially Responsible Conservationist Award for this project, from three different, relevant film festivals.", "Donated a Banksy painting from his art collection for the amfAR Gala charity auction in Cannes, where it fetched $1 million. The painting was introduced by 'Marion Cotillard' (qv) and 'Michael Fassbender' (qv). [May 21, 2015].", "Won the Socially Responsible Conservationist award from the New Media Film Festival for the environmental documentary _Worst Shark Attack Ever (2014)_ (qv).", "Possibly the only actor to play a character in almost every decade spanning the last 165 years.", "Outbid 'Paris Hilton' (qv) at a Cannes charity auction for a Chanel handbag, which he gave to his mother.", "After _The Wolf of Wall Street (2013)_ (qv), took a 2 year hiatus from acting, citing exhaustion. His next film _The Revenant (2015)_ (qv) will debut more than two years after _The Wolf of Wall Street (2013)_ (qv)'s release.", "Leo was born in L.A.'s Cedars-Sinai (4810 Sunset Blvd), a building that was later purchased by the Church of Scientology for its West Coast headquarters in 1976.", "While being interviewed by Entertainment Tonight at the red carpet of the 2016 Golden Globes, he stated that his long-time friend 'Kate Winslet' (qv) is his favorite actress in the industry and he would love to work with her again.", "DiCaprio and his _Shutter Island (2010)_ (qv) co-star 'Michelle Williams' (qv), have both appeared in Lassie productions. DiCaprio appeared in two episodes of _The New Lassie (1989)_ (qv) when he was 15 years old, while Williams made her film debut in _Lassie (1994)_ (qv), when she was 13.", "DiCaprio and his _Titanic (1997)_ (qv) and _Revolutionary Road (2008)_ (qv) co-star (as well as close friend), 'Kate Winslet' (qv), have been nominated for Oscars in the same year three times: in 2005 for _The Aviator (2004)_ (qv) (DiCaprio) and _Eternal Sunshine of the Spotless Mind (2004)_ (qv) (Winslet), in 2007 for _Blood Diamond (2006)_ (qv) (DiCaprio) and _Little Children (2006)_ (qv) (Winslet), and in 2016 for _The Revenant (2015)_ (qv) (DiCaprio) and 'Steve Jobs' (qv) (2015) (Winslet).", "Every time DiCaprio was nominated for the Best Actor Oscar, one of his co-stars was nominated in the Best Supporting Actor category for the same movie ('Alan Alda' (qv) in _The Aviator (2004)_ (qv), 'Djimon Hounsou' (qv) in _Blood Diamond (2006)_ (qv), 'Jonah Hill' (qv) in _The Wolf of Wall Street (2013)_ (qv) and 'Tom Hardy' (qv) in _The Revenant (2015)_ (qv)). 'Cate Blanchett' (qv) is his only female co-star to be nominated (and win) an Oscar for a movie in which she co-starred with him, for her performance in _The Aviator (2004)_ (qv), for which DiCaprio was nominated for Best Actor.", "DiCaprio and his _The Aviator (2004)_ (qv) co-star, 'Cate Blanchett' (qv), have been nominated for Oscars in the same year four times: in 2005 both of them were nominated for The Aviator; in 2007 for _Blood Diamond (2006)_ (qv) (DiCaprio) and _Notes on a Scandal (2006)_ (qv) (Blanchett); in 2014 for _The Wolf of Wall Street (2013)_ (qv) (DiCaprio) and _Blue Jasmine (2013)_ (qv) (Blanchett), and in 2016 for _The Revenant (2015)_ (qv) (DiCaprio) and _Carol (2015)_ (qv) (Blanchett). Blanchett won the Oscar in 2005 and 2014 and DiCaprio won in 2016.", "A 8-bit web-game titled \"Leo's Red Carpet Rampage\" was released in February 16, 2016 by British multimedia group The Line Animation. The game places a miniature animated 'Leonardo DiCaprio' (qv) in a never-ending quest to reach the end of the red carpet where his Oscar awaits him. It featured a series of challenges involving DiCaprio's career: paparazzis, the iceberg that sinks _Titanic (1997)_ (qv), the Quaalude overdose from _The Wolf of Wall Street (2013)_ (qv), the bear from _The Revenant (2015)_ (qv), his competitors for the Best Actor Oscar, write an acceptance speech, find the black nominee, etc. The game racked up 6,000 plays per minute two hours after the official launch and quickly spread around the world, inexplicably finding its largest audience in Russia.", "His first Oscar win in February 28, 2016 broke the internet and generated 440,000 Tweets per minute, making it the most-tweeted moment of an Oscars telecast ever, surpassing 'Ellen DeGeneres' (qv)' selfie from the 2014 ceremony.", "DiCaprio's first Oscar win was celebrated in Brazil's most famous street Avenida Paulista in São Paulo (the city's main boulevard) and at Avenida Atlântica in Copabana, Rio de Janeiro. Hundreds of people blocked streets in Mexico to celebrate his win.", "Fans in Russia's Republic of Yakutia donated their jewelry to craft an Oscar of their own for the actor. DiCaprio has been invited to the Russian Far East to receive the so-called 'Yakutian Oscar'. Around 1.4 kilograms of silver were collected and melted to make the Yakutian Oscar.", "His first agent refused to sign him in the beginning unless he would change his name to \"Lenny Williams\", saying that Leonardo Wilhelm DiCaprio was \"too ethnic\" to work.", "He has a total of 8 directors on his resume who have won an Oscar for Best Director: 'James Cameron' (qv), 'Woody Allen' (qv), 'Danny Boyle' (qv), 'Martin Scorsese' (qv), 'Steven Spielberg' (qv), 'Sam Mendes' (qv), 'Clint Eastwood' (qv), and 'Alejandro G. Iñárritu' (qv).", "Voluntarily surrendered several works of art worth millions of dollars and an Oscar statuette that once belonged to Marlon Brando to the U.S. Government, as part of its ongoing investigation into a money laundering operation connected to Malaysian prime minister Najib Razak.", "The paintings and photograph were reportedly gifts from Malaysian financiers connected to Riza Aziz, co-founder of Red Granite Pictures, the group that produced the DiCaprio-starring \"The Wolf of Wall Street.\" The Justice Department has been investigating whether Aziz assisted Prime Minister Razak, his father-in-law, in embezzling more than $4 billion. Some of that money was used to finance Red Granite, and several of the company's films.", "The surrendered items include: a Picasso painting, \"Nature Morte au Crane de Taureau,\" valued at more than $3 million; a Basquiat collage, \"Redman One,\" valued at at least $9 million; a Diane Arbus photograph valued at $750,000; and the Oscar Brando won for his performance in \"On the Waterfront.", "Rarely ever goes on talk shows except The Ellen Show.", "His birthday is Veterans Day.", "Is one of 14 actors to have won the Academy Award, BAFTA Award, Critics' Choice Award, Golden Globe Award and SAG Award for the same performance. The others in chronological order are 'Geoffrey Rush' (qv) for _Shine (1996)_ (qv), 'Jamie Foxx' (qv) for _Ray (2004)_ (qv), 'Philip Seymour Hoffman' (qv) for _Capote (2005)_ (qv), 'Forest Whitaker' (qv) for _The Last King of Scotland (2006)_ (qv), 'Javier Bardem' (qv) for _No Country for Old Men (2007)_ (qv), 'Daniel Day-Lewis' (qv) for _There Will Be Blood (2007)_ (qv) and _Lincoln (2012)_ (qv), 'Heath Ledger' (qv) for _The Dark Knight (2008)_ (qv), 'Christoph Waltz' (qv) for _Inglourious Basterds (2009)_ (qv), 'Colin Firth' (qv) for _The King's Speech (2010)_ (qv), 'Christopher Plummer' (qv) for _Beginners (2010)_ (qv), 'J.K. Simmons' (qv) for _Whiplash (2014)_ (qv), 'Sam Rockwell' (qv) for _Three Billboards Outside Ebbing, Missouri (2017)_ (qv), and 'Gary Oldman' (qv) for _Darkest Hour (2017)_ (qv).", "By many publications such as Variety, The Economist, The Atlantic, he is said to be the last true American \"movie star\", because he has remained the most bankable actor while eschewing genres such as superhero films.", "He is the fourth actor to portray the character of Jay Gatsby in a major motion picture released in cinemas. 'Warner Baxter' (qv) portrayed the character in _The Great Gatsby (1926)_ (qv), 'Alan Ladd' (qv) in _The Great Gatsby (1949)_ (qv), and 'Robert Redford' (qv) in _The Great Gatsby (1974)_ (qv).", "As of 2019, hasn't worked with a female director since _Total Eclipse (1995)_ (qv).", "One of his first TV appearances was \"Romper Room\". He got himself ejected from the set for being disruptive.", "Was rejected for the role of Hobie Buchannon on \"Baywatch\". In later years, DiCaprio considered this setback a blessing in disguise.", "In early 2014, CNN did a segment at the factory where the Oscar statue and nameplates are made. Presenter Ted Rowlands held 'Leonardo DiCaprio' (qv)'s nameplate leading people to assume CNN spoiled the big surprise, though voting hadn't even taken place yet. The award ended up going to Matthew McConaughey."], "quotes": ["The best thing about acting is that I get to lose myself in another character and actually get paid for it. It's a great outlet. As for myself, I'm not sure who I am. It seems that I change every day.", "People want you to be a crazy, out-of-control teen brat. They want you miserable, just like them. They don't want heroes; what they want is to see you fall.", "On working with 'Martin Scorsese' (qv) in _Gangs of New York (2002)_ (qv): He's a perfectionist, obsessed with detail. That's why he went over budget and over schedule.", "You can either be a vain movie star, or you can try to shed some light on different aspects of the human condition.", "It's a really obvious thing to say, but the more people know too much about who you really are, and it's a fundamental thing, the more the mystery is taken away from the artist, and the harder it is for people to believe that person in a particular role.", "On fame: As soon as enough people give you enough compliments and you're wielding more power than you've ever had in your life, it's not that you become an arrogant little prick, or become rude to people... but you get a false sense of your own importance and what you've accomplished. You actually think you've altered the course of history.", "I don't really have many extravagances. I don't fly private jets and I don't have bodyguards and I don't buy crazy things. I have a couple of houses here and there. I bought a very expensive watch, and I am going to buy a really expensive movie poster, the original for _The Thief of Bagdad (1940)_ (qv). I love movie posters.", "On turning 30: I kind of feel like the same person except more time has gone by. I hate to say that I feel like an adult now. I have to admit I wish I was still 18. After all, even through the time while I was representing that wild kid, I really wasn't. I was just living my life. I was just not making movies at the time.", "On 'Martin Scorsese' (qv): Martin has brought so much to the art form of film, and he is not the type of person who would be upset by not receiving an Oscar, although it is a practical joke that he has not won an Academy Award after all these years. Whatever opinions critics will have of _The Aviator (2004)_ (qv), I really think that this is a great piece of art: once again, he has made a great classic film.", "The great thing about turning 30 in this business is that you get to perpetuate being young or old as long as we want.", "On whether there are any aspects of fame he dislikes: You kidding? I feel very fortunate. A lot of people would love to be in my position. There are so many people out there who are suffering trillions of times more than I could ever suffer, and would love to be me. I am a lucky little bastard.", "Yes, I can play younger than my age. But I can play characters older than I am, too. I'm not an actor who can just play the kid.", "I think people read the tabloids because they want to see you eating a burger, or out of your makeup or doing something stupid because they just want to see that you're like everyone else. And that's okay. I don't want to catch myself anymore saying that my life is hard, because the good far outweighs the bad in my life. And it's easier to focus on those things, on the things that are important.", "You learn after you've been in the business for a while that it's not getting your face recognized that's the payoff. It's having your film remembered.", "I lived in Hollywood and, ironically, I didn't know you could just go out and get an agent and go on auditions and try and become an actor, I thought it was like a Masonic thing, like a blood line you had to belong to - until I was 13. Then I realised what you had to do. It is the one thing I know I want to do for the rest of my life.", "[on losing out on the Oscar to 'Jamie Foxx' (qv) during the 2005 Academy 'Awards' (qv)] I wasn't surprised that Jamie got the award. But I knew that cameras would be stuffed up my face so I had my response ready. Anyone who says they don't practice is a liar.", "I was behind a woman at the checkout counter who was looking at the magazines. She turned to me and goes, \"There he is again, that 'Leonardo DiCaprio' (qv). Don't you wish he'd just disappear?\" I said (to myself), this is the moment where I either go, \"Do you know who I am?\" or put my hat further down, pay for my corn-nuts and get out of there... I choose to avoid that. (2005)", "My first date was with a girl named Cessi. We'd had a beautiful relationship over the phone all summer long. Then she came home and we met to go out for the first time to the movies. When I saw her I was petrified. I couldn't even look her in the eye to talk to her.", "I don't know if I'm ever getting married. I'm probably not going to get married unless I live with somebody for 10 or 20 years. But these people took a chance and they did it. We don't have the guts that Romeo did.", "As a little kid growing up in Hollywood, I was called 'a little crazy'. And now I guess I'm still that way.", "I cheated a lot, because I just couldn't sit and do homework. I usually sat next to someone extremely smart.", "I like to help the whales, the otters, and the dolphins. When I'm acting and I take a break, the first thing on my list is spending time by the sea.", "My mom and I lived at Hollywood and Western, a drug-dealer and prostitute corner. It was pretty terrifying. I got beat up a lot. I saw people have sex in the alleys. I remember I was five years old, and this guy with a trench coat, needles and crack cornered me. Early on, seeing the devastation on my block, seeing heroin addicts, made me think twice about ever getting involved in drugs. It's evil. Once you take that step and experiment, drugs can take over your life. You are not yourself anymore. That's something I never wanted. I didn't have a lot of friends growing up. It was kind of just me and my parents. But because of them, the neighborhood did not have a bad effect on me. My dad introduced me to artists, and every few months we'd go to some hippie doo-dah parade as Mudmen in our underwear, carrying sticks and covered in mud. My mother did everything to get me into the best schools she could find.", "When a role for a young guy is being offered to me, I think of 'River Phoenix' (qv). It feels like a loss.", "When I was young, I used to have this thing where I wanted to see everything. I used to think, \"How can I die without seeing every inch of this world?\".", "On his life: What I would do in order to be popular was, I'd put myself on line and joke around and be funny, and I was always known as the crazy kid.", "'Bridget Hall' (qv) and I hung out for a week. The whole thing was blown out of proportion.", "[on marriage] I don't have the guts that Romeo did.", "On love: I like girls who are intelligent, somewhat funny, and pretty with a nice personality.", "It's a weird adjustment living alone, because you don't realize how much you really miss Mumsie until she's not there.", "Dark green is my favorite color. It's the color of nature and the color of money and the color of moss!", "I'm not really the quiet type, although some people think I am. But I'm the rebel type in the sense that I don't think I'm like everyone else. I try to be an individual.", "I'm absolutely clean. I've never tried anything. That's not a lie!", "I'm not the sort of person who tries to be cool or trendy. I'm definitely an individual.", "I don't have emotions about a lot of things. I rarely get angry, I rarely cry. I guess I do get excited a lot, but I don't get sad and enormously happy. I think a lot of people who talk about all that crap are lying. Right now I'm just trying to maintain happiness - that's all I really care about. Anyway, when you're my age and your hormones are kicking in, there's not much besides sex that's on your mind.", "I hate speaking in front of a large audience. I don't know where it came from... but its just this gut-wrenching fear of slipping up and doing something horrible.", "One of my passions is to meet people and then imitate them. I love doing that.", "I have the same problem as 'Edward Furlong' (qv). I'm so thin!", "I'm nothing like Romeo in real life.", "I'm shy, but when the time comes to be wild, I'm fun-loving, adventurous, and mysterious.", "It's tricky stuff. If you're not perfect in every film, then people say \"See, he was just lucky in one role.\".", "On his career: I admit I've done a few lousy roles in the beginning of my career, like my role in _Critters 3 (1991)_ (qv). But at that age, you'll do anything for attention!", "People want you to be a crazy out-of-control teen brat. They want you to be miserable, just like them. They don't want heroes. What they want is to see you fall.", "Everywhere I go, somebody is staring at me. I don't know if people are staring because they recognize me or because they think I'm a weirdo.", "People always like to make up stories. I am not planning on getting married. Then again, I might wake up tomorrow and decide to get married!", "If you hear of any incident about me - a fight, a change of clothes, a little extra gel in the hair, don't believe it till you talk to me.", "I hate being selected as 'Babe of the Month' and being called 'hunk'.", "Fame is not the worst thing. I went to dinner the other night, and the girls in the restaurant ignored me. It was so annoying.", "I insist on keeping a level head. I've maintained the same exact home life that I've had for 20 years. All I see is more people looking at me than before. But, you know, who cares? You just can't obsess yourself with this fame stuff.", "My God, no! I hate this whole hunk thing! I feel when I see myself in that, and these other cute faces, that I'm just part of this meat factory, like, \"Wow! Here's the hunk of the month! This month we're shoving 'Leonardo DiCaprio' (qv) down your throat! Isn't he cute. Let's put him on the cover and we'll sell so many more magazines...\" That's definitely not what I want to be, and I've tried real hard to get away from that whole situation.", "If you can do what you do best and be happy, you're further along in life than most people.", "The main thing for me right now is just to live my life with my family and friends. They treat me like Leo, not 'Leonardo, Master Thespian'. That's all I need to keep my sanity.", "The last thing I want to turn into is a fat Hollywood jerk. I was brought up without much money and I was happy. I don't think that I will strive for money or success and end up greedy or big-headed. That only leads to unhappiness. I can still be down-to-earth and do this job as long as I enjoy it.", "On success: I've just been jolting along from one film to another... Now, it's sort of a shock to realize what I've achieved.", "Portraying emotionally ill characters gives me the chance to really act.", "I'm just starting to scratch the surface of what makes me happy, and it has taken me a while to admit that acting like a child and a jerk is fun.", "On acting: Don't think for a moment that I'm really like any of the characters I play. That's why it's called acting.", "On _Titanic (1997)_ (qv): It was pretty disheartening to be objectified like that. I wanted to stop acting for a little bit. But it changed my life in a lot of ways, but at the same time, I can't say that it didn't give me opportunities. It made me, for the first time, in control of my career.", "[Told to thousands at the New Jersey concert for Live Earth] A consensus has emerged in our scientific community that global warming is no longer merely a theory but a reality, a crisis with truly global implications for planet Earth and all of us who share it.", "On working with 'Jack Nicholson' (qv) on _The Departed (2006)_ (qv): One table scene in particular, I remember coming in, we did it one way, and I remember Jack speaking to Marty ('Martin Scorsese' (qv)), saying that he didn't feel he was intimidating enough. And then, the next day we came in and the prop guy told me, \"Be careful, he's got a fire extinguisher, a gun, some matches, and a bottle of whisky!\".", "In this business nothing is as dangerous and as feared as loneliness. You shoot films in the most remote areas of the world; you're separated from your family and your friends. And at some point you're in your hotel room looking at yourself in the mirror and you realize how lonely you are and how far you are from leading a normal life. That is quite a punch in the gut.", "I respect Russian culture and Russian cinema, especially Eisenstein, (Andrei) Tarkovsky, and 'Sergei Parajanov' (qv).", "[on one of his favorite movies, _East of Eden (1955)_ (qv)] - I remember seeing the hunger in 'James Dean' (qv)'s eyes. I watched it five times in a row.", "I was 18 when I got to work with 'Meryl Streep' (qv). I remember going over my lines with her off-camera, looking at her and thinking to myself, \"What is going on here? How is this going to look good?\" Then when I sat in the theater, it was, \"Oh, my God, she's the only person who looks completely natural.\" Meryl may be the greatest actor in the world.", "[on filming one scene in _The Departed (2006)_ (qv) with 'Jack Nicholson' (qv) where the veteran actor wanted to take a few extra steps to make sure Leo seemed \"sincerely threatened\"] - I come on the set the next day and hear we're doing the scene over for lighting reasons. But then a prop guy comes over to me and says, \"Just to let you know, there were some props Jack asked for. I had to get him a fire extinguisher, a bottle of whiskey, a lighter, and a gun.\".", "Out of any actor, I can't think of anyone who's got more memorable moments in cinema than 'Jack Nicholson' (qv). Jack never takes a single line straight on. Never takes an emotion written in the script at face value. He brings terror into what you thought was supposed to be a light moment and makes a light moment out of a cutthroat vicious line. He flips everything on its side.", "[on not being comfortable with fame] - Just because you've done a good performance once, doesn't mean you're always going to be good. That's why some of the greatest actors in the world have gone a little bit nuts. They're saying to themselves, \"What happened? You used to love me?\" It's an easy trap to fall into. You just have to realize that when you're hot, you're hot, and when you're not, you're not.", "[on 'Martin Scorsese' (qv)] - If you'd asked me, at 16, the director I wanted to work with, it would have been Marty. Marty's not afraid to sit there for days on end just to get a scene right. Most important, I trust him, which makes my job as an actor a lot easier.", "[on working on _Shutter Island (2010)_ (qv)] - ... we explored what the mentally ill had to face in the days when mental hospitals were called insane asylums. It was really very traumatic, and I don't say that about a film very often. I went to places and unearthed some things that I didn't think I was capable of. It was like an emotional layer cake that just kept getting deeper and deeper.", "[on proving himself] - Probably the only thing I knew with complete clarity was that I wanted to be an actor. But there was a lot of rejection early on, and so it never felt like, Hey, I've got something here. There was always an element of me that needed to prove something to myself. It's something I don't want to get rid of, because it's what drives me. I'm never settled and I'm never satisfied.", "[on the nude scene in _Revolutionary Road (2008)_ (qv)] - 'Kate Winslet' (qv) is one of my dearest friends. We have the ultimate trust in each other and the best of intentions for what we want to do. I knew Kate before 'Sam Mendes' (qv) [her husband] even met her. So on the outside, it may seem strange to do a sex scene with a woman while her husband is directing. But it didn't feel that way to me.When the scene was about to start, Kate said, in front of the crew, \"Wait, wait, this is totally weird\". She turned to both Sam and I and said, \"Are you guys okay?\"We both looked at each other and said, Yeah, we're totally fine.She said, \"It's even weirder that you're both totally fine\".", "[on Scorsese versus Spielberg] - The only other person who knows as much about film as 'Martin Scorsese' (qv) is 'Steven Spielberg' (qv). People would always ask me, What are the differences between Spielberg and Scorsese? All I could find myself talking about was the similarities.", "[on risks and really growing up] - What you risk just to have thrills when you're in your twenties is absurd. It's all part of that process of doing things that are daring to be accepted by your peers - and it's absolutely insane. You can enter a never-ending vapid hole trying to catch the next exciting moment without ever stopping to appreciate it. It can be a never-ending process of chasing something that isn't there. I know it's a cliché, but I'm happy to be alive. I went skydiving and my chutes didn't open. Two of them.", "[on growing up] - The earliest memories I have are jumping up onstage before concerts in downtown L.A. and trying to get on the mic and break-dance, or do imitations of my mother's friends or my father's friends, or be a comic in class. I was the most insane child you can imagine, pretty intolerable to be around. High-octane energy all the time, never wanting to focus on schoolwork.", "[on fame after _Titanic (1997)_ (qv)] - It wasn't the era of penetrating Internet paparazzi that we have now. But my name wasn't me anymore. I was sort of this thing. Kate felt it, too. But a lot of the attention was on me because of the teenage girls who repeatedly went to see the movie. I had the blond hair, and I was Jack Dawson, this heroic figure.So I set up everything in my personal life to rebel against that image in order to strip it down. I had a lot of fun stripping it down. But ultimately, that knocked me a few rungs down the ladder.", "[on 'James Cameron' (qv)] - Jim knows exactly what he wants. Needless to say, when somebody felt a different way on the set of _Titanic (1997)_ (qv), there was a confrontation. Jim had it out with them right there in front of everybody. He lets you know exactly how he feels. But he's of the lineage of 'John Ford' (qv). He knows what he wants his film to be.I remember sitting in a theater after it was done and being in awe. He got what he wanted.", "[on the night 'River Phoenix' (qv) died] - When I was eighteen, 'River Phoenix' (qv) was far and away my hero. Think of all those early great performances - _My Own Private Idaho (1991)_ (qv). _Stand by Me (1986)_ (qv). I always wanted to meet him. One night, I was at this Halloween party, and he passed me. He was beyond pale - he looked white. Before I got a chance to say hello, he was gone, driving off to the Viper Room, where he fell over and died.That's a lesson.", "[on what surprised him about _Shutter Island (2010)_ (qv)] The thing that surprised me the most about this material is as many different genres that are mixed in, whatever 'Martin Scorsese' (qv) did stylistically with this film, at it's very essence it is a film about the human condition and human trauma and the dark side of who we are.", "[on his influence in Hollywood and producing] I am never going to act again, yeah (laughs). No, I have a production company that all stemmed from 10 years ago wanting to be able to develop my own material because I just wasn't finding things I got excited about. It all stemmed from _Gangs of New York (2002)_ (qv) and searching that out and saying, \"Well, if I was able to search this out and I got to be able to work with 'Martin Scorsese' (qv) on this project, there has got to be other projects out there that maybe the studios aren't paying attention to.\".", "[on being one of the industry's top earners and his thoughts on salaries given to A-list actors] Yes, I think it is absolutely justified. A lot of actors draw in a certain audience, it's the truth. You put 'Brad Pitt' (qv) or George Clooney or 'Johnny Depp' (qv) or all these guys who are able to finance movies because of their name. With somebody else it wouldn't possibly get the same attention... People who are able to bring in a certain audience deserve to get paid for that not just the studios.", "[on if _Shutter Island (2010)_ (qv) gave him any nightmares] - I never had nightmares. It took me back to the one time I really remembered my dreams because I usually don't. But when I used a nicotine patch when I was trying to quit smoking, I did have bloodcurdling nightmares of mass murders, and I woke up in the middle of the night and had to take the patches off. I guess I had moments like that in the film.", "[2010 - On relaxing outside films] I go out and have a drink every once in a while. Ooh, I know that's controversial, isn't it? I sometimes go on a vacation, too. I take what I do very seriously, and when I'm on the set that's all I focus on, so my vice is to hang out with my friends and talk about absolutely nothing of importance whatsoever and act like a complete idiot because I've got to filter out a lot of the serious stuff I'm dealing with all the time. It's like therapy to just be a complete idiot with my friends and it's fantastic.", "[on making _Shutter Island (2010)_ (qv)] Usually when I'm on a movie set, I'm able to detach myself from the process at the end of the day and go home and learn my lines for the next day, but this situation was a whole lot different. There were a couple of weeks when I was in a hole and it was the deepest I've ever gone with a character, emotionally.", "[on making _Inception (2010)_ (qv) and director 'Christopher Nolan' (qv)] I don't know what I'm supposed to say about it, but it's Chris Nolan delving into dream psychoanalysis and also making a high octane, action-filled, surreal film that is all spawned from his mind. He wrote the entire thing, and it all made sense to him. It didn't make much sense to us when we were doing it, and we had to do a ton of detective work to try to figure out what the movie was and what we were doing from day to day, but, thank God, we had somebody who knew what he was doing.", "(2010) These last couple of films have taken a lot out of me so I don't know what I'm going to do next. I have no idea and it's kind of a cool place to be. This year is going to be the year of really taking care of myself because I've reached 35 and I've taken a lot of things seriously, maybe too seriously at times, so I'm going to make sure that whatever I do next and whatever choices I make are really right for me. And we'll see where that takes me.", "[on filming in Mozambique for _Blood Diamond (2006)_ (qv)] Forget weather-wise. Condition-wise, there are a lot of hardships for the people that live in Mozambique, and there's a lot of situations going on with poverty and AIDS and unsanitary water. You name it. But the most intriguing thing I found about shooting in Mozambique was the triumph and adaptability of the human spirit: People were still filled with so much joy. They were literally dancing in the streets every night. It was an amazing thing to see.", "(2010) I want to be an actor just like my role models, 'Robert De Niro' (qv), for example. Being discreet in his private life has allowed him to be even more credible in different roles on the big screen.", "[on his post-_Titanic (1997)_ (qv) romantic life] - I had better success meeting girls before _Titanic (1997)_ (qv). My interactions with them didn't have all the stigma behind it, not to mention there wasn't a perception of her talking to me for only one reason.", "[on how he dealt with post-_Titanic (1997)_ (qv) youth] I got to be wild and nuts, and I didn't suffer as much as people do now, where they have to play it so safe that they ruin their credibility. I didn't care what anyone thought.It was also about avoiding the tornado of chaos, of potential downfall. My two main competitors in the beginning, the blond-haired kids I went to audition with, one hung himself and the other died of a heroin overdose... I was never into drugs at all. There aren't stories of me in a pool of my own vomit in a hotel room on the Hollywood Strip.", "During Gilbert Grape [_What's Eating Gilbert Grape (1993)_ (qv)] I didn't know where I was gonna go as an actor so I didn't know what types of movies I wanted to do. I just felt like doing a movie is doing a movie. I get money and fame, and that's great, and I can act and have fun. And I was up for a movie called _Hocus Pocus (1993)_ (qv) with 'Bette Midler' (qv), and I knew it was awful, but it was just like, \"Okay, they're offering me more and more money. Isn't that what you do? You do movies and you get more and more money.\" But something inside of me kept saying, \"Don't do this movie.\" And everyone around me was saying, \"Leonardo, how could you not take a movie?\" And I said to myself, \"Okay, I'll audition for this movie Gilbert Grape. If I don't get that, I'll do Hocus Pocus.\" I found myself trying so hard, investing so much time and energy in Gilbert Grape, I worked so damn hard at it and I finally got it, and it was like such a weight off my shoulders.", "(On landing _This Boy's Life (1993)_ (qv)) When I was fifteen, I got this amazing opportunity to audition for this plum role opposite 'Robert De Niro' (qv) and 'Ellen Barkin' (qv) in This Boy's Life. Before that, it was The New Lassie or a Bubble Yum commercial. They were using the mustard-jar scene in the audition. De Niro was going up to the kids with this almost empty mustard jar and cramming it into their faces, really pushing the kids' buttons. The scene was being used to see if the kid could stand up to De Niro, and it was hard not to be overwhelmed. When he started bludgeoning me, I completely overcompensated. He said, \"Is this empty? Is this empty?\" I slapped the jar out of his hand, got right up in his face, and screamed at the top of my lungs, \"Noooooooo!\" It was the most god-awful way to do the scene. I was supposed to be the victim, not the antagonizer, and there was complete silence. De Niro looks at me and goes, \"Heh, heh, heh, heh, heh\", in that way only De Niro can laugh. \"That was good. That was goooood. I like that. A little over-the-top but good\". My audition was supposed to go on, but they just stopped it. Even though De Niro said he liked it, I left the room thinking, Oh, shit, I'm a laughingstock. I'm buried. I'm done. Getting that part felt like winning the lottery. Sometimes you've got to go to the wrong place just to show that you're not afraid to go there.", "(2010) Probably the only thing I knew with complete clarity was that I wanted to be an actor. But there was a lot of rejection early on, and so it never felt like, Hey, I've got something here. There was always an element of me that needed to prove something to myself. It's something I don't want to get rid of, because it's what drives me. I'm never settled and I'm never satisfied.", "(2010) I was the most insane child you can imagine, pretty intolerable to be around. High-octane energy all the time, never wanting to focus on schoolwork.", "[on playing Jack Dawson in _Titanic (1997)_ (qv)] I'm not haunted by it but it certainly follows me. I've been to the Amazon and people with no clothes on - and I'm not exaggerating - know about that film. I've accepted it.", "When I can't immediately define the character and there's an element of mystery to it and still a lot to be explored, that's when I say yes. I like those kinds of complicated characters.", "There are a lot of pitfalls to success, and one is not listening to criticism. One of the the most important things you can do is hear criticism of yourself and embrace it, whether it be - in my case - artistic or personal.", "[on what drew him to portraying Jay Gatsby] The idea of a man who came from absolutely nothing, who created himself solely from his own imagination. Gatsby's one of those iconic characters because he can be interpreted in so many ways: a hopeless romantic, a completely obsessed wacko or a dangerous gangster, clinging to wealth.", "[on playing the plantation owner in _Django Unchained (2012)_ (qv)] There was absolutely nothing about this man that I could identify with. I hated him. It was one of the most narcissistic, self-indulgent, racist, horrible characters I've ever read in my entire life.", "You learn, after you've been in the business for a while, that fame is empty and pointless.", "[on _Charlie Rose (1991)_ (qv)] There's going to be a wider gap between the independent genre filmmaking and the big budget, sort of spectacle movies. And the movies that are a hybrid of those two things - that have deep content in them and that also have some scope - will kind of dissolve away. I see that happening more and more in the industry, it's either like: \"This is a regurgitation of films you've seen a thousand times that work... Or you can take a chance and do a really low budget, small movie and see how it turns out.\".", "[on _The Wolf of Wall Street (2013)_ (qv)] I think it's amazing somebody like 'Martin Scorsese' (qv) is still making films that are vital and talked about, and have an element of controversy about them and are appealing to people of my generation. We grew up watching his films and he's still making stuff that's punk rock. It's an amazing achievement.", "[on working with 'Martin Scorsese' (qv)] I grew up a fan of the Golden Age of cinema which, to me and all of my friends, was the '70s and the great age of films where the director had control. We got to see some of the most memorable films and performances of all time during that era and everything since then has always been a reversion and comparison back to those films. Any one of my friends, whenever we talk about movies, we always reference something from the '70s. And to me, the greatest cinematic partnership maybe of all time, and certainly of that time period, was De Niro and Scorsese. In a lot of ways, they were a part of my upbringing and my childhood, as far as being a fan of cinema. So to get to work with him, being of completely different generations -- we just have a shared understanding that we're out there to do the same thing. I think that's taken a while to truly understand on his part -- not a while but, I mean, it's been a culmination of more and more trust with one another. And, in a lot of ways, I think [_The Wolf of Wall Street (2013)_ (qv)] is the result of being able to work with each other on our films before it. We were not going to try to do something in a traditional sense in this film. We'd been given the opportunity to make a film that was going to hopefully be outrageous and daring and push the envelope a little bit. So it wasn't necessarily a dialogue about what type of movie we wanted to do after the experiences that we've had together. At this point, it was just about us reminding one another, with very specific character decisions or plot points. But, just to backtrack a little, I understand his mentality, too. You have to understand: This man is the greatest admirer of cinema as an art form of anyone you'll ever meet, and there's nothing in his life that he doesn't reference cinema to. He lives and breathes this. He's got such an admiration and appreciation for what's been done in the past. And he's got that hunger in him, as well, and that excitement for us to just be able to do the type of films that we want to do. The fact that, through the years now, we've trusted one another to know that we're not doing anything for our own self-interest -- it's more about making the best, most original movie we can -- has been an incredible experience for me. And I don't stop learning. I mean, every time I'm on set with him I learn more about the reason I make movies and the reason I'm an actor than anything I've ever done.", "[on getting awards attention for _The Wolf of Wall Street (2013)_ (qv)] Of course it would be meaningful. I think everyone wants to be recognized by their peers, absolutely, without question. But, the truth of the matter is you learn very quickly you have absolutely no control of what critics or audiences are going to think. You really just have to do everything you can to make the best film. That's the one thing that I do know. But, of course, you know, I would love for this film on all fronts to get some attention because there's only been two films in my entire career that I've really developed myself, really championed to get financed and got a director involved with, and that's been _The Aviator (2004)_ (qv) and this. And so, in a lot of ways -- and I hate to use the term -- those two are my \"babies.\" Those were the films that I really did everything I possibly could to get made in the right way. And I think that they're very difficult movies to pull off, especially with this one, a film that opens yourself and the movie up to a lot of criticism. So to get any kind of recognition would be amazing for this, absolutely.", "[on 'Jordan Belfort' (qv), the character he plays in _The Wolf of Wall Street (2013)_ (qv)] He was like a modern-day emperor Caligula. He held nothing back and was unapologetic about his lust for wealth and mad consumption.", "[on his childhood] There was a major prostitution ring on my street corner, crime and violence everywhere. It really was like _Taxi Driver (1976)_ (qv) in a lot of ways. I grew up very poor and I got to see the other side of the spectrum. I've never done drugs. That's because I saw this stuff literally every day when I was three or four years old. So Hollywood was a walk in the park for me. I'd go to parties and it was there, and yeah, there's that temptation.", "[on why he doesn't want to direct films] I've been so blessed to work with some great filmmakers, that I'm probably cursed to probably ever work as a director myself. I don't think I would be able to compare to what I've seen. There are so many things that come into play when you make a movie. I really don't know how they do it. The truth is, the one thing I regret, if anything, in my long career having worked with the likes of Alejandro ['Alejandro G. Iñárritu' (qv)] and Marty ['Martin Scorsese' (qv)] is not be able to be a voyeur and stand aside and watch what they do, because I'm only concerned about what the hell I'm doing every single day. (...) But it would have been wonderful to have someone document all the great experiences I had and learn from the decisions. That's what you have to look for when you work with these directors. It's these tiny little decisions that change something from being mundane. [2015]", "[on 'Kate Winslet' (qv) - 2016 Golden Globes red carpet] She's my favorite actress in the industry.", "[28 February, 2016, his Oscar acceptance speech] Thank you all so very much. Thank you to the Academy, thank you to all of you in this room. I have to congratulate the other incredible nominees this year for their unbelievable performances. The Revenant was the product of the tireless efforts of an unbelievable cast and crew I got to work alongside. First off, to my brother in this endeavor, Mr. 'Tom Hardy' (qv) Tom, your fierce talent on screen can only be surpassed by your friendship off screen. To Mr. Alejandro Innaritu, as the history of cinema unfolds, you have forged your way into history these past 2 years... thank you for creating a transcendent cinematic experience. Thank you to everybody at Fox and New Regency...my entire team. I have to thank everyone from the very onset of my career...to Mr. Jones for casting me in my first film to Mr. Scorsese for teaching me so much about the cinematic art form. To my parents, none of this would be possible without you. And to my friends, I love you dearly, you know who you are. And lastly I just want to say this: Making The Revenant was about man's relationship to the natural world. A world that we collectively felt in 2015 as the hottest year in recorded history. Our production needed to move to the southern tip of this planet just to be able to find snow. Climate change is real, it is happening right now. It is the most urgent threat facing our entire species, and we need to work collectively together and stop procrastinating. We need to support leaders around the world who do not speak for the big polluters, but who speak for all of humanity, for the indigenous people of the world, for the billions and billions of underprivileged people out there who would be most affected by this. For our children's children, and for those people out there whose voices have been drowned out by the politics of greed. I thank you all for this amazing award tonight. Let us not take this planet for granted. I do not take tonight for granted. Thank you so very much.", "(2016) I've been very lucky to have achieved a lot of the things that I dreamed of achieving as a young man. But, at the end of the day - and I truly believe this - it is not about achieving great wealth or success. Because they don't bring happiness ultimately. They really don't. What matters is whether or not you've fulfilled the idea of having led an interesting life, whether you've contributed in some way to the world around you.", "(2016, on his parents) I'm completely indebted to them in every single way... They listened to me, you see. They listened to their kid saying, \"This is what I want to do,\" and they supported me unconditionally; they made me feel that all my dreams were within reach. Now I know a lot of people who have grown up in much better-off families, with much more solid family structures, who haven't in any way had that level of love in their lives.", "(2016) I get unhappy doing things that I'm not passionate about, because I feel like I'm squandering this incredible gift I've been given to finance films. As soon as my name alone was enough to make this happen, I vowed to myself that I was going to work with directors who were changing cinema, doing something important, you know? This goes back to when I was a teenager, feverishly watching movies like Taxi Driver and Apocalypse Now and saying to myself, someday, I'm going to be a part of films like this.", "[on director Alejandro Gonzalez Inarritu] He doesn't take any half-measures. He doesn't know moderation. He doesn't know compromise. He doesn't say \"no\". These are the things that make him unique. Not many filmmakers do what he does, and a lot of that process is about leaving a lot of room for trial and error.", "Climate change is real, it is happening right now. It is the most urgent threat facing our entire species, and we need to work collectively together and stop procrastinating. We need to support leaders around the world who do not speak for the big polluters, but who speak for all of humanity, for the indigenous people of the world, for the billions and billions of underprivileged people out there who would be most affected by this. For our children's children, and for those people out there whose voices have been drowned out by the politics of greed.", "I am almost 40 years old now, so I'd hope that I wouldn't have to answer to them. I think that the perception of me is still the child actor, so that, you know, people would wonder what my parents thought. But to tell you the truth, it didn't faze them whatsoever. I mean, I was reading underground comics in the back of my dad's station wagon that were much more gratuitous than this at 10 years old, so nothing really affected them on that level.", "[on the death of his _Growing Pains (1985)_ (qv) co-star 'Alan Thicke' (qv)]: Alan was a devoted father, husband, friend and role model. He knew how to harness the power of the entertainment industry to be a positive influence in so many lives - including mine. I will be forever grateful for the opportunity I had to work with Alan early in my career. He had tremendous class, a huge heart and he taught be and so many others the valuable lessons about humility and gratitude. I've seen him a number of times over the years and when Alan walked in the room, quite frankly, no one was cooler. I miss him already - my thoughts and prayers are with the entire Thicke family during this difficult time."], "salary history": ["_What's Eating Gilbert Grape (1993)_ (qv)::$75,000", "_The Basketball Diaries (1995)_ (qv)::$1,000,000", "_The Quick and the Dead (1995)_ (qv)::$150,000", "_Titanic (1997)_ (qv)::$2,500,000", "_The Beach (2000)_ (qv)::$20,000,000", "_Gangs of New York (2002)_ (qv)::$18,000,000 + Gross Points", "_Catch Me If You Can (2002)_ (qv)::$20,000,000", "_The Aviator (2004)_ (qv)::$20,000,000", "_The Departed (2006)_ (qv)::$20,000,000", "_Blood Diamond (2006)_ (qv)::$20,000,000", "_Inception (2010)_ (qv)::$59,000,000 (includes salary and all back-end points off worldwide gross + share of D.V.D. and pay-T.V. revenue)", "_J. Edgar (2011)_ (qv)::$2,000,000", "_The Great Gatsby (2013)_ (qv)::$20,000,000", "_The Wolf of Wall Street (2013)_ (qv)::$25,000,000 (including bonuses)", "_The Audition (2015)_ (qv)::$13,000,000", "_Once Upon a Time... in Hollywood (2019)_ (qv)::$10,000,000"], "birth date": "1974-11-11", "birth notes": "Hollywood, Los Angeles, California, USA", "_actorID": "38", "_source": "IMDB", "actorID": "0000138", "created_utc_dt": "09/14/2019, 13:01:46"}