{"headshot": "https://m.media-amazon.com/images/M/MV5BMTU0MTQ4OTMyMV5BMl5BanBnXkFtZTcwMTQxOTY1NA@@._V1_UY98_CR4,0,67,98_AL_.jpg", "nick names": ["Marky Mark", "Monk D"], "birth name": "Mark Robert Michael Wahlberg", "height": "5' 8\" (1.73 m)", "mini biography": ["American actor 'Mark Wahlberg' (qv) is one of a handful of respected entertainers who successfully made the transition from teen pop idol to acclaimed actor. A Best Supporting Actor Oscar nominee for _The Departed (2006)_ (qv) who went on to receive positive critical reviews for his performance in _The Fighter (2010)_ (qv), Wahlberg also is a solid comedy actor, proven by his starring role in _Ted (2012)_ (qv).Mark Robert Michael Wahlberg was born June 5, 1971 in a poor working class district, Dorchester, of Boston, Massachusetts. He is the son of Alma Elaine (Donnelly), a nurse's aide and clerk, and Donald Edward Wahlberg, a delivery driver. Wahlberg is the youngest of nine children. He is of Swedish (from his paternal grandfather), French-Canadian, English, Irish and Scottish, descent. The large Wahlberg brood didn't have a lot growing up, especially after his parents divorced when he was eleven. The kids crammed into a three-bedroom apartment, none of them having very much privacy. Mark's mother has said that after the divorce, she became very self-absorbed with her own life. She has blamed herself for her son's subsequent problems and delinquency. Wahlberg dropped out of high school at age fourteen (but later got his GED) to pursue a life of petty crime and drugs. He'd spend his days scamming and stealing, working on the odd drug deal before treating himself to the substances.The young man also had a violent streak - one which was often aimed at minorities. At age sixteen, he was convicted of assault against two Vietnamese men after he had tried to rob them. As a result of his assault conviction, he was sentenced to serve 50 days in prison at Deer Island penitentiary. Whilst there, he began working out to pass time and, when he emerged at the end of his sentence, he had gone from being a scrawny young kid to a buff young man. Wahlberg also credits jail time as being his motivation to improve his lifestyle and leave crime behind him.Around this time, his older brother 'Donnie Wahlberg' (qv) had become an overnight teen idol as a member of the 1980s boy band 'New Kids on the Block' (qv). A precursor to the boy-band craze, the group was dominating the charts and were on top of their game. Mark himself had been an original member of the band but had backed out early on - uncomfortable with the squeaky clean image of the group. Donnie used his connections in the music business to help his little brother secure a recording contract, and soon the world was introduced to Marky Mark and the Funky Bunch, with Wahlberg as a bad-boy rapper who danced in his boxers. Despite a lack of singing ability, promoters took to his dance moves and a physique they knew teenage girls would love.Donnie scripted some easy songs for Mark, who collected a troupe of dancers and a DJ to become his \"Funky Bunch\" and \"Marky Mark and the Funky Bunch\" was born. His debut album, \"Music for the People\", was a smash hit, which was propelled along by the rapper's willingness to disrobe down to boxer-briefs on stage, not to mention several catchy tunes. Teenage girls thrilled to the rapping \"bad boy\". Record producer 'David Geffen' (qv) saw in Wahlberg a cash-cow of marketing ability. After speaking to designer 'Calvin Klein' (qv), Marky Mark was set up as the designer's chief underwear model.His scantily clad figure soon adorned billboards across the nation. Ironically, while the 'New Kids on the Block' (qv)'s fame was dwindling as audiences tired of their syrupy lyrics, \"Marky Mark's\" bad boy image was becoming even more of a commodity. He was constantly in the headlines (often of the tabloids) after multiple scandals. In 1992, he released a book dedicated to his penis. Wahlberg was constantly getting into rumored fights, most memorably with 'Madonna' (qv) and her entourage at a Los Angeles party. While things were always intense, they were relatively harmless and made for enjoyable reading for the public. However, when the story of his arrest for assault (and the allegations of racism) broke in the press, things took on a decidedly darker note. People were not amused. Soon after, while on a British talk show along with rapper 'Shabba Ranks' (qv), he got into even more trouble. After Ranks made the statement that gays should be crucified, Wahlberg was accused of condoning the comments by his silence. Marky Mark was suddenly surrounded by charges of brutality, homophobia and racial hatred. His second album, \"You Gotta Believe\", had not been faring well and, after the charges surfaced, it plummeted from the charts.Adding to the hoopla, Wahlberg was brought to court for allegedly assaulting a security guard. He was ordered to make amends by appearing in a series of anti-bias advertisements. Humbled and humiliated by his fall from grace in the music world, Wahlberg decided to pursue another angle, acting. He dropped the \"Marky Mark\" moniker and became known simply as 'Mark Wahlberg' (qv). His first big screen role came in 'Penny Marshall' (qv)'s _Renaissance Man (1994)_ (qv). Despite the name change, many people snickered at the idea of the has-been rapper thinking he could make it as an actor. From the get-go, he was proving them wrong. In _Renaissance Man (1994)_ (qv), he gave an utterly charming performance as a simple but sincere army recruit. What naysayers remained found it increasingly difficult to write 'Mark Wahlberg' (qv) off as he delivered one fine performance after another. He blew them away in the controversial _The Basketball Diaries (1995)_ (qv) and chilled them in _Fear (1996)_ (qv) as every father's worst nightmare.The major turning point in Wahlberg's career came with the role of troubled porn star Dirk Diggler in 'Paul Thomas Anderson' (qv)'s _Boogie Nights (1997)_ (qv). Since then, Wahlberg has chosen roles that demonstrate a wide range of dramatic ability, starring in critically acclaimed dramas such as _Three Kings (1999)_ (qv) and _The Perfect Storm (2000)_ (qv), popcorn flicks like _Planet of the Apes (2001)_ (qv) and _Contraband (2012)_ (qv), and even indies such as _I Heart Huckabees (2004)_ (qv).Wahlberg was the executive producer of such television series as _Boardwalk Empire (2010)_ (qv), _In Treatment (2008)_ (qv) and the highly successful comedy _Entourage (2004)_ (qv), which was partly based on his experiences in Hollywood.Wahlberg and his wife 'Rhea Durham' (qv) have four children.::Anonymous and Julianna_Peterson@yahoo.com"], "spouse": ["'Rhea Durham' (qv)::(1 August 2009 - present) ( 4 children)"], "trade mark": ["Boston accent", "Often plays tough, no-nonsense characters, with sarcastic sense of humor", "Frequently plays law enforcement officials, military personnel or criminals in his films", "Often plays fathers (Daddy's Home, The Lovely Bones, Instant Family)", "Frequently cast with directors 'Sean Anders' (qv), 'Michael Bay' (qv), 'Peter Berg' (qv) and 'David O. Russell' (qv)"], "trivia": ["Younger brother of 'Arthur Wahlberg' (qv), 'Donnie Wahlberg' (qv) and 'Robert Wahlberg' (qv).", "Named one of People magazine's 50 Most Beautiful People in the World. [May 1992]", "His older siblings are: 'Arthur Wahlberg' (qv), James Wahlberg, Debbie Wahlberg, Michelle Wahlberg, 'Paul Wahlberg' (qv), Tracey Wahlberg, 'Robert Wahlberg' (qv) and 'Donnie Wahlberg' (qv). Robert, Donnie and Mark are from their mother's third marriage with Donald Wahlberg. Half-siblings from his father's side of the family are Scott Wahlberg, Buddy Wahlberg and Donna Wahlberg.", "Was originally cast as Linus Caldwell in _Ocean's Eleven (2001)_ (qv) but dropped out. The role went to 'Matt Damon' (qv).", "Bought a $5 million mansion in Beverly Hills, California and moved his mother there. [December 2001]", "His music group, Marky Mark and the Funky Bunch, debuted on _The Arsenio Hall Show (1989)_ (qv) in the late 1980s.", "He said in one of the featurettes in The Italian 'Job' (qv) (2003) DVD that he thought about doing the movie because it was going to be his third remake in a row (if you don't count _Rock Star (2001)_ (qv)) after _The Truth About Charlie (2002)_ (qv) and _Planet of the Apes (2001)_ (qv).", "His father was of half Swedish and half Irish descent, and his mother's ancestry is 11/16ths Irish, one eighth French-Canadian, one eighth English, and one sixteenth Scottish. Mark's paternal grandfather, Axel Simon Wahlberg, was the son of Swedish immigrants, Axel Gustaf Wahlberg and Ida Albertina Nordstrom.", "Narrated the documentary _Juvies (2004)_ (qv) along with The Italian 'Job' (qv) (2003) co-star 'Yasiin Bey' (qv) (Mos Def supplied poetry).", "His older sister Debbie passed away on September 2, 2003, leaving behind a teenage son. She died on the same day that Mark's first child, 'Ella Rae Wahlberg' (qv), was born.", "Has a tattoo of 'Bob Marley' (qv) on his left shoulder.", "Is very close to his mother 'Alma McPeck' (qv).", "Older brother, 'Donnie Wahlberg' (qv), was a member of the boy group 'New Kids on the Block' (qv).", "Has a summer home in Wrentham, Massachusetts.", "Turned down the role of Hero in the horror film _Feast (2005)_ (qv), which went to 'Eric Dane' (qv).", "Turned down the lead role of Jake Roenick in _Assault on Precinct 13 (2005)_ (qv), which went to 'Ethan Hawke' (qv).", "'Martin Scorsese' (qv) directed Wahlberg to his very first Academy Award nomination as Sgt. Sean Dignam in _The Departed (2006)_ (qv). Wahlberg has said that it's one of the roles he is most proud of.", "Friends with 'Leonardo DiCaprio' (qv), 'Jimmy Butler' (qv), 'Sean 'Diddy' Combs' (qv), and 'Will Ferrell' (qv).", "Considers _The Truth About Charlie (2002)_ (qv) his worst film.", "He and some friends were actually booked to fly on one of the planes that crashed in to the twin towers on September 11, 2001. Originally planning on flying from Boston to Los Angeles but at the last minute they decided to charter a plane to Toronto, Canada for a film festival and then from there to Los Angeles. A near brush with death that he still dreams about today. \"We certainly would have tried to do something to fight. I've had probably over 50 dreams about it.\"", "Ranked #65 on VH1's 100 Sexiest Artists.", "His father, 'Donald E. Wahlberg Sr.' (qv), a veteran of the Korean War, passed away on February 14, 2008.", "As of 2008, he earns a reported $12-15 million per film in addition to a percentage of the back end profits.", "While performing as Marky Mark and the Funky Bunch he often wore nothing but underpants on stage. 'Calvin Klein' (qv) consequently asked him to model for Klein's underwear line.", "Was originally a member of 'New Kids on the Block' (qv), but left the band before they had their big break.", "Through being a distant relative of 'Madonna' (qv), he is also one of 'Céline Dion' (qv).", "Had to spent about 60 days in the House of Correction in Massachusetts when he was a teenager.", "Was a drug dealer as a young teenager.", "Was born in St. Margaret's Hospital in Boston, Massachusetts.", "Dropped out of school when he was age 13.", "Has stated his performance as Max Payne in _Max Payne (2008)_ (qv) as his favorite role.", "Has stated that he struggled with weight gain his whole life.", "Was briefly sent to prison for two 1988 incidents in which he attacked, beat, and yelled ethnic slurs at two Vietnamese men in Dorchester, Massachusetts. Both incidents were unprovoked by the victims, and in the second attack, Wahlberg beat and permanently blinded in one eye a man who was trying to help him escape from the police after the first attack.", "Ranked #1 on VH1's \"Hottest Hotties of the 90's\".", "Was spoofed by 'Andy Samberg' (qv) on _Saturday Night Live (1975)_ (qv). After the first skit premiered Wahlberg jokingly acted as if he was offended when appearing on _Jimmy Kimmel Live! (2003)_ (qv) (_Jimmy Kimmel Live!: Episode #6.141 (2008)_ (qv)), but he eventually appeared in SNL (_Saturday Night Live: Josh Brolin/Adele (2008)_ (qv)) going along with the joke.", "Paid $8.25 million to purchase a 6.14-acre, vacant lot in Beverly Hills, California's Beverly Park neighborhood where he plans to custom-build a mansion on the property (2009).", "He was awarded a Star on the Hollywood Walk of Fame at 6259 Hollywood Boulevard in Hollywood, California on July 29, 2010.", "On August 1, 2009, he married longtime partner, 'Rhea Durham' (qv), at a private Catholic ceremony in Beverly Hills, California.", "Is a registered Democrat.", "Received his high school diploma 25 years after dropping out of the Snowden International School in Massachusetts (previously known as Copley Square High School).", "Became a father for the first time, at age 32, when his girlfriend [now wife] 'Rhea Durham' (qv) gave birth to their daughter, 'Ella Rae Wahlberg' (qv), on September 2, 2003.", "Became a father for the second time at age 34 when his girlfriend [now wife] 'Rhea Durham' (qv) gave birth to their son Michael Wahlberg on March 21, 2006.", "Became a father for the third time at age 37 when his girlfriend [now wife] 'Rhea Durham' (qv) gave birth to their son Brendan Joseph Wahlberg on September 16, 2008.", "Became a father for the fourth time at age 38 when his fiancée [now wife] 'Rhea Durham' (qv) gave birth to their daughter Grace Margaret Wahlberg on January 11, 2010.", "Brother-in-law of 'Jenny McCarthy' (qv) and cousin-in-law of 'Melissa McCarthy' (qv).", "One of the ingredients of the cheeseburgers served at his family restaurant is \"government cheese\", which was provided to welfare recipients when he was a child. Wahlberg has said he wanted the burgers to honestly and accurately reflect the working-class meals he and his siblings were raised on.", "Is a fan of all the four major Boston sports teams, The New England Patriots, Boston Celtics, Boston Bruins and the Boston Red Sox.", "Known for being very nice and polite to fans who recognize him on the street.", "His favorite movie is _Hard Times (1975)_ (qv), with 'Charles Bronson' (qv).", "Was friends with fellow rapper-turned-actor 'Will Smith' (qv). The two hung out in the early 1990s.", "Is great friends with comic 'Will Ferrell' (qv). The two actors have starred in two films together, including _The Other Guys (2010)_ (qv) and _Daddy's Home (2015)_ (qv), including the upcoming sequel to The Other Guys.", "Around the 2000's he discussed starring in \"Urban Townies\" which was going to be directed by 'Mike Figgis' (qv) but then pulled out to star in \"Spy Games\" after which Mike also walked.", "Highest paid actor of 2017, earning $68 million.", "Petitioned for a pardon as a convicted Felon in 2014 as he desired to become a law enforcement officer in Los Angeles. Felons are prohibited from becoming police officers, so his conviction would prevent him from doing so. He dropped the petition request in 2016, so his status as a Felon from the 1988 assault in Boston remains unchanged.", "Uncle of 'Oscar Wahlberg' (qv) and 'Jeff Wahlberg' (qv).", "He was considered for the role of Brian O'Conner in _The Fast and the Furious (2001)_ (qv), which went to the late 'Paul Walker' (qv).", "He was a 'Calvin Klein' (qv) underwear model in the early 1990s.", "He was considered for the role of Johnny Rico in _Starship Troopers (1997)_ (qv)."], "quotes": ["I've always looked at my career as an athlete would look at his. I won't play forever. Some don't know when to walk away, but the smart ones do.", "[on his delight for starring in 'Walt Disney' (qv)'s _Invincible (2006)_ (qv)] It's a movie my kids can see - my nieces and nephews. I haven't had that. None of my nieces and nephews have seen _Boogie Nights (1997)_ (qv), thank God! I haven't made too many PG movies.", "[His reaction to his Oscar-nomination for _The Departed (2006)_ (qv)] Any time someone says you have an opportunity to work with 'Martin Scorsese' (qv) you jump at the chance.", "Marty and I were constantly in this struggle. I had problems with Marty. He was \"I'm 'Martin Scorsese' (qv)... da-dee-da.\" He was pushing me in different ways. But it wasn't just Marty. The whole time I was in the character so I was mad at everybody. It was Leo, Matt and Jack. Fuck Jack too. We were able to laugh about it afterwards and we have a great relationship now and we're going to do other stuff in the future.", "In my movies, I'm not trying to erase any old image of myself, really. And also I'm not trying to imitate anyone or follow in their footsteps, because I know, 'Burt Reynolds' (qv) was just one of the people that told me this, I know how you can only last in this business if you got something special to offer, just by being yourself. Imitators don't last, and I'd like to last.", "[on _Boogie Nights (1997)_ (qv)] It was a showstopper, and it had a good screenplay, a real story. It also helped 'Burt Reynolds' (qv)' career, and now I can more sympathize with that, now that I've been in the business a fairly long time, so I can see how doing a comeback that's popular and also critically liked is something rare and real special.", "[on 'David Beckham' (qv), jokingly] I'm not telling Beckham to take his family home. I'm just not sure why he came to America in the first place. Man, we don't want your soccer. There's no way Americans are going to buy the idea of 90 minutes of running around without much happening. Thanks for trying guys, but we'll stick to baseball and basketball.", "[on 'George Michael' (qv) being sent to prison for driving under the influence of drugs] I was 16 when I went to prison but he's been busted a couple of times. He should get a driver or go to Amsterdam where pot is legal. But my heart goes out anyone who goes to prison. I pray for him.", "I like to talk to people. I've got one assistant, one Blackberry. That's my overhead. I don't text that much or email. I like to sit down face-to-face and have a conversation with you. I'm old-fashioned.", "[on narrowly avoiding being on hijacked 9/11 flight United 93] If I was on that plane with my kids, it wouldn't have went down like it did. There would have been a lot of blood in that first-class cabin and then me saying, \"Okay, we're going to land somewhere safely, don't worry.\" We certainly would have tried to do something to fight. I've had probably over 50 dreams about it.", "I did a lot of things that I regretted and I certainly paid for my mistakes. You have to go and ask for forgiveness and it wasn't until I really started doing good and doing right, by other people as well as myself, that I really started to feel that guilt go away. So I don't have a problem going to sleep at night.", "As far as I'm concerned, there's no job more important on the planet than being a mom.", "I don't want to let my guard down and feel too comfortable. If you become complacent, you start feeling entitled. I'm ready to go dig ditches if I have to. Whatever I gotta do to provide for my family. Whatever I gotta do to make sure that I do the best possible job at whatever wonderful opportunities I've been handed.", "For actors who sit there and talk about, \"Oh, I went to SEAL training.\" I don't give a fuck what you did. You don't know what these guys did. For somebody go sit there and say my job was as difficult as being in the military? How fucking dare you, while you sit in a makeup chair for two hours?", "I pray to be a good servant to God, a father, a husband, a son, a friend, a brother, an uncle, a good neighbor, a good leader to those who look up to me, a good follower to those who are serving God and doing the right thing.", "Actually, you English people always get to play Americans but they never let us play Englishmen. So if some great 18th-century English royal role came up, I could go over there for two years. I could become that character. And I tell you what, I'd kill it.", "[about his criminal past as a teenager] No, I don't have any problems sleeping at night."], "salary history": ["_Planet of the Apes (2001)_ (qv)::$8,000,000", "_The Truth About Charlie (2002)_ (qv)::$10,000,000", "_Entourage (2004)_ (qv)::$3,000,000 /year (2007) as Executive Producer", "_2 Guns (2013)_ (qv)::$10,000,000", "_All the Money in the World (2017)_ (qv)::$1 .5 million (for reshoots)"], "birth date": "1971-06-05", "birth notes": "Dorchester, Boston, Massachusetts, USA", "_actorID": "55", "_source": "IMDB", "actorID": "0000242", "created_utc_dt": "09/14/2019, 13:02:03"}