{"headshot": "https://m.media-amazon.com/images/M/MV5BMTM0NzYzNDgxMl5BMl5BanBnXkFtZTcwMDg2MTMyMw@@._V1_UY98_CR3,0,67,98_AL_.jpg", "birth name": "Matthew Paige Damon", "height": "5' 10\" (1.78 m)", "mini biography": ["Matthew Paige Damon was born on October 8, 1970, in Boston, Massachusetts, to 'Kent Damon' (qv), a stockbroker, realtor and tax preparer, and 'Nancy Carlsson-Paige' (qv), an early childhood education professor at Lesley University. Matt has an older brother, Kyle, a sculptor. His father was of English and Scottish descent, and his mother is of Finnish and Swedish ancestry. The family lived in Newton until his parents divorced in 1973, when Damon and his brother moved with his mother to Cambridge. He grew up in a stable community, and was raised near actor 'Ben Affleck' (qv).Damon attended Cambridge Rindge and Latin School and he performed in a number of theater productions during his time there. He attended Harvard University as an English major. While in Harvard, he kept on skipping classes to pursue acting projects, which included the TNT original film, _Rising Son (1990)_ (qv), and prep-school drama, _School Ties (1992)_ (qv). It was until his film, _Geronimo: An American Legend (1993)_ (qv), was expected to be a big success that he decided to drop out of university completely. Arriving in Hollywood, Matt managed to get his first break with a part in the romantic comedy, _Mystic Pizza (1988)_ (qv). However, the film did not do too well and his film career failed to take off. Not letting failure discourage him from acting, he went for another audition, and managed to get a starring role in _School Ties (1992)_ (qv). Up next for Matt was a role as a soldier who had problems with drug-addiction in the movie, _Courage Under Fire (1996)_ (qv). Matt had, in fact, lost forty pounds for his role which resulted in health problems.The following year, he garnered accolades for _Good Will Hunting (1997)_ (qv), a screenplay he had originally written for an English class at Harvard University. _Good Will Hunting (1997)_ (qv) was nominated for 9 Academy 'Awards' (qv), one of which, Matt won for Best Original Screenplay along with 'Ben Affleck' (qv). In the year 1998, Matt played the title role in 'Steven Spielberg' (qv)'s film, _Saving Private Ryan (1998)_ (qv), which was one of the most acclaimed films in that year. Matt had the opportunity of working with 'Tom Hanks' (qv) and 'Vin Diesel' (qv) while filming that movie. That same year, he starred as an earnest law student and reformed poker player in _Rounders (1998)_ (qv), starring opposite 'Edward Norton' (qv) and 'John Malkovich' (qv). The next year, Matt rejoined his childhood friend, 'Ben Affleck' (qv) and fellow comedian, 'Chris Rock' (qv), in the comedy _Dogma (1999)_ (qv).Towards the end of 1999, Matt played \"Tom Ripley\", a working-class young man who tastes the good life and will do anything to live it. Both 'Jude Law' (qv) and 'Gwyneth Paltrow' (qv) also starred in the movie. _The Talented Mr. Ripley (1999)_ (qv) earned mixed reviews from critics, but even so, Matt earned praise for his performance. Matt lent his voice to the animated movie, _Titan A.E. (2000)_ (qv) in the year 2000, which also earned mixed reviews from the public. He also starred in two other movies, _All the Pretty Horses (2000)_ (qv) and the golf comedy-drama, _The Legend of Bagger Vance (2000)_ (qv), starring alongside 'Will Smith' (qv). In the year 2003, he signed on to star in _The Informant! (2009)_ (qv) by 'Steven Soderbergh' (qv) and the Farrelly Brothers' _Stuck on You (2003)_ (qv). He also starred in _Gerry (2002)_ (qv), a film he co-wrote with his friends, 'Gus Van Sant' (qv) and 'Casey Affleck' (qv). One of Matt's most recognizable work to date is his role in the \"Bourne\" movie franchise. He plays an amnesiac assassin, \"Jason Bourne\", in _The Bourne Identity (2002)_ (qv), _The Bourne Supremacy (2004)_ (qv) and _The Bourne Ultimatum (2007)_ (qv). Another praised role is that as \"Linus Caldwell\" in the \"Ocean's\" movie franchise. He had the opportunity to star opposite 'George Clooney' (qv), 'Brad Pitt' (qv), 'Julia Roberts' (qv) and 'Don Cheadle' (qv) in _Ocean's Eleven (2001)_ (qv). The successful crime comedy-drama eventually had two other sequels, _Ocean's Twelve (2004)_ (qv) and _Ocean's Thirteen (2007)_ (qv). Among other highly acclaimed movies that Matt has been a part of are 'Terry Gilliam' (qv)'s _The Brothers Grimm (2005)_ (qv), 'George Clooney' (qv)'s _Syriana (2005)_ (qv), 'Martin Scorsese' (qv)'s _The Departed (2006)_ (qv) and 'Robert De Niro' (qv)'s _The Good Shepherd (2006)_ (qv).In his personal life, Matt is now happily married to Argentine-born 'Luciana Barroso' (qv), whom he met in Miami, where she was working as a bartender. They married in a private civil ceremony on December 9, 2005, at the Manhattan Marriage Bureau. The couple have four daughters Alexia, Luciana's daughter from a previous relationship, as well as Isabella, Gia and Stella. Matt is a big fan of the Boston Red Sox and he tries to attend their games whenever possible. He has also formed great friendships with his Ocean's co-stars, 'George Clooney' (qv) and 'Brad Pitt' (qv), whom he works on charity projects with. He and actor 'Ben Affleck' (qv), together with Ben's wife, 'Jennifer Garner' (qv), are also good family friends.::Anonymous, Dennis Lewis, and Charles Caro"], "spouse": ["'Luciana Barroso' (qv)::(9 December 2005 - present) ( 3 children)"], "trade mark": ["Often works with actors 'Ben Affleck' (qv) and 'George Clooney' (qv)", "Frequently works with directors 'Paul Greengrass' (qv), 'Gus Van Sant' (qv), and 'Steven Soderbergh' (qv)", "His long running joke feud with 'Jimmy Kimmel' (qv)"], "trivia": ["1998: Played in $10,000 buy-in Texas Hold 'Em tournament at the World Series of Poker (www.wsop.com) in Las Vegas. He was knocked out in the first day by poker legend 'Doyle Brunson' (qv). Damon had kings, Brunson aces.", "Chosen as one of \"the 50 Most beautiful people in the world\" by People magazine (1998).", "Dropped 47 pounds for his role as a Gulf War vet in _Courage Under Fire (1996)_ (qv).", "His parents divorced when he was two and he spent part of his childhood in a commune in Boston with his mother.", "Dropped out of Harvard 12 credits short of graduating to pursue his acting career.", "To perfect his Southern accent for his role as Rudy Baylor in _The Rainmaker (1997)_ (qv), he tended bar in Knoxville, TN, for free. Later he hired one of the customers to serve as his dialect coach.", "Auditioned for a role in _To Die For (1995)_ (qv) which was eventually given to 'Joaquin Phoenix' (qv).", "Audtioned for a part in _Primal Fear (1996)_ (qv) that was eventually played by 'Edward Norton' (qv). He and Norton starred together two years later in _Rounders (1998)_ (qv).", "Both he and 'Ben Affleck' (qv) worked as extras on the film _Field of Dreams (1989)_ (qv). At one point during the shoot, Matt took some blades of grass from the field as mementos for his father.", "Turned down a role in _The Quick and the Dead (1995)_ (qv). 'Leonardo DiCaprio' (qv) was cast instead.", "Turned down the lead role in _The Majestic (2001)_ (qv).", "When his baby nephew cries, he sings \"Afternoon Delight\" for him.", "Was named as one of E!'s \"25 Most Eligible Bachelors\" in June, 2002.", "Shaved his head for the movie _The Brothers Grimm (2005)_ (qv) (to assist in the wearing of a wig for that role). The shaved head was shown in the movie _EuroTrip (2004)_ (qv), which was filmed in Prague at the same time.", "Started a bowling league in Berlin while making _The Bourne Supremacy (2004)_ (qv).", "Had a cameo as a waiter in the film _The Sum of All Fears (2002)_ (qv), but it was cut from the final film.", "Is the real-life best friend of 'Ben Affleck' (qv). Each has starred together or had cameos in each of the other's films.", "Has starred in 10 movies where the title contains some part of his character's name in that movie: _Good Will Hunting (1997)_ (qv), _Saving Private Ryan (1998)_ (qv), _The Talented Mr. Ripley (1999)_ (qv), _Gerry (2002)_ (qv), _Spirit: Stallion of the Cimarron (2002)_ (qv), _The Bourne Identity (2002)_ (qv), and _The Bourne Supremacy (2004)_ (qv), _The Brothers Grimm (2005)_ (qv), _The Bourne Ultimatum (2007)_ (qv) and _Jason Bourne (2016)_ (qv).", "While promoting _The Bourne Supremacy (2004)_ (qv) on _The Tonight Show with Jay Leno (1992)_ (qv), he revealed that when he was a college freshman his agent from a \"ma and pa agency\" inadvertently sent him and 'Ben Affleck' (qv) to an audition for _The New Mickey Mouse Club (1977)_ (qv). They were under the impression that they were going to meet the head of Touchstone Pictures.", "His uncle, George Brunstad, swam the English Channel at the age of 70. He completed the 21-mile swim in 15 hours and 59 minutes, making him the new world record holder as the oldest person to complete the swim. In the process, he raised $12,000 for a Haitian children's group (29 August 2004).", "Quit smoking after visiting a hypnotist in L.A.", "Grew up next door to radical historian 'Howard Zinn' (qv). Damon references Zinn's seminal work \"A People's History of the United States\" as Will in _Good Will Hunting (1997)_ (qv).", "1998: Formed Pearl Street Productions with 'Ben Affleck' (qv) and 'Chris Moore' (qv).", "Lost 30 pounds for his role in the film _The Talented Mr. Ripley (1999)_ (qv).", "Learned to play piano for the film _The Talented Mr. Ripley (1999)_ (qv).", "Was considered for the role of Matt Murdock/Daredevil in _Daredevil (2003)_ (qv). The role eventually went to his best friend 'Ben Affleck' (qv).", "One of his first movie roles was a one-line part in _Mystic Pizza (1988)_ (qv) starring 'Julia Roberts' (qv). Later, he starred with Roberts in _Ocean's Eleven (2001)_ (qv).", "After a notable weight gain for _Stuck on You (2003)_ (qv), he lost 22 pounds training for _The Bourne Supremacy (2004)_ (qv), eventually having six-pack abs.", "Had never made a sequel until he made _Ocean's Twelve (2004)_ (qv) and _The Bourne Supremacy (2004)_ (qv), both in the same year. In 2007, the third parts of those series, _Ocean's Thirteen (2007)_ (qv) and _The Bourne Ultimatum (2007)_ (qv), opened, making the first trilogies he's starred in.", "Became stepfather to girlfriend 'Luciana Barroso' (qv)'s daughter, Alexia, when he married Luciana at City Hall in New York City (December 9, 2005).", "Met his wife, 'Luciana Barroso' (qv), in Florida, while he was filming _Stuck on You (2003)_ (qv) and she was working as a bartender.", "Was once offered the chance at playing Daredevil when it was in production at Miramax in 1999. This version would have starred Damon and been written by 'Kevin Smith' (qv) and directed by 'Robert Rodriguez' (qv). However, Marvel Comics wanted too large a budget for the filmmakers' tastes.", "Has English and Scottish ancestry on his father's side, and Finnish and Swedish ancestry on his mother's side. His maternal grandfather had changed his surname from \"Pajari\" (a Finnish surname) to \"Paige\".", "Turned down the part of Bobby Mercer in _Four Brothers (2005)_ (qv), as he found the script to be \"ultra-violent\". The part eventually went to 'Mark Wahlberg' (qv).", "'Francis Ford Coppola' (qv) cast him in _The Rainmaker (1997)_ (qv) after seeing him in _Courage Under Fire (1996)_ (qv).", "Turned down the role of Harvey Dent in _The Dark Knight (2008)_ (qv).", "Appears in two of the six summer 2007 \"threequels\": _Ocean's Thirteen (2007)_ (qv) and _The Bourne Ultimatum (2007)_ (qv). He also appeared in the second; movies of the \"Bourne\" and \"Ocean\" franchises in the same year (2004).", "Both he and best friend, 'Ben Affleck' (qv), spent Father's Day 2007 with their wives and children together on vacation in Hawaii.", "Received a star on the Hollywood Walk of Fame (26 July 2007).", "Is only 11 years older than 'Eddie Redmayne' (qv) who plays his son in _The Good Shepherd (2006)_ (qv).", "Named Hollywood's \"best value\" by Forbes Magazine, with his films making $29 (US) for each dollar he is paid (2007).", "Named \"Sexiest Man Alive\" by People magazine in 2007.", "He gained over 30 pounds to play Mark Whiteacre in _The Informant! (2009)_ (qv), which he dieted off as soon as the shoot was complete.", "He and 'Ben Affleck' (qv) lived two blocks away from each other in Cambridge, Massachusetts, when they were children.", "Has an older brother named Kyle, who is a sculptor.", "Visited Haiti with 'Wyclef Jean' (qv) to deliver food to hurricane victims. [September 2008]", "Originally cast as Dan White in _Milk (2008)_ (qv), but had to back out due to scheduling conflicts with _Green Zone (2010)_ (qv).", "Participated in the Cape Argus Cycle Tour in Cape Town, South Africa. [March 2009]", "Was at some point in talks to star in a remake of _Blue Thunder (1983)_ (qv) with 'John Milius' (qv) directing.", "Appeared twice on the cover of GQ magazine: December '99 and August '07.", "Was, along with 'Jake Gyllenhaal' (qv), the studio's first choice for the role of Jake Sully in _Avatar (2009)_ (qv), but director 'James Cameron' (qv) chose the (back then) more unknown 'Sam Worthington' (qv) in the lead role instead.", "When he and best friend 'Ben Affleck' (qv) were struggling actors, they both shared a Boston bank account.", "Put his Miami Beach mansion on North Bay Rd on the market for $20 million in May 2013.", "Became a father for the 1st time at age 35 when his wife 'Luciana Barroso' (qv) gave birth to their daughter Isabella Zavala Damon on June 11, 2006.", "Became a father for the 2nd time at age 37 when his wife 'Luciana Barroso' (qv) gave birth to their daughter Gia Zavala Damon on August 20, 2008.", "Became a father for the 3rd time at age 40 when his wife 'Luciana Barroso' (qv) gave birth to their daughter Stella Zavala Damon on October 20, 2010.", "Attended _The Bourne Ultimatum (2007)_ (qv) premiere in Amsterdam, Netherlands on Aug. 23rd. [August 2007]", "New York City, USA: The documentary film which he narrated, American Teacher (2011), premiered here before opening around the country. [September 2011]", "Filming _The Informant! (2009)_ (qv) in Decatur, Illinois (Home to ADM). Various locations. [May 2008]", "Currently shooting director 'Martin Scorsese' (qv)'s _The Departed (2006)_ (qv) with 'Leonardo DiCaprio' (qv) and 'Jack Nicholson' (qv) in New York City and Boston. [August 2005]", "Is sometimes (but rarely) mistaken for actor 'Mark Wahlberg' (qv).", "As of 2017, has appeared in five films that were nominated for the Best Picture Oscar (not counting his unconfirmed bit part in _Field of Dreams (1989)_ (qv)): _Good Will Hunting (1997)_ (qv), _Saving Private Ryan (1998)_ (qv), _The Departed (2006)_ (qv) , _True Grit (2010)_ (qv) and _The Martian (2015)_ (qv) and produced Best Picture nominee _Manchester by the Sea (2016)_ (qv). _The Departed (2006)_ (qv) won in the category.", "Stated that his appearance on _The Graham Norton Show (2007)_ (qv) with 'Hugh Bonneville' (qv) and 'Bill Murray' (qv) was 'the best time he'd ever had on a chat show'.", "Exactly one year younger than 'Jeremy Davies' (qv), both appeared in _Saving Private Ryan (1998)_ (qv) as Private Ryan and Corporal Upham. Both born on 8 October.", "Tenth cousin once removed of 'Ben Affleck' (qv).They are both descendants of William Knowlton Jr., a bricklayer who came to the United States from England in the 1630s.", "He has appeared in four films directed by 'Kevin Smith' (qv): _Chasing Amy (1997)_ (qv), _Dogma (1999)_ (qv), Jay and Silent Bob Strike Back (2001)_ and _Jersey Girl (2004)_ (qv).", "'Jimmy Kimmel' (qv) had a long running gag of ending his late night show with an apology to 'Matt Damon' (qv) for not being able to interview him.", "He has worked with 9 directors who have won a Best Director Oscar: 'Francis Ford Coppola' (qv), 'Steven Spielberg' (qv), 'Anthony Minghella' (qv), 'Robert Redford' (qv), 'Steven Soderbergh' (qv), 'Martin Scorsese' (qv), 'Clint Eastwood' (qv), and 'Joel Coen' (qv) & 'Ethan Coen' (qv).", "He has starred in three different films where rescuing his character is a major plot point: _Saving Private Ryan (1998)_ (qv), _Interstellar (2014)_ (qv) and _The Martian (2015)_ (qv).", "He starred in two science fiction films with Jessica Chastain where his character needs to be rescued: _Interstellar (2014)_ (qv) and _The Martian (2015)_ (qv).", "Has starred in six films with 'Casey Affleck' (qv): _Good Will Hunting (1997)_ (qv), _Gerry (2002)_ (qv), Oceans Eleven (2002), Oceans Twelve (2004), Oceans Thirteen (2007) and _Interstellar (2014)_ (qv). _Interstellar (2014)_ (qv) is the only one in which They do not have any scenes together.", "He said that in 1995, he was paid $20,000 to be in 'Tommy Lee Jones' (qv) film _The Good Old Boys (1995)_ (qv). That money kept Damon and 'Ben Affleck' (qv) free from having to take other jobs so that they could write _Good Will Hunting (1997)_ (qv).", "Has stated since The Bourne Identity, when rehearsing fight scenes with stunt men, he has bought each of them a bottle of champagne for every time he struck them by accident.", "Like his best friend 'Ben Affleck' (qv), he was an avid fan and collector of Daredevil comics growing up.", "He was among the actors considered for the role of Batman's Sidekick Dick Grayson/Robin/Nightwing in 'Batman Forever (1995)'. His best friend 'Ben Affleck' (qv) would go on to play Bruce Wayne/Batman over twenty years later.", "Friends with 'Casey Affleck' (qv), 'George Clooney' (qv), 'Brad Pitt' (qv), 'Joaquin Phoenix' (qv), and 'Wyclef Jean' (qv).", "Co-founded H20 Africa,an organization that brings clean drinking water to three million people in developing countries.", "According to articles posted in Dec. 2015 on Quora and other sources, the total cost of all the rescue missions that were mounted to save characters he played in various films (including Saving Private Ryan, Interstellar and The Martian) would exceed 900 billion in adjusted dollars.", "He has starred in three films with Alec Baldwin: _The Departed (2006)_ (qv), _The Good Shepherd (2006)_ (qv) and Downsizing (2017). The two also appeared in multiple episodes of 30 Rock (2006-2012) together.", "He is close friends with Chris Hemsworth.", "Has the distinction of playing two stranded astronauts in need of a rescue; the villainous Dr. Mann in _Interstellar (2014)_ (qv) and the heroic Mark Watney in _The Martian (2015)_ (qv).", "Although his characters have used them frequently in films, he has a strong dislike of guns in real life."], "quotes": ["Some people get into this business and they're so afraid to lose anything. They try to protect their position like clinging to a beachhead. These actors end up making really safe choices. I never wanted to go that route. If I go down, I'm going down swinging. I know that's the way 'Heath Ledger' (qv) feels and 'Ben Affleck' (qv) feels the same way, too. We want to take the big swings.", "If your movies don't perform, they just stop calling you.", "I found myself getting more publicly shy when the gala events and big crowds started. Some people embrace it. To me, it's not worth enough to risk my private life being public.", "I'm not being a monk. I live my life in New York. I have a girlfriend ['Luciana Barroso' (qv)]. But it's not cost-effective for paparazzi to follow us. They can get one picture of us walking down the street.", "Now I feel I have an unspoken deal with the paparazzi: \"I won't do anything publicly interesting if you agree not to follow me.\"", "I'd love to be a dad. I hope I'd be great at it. That's every man's fear, yet his most important job.", "[on _The Bourne Ultimatum (2007)_ (qv)] We're all signed on in principle, in the sense that we've all agreed that we want to do it, but we're not going to do it unless we have a great script. It's ours to lose at the minute and, if we do make a third one, we want to make it as good as the first two. And if we can't do that, then we're going to have to let it drop.", "[on _The Bourne Ultimatum (2007)_ (qv)] If you have any ideas for a script, please, call Universal! We've gone so far from the book. ['Robert Ludlum' (qv)] wrote it as a trilogy and we've really kind of ignored that plot because it's very Cold War. And so, in the updating process, we kind of threw out most of what he had so we're kind of on our own to find a third one. \"Bourne Ultimatum\" is the third one and I feel like I've given ultimatums in both the first two!", "If anybody wanted to photograph my life, they'd get bored in a day. \"Here's Matt at home learning his lines. Here's Matt researching in aisle six of his local library\". A few hours of that and they'd go home.", "What I want to do is a character-driven porn movie. It's all going to be about characters, and the porn's gonna grow all out of the character's and it's going to serve as character development.", "It's just better to be yourself than to try to be some version of what you think the other person wants.", "There are people who appear in the magazines and I don't know who they are. I've never seen anything they've done and their careers are over already. They're famous for maybe 10 minutes. Real careers, I think, take a long time to unfold.", "I'd had people say, \"You'll enjoy being famous for a week, and you'll never enjoy it again\". But I don't think I had that week. I may have been working and missed that moment.", "Bond is part of the system. He's an imperialist and a misogynist, and he laughs at killing people, and he sits there slugging martinis. It'll never be the same thing as this, because Bourne is a guy who is against the establishment, who is paranoid and on the run. I just think fundamentally they're just very different things.", "The Bond character will always be anchored in the 1960s and in the values of the 1960s. It's so anachronistic when you put it in the world we live in today that 'Mike Myers' (qv) made a fortune with his own spy franchise [Austin Powers] - it makes for great comedy. Bond is an imperialist and a misogynist who kills people and laughs about it, and drinks martinis and cracks jokes. Bourne is a serial monogamist whose girlfriend is dead and he does nothing but think about her. He doesn't have the support of gadgets, and he feels guilty for what he's done.", "(On being seen as a 'nice' celebrity) I don't hold myself to some higher standard of behavior. You don't have to do a lot to be seen as nice. I guess some of these people must be such rampant pricks that people are amazed when you say hello. I don't know why people like me, and I don't know if I want to know. That might be the kiss of death. I'd rather people not know a lot about me and go see the movies.", "You've given an aging suburban dad the ego-boost of a lifetime. (On being named People magazine's Sexiest Man Alive 2007)", "(On celebrity campaigns against such things as childhood poverty and disease) Look, I would much rather people were listening to politicians about this than actors. But the politicians aren't talking about this, you know.", "(Talking about working with 'Robert De Niro' (qv) in _The Good Shepherd (2006)_ (qv)): I think I can say I'm a better actor after having worked with 'Robert De Niro' (qv).", "(On his favorite roles) _Good Will Hunting (1997)_ (qv) is so close to my heart because my best friend ['Ben Affleck' (qv)] and I invented him, he's from Boston, and it was what we knew. The stakes were pretty high with \"Good Will Hunting\" and it worked out as best as it can in this business - people saw the movie, it got good reviews, I was happy with the finished product, and they gave us an Oscar. I am also pretty fond of \"Tom Ripley\" - playing smart and sinister is just so much fun. I wasn't that fond of his choice of swim trunks, though, so a few points away for that. And \"John Grady Cole\" in _All the Pretty Horses (2000)_ (qv) was good, too. The integrity of that character is admirable. Unfortunately, I am the only one who saw that movie, so no one will get that reference.", "You do the actuary tables, there's a one out of three chance, if not more, that McCain doesn't survive his first term, and it'll be President Palin. It's like a really bad Disney movie, 'The Hockey Mom.' Oh, I'm just a hockey mom from Alaska, and she's president. She's facing down 'Vladimir Putin' (qv) and using the folksy stuff she learned at the hockey rink. It's absurd.", "(On James Bond) He's repulsive. Bond is an imperialist, misogynist, sociopath who goes around bedding women and swilling martinis and killing people. The movies have a formula, they stick to it, and it makes them a lot of money. They know what they are doing and they're going to keep doing it.", "[on the difference between Jason Bourne and James Bond] He's not like Bond, who goes on individual missions. I mean, you could make Bond movies forever, because you'd start each film at the beginning of a new mission. But Bourne isn't built that way, unfortunately.", "[on 9/11] That day is seared into who I am more than I'd even like. It was weird because I stepped outside my apartment, looked up and saw it happening and then went back in and just watched CNN because I just wanted information. I remember everything about that day.", "Ask anybody on the street which actors starred in the \"Ocean's\" movies, and they'll tell you it was George [Clooney] and Brad [Pitt]. I'm 'support' in \"Ocean's\". As I was in _Saving Private Ryan (1998)_ (qv) - Tom [Hanks] carried that movie. You could accuse me of piggybacking on other people's brilliance more than anything.", "[on the Oscars] They should give them out 10 years later, like the way they do the Hall of Fame in baseball. They do it in five years, but if you did 10 years later, if this year (2010), we were voting on what was the best picture of 2000, I think it would be much more honest. It's like, when you pick up great old movies and you go, why the hell didn't Brando win the Oscar for this one? Who won that year? Whatever the sizzle was about that year. 50 years later you're looking at a movie and going, this is a historic cinematic performance.", "[on the possibility of a fourth Jason Bourne movie] I don't know, you know. I think it will be a prequel of some kind with another actor and another director before we (himself and director 'Paul Greengrass' (qv)) do another one. I think we are probably five years away from another one. We gotta get a script.", "I want to direct someday and I can't really pass up the chance to work with the people I'm getting to work with. I've worked with 'Paul Greengrass' (qv) three times now, and 'Clint Eastwood' (qv) twice, and 'Steven Soderbergh' (qv) five or six times, and the Coen Brothers this month. As long as that keeps happening, I can't see myself taking time off, unless the work dried up.", "Usually the scripts I get have got 'Brad Pitt' (qv)'s fingerprints on them, or 'Leonardo DiCaprio' (qv)'s.", "I've come to believe that the best way, if we really wanted to try to give out awards, would be to wait at least ten years.", "I'm becoming far more interested in just functionality and making sure my body is as strong as it can be so I can swing my kids around and not worry about aches and pains.", "[on what kind of political leadership he supports] Somebody who believes that building a strong, solid, educated middle class is ultimately the best thing for America. Someone like FDR. There's a misconception that leaders lead. They don't. They follow. Every great movement has come from the bottom up.", "[on how he would react to a pandemic in real life] I have the benefit of knowing the virologist Ian Lipkin, our technical adviser [on _Contagion_]. He's not the guy to talk to if you don't want to get paranoid. He will freak you out. But I would follow his advice during an outbreak.", "Working with Steven [Soderbergh] is very different from working with anybody else. He takes the hocus-pocus out of making movies, and I like that.", "I'm always cautious about overstepping any boundaries. At the end of the day, it's a director's medium, and if they don't want to hear from me I just step back.", "As disturbed as I am by a lot of the things that Obama has done and is doing, I would not have preferred a Romney presidency, that's for sure. The alternative is even more frightening.", "I think the values that I have are consistent with the values I was raised with. I vote against my own self-interests constantly. I campaign against my own self-interests. If you're born with a silver spoon in your mouth, you're probably more likely to be the Koch brothers and think that you shouldn't pay taxes on things. I think it's just a question of where you come from.", "[in defence of friend 'Ben Affleck' (qv), being criticized for agreeing to controversial casting].You know, he's not playing King Lear. It's Batman!", "All you have in the end is to look back and like the choices you've made.", "Does [Sarah Palin] really believe that dinosaurs were here four thousand years ago? I need to know that. Because she's going to have the nuclear codes.", "(2012) When I turned 40 I had my whole family and some friends together. I realized I had to make a toast and hadn't thought of anything to say. I stood up, and what came to me seemed incredibly true in the moment and even more so as time has gone by. I said, \"I think I might actually be the luckiest guy on earth. I really might be him.\" And nobody in the room reflexively said, \"Bullshit,\" because I am so lucky to have Lucy, my kids, my friends and this job. It's been an unbelievable life. So I'm just looking for health and to stay in this groove as long as I can.", "(2012) One of the scariest things I've ever had to do was the underwater scene in the second Bourne movie, where the car goes into the river and I've lost the love of my life. I didn't want to do that at all. So I wouldn't be constantly aware of how scared I am of drowning, I had to go to a pool with this great stunt guy and dive master a couple of times a week for a month or so to train me to relax underwater without an oxygen mask and with a blindfold and, later, to do simple tasks underwater like tying a shoe... After we shot for one day, that night I woke up probably four times gasping for breath, thinking I was drowning. It was terrible. When you make movies, you end up being trained to do really weird things you don't do anywhere else.", "(2012, on turning down roles) Having to say no to _Avatar (2009)_ (qv) was tough because I particularly wanted to work with 'James Cameron' (qv), and still do, because he's fantastic. He knew he was the star of that movie and that everyone was going to go see it anyway. When he said, \"Look, I'm offering it to you, but if you say no, the movie doesn't need you,\" I remember thinking, Oh God, not only do I have to say no because of scheduling, but he's going to make a star out of some guy who's going to start taking jobs from me later... _Milk (2008)_ (qv) was another hard one because I was excited it would have been for 'Gus Van Sant' (qv), and I would have had the chance to do scenes with 'Sean Penn' (qv). They pushed the schedule and it ran into the slot for _Green Zone (2010)_ (qv). 'Steven Soderbergh' (qv)'s mantra is \"The movie gets the right person; the right actor gets the part,\" but I was like, \"Shit, no. That was my part.\" But when I saw _Milk (2008)_ (qv), 'Josh Brolin' (qv) was so fucking good that I knew Soderbergh was right. Way back, Gus and I talked about my doing _Brokeback Mountain (2005)_ (qv) with 'Joaquin Phoenix' (qv), but I had just done _The Talented Mr. Ripley (1999)_ (qv) and _All the Pretty Horses (2000)_ (qv), so I said, \"Gus, let's do it in a couple of years. I just did a gay movie and a cowboy movie. I can't do a gay cowboy movie now.\" The right actor got the part. 'Heath Ledger' (qv) was magnificent.", "(2012) I learned that I am afraid of heights. When I was doing Syriana, they arranged for my wife, Lucy, and me to go up to watch the sunset over the Arabian Peninsula from the top of that seven-star Dubai hotel that's shaped like a sail, the Burj Al Arab. So we go to the very top-60 stories or something-we're given champagne, and we go, \"Oh my God, this is great.\" But as I started to walk toward the edge, my legs locked up. I was absolutely frozen. I completely jumped my neocortex and went straight to this primal, full lizard-brain fear state. Lucy was walking all around the edge, while I was about to collapse from fear. She thought it was hysterical.", "[on working with 'Robert De Niro' (qv) in The Good Shepard] I learned a lot of things I didn't know and I remembered a lot of things I'd forgotten and that \"disappearing\" into work for ten years and working constantly... you can get into some bad habits.", "[How he felt after winning his first Oscar]I remember going back home and I couldn't sleep so I was just sitting there looking at the award and I remember thinking very clearly and said to myself thank God I didn't fuck anyone over for this.", "[Describing what he did and how he felt after winning an Oscar for Best Screenplay for Good Will Hunting] I remember going back home and I couldn't sleep so I was just sitting there looking at the award and I remember thinking very clearly and said to myself thank God I didn't fuck anyone over for this. I felt so blessed because I won it at such a young age. I couldn't imagine how it would feel to chased it my entire career and not ever getting it.", "The ingredients of my ideal taco, oh my god. Fantastic question. My ideal taco is actually the taco I'm not supposed to have which is the taco we have on taco night at my house. It's the crunchy corn shell with the good meat, just ground beef in there. It's all about the layering. The meats gotta be hot, and the cheese goes on first so that it melts. And then you're gonna get in there with a little bit of tomato and lettuce but not too much cause it's not a salad, it's a taco, and then you're gonna throw some avocado on top and some sour cream and then a bunch of cholula. I don't know if you know what cholula hot sauce is but it's the best. Throw a bunch of cholula on there, maybe squeeze some lime on top, and go to town.", "[on the difference of getting in shape from the first Bourne movie to the most recent one] It's a lot harder. I'm 45 years old, everything is harder. I remember during the first Bourne movie I was 29 and I boxed for six months, I was lifting weights and that's just one of the hard parts. A lot of the hard parts was the diet: I love eating and going out, drinking good wine, eating good food with my wife, so that was my sacrifice but that's not a lot to sacrifice because ultimately you get to make a movie you really want to make.", "[5 ways he is not Jason Bourne] First all the languages he speaks, they're all languages that I wish I spoke, the way he fights, I certainly can't fight like that, his a lot more tortured than I am, I've got a great wife, and he definitely doesn't have one, and I've got kids.", "[on living with 5 women, his wife and daughters]Yeah it's a lot of estrogen, sometimes I need to talk a walk by myself.", "[Why he came back to do another Bourne film] I said I wouldn't do it without 'Paul Greengrass' (qv) and it was always we'd talk about, we' re always looking for projects for us to do together and after a while we felt like \"we're kind of like dicks if we don't do another Bourne film. So when we knew we wanted to it became a question of what would the movie be? And what's the story?, How would the characters interact? so it took a few more years to figure it out.", "[on the best advice, his been given] when I was younger, everybody told me not to be an actor and to this day I say that to people who come up to me and say I'm thinking about going into acting, what'd you think? I say absolutely not. It's a terrible idea don't do it, because that's what everyone said to me and I think if you're going to make it in this business that is full of rejection and hardship you need to believe in yourself despite what everybody you love and trust tells you.", "[advice from his high school acting teacher Gerry Speca] five words: just do your work kid. And he repeated that so many times to me and that is what I can always retreat to, that's my touch stone, when in doubt, just focus on the work, if everything on the movie is going wrong, I'll just make sure my work is tight and done.", "[Responding to question, \"Have you ever met Trump?\"] \"No. The deal was that if you wanted to shoot in one of his buildings, you had to write him in a part. [Director] Martin Brest had to write something in Scent of a Woman - and the whole crew was in on it. You have to waste an hour of your day with a bullshit shot: Donald Trump walks in and Al Pacino's like, 'Hello, Mr. Trump!' - you had to call him by name - and then he exits. You waste a little time so that you can get the permit, and then you can cut the scene out. But I guess in Home Alone 2 they left it in.\" (2017)", "[on producer 'Harvey Weinstein' (qv) and his sexual harassment scandal] When people say 'everybody knew' - yeah, I knew he was an asshole. He was proud of that. That's how he carried himself. And I knew he was a womanizer. I wouldn't want to be married to the guy. But that's not my business. [Oct. 2017]"], "salary history": ["_The Good Old Boys (1995)_ (qv)::$20,000", "_Good Will Hunting (1997)_ (qv)::$300,000 (split $600,000 script sale with 'Matt Damon' (qv))", "_Rounders (1998)_ (qv)::$600,000", "_The Talented Mr. Ripley (1999)_ (qv)::$5,000,000", "_The Legend of Bagger Vance (2000)_ (qv)::$7,000,000", "_All the Pretty Horses (2000)_ (qv)::$5,500,000", "_Ocean's Eleven (2001)_ (qv)::$5,000,000", "_The Bourne Identity (2002)_ (qv)::$10,000,000", "_The Brothers Grimm (2005)_ (qv)::$10,000,000", "_The Bourne Ultimatum (2007)_ (qv)::$20,000,000", "_The Martian (2015)_ (qv)::$15,000,000 to $25,000,000"], "birth date": "1970-10-08", "birth notes": "Boston, Massachusetts, USA", "_actorID": "19", "_source": "IMDB", "actorID": "0000354", "created_utc_dt": "09/14/2019, 13:01:29"}