{"headshot": "https://m.media-amazon.com/images/M/MV5BMjFhNTM3NDItMDllNC00YzAyLThmY2QtYmViMjBjODJjODdiXkEyXkFqcGdeQXVyMDU5Njk5MQ@@._V1_UY98_CR1,0,67,98_AL_.jpg", "birth name": "Shia Saide LaBeouf", "height": "5' 9¼\" (1.76 m)", "mini biography": ["Shia Saide LaBeouf was born in Los Angeles, California, to Shayna (Saide) and Jeffrey Craig LaBeouf, and is an only child. His mother is from an Ashkenazi Jewish family, while his father has Cajun (French) ancestry. His parents are divorced. He started his career by doing stand-up comedy around places in his neighborhood, such as coffee clubs. One day, he saw a friend of his acting on _Dr. Quinn, Medicine Woman (1993)_ (qv), and wanted to become an actor. Shia and his mother talked it over, and the next day, he started looking for an agent. He searched in the yellow pages, called one up, and did a stand-up routine in front of him. They liked him and signed him, and then he started auditioning. He is well known for playing Louis Stevens on the popular Disney Channel series _Even Stevens (2000)_ (qv) and has won a Daytime Emmy Award for his performance. His best known role is as Sam Witwicky, the main protagonist of the first three installments of the Transformers series: _Transformers (2007)_ (qv), _Transformers: Revenge of the Fallen (2009)_ (qv) and _Transformers: Dark of the Moon (2011)_ (qv).::anonymous"], "spouse": ["'Mia Goth' (qv)::(10 October 2016 - present) ( filed for divorce)"], "trivia": ["Named after his grandfather, Szaja Yeshayhu Saide, who was also a comedian. Szaja was born c. 1913 in Bialystok, Poland.", "Attended the prestigious Hamilton Academy of Music in Los Angeles, California. Fellow alumni are 'Emile Hirsch' (qv), 'Fernanda Romero' (qv), 'Frank Miranda' (qv), 'Will Rothhaar' (qv), 'Rachel Kiri Walker' (qv), 'Candace Lifson' (qv), 'Kyla Pratt' (qv), 'Kaitlin Doubleday' (qv) and 'Cherish Lee' (qv).", "Attended and graduated from Alexander Hamilton High School (2003).", "His first name is pronounced to rhyme with \"hiya\" and his last name is pronounced \"La-buff\".", "Enjoys playing the drums and making independent short films with his friends.", "His favorite movies are _Dumb and Dumber (1994)_ (qv), _American Beauty (1999)_ (qv) and _Saving Silverman (2001)_ (qv). He was in the prequel, _Dumb and Dumberer: When Harry Met Lloyd (2003)_ (qv).", "For music, he likes to listen to 'System of a Down' (qv), '50 Cent' (qv), 'Eminem' (qv), 'D12' (qv), 'Led Zeppelin' (qv), 'Jack Johnson' (qv), 'Ben Folds' (qv) and others. His film _Disturbia (2007)_ (qv) features a song by 'System of a Down' (qv), \"Lonely Day\".", "Is involved with 'Joe Torre' (qv)'s Give Back to the Children's Fund.", "When younger, he attended 32nd Street USC Visual and Performing Arts Magnet.", "Performed alongside hip-hop MC 'G. Money' (qv) at the Viper Room. [January 2005]", "Sometimes plays basketball with _Lizzie McGuire (2001)_ (qv) star 'Adam Lamberg' (qv).", "Started a hip-hop group/record label (Element) and a film production company (www.grassyslope.com) with fellow actor and best friend 'Lorenzo Eduardo' (qv).", "Grew up in Los Angeles, California with actor 'Bo Barrett' (qv).", "His second father and mentor was 'Jon Voight' (qv).", "His French-Cajun father, Jeffrey LaBeouf, was a clown from San Francisco who spent time in France studying commedia dell'arte.", "His mother, Shayna LaBeouf, was a former ballet dancer from New York who once studied with 'Martha Graham' (qv). She also once ran a head shop across the street from Tompkins Square Park.", "When he was a child, he and his parents would dress up like clowns and sell hot dogs in the park across the street from their apartment.", "Growing up, he resided in an apartment on Glendale Boulevard in Los Angeles, California.", "Grew up in Echo Park, Los Angeles, California.", "Considers _The Greatest Game Ever Played (2005)_ (qv) as his transition movie from child actor to adult actor.", "When he was a guest on _Late Show with David Letterman (1993)_ (qv) during the hype for _Transformers (2007)_ (qv), Dave asked Shia how his name originated. Shia responded saying that the name \"Shia\" was Hebrew for Praise God and his last name \"LaBeouf\" was French for Beef, hence the phrase \"Praise God for Beef\".", "Had only two days off between finishing the shooting of _Disturbia (2007)_ (qv) and beginning that of _Transformers (2007)_ (qv).", "Ranked #7 on Yahoo! List of 10 Most Popular Stars of 2007 on Yahoo! Movies (2007).", "Ranked #4 on Interview magazine's Hollywood faces to watch \"Future Stars of Tomorrow\".", "Ranked #24 on Entertainment Weekly's \"30 Under 30\" the actors list (2008).", "'Dustin Hoffman' (qv), 'Jon Voight' (qv), 'Jodie Foster' (qv) and 'John Turturro' (qv) are his inspirations.", "At age 13, he celebrated his Bar Mitzvah (the traditional coming-of-age ceremony for Jewish boys).", "In July 2008, he was arrested for driving under the influence after being involved in a car accident. The accident left him with a damaged hand. He had to undergo extensive surgery that lasted for at least four hours. His injury was written into _Transformers: Revenge of the Fallen (2009)_ (qv) from which he had to take some time off after the crash. In January 2009, his driver's license was suspended for a year as a consequence of his refusing blood-alcohol-level testing after the accident.", "Ranked #6 on Moviefone's \"The 25 Hottest Actors Under 25\". [2008]", "Wants to star in a biographical film about New York Horror-Core MC and personal friend 'Chris Palko' (qv).", "His driver's license was suspended for a year in January 2009, as a consequence of refusing blood-alcohol-level testing after his car accident in 2008.", "His family name does not actually mean \"the beef\". As spelled, it is a Cajun deformation of the original French name \"LeBoeuf\". \"Le\" instead of \"La\" because in French, \"Beef\" or \"Boeuf\" is masculine and the correct way the name is spelled is \"Leboeuf\" or \"LeBoeuf\". As so often happened in Louisiana, the name became deformed because the French sent there could say their name but could not read or write French correctly. \"Beouf\" is not a French word or name. There is no such name as \"Labeouf\" or \"LaBeouf\" in French. Correctly spelled it would mean \"the beef\" in the singular tense.", "He topped Forbes magazine's list of actors who give movie studios the best return on their investment, with his films earning an average of $160 for every $1 he is paid (2009).", "Has appeared in five movies that feature sentient technology: _I, Robot (2004)_ (qv), _Eagle Eye (2008)_ (qv), _Transformers (2007)_ (qv), _Transformers: Revenge of the Fallen (2009)_ (qv) and _Transformers: Dark of the Moon (2011)_ (qv).", "Currently resides in Sherman Oaks, California.", "Has appeared twice on the cover of GQ magazine: June 2008 and April 2010.", "Was accepted at Yale University but has not attended.", "His father has Cajun (French) ancestry while his mother is of Ashkenazi Jewish descent. Shia's maternal grandfather, Szaja Yeshayhu \"Sam\" Saide, was a Polish Jewish emigrant, who was born in Bialystok, and moved to the United States in 1930. Shia's maternal grandmother, Mary Ann Rosen, was born in New York City, to Russian Jewish parents.", "Attended the world premiere of _Transformers: Revenge of the Fallen (2009)_ (qv) at Roppongi Hills in Tokyo, Japan on June 9, 2009.", "Attended the premiere of _Transformers: Revenge of the Fallen (2009)_ (qv) at Yongsan CGV Theaters in Seoul, South Korea on June 9, 2009.", "Attended the premiere of _Transformers: Revenge of the Fallen (2009)_ (qv) at the Sony Center CineStar in Berlin, Germany on June 14, 2009.", "Shia's film TAKEMEANYWHERE was accepted into the 2017 Williamsburg Independent Film Festival.", "Attended the premiere of _Transformers: Revenge of the Fallen (2009)_ (qv) at Odeon Leicester Square in London, England on June 15, 2009.", "Attended the premiere of _Transformers: Revenge of the Fallen (2009)_ (qv) at the Oktyabr Theater in Moscow, Russia on June 16, 2009.", "Was considered for the role of Jimmy Olsen in _Superman Returns (2006)_ (qv), which went to 'Sam Huntington' (qv).", "Once spent three days non-stop watching his own movies in a theater, which he filmed himself.", "He was first arrested for stealing Nike Cortezes sneakers from a store in Pacoima, California.", "Became engaged to his longtime girlfriend 'Mia Goth' (qv). [March 2016]", "Before casting 'Armie Hammer' (qv), 'Shia LaBeouf' (qv) traveled to New York to do a reading for _Call Me by Your Name (2017)_ (qv), and according to producer/screenwriter 'James Ivory' (qv), he was great, but as time passed, LaBeouf lived up to his reputation, with various troubles, so the production company felt they couldn't wisely go with him.", "(September 25, 2018) Has filed for divorce from his wife of 23 months 'Mia Goth' (qv)."], "quotes": ["[when asked about what it's like to be a celebrity] I'll tell you when I become one.", "[when asked about what type of girls he likes] I like the dark, mysterious, maybe even gothic type girls. They have to have a good personality, too. I'm very picky.", "I got to grow up in a situation where drugs were demonic. To watch your dad go through heroin withdrawal is something that would keep you from doing any of that yourself.", "I'm not an Adonis, that's for damn sure. I've never really thought of myself that way, and it doesn't matter to me. My favorite actors aren't Adonises. 'Dustin Hoffman' (qv) is a flawed-looking man; he's amazing to me. 'Tom Hanks' (qv) is flawed-looking; people love him. Same with 'Gene Hackman' (qv).", "I was billed as the ten-year-old kid with the 50-year-old mouth. I knew if I wanted to work in the business, funny would be good because I looked like 'Garry Shandling' (qv).", "Clubs are so lame. Nobody even dances at these clubs. They stand around and get drunk and they schmooze. There is no enjoyment factor. You get so many invites... partying has never interested me. My dad was a drug addict. There's something about watching your dad go through heroin withdrawal when you're 11. It's not interesting anymore. I'm not individualizing this. There are lots of kids that deal with this. I'm an '80s baby; that's what was going on.", "[on his co-star 'Harrison Ford' (qv)] I've been fortunate enough to work with Harrison on _Indiana Jones and the Kingdom of the Crystal Skull (2008)_ (qv), and I can honestly say it is a dream come true. He's a man's man. And he's incredible because he make movies even better, because we love him as much as Indy hates snakes, and because he's captain of the goddamn Millennium Falcon!", "Talent is funny, I've always looked at talent like, \"Wjat the hell does talent really mean?\". Talent is to actors what luck is to card players. It's not really anything, it's just a fictitious word that people have created and labeled things. Talent is like, you know, I never really believed in talent, I believed in drive and determination and preparation but talent is sort of like luck. I wouldn't want to think of myself as talented, it doesn't seem like there's any validity in that. I like to think of myself as an ordinary man with extraordinary determination. That's it.", "[on his co-star 'Megan Fox' (qv)] She is a very attractive girl. Very attractive. And she's a very close friend. But it hasn't been a romantic thing, because you're trying to respect the work environment. You don't push anything. And with sex and romance, things can become so convoluted so fast.", "[on dating 'Rihanna' (qv)] It never got beyond one date. The spark wasn't there. We weren't passionate about each other in that way, so we remain friends.", "There's no patriotism. There's selfishness. It's the movie _Wall Street (1987)_ (qv). Pure selfishness, \"Greed is good\", It really happened. People don't look at that character, Gordon Gekko, and see an enemy. They look at him like they look at _Scarface (1983)_ (qv), a kind of role model. \"Hell, yeah. That's the guy! That's the superman!\" Well, that's our pop culture. That's its values.", "My generation will actually be the first generation that is tamer than the one that came before it, and it will probably be poorer; less fun and less money. It's ridiculous. In my parents' generation, rebellion was pop culture. It's not anymore. You can see it in something as simple as where their music was at and where ours is now. If you look at our Billboard Top 100, a lot of those songs on there are from Christian country artists. A lot of rappers, too, are very Christian. The fact that religion is even still talked about is kind of wild to me. I think my generation understands it, but they are too selfish to let it matter.", "I come from hippies. My dad was a wandering dude recovering from the war in Vietnam. And my mom, before she met him, had a head shop in Brooklyn. 'Bob Dylan' (qv) used to come in and smoke weed. All her furniture hung upside-down from the ceiling. She was out of her mind. It was the 1970s.", "Actors live dependent on being validated by other people's opinions. I don't understand what it is I do that people want. I don't know what an actor does. I have no credentials. I don't know what I'm doing. To my mind, talent doesn't really exist. Talent is like a card player's luck. It is motivation, ambition, and luck. It's just a drive to be the best. I think acting is a con game.", "I know I'm one of the luckiest dudes in America right now. I have a great house. My parents don't have to work. I've got money. I'm famous. But it could all change, man. It could go away. You never know.", "Most actors on most days don't think they're worthy. I have no idea where this insecurity comes from, but it's a God-sized hole. If I knew, I'd fill it, and I'd be on my way.", "Sometimes, I feel I'm living a meaningless life and I get frightened.", "[on _Transformers: Revenge of the Fallen (2009)_ (qv)] There are a lot of people that liked the second one, but I hated it. I just didn't enjoy it. I thought we missed the mark. I got confused, I couldn't see what the fuck was going on, you know with certain robots . . . I couldn't decipher what was happening. There were story line paths that I just wouldn't have gone down.", "[on _Transformers: Dark of the Moon (2011)_ (qv)] I know that directors 'Michael Bay' (qv) and 'Steven Spielberg' (qv) are dedicated to making the best movie we possibly can, and we're not going to miss next time.", "[on his career] I hope I will never go to the 'Robert De Niro' (qv) stage where I've gotten there and I am comfortable. Because that's the death of an actor. Look at 'Dustin Hoffman' (qv), he is still striving, pushing and fighting. Comfort is the end.", "[on acting] This is a dream. At first, it was just fun, and a great way to pay the rent, but I gradually realized that there's an art to this, and if I try, I can do it well. I shouldn't say I realized that, because it was really more a case of my being taught that lesson, by 'Jon Voight' (qv), when we made _Holes (2003)_ (qv) together. He just became a real mentor to me, and his wisdom, his years of experience, just gave me a whole new perspective on what I'm doing. I've always tried to do the best job I possibly can in every movie since.", "[on being directed by 'Oliver Stone' (qv) in _Wall Street: Money Never Sleeps (2010)_ (qv)] I felt outclassed as an actor. The first meeting I had with Oliver, he looked me in the eye and said, \"Don't worry. 'Tom Cruise' (qv) wasn't an actor before he met me, either.\" I've never been so scared into submission. He frightened me to the depths of my being.", "[in 2011, on meeting 'Michael Bay' (qv) and getting cast in _Transformers (2007)_ (qv)] I did a screen test and they sent my dailies to Michael, and Michael asked to meet with me. I still hadn't met Steven ['Steven Spielberg' (qv)] at this point. I went and sat down with Michael; he had me read these really generic lines for what seemed like a stand-up routine; the character was--it was a neurotic monologue. And then he asked me to ad-lib my own separate monologue on the tail end of it and then combine the two of them, and then run in this parking lot and do the monologue, and then run up the stairs and do the monologue, and then do push-ups and do the monologue. Stuff like that--I mean literally, literally, literally. And then we went downstairs, and we talked about my upbringing and all that, and my family. We started talking about the stand-up routine and then he asked me to do some of my stand-up routine for him, which I did. Not long after that-maybe a week later-I was still shooting _Disturbia (2007)_ (qv), that tape had gone to Steven and he had signed off, and Michael said that he had signed off, and they were working on my deal. Michael told me there was a guy in London who, if I didn't sign up for, you know, a rebated deal [would replace me]. My whole thing was I wanted to work with Michael, because first and foremost, I'm a true fan of Mike's movies. There's not one movie he's made that I'm not entertained by--not one. Not one where I don't watch the entire thing all the way through. And there are a lot of movies I can't get through. If there's anything to say about Michael: he makes entertaining films. He knows his audience. When I met Mike, I was a 17-year-old boy. He was my fucking god. And meeting him in person was a very different thing; he's not at all this alpha male, this machismo legend shit--he's not any of these things. When he's on set, he's different; when he's on set, he's a leader, a general; he's relentless. He's precise and he's specific and he's determined; he's outrageously committed. He never flinches in a firefight. He's always there for you; when the going gets tough, he never flinches. He's helpful; he's confident; he's a risk-taker. But he's also completely unreasonable and irrational sometimes and emotional and aggressive and demanding. He's my coach; I love him; he's my captain. When we're on set, he's my ace. He's my best friend, but he's also my worst enemy. He's blunt with women; he lacks tact--especially on the stage that we're on, there's no time or room for talking around feelings. Sometimes it does have to be blunt. And Mike is good at that. He's very goal-oriented; he's motivated. He's smart as fuck. He knows exactly what he wants; he understands his audience. I think the dude is a genius; I think he's a visionary. He's the greatest action director in film, I think. I'm proud that I've been able to work with him. You know what he is? New York. If you can make it on a Bay set, you can make it on any set. He's really good.", "[on being done working in the studio system] I'm done. There's no room for being a visionary in the studio system. It literally cannot exist. You give 'Terrence Malick' (qv) a movie like _Transformers (2007)_ (qv), and he's fucked. There's no way for him to exist in that world.", "[working independently versus working with studios] These dudes [Voltage Pictures] are a miracle. They give you the money, and they trust you--[unlike the studios, which] give you the money, then get on a plane and come to the set and stick a finger up your ass and chase you around for five months.", "[on deciding to work with 'Lars von Trier' (qv) on _Nymphomaniac: Vol. I (2013)_ (qv)] Because he's dangerous. He scares me. And I'm only going to work now when I'm terrified.", "[on deeply regretting what he said about _Indiana Jones and the Kingdom of the Crystal Skull (2008)_ (qv) and how it negatively affected his relationship with 'Steven Spielberg' (qv)] He told me there's a time to be a human being and have an opinion, and there's a time to sell cars. It brought me freedom, but it also killed my spirits because this was a dude I looked up to like a sensei.", "[on advice 'Robert Redford' (qv) gave him on set of _The Company You Keep (2012)_ (qv)] I wound up getting into a bar fight. I have to go to work the next day with [Redford] and 'Stanley Tucci' (qv). And I need to get my confidence back. And now I'm sitting in front of legends, and I feel like a [jerk]. And Bob goes, \"Come with me.\" And he shows me scenes that we had been shooting. And then he goes, \"Listen to me. The only thing that matters is the work, kid.\" And that was it.", "[on his comments about being done with working within the studio system and them being taken out of context] I'm a fallible human being. I speak my mind and my heart. And sometimes that gets me into hot water. All I'm really trying to say in the most politically sensible way is, \"Thank you so much for giving me the opportunities, I would just like to make movies about people now.\" That's it.", "My dad used to watch cowboy movies with me. And anytime some cowboy would say something eloquent or poignant, my dad would stop the movie, rewind it and play it again. \"Did you get that? Okay.\" Then we'd watch the rest of the movie. And this is most of my childhood.", "[on all the wealth he as accrued over the years] If I could give the money back and get all the credibility in the world that I'm seeking, I would do it tomorrow. In a heartbeat.", "[on the prospect of actually having to have sex in _Nymphomaniac: Vol. I (2013)_ (qv)] There are rules. I have ethics, I'm not completely out of my mind. But I don't think there's anything wrong with sex. Sex is beautiful if it's done right. And I wouldn't just do it for no reason . . . Sex is different than love, and there is a separation, and that middle gap is what the movie's about.", "[on 'Lars von Trier' (qv) and _Nymphomaniac: Vol. I (2013)_ (qv)] Von Trier is very dangerous. He's the most dangerous dude that I've ever showed up for. I'm terrified. I'm so terrified, which is why I have to go. We'll see what happens. The movie is what you think it is. It is 'Lars von Trier' (qv), making a movie about what he's making. For instance, there's a disclaimer at the top of the script that basically says we're doing it for real. Everything that is illegal, we'll shoot in blurred images. Other than that, everything is happening.", "[on his mother] Shayna LaBeouf is her name, she's like, 4'3, she's a little Jewish woman, who married this 7' tall Cajun guy. And made me. That's where you get me!", "[on his family name's unusual spelling] In French, LaBeouf means \"beef\", but mine is spelled wrong. It should be \"LaBoeuf\". My grandmother was a beatnik lesbian in the '50s, who hated her family and decided to change the spelling, and it's been that way ever since. So you go to France and people are like, \"LaBeouf? You have an illiterate last name.\" By the way, Shia is a bad four-letter word in French. So the literal translation of my name is \"Shit the Beef\". Kind of rock-starry, isn't it?", "I'm a dude who loves delusion. It's why I love being an actor--I never have to actually look at myself or be faced with my shit or take responsibility.", "I've been a runner my whole life, running from myself. Whether to movies or drinking and drugging or fucking calamity or whatever it is, I've always been running.", "They put people in a fucking home for doing what we do for a living. You have to abandon yourself to delusion. If you're going to work in that way, you have to work with people who can referee you. You need a lion tamer who you respect.", "You can't fast-forward experience. I'm not a very intelligent person, and you've got to be a fucking genius to learn from other people's mistakes, because you've got to be a very smart man to learn from your own.", "I'm willing to do anything and everything. It's not good for my personal life. But neither is being bad. I'd rather be anything but bad.", "The only thing my father gave me that was of any value to me is pain.", "Megan [Fox] developed this Spice Girl strength, this woman-empowerment [stuff] that made her feel awkward about her involvement with Michael [Bay], who some people think is a very lascivious filmmaker, the way he films women. Mike films women in a way that appeals to a 16-year-old sexuality. It's summer. It's Michael's style. And I think [Fox] never got comfortable with it. This is a girl who was taken from complete obscurity and placed in a sex-driven role in front of the whole world and told she was the sexiest woman in America. And she had a hard time accepting it. When Mike would ask her to do specific things, there was no time for fluffy talk. We're on the run. And the one thing Mike lacks is tact. There's no time for [LaBeouf assumes a gentle voice] 'I would like you to just arch your back 70 degrees.'", "The script [Borg vs McEnroe] is brilliant. We are all here because of that. I cried the first time I read it. It's not based on a book or a biography. It's based on hard work.", "I haven't met him [John McEnroe] yet, but I'm eager to meet him before we shoot. I got nothing but love and respect for him.", "Yes, they [Scandinavian directors] make better movies. Scandinavian filmmaking is different. It's a different pace, a different relationship to the crew - the bonds are different."], "salary history": ["_Bobby (2006)_ (qv)::$400,000", "_Disturbia (2007)_ (qv)::$400,000", "_Surf's Up (2007)_ (qv)::$400,000", "_Transformers (2007)_ (qv)::$750,000", "_Transformers: Revenge of the Fallen (2009)_ (qv)::$5,000,000", "_Wall Street: Money Never Sleeps (2010)_ (qv)::$8,000,000", "_Transformers: Dark of the Moon (2011)_ (qv)::$15,000,000"], "birth date": "1986-06-11", "birth notes": "Los Angeles, California, USA", "_actorID": "72", "_source": "IMDB", "actorID": "0479471", "created_utc_dt": "09/14/2019, 13:02:18"}