{"headshot": "https://m.media-amazon.com/images/M/MV5BMTI5NDY5NjU3NF5BMl5BanBnXkFtZTcwMzQ0MTMyMw@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Sandy", "America's Sweetheart", "The Girl Next Door"], "birth name": "Sandra Annette Bullock", "height": "5' 7½\" (1.71 m)", "mini biography": ["Sandra Annette Bullock was born in Arlington, a Virginia suburb of Washington, D.C. Her mother, 'Helga Bullock' (qv) (née Helga Mathilde Meyer), was a German opera singer. Her father, John W. Bullock, was an American voice teacher, who was born in Alabama, of German descent. Sandra grew up on the road with her parents and younger sister, chef 'Gesine Bullock-Prado' (qv), and spent much of her childhood in Nuremberg, Germany. She often performed in the children's chorus of whatever production her mother was in. That singing talent later came in handy for her role as an aspiring country singer in _The Thing Called Love (1993)_ (qv). Her family moved back to the Washington area when she was adolescent. She later enrolled in East Carolina University in North Carolina, where she studied acting. Shortly afterward she moved to New York to pursue a career on the stage. This led to acting in television programs and then feature films. She gave memorable performances in _Demolition Man (1993)_ (qv) and _Wrestling Ernest Hemingway (1993)_ (qv), but did not achieve the stardom that seemed inevitable for her until her work in the smash hit _Speed (1994)_ (qv). She now ranks as one of the most popular actresses in Hollywood. For her role in _The Blind Side (2009)_ (qv) she won the Oscar, and her blockbusters _The Proposal (2009)_ (qv), _The Heat (2013)_ (qv) and _Gravity (2013)_ (qv) made her a bankable star. With $56,000,000, she was listed in the Guinness Book Of World Records as the highest-paid actress in the world.::David Montgomery <djmont@aol.com>"], "spouse": ["'Jesse James' (qv)::(16 July 2005 - 28 June 2010) ( divorced)"], "trivia": ["(April 4, 2000) Her mother, opera singer 'Helga Bullock' (qv), died in Arlington, Virginia.", "Chosen by People (USA) magazine as one of the 50 Most Beautiful People in the World (1999).", "Ranked #58 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Chosen by People (USA) magazine as one of the 50 Most Beautiful People in the World (1996).", "While working on _Two If by Sea (1996)_ (qv), discovered she is allergic to horses.", "She replaced 'Demi Moore' (qv) in _While You Were Sleeping (1995)_ (qv)", "Wrote and performed her own song \"Heaven Knocking On My Door\" in _The Thing Called Love (1993)_ (qv).", "Replaced 'Lori Petty' (qv) in _Demolition Man (1993)_ (qv).", "Her father, John W. Bullock (1925-2018), a voice coach, was born in Birmingham, Alabama, USA, to Jesse Burch Bullock and Mary LaBlanche Wilson, of German descent. Her mother, 'Helga Bullock' (qv) (née Helga Mathilde Meyer; 1942-2000), an opera singer and voice teacher, was German, and was born in Nuremberg, Germany, to Eugen Meyer and Elisabeth Wilhelmine Böhnert.", "Attended East Carolina University in Greenville, North Carolina.", "Attended and graduated from Washington-Lee High School in Arlington, Virginia in 1982. She was a cheerleader. ('Shirley MacLaine' (qv) (who was also a cheerleader) and 'Warren Beatty' (qv) also attended this high school).", "Voted best actress by the readers of the \"US Magazine\" in 1995.", "Voted \"Best Actress\" by viewers of MTV's \"The Big Picture\" in 1994 and 1995.", "Voted \"Most Likely to Brighten Up Your Day\" by her high school class.", "Received the scar on her head when she fell into a lake and cut her head on a rock.", "Her younger sister, 'Gesine Bullock-Prado' (qv), broke Sandy's nose with her elbow while opening a garage door when they were kids.", "Spent time at a Rehabilitation Clinic to research her role in _28 Days (2000)_ (qv).", "Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#27) (1995).", "Was considered for the lead in _Runaway Bride (1999)_ (qv), which went to 'Julia Roberts' (qv).", "Speaks German fluently.", "Was engaged to 'Tate Donovan' (qv).", "Owns a home in Jackson Hole, Wyoming.", "Born at 3:15 AM.", "Has appeared in 'Bob Schneider' (qv)'s music video \"Round and Round\" (2000).", "While filming _28 Days (2000)_ (qv), in New York, she stayed in former co-star 'Dennis Hopper' (qv)'s apartment.", "Replaced 'Nancy McKeon' (qv) on the situation comedy _Working Girl (1990)_ (qv).", "Her younger sister is 'Gesine Bullock-Prado' (qv), a lawyer and Vice-President of Fortis Films, aged 33 (2001).", "Studied ballet when she was a child.", "Loves horses but is extremely allergic to them.", "1998: Golden Globes 'Awards' (qv) Presenter: \"Best Movie Comedy/Musical\"", "Owns a house in Austin, Texas where she filmed some scenes in _Miss Congeniality (2000)_ (qv).", "Uses the ancient Chinese technique of accupuncture as a form of weight loss.", "Is from the same Metro Area as 'Martin Lawrence' (qv), 'Dave Chappelle' (qv), 'Mya' (qv), 'Regina Hall' (qv), 'Alan Heitz' (qv) and 'Dwayne Winstead' (qv).", "Was considered for the role of Lois Lane in a proposed relaunch of the Superman franchise by Warner Brothers and was also considered for the role of Wonder Woman in a film adaptation that was never made.", "Has a house on Tybee Island, Georgia.", "Sister-in-law of 'Raymond Prado' (qv).", "She was originally cast as Rafi in _Prime (2005)_ (qv) but two weeks before principal photography, was dropped due to script differences between her and writer/director 'Ben Younger' (qv). 'Uma Thurman' (qv) stepped in quickly to replace her.", "Known for her generous donations, she donated $1 million to the American Red Cross after the September 11 terrorist attacks in 2001. Did the same, again donating $1 million to the Red Cross, after the tsunami disaster in Asia in 2004. She again donated $1 million, this time to Doctors Without Borders, after the 2010 Haiti earthquake.", "At 40, she was voted sexiest female celebrity in a \"Naughty Forties\" poll conducted for British television station FX.", "After college, she moved to New York to waitress.", "Ranked #18 on Tropopkin magazine's Top 25 Most Intriguing People [Issue #100].", "Ex-stepmother of 'Jesse James' (qv)' children Chandler, Jesse Jr. and Sunny.", "(July 16, 2005) Married actor 'Jesse James' (qv) in a sunset ceremony on a ranch outside Santa Barbara, California. They celebrated with several hundred guests including 'Jamie Lee Curtis' (qv), 'Hugh Grant' (qv), 'Keanu Reeves' (qv), 'William Shatner' (qv), 'Regina King' (qv) and some member of the Hell's Angels.", "Was considered for the role of Nelle Harper Lee in _Capote (2005)_ (qv), and later got the role in _Infamous (2006)_ (qv). Both films concern 'Truman Capote' (qv)'s researching and writing of _In Cold Blood (1967)_ (qv).", "Often said to be one of the last actors to have studied with the great teacher, 'Sanford Meisner' (qv), who trained 'Robert Duvall' (qv), 'Diane Keaton' (qv) and 'Joanne Woodward' (qv) at the Neighborhood Playhouse. Sandra, most likely, did not work with the great man, himself, but with a number of actors who did: 'Ron Stetson' (qv), 'Richárd Pintér' (qv) and Dan Biehn, the latter taught her at East Carolina University.", "Has played the love interest of both stars of _Nip/Tuck (2003)_ (qv). She played the girlfriend of 'Dylan Walsh' (qv)'s character in _The Lake House (2006)_ (qv) and the wife of 'Julian McMahon' (qv)'s character in _Premonition (2007)_ (qv).", "Named Empire magazine's #66 in the list of 100 Sexiest Stars (2007).", "In 2007, Forbes magazine estimated her earnings for the year at $10 million.", "Sandra and her husband, 'Jesse James' (qv), were unhurt after a head-on crash with a drunken driver in Massachusetts on April 18, 2008. Both vehicles were totaled but no one was hurt.", "(April 8, 2009) Has designed special seat-belts so her pet dogs, Ruby and Poppy, can ride safely in her car.", "Hates musicals and vows to never participate in one.", "Was considered for the role of Helen Lyle in _Candyman (1992)_ (qv), which went to 'Virginia Madsen' (qv).", "Was bullied in school, as a kid, for wearing frumpy clothes bought in Germany.", "By starring in _The Blind Side (2009)_ (qv) she became the only actress to date to have a film marketed with her name solely above the title (i.e. based on her star power alone, and not a franchise or tentpoll picture) pass the $200 million mark in domestic gross.", "Is one of four actresses to win both, the Oscar for Best Actress and the Razzie for Worst Actress, along with 'Halle Berry' (qv), 'Faye Dunaway' (qv) and 'Liza Minnelli' (qv). Bullock is the only one to be nominated for and win both awards in the same year (for _The Blind Side (2009)_ (qv) and _All About Steve (2009)_ (qv)). She was presented with the awards within two days in 2010.", "Introduced to salsa by 'Robert Duvall' (qv).", "Was jokingly thrown in a pool by 'George Clooney' (qv) and 'Tom Cruise' (qv) at 'Joel Schumacher' (qv)'s birthday party in 2000. She talked to InStyle magazine about this story in 2005 and also mentioned it in her Oscar acceptance speech in 2010.", "Co-owner, with 'Jesse James' (qv), of \"Cisco Burgers\" in Long Beach, California.", "(March 15, 2010) Separated from husband 'Jesse James' (qv) following the revelation of his 11-month affair with tattoo model 'Michelle McGee' (qv).", "Is one of 14 actors to win the Academy Award for playing a real-life person who was still alive on the evening of the award ceremony for playing 'Leigh Anne Tuohy' (qv) in _The Blind Side (2009)_ (qv).", "Has directed only one film, the 1998 movie _Making Sandwiches (1998)_ (qv) (she also wrote it). Bullock said in a Reader's Digest interview that she directed the film to \"educate herself\" about directing and came away concluding that while she enjoys producing and acting, she does not have the talent to \"lead\" a film by being a director.", "Canceled her appearances at the British and German movie premiere of _The Blind Side (2009)_ (qv), in the wake of model 'Michelle McGee' (qv)'s claims that she had an affair with Bullock's husband, 'Jesse James' (qv), while she was working on the set of _The Blind Side (2009)_ (qv). After she backed out of the premieres, both events were canceled as a red carpet event. [March 2010]", "Revealed in People magazine in April 2010 that she started to adopt a one-week-old baby boy, named Louis Bardo Bullock, from New Orleans in January 2010. Initially began adoption proceedings with husband 'Jesse James' (qv) before they split in April 2010 and going on to adopt Louis as a single parent after they divorced.", "(May 10, 2010) Merited a place in Time magazine's - The 100 Most Influential People in the World (\"Artists\" category) - with an homage penned by 'Betty White' (qv).", "Lived shortly in Vienna and Salzburg, Austria as a child.", "Lived in Nuremberg, Germany until the age of 12, where her mother performed at the Staatstheater Nürnberg.", "Was a gymnast and cheerleader in high school.", "Her maternal grandfather was a rocket scientist from Nuremberg, Germany.", "Filed for divorce from 'Jesse James' (qv) in April 2010.", "Received the American Riviera Award at the 2010 Santa Barbara International Film Festival in 2010.", "Named person of the year for 2010 by People magazine.", "Returned to work twelve months after adopting her son Louis in order to begin filming _Extremely Loud & Incredibly Close (2011)_ (qv).", "Universal Pictures wanted to cast 'Sandra Bullock' (qv) in the role of Karen Sisco in _Out of Sight (1998)_ (qv). However, director 'Steven Soderbergh' (qv) decided to cast 'Jennifer Lopez' (qv) in the role because he thought that Jennifer and co-star, 'George Clooney' (qv), had the intense chemistry together needed for the film.", "When she \"won\" the Razzie Award as Worst Actress for _All About Steve (2009)_ (qv), Bullock became one of the few in the awards' 30 year history to accept the $4.97 dis-honor in person.", "Was Homecoming Princess in college.", "When she was attending college, she won a disco dancing contest with her pal, 'Mark Brunetz' (qv). He was her date to the Oscars in 1996. They also co-founded \"Fortis Films\".", "(February 15, 1999) She was the celebrity Monarch in the Krewe of Orpheus Parade, in the Mardi Gras. She was invited by former co-star 'Harry Connick Jr.' (qv).", "Can dance flamenco, salsa and tango.", "Attended East Carolina University in Greenville, North Carolina (1982-1986).", "Had a 4,600-square-foot townhouse in SoHo, New York.", "Shared her house with her sister, 'Gesine Bullock-Prado' (qv), while she was attending law school (1995).", "Would not do the _Speed (1994)_ (qv) sequel, _Speed 2: Cruise Control (1997)_ (qv), after knowing that 'Keanu Reeves' (qv) had passed on it, but accepted it in a deal with 20th Century Fox in which they would endorse her upcoming movie, _Hope Floats (1998)_ (qv).", "Friends with photographer 'Karen Bystedt' (qv) since 1991.", "Made her first stage appearance in an opera when she was age 5. She played a dirty gypsy in the opera \"The Gypsy Baron\".", "Played the piano since she was age 8.", "Donated the dress she wore, for the _Practical Magic (1998)_ (qv) premiere, to be auctioned at Charity Auction at eBay in benefit of the Avon Breast Cancer Crusade. [October 2001]", "Friends with photographer 'Dan Winters' (qv) and his wife, Kathryn. She is their son's godmother and 'Tate Donovan' (qv) is the godfather.", "Supports several charities. In 2000, she received the Inspiration of the Year award, for her support of charities such as: PETA, AIDS, Pedriatics, Cancer, etc.", "Her performance in the off-Broadway play, \"No Time Flat\", got her an agent and a very important audition. The audition was for _Bionic Showdown: The Six Million Dollar Man and the Bionic Woman (1989)_ (qv), and theatre critic 'John Simon' (qv) praised her performance, too (1988).", "(April 3, 1999) Her sister, 'Gesine Bullock-Prado' (qv), was married, at Sandra's Texas ranch, to storyboard artist 'Raymond Prado' (qv).", "Used to live in the same Los Angeles apartment where actor 'Ashton Kutcher' (qv) lived when he moved to Los Angeles. He found out because he used to get her mail.", "Voted the \"most wanted to see star\" by US Military Personnel serving in the Balkans. [May 2001]", "Said that if she had not been an actress, she would have been a romantic novelist.", "Men's Fitness magazine - one of the Hollywood's 10 hottest women. [October 1999]", "Earned a diving certification before shooting _Speed 2: Cruise Control (1997)_ (qv) (1996).", "Her father has been her manager since 1996.", "Her drama teachers in college were Don Biehn and Edgar Loessin.", "Auditioned five times before getting the role on the situation comedy _Working Girl (1990)_ (qv).", "_Miss Congeniality (2000)_ (qv) was filmed in her home city of Austin, Texas.", "Her parents met in Nüremberg, Germany, while her father was doing a civil work for the Pentagon and her mother was his secretary.", "Listed by Premiere magazine as one of the 100 most powerful people in Hollywood #62. [April 2002]", "Lived in New York for three years (1986-1989).", "Took her parents to the _While You Were Sleeping (1995)_ (qv), _Practical Magic (1998)_ (qv) and _Forces of Nature (1999)_ (qv) premieres.", "Her sister, 'Gesine Bullock-Prado' (qv), studied law in Southwestern, Los Angeles (1995).", "Her high school drama teacher was Ms Gerrie Philpi.", "Her mother tongue is German.", "Good friends with 'Nicole Kidman' (qv), 'Renée Zellweger' (qv), 'Samantha Mathis' (qv), 'Heidi Klum' (qv), 'Meryl Streep' (qv) and 'George Clooney' (qv).", "She has turned down roles in two films directed by 'Clint Eastwood' (qv); Maggie in _Million Dollar Baby (2004)_ (qv) and Mickey in _Trouble with the Curve (2012)_ (qv). The first she was forced to turn down, due to her commitments to _Miss Congeniality 2: Armed & Fabulous (2005)_ (qv).", "As of 2014, has starred in four films that were nominated for the Best Picture Oscar: _Crash (2004)_ (qv), _The Blind Side (2009)_ (qv), _Extremely Loud & Incredibly Close (2011)_ (qv) and _Gravity (2013)_ (qv). Of those, only _Crash (2004)_ (qv) won in the category.", "Says she has been \"deathly afraid of flying\" since surviving a plane crash in Wyoming in 2000 when her jet missed the runway and it sustained major damage.", "She was awarded a Star on the Hollywood Walk of Fame at 6801 Hollywood Boulevard in Hollywood, California on March 24, 2005.", "Adopted baby boy named Louis Bardot Bullock from New Orleans, Louisiana [April 2010]", "Named \"Entertainer of the Year\" by Entertainment Weekly in 2013.", "Was the 136th actress to receive an Academy Award; she won the Best Actress Oscar for _The Blind Side (2009)_ (qv) at The 82nd Annual Academy 'Awards' (qv) (2010) on March 7, 2010.", "Named the Most Beautiful Woman in the World of 2015 by People magazine.", "Has starred in two movies where her character is about to get married and backs out at the last minute: The Proposal and While You Were Sleeping.", "She won an Oscar for playing 'Leigh Anne Tuohy' (qv) in _The Blind Side (2009)_ (qv), making her one of 17 actors to win the Award for playing a real person who was still alive at the evening of the Award ceremony (as of 2015). The other sixteen actors and their respective performances are: 'Spencer Tracy' (qv) for playing Father Edward Flanagan in _Boys Town (1938)_ (qv), 'Gary Cooper' (qv) for playing Alvin C. York in _Sergeant York (1941)_ (qv), 'Patty Duke' (qv) for playing Helen Keller in _The Miracle Worker (1962)_ (qv), 'Jason Robards' (qv) for playing Ben Bradlee in _All the President's Men (1976)_ (qv), 'Robert De Niro' (qv) for playing Jake La Motta in _Raging Bull (1980)_ (qv), 'Sissy Spacek' (qv) for playing Loretta Lynn in Coal Miner's Daughter (1980)_, 'Jeremy Irons' (qv) for playing Claus Von Bullow in _Reversal of Fortune (1990)_ (qv), 'Susan Sarandon' (qv) for playing Sister Helen Prejean in _Dead Man Walking (1995)_ (qv), 'Geoffrey Rush' (qv) for playing David Helfgott in _Shine (1996)_ (qv), 'Julia Roberts' (qv) for playing Erin Brockovich in _Erin Brockovich (2000)_ (qv), 'Jim Broadbent' (qv) for playing John Bayley in _Iris (2001)_ (qv), 'Helen Mirren' (qv) for playing Queen Elizabeth II in _The Queen (2006)_ (qv), 'Christian Bale' (qv) for playing Dickie Eklund in _The Fighter (2010)_ (qv) 'Melissa Leo' (qv) for playing Alice Eklund-Ward in _The Fighter (2010)_ (qv), 'Meryl Streep' (qv) for playing Margaret Thatcher in _The Iron Lady (2011)_ (qv) and 'Eddie Redmayne' (qv) for playing Stephen Hawking in _The Theory of Everything (2014)_ (qv).", "(December 2, 2015) Had adopted her 2nd child, a daughter named Laila Bullock (b.2012).", "As of 2015 the film Our Brand Is Crisis generated her lowest grossing opening weekend, grossing only $3.4 million from 2,202 theaters.", "Co-owns a production company called Fortis Films with her sister Gesine. Their first film was Gun Shy released in 2000.", "Donated $5,000 to help Svend Petersen, the longtime pool manager of the Beverly Hills Hotel.[April 2017].", "Her mother received a credit of Special Thanks in Sandra's first produced film Gun Shy.", "She holds German and American citizenship and can speak fluent English and German.", "As far as 2018, she is starred in two sequels of two of her hit movies. Both were a critical failure and a box office disappointment; in both, the love interest from the original picture disappears (both sequels justify it by making the relation break), Enrique Murciano appears in both sequels and (SPOILERS) in both of them 'Sandra Bullock' (qv)'s character almost dies by drowning. Also, albeit in different awards, both \"Speed 2: cruise control\" and \"Miss Congeniality 2: armed and fabulous\" were also nominated to a Worst Movie of the Year and Worst Actress of the Year."], "quotes": ["(on marital plans) I've always been very sceptical about marriage, because I only want to do it once; I want to do it the right way.", "I've learned that success comes in a very prickly package. Whether you choose to accept it or not is up to you. It's what you choose to do with it, the people you choose to surround yourself with. Always choose people that are better than you. Always choose people that challenge you and are smarter than you. Always be the student. Once you find yourself to be the teacher, you've lost it.", "I remember sitting down in 'Joel Silver' (qv)'s office and Joel going, \"Do you want to do this film?\". I remember going, \"I would like to do it, but I would love to talk about the character\", and it was almost like I had said the biggest joke.", "The only reason I haven't married yet, is because I take it too seriously.", "Fame means when your computer modem is broken, the repair guy comes out to your house a little faster.", "I have no desire to maintain a lifestyle. I am a horrible celebrity. If I am out in public, I dress like a pig.", "The Acadamy 'Awards' (qv) shouldn't even nominate 'Meryl Streep' (qv) anymore. She should just be given an award every year. There should just be the 'Meryl Streep' (qv) category.", "Everyone told me to pass on _Speed (1994)_ (qv) because it was a \"bus movie\".", "I'd rather take risks than make something that's cookie cutter.", "The first _Miss Congeniality (2000)_ (qv) gave me the chance to do broad comedy that had nothing to do with being the romantic interest. The girl-next-door thing went away with that film and I tend to do characters that I want to be more like. In the beginning, though, I was sort of the \"action girl\". And then with _While You Were Sleeping (1995)_ (qv), I was the romantic-comedy girl. But when I took time off, I thought, \"There's something I'm missing here.\" I literally had to start from scratch.", "I don't like to talk about personal things. And by keeping it private, you have a better shot at a healthy relationship. I learned at a young age that there are certain things you just don't talk about.", "I don't think there's ever what could be called a \"chilled state\" in my head.", "My goal now is to remember every place I've been, only do things I love and not say yes when I don't mean it.", "[on motherhood] If I'm blessed with that, I hope I am the best version of me that I can possibly be. (People magazine)", "Movie sex scenes are never romantic, and you're never swept off your feet. It's always very technical. I'm counting the beats: Okay, we're supposed to kiss for two beats, then I say my line, then they want another kiss for four beats. I'm going, One Mississippi, two Mississippi, three and break. It's like choreography. Sometimes, you have actors who feel it's their job to get as far down into your throat as possible. You're like, Excuse me, I like you, but not that much.", "Why do you need one? I don't understand why there needs to be a love interest to make women go see a film. I think society sort of makes us feel that way - that if you don't have a guy, you're worthless.", "On _Speed 2: Cruise Control (1997)_ (qv): That was a mistake but, in retrospect, how are you supposed to know?", "(On how it felt and what it said about life that she was nominated for a Razzie and an Oscar for Best Actress within two days in 2010): That life is perfectly balanced.", "I used to be an optimist, but now I know that nothing is going to turn out as I expect.", "[Contrasting highs in her professional life with lows in her private life] Whoever established the high road, and how high it was going to be, should be fired.", "The sexiest man alive? My husband and then, Keanu!! (2006)", "[on _Extremely Loud & Incredibly Close (2011)_ (qv), her film about 911] The story is about honoring people's grief, while giving them permission to have it. And I loved that it showed generations in pain, and how they healed each other by listening and talking.", "[on being changed by motherhood] I cry at everything now... I've become more open to surprises and feelings.", "[on her largely solo performance in _Gravity (2013)_ (qv) simulating being adrift in outer space] I actually never thought about being alone on screen for such a long time until I started doing press, and everyone asked me if that made me nervous, and then I started panicking. I was mostly concerned about the Vomit Comet. I was literally acting off of nothing for up to 10 hours a day, with headphones my only connection to Alfonso [Cuarón, director]. We made a catalog of music clips - whale sounds, Radiohead, weird screeching of metal - and I memorized them. I would say, \"Okay, give me No. 4. That's not working. Try No. 2. That's better, that's getting me to the emotion I need.\".", "[on _Gravity (2013)_ (qv)] It's about rebirth. How do you let go in the worst possible situation so you can have some kind of release and peace? Life is not going to stop coming at you. In the end, you just have to say, \"I have no control.\" Your time is precious. Are you really going to waste it worrying about this stuff?", "[Responding to morning news of her 2nd Oscar-nomination in 2014] I don't think it ever stops being an absolute thrill, but I do have an immediate leveler. I still have to get up and make lunch for a little person, and pray - please, dear God - that he eats something I put in his lunchbox today.", "What everyone needs is love, unconditionally.", "I hate taking selfies. I will not take a selfie that I can't erase. I don't post or do any of that stuff. People have these worlds they post and it's about projecting an image and getting likes. I read a great article about how there's a higher rate of depression because people are looking at everyone else's Facebook [pages] and seeing this picture-perfect life. We're not representing our lives truthfully. Like when you're yelling at your child, you're not taking a selfie of you being a horrible parent. No, you're waiting for the perfect selfie. 'Do I look thinner now?' 'Do I look great?' It's this false projection of one's life. Hollywood has now gone global. Everyone's Hollywood now."], "salary history": ["_Speed (1994)_ (qv)::$600,000", "_While You Were Sleeping (1995)_ (qv)::$1,200,000", "_The Net (1995)_ (qv)::$250,000", "_A Time to Kill (1996)_ (qv)::$8,000,000", "_In Love and War (1996)_ (qv)::$10,500,000", "_Speed 2: Cruise Control (1997)_ (qv)::$11,000,000", "_Hope Floats (1998)_ (qv)::$11,000,000", "_28 Days (2000)_ (qv)::$12,500,000", "_George Lopez (2002)_ (qv)::$10,000,000 (syndication deal)", "_Murder by Numbers (2002)_ (qv)::$15,000,000", "_The Blind Side (2009)_ (qv)::$20,000,000 (back-end, based on worldwide gross of $309,00,000 plus share of DVD and pay-TV revenue)", "_The Heat (2013)_ (qv)::$10,000,000", "_Gravity (2013)_ (qv)::$20,000,000 +back end", "_Minions (2015)_ (qv)::$10 .000.000"], "birth date": "1964-07-26", "birth notes": "Arlington, Virginia, USA", "_actorID": "32", "_source": "IMDB", "actorID": "0000113", "created_utc_dt": "09/14/2019, 13:01:42"}