{"headshot": "https://m.media-amazon.com/images/M/MV5BMTY0MTM1MTM5Nl5BMl5BanBnXkFtZTcwNzA1OTM3MQ@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Michael John Myers", "height": "5' 7\" (1.7 m)", "mini biography": ["Michael John Myers was born in 1963 in Scarborough, Ontario, to Alice E. (Hind), an officer supervisor, and Eric Myers, an insurance agent. His parents were both English, and had served in the Royal Air Force and British Army, respectively.Myers' television career really started in 1988, when he joined _Saturday Night Live (1975)_ (qv), where he spent six seasons. He brought to life many memorable characters, such as Dieter and Wayne Cambell. His major movies include _Wayne's World (1992)_ (qv), _Wayne's World 2 (1993)_ (qv), _So I Married an Axe Murderer (1993)_ (qv), the Austin Powers movies and _The Cat in the Hat (2003)_ (qv).::Aaron Dodd <powersonline@yahoo.com>"], "spouse": ["'Kelly Tisdale' (qv)::(22 November 2010 - present) ( 3 children)", "'Robin Ruzan' (qv)::(23 May 1993 - 9 August 2006) ( divorced)"], "trade mark": ["Frequently appears wearing his underpants in films", "Frequently plays multiple characters"], "trivia": ["Collects model soldiers; he finds the building and painting of the soldiers to be relaxing.", "Graduated high school in 1982 and was immediately accepted into Toronto's Second City Comedy ensemble.", "As a teenager, he would act out his Wayne character to girls at parties.", "Has 3 dogs named after hockey players.", "Used to take dancing lessons in Toronto.", "His character 'Linda Richman' (qv) on _Saturday Night Live (1975)_ (qv), is based on his ex mother-in-law, 'Linda Richman' (qv).", "Appeared with 'Gilda Radner' (qv), in a television commercial when he was nine, he cried on the last day of the shooting. Since then, his brothers called him \"Sucky Baby\".", "Carries a British Passport. He has said in many interviews that he regards himself as British.", "His success as Austin Powers in the late 1990s won him a $40 million deal to star in 2 films for Universal. The first was to be Sprockets for which he'd already written the script. In June 2000: he was sued by Universal Pictures for $3.8 million for backing out of his contract to play Dieter in a feature film version of his _Saturday Night Live (1975)_ (qv) recurring skit, \"Sprockets\". Myers was quoted to say he would refuse to honor the $20 million contract rather than \"cheating moviegoers with an unacceptable script\".", "His mother studied at London Academy of Music and Dramatic Art before moving to Canada and raising a family.", "His production company, Eric's Boy, is named after his father, Eric, an encyclopaedia salesman, who died on 22 November 1991 of Alzheimer's.", "Youngest of 3 sons.", "His parents, Eric and Alice, were British citizens, which is why Myers carries a British passport.", "Supports Liverpool Football Club - his parents were from Liverpool, UK.", "Has said his favorite character to play in the Austin Powers movies is Dr. Evil. His least favorite to play is Fat Bastard.", "In an interview with 'James Lipton' (qv) of the _Inside the Actors Studio (1994)_ (qv), Myers stated that he met his (ex) wife, 'Robin Ruzan' (qv), in a bar after attending a hockey game where he caught a puck. Later in their relationship, they attended a hockey game and she caught a puck.", "His favorite sports team is the Toronto Maple Leafs (NHL), and in his movie _Austin Powers in Goldmember (2002)_ (qv), the character Mini Me is sporting a Toronto Maple Leafs jersey in the prison scene.", "Enjoyed playing the role-playing game Dungeons & Dragons when he was young. He has said this give him the inspiration for his _Saturday Night Live (1975)_ (qv) character, Lothar of the Hill People.", "Has a street named after him in Scarborough, Ontario: 'Mike Myers' (qv) Drive.", "He received a star on the Canadian Walk of Fame in Toronto, Ontario, Canada (June 25, 2003).", "In remembrance of his father, Eric, he wears the ring his father received from the Encyclopaedia Britannica corporation when he was named Salesman of the Year as his wedding band.", "All street signs leading the way to 'Mike Myers' (qv) Drive and 'Mike Myers' (qv) Way were stolen in June 2003, shortly after official presentation. This was the second time they were stolen; the unofficial ones were taken as well.", "There is a street named \"Wayne's World Drive\" in Draper, Utah, which is 20 minutes south of Salt Lake City.", "The high school he attended was Sir John A. Macdonald Collegiate Institute in Scarborough. He graduated from Stephen Leacock Collegiate Institute. Both schools were also attended by 'Eric McCormack' (qv).", "Owns the last letter ever written by Beatles singer 'George Harrison' (qv), given to him very shortly after Harrison's death and while _Austin Powers in Goldmember (2002)_ (qv) was in production. The letter compliments him on the Austin Powers movies and asks him for a Mini Me doll. He had it framed immediately and looks at it every day, stating that its one of the most incredible things that has ever happened to him.", "In 1993, he received a phone call from 'Barbra Streisand' (qv), asking him to appear as 'Linda Richman' (qv), opening for Streisand at the MGM Grand in Las Vegas - her first concert in 22 years.", "In addition to being nominated for Worst Actor of 2004 at the Razzie awards, for his performance in _The Cat in the Hat (2003)_ (qv), he was also suggested on the 2004 nominating ballot in the Worst Supporting Actor category for his role in _View from the Top (2003)_ (qv). He failed to receive the Supporting Actor nomination, but got the Lead Actor nomination.", "He and 'Robin Ruzan' (qv) are ending their marriage. [December 2005]", "His performance as Dr. Evil in the \"Austin Powers\" movies is ranked #35 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "He is an Alumnus from the Famous Improv Olympic along with actors 'Vince Vaughn' (qv), late 'Chris Farley' (qv), 'Ossie Beck' (qv), 'Tina Fey' (qv), 'Amy Poehler' (qv) and 'Adam McKay' (qv).", "A fan of the rock band 'Queen' (qv).", "Is a huge fan of 'Aerosmith' (qv). On his birthday, 'Aerosmith' (qv) was the music guest on SNL. Mike tried desperately to meet the band but was unsuccessful. During a \"Wayne's World\" sketch, the band showed up (unknown to Mike) as a \"birthday present\".", "2000: The Hollywood Reporter reported that he was being considered for the role of Inspector Clouseau, in _The Pink Panther (2006)_ (qv). A fan of 'Peter Sellers' (qv) (who played Clouseau in the original film), Myers was said to be initially reluctant to do the role, but became enthused about it after meeting with 'Ivan Reitman' (qv) (who was originally set to direct). Reitman told the Calgary Sun that the new film \"won't be a retread of the 'Peter Sellers' (qv) versions. We want something new and fresh. Mike has to find a whole new character for Clouseau that is not 'Peter Sellers' (qv), but is also not Austin Powers.\" In March 2002, Myers withdrew from the project.", "He got hired for Second City the day he graduated from high school. He had his last exam at 9, his audition at noon, and he got hired at 3.", "Was in the band \"Ming Tea\" with Canadian musician/producer 'Christopher Ward' (qv), and singers 'Matthew Sweet' (qv) and 'Susanna Hoffs' (qv).", "Frequently wears a Darcy Tucker #16 Toronto Maple Leafs hockey jersey.", "His parents were both born in West Derby, Liverpool, England, where their families had lived for several generations. He was raised an Anglican.", "Met close friend 'Neil Mullarkey' (qv) when they were both members of the English comedy group, The Comedy Store Players.", "Was friends with 'David Furnish' (qv) in high school.", "His wife, Kelly, is expecting their first child in autumn 2011.", "His wife, Kelly, is the owner and co-founder of \"TeaNY\", a tea café in New York City. Her ex-boyfriend, 'Moby' (qv) is the other co-founder.", "On Sunday 3rd July 2011, Myers returned to The Comedy Store in London to reprise his role 'for one night only' with the improvisational troupe (The Comedy Store Players).", "Became a father for the 1st time at age 48 when his wife 'Kelly Tisdale' (qv) gave birth to their son Spike Myers on September 29, 2011.", "Auditioned for _Whose Line Is It Anyway? (1998)_ (qv).", "Became a father for the 2nd time at age 50 when his wife 'Kelly Tisdale' (qv) gave birth to their daughter Sunday Molly Myers on April 11, 2014.", "Myers first left \"Saturday Night Live\" before the start of the 1992-1993 season but later changed his mind and returned to SNL on the eighth show of that season which was hosted by Tom Arnold. Myers then remained on the show for three more years until he departed in January 1995.", "Pictured on one of a set of five nondemominated Canadian commemorative postage stamps honoring Great Canadian Comedians, issued 29 August 2014. In addition to the main portrait, he is shown in his roles as Wayne Campbell in _Wayne's World (1992)_ (qv), and as Austin Powers and Dr. Evil in the Austin Powers series of films. Others honored in this set are 'Jim Carrey' (qv), 'Catherine O'Hara' (qv), 'Martin Short' (qv), and Oliver Guimond. Price of each stamp on day of issue was 85¢.", "His father died on the 21st birthday of his Austin Powers co-star 'Joe Son' (qv).", "In \"Wayne's World\" there is a very obscure reference to Mike Myer's early TV career. Garth shows us around Benjamin's apartment it's very like the British TV series \"Through the keyhole\". By probably not a coincidence, the format started as a sub-strand on original ITV breakfast franchise holders's TV-am's \"Good Morning Britain\". This is the same breakfast tv company that had the \"Wide Awake Club\" children's slot that 'Mike Myers' (qv) had with 'Neil Mullarkey' (qv) In turn, the same 'Neil Mullarkey' (qv) that in turn later appears in Mike Myer's \"Austin Powers\".", "He transferred to Stephen Leacock Collegiate Institute in Scarborough, Ontario, from Sir John A. MacDonald C.I. for the Television Production course offered in grades 11 & 12. The school opened it's doors in 1970 with fully-equipped television and radio studios. It is still the most in-depth television course in Ontario offered at a high school.", "His face is on a Canadian stamp.", "As of 2019, has appeared in two Best Picture Oscar nominees: _Inglourious Basterds (2009)_ (qv) and _Bohemian Rhapsody (2018)_ (qv)."], "quotes": ["[June 1999] Austin Powers was born out of trying to celebrate my father's life. My father's favorites were mine -- 'Peter Sellers' (qv), Monty Python, 'Peter Cook' (qv) and 'Dudley Moore' (qv) . . . my dad was a guy who loved to be silly; he had a highly prized sense of humor. When I would bring friends home to play table hockey in the basement, if my dad didn't think they were funny, he wouldn't let them in the house. \"They can't come around\", he'd say. :They're not bloody funny!\"", "I still believe that at any time the no-talent police will come and arrest me.", "As a people, the English find male partial nudity and cross-dressing to be very funny. It's definitely a color on our palette, and I follow in that tradition.", "Canada is the essence of not being. Not English, not American, it is the mathematic of not being. And a subtle flavour - we're more like celery as a flavour.", "[when asked who some of his comic heroes were] 'Peter Sellers' (qv), 'Dan Aykroyd' (qv), the whole original SNL [_Saturday Night Live (1975)_ (qv)] cast. 'Lorne Michaels' (qv) is a hero of mine. I did a project on him in grade eight. He's a Canadian hero. He's a man of impeccable taste. And 'Gilda Radner' (qv) was a big hero of mine.", "[of _Shrek the Third (2007)_ (qv), in which he again provided the character's voice] The first time you meet him, he's a self-loathing ogre who doesn't feel that he's worthy of love. In the second one, he doesn't feel worthy of marriage, and in this one he doesn't feel he's worthy of being the father of his country or being a father of a child. You know what I mean? It's a smart progression.", "I love making stuff. There's a joy in having the first molecule of an idea, then testing it in front of audiences at secret shows that people only know about the day before. I videotape those, study them, enjoy being in the character and figuring out the movie.", "If I went by all the rejection I've had in my career, I should have given up a long time ago.", "I like smart jokes, I like dumb jokes, and I like dumb jokes done smartly."], "salary history": ["_Wayne's World (1992)_ (qv)::$1,000,000", "_So I Married an Axe Murderer (1993)_ (qv)::$2,000,000", "_Wayne's World 2 (1993)_ (qv)::$3,500,000", "_Austin Powers: International Man of Mystery (1997)_ (qv)::$3,000,000", "_Austin Powers: The Spy Who Shagged Me (1999)_ (qv)::$7,000,000", "_Shrek (2001)_ (qv)::$3,000,000", "_Austin Powers in Goldmember (2002)_ (qv)::$25,000,000 against 21% of the film's gross", "_Shrek 2 (2004)_ (qv)::$10,000,000"], "birth date": "1963-05-25", "birth notes": "Scarborough, Ontario, Canada", "_actorID": "64", "_source": "IMDB", "actorID": "0000196", "created_utc_dt": "09/14/2019, 13:02:11"}