{"headshot": "https://m.media-amazon.com/images/M/MV5BOTk2NDc2ODgzMF5BMl5BanBnXkFtZTcwMTMzOTQ4Nw@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Renni"], "birth name": "Jeremy Lee Renner", "height": "5' 9\" (1.75 m)", "mini biography": ["Jeremy Lee Renner was born in Modesto, California, the son of Valerie (Tague) and Lee Renner, who managed a bowling alley. After a tumultuous yet happy childhood with his four younger siblings, Renner graduated from Beyer High School and attended Modesto Junior College. He explored several areas of study, including computer science, criminology, and psychology, before the theater department, with its freedom of emotional expression, drew him in.However, Renner recognized the potential in acting as much through the local police academy as through drama classes. During his second year at Modesto Junior College, Renner role-played a domestic disturbance perpetrator as part of a police-training exercise for an easy $50. Deciding to shift his focus away from schoolwork, Renner left college and moved to San Francisco to study at the American Conservatory Theater. From there he moved to Hawaii and, in 1993, to Los Angeles.In Los Angeles, Renner devoted himself to theater, most notably starring in and co-directing the critically acclaimed \"Search and Destroy.\" He pursued other projects during this time as well, landing his first film role in 1995's _Senior Trip (1995)_ (qv). After several commercials and supporting roles in television movies and series, Renner captured the attention of critics with his gripping, complex portrayal of the infamous serial killer in the 2002 film _Dahmer (2002)_ (qv). Renner's performance, which earned him an Independent Spirit Award nomination, is especially remarkable for painting a humane and sympathetic, yet deeply disturbing, portrait of the title character.In 2003, Renner took a break from small indie films to work on his first commercially successful movie, _S.W.A.T. (2003)_ (qv), with 'Colin Farrell' (qv). In 2005, he played the leading role in _Neo Ned (2005)_ (qv) as an institutionalized white supremacist in love with a black girl, winning the Palm Beach International Film Festival's best actor award. Renner's pivotal supporting roles in 2005's _12 and Holding (2005)_ (qv) and _North Country (2005)_ (qv) earned him accolades from critics, and his 2007 turn in _Take (2007)_ (qv) garnered him the best actor award at California's Independent Film Festival. Also in 2007, Renner played a leading role in the horror film _28 Weeks Later (2007)_ (qv) as well as a supporting role in the underrated Western epic _The Assassination of Jesse James by the Coward Robert Ford (2007)_ (qv), with 'Casey Affleck' (qv), 'Brad Pitt' (qv), and 'Sam Rockwell' (qv).Renner's depiction of Jeffrey Dahmer in 2002 caught the attention of director 'Kathryn Bigelow' (qv), and, in 2008, she cast him in his most famous role as Sergeant First Class William James in _The Hurt Locker (2008)_ (qv). Renner's performance as a single-minded bomb specialist scored him an Academy Award nomination for best actor. He also earned best actor nominations from the Independent Spirit 'Awards' (qv), the Screen Actors Guild, and the BAFTA 'Awards' (qv), as well as wins in this category from several film critics groups.In 2009, Renner starred in the short-lived TV series, _The Unusuals (2009)_ (qv), and in 2010 he played the chilling but loyal criminal Jem in 'Ben Affleck' (qv) bank-heist thriller _The Town (2010)_ (qv). In the fall of 2010, Renner began filming _Mission: Impossible - Ghost Protocol (2011)_ (qv). He has also since starred in _The Avengers (2012)_ (qv), _American Hustle (2013)_ (qv), and _Kill the Messenger (2014)_ (qv).Renner's strengths as an actor derive not only from his expressive eyes but also from his ability to thoroughly embody the characters he portrays. His visceral depiction of these individuals captivates audiences and empowers him to steal scenes in many of his films, even when playing a minor role. Renner gravitates toward flawed, complicated, three-dimensional characters that allow him to explore new territory within himself.In addition to his work as an actor, Renner continues to cultivate his lifelong love of music. A singer, songwriter, and musician, he performed with the band Sons of Ben early in his career. Scenes in _Love Comes to the Executioner (2006)_ (qv), _North Country (2005)_ (qv), and _The Assassination of Jesse James by the Coward Robert Ford (2007)_ (qv) briefly showcase Renner's singing talents.Despite traveling the world for film roles and, recently, as a United Nations Goodwill Peace Ambassador to raise awareness for mine-clearing efforts in Afghanistan, Renner remains close to his roots. In 2010, Modesto Junior College presented him the Distinguished Alumnus award in recognition of his body of work as an actor. He also headlined at a benefit for Modesto's Gallo Center for the Arts in the fall of 2010.Renner maintains a sense of humility and gratitude, even in the wake of his recent successes and recognition. He keeps himself grounded by renovating and restoring old and rundown iconic Hollywood homes, an enterprise he began back in his early days in Los Angeles. He values loyalty and a sense of both age and history, and enjoys the opportunity to help conserve these qualities in a town that favors the young and the new.::jamseattle31"], "spouse": ["'Sonni Pacheco' (qv)::(13 January 2014 - 28 December 2015) ( divorced) ( 1 child)"], "trade mark": ["Deeply intense understated performances", "Intense emotional performances", "Gruff yet soft voice", "Frequently plays violent or unstable characters"], "trivia": ["Turned down a role in _The Big Bounce (2004)_ (qv) to play Brian Gamble in _S.W.A.T. (2003)_ (qv).", "He knew 'David Boreanaz' (qv) even before he guest-starred on _Angel (1999)_ (qv).", "Renner had three films screening at the 2005 Toronto International Film Festival: _North Country (2005)_ (qv), _A Little Trip to Heaven (2005)_ (qv), and _12 and Holding (2005)_ (qv).", "He received the Best Actor Award at the Palm Beach International Film Festival for his title role in _Neo Ned (2005)_ (qv).", "He received the Hollywood Life's \"Break Through Performance of the Year\" for his role as Brian Gamble in the movie _S.W.A.T. (2003)_ (qv).", "Was approached to play the role of Derek in _Hero Wanted (2008)_ (qv) but couldn't due to prior filming commitments.", "One of Variety's Top Ten Actors to Watch (2009).", "Graduate of Beyer High School, Modesto, CA.", "Good friends with 'Charlize Theron' (qv) and 'Tom Cruise' (qv).", "Eldest of 6 children, 2 sisters, 3 brothers.His youngest brother was born in 2011 making Jeremy a new big brother at age 40.", "His mother accompanied him to the Oscars in 2010 and 2011.", "Good friends with 'Colin Farrell' (qv).", "Became very close during the shooting of _The Hurt Locker (2008)_ (qv) to co-stars 'Anthony Mackie' (qv) and 'Brian Geraghty' (qv) and director 'Kathryn Bigelow' (qv).", "Invited to join AMPAS in 2010.", "He is related by marriage to actor 'Eric Millegan' (qv), who formerly co-starred as Zack Addy on the FOX TV show, _Bones (2005)_ (qv).", "Has a passion for real estate/buying and renovating properties, with friend and business partner 'Kristoffer Ryan Winters' (qv).", "Attended Modesto Junior College in Modesto, CA.", "Father of Ava Berlin Renner (b. March 28, 2013) with 'Sonni Pacheco' (qv).", "His ancestry includes German, English, Scottish, Irish, Swedish, and Panamanian, where Jeremy's maternal grandmother was born.", "Renner was honored with CinemaCon's \"Male Star of the Year\" Award in 2012, being described as \"one of our most talented and gifted actors today\".", "Boston, Mass, USA filming American Hustle [April 2013]", "Los Angeles, CA, USA: Home from filming Kill the Messenger [September 2013]", "In Tucson, Arizona, filming Snappers. [April 2007]", "Gearing up to begin production on Mission Impossible 4. [September 2010]", "Currently working on his new movie, North Country. [January 2005]", "Back in Los Angeles after shooting \"The Hurt Locker\" in Jordan. [March 2008]", "Manila, The Philippines: Started filming for \"Bourne Legacy\". [January 2012]", "Atlanta, GL, USA: Filming Kill the Messenger [July 2013]", "Dubai, UAE filming MI4 [November 2010]", "In a September 2014 interview with Captial 'News' (qv) reporter Elizabeth E. Thorp, 'Jeremy Renner' (qv) confirmed his marriage to 'Sonni Pacheco' (qv), mother of his daughter Ava Berlin.", "His wife 'Sonni Pacheco' (qv) filed for divorce after 10 months of marriage citing irreconcilable differences, requesting that their prenup be disregarded as fraud.", "Hawkeye's monologue during the car chase scene with Black Widow in _Avengers: Age of Ultron (2015)_ (qv) about remodelling the character's house is a thinly-veiled reference to Renner's real-life hobby of remodelling Hollywood movie star's homes.", "Was going to reprise his role as Hawkeye in _Captain America: The Winter Soldier (2014)_ (qv), but was unavailable.", "Was considered for the role of Reiner in _The Counsellor (2013)_ (qv). The role went to 'Javier Bardem' (qv).", "In addition to acting, he has studied disciplines including world religion, criminology, Arnis (Filipino martial arts), and Muay Thai martial arts.", "He first became interested in acting through an exercise at a local police academy, which gave him the opportunity to role-play a domestic disturbance perpetrator as part of a police-training exercise for an easy $50.", "Admitted that while he was happy to have done _The Avengers (2012)_ (qv), he felt that Hawkeye was snubbed in screentime. 'Joss Whedon' (qv) seemed to noticed this, as Hawkeye had a much larger and important role in the sequel.", "Was originally cast as Freddie Quell in _The Master (2012)_ (qv), but dropped out. Joaquin Phoenix replaced him.", "Turned down the role of Lou Harris in _The Big Bounce (2004)_ (qv). The role went to 'Vinnie Jones' (qv).", "Was originally set to star in _Battleship (2012)_ (qv), but dropped out. 'Taylor Kitsch' (qv) replaced him.", "Was originally cast as Inspector Emmett Fields in _The Raven (2012)_ (qv), but dropped out so he could be in _Mission: Impossible - Ghost Protocol (2011)_ (qv). 'Luke Evans' (qv) replaced him.", "Turned down the role of Jackson \"Jack\" Lamb in _Super 8 (2011)_ (qv) in order to be in _Mission: Impossible - Ghost Protocol (2011)_ (qv). The role went to 'Kyle Chandler' (qv).", "Was considered for the role of Max Rockatansky in _Mad Max: Fury Road (2015)_ (qv). The role went to 'Tom Hardy' (qv).", "He is left-handed.", "He and 'Jennifer Lawrence' (qv) are fifth cousins, once removed. In 2015, the research team at Ancestry.com discovered that they share an ancestor in Kentucky, farmer Robert Tague, who is Lawrence's fifth great-grandfather, while he's Renner's fourth. Renner and Lawrence worked together in _American Hustle (2013)_ (qv).", "As of 2017, he has appeared in 3 films that have been Oscar nominated for Best Picture: _The Hurt Locker (2008)_ (qv), _American Hustle (2013)_ (qv), and _Arrival (2016)_ (qv). The Hurt Locker is a Best Picture winner.", "He fractured his right elbow and left wrist on the set of the New Line comedy _Tag (2018)_ (qv).", "He is a supporter of the San Francisco 49ers. He narrated _The Timeline: A Tale of Two Cities (2015)_ (qv), which chronicles the history of the team's rivalry with the Dallas Cowboys, and the introductory video for the grand opening of Levi's Stadium.", "He is on the Honorary Board of TAPS, the Tragedy Assistance Program for Survivors, which offers compassionate care to all those grieving the loss of a loved one who died while serving in our Armed Forces or as a result of his or her service.", "He runs a house-renovating business with his best friend and fellow actor 'Kristoffer Ryan Winters' (qv).", "In addition to acting, he studied Arnis (Filipino martial arts) and Muay Thai martial arts, mainly as preparation for his roles in the Mission Impossible and Avengers franchises.", "He was supposed to reprise his role as William Brandt in _Mission: Impossible - Fallout (2018)_ (qv), but he declined, as it meant his character would be prematurely killed off. He was also busy working on _Avengers: Endgame (2019)_ (qv)."], "quotes": ["_Braveheart (1995)_ (qv) pops into my mind. I like the graphic war element. It takes place in Scotland and England, and I love English history. (Cinematographer) 'John Toll' (qv) is amazing. It's a gorgeous film. I've seen it 35 times.", "[on shooting _The Hurt Locker (2008)_ (qv) in the unbearable heat of Jordan] We were already pushed to the limits. People wanted to quit. All the departments were struggling to get their jobs done, none of them were communicating. There was a lot of fighting going on. The heat does something to your brain, and on top of that I was in this bomb suit and I had explosive diarrhoea, so I was like: 'Get this thing off me!' I wanted to punch people. You could not pay me enough money to do it again.", "[2009, on his childhood] My sister was the complete opposite, she had a hard time growing up, and I was just always the happy kid. I played the drums, had my mullet, drove around on my motorcycle making out with chicks, just having a good ol' time. But it just happened while growing up - all these divorces, separations, moving to a different school every year - that things started to take a toll. The stage became a great playground for me to express feelings, and in my household there wasn't a place for me to do that. It was a great venue for me to hide in a character and express rage and sadness, and I created these really disturbed, complicated characters.", "[2009] Most people my age - and I'm going to my twenty-year reunion next weekend - they're all three divorces deep, and if they're happy, right on. But that just wasn't the path I wanted to go on. I was just getting into trouble, drinking, and doing stupid things until I stumbled onto acting class my junior year in college. The sense of self, the purpose. It opened this Pandora's box of emotions and it went from there.", "[on working with 'Ben Affleck' (qv) on _The Town (2010)_ (qv)] It was a lot of fun. We had a blast. It was like shooting a short film with one of your good buddies. He set a really good tone on the set, just really affable as a human being. He made it very pleasant for everyone...I always knew he was smart, because I'd see him on interviews and he was such a charming dude. And every day, I was surprised by just how smart he is. He's almost autistically smart, the guy is. It's ridiculous. And so experienced in the industry. He's obviously been through a lot, as an actor, as a writer, in good and bad ways. With that experience, he's very wise to a lot of things. And it's invaluable.", "[on playing Jeffrey Dahmer] Well you know it happened so fast...it was the complete opposite of _The Hurt Locker (2008)_ (qv) where I had time to prepare. I mean, I didn't even know who Jeffrey Dahmer was, and then four days later after reading the script we're shooting principal photography, and two weeks later we're done. It was such a whirlwind.... I mean to relate to that experience, I had to do a lot of work and allow myself to go places that were a little scary. You know when you play a guy like that it allows you the freedom to explore really weird parts about you. And it's ok. In order to really get it, I've got to allow myself to go there.", "[2009, on his love of music] I started as a young man, as a drummer, then moved to guitar, and piano so I could song-write. I was always a singer. But I was always focused on being an actor as my trade. Music I do just for me. The movie business is very difficult but the music business is just impossible. So I'll play in bands and record and play songs with other people, but for me it's a form of expression that all I need is me. I don't need cameras or agents, I can just have a piano and sing and feel totally verified...I'm actually looking to do a project where I could really try to explore that a little bit more in cinema, a rock star or something. I'd really, really love to do that.", "[2009, on studio execs] I think it's standard for the industry, that people aren't that imaginative. And, you know, I understand it. Name an actor...like, you think of 'Bruce Willis' (qv), you think of _Die Hard (1988)_ (qv) and all those movies and that thousand-yard stare. Well, he's a better actor than that. But you kind of have to prove that to them - what else you can do and what else you are - or they won't think that about you. Nor should they!", "[on fear] That emotion even conquers love, and that makes me sad. [on having spent eight years trying to analyze the roots of his own fear(s)] Finding out what I was afraid of, what stops you in your life, what gets in the way. Fear is just not a part of my life - so much so that if it's involved in somebody else's life and they're close to me, I won't be around them.", "I want my personal life to be personal ... And I don't care if you're talking about things that are true, you're still talking about my personal life. How about I go peek in your window, take what underwear you wore last night, whose husband you were fucking, and shove that in the megaphone throughout your neighborhood? How does that feel? It's none of your goddamn business.", "[on deciding whether or not to do _The Bourne Legacy (2012)_ (qv)] It was a game-changer in anonymity, and I like my private life and my family. I had to consider how this was going to affect everyone I love -- especially myself.", "[on one Christmas Eve, when he was with his family in a bar] This guy chokes me with the scarf I was wearing. He called me a fag 'cause I was wearing a scarf! Then he shoved my sister and I got behind him and I choked him out - put him to sleep. [without any irony] I'm not violent.", "[on filming _The Hurt Locker (2008)_ (qv)] People had full-on mental breakdowns; I did. Pure loneliness, that's what it came down to. It was a whole rainbow of good and bad.", "_The Avengers (2012)_ (qv) was the first big movie I signed on to. It was something 'Zak Penn' (qv) was the writer on; he's a friend. Then I met [Marvel Studios president and Avengers producer] 'Kevin Feige' (qv), and Zak was really pushing, saying 'You guys have got to hire Renner.'", "When you Google yourself and the first thing that comes up is ''Jeremy Renner' (qv) gay,' it's like, 'Oh, now you've arrived. You're now a giant movie star.' So I just had a big laugh about it. I don't care, ultimately, if that's what people want to think, read and care about. Fucking say whatever the hell you want about me.", "[did he mind not having any action scenes in Rogue Nation?] No, no, I was never jealous. I was so happy to go to craft services and grab a donut, while they were, you know, doing burpees at 5:00 in the morning. If I was required to, that would have been fun, I would have done it, but I'm okay not doing stunts.", "(On The Kardashians) Oh, all those ridiculous people with zero talent who spend their lives making sure everyone knows their name. Those stupid, stupid people.", "[on _Wind River (2017)_ (qv)] We are blessed and lucky that is something topical; it bodes well for our movie but that is not what we intended. This is a character drama on a reservation and about a community on that reservation", "[on working with 'Kathryn Bigelow' (qv) in _The Hurt Locker (2008)_ (qv)] She is tough, but Kathryn trusted me as I trusted her. She put me in positions to excel or suck. She is strong and mentally tough; unflappable, sweet, and tender. Thoughtful and emotionally intelligent. But do not mess with her. She will cut you down with words if she needs to. But she would rather not. She is a fantastic partner to work with", "Yeah, it was a joke, off-colored. Whatever. I'm unapologetic about a lot of things, but I got into a lot of Internet trouble. Because that's a thing now, you can get in. So, I was asked a question, like, Black Widow's been linked to Hawkeye, Iron Man, Bruce Banner, and Captain America. So, what do you think about that? Well, I said: sounds like she's a slut. Mind you, I was talking about a fictional character and fictional behavior, but... if you slept with four of the six Avengers - no matter how much fun you had, you'd be a slut, just saying.", "I have never been to war and I never want to go to war. I don't have the courage or the balls to do what these guys do. This movie [_The Hurt Locker (2008)_ (qv)] was as close as I ever want to get. It was really intense and I'm glad it was. I'm glad we didn't shoot on a sound stage in Arizona.", "[asked if he'd ever appear in a musical] I grew up as a singer. Listen, in the old days 'James Cagney' (qv) played tough shoot-'em-up bad guys plus song-and-dance musicals. So, don't give up on me.", "[on his joke about 'Jennifer Lopez' (qv)'s \"globes\" at the Golden Globes]: It's my sense of humor. I don't take things too seriously. I didn't watch any of the Globes. I went to have a drink at the bar, and I kept hearing people all night saying, \"Dude, that was the funniest thing,\" \"Bro, that was the best part of the show.\" I was like, What are you talking about? I was clueless...Everybody's entitled to an opinion, but I can't be bothered. We gave zero f-ks. I would have made a public apology if it really hurt her feelings. It was the complete opposite, and she's gone on record as saying she thinks Renner's hysterical.", "[on his first girlfriend]: I think she's still in Modesto, married and has some kids. But I have no idea what she thinks. Maybe she goes to the movies and thinks, Okay, Hawkeye was my first. Or she could have a voodoo doll of me, for all I know.", "I'm saddened by those that misinterpret the Demand a Plan PSA I participated in. In short, we asked our leaders for a plan, hence, 'Demand a Plan,' and it's most certainly not stripping us of our rights as Americans; that is absolutely asinine. Taking guns from people is no answer. I own guns and want to keep it that way. But guns don't kill people... people kill people. I believe our salvation begins in each of our homes. It starts with parenting, which has become increasingly more challenging in recent years. In a communication age where technology is growing at a much faster rate than we can truly understand, our youth has available to them more information and access to pretty much everything before they are socially and mentally matured.", "[after coming under fire for his \"not my job\" remarks]: So to set the record straight and give some clarity to how I feel, which seems not to have been reported in its entirety ... on the issue of gender equality I have always supported women deserving equal pay. Period. A person should be rewarded only by their merit or service to their given field. Gender, race, creed, or sexual orientation should have absolutely no influence in pay, positively or negatively.", "My only thought is politics and cinema, they don't match, they don't go together. I think cinema should provoke thoughts, sure, but using it as I soapbox I think is the wrong place. I never want to be part of something like that, where there's an agenda there that's not about telling a story, where its someone getting on a soapbox and preaching their own beliefs onto somebody. Personally I like cinema like The Hurt Locker, because it doesn't tell you what to feel or what to think. But it does tell you to think and to feel.", "I'm very lucky. I could have pretty easily been driving a forklift.", "[on his _Avengers: Endgame (2019)_ (qv) haircut] I think it's a reverse mullet. [laughs] I didn't go into Supercuts and say, \"Hey, shave the sides of my head!\" Yeah, it's for the movie we're shooting right now. [asked if it's a spoiler] I think it may just be a haircut.", "I'd like to have eight [kids] running around. A gaggle, a little clan. But at this point, that's not in my future.", "I don't know, I don't find myself very PC.", "[on his first Oscar nomination]: It was like you're playing baseball your whole life and then you suddenly get on a team and go to the World Series. All of a sudden I was \"the new guy in town\" after being here 20 years. I was like, \"That's fine by me, I'll be the new guy.\"", "I did take some archery, but I realized very quickly that I couldn't really use it in the film. It ended up being superhero archery. It's nice to know the technique behind it, but I was shooting behind my back and over my shoulder. But, I did give it a go. I shot a few bales of hay, and missed a few. Most of the physical part was just stretching, so I didn't get injured. But, you get banged around every day when it's hand-to-hand stuff. Scarlett and I beat each other up pretty good. It was fun.", "[_The Jungle Book (1967)_ (qv)]: I love the music and the archetypes represented in the movie stick with me. Strong character. The characters just stand out as some of the best, and I love, love, love the music. There's really good bad guys, really good good guys. I love it. Love it, love it. And it's a cartoon so it's one of those things that stuck with me as a kid and still watch it to this day.", "Nobody knows what charities I support, I don't go out and tweet about this and that. I just go and do stuff. I'd rather affect one person's life than try to change the planet with this and that, this and that, and scream and shout about this problem and that problem, and this and that. It's just too many problems. If I'm going to affect one thing, then I'm going to affect that. And you do something, instead of just talking. It's a sort of rhetoric, just like politics. It's like rhetoric. Why don't you do something?", "_Dahmer (2002)_ (qv) really messed with me for a couple of years, that role. I couldn't go into bars alone. I still really can't. It makes me think about how easy it is to put something in someone's drink and then have your way with them. I mean, oh my gosh. It's just one of those things where someone who has a lot of free time can do a lot of good, or a lot of bad.", "Before _The Avengers (2012)_ (qv), the kids would run away from me. But now that I play a superhero, you know, they come around and it's the most amazing thing. [asked why he frightened children] It's my resting face, I was born with it. I built a career around it ... I'm thinking, oh my God, that's a beautiful suit, but if I'm just thinking about it, it looks like I might want to choke you.", "Ava [his daughter] doesn't need to see anything I do. She's been on a lot of movie sets, but she doesn't need to see the output. I don't care if she ever does.", "[Hawkeye's family] was the greatest gift ... from the writers and 'Kevin Feige' (qv), and 'Joss Whedon' (qv) at the time. You know, a superhero with no superpowers. Well, that's a superpower. Don't mess with a man's family.", "[Which politician would he like to meet?] If I were to meet a politician. . . I would love to meet [then Vice President] Joe Biden. He reminds me of my father [and] of my godfather - he is affable and kind of punchy, and I think it would be a really fun meeting.", "When I saw Iron Man, I thought that was a really kick-ass approach to superheroes. Then they told me about this Hawkeye character, and I liked how he wasn't really a superhero; he's just a guy with a high skill set. I could connect to that.", "I like showing up on sets. I feel blessed to be able to play make-believe for a living. It's my job.", "We can croak at any moment doing the stupidest things. It would be a great disservice to [Ava] if, when she was older, she thought, Dad stopped riding motorcycles or started getting soft and protective of his own life because he wanted to be around for me. What message does that send? That living life with fear is a good thing? I'd rather that she knows I'd go out with a smile on my face living accountably, consciously and responsibly in my actions.", "I'm blessed to have cool roles in these big movies. Because nothing against 'Transformers,' but thank God I don't have to do a monologue to a robot. I don't know how Shia [LaBeouf], God bless him, does that.", "I wanted to explore the loss, the character themes. He [Cory Lambert]'s carrying the weight and the burden of being a father, the righteousness, the humility. A movie like Wind River lets me flex a bit and go deep, use all six gears.", "[in response to Stephen Amell's statement that Green Arrow could beat Hawkeye 'in any contest'] I'm happy that fictitious character can beat this other fictitious character in any random contest that he would like to challenge him to. I'm happy for that.", "The Burj Khalifa thing, since we're talking about Tom [Cruise] and stunts, that is something I would not have done, ever. No way. Just hanging out [of the window] to grab onto him was terrifying.", "Being a family man is a beautiful grounding rod for superheroes that fly around with hammers and lightning... What does it matter at the end? What are we all fighting for? I feel like Clint has the best gig, in the sense where the reality is that we can all go back to family.", "You'll never see this face doing a romantic comedy, it's just not gonna happen.", "So, I was like, into computer science and criminology, I thought being a cop or a detective would be cool, and realized it's too much work. So I became an actor.", "[about his EOD training for Hurt Locker] Yeah, I got to learn quite a lot. But people always ask me, if there was a bomb sitting in this plant, could you render it safe? And I'm like, I would, but I'd be out of this door before you even told me.", "The idea of being famous really isn't that interesting to me, but you know, you kind of need it sometimes to procure work. I just don't want people chasing me with cameras. I'm pretty private about my life. And I'd like to keep it that way.", "I don't let anybody I've ever dated watch that movie [Dahmer]. My mom didn't talk to me awhile after that movie. I can't even watch it."], "salary history": ["_The Hurt Locker (2008)_ (qv)::$65,000", "_The Bourne Legacy (2012)_ (qv)::$5,000,000", "_Avengers: Age of Ultron (2015)_ (qv)::$5,000,000 + % back-end"], "birth date": "1971-01-07", "birth notes": "Modesto, California, USA", "_actorID": "16", "_source": "IMDB", "actorID": "0719637", "created_utc_dt": "09/14/2019, 13:01:26"}