{"headshot": "https://m.media-amazon.com/images/M/MV5BMTgwMzQ4ODYxMV5BMl5BanBnXkFtZTcwNDAwMTc2NQ@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["O"], "birth name": "Owen Cunningham Wilson", "height": "5' 10½\" (1.79 m)", "mini biography": ["Self-proclaimed troublemaker Owen Cunningham Wilson was born in Dallas, to Irish-American parents originally from Massachusetts. He grew up in Texas with his mother, Laura (Cunningham), a photographer; his father, Robert 'Andrew Wilson' (qv), an ad exec; and his brothers, 'Andrew Wilson' (qv) (the eldest) and 'Luke Wilson' (qv) (the youngest). Expelled from St. Mark's School of Texas (Dallas, TX) in the tenth grade, Wilson finished his sophomore year at Thomas Jefferson School and then headed to a military academy in New Mexico. He then attended the University of Texas at Austin, where he met his future mentor and friend, 'Wes Anderson' (qv). They wrote a screenplay, _Bottle Rocket (1996)_ (qv), and sent it to their family friend, screenwriter 'L.M. Kit Carson' (qv), who sent it to producer 'Polly Platt' (qv), who gave it to 'James L. Brooks' (qv), who gave the Texans $5 million to make it into a feature film. Despite critical praise, _Bottle Rocket (1996)_ (qv) only grossed one million dollars. After making the film, Wilson moved to Hollywood, setting up house with his two brothers and Anderson. Fairly quickly, Owen found himself acting in a series of big budget films, such as _The Cable Guy (1996)_ (qv), _The Haunting (1999)_ (qv), _Anaconda (1997)_ (qv) and _Breakfast of Champions (1999)_ (qv). This led to more work, such as _Shanghai Noon (2000)_ (qv), _Meet the Parents (2000)_ (qv) and _Behind Enemy Lines (2001)_ (qv). He's known not only for his nose, which has been broken several times, but also for his 'free wheeling ways' with a script. He co-wrote the film _The Royal Tenenbaums (2001)_ (qv) with his oft partner 'Wes Anderson' (qv).::(Unknown)"], "trade mark": ["His nose", "His mop of blond hair", "Soft mellow voice", "Often works with 'Ben Stiller' (qv) and his brother 'Luke Wilson' (qv)", "Often plays extremely mellow and friendly characters", "Frequently cast by 'Wes Anderson' (qv)", "Says \"wow\" at least once in almost every movie."], "trivia": ["Neighbor of 'Anthony Begonia' (qv) and middle brother of 'Luke Wilson' (qv) and 'Andrew Wilson' (qv).", "Cut his chin and had to get stitches during the making of _The Haunting (1999)_ (qv) in the scene where his character Luke is attacking the portrait of Hugh Crane with a candlestick.", "Despite being grateful of his success as an actor, he still considers himself a writer at heart and wishes he devoted more time to that rather than acting. Due to a busy schedule as an actor, he sadly had to miss contributing to the script for 'Wes Anderson' (qv)'s _The Life Aquatic with Steve Zissou (2004)_ (qv), despite that he co-wrote Anderson's 3 previous films.", "He is known for his improvisational abilities, which he mostly contributes to films other than the more personal ones he does with 'Wes Anderson' (qv). Many of the funniest lines in his movies are his improvisations.", "Usually declines to discuss the source of his distinctive-looking nose, which was broken twice. The broken nose was apparently the result of a football injury attained while on the football team in high school (all three Wilson brothers had played high school football, the elder Andrew with the greatest success).", "Is a member of what the media refers to as \"The Frat Pack,\" along with 'Will Ferrell' (qv), 'Jack Black' (qv), 'Vince Vaughn' (qv), 'Ben Stiller' (qv), 'Steve Carell' (qv), and 'Luke Wilson' (qv). The \"Frat Pack\" name is a reference to the film _Old School (2003)_ (qv), featuring Vaughn, Ferrell and 'Luke Wilson' (qv), and to the wide number of films featuring the seven actors. Wilson's \"Frat Pack\" films include _Zoolander (2001)_ (qv), _Wedding Crashers (2005)_ (qv), _The Royal Tenenbaums (2001)_ (qv), _The Cable Guy (1996)_ (qv), and _Starsky & Hutch (2004)_ (qv).", "Has been in 12 movies with 'Ben Stiller' (qv), up to this date. They are _The Cable Guy (1996)_ (qv), _Permanent Midnight (1998)_ (qv), _Heat Vision and Jack (1999)_ (qv), _Meet the Parents (2000)_ (qv), _Zoolander (2001)_ (qv), _The Royal Tenenbaums (2001)_ (qv), _Starsky & Hutch (2004)_ (qv), _Meet the Fockers (2004)_ (qv), _Night at the Museum (2006)_ (qv), _Night at the Museum: Battle of the Smithsonian (2009)_ (qv), _Little Fockers (2010)_ (qv), and _Night at the Museum: Secret of the Tomb (2014)_ (qv).", "He and his brother 'Luke Wilson' (qv) were originally meant to play the Malloy brothers in _Ocean's Eleven (2001)_ (qv), but dropped out to make _The Royal Tenenbaums (2001)_ (qv).", "Majored in English.", "Father was a PBS exec.", "When appearing on Australian talk show, _Rove Live (2000)_ (qv), he became the 1001st guest on the show. He was appearing with 'Isla Fisher' (qv). Fisher walked out first and therefore became the 1000th. Wilson received a meat tray.", "First \"Frat Pack\" member to receive an Academy Award nomination.", "Is of Irish descent.", "Was the best man at the wedding of his brother, 'Andrew Wilson' (qv).", "Has an Australian cattle dog named Garcia.", "Attended his senior year in high school at the New Mexico Military Institute, instead of a normal academic school.", "Fan of Chelsea FC (England soccer club).", "Has been in a relationship with 'Kate Hudson' (qv) twice. They originally began a relationship in August 2006, having met on the set of _You, Me and Dupree (2006)_ (qv), but they broke up in May 2007. They reconciled in March 2008, only to separate a second time in May 2008.", "Never wanted to be an actor, but writing is his passion.", "Born to Robert 'Andrew Wilson' (qv), an advertising executive and operator of KERA, a public TV station in Dallas, and his wife Laura Cunningham, a photographer.", "Was romantically linked to 'Demi Moore' (qv) and 'Sheryl Crow' (qv).", "Was taken to St. John's Hospital in Santa Monica, CA after a reported suicide attempt (26 August 2007).", "Owen, Andrew and Luke's father was the first to bring _Monty Python's Flying Circus (1969)_ (qv) to American TV where he managed KERA, a PBS station, in Dallas, TX.", "Became a father for the 1st time at age 42 when his girlfriend Jade Duell gave birth to their son Robert Ford Wilson on January 14, 2011.", "Was in a relationship with Federal Air Marshall Jade Duell (December 2009-June 2011).", "Along with his co-stars 'Jenna Fischer' (qv), 'Christina Applegate' (qv) and 'Alyssa Milano' (qv), Wilson is one of four actors from the film _Hall Pass (2011)_ (qv) to become a first-time parent the same year the film was released.", "Although often associated with Texas, where he was born and grew up, both of his parents were Irish-American Massachusetts natives who moved to Texas due to his father's work.", "Vacationed for a week with 'Stephen Dorff' (qv) in Rio de Janeiro, Brazil. [November 2012]", "He planned on joining the Marine Corps if _Bottle Rocket (1996)_ (qv) had not been successful.", "Suffers from and has sought treatment for depression.", "Filming _Marley & Me (2008)_ (qv) in Philadelphia, PA. [May 2008]", "Currently filming Danny Roane: First Time Director (2005) in Los Angeles, California, USA [August 2005]", "He visited Argentina for two days. [November 2004]", "Currently dubbing his voice in Disney's Pixar Animation film _Cars (2006)_ (qv). [May 2005]", "Filming _Night at the Museum: Battle of the Smithsonian (2009)_ (qv) in Vancouver, Canada. [September 2008]", "Is expecting a child with his personal trainer Caroline Lindqvist. Lindqvist revealed that the two of them are not in a relationship, but they are just close friends who decided to have a baby together. Lindqvist filed for divorce from her estranged husband, when she found out she was pregnant with Wilson's child. [October 2013]", "Became a father for the 2nd time at age 45 when his personal trainer Caroline Lindqvist gave birth to their son on January 30, 2014.", "He is left-handed.", "To date, has appeared in 5 film franchises. 5 that garnered sequels (_Shanghai Knights (2003)_ (qv), _Meet the Fockers (2004)_ (qv), _Night at the Museum: Battle of the Smithsonian (2009)_ (qv), _Cars 2 (2011)_ (qv) & the recently announced _Zoolander 2 (2016)_ (qv)) & 2 that became trilogies (_Little Fockers (2010)_ (qv) and _Night at the Museum: Secret of the Tomb (2014)_ (qv))."], "quotes": ["\"It's funny how it usually works out that I end up dying. It sort of works out, because by the time I die, I'm usually tired of working on that particular movie, so I look forward to it.\" - about how a lot of his characters end up dying.", "\"Being in a bathtub with 'Jackie Chan' (qv), I don't know, it has a way of bonding you I'll tell you that. I don't know if there are some weird undertones. It was like we had met in Los Angeles and we didn't have that much to say to each other but, after that bathtub scene, we were great friends. What it really was was that when we'd play off each other, it really was fun. We really did become friends\". - on the bathtub scene in _Shanghai Noon (2000)_ (qv).", "\"The walk off was the most uncomfortable scene for me to shoot, cos I literally have never danced in public or really even in private. I'm not a musical person and we had to dance like 'Michael Jackson' (qv) and we had to do breakdancing...\" - about the walk off scene in _Zoolander (2001)_ (qv).", "\"Sometimes I stop and think how strange this all is. Something that began as a little idea in Austin, that Wes and I just walked around talking about between ourselves, has turned into all this.\" - on how his career has turned out.", "You can think of Hollywood as high school. TV actors are freshmen, comedy actors are maybe juniors, and dramatic actors - they're the cool seniors.", "\"I guess a lot of me in the sense is like Dignan, that's my sense of humor. The stuff that Dignan is doing is what I would do. When we test-screened the movie I realized that not everybody laughed where I did. I realized there's not a big audience for my type of humor. Dignan doesn't have self-awareness. 'Donald Trump' (qv) has none either. When I read \"The Art of the Deal\" I laughed at that because neither of them realize how funny they are\" - about his character Dignan in _Bottle Rocket (1996)_ (qv).", "[Talking about his relationship with 'Sheryl Crow' (qv) and his relationships with women in general]: \"Going out with someone who's doing the same thing as you, who's in the public eye, can be a problem... You want a break when you come home. You don't want someone with the same issues as you maybe reminding you of stuff you don't like in yourself. That being said, I don't think being in the spotlight had anything to do with me and Sheryl not working out. The story of our relationship is the same story I've had with most of my relationships. I was lucky enough to find a great girl and, because of my lack of... focus, the relationship went south\".", "We spent so much time together that I can remember us being in our teens and our dad saying we should try to find some other friends because he thought we were our own lowest common denominator when we got together. - on his brothers.", "Acting is more fun than writing. Writing is harder, more like having a term paper.", "Yes, sometimes people get irritated, starting with my brother Luke in BR. He would get pissed at me, like, 'Why don't you just say the lines that you wrote?'\" - on whether or not his improvisational skills bother fellow actors.", "\"Ben, for example, is kind of a moody guy, and you kind of have to put on the kid gloves because you never know which Ben is going to show up on set\" - on 'Ben Stiller' (qv).", "I can't think of a movie I wish I'd acted in, but there are movies I wish I'd written.", "Not Shakespeare. In college I took a Shakespeare class because I was an English major, and they had a Summer program called Shakespeare at Winedale, which is out in the German Hill country in Texas , where you go out and live for two months and then you perform three plays at the end of that time. And people from Austin drive out and see it. I was supposed to be one of the two gentlemen of Verona . And I got out there and I just could not stand being out there. There were also so many lines to memorize that it was just overwhelming for me. So I ended up going home and I got an F.", "A buddy movie has to have that beat where one buddy doesn't show up. They hit the same beats as romantic comedies.", "At about the same age as I was interested in petrified wood, I was just fascinated with this dumb idea that we only used 10 percent of our brains. I was always thinking, Man, if I could only use 20...", "I'm not going to play a guy with MS or a guy in a wheelchair. I can play a dramatic character, certainly, but I'm not the real chameleon-type actor who, you know, changes his voice and everything.", "Actually, to be honest, a shotgun wedding might be the way to go for me. You can't stay at the party forever. At some point, you have to take stock and ask yourself, 'What am I doing here?'", "To me, being cool is just the opposite of living. It's about not getting too worked up about anything, by being 'Nyah, nyah, nyah,' and no big deal. I can't stand that. It's such a jaded, clichéd posture to take. I get real enthusiastic about stuff. It's what I think is life-affirming.", "I thought that I'd be married by the time I was 30 and be starting a family, but it just hasn't worked out that way. I think that there's something about being in Hollywood. I don't know if I'm shallow, but you want to make sure that you make the right choice because you know that it's forever and I didn't realize that I have such a strong scientific side that demands that I experiment with and compare women. 2005.", "\"The studio said _Bottle Rocket (1996)_ (qv) was their worst-testing movie in history, so I looked into the marines. Maybe I was influenced by _An Officer and a Gentleman (1982)_ (qv). Or those marine commercials - they were so cool! Like a 'Led Zeppelin' (qv) song come to life, full of people pulling swords from rocks and fighting lava monsters!\".", "\"The director made that decision not to use my butt...I don't know how to interpret that.\" - on having a body double for a scene in _You, Me and Dupree (2006)_ (qv).", "(On what he enjoys most about being an actor) \"I was reading some Bob Dylan interview where he said, 'It beats nine-to-five. It beat it yesterday, it beats it today, and it will beat it tomorrow.' That's how I feel. I just thank God that I'm able to make a living doing something that I can have a good time doing, and be creative.\"", "I think there is a middle-child syndrome. I don't know quite what it is, but I think I suffer from it.", "There's that great quote from Beckett, I think, 'He had an abiding sense of melancholy that sustained him through brief periods of joy.' I like that, because I'm definitely an up-and-down person.", "(Before meeting with 'James L. Brooks' (qv) about _Bottle Rocket (1996)_ (qv)) Luke and I had a punching fight. I had scratch marks down my face. I had to get on the plane. It's really emotional fighting your brother. We were crying a little bit on the flight. We went to the meeting. It was such a heavy vibe from us, they didn't even ask us what had happened to our faces.", "It was maybe easier for my dad to be around Luke. They had more of a connection. Luke looked like my mother and of course, Andrew was the oldest. My dad and I would butt heads.", "It's that middle brother syndrome. The older child has a very clear identity, and the baby gets a lot of attention. The middle brother is a little bit in no-man's land. That might give you a little bit of sensitivity, a feeling that you're not clearly on the winning team, you know?", "I think of myself as a doom person. I'm a worrier. But I like the idea of being an optimist. Maybe I'm the kind of optimist who deep down knows it's not going to work.", "I don't feel like I'm a hundred times happier. Can't we petition someone to make it so that outside stuff is the key to happiness? I'm tired of people always saying, 'It's gotta come from you!' Can't it come from, like, a new pair of shoes?", "I don't like caring what other people think, but I do. There's a freedom when you meet someone who doesn't care, who is just themselves in all situations. I had the way I was with my friends, and then my personality with adults, and that's continued a little bit. To just be yourself, and not try to sell anything, or make a good impression, that's something worth striving towards.", "The image - being from Texas, the slacker, surfer thing - you don't think of that and see a worrier, an angst-ridden person, I know that. Also, I'm reasonably polite and that puts people at their ease, so they think you are too.", "I've started to notice that, as you get older, mental health is as fragile as physical health. I've never had a breakdown, but you can really get sideswiped by stuff like depression. I'm an up-and-down person. That's one thing that girlfriends would complain about. I'm inconsistent, not romantic enough.", "[on filming _Midnight in Paris (2011)_ (qv)]: I really didn't know, to be honest, whether it was working. This fantastical element when I go on my walks at midnight into this other world. I had my doubts because a lot of the people that I meet are iconic people from history. Who's going to play them? How's that going to work? But then I see the movie and it works. It's one of the best things in the movie. It was great.", "[on being cast in _The Grand Budapest Hotel (2014)_ (qv)] Sometimes you work on a movie and you're not quite sure. You sense some anxiety in the director, that they're not sure exactly what they want. But with Wes [Anderson] you know he's definitely steering the ship and doing exactly what he thinks is best for the movie.", "Wow.", "Wow, these keys are great...! Push this button and your car honks; you can honk from outside your car, it's crazy! I remember back when I was a child I had to go in the car to honk... Wow!"], "salary history": ["_Shanghai Noon (2000)_ (qv)::$4,000,000", "_Zoolander (2001)_ (qv)::$2,000,000", "_Behind Enemy Lines (2001)_ (qv)::$3,000,000", "_Starsky & Hutch (2004)_ (qv)::$10,000,000", "_Wedding Crashers (2005)_ (qv)::$10,000,000", "_Marmaduke (2010)_ (qv)::$1,000,000", "_How Do You Know (2010)_ (qv)::$8,000,000", "_Little Fockers (2010)_ (qv)::$15,000,000", "_Hall Pass (2011)_ (qv)::$8,000,000", "_Cars 2 (2011)_ (qv)::$2,500,000", "_The Big Year (2011)_ (qv)::$8,000,000"], "birth date": "1968-11-18", "birth notes": "Dallas, Texas, USA", "_actorID": "58", "_source": "IMDB", "actorID": "0005562", "created_utc_dt": "09/14/2019, 13:02:06"}