{"headshot": "https://m.media-amazon.com/images/M/MV5BMTk1MjM5NDg4MF5BMl5BanBnXkFtZTcwNDg1OTQ4Nw@@._V1_UY98_CR2,0,67,98_AL_.jpg", "nick names": ["Nic"], "birth name": "Nicole Mary Kidman", "height": "5' 11\" (1.8 m)", "mini biography": ["Elegant blonde 'Nicole Kidman' (qv), known as one of Hollywood's top Australian imports, was actually born in Honolulu, Hawaii, while her Australian parents were there on educational visas.Kidman is the daughter of Janelle Ann (Glenny), a nursing instructor, and Antony David Kidman, a biochemist and clinical psychologist. She is of English, Irish, and Scottish descent. Shortly after her birth, the family moved to Washington, D.C., where Nicole's father pursued his research on breast cancer, and then, three years later, made the pilgrimage back to her parents' native Sydney in Australia, where Nicole was raised. Young Nicole's first love was ballet, but she eventually took up mime and drama as well (her first stage role was a bleating sheep in an elementary school Christmas pageant). In her adolescent years, acting edged out the other arts and became a kind of refuge -- as her classmates sought out fun in the sun, the fair-skinned Kidman retreated to dark rehearsal halls to practice her craft. She worked regularly at the Philip Street Theater, where she once received a personal letter of praise and encouragement from audience member 'Jane Campion' (qv) (then a film student). Kidman eventually dropped out of high school to pursue acting full-time. She broke into movies at age 16, landing a role in the Australian holiday favorite _Bush Christmas (1983)_ (qv). That appearance touched off a flurry of film and television offers, including a lead in _BMX Bandits (1983)_ (qv) and a turn as a schoolgirl-turned-protester in the miniseries _Vietnam (1987)_ (qv) (for which she won her first Australian Film Institute Award). With the help of an American agent, she eventually made her US debut opposite 'Sam Neill' (qv) in the at-sea thriller _Dead Calm (1989)_ (qv).Kidman's next casting coup scored her more than exposure. While starring as 'Tom Cruise' (qv)'s doctor/love interest in the racetrack romance _Days of Thunder (1990)_ (qv), she won over the Hollywood hunk hook, line and sinker. After a whirlwind courtship (and decent box office returns), the couple wed on December 24, 1990. Determined not to let her new marital status overshadow her fledgling career, the actress pressed on. She appeared as a catty high school senior in the Australian film _Flirting (1991)_ (qv), then as 'Dustin Hoffman' (qv)'s moll in the gangster flick _Billy Bathgate (1991)_ (qv). She reunited with Cruise for _Far and Away (1992)_ (qv), the story of young Irish lovers who flee to America in the late 1800s, and starred opposite 'Michael Keaton' (qv) in the tear-tugger _My Life (1993)_ (qv). Despite her steady employment, critics and moviegoers still had not quite warmed to Kidman as a leading lady. She tried to spice up her image by seducing 'Val Kilmer' (qv) in _Batman Forever (1995)_ (qv), but achieved her real breakthrough with 'Gus Van Sant' (qv)'s _To Die For (1995)_ (qv). As a fame-crazed housewife determined to eliminate any obstacle in her path, Kidman proved that she had an impressive range and deadly comic timing. She took home a Golden Globe and several critics' awards for the performance. In 1996, Kidman stepped into a corset to work with her countrywoman and onetime admirer, 'Jane Campion' (qv), on the adaptation of 'Henry James' (qv)'s _The Portrait of a Lady (1996)_ (qv). A few months later, she tore across the screen as a nuclear weapons expert in _The Peacemaker (1997)_ (qv), adding \"action star\" to her professional repertoire.She and Cruise then disappeared into a notoriously long, secretive shoot for 'Stanley Kubrick' (qv)'s sexual thriller _Eyes Wide Shut (1999)_ (qv). The couple's on-screen shenanigans prompted an increase in public speculation about their sex life (rumors had long been circulating that their marriage was a cover-up for Cruise's homosexuality); tired of denying tabloid attacks, they successfully sued The Star for a story alleging that they needed a sex therapist to coach them through love scenes. Family life has always been a priority for Kidman. Born to social activists (mother was a feminist; father, a labor advocate), Nicole and her little sister, 'Antonia Kidman' (qv), discussed current events around the dinner table and participated in their parents' campaigns by passing out pamphlets on street corners. When her mother was diagnosed with breast cancer, 17-year-old Nicole stopped working and took a massage course so that she could provide physical therapy (her mother eventually beat the cancer). She and Cruise adopted two children: Isabella Jane (born 1993) and Connor Antony (born 1995). Despite their rock-solid image, the couple announced in early 2001 that they were separating due to career conflicts. Her marriage to Cruise ended mid-summer of 2001.::IMDb Editors"], "spouse": ["'Keith Urban' (qv)::(25 June 2006 - present) ( 2 children)", "'Tom Cruise' (qv)::(24 December 1990 - 8 August 2001) ( divorced) ( 2 children)"], "trade mark": ["Statuesque, model-like figure", "Her independent films often feature the theme of grief and sorrow, such as _Birth (2004)_ (qv) and _Rabbit Hole (2010)_ (qv)", "Often portrays upper-class women in epics, such as Ada Monroe in _Cold Mountain (2003)_ (qv), Marisa Coulter in _The Golden Compass (2007)_ (qv), Lady Sarah Ashley in _Australia (2008)_ (qv) and Gertrude Bell in _Queen of the Desert (2015)_ (qv).", "Radiant, alabaster skin"], "trivia": ["2000: She and her husband 'Tom Cruise' (qv) donated to 'Hillary Clinton' (qv)'s campaign for a seat in the U.S. Senate representing New York state.", "Suffered a broken rib while rehearsing a dance routine for the movie _Moulin Rouge! (2001)_ (qv). Production was halted while she recovered.", "Chosen by People Magazine as one of the 50 Most Beautiful People in the World in 1996, 1999 and 2002. In 2004, she was one of People Magazine's \"50 Most Beautiful People for Most Wanted Skin\". She ranked as #69 in FHM's \"100 Sexiest Women in the World 2005\" special supplement and in August 2008 she was voted the fifth Sexiest Female Movie Star in the Australian Empire Magazine.", "Wore a corset while filming _The Portrait of a Lady (1996)_ (qv) to take her waist down to 19\".", "Spent two weeks in bed after filming of _The Portrait of a Lady (1996)_ (qv) - diagnosed as suffering from \"emotional stress\".", "10/99: Crusader against child abuse. \"Children should be allowed to grow up without fear of cruelty.\".", "Listed in \"People Weekly\"s \"Most Intriguing People\" list of 1995. In 2001, she was awarded \"Celebrity of the Year\" by E!, \"Entertainer of the Year\" by Entertainment Weekly and named one of People Magazine's \"25 Most Intriguing People of 2001\". Also, Premiere Magazine ranked her as #48 on a list of the \"Greatest Movie Stars of All Time\" in their 2005 feature \"Stars in Our Constellation\". Finally, she ranked #31 in Premiere's annual Power 100 List. Had ranked #83 in 2002.", "Played a young girl named Grace on a sketch on _Saturday Night Live (1975)_ (qv) with 'Mike Myers' (qv), the next time she played a character named Grace was her movie _The Others (2001)_ (qv). She played a character named Grace for the third time in _Dogville (2003)_ (qv) and for the fourth time as the protagonist in _Grace of Monaco (2014)_ (qv).", "She was supposed to be the star of _Panic Room (2002)_ (qv), but she hurt herself in a stunt for _Moulin Rouge! (2001)_ (qv). So, she played the voice of 'Jodie Foster' (qv)'s divorced husband's wife.", "Older sister of Australian television personality 'Antonia Kidman' (qv).", "Although naturally left-handed, she taught herself to write right-handed for her role in _The Hours (2002)_ (qv), where she played the right-handed author 'Virginia Woolf' (qv).", "Received a star on the Hollywood Walk of Fame at 6801 Hollywood Boulevard in Hollywood, California on January 13, 2003.", "Found out about her first Academy Award nomination, for _Moulin Rouge! (2001)_ (qv), while shooting _Dogville (2003)_ (qv) in Sweden. She was in the middle of shooting a scene when someone held up a sign with the announcement.", "First Australian actress to win the Best Actress Academy Award.", "Prior to the release of _Australia (2008)_ (qv), she was elected alongside fellow Aussie 'Hugh Jackman' (qv) as one of the favorite upcoming romantic couples on screen.", "Originally cast as Mrs. Smith in _Mr. & Mrs. Smith (2005)_ (qv). She was the one who suggested 'Brad Pitt' (qv) as the co-lead.", "Has appeared in _My Life (1993)_ (qv) with 'Michael Keaton' (qv), _Batman Forever (1995)_ (qv) with 'Val Kilmer' (qv), _The Peacemaker (1997)_ (qv) with 'George Clooney' (qv) and _The Portrait of a Lady (1996)_ (qv) with 'Christian Bale' (qv). All four actors have played Batman in a movie. She also appeared in _To Die For (1995)_ (qv) with 'Casey Affleck' (qv), whose brother 'Ben Affleck' (qv) has also played Batman.", "She was awarded the Special Award at the London Evening Standard Theatre 'Awards' (qv) for her special and significant contributions to London Theatre for her performance in \"The Blue Room\". She was also nominated for a 'Laurence Olivier' (qv) Theatre Award in 1999 (1998 season) for Best Actress for her performance in \"The Blue Room\".", "A very tall woman at nearly 5' 11\", she actually stood about 4 inches taller than ex-husband 'Tom Cruise' (qv), and rarely wore heels when seen publicly with him so that they could appear similar in height. Since their divorce, she is rarely seen on the red carpet without high heels, and she often meets 6' 4\" actors in the eye. She was already 5' 9\" when she was age 13.", "Scored an IQ of 132+", "While she usually commands $10 million+ for a movie, she was willing to receive only $500,000 for her role in \"Eucalyptus\" (2006), that eventually was scrapped. Produced by \"Fox Searchlight\", its financing guideline showed that each actor signed on to the project could receive no more than $500,000, in order to keep costs low. This movie was set to be produced in Australia, another reason she decided to accept it. She was slated to star alongside 'Russell Crowe' (qv) in the movie, but the project was ultimately dropped.", "Has never used a body double for her nude scenes.", "Replaced 'Rene Russo' (qv) as Dr. Chase Meridian in _Batman Forever (1995)_ (qv) when 'Val Kilmer' (qv) replaced 'Michael Keaton' (qv).", "Likes the poetry of 'Anne Carson' (qv) and the writing of 'Philip Larkin' (qv).", "Writes short stories in her free time and hopes to publish them one day. She revealed in June 2014 that she's also working on her first screenplay for a feature film.", "Is in the 50th-anniversary edition of the Guinness Book Of Records as the highest-paid actress in a commercial. She netted $3.71 million for her part in a four-minute 'Baz Luhrmann' (qv)-directed Chanel No. 5 movie ad. The ad, costing $11 million a minute, is a short film titled \"No 5: The Film\". Guinness book editors noted the actress earned $928,800 per minute. Costumes designed by 'Karl Lagerfeld' (qv) and score by Debussy.", "Was considered for the role of Catwoman in _Batman Returns (1992)_ (qv), for the 'Meg Ryan' (qv) role in _Sleepless in Seattle (1993)_ (qv) and for Jenny Curran in _Forrest Gump (1994)_ (qv), which went to 'Robin Wright' (qv). She also auditioned for a part in _The English Patient (1996)_ (qv) but was turned down.", "Had played a witch twice: once in _Practical Magic (1998)_ (qv) and again in _Bewitched (2005)_ (qv). Witches also featured in her film _The Golden Compass (2007)_ (qv).", "Is a pianist, and did her own piano-playing in _Cold Mountain (2003)_ (qv).", "Is highly conscious of avoiding excessive sun exposure, and is rarely seen during her downtime without a hat, sunglasses and wearing sunscreen. In fact, best friend 'Naomi Watts' (qv) has said that \"Nicole won't cross the street without a hat.\"", "In addition to having worked with all four of the most recent Batmans, she has also worked with both of the most recent actors to play Alfred Pennyworth. In _Batman Forever (1995)_ (qv), she appears with 'Michael Gough' (qv). In _Bewitched (2005)_ (qv), her father is played by 'Michael Caine' (qv).", "Has one niece: Lucia (b. 1999) and two nephews: Hamish (b. 2001), James (b. 2003).", "August 2004: Australian business magazine Business Review Weekly listed Kidman as the richest Australian woman under age 40, estimated at a worth of $155 million (Australian).", "Is childhood friends with 'Peter Overton' (qv), a reporter for the Australian _60 Minutes (1979)_ (qv) program. Both lived in the same suburb of Sydney when they were children.", "She has English, Irish and Scottish ancestry.", "She and ex-husband 'Tom Cruise' (qv) made three movies together: _Days of Thunder (1990)_ (qv), _Eyes Wide Shut (1999)_ (qv) and _Far and Away (1992)_ (qv). They met on the set of _Days of Thunder (1990)_ (qv).", "Attended the same high school attended by 'Catherine Martin' (qv) (two time Oscar winner for costume design and direction on _Moulin Rouge! (2001)_ (qv) and wife of 'Baz Luhrmann' (qv)) and legendary Australian actress 'Ruth Cracknell' (qv).", "Godmother of Harry (b. 19 September 2001), the son of 'Simon Baker' (qv) and 'Rebecca Rigg' (qv). Riggs and Kidman are close friends.", "Named goodwill ambassador for the United Nations Development Fund for Women.", "Was listed as a potential nominee on both the 2006 and 2008 Razzie Award nominating ballots. She was suggested in the Worst Actress category on the 2006 ballot for her performance in _Bewitched (2005)_ (qv). And she was suggested again two years later on the 2007 ballot in the Worst Actress category again for her performance in _The Invasion (2007)_ (qv). She failed to receive either nominations.", "2006: Her performance as Suzanne Stone Maretto in _To Die For (1995)_ (qv) is ranked #40 on Premiere Magazine's 100 Greatest Performances of All Time.", "2006: Accompanied her boyfriend 'Keith Urban' (qv) to the Grammy 'Awards' (qv). It was their first public appearance together.", "Is allergic to strawberries and scared of butterflies (lepidopterophobia). Curiously snakes and spiders don't faze her.", "Wore a wedding gown at her wedding to 'Keith Urban' (qv) by the label Balenciaga.", "Married 'Keith Urban' (qv) in the St. Patrick's church in Manly, a suburb of Sydney. The wedding ceremony lasted 35 minutes. 230 guests attended her wedding to 'Keith Urban' (qv). Among them were her best friend 'Naomi Watts' (qv), 'Russell Crowe' (qv), 'Baz Luhrmann' (qv), 'Hugh Jackman' (qv) and Nicole's two children Isabella and Conor. 'Jim Carrey' (qv) was invited and greatly wanted to come, in fact he booked plane tickets to Australia, but last minute scheduling conflicts stopped him from going.", "She asked her wedding guests not to buy any presents for her and 'Keith Urban' (qv) but to donate the money instead to some humanitarian organization.", "She and 'Keith Urban' (qv) honeymooned in Tahiti -- more precisely the St. Regis in Bora Bora. 'Eva Longoria' (qv) and her boyfriend Tony Parker were also coincidentally staying there at the time.", "'Baz Luhrmann' (qv) read a love Psalm by New Zealand writer Joy Cowley (a nod to Urban's birth place) at her wedding to 'Keith Urban' (qv).", "Three star performers sang at her wedding reception to 'Keith Urban' (qv). 'Hugh Jackman' (qv) sang \"Tenterfield Saddler\", a favorite of Urban's. 'Keith Urban' (qv) sang his hit song \"Making Memories of Us\" to her. 'Neil Finn' (qv) sang \"Fall At Your Feet\".", "Dropped out of the role of 'Katharine Hepburn' (qv) in _The Aviator (2004)_ (qv) due to scheduling conflicts.", "Author 'Philip Pullman' (qv) requested her specifically to play the role of Marisa Coulter in _The Golden Compass (2007)_ (qv), the movie adaptation of his book \"His Dark Materials: Northern Lights\" from 1995. Kidman was originally unsure if she would take the part when some producers from New Line Cinema offered it to her. However, with a beautiful letter, Pullman fully convinced her to take the role. Pullman knew she was right for the part after he saw her performance in _To Die For (1995)_ (qv) and with a producer from New Line Cinema he had discussed the possibilities of her playing the part, from the day the rights to the book were sold, to 10 years later when she signed on for the film. As a part of her preparation, Kidman re-read the whole His Dark Materials trilogy, and wrote small notes, whenever she found something personal about the character, before filming began. The film ended up being the biggest film of her career, with a budget of $180 million and a box office income of $372 million worldwide, the biggest live-action success that she has experienced.", "Studied ballet and drama in Australia.", "'Keith Urban' (qv)'s brother, Shane Urban, was best man at their wedding. His friend, 'Marlon Holden' (qv), was the groomsman.", "'Keith Urban' (qv) gave Nicole a first edition of 'Emily Brontë' (qv)'s novel, \"Wuthering Heights\", purchased from Sotherby's for $200,000 as a wedding present.", "Wrote the introduction to the book \"Truth: Personas, Needs, and Flaws in the Art of Building Actors and Creating Characters\" by her friend and acting consultant 'Susan Batson' (qv).", "2004: Topped The Hollywood Reporter's list of the highest-paid actresses in Hollywood. In 2007, Forbes Magazine estimated her earnings for the year to be $28 million.", "9/01: Attended the Royal Premiere of _Moulin Rouge! (2001)_ (qv) alongside 'Kylie Minogue' (qv), 'Prince Charles' (qv) and 'Ewan McGregor' (qv).", "Is a fan of actress 'Aishwarya Rai Bachchan' (qv), and her film _Bride & Prejudice (2004)_ (qv). Nicole got to meet Aishwarya for the first time at the 2005 Time Magazine's 100 most influential people in the world dinner held in New York City.", "Was originally cast as Ulla in _The Producers (2005)_ (qv) and was considered for roles in _Nymphomaniac: Vol. I (2013)_ (qv) and _Bel Ami (2012)_ (qv). All three roles eventually went to 'Uma Thurman' (qv). Furthermore, 'Joel Schumacher' (qv) also wanted Kidman to play Poison Ivy in _Batman Forever (1995)_ (qv), but the use of the character was delayed to a later entry in the Batman series, in which Thurman played the part.", "The bridesmaids at her wedding were her adopted daughter Isabella Jane Cruise, her sister 'Antonia Kidman' (qv) and her niece Lucia.", "In honor of her June 2006 wedding to singer 'Keith Urban' (qv), Australian TV presenters 'Simon Reeve' (qv) and 'Nelson Aspen' (qv) teamed up to sing Nicole a live rendition of the theme song \"Bewitched\" on the morning news program _Sunrise (2002)_ (qv).", "On April 13, 2007, she was awarded the Companion of the Order of Australia, which is Australia's top civil honor, at a ceremony in Canberra. She was honored for her contribution to cinema as well as her charity work with women, children and cancer research.", "Wore a red wig for her role in _Moulin Rouge! (2001)_ (qv).", "2006: Presented her _The Peacemaker (1997)_ (qv) co-star 'George Clooney' (qv) his Best Supporting Actor Oscar.", "Had several projects lined up during the mid-aughts that never went to fruition; 'Baz Luhrmann' (qv)'s doomed Alexander the Great-project with 'Leonardo DiCaprio' (qv), \"American Darlings\" with 'Jennifer Lopez' (qv), 'Kar-Wai Wong' (qv)'s \"The Lady from Shanghai\", 'Ridley Scott' (qv)'s \"Emma's War\", 'Paul Verhoeven' (qv)'s \"Other Powers\", the 'Steven Spielberg' (qv)-produced \"The Rivals\" co-starring 'Marion Cotillard' (qv). She also circled roles in _I Heart Huckabees (2004)_ (qv) and _The Brothers Grimm (2005)_ (qv), but dropped out of both.", "2004: Presented her _The Interpreter (2005)_ (qv) co-star 'Sean Penn' (qv) his Best Actor Oscar.", "December 2007: According to Forbes, her movies averaged $8 of gross income for every dollar the actress got paid.", "Earns $4 million per year endorsing Chanel No. 5 perfume. Her three year contract was up for renewal in 2007 and was extended to 2009, where it was concluded. She was replaced by 'Audrey Tautou' (qv).", "Turned down the lead role of Roxie Hart in _Chicago (2002)_ (qv) because she had just completed _Moulin Rouge! (2001)_ (qv) and did not want to do two musicals in a row. Her friend, 'Renée Zellweger' (qv), won the role of Roxie and an Oscar nomination for her efforts.", "She and husband 'Keith Urban' (qv), purchased a farm near Leipers Fork, Tennessee, which they are now renovating. (November 2007).", "Moved in together with 'Jack Black' (qv) and 'Jennifer Jason Leigh' (qv) during filming _Margot at the Wedding (2007)_ (qv), because they wanted to perfect their roles as a dysfunctional family.", "To prepare for her role in _The Human Stain (2003)_ (qv) she visited women's shelters and talked to former victims of abuse for inspiration.", "Her and 'Tom Cruise' (qv)'s high profile divorce was finalized the same week that her horror movie _The Others (2001)_ (qv) was released.", "When she went to Sweden to shoot _Dogville (2003)_ (qv), it was the first time in 15 years that she had flown on a public plane.", "For her role in _Birthday Girl (2001)_ (qv) she went to the Russian Embassy in Australia for help in speaking Russian. She didn't work with any other coach on the set except the woman from the embassy.", "Got the role as Diane Arbus in _Fur: An Imaginary Portrait of Diane Arbus (2006)_ (qv) after 'Samantha Morton' (qv) backed out.", "While filming _The Invasion (2007)_ (qv) she was involved in an accident while riding with others in a picture car mounted on trailer being towed by a camera truck rig. While filming a stunt in downtown Los Angeles, the truck took a turn too wide, slid on wet pavement, and collided with a light standard. Several stunt artists on the picture car were injured in the accident. Ms. Kidman was brought to the hospital as a precaution, but was able to return to the set the next day.", "Did her own singing for _Moulin Rouge! (2001)_ (qv), _Happy Feet (2006)_ (qv) and _Nine (2009)_ (qv).", "While reaching a divorce from 'Tom Cruise' (qv), Nicole lived with her friend 'Naomi Watts' (qv).", "It was widely claimed that her friend 'Naomi Watts' (qv) turned down the female lead in _The Interpreter (2005)_ (qv) because she knew Nicole wanted the role. However, the part was actually written exclusively for Kidman, who was a longtime friend of 'Sydney Pollack' (qv), the director of the film. They previously starred in _Eyes Wide Shut (1999)_ (qv) and he produced her films _Birthday Girl (2001)_ (qv) and _Cold Mountain (2003)_ (qv).", "Has worked with some of the most celebrated and acclaimed directors in the movie business: 'Stanley Kubrick' (qv), 'Lars von Trier' (qv), 'Werner Herzog' (qv), 'Chan-wook Park' (qv), 'Noah Baumbach' (qv), 'Anthony Minghella' (qv), 'Stephen Daldry' (qv), 'David Fincher' (qv), 'Baz Luhrmann' (qv), 'Jane Campion' (qv), 'Gus Van Sant' (qv), 'Ron Howard' (qv), The Wachowski siblings and 'George Miller' (qv). In addition to this, she has expressed an eagerness to work with 'Michael Haneke' (qv) and has always dreamed of working with her friend 'Steven Spielberg' (qv).", "One of her favorite collaborators is costume designer 'Ann Roth' (qv), with whom she worked on five projects including _The Hours (2002)_ (qv) and _Rabbit Hole (2010)_ (qv).", "Some of her favorite movies are _Gone with the Wind (1939)_ (qv), _Breaking the Waves (1996)_ (qv), _The Wizard of Oz (1939)_ (qv), _Grease (1978)_ (qv), _Rear Window (1954)_ (qv) and _The Way We Were (1973)_ (qv).", "Good friends with 'Renée Zellweger' (qv), 'Jim Carrey' (qv), 'Russell Crowe' (qv) and 'Meryl Streep' (qv). She also became good friends with 'Daniel Craig' (qv) after working with him on _The Invasion (2007)_ (qv) and _The Golden Compass (2007)_ (qv). In 2014 she revealed that whenever he goes to Australia, he always stays at her house.", "She loved wearing the prosthetic nose, that she originally used in _The Hours (2002)_ (qv) and wore it in private too, mainly as she was undergoing a divorce from 'Tom Cruise' (qv) at the time and was attracting a lot of paparazzi interest. Much to her delight, by wearing her fake nose out and about, she found she could easily evade the paparazzi as they didn't recognize her.", "She decided not to imitate 'Virginia Woolf' (qv)'s actual tone and voice in her portrayal in _The Hours (2002)_ (qv), because she feared people thought it would be comic.", "She is distantly related to Isabel Kidman, the second wife of 'Jack Lee' (qv).", "Replaced 'Catherine Zeta-Jones' (qv) in the role of Claudia in _Nine (2009)_ (qv) after she quit due to scheduling conflicts. Kidman began rehearsals two months after giving birth to her daughter Sunday.", "Became pregnant twice by 'Tom Cruise' (qv) during their marriage. In 1991, she suffered an ectopic pregnancy, resulting in their decision to adopt, and then in 2000, prior to their separation, she suffered a miscarriage.", "On the DVD audio commentary for _Ghost (1990)_ (qv), director 'Jerry Zucker' (qv) reveals that Kidman auditioned to play Molly. Although Zucker was impressed with her reading, he cast 'Demi Moore' (qv) because she was a bigger name.", "Turned down 'Jodie Foster' (qv)'s role in _The Brave One (2007)_ (qv).", "Is very close friends with fellow Aussie 'Hugh Jackman' (qv), her _Australia (2008)_ (qv) co-star.", "Was two months pregnant with her daughter Sunday when she completed filming on _Australia (2008)_ (qv).", "With her performance as Virginia Wolf in _The Hours (2002)_ (qv) lasting around 25 minutes, she has one of the shortest Best Actress Oscar wins in history.", "Returned to work two months after the birth of her daughter Faith in order to begin filming _Hemingway & Gellhorn (2012)_ (qv).", "Owns a massive 3-bedroom, 2-bath river-view apartment in renowned glass tower designed by 'Richard Meier' (qv) on Greenwich Village's Perry Street by Hudson River in Manhattan.", "Was in a band when she was a teenager, she was the singer.", "Said that if she had not been an actress, she would have been a doctor.", "She studied at St. Martin's Youth Theatre, Melbourne, Australia; Australian Theatre for Young People, Sydney, Australia and Philip Street Theatre, Sydney, Australia; majored in voice, production and theater history.", "When she was a child, used to go fishing with her grandfather.", "Decided to do _Eyes Wide Shut (1999)_ (qv) before reading the script.", "'Tom Cruise' (qv) used to call her \"The Wild Australian\".", "When 'Stanley Kubrick' (qv) died, she went to St. Patrick church in New York and lit a candle in his memory.", "When she married 'Tom Cruise' (qv), part of their promise was that they would never be separated for more than two weeks. The same promise was applied between her and her second husband 'Keith Urban' (qv). However, they later reduced it to one week and finally they settled on three days of separation to be the limit.", "Was nicknamed \"Stalky\" while attending school.", "Raised in Longueville, Sydney and attended a Catholic school.", "Shares the services of publicist 'Pat Kingsley' (qv) with her friend, 'Sandra Bullock' (qv).", "Has two adopted children with her first husband 'Tom Cruise' (qv) - a daughter Isabella Jane Kidman-Cruise (aka Isabella Cruise, born on December 22, 1992) and a son Connor Anthony Kidman-Cruise (aka 'Connor Cruise' (qv), born on January 17, 1995).", "When she separated from husband 'Tom Cruise' (qv) in February 2001, she was 3 months pregnant with what would have been their first biological child, but had a miscarriage.", "Gave birth, at age 41, to her third child, daughter 'Sunday Rose Kidman-Urban' (qv), on July 7, 2008. Child's father is her second husband, 'Keith Urban' (qv).", "Became a mother for the fourth time at age 43, when her daughter, 'Faith Margaret Kidman-Urban' (qv), was born on December 28, 2010 via surrogate. Child's father is her second husband, 'Keith Urban' (qv).", "Attended 'Princess Diana' (qv)'s funeral with her then-husband, 'Tom Cruise' (qv).", "The longest she has gone without an Oscar nomination is 8 years, between _The Hours (2002)_ (qv) and _Rabbit Hole (2010)_ (qv).", "She serves as an Ambassador of the Sydney Children's Hospital, Randwick, and have hosted events for the children, including special screenings of _Happy Feet (2006)_ (qv), _The Golden Compass (2007)_ (qv) and _Paddington (2014)_ (qv).", "Originally turned down her part in _Stoker (2013)_ (qv), because she wished to spend time with her kids. However, director 'Chan-wook Park' (qv) was eager to have her play the part of Evelyn that he choose to place setting in Nashville. The movie was filmed five minutes from her home and she began filming a week after wrapping _The Paperboy (2012)_ (qv).", "On set of _Cold Mountain (2003)_ (qv) she gave co-star 'Natalie Portman' (qv) the advice to \"Always choose a film by its director. You're never certain how the movie will turn out, but you are always guaranteed an interesting experience\". In 2010, Portman said that she always had that in mind, during her career.", "'Zac Efron' (qv) said that shooting the improvised dance scene with her in _The Paperboy (2012)_ (qv), was \"the day he became a man\".", "She saved 'Hugh Jackman' (qv) from a poisonous scorpion on the set of _Australia (2008)_ (qv). While she was about to join Hugh in the bag, she noticed the poisonous scorpion crawling up his leg. She calmly told him not to move and squatted down, scooped the arachnid into her hat and walked over to the woods and released it. Everyone applauded but was asked why she hadn't just stomped on it. She said, 'I would never kill an animal. Every creature here has its purpose. This one just didn't belong in Hugh's bag!'\".", "As of 2017, has appeared in three films that were nominated for the Best Picture Oscar: _Moulin Rouge! (2001)_ (qv), _The Hours (2002)_ (qv) and _Lion (2016)_ (qv). She was Oscar nominated for her performances in all of these and won Best Actress for The Hours.", "In both _Dead Calm (1989)_ (qv) and _Rabbit Hole (2010)_ (qv) Nicole played the mother of a boy named Danny. Danny was killed in car accidents in both films.", "Developed shortsightedness in 1998 and had laser treatment to rectify the problem. Usually wears contact lenses but wears glasses on occasions.", "Godmother of 'Simon Baker' (qv) and 'Rebecca Rigg' (qv)s's son Harry and of 'Rupert Murdoch' (qv)'s daughters Grace and Chloe.", "13 films in her career have been nominated for at least one Academy Award. The most common categories among her representative films is 'Best Supporting Actress' for which six of her films have been nominated.", "In October 2012, she was honored with a Gala event at the 50th-annual New York Film Festival.", "She attended the opening ceremony of the London Summer Olympics, with husband 'Keith Urban' (qv), due to her status of spokeswoman for Omega Watches, the official time keeper for the Olympic Games.", "In September 2013, she attended the announcement of Qingdao Oriental Movie Metropolis in Qingdao, China. She was honored as \"Best Global Film Actress\" at the same event. 'Jackie Chan' (qv) presented her the honor.", "Spent several weeks in Kununurra, Western Australia, filming _Australia (2008)_ (qv) with temperatures soaring to 109 °F.", "Attended the world premiere of her friend 'Naomi Watts' (qv)'s first major studio film, _The Ring (2002)_ (qv), next to Watts and 'Heath Ledger' (qv) at the Mann Bruin Theatre, Westwood, CA.", "Served member of the main competition jury at the 2013 Cannes Film Festival.", "Has starred in two films that were selected as the opening film at the Cannes Film Festival: _Moulin Rouge! (2001)_ (qv) and _Grace of Monaco (2014)_ (qv).", "The Valentino dress she wore at the red carpet event of _Nebraska (2013)_ (qv) at Cannes Film Festival, was the dress that 'Anne Hathaway' (qv) originally was meant to wear at the The 85th Annual Academy 'Awards' (qv). Hathaway discarded the dress at the last minute, because it was too similar to 'Amanda Seyfried' (qv)'s dress.", "Was a longtime friend (25 years) of 'L'Wren Scott' (qv).", "Her Hawaiian name is Hokulani, which means \"heavenly star\". She was named after a baby elephant, that lived at the local zoo of her childhood home, as her mother loves elephants.", "'Sofía Vergara' (qv) was originally cast as Charlotte Bless in _The Paperboy (2012)_ (qv), the role that Kidman eventually assumed. Vergara herself has said Kidman was a better fit for the part.", "Often teaches herself various skills for different roles. Among them, she knows how to twirl and throw knives, due to her role in _Paddington (2014)_ (qv), for which she also took a taxidermy class as part of her preparation.", "'Frank Ocean' (qv) sampled one of her monologues from _Eyes Wide Shut (1999)_ (qv) into his song \"Love Crimes\", released on his debut album \"Nostalgia, Ultra\" from 2011.", "Both of her blockbusters from 2007, _The Invasion (2007)_ (qv) and _The Golden Compass (2007)_ (qv), went through massive creative changes during post-production, due to demand from the studios. The interference left both the directors publicly unsatisfied with the final results of their respective films. A director's cut edition has never been released of either films.", "Was the 123rd actress to receive an Academy Award; she won the Best Actress Oscar for _The Hours (2002)_ (qv) at The 75th Annual Academy 'Awards' (qv) (2003) on March 23, 2003.", "Producer 'Harvey Weinstein' (qv) suggested her and 'Judi Dench' (qv) to play Barbara and Violet in _August: Osage County (2013)_ (qv), during the initial casting process of the film. However, the screenwriter of the film, 'Tracy Letts' (qv), voted against the idea, saying that the two roles should be played by American actors.", "Sharks are one of her passions and to shark-dive is one of her favorite activities. She considers sharks to be \"beautiful\".", "Was attached to produce and star as Einar Wegener in _The Danish Girl (2015)_ (qv) for several years and she considered it to be a passion project for her. She revealed in 2010, that at one point, following difficulties with finding a director, she considered making it her directorial debut. However, in 2014, the project moved forward again, but without Kidman's involvement.", "Has a skydiving license.", "'Meryl Streep' (qv) considers her to be one of the best actresses of her generation. 'Emily Blunt' (qv), 'Freida Pinto' (qv), 'Dakota Johnson' (qv) and 'Sophia Bush' (qv) all considers her among their favorite actresses.", "When she was 14, she got her first job at the Capitol Theatre in Sydney, where she worked as an usherette at Sesame Street Live.", "She and former husband 'Tom Cruise' (qv) were offered guest roles in _The Simpsons (1989)_ (qv) in the episode _The Simpsons: When You Dish Upon a Star (1998)_ (qv). They turned it down and were replaced by then-couple 'Alec Baldwin' (qv) and 'Kim Basinger' (qv).", "She was originally reluctant to star in _The Others (2001)_ (qv), since it explored such dark places. She tried to persuade the director 'Alejandro Amenábar' (qv) and the Weinstein brothers, the producers of the film, to find another actress for the part and even suggested 'Julianne Moore' (qv) to the Weinsteins. However, in 2010, Kidman revealed that the film is one of her favorites among her own filmography.", "The on-location dressing room she used for _Cold Mountain (2003)_ (qv) was an old converted bus once owned by executed Romanian dictator 'Nicolae Ceausescu' (qv).", "Owns alpacas at her ranch in Nashville.", "Was a part of the notoriously secret and long shoot of _Eyes Wide Shut (1999)_ (qv). For one minute of footage of the film, director 'Stanley Kubrick' (qv) demanded her to do shoot six days of naked sex scenes with a male model. Not only did he ask the pair to pose in over 50 erotic positions, he also banned her then-husband and co-star 'Tom Cruise' (qv) from the set and forbade her to assuage her husband's tension by telling him what happened during the shoot. The decision to direct each actor separately an forbid them to share notes was done to exaggerate the distrust between their fictional husband and wife.", "Was close friends with 'Lauren Bacall' (qv). She considered Bacall to be her \"American Mother\".", "Noted comedienne 'Joan Rivers' (qv) considered her to be one of the most intelligent and funniest actress in Hollywood. She also considered her to be among \"the last real movie stars\".", "Her father, Dr. Antony \"Tony\" Kidman, died of a heart attack in Singapore at the age of 75. Dr. Kidman had been declared as deceased by Tan Tock Seng Hospital at 9:54 AM SGT. He is survived by, among others, his wife (Janelle, with whom he celebrated a Golden Anniversary in January), children, in-law children, and 10 grandchildren. [September 2014]", "In December 2007, she was paid \"substantial\" damages by the British news paper Daily Telegraph, after they wrongly accused her of having breached provisions in her promotional contract for Chanel No. 5 perfume. In the article \"Chanel Left Fuming\", they reported that she carried a bottle of a rival fragrance at the premiere of _The Golden Compass (2007)_ (qv). Kidman's lawyer, John Kelly, said his client suffered significant embarrassment and distress over the fabricated Telegraph story, The newspaper later determined that its source for the story had made it up. David Price, the Telegraph's solicitor-advocate, apologized on behalf of the paper and agreed to pay Kidman's legal costs as well as substantial undisclosed damages, which she donated to Unifem, the United Nations Development Fund for Women.", "In 2013, both she and husband 'Keith Urban' (qv) were nominated for a Golden Globe. She received her tenth nomination, while he received his first.", "She was well-respected by the late and famed film-critic 'Roger Ebert' (qv). He considered her to have a dichotomous career; \"She seems to be two people: the glamorous star of \"Moulin Rouge\" and \"Nine,\" and the risky, daring actress in \"Birth,\" \"The Hours\" and \"Eyes Wide Shut.\" He also believed that in time, she will gain more respect; \"Celebrity has clouded her image; if she were less glamorous, she would be more praised. Age will only be an asset to her.\".", "In 2014 she was honored at the Shanghai Film Festival with an \"Outstanding Contribution to Film Industry Award\". 'Hugh Grant' (qv) presented the award to her at the event.", "She cites Austrailian and South African accents as being the two most difficult dialects in English.", "Her Oscar is placed over the fireplace in her mother's home.", "Infamously, she made her debut on 'Jimmy Kimmel' (qv) Live! (2003) by giving host 'Jimmy Kimmel' (qv) a brief lap-dance.", "Became a viral hit in January, 2015 following an appearance on _The Tonight Show Starring Jimmy Fallon (2014)_ (qv), in which they discuss an embarrassing encounter between the two. The clip is said to have gained 55 million views online during its first week, including 18 million views on YouTube.", "Her performance in 'Sam Mendes' (qv)'s West End play \"The Blue Room\" (1999) inspired both 'Baz Luhrmann' (qv) to cast her in _Moulin Rouge! (2001)_ (qv) and 'Stephen Daldry' (qv) to cast her in _The Hours (2002)_ (qv). She received an Oscar nomination for both films.", "As of 2017, three of her films _Australia (2008)_ (qv), _Happy Feet (2006)_ (qv) and _Lion (2016)_ (qv) all ranks among the top five of the highest grossing Australian film productions at the box office of her native Australia. She is the only performer to achieve this feat. Her film _Moulin Rouge! (2001)_ (qv) also ranks as #6 on the same chart, while _Lion (2016)_ (qv) is the highest grossing independent Australian film of all time.", "Has portrayed the villain in two adaptations of British children literature that features a talking bear as one of the main characters: _The Golden Compass (2007)_ (qv) and _Paddington (2014)_ (qv). The two characters also shares the initials of M.C. - Marisa Coulter and Millicent Clyde.", "To date (2015) she's been taller than both of her husbands and older than one.", "Is one of 27 actresses to have received an Academy Award nomination for their performance in a musical; hers being _Moulin Rouge! (2001)_ (qv). The others, in chronological order, are: 'Bessie Love' (qv) for _The Broadway Melody (1929)_ (qv), 'Grace Moore' (qv) for _One Night of Love (1934)_ (qv), 'Jean Hagen' (qv) for _Singin' in the Rain (1952)_ (qv), 'Marjorie Rambeau' (qv) for _Torch Song (1953)_ (qv), 'Dorothy Dandridge' (qv) for _Carmen Jones (1954)_ (qv), 'Deborah Kerr' (qv) for _The King and I (1956)_ (qv), 'Rita Moreno' (qv) for _West Side Story (1961)_ (qv), 'Gladys Cooper' (qv) for _My Fair Lady (1964)_ (qv), 'Julie Andrews' (qv) for _Mary Poppins (1964)_ (qv), _The Sound of Music (1965)_ (qv), and _Victor Victoria (1982)_ (qv), 'Debbie Reynolds' (qv) for _The Unsinkable Molly Brown (1964)_ (qv), 'Peggy Wood' (qv) for _The Sound of Music (1965)_ (qv), 'Carol Channing' (qv) for _Thoroughly Modern Millie (1967)_ (qv), 'Kay Medford' (qv) for _Funny Girl (1968)_ (qv), 'Barbra Streisand' (qv) for _Funny Girl (1968)_ (qv), 'Liza Minnelli' (qv) for _Cabaret (1972)_ (qv), 'Ronee Blakley' (qv) for _Nashville (1975)_ (qv), 'Lily Tomlin' (qv) for _Nashville (1975)_ (qv), 'Ann-Margret' (qv) for _Tommy (1975)_ (qv), 'Lesley Ann Warren' (qv) for _Victor Victoria (1982)_ (qv), 'Amy Irving' (qv) for _Yentl (1983)_ (qv), 'Queen Latifah' (qv) for _Chicago (2002)_ (qv), 'Catherine Zeta-Jones' (qv) for _Chicago (2002)_ (qv), 'Renée Zellweger' (qv) for _Chicago (2002)_ (qv), 'Jennifer Hudson' (qv) for _Dreamgirls (2006)_ (qv), 'Penélope Cruz' (qv) for _Nine (2009)_ (qv), 'Anne Hathaway' (qv) for _Les Misérables (2012)_ (qv), 'Meryl Streep' (qv) for _Into the Woods (2014)_ (qv), and 'Emma Stone' (qv) for _La La Land (2016)_ (qv).", "Is one of 20 actresses who did not receive an Oscar nomination for their Best Actress in a Comedy/Musical Golden Globe-winning performance; hers being for _To Die For (1995)_ (qv). The others, in chronological order, are: 'June Allyson' (qv) for _Too Young to Kiss (1951)_ (qv), 'Ethel Merman' (qv) for _Call Me Madam (1953)_ (qv), 'Jean Simmons' (qv) for _Guys and Dolls (1955)_ (qv), 'Taina Elg' (qv) and 'Kay Kendall' (qv) for _Les Girls (1957)_ (qv), 'Marilyn Monroe' (qv) for _Some Like It Hot (1959)_ (qv), 'Rosalind Russell' (qv) for _A Majority of One (1961)_ (qv) and _Gypsy (1962)_ (qv), 'Patty Duke' (qv) for _Me, Natalie (1969)_ (qv), 'Twiggy' (qv) for _The Boy Friend (1971)_ (qv), 'Raquel Welch' (qv) for _The Three Musketeers (1973)_ (qv), 'Barbra Streisand' (qv) for _A Star Is Born (1976)_ (qv), 'Bernadette Peters' (qv) for _Pennies from Heaven (1981)_ (qv), 'Kathleen Turner' (qv) for _Romancing the Stone (1984)_ (qv) and _Prizzi's Honor (1985)_ (qv), 'Miranda Richardson' (qv) for _Enchanted April (1991)_ (qv), 'Jamie Lee Curtis' (qv) for _True Lies (1994)_ (qv), 'Madonna' (qv) for _Evita (1996)_ (qv), 'Renée Zellweger' (qv) for _Nurse Betty (2000)_ (qv), 'Sally Hawkins' (qv) for _Happy-Go-Lucky (2008)_ (qv), and 'Amy Adams' (qv) for _Big Eyes (2014)_ (qv).", "Holds the all time record of being the actress to have appeared on most covers for the fashion magazine Vogue (US edition): 8 times.", "In 2009, she was among four Oscar-winning Australian actors to be immortalized onto postage stamps in their home country. Each of the actors has two stamps, showing them both in and out of character.", "The filming process of _Moulin Rouge! (2001)_ (qv) was halted for two weeks in November 1999 after she fractured two ribs and injured her knee while rehearsing a dance routine for the film. Many of the scenes of the film, where she is seen only from the chest up, including \"A real actress!\", were shot while she was in a wheelchair.", "Eldest daughter Sunday Rose was born two weeks early at 9:00 am Central daylight time on July 7th 2008 weighing 2.934186 Kilos or 6 lbs 7.5 oz at birth.", "_Bewitched (2005)_ (qv) was the first movie among her own filmography, that was seen by her two youngest daughters, Sunday and Faith. However, due to their young age, the two girls believed their mother was able to perform magic tricks, and were left confused and disappointing when they realized the truth.", "Spent four and a half years developing _Rabbit Hole (2010)_ (qv). It marked her first movie as both leading actress and producer on a film.", "Her fans refers to themselves as \"Kidmaniacs\".", "In 2015, she starred as Rosalind Franklin, the English chemist and X-ray crystallographer, in the play \"Photograph 51\", as a tribute to her father, the late Antony Kidman, who worked as a biochemist and clinical psychologist. She donated her entire salary to The Actors' Benevolent Fund, and in her father's name to King's College, in honor of her father and Rosalind Franklin.", "Has worked with producer 'Harvey Weinstein' (qv) on seven projects.", "Has co-starred opposite several up-and-coming actors in their feature film debut, such as 'Thandie Newton' (qv), 'Miles Teller' (qv), 'Dakota Blue Richards' (qv), 'Maddison Brown' (qv), 'Brandon Walters' (qv) and 'Sunny Pawar' (qv).", "Despite her singing skills, she has ruled out the possibility of ever making an official duet with husband 'Keith Urban' (qv). However, they did once perform together in the public, at G'Day Gala, where they reworked \"Down Under\" by 'Men at Work' (qv) as a tribute to 'Simon Baker' (qv).", "Learned to ride camels for her role in _Queen of the Desert (2015)_ (qv) and on set she had her own male dromedary, named Barbie.", "Spoofed by 'Jennifer Saunders' (qv) and 'Patsy Kensit' (qv) on _French and Saunders (1987)_ (qv).", "Was personally handpicked by 'Julia Roberts' (qv) to be her co-star of _Secret in Their Eyes (2015)_ (qv). Roberts sent her an email going; \"Will you do this with me?\".", "Won the Evening Standard Theatre Award for her performance as Rosalind Franklin in \"Photograph 51\". 'Jeremy Irons' (qv) presented her the award.", "'Cate Blanchett' (qv) considers her a trailblazer for Australian actors having a chance making a career in the US.", "She was nominated for the 2016 'Laurence Olivier' (qv) Theatre Award as 'Best Actress in a Play' (season 2015) for her performance in \"Photograph 51\".", "She has worked with 4 directors who have won a Best Director Oscar: 'Robert Benton' (qv), 'Ron Howard' (qv), 'Anthony Minghella' (qv), and 'Sydney Pollack' (qv).", "Was personally handpicked by Sue Brierley to portray her in _Lion (2016)_ (qv). Kidman bonded with her young co-star 'Sunny Pawar' (qv) by playing cricket with him - scenes which eventually made it into the final film.", "Celebrated her 20th birthday on the set of _Dead Calm (1989)_ (qv).", "Experienced her very first romantic kiss while watching _The Shining (1980)_ (qv) with a boyfriend.", "She is friends with and a big fan of 'James Wan' (qv).", "She has been in two different film adaptations of DC Comics' characters: _Batman Forever (1995)_ (qv) and _Aquaman (2018)_ (qv).", "In 1999 she was wanted for The Adaptive Ultimate which was to be directed by Jan De Bont for Twentieth Century Fox but her schedule was full and Fox wanted it into production asap.", "Friends with 'Russell Crowe' (qv), 'Renée Zellweger' (qv), 'George Clooney' (qv), 'Halle Berry' (qv), and 'Kristin Chenoweth' (qv).", "'Sofia Coppola' (qv) wanted her to play a Wicked Sea Witch in live-action adaptation of 'Hans Christian Andersen' (qv)'s fairy tale \"The Little Mermaid\", which was set up at Universal Pictures. The project fell apart, but Kidman later played a Mermaid Warrior Queen in _Aquaman (2018)_ (qv).", "Made two films back-to-back with 'Colin Farrell' (qv), _The Killing of a Sacred Deer (2017)_ (qv) and _The Beguiled (2017)_ (qv). Both films played in competition at Cannes Film Festival, where the first was awarded by the festival jury for its screenplay by 'Yorgos Lanthimos' (qv) and the latter for its director 'Sofia Coppola' (qv).", "Joined the second season of _Top of the Lake (2013)_ (qv) after professional negations and scheduling issues which took a full year to accommodate. The part was written with Kidman in mind and re-teams her with 'Jane Campion' (qv), making it their third collaboration together after _The Portrait of a Lady (1996)_ (qv) and _In the Cut (2003)_ (qv). Kidman was 14 years old and in a play when she was discovered by Campion, who offered her a part in her student film _A Girl's Own Story (1986)_ (qv). Kidman turned it down due to explicit content that she found uncomfortable at the time.", "Awarded a specially-created '70th Anniversary Prize' at Cannes Film Festival in 2017 for her contribution to cinema. She had four projects screened at the festival that year, including two in competition. The anniversary award is given once every decade and Kidman is the first woman to receive the award.", "In _The Beguiled (2017)_ (qv) a sponge scene with her and 'Colin Farrell' (qv) required several takes, as the afternoon light inflicted the cinematography. By the time the scene wrapped, Kidman had sponged Farrell for almost two hours.", "Her prenup with 'Keith Urban' (qv) has the following stipulations: 1. for every year they're married, Urban gets $640,000; 2. if he should relapse in drug use, the contract becomes null and void and he gets nothing.", "Has been tied up and had her mouth gagged with tape in three separate movies: _Batman Forever (1995)_ (qv), _Birthday Girl (2001)_ (qv) and _The Killing of a Sacred Deer (2017)_ (qv).", "Was considered for the dual lead role in _Passion of Mind (2000)_ (qv).", "She lobbied for the role of Danielle in Cape Fear (1991) but lost to Juliette Lewis.", "She has dual citizenship of Australia and the United States.", "Nominated for the 2019 Golden Globe Award in the Best Performance by an Actress in a Motion Picture - Drama category for her role as Erin Bell in _Destroyer (2018)_ (qv), but lost to 'Glenn Close' (qv) for _The Wife (2017)_ (qv).", "She is left-handed.", "Has a fear of butterflies."], "quotes": ["[August 2000, on her marriage to 'Tom Cruise' (qv)] Every day there is a compromise. Living with somebody requires a lot of understanding. But I love being married. I really love it. Sometimes I try to downplay it a bit because people are like, \"God you guys!\" I just feel so fortunate that I have found someone who will put up with me and stay with me.", "[on husband 'Tom Cruise' (qv)] I wouldn't want to be married to me, but luckily he does.", "[8/01, commenting on her break-up with 'Tom Cruise' (qv)] Now I can wear heels.", "It's so bizarre, I'm not scared of snakes or spiders. But I'm scared of butterflies. There is something eerie about them. Something weird!", "[on winning the Academy Award for _The Hours (2002)_ (qv)] And I am standing in front of my mother, and my whole life I have wanted to make my mother proud. And now I'm going to make my daughter proud.", "When I heard about the Suzanne role in _To Die For (1995)_ (qv), I thought, \"I'll never get it - it'll be offered to someone else.\" So I called Gus ['Gus Van Sant' (qv)] at home, and he took my call, thank God. I told him I'd seen _Drugstore Cowboy (1989)_ (qv), and I really wanted to work with him. I said I was destined to work with him.", "I think it's important that we don't all have to hold our heads high all the time saying everything's fine.", "These different people that I play become the loves of my life.", "The split [from 'Tom Cruise' (qv)] left me very fragile but I'd love to marry again.", "I would love to have boobs and a butt like 'Jennifer Lopez' (qv) but I'm not having surgery so there it is.", "[on receiving her star on the Walk of Fame] I've never been so excited to have people walk all over me for the rest of my life.", "You want to take some responsibility in your choices so that it sets the groundwork for that next generation of actresses - so for me working with 'Lars von Trier' (qv), I would hope that says to another generation: \"go and seek out those directors, it's ok\"", "[on _Dogville (2003)_ (qv)] One day it would be a fairy tale, the next it was a nightmare. Lars ['Lars von Trier' (qv)] was gentle with me - he was gentle and soft, then he would beat me up emotionally when he felt he needed that. I did not always register what was happening until afterwards but you shouldn't have too much awareness as an actor, I don't think.", "I have a boy's body. I would prefer to have more curves because I think that's more beautiful. I would much rather have J. Lo's ['Jennifer Lopez' (qv)] body than mine.", "[on filming _The Interpreter (2005)_ (qv) at UN headquarters in New York] As a backdrop for a thriller, it's fantastic, but also since I'm Australian and I've always worked internationally and this is an international place in New York, I really like the kind of communication it represents. I know I sound very much like my character now, but I do believe in this place.", "[on _Cold Mountain (2003)_ (qv), _The Human Stain (2003)_ (qv) and _Dogville (2003)_ (qv) being released within months of each other] It's weird because they're all coming out at once. But I made them over 2½ years.", "You look at somebody's work as an actor and you can see their emotional life being fed into it and you can kind of feel them through it. That's far more interesting than anything I could say about where I'm at or who I'm with. It's good to have a little distance. If you discuss your love too much, it just damages it.", "[on the troubled _The Stepford Wives (2004)_ (qv)] It's a comedy. We hope.", "Even from a very early age I knew I didn't want to miss out on anything life had to offer just because it might be considered dangerous.", "Cinema is a director's medium, so you're saying, \"What do you want?\" Being an actor is about adapting - physically and emotionally. If that means you have to look great for it and they can make you look great, then thank you. And if you have to have everything washed away, then I'm willing to do that too.", "[on _Birth (2004)_ (qv)] This is a film about love. What is a great love? Is there a love of our life? Do you ever recover from the loss of somebody that was so important to you?", "'Stanley Kubrick' (qv) taught me to believe in myself artistically. I spent my 20s raising my children, and wanting to, and being married. That was my driving force. And then he said to me, \"No, you have to respect your talent, and give it some space, and give it some time. Which was a lovely thing to be given. And my children were a little older then.", "It was by chance that _The Hours (2002)_ (qv) came along. Was I in a place where I could say, \"I'm going to go to England and make this?\" Yes. Could I do that earlier, when I was married? No, I couldn't travel like that. We had a thing where we couldn't be separated for more than two weeks. So that made a lot of work just not possible. Which was fine by me.", "I have moments where I've said, \"Don't tread on that crack in the pavement, don't have a black cat walk in front of you.\" Deep down am I superstitious? No. Do I believe in trying to be as kind as possible and as compassionate as possible because ultimately you're alone with yourself and your own conscience, and you want that to be as clear as possible? That's not superstition. You have to just try and stay pure and know what you value.", "Usually, a young actress can't deliver because she doesn't have the emotional baggage, really, to play those things. That's something that's very beautiful about becoming a woman, and becoming a woman in your 30s. If you've lived your life, and lived it where you've said, \"I want to be a participator and not a voyeur\", then you have an enormous amount to pull on.", "I'm still just finding my way through. I don't actually see a path in front of me. I can see not ever doing it again, and I can also see other things pulling me away from this. It's strange, because I know it's in my blood in terms of having to somehow act or express myself creatively, but I'm willing to do it different ways if need be. And I think that's partly because when I went through my divorce I dealt with the idea of never ever working again, and never being here and never able to be an actress, and went through an enormous amount of soul searching, and at that time, I was very ready to give it all up, and dealt with that emotionally. I was going, \"Well, I'll never be able to do this again.\" And that was OK. And, strangely, as life is so strange, that was when everything exploded.", "I never feel like I'm in control. There's a certain type of actor that relinquishes control when they act, and then there's another type who ends up being a producer and director and they're more someone that likes to take control. I fall in the first category, where I like to relinquish control, and fit into somebody else's world. And that's just lately, but you never feel like you are making choices. You feel like they're finding you in a strange way. That's why when people say, \"What role do you want to play next?\", I say, \"I don't know\". I never know. It's about responding to things rather than planning.", "I think someone said my career defies all logic [laughs]. Because I choose the sort of strange little films, and somehow they're the things that make my career.", "So if you talk about a box-office career, then I'm a disaster. But somehow, you know, I still manage to find my way to work.", "I think actors are getting so much more power these days, but I'm not. I stay very much away from the decisions, the way in which things are orchestrated, what's been changed. I just try to stay completely in the role as the actor and as the character.", "I'm at a time of my life now where, for me to want to go back and work, it'd have to be something that I really feel passionately about.", "Regrets are ridiculous, so I don't regret, no.", "[talking about her character from _Batman Forever (1995)_ (qv)] Chase is attracted to the darker side of life. Batman is very appealing to her.", "To be an actor you have to have a certain amount of madness in you. That's why, when people meet you and you seem very together, they are quite surprised--they don't see you behind closed doors.", "[speaking of her father Antony Kidman] He's a great father, I can call him at three in the morning and he's there for me.", "By the time I was a teenager, I had developed skills as a writer, and my father encouraged me to think about a career in journalism. I began keeping a diary, which I maintain to this day. I used to fill whole notebooks with my writings.", "My parents thought it was nice to develop my imagination, but they never seriously thought that anything would ever come of it. They said that I couldn't be an actress because I would be taller than all my leading men, so I thought I would be a writer instead.", "It was very natural for me to want to disappear into dark theater, I am really very shy. That is something that people never seem to fully grasp because, when you are an actor, you are meant to be an exhibitionist.", "Do you know I'm always scared that one day I'll look back and say \"God they were the best years of my life and now what?\" There are moments when you feel as if you have been blessed for a while, moments when you think this is perfect, moments when you start to believe that even for an hour, even for a year, it might all happen. So I'm determined to keep making it get better and better.", "It's a very brave thing to fall in love. You have to be willing to trust somebody else with your whole being, and that's very difficult, really difficult and very brave.", "[about her first role at the age of five] I was one of those terrible kids who said everyone's lines.", "Since I have fair skin, I have to stay out of the sun. I can't stand the sun. I dyed my hair red for a while during the 1990s but I'm actually a natural blonde.", "I'm very close to my sister, Antonia ['Antonia Kidman' (qv)]. Every day we swim together. I love my sister.", "When I was a child, I was a natural towhead. Now my hair is naturally a darker shade of blonde.", "I'd like to be wise. You have to go through a lot to get there, but I'm willing to go through a lot.", "What's the point of doing something good if nobody's watching?", "Even from a very early age, I knew I didn't want to miss out on anything life had to offer just because it might be considered dangerous.", "I believe that as much as you take, you have to give back. It's important not to focus on yourself too much.", "I love acting but I don't like all of the other stuff associated with it. The interest in celebrities, the press, the Internet, when your identity becomes mixed up in the way people are perceiving you.", "I have a little bit of a belly, a tiny bit of pooch. It's the one thing I don't want to lose. I just like having some softness. If I lose that, then Tom [husband 'Tom Cruise' (qv)] might leave me.", "I never knew I'd be in a musical, let alone win an award for one.", "There's no drugs, no Tom ['Tom Cruise' (qv)] in a dress, no psychiatrists.", "Having gone through all of this, I feel in some ways calmer now. It's strange, but sad. I think I'll always be sad.", "I love acting, but it's much more fun taking the kids to the zoo.", "[on her split with 'Tom Cruise' (qv)] My life collapsed. People ran from me because suddenly it was, \"Oh my God! It's over for her now!\"", "I love working with people who are inspired and obsessive.", "As a child my hair was naturally red, but since I was 13 my hair turned light blonde naturally. It's really strange but it happened. Ever since Chase through the night, the directors made me dye my hair red, as they all thought it suited me at the time. Even for _Dead Calm (1989)_ (qv), 'Phillip Noyce' (qv) made me dye my hair red. Now the directors and studios just let me keep my natural blonde hair.", "For an actor, facial expressions and emotions are really important. That's why I'll never have Botox. I've always been against that and seeing Botox on TV with all the swelling and pain put me off it anyway. The directors always allow actors with Botox but I just say. \"No way, not for me\". Drinking lots of water, eating fruit and doing yoga is what keeps me looking young naturally. I swear by it. I also use creams with natural ingredients to make wrinkles less visible. Everybody should try these things rather than going the plastic route, which I just hate.", "You don't have to be naked to be sexy.", "I'm a person that carries everything that happened to me in my past, with me into the future. I refuse to let it make me bitter. I still completely believe in love and I remain open to anything that will happen to me.", "If I packaged toothpaste and told you you were gonna get half the toothpaste in the tube, you probably wouldn't buy it.", "It would be far easier to go, \"Oh, I wish I loved women,\" but I don't. I love the way a man thinks. I love the way a man smells. I love the way men look. And I'm hooked on the male physique - hooked on it.", "You're either going to walk through life and experience it fully or you're going to be a voyeur. And I'm not a voyeur.", "On living in Nashville: It's the warmest, loveliest community I've ever set foot in. For me, it's the perfect place to live. To me, it's the best part of America...It's the easiest place to live. Keith's lived there for 20 years. The country music community is very tight. I like the polite nature of it. No traffic. I'm a big Southern girl now. It's just suits me.", "[on _Hemingway & Gellhorn (2012)_ (qv)] I knew nothing about Martha, but I've always been drawn to unique women who are willing to take on the world. The exciting thing about this film is that you see her discovering her nature. At the beginning, she's a lot of talk. She knows that she's either got to get her hands dirty and become what she pretends to be or she's a fraud. In the end, Gellhorn out-Hemingways Hemingway.", "[on music] I'm so eclectic and I use it in my work all the time. What I used a lot with Lee on _The Paperboy (2012)_ (qv) was 'Al Green' (qv). Lee has never listened to anything past 1970!", "[on _The Golden Compass (2007)_ (qv)] I'm not a huge fan of fantasy. I've always been drawn to more - in terms of filmmaking - I've been drawn to more psychological dramas but I think what drew me to this was it had the intricacies of the characters allow strong performances and that's what I found compelling about it.", "I know the feeling of polarizing films, that make people angry and uncomfortable and I'm very comfortable with that.", "[on _Birth (2004)_ (qv)] It created a lot of controversy because of a bathtub scene [with me] and a 10-year-old boy. But I never saw the film that way. It's fascinating when choose roles how you perceive them and how they're perceived on the outside.", "I'll never forget sort of \"DJ-ing\" after [the Cannes screening of] _Moulin Rouge! (2001)_ (qv). I think there is a photo of me with headphones on, it was with 'Fatboy Slim' (qv) and the place was going crazy. I hold that dear to my heart.", "I remember having really mixed reactions to different films I brought to [Cannes Film Festival]. One of them was the Von Trier film, one of them was _To Die For (1995)_ (qv). It was actually an extraordinary reaction for _To Die For (1995)_ (qv). We were not in competition, and I remember being terribly scared that people were gonna hate it, but people loved it. That was very, very instrumentally beginning my career in terms of serious film-making. The critics got behind me on that film and that kind of took me from being 'Tom Cruise' (qv)'s wife into being something different, which artistically was such a joy for me.", "My ability to escape myself probably comes from the riskier the role. It took me a while to learn that and to understand that. I've tried to comfort and play the girl-next-door and the less complicated supporting roles. And for whatever reason I can not latch on, I don't quite know how to do it. So the more complicated, the better for me. I don't know what that says about me.", "[on not being Oscar-nominated for _To Die For (1995)_ (qv)] I got a telegram from 'Sean Penn' (qv) for that, and it said \"You were robbed\". That was all he sent me. And it was as good as an Academy Award nomination.", "[on _The Golden Compass (2007)_ (qv)]: I love that it's a little girl who's the protagonist, the hero of the piece, and also that it is about friendship, loyalty and honesty.", "[on _Australia (2008)_ (qv)]: It was the best experience I've ever had working on a film.", "[on 'Charlize Theron' (qv)] I love that we're both so tall.", "[on filming _Nine (2009)_ (qv)] My favorite memories are 'Sophia Loren' (qv) holding my four week-old baby, because that is something that goes down for me in the great memories, and also becomes part of Sunday Rose's infant picture book. I mean, you can't do better than that.", "[on acting] It's the desire to study the human condition, the desire for collaboration, to learn and absorb, and to lead a well-examined life.", "I work well with people who are extreme.", "[on 'Lars von Trier' (qv)] He does things cinematically that nobody else does. And whether you love him or hate him, the filmmaking is incredibly strong.", "[on 'Stanley Kubrick' (qv) and working with him on _Eyes Wide Shut (1999)_ (qv)] Stanley wanted six months of rehearsal. He didn't want to start, and then he didn't want to finish. Stanley taught Tom [Cruise] and I, 'Never say no.' When someone proposes an idea, you never shut it down. And that's a good lesson that goes far beyond work. That's a life lesson.", "[on considering saying no to projects that take her away from her kids and husband for too long] I've worked hard to get to this place personally. I don't take any of it for granted. I cherish it. I'm more than willing to make those sacrifices because, when I'm 70 and 80, I want my family around me. I know other things can come into play about that, but it's certainly not going to be because I didn't show up.", "I think love is the core emotion. Without that, and I've certainly existed without that, it's a very empty life. When I won the Oscar [for \"The Hours\"], I went home and I didn't have that in my life. That was the most intensely lonely moment in my life. [During] my professional highs, I've often had personal lows. It's always aggravated me that it's gone that way.", "There was that whole time from when we took _Moulin Rouge! (2001)_ (qv) to the Cannes Film Festival and then all the way through to winning the Oscar for _The Hours (2002)_ (qv), that was a very strange time in my life because it was the collision of professional success and personal failure and that's just a very strange thing. When I won the Oscar it was kind of a mix of popping open a bottle of champagne but at the same time feeling incredibly lonely. It's been professional highs and personal lows and they collide. I'm hoping one day that ­won't happen. Now is a good time personally but it's not a professional high. The highs are pretty extreme and they don't happen that often, do they? I much prefer the personal high anyway. I'd never give that up.", "I've turned things down, definitely. I was pregnant and I was going to do _The Reader (2008)_ (qv) and I had to call and say, 'I've spent my whole life wanting to be pregnant and I'm finally pregnant and I won't be able to do it.' And they were like, 'You could work pregnant.' No. That's not what I wanted to do. \"I didn't want to be working while I was pregnant. Some women could, maybe if they'd already had a lot of children, but for me it was such a huge place to be and I wanted to carry my baby and keep her healthy and peaceful. I was like, 'I'm going to do everything I can to just bring this baby into the world.", "[on the beginning of her career] I had huge expectations. You start out with big dreams and I mean, big dreams artistically. You want to work with the greatest living directors, make a great movie. I wanted to make a great love story, I wanted to make a great epic and then you realize that the truth of it is that it's so hard to make a great film. It's hard to get a great role. Those big expectations change to realism pretty quickly. But what's never changed is my desire to work with great directors and to find projects that push me out of my comfort zone and keep me alive. I still don't think I've done my best work", "[on her preparation for _Paddington (2014)_ (qv)] I'm about to go down to the museum and do a taxidermy class on Saturday night. And I love animals! I also have to throw knives, so I'll be doing that in the backyard. I've got a guy coming over to teach me how to throw a knife. I want to be able to just do it with a bit of a flourish. I believe this is my path, so I'll go down in fire if I have to.", "I think when you go into the orbit of a director, they bring certain things out in you. The greatest thing you can offer is abandonment, in terms of a performance, and also deep loyalty. Because when there is enormous loyalty to them, then it's a very safe place. It's like, O.K., so she'll stand by me no matter what, no matter if the film even succeeds or fails. We're in it together, and this is ours, together, forever. Which is why I probably stay very, very close to a lot of the directors that I've worked with, whether the outcome is successful or not. Because I get deeply sort of connected and close to them. Jane, Alejandro, Stephen, Lars - all of them. That's important to me, and the longevity of it.", "[on choosing 'Aaron Eckhart' (qv)]: I've known Aaron for a long time and he has a side of him which is very raw and emotional, which he doesn't show on screen very often.", "[on her villainous character in _The Golden Compass (2007)_ (qv)]: The beauty of this story is that it's a trilogy and I think that if we get to make the second and the third film - which I would love - you get to see all of the layers peel away from this woman. So that was what I was trying to do in this film, to give her the layers. There's a mystery there and you're not quite sure and you feel the texture of her.", "Snuggling is the secret to happiness.", "[on her West End stage play \"Photograph 51\"] It has made me fall in love with acting. The great thing about the play is I get to do it from beginning to end. Nothing ends up on the editing floor, it doesn't get changed. Once the actors step onto the stage, it's ours for 95 minutes and that's exquisite. Right now I'm having a love affair with being on stage.", "[on producing] It's allowed me to shape my career in terms of being able to find things that I may not get offered, that I wouldn't get the opportunity for. (February 2017).", "I'd really like to make some movie that penetrates the psyche of the world, deeply. I haven't done that for a long time because I tend to do smaller, more idiosyncratic films, which I love doing. I'm working with 'John Cameron Mitchell' (qv) again on _How to Talk to Girls at Parties (2017)_ (qv), and that's very idiosyncratic. Probably _Moulin Rouge! (2001)_ (qv) was the closest in the sense that I still meet people who saw it and when they talk to me they still call me Satine. So, yes, I have a lot of young gay men who come up to me and a lot of girls who come up me and I get many big hugs and they hold onto me and they say \"Oh, Satine. I love you, Satine.\" It's very sweet of them. (May 2016)", "[on her West End stage play \"Photograph 51\"] It was probably the most satisfying experience I've ever had. In my curtain call, tears would come down my face. Being on stage like that, it's incredibly direct.", "The truth of it is I love auteurs and I love philosophical filmmakers. That's why I love that _Big Little Lies (2017)_ (qv) got made. That's why I've gone back to a very subversive film with _The Killing of a Sacred Deer (2017)_ (qv). I like the high-wire act of it. I believe in not towing the line. Conformity is what I run from. (February 2017).", "I've had extraordinary relationships with directors where my opinion is heard, loudly. And they were incredibly collaborative with me. But I believe in the hierarchy of the director. It's their art form and I'm only there to help them achieve it.", "The reason why I love Aquaman is 'James Wan' (qv) is an Australian, and I've followed his career since he started. He's a really good friend of mine, and he offered to let me play Queen Atlanna. As soon as he said I could wear mother-of-pearl and be a mermaid warrior, I said I'm done. Please. If there is one thing I have to do in my life, I have to be that. [Laughs] Because, you've got to have some fun. (February 2017)", "[on _Big Little Lies (2017)_ (qv)] People really want to talk to me about it and really analyze it. It's an amazing reaction because I'm usually either in very avant-garde art films, or unusual films, or things that are very, very divisive. To be in something that is so accessible and still topical is very interesting to me. And to be in people's living rooms and be a part of their lives every week for a period of time, I like that. It's a very invigorating and stimulating place to be as an actor. (March 2017)", "I'm about to turn 50 in two weeks and I would never have thought this is gonna be one of the best years of my life. So many things have happened to me creatively. When I was about 40 I remember thinking \"Oh, at 50 I'll be retiring\". But no way. So I wanna tell all the women out there, it is not over at 40, it begins, and it even begins more at 50."], "salary history": ["_Days of Thunder (1990)_ (qv)::$200,000", "_Billy Bathgate (1991)_ (qv)::$200,000", "_Far and Away (1992)_ (qv)::$250,000", "_My Life (1993)_ (qv)::$500,000", "_To Die For (1995)_ (qv)::$2,000,000", "_Batman Forever (1995)_ (qv)::$2,500,000", "_The Portrait of a Lady (1996)_ (qv)::$2,500,000", "_The Peacemaker (1997)_ (qv)::$5,000,000", "_Practical Magic (1998)_ (qv)::$6,000,000", "_Eyes Wide Shut (1999)_ (qv)::$6,500,000", "_Moulin Rouge! (2001)_ (qv)::$7,000,000", "_The Others (2001)_ (qv)::$7,000,000", "_Birthday Girl (2001)_ (qv)::$1,500,000", "_The Hours (2002)_ (qv)::$7,500,000", "_Dogville (2003)_ (qv)::$2,800,000", "_Cold Mountain (2003)_ (qv)::$15,000,000", "_The Stepford Wives (2004)_ (qv)::$15,000,000", "_Birth (2004)_ (qv)::$3,000,000", "_The Interpreter (2005)_ (qv)::$15,000,000", "_Bewitched (2005)_ (qv)::$17,500,000", "_The Invasion (2007)_ (qv)::$16,000,000", "_Margot at the Wedding (2007)_ (qv)::$6,000", "_The Golden Compass (2007)_ (qv)::$15,000,000", "_Australia (2008)_ (qv)::$13,000,000"], "birth date": "1967-06-20", "birth notes": "Honolulu, Hawaii, USA", "_actorID": "98", "_source": "IMDB", "actorID": "0000173", "created_utc_dt": "09/14/2019, 13:02:41"}