{"headshot": "https://m.media-amazon.com/images/M/MV5BMTgzODAyNDQwMV5BMl5BanBnXkFtZTcwOTQ2MjM3OA@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Diggins", "Tay"], "birth name": "Taylor Daniel Lautner", "height": "5' 8½\" (1.74 m)", "mini biography": ["Taylor Daniel Lautner was born in Grand Rapids, Michigan, to Deborah, a software company worker, and Daniel Lautner, a pilot for Midwest Airlines. He, and younger sister Makena, were raised in a well-mannered, Roman Catholic household in Hudsonville, Michigan. He is of English, German, Dutch, and Scottish descent. At the age of six, Taylor began studying martial arts at Fabiano's Karate School and he, along with his family, quickly noticed his unique and natural talent for the sport. He was soon invited to train with seven-time world karate champion Michael Chaturantabut (aka Mike Chat) and, at the age of eight, he was asked to represent his country in the twelve years and under division in the World Karate Association where he became the Junior World Forms and Weapons champion, winning three gold medals. In 2003, Taylor continued to flourish in the martial arts circuit where he ranked number one in the world for NASKA's Black Belt Open Forms, Musical Weapons, Traditional Weapons and Traditional Forms and, at the age of twelve, he became the three time Junior World Champion.However, in addition to his love for martial arts, Taylor quickly developed a love for acting at the age of seven years old when his martial arts instructor, who was involved in show business, encouraged him to audition for a small appearance in a Burger King commercial. Although he was unsuccessful, he enjoyed the experience so much that he told his parents that he wanted to pursue a career in acting. Soon, he and his family were traveling back-and-forth from their home in Michigan to California so Taylor could audition for acting roles on a regular basis. When Taylor was ten, with the frequent traveling and air fares starting to become overwhelming, his family made the crucial decision to relocate to Los Angeles where Taylor would have the advantage of being able to audition for films, television, and commercials full-time.Once Taylor moved with his family to Los Angeles, he found himself landing more and more small acting roles. He booked many occurring roles on various television shows such as _My Wife and Kids (2001)_ (qv), _Summerland (2004)_ (qv), and _The Bernie Mac Show (2001)_ (qv). Taylor also found himself becoming successful in films as well. In 2005, he landed the role of Sharkboy in the family blockbuster flick, _The Adventures of Sharkboy and Lavagirl 3-D (2005)_ (qv), and the role of Eliot Murtaugh in _Cheaper by the Dozen 2 (2005)_ (qv). However, it would be one single role that would ultimately change Taylor's life forever. In 2008, Taylor auditioned for the iconic role of werewolf hunk Jacob Black in the record smashing, blockbuster hit _Twilight (2008)_ (qv). With the sudden and unexpected success of the film, Taylor, along with fellow cast members 'Robert Pattinson' (qv) and 'Kristen Stewart' (qv), found himself being propelled into a world that would forever change his life and his career.Taylor has continued to portray Jacob Black in the following film adaptations of the The Twilight Saga as well as branch out into other roles and films such as the star studded romantic comedy, _Valentine's Day (2010)_ (qv), and the action-packed thriller, _Abduction (2011)_ (qv). 'Taylor Lautner' (qv) has quickly become one of the most famous, talented, and successful young Hollywood actors thanks to the blockbuster success of the _Twilight (2008)_ (qv) films. It has quickly been established by this young man's diverse and gifted talent that we will continue to be his audience for many years to come.::Anonymous"], "trade mark": ["His abs"], "trivia": ["Taylor is a keen martial artist who, from the age of seven, has won many karate tournaments on a local, national and international level.", "He is a big sports fan and his favorite sport is football. He is big fan of the University of Texas Longhorns, the University of Michigan Wolverines and professional NFL athletes, 'Brett Favre' (qv), 'Tom Brady' (qv), and 'Jerry Rice' (qv).", "Has a younger sister named Makena.", "Has a Maltese named Roxy.", "Received his driver's license in 2008.", "Played football during his freshman and sophomore year of high school.", "Had to start training the day after _Twilight (2008)_ (qv) was finished filming for his role of Jacob Black in _The Twilight Saga: New Moon (2009)_ (qv), whose transformation had to be drastic. He gained approximately 30 lbs. for the part, as promised to the director.", "Became close friends with _Twilight (2008)_ (qv) co-star, 'Edi Gathegi' (qv), when they began exercising in the gym together after filming the movie.", "Close friends with _Twilight (2008)_ (qv) co-stars, 'Robert Pattinson' (qv) and 'Kristen Stewart' (qv).", "Was ranked #1 in Access Hollywood's \"Top Five Hollywood Abs\" (2008).", "Named one of People Magazine's 100 Most Beautiful People of 2009.", "Taylor's ancestry is English, Swiss-German, German, Dutch, Scottish, and distant Irish, French, and Welsh. Taylor's patrilineal line can be traced back to his great-great-great-grandfather, Edward M. Lautner, an ethnic German, who was born, c. 1848, in Austria, to Wenzel Lautner and Helen Quiezer. Taylor has also stated that, during preparation for his role in the Twilight films, he discovered that he has \"distant\" Native American ancestry (specifically of the Ottawa and Potawatomi tribes) on his mother's side. However, all of Taylor's maternal great-grandparents and great-great-grandparents are listed as \"White\" on U.S. Censuses.", "Likes the band 'Kings of Leon' (qv).", "Named Hollywood's highest paid teen actor (2010).", "His favorite actors include 'Tom Cruise' (qv), 'Denzel Washington' (qv), 'Brad Pitt' (qv), and 'Matt Damon' (qv).", "He went to Jamestown Elementary School in Hudsonville, Michigan until he was eleven years old.", "His father, Daniel, is an airline pilot and his mother, Deborah, works for a software development company.", "Participated in the 2010 Celebrity Beach Bowl.", "Some of his favorite films include _Gladiator (2000)_ (qv), _Braveheart (1995)_ (qv), and _The Dark Knight (2008)_ (qv).", "Became one of the youngest celebrity hosts in the history of _Saturday Night Live (1975)_ (qv) when he hosted the show for the first time on December 12, 2009.", "Was in a relationship with 'Taylor Swift' (qv) [July 2009 - December 2009].", "Was ranked #3 on Men's Health Magazine's Top 10 Best Summer Bodies (2010).", "Was ranked #2 on E!'s \"Hottest Men of 2010\".", "Was ranked #4 on People Magazine's 50 Most Amazing Bodies (2010).", "Was ranked #2 on Glamour Magazine's 50 Sexiest Men of 2010.", "Created and sponsored a hand made \"New Moon Team Jacob\" messenger bag for The Children's Place and Books for Kids Foundation, with all the proceeds going to build libraries, donate books, and partner with literacy programs.", "Participated in football and baseball, along with taking up jazz and hip-hop dance lessons when he was younger.", "Was named one of GQ Magazine's 'Men of the Year' (2010).", "While doing a promotional interview for _The Twilight Saga: New Moon (2009)_ (qv) in a hotel in Brazil, Taylor and co-star, 'Kristen Stewart' (qv), were forced to confinement in a hotel room due to a riot of 2,000 girls that stormed the hotel lobby.", "Has a fear of reptiles and sharks.", "Had to go through extensive training for his role in _Abduction (2011)_ (qv), including boxing, fighting, swimming, and motorcycle training.", "Named one of People Magazine's 100 Most Beautiful People of 2011.", "While filming _Abduction (2011)_ (qv) in Pittsburgh, Pennsylvania, Taylor spent a lot of his free time attending Pittsburgh Steelers football games, where he had the opportunity to meet Superbowl and 3X MVP Champion 'Hines Ward' (qv).", "He was voted \"Best Smile\" by his junior high school class.", "Taylor, and co-stars 'Robert Pattinson' (qv) and 'Kristen Stewart' (qv), placed their handprints and footprints in cement in front of the Graumann's Chinese Theater in Los Angeles, California on November 3, 2011.", "Was ranked as one of the \"sexiest men\" in Glamour's \"50 Sexiest Men of 2010\" list.", "Filming _The Twilight Saga: Eclipse (2010)_ (qv). [October 2009]", "Filming _The Twilight Saga: New Moon (2009)_ (qv). [March 2009]", "Filming _The Twilight Saga: Breaking Dawn - Part 1 (2011)_ (qv) and _The Twilight Saga: Breaking Dawn - Part 2 (2012)_ (qv) in Baton Rouge, Louisiana. [December 2010]", "Filming _Abduction (2011)_ (qv). [June 2010]", "Filming _Twilight (2008)_ (qv). [March 2008]", "Named as one of the \"Sexiest Men\" by Glamour in 2011.", "Is a descendant of William Brewster (c. 1566-1644), a noted Pilgrim, and wife Mary, who came over to Massachusetts, America, as Mayflower passengers."], "quotes": ["[About the 'Twilight' phenomenon] It's really unlike anything else. I know that over the past couple of years, I've had the time of my life and I'm very thankful, but it is different. It's almost like you live two different worlds and you completely vanish and then you go back to your regular life.", "I hope that I would be considered romantic. I don't know...one of my favorite movies is _The Notebook (2004)_ (qv) so I guess that would be considered romantic. But I think being romantic is more than the flowers and the gifts. It's about connecting with the person and being able to talk and share things with her.", "[About presenting at the Oscars for the first time] I was freaking! It's probably the most nervous I've ever been. Just standing up on that stage and looking down at the people that you've watched your entire life. It was crazy...I wouldn't let myself lock eyes with any one person because I would have just stopped talking. If I would have locked eyes with Leo ('Leonardo DiCaprio' (qv)) or 'George Clooney' (qv) or someone I would not have been able to speak so I was trying to avoid that.", "[About his new found fame and avoiding the paparazzi] Yeah, you definitely use a lot of back-entrances and exits, but I think for the most part, we (meaning his fellow _Twilight (2008)_ (qv) cast members, 'Robert Pattinson' (qv) and 'Kristen Stewart' (qv)) just go along for the ride. We're the same people that we were before and we have people behind us that kind of help us think ahead and we're just thankful to have that help. When we walk through hotels, we always walk through the kitchen or through the garbage room or the laundry room. It's that not glamorous, trust me.", "[About hosting _Saturday Night Live (1975)_ (qv) for the first time] They tell you beforehand that \"the cast is great, you're not going to be nervous, your just going to have fun\" and I was like \"yeah, okay\" and don't get me wrong I had a lot of fun, but I was nervous. When I got the offer for it, I was like \"Listen guys it's such an honor, but I don't sing, I don't dance, and I don't do accents and that's pretty much what SNL is\" so I was really nervous, but it was a lot of fun.", "A dream acting role would be 'Matt Damon' (qv) in the Bourne series. I would love to do something like that!", "[About his favorite quote from 'Twilight'] It's not in the first book, but the quote I love the most is Jacob's quote, \"Does my being half-naked bother you?\" That quote just cracks me up. Because he's always half-naked throughout the series, it's just a good way to rock the fact that he's always shirtless.", "[About his experience with the 'Twilight' fans in Brazil] When we (meaning himself and 'Kristen Stewart' (qv)) traveled to Brazil to promote _The Twilight Saga: New Moon (2009)_ (qv), we were told ahead of time that our Brazilian fans may possibly be a little more enthusiastic then the fans we were used to. We weren't too worried. But one day when we were doing interviews in our hotel room, our security guard rushes into the room and tells us to remain calm, but 2,000 girls just stormed the hotel lobby and were on their way up to our room. That was the only time I ever felt in danger with the fans!", "[on his taste in music] One second I'll be listening to country, and then the next I'll be listening to rock and then R&B. It's ridiculous. I'm all over the place with my music.", "[on his initial reaction to the book release of 'Breaking Dawn'] It caught me by surprise when I read the book. I think I originally heard what happened through somebody who had already read it, and I didn't believe them. I thought they were joking and then when I read the book, I was like, \"You've got to be kidding me\".", "[The qualities he looks for most in a woman] Obviously loyalty and honesty, but mostly someone who can let loose, be themselves and not put on a show.", "[How it felt on the last day of filming The _The Twilight Saga: Breaking Dawn - Part 2 (2012)_ (qv)] Well we've literally been filming these movies for the past three to four years, so it was very strange to know that I'm not going back to play Jacob Black anymore. And yes, we were all pretty upset, but I think, to my surprise, the one who was the most emotional was Kristen ('Kristen Stewart' (qv)). But I predicted from the beginning that we would all be upset and on the last day, it did get emotional.", "[on filming _Abduction (2011)_ (qv)] When I saw the script, it had probably five or six shirtless scenes, and it got cut down to one short one. It had to make sense for the character. We found the one moment when it would work and that was it.", "[on attention from fans] I've had a few girls that have tattooed my signature on their arm. I mean that blows my mind! Something new happens every day and it continues to blow my mind."], "salary history": ["_Twilight (2008)_ (qv)::$1,000,000", "_The Twilight Saga: New Moon (2009)_ (qv)::$4,000,000", "_The Twilight Saga: Eclipse (2010)_ (qv)::$7,500,000 + 2.5% of the profits", "_Abduction (2011)_ (qv)::$7,500,000", "_The Twilight Saga: Breaking Dawn - Part 1 (2011)_ (qv)::$12,500,000 + 7.5% of the gross", "_The Twilight Saga: Breaking Dawn - Part 2 (2012)_ (qv)::$12,500,000 + 7.5% of the gross"], "birth date": "1992-02-11", "birth notes": "Grand Rapids, Michigan, USA", "_actorID": "100", "_source": "IMDB", "actorID": "1210124", "created_utc_dt": "09/14/2019, 13:02:43"}