{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQ1OTM0MjEwOF5BMl5BanBnXkFtZTYwNTQwNzI1._V1_UY98_CR0,0,67,98_AL_.jpg", "nick names": ["Billy", "The Murricane"], "birth name": "William James Murray", "height": "6' 1½\" (1.87 m)", "mini biography": ["'Bill Murray' (qv) is an American actor, comedian, and writer. The fifth of nine children, he was born William James Murray in Wilmette, Illinois, to Lucille (Collins), a mailroom clerk, and Edward Joseph Murray II, who sold lumber. He is of Irish descent. Among his siblings are actors 'Brian Doyle-Murray' (qv), 'Joel Murray' (qv), and 'John Murray' (qv). He and most of his siblings worked as caddies, which paid his tuition to Loyola Academy, a Jesuit school. He played sports and did some acting while in that school, but in his words, mostly \"screwed off.\" He enrolled at Regis College in Denver to study pre-med but dropped out after being arrested for marijuana possession. He then joined the National Lampoon Radio Hour with fellow members 'Dan Aykroyd' (qv), 'Gilda Radner' (qv), and 'John Belushi' (qv). However, while those three became the original members of _Saturday Night Live (1975)_ (qv), he joined _Saturday Night Live with Howard Cosell (1975)_ (qv), which premiered that same year. After that show failed, he later got the opportunity to join _Saturday Night Live (1975)_ (qv), for which he earned his first Emmy Award for Outstanding Writing in a Comedy-Variety or Music Series. He later went on to star in comedy films, including _Meatballs (1979)_ (qv), _Caddyshack (1980)_ (qv), _Stripes (1981)_ (qv), _Tootsie (1982)_ (qv), _Ghostbusters (1984)_ (qv), _Ghostbusters II (1989)_ (qv), _Scrooged (1988)_ (qv), _What About Bob? (1991)_ (qv), and _Groundhog Day (1993)_ (qv). He also co-directed _Quick Change (1990)_ (qv). Murray garnered additional critical acclaim later in his career, starring in _Lost in Translation (2003)_ (qv), which earned him a Golden Globe and a BAFTA Award for Best Actor, as well as an Academy Award nomination for Best Actor. He also received Golden Globe nominations for his roles in Ghostbusters, _Rushmore (1998)_ (qv), _Hyde Park on Hudson (2012)_ (qv), _St. Vincent (2014)_ (qv), and the HBO miniseries _Olive Kitteridge (2014)_ (qv), for which he later won his second Primetime Emmy Award for Outstanding Supporting Actor in a Limited Series or a Movie.::John Sacksteder and Pedro Borges"], "spouse": ["'Jennifer Butler' (qv)::(4 July 1997 - 13 June 2008) ( divorced) ( 4 children)", "'Mickey Kelley' (qv)::(25 January 1981 - 29 January 1994) ( divorced) ( 2 children)"], "trade mark": ["Deadpan expression", "In the later years of his career, he frequently plays depressed characters (_Lost in Translation (2003)_ (qv), _Broken Flowers (2005)_ (qv), _The Life Aquatic with Steve Zissou (2004)_ (qv), _Rushmore (1998)_ (qv), _The Royal Tenenbaums (2001)_ (qv))", "During the early years of his career, he frequently played loud, sarcastic, and often rude and mean, anti-heroes (_Meatballs (1979)_ (qv), _Stripes (1981)_ (qv), _Caddyshack (1980)_ (qv), the two Ghostbusters films, _Groundhog Day (1993)_ (qv))", "Soft mellow voice", "Often works with directors 'Ivan Reitman' (qv), 'Harold Ramis' (qv) and 'Wes Anderson' (qv)", "Often plays bitter, misanthropic cynics who suffer humiliation and failure"], "trivia": ["Accidentally broke 'Robert De Niro' (qv)'s nose during the filming of _Mad Dog and Glory (1993)_ (qv).", "Ranked #82 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "1997 Recipient of the Sons of the Desert Annual Comedy Performer Award on April 19th, 1997.", "Appeared in _Scrooged (1988)_ (qv) with three of his brothers.", "Father, with 'Mickey Kelley' (qv), of sons 'Homer Murray' (qv) of Clan Murray (b. 1982) and 'Luke Murray' (qv) of Clan Murray (b. 1985).", "Father, with 'Jennifer Butler' (qv), of four sons: Caleb James Murray of Clan Murray (b. January 11, 1993), Jackson William Murray of Clan Murray (b. October 6, 1995), Cooper Jones Murray of Clan Murray (b. January 27, 1997) and Lincoln Darius Murray of Clan Murray (b. May 30, 2001).", "He is a co-owner of the New York Yankees single A affiliate baseball team, the Charleston RiverDogs.", "Related through marriage to guitar player, lyricist and singer Chris Luxem.", "Set to become part-owner of his third minor league baseball team, the new Brockton Rox, in Mass., with friend 'Van Schley' (qv).", "Has become the unofficial patron saint of the forums of the Football Manager website, home to one of the biggest selling PC games of all time.", "He is part of The Goldklang Group that includes 'Van Schley' (qv), baseball marketing guru 'Mike Veeck' (qv), and _Saturday Night Live (1975)_ (qv) comedian 'Jimmy Fallon' (qv). The group owns minor league baseball teams the St. Paul Saints and the Brockton Rox of the Northern League, the Charleston RiverDogs, the Fort Myers Miracle, the Hudson Valley Renegades, the Evansville Otters and they run the Portland Beavers.", "Was bitten by the groundhog twice on the _Groundhog Day (1993)_ (qv) set in 1992.", "He is a diehard Chicago Cubs fan. During the Cubs playoff run in 2003, he was on location in Italy, but he had it written into his contract that he'd get a satellite feed of the playoffs.", "His role in _Ghostbusters (1984)_ (qv) was originally intended for fellow SNL star 'John Belushi' (qv).", "Shares two characters with the late 'Lorenzo Music' (qv). He played Peter Venkman in the film _Ghostbusters (1984)_ (qv), while Lorenzo played Venkman in the animated series, _The Real Ghostbusters (1986)_ (qv). Lorenzo was also the voice of Garfield in numerous cartoons, while Bill provides Garfield's voice in _Garfield (2004)_ (qv).", "He was rated number 1 in Comedy Central's newest show 'Mouthing Off: 51 Greatest Smartasses.'", "His home is in upstate New York, although he is more frequently working elsewhere during the year.", "Performed the vocals for the song \"The Best Thing\" in the 'John Waters' (qv) film _Polyester (1981)_ (qv).", "His father Edward Murray of Clan Murray was a lumber salesman. He died in 1967.", "Siblings include 'Brian Doyle-Murray' (qv), Nancy, Edward, Andy, 'John Murray' (qv), 'Joel Murray' (qv), Peggy, and Laura.", "Attended Loyola Academy in Wilmette, Illinois graduating in 1968.", "Attended Regis College in Denver. He dropped out his sophomore year.", "His mother died in 1988.", "Doesn't have a publicist.", "His sister Nancy is a Dominican nun.", "In 2001, he starred with 'Sigourney Weaver' (qv) in an Off-Off-Broadway play called \"The Guys,\" in which he played a fire captain who lost eight of his men on 9/11. In the movie version, Murray's role was played by 'Anthony LaPaglia' (qv).", "Is an avid golfer and has appeared at many pro-am golf tournaments.", "Co-owner, with brothers Brian Murray of Clan Murray, 'Joel Murray' (qv) of Clan Murray and 'John Murray' (qv) of Clan Murray, of the Murray Brothers Caddyshack Restaurant in Jacksonville, Duval County, Florida (actually, in St. Augustine, St. Johns County, Florida, inside the World Golf Village Complex).", "Has often worked with the directors 'Harold Ramis' (qv), 'Ivan Reitman' (qv), 'Wes Anderson' (qv), and 'Jim Jarmusch' (qv).", "'Sofia Coppola' (qv) wrote the lead role of Bob Harris in _Lost in Translation (2003)_ (qv), with Murray specifically in mind. She did not know the actor and even enlisted the help of her famous father, 'Francis Ford Coppola' (qv), to track down the sometimes quite elusive Murray. Once he finally read the script, though, he agreed to do it on the spot. Murray and 'Sofia Coppola' (qv) are now good friends.", "He has rubbed some collaborators the wrong way because he has a tendency to re-write and improvise his way through scripts until many of his scenes barely resembles the original versions. Most collaborators ultimately find, though, it's to the improvement of the films.", "Is a fan of the Illini men's basketball team.", "Captivated by the story of _Press Your Luck (1983)_ (qv) contestant 'Michael Larson' (qv) who memorized the sequence of the game show's big board and racked up over $110,000 in winnings, Murray commissioned a screenplay for a biopic about Larson. Several studios expressed an interest but didn't follow through. The Game Show Network's 2003 TV documentary _Big Bucks: The Press Your Luck Scandal (2003)_ (qv) told the same story with interviews, dramatic recreations and archival video, and may have diminished interest in the film even more.", "The part of Boon in National Lampoon's _National Lampoon's Animal House (1978)_ (qv) was originally written with him in mind, but due to a scheduling conflict, he had to turn it down.", "He was considered for the role of Ted Stryker in _Airplane! (1980)_ (qv).", "Has said that \"Oklahoma!\" is his favorite musical.", "Has no agent, no business manager, or favorite hair and make-up artist. He travels without an entourage.", "He was considered for the role of Detective John Kimble in _Kindergarten Cop (1990)_ (qv). The part eventually went to 'Arnold Schwarzenegger' (qv).", "With _The Life Aquatic with Steve Zissou (2004)_ (qv) and _Broken Flowers (2005)_ (qv), Murray did two films back-to-back in which he plays a long-childless man who discovers that someone who may be his grown son has been searching for him.", "His performance as Phil Connors in _Groundhog Day (1993)_ (qv) is ranked #48 on Premiere Magazine's 100 Greatest Performances of All Time (2006).", "Was considered for the role of Batman/Bruce Wayne in the 1989 _Batman (1989)_ (qv) film when it was set to be identical to the 1960s TV Series before 'Tim Burton' (qv) came along.", "Was considered for the role of Willy Wonka in _Charlie and the Chocolate Factory (2005)_ (qv).", "His performance as Carl Spackler in _Caddyshack (1980)_ (qv) is ranked #18 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "Was considered for the role of Buzz Lightyear in _Toy Story (1995)_ (qv).", "Murray is one of only three American actors who were nominated for an Oscar for a movie that is set in the territory of Japan. The other two were 'Marlon Brando' (qv) and 'Red Buttons' (qv) for _Sayonara (1957)_ (qv).", "Turned down 'Steve Carell' (qv)'s role in _Little Miss Sunshine (2006)_ (qv), which became one of the few choices in his career that he regretted.", "Voiced Johnny Storm/The Human Torch in an early Fantastic Four radio show.", "Murray is a huge fan of Chicago pro sports teams, especially the Chicago Cubs and the Chicago Bears.", "Curiously enough, Murray was the very first guest on the first episode on _Late Night with David Letterman (1982)_ (qv) and the very last guest on 19 May 2015.", "Was considered and tested for the voice role of Sulley in _Monsters, Inc. (2001)_ (qv), but the director, 'Pete Docter' (qv), said that when the filmmakers decided to offer it to Murray, they were unable to make contact with him and took that to mean \"no\".", "An early promotional reel for _The Real Ghostbusters (1986)_ (qv) featured a different character design for the animated version of Murray's character Peter Venkman, a design that bore more of a resemblance to Murray himself as opposed to the final character design, which gave Venkman a slimmer, sleeker, more chiseled \"pretty boy\" look.", "He was considered for Han Solo in _Star Wars: Episode IV - A New Hope (1977)_ (qv) and Indiana Jones in _Raiders of the Lost Ark (1981)_ (qv).", "Murray and 'Dan Aykroyd' (qv) reprised their _Ghostbusters (1984)_ (qv) characters to visit a terminally ill child who was a fan of the film and wanted to meet them.", "Was a frequent collaborator with 'Harold Ramis' (qv) throughout the 1980s, but their working relationship ended during the filming of _Groundhog Day (1993)_ (qv) due to differing views on what the film should be: Ramis claims that Murray wanted the film to be more philosophical, while Ramis himself simply meant for it to be a comedy. Ramis also cites that Murray's personal problems at the time (namely the ending of his first marriage) had a negative effect on his work ethic, causing him to be uncharacteristically harsh during filming, as another reason for the end of their working relationship.", "Is portrayed by 'Mather Zickel' (qv) in 'Gilda Radner' (qv): It's Always Something (2002).", "Married his first wife, 'Mickey Kelley' (qv) in Las Vegas on Super Bowl Sunday of 1981. They had a second ceremony at a church on March 25, 1981.", "'Dan Aykroyd' (qv) nicknamed him \"The Murricane\" for his notorious mood swings.", "His pockmarked face is due to acne problems he experienced as a teenager.", "'Robert Zemeckis' (qv) and 'Steven Spielberg' (qv) originally wanted him to play Eddie Valiant in _Who Framed Roger Rabbit (1988)_ (qv), but neither could get in contact with him in time. 'Bill Murray' (qv), in turn, has stated that when he read the interview, he was in a public place, but he still screamed his lungs out, because he would have definitely accepted the role.", "Irish-American.", "Ex-wife 'Jennifer Butler' (qv) filed for divorce on May 2008 on the grounds of drug addiction, physical abuse, adultery and abandonment.", "Lives in Valley Center, Malibu, California, Palisades, New York and Sullivans Island, South Carolina.", "He appears in four of the American Film Institute's 100 Funniest Movies: _Tootsie (1982)_ (qv) at #2, _Ghostbusters (1984)_ (qv) at #28, _Groundhog Day (1993)_ (qv) at #34 and _Caddyshack (1980)_ (qv) at #71.", "Appeared in _Zombieland (2009)_ (qv) as a favor to 'Woody Harrelson' (qv), movie co-star and big \"'Bill Murray' (qv)\" fan.", "Has been a friend of 'Kerry Simon' (qv) since they were both pizza chefs at Little Caesar's in Chicago.", "He was considered for the Master in _Doctor Who (1996)_ (qv).", "Appeared in a reading of 'Arthur Miller' (qv)'s newest play (and first comedy), Resurrection Blues, in New York. [August 2004]", "He is listed as the St Paul Saints baseball team as Team Psychologist. He has been with the Saints since 1993.", "Was considered for the role of John Keating in _Dead Poets Society (1989)_ (qv), which went to 'Robin Williams' (qv).", "Was considered for the role of Leonard Lowe in _Awakenings (1990)_ (qv), which went to 'Robert De Niro' (qv).", "As of 2015, has appeared in three films that were nominated for the Best Picture Oscar: _Tootsie (1982)_ (qv), _Lost in Translation (2003)_ (qv) and _The Grand Budapest Hotel (2014)_ (qv).", "He appeared in four films featured on AFI's 100 Years...100 Laughs; _Caddyshack (1980)_ (qv) (#71), _Groundhog Day (1993)_ (qv) (#34), _Ghostbusters (1984)_ (qv) (#28) and _Tootsie (1982)_ (qv) (#2).", "Was considered for the role of Harry Sultenfuss in _My Girl (1991)_ (qv), but could not take the part due to working on _What About Bob? (1991)_ (qv) at the same time. The role went to his _Ghostbusters (1984)_ (qv) co-star 'Dan Aykroyd' (qv), instead.", "He holds the position Director of Fun for the Charleston RiverDogs minor league baseball team.", "He is a co-owner of Harold's Cabin restaurant in Charleston, SC.", "He was inducted into the South Atlantic minor league's Baseball Hall of Fame in 2012.", "In support of many co-stars from numerous comedy films appeared at a 'Save the Rose Theatre' event, at London Southbank, his guest cameos linking many other 'Groundhog Day' acts such as 'Scooter' (qv), who came from the U.S. to participate in variety of film industry conventions during the same weekend. Later reprises this visit for a film industry event in 2006, at the same location while promoting _Garfield 2 (2006)_ (qv) , bringing most actors from _The Life Aquatic with Steve Zissou (2004)_ (qv) along as well.", "He was considered for 'Jason Lee' (qv)'s roles in _Dogma (1999)_ (qv) and _Alvin and the Chipmunks (2007)_ (qv).", "He turned down 'Jim Belushi' (qv)'s role in _Curly Sue (1991)_ (qv) (who coincidentally was named Bill) due to his commitment to _What About Bob? (1991)_ (qv).", "He was considered for the lead role in _Arthur (1981)_ (qv).", "He turned down the lead role in _Big (1988)_ (qv) in order to star in _Scrooged (1988)_ (qv).", "The only 'Wes Anderson' (qv) film he didn't appear in was his debut _Bottle Rocket (1996)_ (qv). He was considered for the role of Mr. Henry that went to 'James Caan' (qv).", "He was considered to star opposite 'Chevy Chase' (qv) in _The Fabulous Baker Boys (1989)_ (qv).", "He was considered for 'Steve Martin' (qv) in _Dirty Rotten Scoundrels (1988)_ (qv).", "He was considered for the role of Pat Healy in _There's Something About Mary (1998)_ (qv), but was deemed too old for the part. 'Matt Dillon' (qv) was cast instead.", "He was originally considered to star in _King Ralph (1991)_ (qv).", "He was 'Stephen King' (qv)'s first choice for Johnny Smith in _The Dead Zone (1983)_ (qv).", "He was considered for 'Michael Douglas' (qv)' role in _Fatal Attraction (1987)_ (qv).", "He was considered for 'Michael Keaton' (qv)'s roles in _Gung Ho (1986)_ (qv), _Beetlejuice (1988)_ (qv) and _The Paper (1994)_ (qv).", "He was considered for Carey Mahoney in _Police Academy (1984)_ (qv).", "He was considered to star as 'Larry Flynt' (qv) in The People vs. 'Larry Flynt' (qv) (1996).", "He was considered for 'Tom Selleck' (qv)'s in _3 Men and a Baby (1987)_ (qv).", "He was considered for the role of Jack Horner in 'Burt Reynolds' (qv) that went to _Boogie Nights (1997)_ (qv).", "He was considered for 'Tom Hanks' (qv)' roles in _Splash (1984)_ (qv), _Turner & Hooch (1989)_ (qv) and _Forrest Gump (1994)_ (qv).", "He was considered for the lead role in _Cocktail (1988)_ (qv).", "He was considered for 'Jack Nicholson' (qv)'s roles in _Prizzi's Honor (1985)_ (qv) and _The Witches of Eastwick (1987)_ (qv).", "He was originally considered for the role of Dr. Wren in _Alien: Resurrection (1997)_ (qv), with the intent of reuniting him with 'Sigourney Weaver' (qv), his co-star from the Ghostbusters series.", "He was considered for 'Charles Grodin' (qv)'s role in _Beethoven (1992)_ (qv).", "He came sixth in Rolling Stone's ranking of ever _Saturday Night Live (1975)_ (qv) castmember.", "Of Clan Murray.", "Was co-owner of the Salt Lake Trappers rookie (Pioneer) league baseball team from 1985-1992. They won a pro baseball record 29 games in a row in 1987 that still stands. Arte Moreno the Los Angeles Angels current owner, was also part of the Trappers ownership group.", "He inspired the eponymous song \"'Bill Murray' (qv)\" written and performed by the Spanish pop band Izal, included in its album \"Autoterapia\" (2018).", "Said he based his character in _Lost in Translation (2003)_ (qv) on 'Charles Bronson' (qv).", "He has appeared in four films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _Tootsie (1982)_ (qv), _Ghostbusters (1984)_ (qv), _Groundhog Day (1993)_ (qv) and _Rushmore (1998)_ (qv)."], "quotes": ["I'm a nut, but not just a nut.", "If you walk up to some random person on the street, grab them by the shoulder, and say 'Did you just see what I saw?!'....you'll find that no one wants to talk to you.", "The truth is, anybody that becomes famous is an ass for a year and a half. You've got to give them a year and a half, two years. They are getting so much smoke blown, and their whole world gets so turned upside down, their responses become distorted. I give everybody a year or two to pull it together because, when it first happens, I know how it is.", "There aren't many downsides to being rich, other than paying taxes and having relatives asking for money. But being famous, that's a 24 hour job right there.", "I'm over the Oscar thing. I feel that if you really want an Oscar, you're in trouble. It's like wanting to be married - you'll take anybody. If you want the Oscar really badly, it becomes a naked desire and ambition. It becomes very unattractive. I've seen it. The nice thing is that I'm over here in Europe making a movie and so I don't need to worry about it.", "I know how to be sour. I know that taste.", "[on _Lost in Translation (2003)_ (qv)] Many people say, \"Do you think this is offensive to the Japanese?\" Well, I know the Japanese are laughing more at the Americanisms than we are laughing at the Japanese-isms... they love watching the stupidity of the foreigner in Tokyo. They're not offended at all. They know that the bowing is funny and that their language is impenetrable to the rest of the world.", "You know the theory of cell irritability?. If you take an amoeba cell and poke it a thousand times, it will change and then re-form into its original shape. And then, the thousandth time you poke this amoeba, the cell will completely collapse and become nothing. That's kind of what it's like being famous. People say hi, how are you doing, and after the thousandth time, you just get angry; you really pop.", "There's definitely a lot of trash that comes with the prize of being famous. It's a nice gift, but there's a lot of wrapping and paper and junk to cut through. Back then, when a movie came out and people saw you on the street, their reaction was so supercharged that it was scary. It would frighten other people. It used to really rattle me. I mean, everybody would love to have their clothes torn off by a mob of girls, but being screamed at is different.", "It was cool that an Oscar nomination never happened for a long time, and then it was cool that it did happen. But I don't want to always be feeling this thing in my chest like, 'Am I good enough? Am I gonna be rejected?'", "Why would you get up there and bore people? I never have figured that out. These people are supposedly in the entertainment industry, and they finally get up there to that podium and they become the most boring people in the world. [on award acceptance speeches]", "I think midlife crisis is just a point where people's careers have reached some plateau and they have to reflect on their personal relationships.", "One of the things I like about acting is that, in a funny way, I come back to myself.", "We used to joke about it: 'Give me an affliction and I'll give you an Oscar!' They're not giving an award for acting. It's, 'Thanks for making me feel something. Here's a prize.' Somehow people don't put comedy in their emotional bank the same way. It relieves a tension, it unties a knot, but it's not something where people want to give you a prize. They just want to say, 'Thanks for making me laugh,' which I genuinely treasure. That makes me feel good.", "You are always away from home, as a film actor. Look at me now. You can be stuck in a hotel, several thousand miles away in a whole different time zone, and it is never glamorous. You can't sleep, you put on the television in the middle of the night when you can't understand a word, and you make phone calls back home which don't really give you the comfort they should.", "I know what it's like to be that stranger's voice calling in,\" he admits. \"It happens in acting and it happens in business. Those who are living together all the time and can guarantee seeing each other every night or weekend probably don't know what I am talking about. There is also that little-discussed subject - loneliness. That is a great taboo, isn't it? No one really wants to admit they are lonely, and it is never really addressed very much between friends and family. But I have felt lonely many times in my life.", "Whenever I think of the high salaries we are paid as film actors, I think it is for the travel, the time away, and any trouble you get into through being well known. It's not for the acting, that's for sure.", "Movie acting suits me because I only need to be good for ninety seconds at a time.", "I've had some success in movies, so I really don't think about success. You like to have it, but I'm not desperate for it.", "I remember being in Japan 10 years ago for a golf tournament. I turned over a Kirin beer coaster, and there was Harrison Ford's picture. He's a guy who would never be caught dead doing a commercial here. He had a bottle in his hand and the most uncomfortable look on his face, like, \"I can't believe I'm shilling.\" When 'Sofia Coppola' (qv), the director of _Lost in Translation (2003)_ (qv), sent me the script, she included a photo and said, 'This is what I have in mind.', It was Brad Pitt in an ad for espresso in a can, and he had the same grimace: 'I can't believe I'm selling this can of coffee.', That influenced me when I had to do my own shtick.", "{Before jumping from a plane at 13,500 feet] Is there some frequent flyer program?", "The first 45 minutes of the original _Ghostbusters (1984)_ (qv) is some of the funniest stuff ever made. The second one was disappointing because the special-effects guys took over. I had something like two scenes - and they're the only funny ones in the movie.", "I have developed a kind of different style over the years. I hate trying to re-create a tone or a pitch. Saying, \"I want to make it sound like I made it sound the last time\"? That's insane, because the last time doesn't exist. It's only this time. And everything is going to be different this time. There's only now. And I don't think a director, as often as not, knows what is going to play funny anyway. As often as not, the right one is the one that they're surprised by, so I don't think that they have the right tone in their head. And I think that good actors always-or if you're being good, anyway-you're making it better than the script. That's your job.", "It's like the first day you check into a hotel in L.A. there's a message under your door. The second day, there's eleven messages under your door. The third day, there's thirty, forty, fifty, sixty, seventy messages. And I realized that they just want fresh blood. They. Just. Want. Fresh. Blood. You gotta get the hell out of there. And you really feel, if you live in New York, that you're three hours ahead of them-I mean that literally. It's like, Oh man, we gotta help these people! And the longer you stay there, the less ahead of them you get, and then you're one of them. No way, man. Not for me.", "[on _Quick Change (1990)_ (qv)] We couldn't get anyone we liked to direct the movie. We asked 'Jonathan Demme' (qv), and he said no. We asked 'Ron Howard' (qv), because Ron had made something that I thought was funny (_Parenthood (1989)_ (qv)] ...and he said he didn't know who to root for in the script. He lost me at that moment. I've never gone back to him since.", "[on _Garfield (2004)_ (qv)] I thought it would be kind of fun, because doing a voice is challenging, and I'd never done that. Plus, I looked at the script, and it said, \"So-and-so and 'Joel Cohen' (qv).\" And I thought: \"Christ, well, I love those Coens! They're funny.\", so I agreed to do it. Afterwards, I sat down and watched the whole thing, and I kept saying, \"What the fuck was Coen thinking?\" And then they explained it to me: It wasn't written by THAT 'Joel Coen' (qv).", "[on _Ghostbusters (2016)_ (qv)] It's not the foremost thing in my mind right now, so I don't think about it. The studio gets excited about it every ten years or so, it seems like. Because what they'd really like to do is recreate the franchise. They'd like to keep it going.", "I think if you can take care of yourself, and then maybe try to take care of someone else, that's sort of how you're supposed to live. There's only so many people that can (do that), and the rest of the people, they're useful in terms of compost for the whole planet.", "[on _The Razor's Edge (1984)_ (qv)] I kind of deluded myself that there would be a lot of interest. I made a big mistake. The studio wanted to make it a modern movie, and I said no, it should be a period piece. I was wrong and they were right. The day I finished shooting I said, 'If this never comes out, the experience will have been worth it.' I still feel that way.", "[on _Stripes (1981)_ (qv)] I'm still a little queasy that I actually made a movie where I carry a machine gun. But I felt if you were rescuing your friends it was okay. It wasn't _Reds (1981)_ (qv) or anything, but it captured what it was like on an Army base: It was cold, you had to wear the same green clothes, you had to do a lot of physical stuff, you got treated pretty badly, and had bad coffee.", "[on _Where the Buffalo Roam (1980)_ (qv) and 'Hunter S. Thompson' (qv)] I rented a house in L.A. with a guest house that Hunter lived in. I'd work all day and stay up all night with him; I was strong in those days. I took on another persona and that was tough to shake. I still have Hunter in me.", "If you bite on everything they throw at you, they will grind you down. You have to ignore a certain amount of stuff. The thing I keep saying to them lately is: \"I have to love you, and I have the right to ignore you.\" When my kids ask what I want for my birthday or Christmas or whatever, I use the same answer my father did: \"Peace and quiet.\" That was never a satisfactory answer to me as a kid - I wanted an answer like \"A pipe.\" But now I see the wisdom of it: All I want is you at your best - you making this an easier home to live in, you thinking of others. -on fathering", "When I work, my first relationship with people is professional. There are people who want to be your friend right away. I say, \"We're not gonna be friends until we get this done. If we don't get this done, we're never going to be friends, because if we don't get the job done, then the one thing we did together that we had to do together we failed.\" People confuse friendship and relaxation. It's incredibly important to be relaxed - you don't have a chance if you're not relaxed. So I try very hard to relax any kind of tension. But friendship is different. I read a great essay: Thoreau on friendship. I was staying over at my friend's house and there it was on the bedside table, and I'm reading it and I'm thinking it's an essay, so it's gonna be like four pages. Well, it goes on and on and on and on - Thoreau was a guy who lived alone, so he just had to get it all out, you know? He just keeps saying, \"You have to love what is best in that other person and only what's best in that other person. That's what you have to love\".", "Well, he was a guy who had great knowledge of the craft of improvisation. And he lived life in a very rich manner, to excess sometimes. He had a whole lot of brain stuck inside of his skull. Beyond being gifted, he really engaged in life. He earned a lot. He made more of himself than he was given. Came out of Manhattan, Kansas, and ended up hanging out with the Beats. He was incredibly gracious to your talent and always tried to further it. He got people to perform beyond their expectations. He really believed that anyone could do it if they were present and showed respect. There was a whole lot of respect. He taught lots and lots of people very effectively. He taught people to commit. Like: \"Don't walk out there with one hand in your pocket unless there's something' in there you're going to bring out.\" You gotta commit. You've gotta go out there and improvise and you've gotta be completely unafraid to die. You've got to be able to take a chance to die. And you have to die lots. You have to die all the time. You're going' out there with just a whisper of an idea. The fear will make you clench up. That's the fear of dying. When you start and the first few lines don't grab and people are going like, \"What's this? I'm not laughing and I'm not interested,\" then you just put your arms out like this and open way up and that allows your stuff to go out. Otherwise it's just stuck inside you. -on his acting teacher 'Del Close' (qv)", "I think everyone in the acting business wants to make the right choices. You want to say no at the right time and you want to say yes more sparingly. I came out of the old Second City in Chicago. Chicago actors are more hard-nosed. They're tough on themselves and their fellow actors. They're self-demanding. Saying no was very important. Integrity is probably too grand a word, but if you're not the voice of Mr. Kool-Aid, then you're still free. You're not roped in.", "I'm not trying to be coy. It's just practical for me. When the phone started ringing too many times, I had to take it back to what I can handle. I take my chances on a job or a person as opposed to a situation. I don't like to have a situation placed over my head.", "The more relaxed you are, the better you are at everything: the better you are with your loved ones, the better you are with enemies, the better you are at your job, the better you are with yourself.", "[on preparing to play President Roosevelt] This great director we had at Second City ('Del Close' (qv)) said, 'You wear your character like a trench coat. It's still you in there, but there's,like, a trench coat'. So I figured this was like a winter trench coat, because there was just a little bit more character that comes to the party. So I did a lot more reading, a lot more studying.", "[on encountering fans] I'm of the habit that if people are waiting outside the hotel, you don't sign your autographs there. Because that means when you come back in the middle of the night, they're still there. It's usually a one-time thing. That's it; that's your one time. You try your hardest but you can't always be perfect.", "[on screenplays] The early days, you could change every single word and no one cared. It was like, 'That's fine. That was terrible anyway'. But now, if the script's really good, you don't need to change very much.", "The only thing we really, surely have is hope. You hope that you can be alive, that things will happen to you that you'll actually witness, that you'll participate in. Rather than life just rolling over you, and you wake up and it's Thursday, and what happened on Monday? Whatever the best part of my life has been, has been the result of that remembering.", "[on reconnecting with earlier performances] When you did the job, you thought you were just trying to amuse your friends who are all on the job. I'm just trying to make the sound guy laugh, the script supervisor. A movie like _Caddyshack (1980)_ (qv), I can walk on a golf course and some guy will be screaming entire scenes at me and expecting me to do it word for word with him. It's like, 'Fella, I did that once. I improvised that scene. I don't remember how it goes'. But I'm charmed by it. I'm not like, 'Hey, knock it off'. It's kind of cool.", "[on bringing improv experience into real life] It pays off in your life when you're in an elevator and people are uncomfortable. You can just say, 'That's a beautiful scarf'. It's just thinking about making someone else feel comfortable. You don't worry about yourself, because we're vibrating together. If I can make yours just a little bit groovier, it'll affect me. It comes back, somehow.", "[on developing a film character] I hate to give away my secrets but I do almost nothing. Being slightly lazy works for me.", "[on 'McG' (qv)'s claim that Murray head-butted him on the set of _Charlie's Angels (2000)_ (qv)] That's bulls---! That's complete crap! I don't know why he made that story up. He has a very active imagination...No! He deserves to die! He should be pierced with a lance, not head-butted.", "[on his altercation with 'Lucy Liu' (qv) on the set of _Charlie's Angels (2000)_ (qv)] Look, I will dismiss you completely if you are unprofessional and working with me...When our relationship is professional, and you're not getting that done, forget it.", "[on his altercation with 'Lucy Liu' (qv) on the set of _Charlie's Angels (2000)_ (qv)] We began rehearsing this scene and I said, 'Lucy, how can you want to say these lines? These are so crazy.' She got furious with me because she thought it was a personal assault, but the reality is she hated these lines as much as I did. But for 15 or 20 minutes there, we went to our separate corners and threw hand-grenades and sky rockets at each other. We made peace and I got to know her better from that day, and I feel very warmly for her now.", "If I hadn't been a comedian or an actor or whatever it is that I am now, I would have been a professional athlete, probably a baseball player.", "If you have someone that you think is The One, don't just sort of think in your ordinary mind, \"Okay, let's make a date, let's plan this and make a party and get married\". Take this person and travel around the world. Buy a plane ticket for the two of you to travel around the world. And go to places that are hard to get into and hard to get out of, and when you come back to JFK, when you land and you're still in love with that person, get married at the airport.", "(On his fight with 'Chevy Chase' (qv)) It was an Oedipal thing, a rupture. Because we all felt mad he had left us, and somehow I was the anointed avenging angel, who had to speak for everyone. But Chevy and I are friends now. It's all fine.", "(Interview with Jessica Lee Jernigan (May 1999)) I think that the online world has actually brought books back. People are reading because they're reading the damn screen. That's more reading than people used to do.", "You show me an actor doing a shit movie, I'll show you a guy with a bad divorce.", "(Rolling Stone interview) I think _The Razor's Edge (1984)_ (qv) is a pretty good movie. But at the time, it was just as reviled as any other comedian doing a serious thing now. Like _The Majestic (2001)_ (qv) [with 'Jim Carrey' (qv)], movies where comedians go straight, people don't like them. It angers people, like you're taking something away from them. That's the response I got. I thought, \"Well, aren't we all bigger than that?\" I wasn't shocked by it, but I thought that the professional critics would be able to say, \"OK, we shouldn't rule this out, because the guy normally does other stuff.\" Unless it's really despicable, then you have to just jump with both feet on the neck.", "(On _The Razor's Edge (1984)_ (qv) as quoted in Stills Magazine) I don't know what my fans are going to think. It's definitely not what they're used to from me.", "I think romance basically starts with respect. And new romance always starts with respect. I think I have some romantic friendships. Like the song \"Love the One You're With\"; there is something to that. It's not just make love to whomever you're with, it's just love whomever you're with. And love can be seeing that here we are and there's this world here. If I go to my room and I watch TV, I didn't really live. If I stay in my hotel room and watch TV, I didn't live today.", "Melancholic and lovable is the trick, right? You've got to be able to show that you have these feelings. In the game of life, you get these feelings and how you deal with those feelings. What you do when you are trying to deal with a melancholy. A melancholy can be sweet. It's not a mean thing, but it's something that happens in life - like autumn.", "When you become famous, you've got like a year or two where you act like a real asshole. You can't help yourself. It happens to everybody. You've got like two years to pull it together - or it's permanent.", "If I see someone who's out cold on their feet, I'm going to try to wake that person up. It's what I want someone to do for me. Wake me the hell up and come back to the planet.", "(On _What About Bob? (1991)_ (qv) in a 1993 interview with Entertainment Weekly) It's entertaining - everybody knows somebody like that Bob guy. ('Richard Dreyfuss' (qv) and I) didn't get along on the movie particularly, but it worked for the movie. I mean, I drove him nuts, and he encouraged me to drive him nuts"], "salary history": ["_Ghostbusters II (1989)_ (qv)::$7,000,000", "_What About Bob? (1991)_ (qv)::$8,000,000", "_Groundhog Day (1993)_ (qv)::$10,000,000"], "birth date": "1950-09-21", "birth notes": "Wilmette, Illinois, USA", "_actorID": "95", "_source": "IMDB", "actorID": "0000195", "created_utc_dt": "09/14/2019, 13:02:39"}