{"headshot": "https://m.media-amazon.com/images/M/MV5BNTNlMjg3NWQtZmJlNS00NGU2LWI5NWMtZDk2MGI1YTI4YTVkXkEyXkFqcGdeQXVyMTgyMzY5MTk@._V1_UX67_CR0,0,67,98_AL_.jpg", "height": "5' 10\" (1.78 m)", "mini biography": ["'Benedict Wong' (qv) was born in 1970 in Manchester, England. He is an actor and writer, known for _Doctor Strange (2016)_ (qv), _Avengers: Infinity War (2018)_ (qv) and _The Martian (2015)_ (qv).::Anonymous"], "trivia": ["Frequently appears in space-themed movies. As of 2015, has appeared in four of them: _Sunshine (2007)_ (qv), _Moon (2009)_ (qv), _Prometheus (2012)_ (qv) and _The Martian (2015)_ (qv).", "His parents emigrated from Hong Kong to the UK via Ireland.", "Took a two-year performing arts course at Salford City College.", "Fan of Manchester United.", "Worked as an usher at Manchester's now defunct Green Room Theatre.", "Was brought up in Salford."], "quotes": ["Khan let Polo be his eyes and ears. He was the first one to build a bridge between East and West.", "I'd like to helm my own series. Something British.", "I'm in the loners' society. I don't want to classify myself as anything.", "Bruce Lee has always been a hero of mine, and the choreography in 'Enter The Dragon' is amazing.", "Customer freedom! Don't dictate how I want to watch my TV!", "In America, you're just an American. You're accepted. It doesn't matter that you're of whatever race. If anything, I'm British, and that's it. So let's just get on with it, really.", "In Kazahkstan, you would drive five hours outside the city to where roads sort of stop being roads, and it was just in the mountains and deathly quiet. And you could only really hear the clumping of the horses, and it was a sort of a beautiful silence. Like it enveloped you.", "I feel like we are reintroducing historical figures, with the explorer Marco Polo and the grandson of Genghis Khan, Kublai Khan, the ruler of the Mongol empire, the trading place that everybody wanted to get involved in.", "In terms of representation, television is reflecting an era that has passed. It's the wrong time; it's the wrong period. In all sorts of television, it doesn't feel like the 21st century.", "Occasionally, when you do a take, and - what I kind of sort of like is asking for a PPB - Personal Play Back.", "We watched a lot of Hong Kong action movies in my house when I was growing up.", "Kublai noticed this uncommon perception that Marco Polo has, with the idea to explain and talk about his country so vividly that he can see it.", "It's really hard because obviously people label you as a British East Asian actor. And I'm just from Salford; it's where I was born.", "Ridley Scott is a cinematic master and a great man. It was a real honour working with him on 'Prometheus.'"], "birth date": "1970-00-00", "birth notes": "Manchester, England, UK", "_actorID": "81", "_source": "IMDB", "actorID": "0938950", "created_utc_dt": "09/14/2019, 13:02:27"}