{"headshot": "https://m.media-amazon.com/images/M/MV5BMjE0MDkzMDQwOF5BMl5BanBnXkFtZTgwOTE1Mjg1MzE@._V1_UY98_CR0,0,67,98_AL_.jpg", "nick names": ["Ben"], "birth name": "Benedict Timothy Carlton Cumberbatch", "height": "6' (1.83 m)", "mini biography": ["Benedict 'Timothy Carlton' (qv) Cumberbatch was born and raised in London, England. His parents, 'Wanda Ventham' (qv) and 'Timothy Carlton' (qv) (born 'Timothy Carlton' (qv) Congdon Cumberbatch), are both actors. He is a grandson of submarine commander Henry Carlton Cumberbatch, and a great-grandson of diplomat Henry Arnold Cumberbatch CMG. Cumberbatch attended Brambletye School and Harrow School. Whilst at Harrow, he had an arts scholarship and painted large oil canvases. It's also where he began acting. After he finished school, he took a year off to volunteer as an English teacher in a Tibetan monastery in Darjeeling, India. On his return, he studied drama at Manchester University. He continued his training as an actor at the London Academy of Music and Dramatic Art graduating with an M.A. in Classical Acting. By the time he had completed his studies, he already had an agent.Cumberbatch has worked in theatre, television, film and radio. His breakthrough on the big screen came in 2004 when he portrayed 'Stephen Hawking' (qv) in the television movie _Hawking (2004)_ (qv). In 2010, he became a household name as Sherlock Holmes on the British television series _Sherlock (2010)_ (qv). In 2011, he appeared in two Oscar-nominated films - _War Horse (2011)_ (qv) and _Tinker Tailor Soldier Spy (2011)_ (qv). He followed this with acclaimed roles in the science fiction fiction film _Star Trek Into Darkness (2013)_ (qv), the Oscar-winning drama _12 Years a Slave (2013)_ (qv), _The Fifth Estate (2013)_ (qv) and _August: Osage County (2013)_ (qv). In 2014, he portrayed 'Alan Turing' (qv) in _The Imitation Game (2014)_ (qv) which earned him a Golden Globe, Screen Actors Guild Award, British Academy of Film and Television Arts and an Academy Award nomination for Best Actor in a Leading Role.Cumberbatch was appointed Commander of the Order of the British Empire (CBE) by Queen Elizabeth II in the 2015 Birthday Honours for his services to the performing arts and to charity.Cumberbatch's engagement to theatre and opera director 'Sophie Hunter' (qv), whom he has known for 17 years, was announced in the \"Forthcoming Marriages\" section of The Times newspaper on November 5, 2014. On February 14, 2015, the couple married at the 12th century Church of St. Peter and St. Paul on the Isle of Wight followed by a reception at Mottistone Manor. They have three sons, Christopher Carlton (born 2015), Hal Auden (born 2017), and Finn (born 2019).::Kad"], "spouse": ["'Sophie Hunter' (qv)::(14 February 2015 - present) ( 2 children)"], "trade mark": ["Deep baritone voice", "Piercing blue-green eyes", "Sharp cheekbones", "Often portrays posh upper-class figures", "Usually plays highly-intelligent and gifted characters"], "trivia": ["Received his Master's degree in Classical Acting for the Professional Theatre at the prestigious London Academy of Music and Dramatic Art (LAMDA), United Kingdom's oldest drama school.", "Met Professor 'Stephen Hawking' (qv) twice before filming _Hawking (2004)_ (qv) to prepare for the role. He then subsequently provided the voice of the physicist in \"Into the Universe with 'Stephen Hawking' (qv)\" (2010) and \"'Stephen Hawking' (qv)'s Grand Design\" (2012) which both aired on Discovery Channel.", "Son of actors 'Timothy Carlton' (qv) and 'Wanda Ventham' (qv).", "Attended Harrow, one of the oldest, most-respected and expensive all-male boarding schools in the United Kingdom.", "He experienced a terrifying carjacking in South Africa while filming _To the Ends of the Earth (2005)_ (qv). He wrote about the experience in an article for The Prince's Trust for which he is ambassador.", "Good friends with 'Keira Knightley' (qv), 'Alice Eve' (qv), 'James McAvoy' (qv), 'Tom Hardy' (qv), 'Matthew Goode' (qv), 'Zachary Quinto' (qv) and 'Tom Hiddleston' (qv).", "His character Sherlock Holmes' warm relationship with Mrs. Hudson is influenced by Cumberbatch's own real-life relationship with 'Una Stubbs' (qv), as she is good friends with his mother and she has seen him grow up.", "Is a huge fan of 'Robert Downey Jr.' (qv) with whom he shares the iconic role of Sherlock Holmes.", "Lost a notable amount of weight for his role as Sherlock Holmes, his goal being to portray Holmes as a character with such high intelligence that it manifests itself in a physical, \"mind-over-matter\" sort of way.", "Good friends with 'Jonny Lee Miller' (qv), with whom he shared the central roles of Victor Frankenstein and his Creature in 'Danny Boyle' (qv)'s stage production _Frankenstein (2011)_ (qv). Coincidentally, Miller was cast as Sherlock Holmes in _Elementary (2012)_ (qv) and Cumberbatch has been playing the legendary detective in _Sherlock (2010)_ (qv) since July 2010.", "One of his first ever acting roles was playing Titania, Queen of the Fairies in Shakespeare's comedy \"A Midsummer Night's Dream\" when he was age 13.", "During his gap year, before studying Drama in Manchester University, he spent some time volunteering as an English teacher at a Tibetan Buddhist Monastery in Darjeeling, India. The pupils were mostly Tibetans.", "Painted oil canvases and was a member of the rugby team while he was studying at Harrow.", "In 2012, he won a 'Laurence Olivier' (qv) Award, London Evening Standard Award and Critics' Circle Award for his performance in 'Danny Boyle' (qv)'s stage production _Frankenstein (2011)_ (qv) at the Royal National Theatre wherein he played Victor Frankenstein and his Creature in alternating nights.", "In 2005, he was nominated for a 'Laurence Olivier' (qv) Award for Best Supporting Actor for playing Jørgen Tesman in Henrik Ibesen's play entitled \"Hedda Gabler\".", "Famous for his 'Alan Rickman' (qv) impressions.", "He received one of his earliest reviews when he played Nick Bottom in Shakespeare's comedy \"A Midsummer Night's Dream\". The review says \"Cumberbatch's 'Bottom' will be long remembered\".", "He unexpectedly got dual voice roles on _The Simpsons (1989)_ (qv) when he visited Fox's studio for a completely unrelated appointment. He voiced the United Kingdom's Prime Minister (patterned from 'Hugh Grant' (qv)'s character in _Love Actually (2003)_ (qv)) and did an 'Alan Rickman' (qv) impression to voice Snape for the Special Valentine Episode that aired February 2013.", "Became good friends with 'Gary Oldman' (qv) on the set of _Tinker Tailor Soldier Spy (2011)_ (qv).", "His grandfather, Henry Carlton Cumberbatch, was a decorated submarine officer of both World Wars and a prominent figure of London high society.", "His great-grandfather, Henry Arnold Cumberbatch, was Queen Victoria's Consul General in Turkey and Lebanon, and was a member of the Order of St. Michael and St. George for his services to foreign and Commonwealth affairs.", "Has numerous connections outside the franchise to fellow Star Trek cast members. He played 'Stephen Hawking' (qv), who had previously played himself on an episode of _Star Trek: The Next Generation (1987)_ (qv). He shares the role of Sherlock Holmes with both 'Leonard Nimoy' (qv) and 'Christopher Plummer' (qv). Cast member 'Karl Urban' (qv) appeared in the last two Lord of the Rings films, while Cumberbatch appears in the prequel trilogy based on The Hobbit.", "Three of his roles have connections to 'Leonard Nimoy' (qv). Obviously, Nimoy originated the role of Mr. Spock. He also played Sherlock Holmes on stage, and in the 1970s, released a song called \"The Ballad of Bilbo Baggins\".", "According to ancestry.ca, he is related to famed astronaut Chris Hadfield.", "He always wanted to pursue acting, however he entertained the idea of a law degree because of how hard his parents worked to give him an education. When he discovered that law was just as competitive, he decided to go with his passion.", "Has central heterochromia as well as sectoral heterochromia, the \"groovy\" but harmless genetic mutation that his friend 'James McAvoy' (qv) describes in _X-Men: First Class (2011)_ (qv). Central heterochromia is where each eye has multiple colors - in his case, each has a different but nearly identical combination of blue, green, and gold. Sectoral heterochromia is where one eye has a spot (or sector) of different coloration; his right eye has a brown \"freckle\" of color that, while small, is typical of sectoral heterochromia.", "In 2013, he was included in Entertainment Weekly's New Hollywood feature which listed the \"Top 50 Coolest, Most Creative Entertainers Blowing Up TV, Movies, Music and Books\".", "His female fans were originally known as \"Cumberbitches\", but are now known as the \"CumberCollective\" or \"Cumberpeople\". Cumberbatch is uncomfortable with the term \"Cumberbitches\" because he says its non-inclusive and pejorative.", "Fond of extreme sports like skydiving, hot-air ballooning, scuba diving and snowboarding.", "His voice has been creatively described by journalist Caitlin Moran as a \"jaguar hiding in a cello\". According to a film critic, his voice is \"so sepulchrally resonant, that it could have been synthesized from the combined timbres of 'Ian McKellen' (qv), 'Patrick Stewart' (qv) and 'Alan Rickman' (qv) holding an elocution contest down a well\". The \"jaguar hiding in a cello\" comparison apparently also clicked with the creative people at Jaguar Land Rover Automotive PLC. Cumberbatch voiced several commercials for Jaguar cars.", "In 2013, he was ranked fifth place in the \"Most Fascinating People in Britain\" list of Tatler magazine, ranking higher than the Duchess of Cambridge and just below Queen Elizabeth II.", "He was the cover star of The Hollywood Reporter's \"New A-List\" issue in September 2013.", "Ranked #1 in Empire magazine's \"100 Sexiest Movie Stars\" in 2013.", "Known for donating his own drawings and sketches for charities and fundraisers.", "Graced the cover of Time magazine in October 2013.", "His parents 'Timothy Carlton' (qv) and 'Wanda Ventham' (qv) also played his character's parents on _Sherlock (2010)_ (qv).", "Four out of five films in which he appeared in 2013 received Oscar nominations: _12 Years a Slave (2013)_ (qv), _Star Trek Into Darkness (2013)_ (qv), _August: Osage County (2013)_ (qv) and _The Hobbit: The Desolation of Smaug (2013)_ (qv).", "As of 2015, has appeared in four films that were nominated for the Best Picture Oscar: _Atonement (2007)_ (qv), _War Horse (2011)_ (qv), _12 Years a Slave (2013)_ (qv) and _The Imitation Game (2014)_ (qv). Of those, _12 Years a Slave (2013)_ (qv) is a winner in the category.", "In March 2014, Cumberbatch was included in The Sunday Times' \"100 Makers of the 21st Century\" list citing him as the \"next Sir 'Laurence Olivier' (qv)\".", "In an interview, 'Julie Andrews' (qv) named Cumberbatch as one of the actors she is fond of.", "Named one of Time magazine's 100 Most Influential People in the World. [April 2014]", "Has played two villains named \"Khan\": Khan Noonien Singh in _Star Trek Into Darkness (2013)_ (qv), and the voice of tiger Shere Khan in _Mowgli: Legend of the Jungle (2018)_ (qv).", "Has mostly English ancestry, with small or distant amounts (to varying degrees) of Welsh, Scottish, Cornish, French, Swiss-French, Swedish, German and Dutch. His paternal grandfather, British Royal Navy and submarine commander Henry Carlton Cumberbatch, was born in Izmir, Turkey and his paternal grandmother, Pauline Ellen Laing (Congdon), was born in Bengal, India (their families were English). His great-grandfather, diplomat Henry Arnold/Alfred Cumberbatch, was born in Berdyans'k, Zaporiz'ka oblast, Ukraine, and was Queen Victoria's consul general in Turkey and Lebanon. Henry's own father, Robert William Cumberbatch, was also a diplomat, serving as Consul in the Russian Empire and Ottoman Empire.", "Posted a video of himself accepting the \"Ice Bucket Challenge\" to raise research funds for ALS, also known as \"Lou Gehrig's Disease\". Gehrig is not the only famous person to suffer from this disease: it also affects 'Stephen Hawking' (qv), whom Cumberbatch has played.", "Has an older half-sister, Tracy Tabernacle, now Tracy Peacock, from his mother's first marriage to James Tabernacle.", "Traditionally announced his engagement to theatre director partner 'Sophie Hunter' (qv), who he has known for 17 years, in the \"Forthcoming Marriages\" section of The Times newspaper. He presented her with a 3.5 carat, Edwardian-inspired cushion-cut, yellow diamond ring adorned with a hundred smaller diamonds all around the head, bezel and shank. Its estimated value is $450,000. [November 2014]", "Graced the cover of Time magazine for the second time in November 2014.", "Benedict's favorite filmmakers are 'Stanley Kubrick' (qv), 'Michael Winterbottom' (qv), 'Steven Soderbergh' (qv), 'John Hughes' (qv) and 'Alfred Hitchcock' (qv).", "Benedict's favorite movies include _Ghostbusters (1984)_ (qv), _Annie Hall (1977)_ (qv), _2001: A Space Odyssey (1968)_ (qv), _Singin' in the Rain (1952)_ (qv), _Wings of Desire (1987)_ (qv), _Bicycle Thieves (1948)_ (qv), _Badlands (1973)_ (qv), _Elephant (2003)_ (qv), _The Shining (1980)_ (qv), _Let the Right One In (2008)_ (qv), _Zoolander (2001)_ (qv), _Withnail & I (1987)_ (qv), _Brief Encounter (1945)_ (qv), _I Am Love (2009)_ (qv), _Michael Clayton (2007)_ (qv), _A Prophet (2009)_ (qv), _The Bourne Identity (2002)_ (qv), _The Bourne Supremacy (2004)_ (qv), _The Bourne Ultimatum (2007)_ (qv) and _Inception (2010)_ (qv).", "Benedict's favorite television series include _The Wire (2002)_ (qv), _The Office (2005)_ (qv), _The West Wing (1999)_ (qv), _Mad Men (2007)_ (qv), _The Sopranos (1999)_ (qv), _Breaking Bad (2008)_ (qv) and _The Killing (2011)_ (qv).", "Cumberbatch married theatre director partner 'Sophie Hunter' (qv) at the 12th century Church of St. Peter and St. Paul on the Isle of Wight followed by a reception at Mottistone Manor. [February 2015]", "'Benedict Cumberbatch' (qv) is good friends with 'Eddie Redmayne' (qv). Both actors have portrayed Professor 'Stephen Hawking' (qv) in different productions: Cumberbatch in _Hawking (2004)_ (qv), and Redmayne in _The Theory of Everything (2014)_ (qv). Both actors also received their first Academy Award nominations together, playing real life characters: Redmayne for his role as 'Stephen Hawking' (qv) in _The Theory of Everything (2014)_ (qv), and Cumberbatch for his role as 'Alan Turing' (qv) in _The Imitation Game (2014)_ (qv).", "Cumberbatch and 'Alan Turing' (qv), who he portrays in _The Imitation Game (2014)_ (qv) are actually related in real-life. According to the family history site Ancestry, the two are 17th cousins with family relations dating back to the 14th century. Both are said to be related to John Beaufort, the first Earl of Somerset, through Cumberbatch and Turing's respective paternal lines.", "His fragrance of choice is Eau de Monsieur by Annick Goutal.", "On the day before filming the pilot of _Sherlock (2010)_ (qv), his hair turned green due to the dye used to turn his hair black. Thankfully, his hair was fixed and the filming went on as planned.", "He was awarded the CBE (Commander of the Order of the British Empire) in the 2015 Queen's Birthday Honours List for his services to the performing arts and to charity. He is an actor in London, England.", "In the episode _Sherlock: A Scandal in Belgravia (2012)_ (qv), Sherlock Holmes encounters Irene Adler. Coincidentally, Irene is 'Sophie Hunter' (qv), his wife's middle name.", "Good friends with 'Robert Rinder' (qv), whom he met while they were both students at the University of Manchester. He officiated at Rinder's marriage to his partner after being ordained by the Universal Life Church. In return, Rinder was one of three best men at his wedding to 'Sophie Hunter' (qv).", "Before he became a household name, Benedict appeared with 'Felicity Jones' (qv) and 'David Tennant' (qv) in a BBC Radio 4 adaptation of 'Jane Austen' (qv)'s \"Mansfield Park\" (2003).", "Nominated for the 2018 Emmy Award in the Lead Actor in a Limited Series or Movie category for his role as Patrick Melrose in _Patrick Melrose (2018)_ (qv), but lost to 'Darren Criss' (qv).", "Nominated for the 2019 Golden Globe Award in the Best Performance by an Actor in a Limited Series or a Motion Picture Made for Television category for his role as Patrick Melrose in _Patrick Melrose (2018)_ (qv), but lost to 'Darren Criss' (qv) for _American Crime Story (2016)_ (qv).", "Has three sons with his wife 'Sophie Hunter' (qv): Christopher Carlton Cumberbatch (born June 1, 2015), Hal Auden Cumberbatch (born March 3, 2017) and Finn Cumberbatch (born January 11, 2019).", "In June 2016, Cumberbatch, along with Sir 'Patrick Stewart' (qv), guided more than 280 figures for the arts world who backed the vote to remain in the European Union (EU) for the 2016 United Kingdom membership referendum.", "Born on the same date as 'Vinessa Shaw' (qv)."], "quotes": ["[on 'Stephen Hawking' (qv)] He's such a presence and you have to really know what you want to say to him or ask him because it takes such a huge, phenomenal effort for him to communicate with you. You think, \"I really don't want to waste this man's time.\" I was myself rather than thinking, \"I'm a stupid actor; how on earth can I impress someone like this? I don't know what to say to make me feel worthy of playing this man.\".", "Cumberbatch - it sounds like a fart in a bath, doesn't it? What a fluffy old name. I can never say it on a Monday morning. When I became an actor, Mum wasn't keen on me keeping it.", "I am very flattered. I have also become a verb as in \"I have cumberbatched the UK audience\" apparently. Who knows, by the end of the year I might become a swear word too! It's crazy and fun and very flattering.", "It's the standard actors' joke - \"What are you doing after this?\" \"Oh, if Spielberg doesn't call then I'm going to go on holiday.\" But a week after I'd said that, I got the call to say I had the job. It's one of those moments you never forget - I just fell off my chair. Which is not a good start to the horseriding.", "[on being invited by 'Madonna' (qv) to her London home to discuss playing 'Duke of Windsor' (qv) (aka \"Edward VIII\") in _W.E. (2011)_ (qv)] I'd whizzed round on my bike and thought we were going to have a read-through and a chat, but she wanted a full-on dress rehearsal... So I ended up in a suit and tie with 'Madonna' (qv) operating the camera herself.", "[on initially using his father's stage name \"Carlton\"] When I started, I just assumed I couldn't be called 'Benedict Cumberbatch' (qv)... but then, one day, I told someone in the business what I was really called and they said, \"That's great, that's something you can use to stand out.\".", "[on his _Sherlock (2010)_ (qv) series] It's a rare challenge, both for the audience and an actor, to take part in something with this level of intelligence and wit. You have to really enjoy it. It's a form of mental and physical gymnastics.", "I've been very lucky at what's happened in my career to date, but playing something as far from me as possible is an ambition of mine - anything from a mutated baddy in a comic book action thriller, to a detective. If anything, I'd like 'Gary Oldman' (qv)'s career: he's the perfect example of it. I've love to have a really broad sweep of characters - to be able to do something edgy, surprising and unfashionable. (May 2005)", "[on 'Martin Freeman' (qv) playing Bilbo Baggins] It was great. I got to hang out with him, and I kept a straight face for a bit and then I started giggling because I know Martin, I don't know Bilbo. For Martin to be sitting there playing Bilbo is amazing. He's going to be amazing, he's going to be fantastic in this film.", "[on _Sherlock (2010)_ (qv) fan-fiction] I suppose my bodily proportions are quite flattering. I'm ripped, doing something I wouldn't normally do with my body, or having done to it, involving Watson. So that's as far as I'll hit about that one, but it's all there on the Web if you want to find it. I was amazed at the level of artistry; people have spent hours doing it. And there's some really weird cross breeding stuff that goes on. The news got out that I was playing Smaug in \"Hobbit\" and suddenly there were lots of dragons with purple scarves flying around so it's crazy, it's crazy.", "[on declining to reprise his much-acclaimed role in \"After the Dance\" on Broadway] I've never really made a head-over-heart decision like that before but there's a bit of momentum and I'd like to keep myself available for films. (September 2011)", "I've seen and swam and climbed and lived and driven and filmed. Should it all end tomorrow, I can definitely say there would be no regrets. I am very lucky, and I know it. I really have lived 5,000 times over. (May 2013)", "[on his role in _Star Trek Into Darkness (2013)_ (qv)] I don't really believe in good and evil. I don't really believe in heroes and villains. His reasons for what he does are quite profoundly persuasive. One man's terrorist is another man's freedom fighter, and the fact that he's a shadow self of Kirk - same coin, different sides - is what makes him interesting to play.", "[his advice from co-star 'Meryl Streep' (qv)] I asked her how she approached the multiple layers of her part. And she said, \"I don't know. I don't have a process. It changes with every job, doesn't it?\" And I thought, \"Oh, thank God, to hear her say it. This whole thing about technique or method? It's bullshit.\" People say, \"Oh, you're so precise.\" But within that I work very hard to give every part a heartbeat. I learned a lot from just watching Meryl in repose. It was a bit like a Sherlock deduction actually.", "[his would-be response to 'Julian Assange' (qv) about movie portrayal of him] Well, somebody is going to do it, wouldn't you rather it's someone who has your ear, who could steer the film to a place that's more accurate or balanced? The tabloid image of him, what he fears is going to be promoted - that weird, white-haired guy wanted for rape - is so far from what we did.", "[on his Hobbit character] It was publicized that I 'voice' Smaug, and I thought, \"Fucking hell. My voice, my motions - I worked my arse off to create that dragon!\".", "I can tell you I'm a huge fan of _Downton Abbey (2010)_ (qv) and what I said was quite, quite clearly - to most intelligent New York Times readers - a joke. [on the comments he made about _Downton Abbey (2010)_ (qv) on the New York Times]", "Sometimes as an actor you're looking for the infinite. If you can hold that, if you can remember that in the chaos, [it will] anchor you and give you grace and ease.", "Worst thing about my profession? The press, obviously. Don't write that, eh?", "[on _Downton Abbey (2010)_ (qv), interviewed on Reader's Digest, 16 August 2012] We're remembering that there was a world before the First World War. We're living in a culture now that's revering, or having a nostalgia trip with, the beginning of the 1900s. Although Downton traded a lot on the sentiment in the last series... but we won't talk about that series because it was, in my opinion, f***ing atrocious.", "[on being abducted in South Africa in 2005] It taught me that you come into this world as you leave it, on your own. It's made me want to live a life slightly less ordinary.", "I don't live beyond my means. I enjoy luxury and I enjoy the privilege of it, when I can afford it, and I'm in the situation where it's been given to me, but I'm very conscious of what is wasteful.", "I've always had an eye on longevity; I've got loads more goals to achieve. It's not like I've completely conquered the whole thing. That's a lifetime's objective, not an overnight thing.", "[on delivering a successful performance] It's rather like a sportsman, where you hit a sweet spot and think, \"Oh, that felt good.\" You don't necessarily know why it is. It's pretty fleeting, and I guess that's how it should be, because the minute you try to hold on to it, it's too precious, and you start to try to reinvigorate the ghost of what you've done rather than keep evolving it.", "Every time I'm seen at a bar with a girl, I get photographed. Anyone who has a computer knows my entire dating history. I get it. Paparazzi is an inescapable, immovable obstacle.", "The rule of law is being overrun so fast, eroding our civil liberties in a way that fundamentalists could possibly cherish. Yet there is a very real threat, for the other liberty that we could have taken away is our life, at any point, through the act of terrorism. I think intelligence services have really struggled post-Iraq with credibility, and I feel for them to a certain degree. They are trying to protect our right to exist.", "I've never been an activist, but I've always been politically aware. I protested against budget cuts and cuts to education. I marched against the Iraq war. All that protesting was just swept aside to pave the way for an illegal war, and the results of that war were made very, very plain by those leaked war logs.", "[on The Hobbit] Growing up, my dad read it to me, and it was a real treat, a feast for a child's imagination. He did an amazing Smaug, and hobbits, and Gandalf as well - it's the audiobook that will never exist.", "The only thing that may unite all forms of acting in a sense is no matter what preparation you do, no matter what transformative process you go through, you are always yourself. You are always inside your own skin - you are who you are no matter what the actions of the movement or the effect. You have to have an essential element of you, and that is also what is in the present. Once you're in the present and you're not worried about the wig, or the special-effects suit, or the dialogue, or the accent, or the moral responsibility, when you are lost in the moment and you're in the present is when the stuff that's really good comes on screen. Until that point, you've put in a lot of hard work to then let go, and all of us experience moments - and they're rare in every job I find - where you feel free of any kind of self-consciousness.", "[on 'Alan Turing' (qv)'s royal pardon] The only person that should be pardoning anybody is him. Hopefully, the film will bring to the fore what an extraordinary human being he was and how appalling (his treatment by the government was). It's a really shameful, disgraceful part of our history.", "Hollywood-style stardom was never my goal, yet it seems to be happening due to particular projects. I don't seek. I don't avoid. I just follow my path, doing my best.", "[on his look] It's the blessing of having a weird face - somewhere between an otter and something people find vaguely attractive.", "[on fame] You can't imagine fame. You can only ever see it from an outsider and comment on it with the rueful wisdom of a non participant. When it happens to you, it doesn't matter what age or how, it is a very steep learning curve. The important thing to realize in all of it is that life is short, to protect the ones you love, and not expose yourself to too much abuse or narcissistic reflection gazing and move on. If fame affords me the type of ability to do the kind of work I'm being offered, who am I to complain about the downsides. It's all relative. And this are obviously very high class problems. The way privacy becomes an every shrinking island is inevitable but also manageable and it doesn't necessary have to get that way.", "[on _The Imitation Game (2014)_ (qv)] Often, as an actor, you draw on your own experience or memories, but I really didn't have to here. [Turing] got under my skin. It was just so pitiful. Imagining the physical weakness, the vulnerability, the exhaustion, how the hormones affected his emotional state. It was all ungovernable.", "What matters to me is the quality and the variety of the work. I'm in it for the long game. I'm interested in working in 40 years' time, and turning round and talking to an actor on set and telling them stories about working with 'Judi Dench' (qv) and 'Michael Gambon' (qv). So any talk of \"man of the moment\" hype, heat, whatever, I just smile wryly. It's the same shit with \"sexiest whatever\" - I was around 10 years before that as an actor and no one took the same face seriously. It's all projection.", "People say, \"This is your moment.\" Well, I hate to say it, but I don't believe in moments. I don't believe in one-offs. I believe in something continuing and continuing, and I want to be doing this job for the next 50 years if I live that long.", "It's an amazing thing to find somebody you love, let alone somebody who loves you back in the same way and degree. Not everyone can do that in a lifetime. It's a minor miracle, considering how busy Sophie (Hunter) and I are, that we met in this way. So Sophie is someone I am incredibly grateful for and very excited about.", "[on selfies] What a tragic waste of engagement. Enjoy the moment. Do something more worthwhile with your time, anything. Stare out the window and think about life.", "I'm a homebody. I love to stay in at night, light a fire, have a whiskey and watch a movie or read a good book.", "People forget about books. They're always just turning on the television, but reading a good book is the most nourishing thing you can do.", "[on what he learned in 2014] I learnt where my home is. I learnt where my heart is, where my center is, where my now and forevermore is, and she's called 'Sophie Hunter' (qv), my fiancée.", "[on the character Christopher Tietjens in _Parade's End (2012)_ (qv)] What makes him heroic is the idea that he stands for what he believes in with utter transparency, and to hell with the consequences of living by what he believes.", "[on _The Fifth Estate (2013)_ (qv)] So many people I speak to say, \"Oh, I really wanted to see that.\" So maybe people weren't aware of it?... I don't know. I'm not in publicity or marketing. That's them, I just do what I do. I was very pleased with that film and I think over time it will be seen. But I don't offer any understanding for why that happened... I don't regret it. You can't wish you hadn't done something after doing it.", "[on his offensive faux pas of using the term \"colored actors\" instead of \"actors of color\" in an interview] I'm devastated to have caused offence by using this outmoded terminology. I offer my sincere apologies. I make no excuse for my being an idiot and know the damage is done. I can only hope this incident will highlight the need for correct usage of terminology that is accurate and inoffensive. The most shaming aspect of this for me is that I was talking about racial inequality in the performing arts in the UK and the need for rapid improvements in our industry when I used the term. I feel the complete fool I am and while I am sorry to have offended people and to learn from my mistakes in such a public manner please be assured I have. I apologize again to anyone who I offended for this thoughtless use of inappropriate language about an issue which affects friends of mine and which I care about deeply.", "[on the need for a female and then a homosexual president in the United States] You need to have a female president next, and then after that, a gay president. That's the full journey from Obama's legacy onwards. There's a great 'Morrissey' (qv) lyric from \"America Is Not the World\" from You Are the Quarry that goes, \"In America, the land of the free, they said / And of opportunity, in a just and truthful way / But where the president is never black, female or gay, and until that day / You've got nothing to say to me, to help me believe.\" It's quite an old song from before Obama took office, but you've done black, then you need to do female, then the next, gay.", "Like all of these things, like a lot of art, you do the work and you let go. You understand how the thing works and then you let go of it. It should be something you breathe or you feel, not something that you force or try to control. Looking for happiness is a sure way to sadness, I think. You have to take each moment as it comes.", "What fascinates me about a character's suffering is that my own life experiences are far removed from those of my characters and, thankfully, the opposite. It's part of an actor's job to be interested in psychology. However, my knowledge about what drives and motivates human beings in life is still quite immature. I continue to learn and don't have all the answers. These roles inspire me to become a better and more honest human being - whatever that means.", "I think it's deadly to judge your character if you're portraying someone. You have to inhabit it with a certain amount of understanding or empathy, or sympathy or whatever you want to call it. And to fulfill that, it's not about coming down on sides. It's not about journalistic headlines, or black-and-white truth versus fiction, or good against evil - it's much more complex than that.", "I've given up smoking. Although I shouldn't say that, because if I ever have a cigarette again and it'll be all over the place, 'Oh he lied.' But, touch wood, I haven't smoked for a month now and it's really helping."], "birth date": "1976-07-19", "birth notes": "Hammersmith, London, England, UK", "_actorID": "37", "_source": "IMDB", "actorID": "1212722", "created_utc_dt": "09/14/2019, 13:01:46"}