{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQ1NTQwMTYxNl5BMl5BanBnXkFtZTYwMjA1MzY1._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Sam", "King of Cool", "Mr Cool"], "birth name": "Samuel Leroy Jackson", "height": "6' 2½\" (1.89 m)", "mini biography": ["'Samuel L. Jackson' (qv) is an American producer and highly prolific actor, having appeared in over 100 films, including _Die Hard with a Vengeance (1995)_ (qv), _Unbreakable (2000)_ (qv), _Shaft (2000)_ (qv), _Formula 51 (2001)_ (qv), _Black Snake Moan (2006)_ (qv), _Snakes on a Plane (2006)_ (qv), and the Star Wars prequel trilogy (1999-2005), as well as the Marvel Cinematic Universe.Samuel Leroy Jackson was born in Washington, D.C., to Elizabeth (Montgomery) and Roy Henry Jackson. He was raised by his mother, a factory worker, and his grandparents. At Morehouse College, Jackson was active in the black student movement. In the seventies, he joined the Negro Ensemble Company (together with 'Morgan Freeman' (qv)). In the eighties, he became well-known after three movies made by 'Spike Lee' (qv): _Do the Right Thing (1989)_ (qv), _Mo' Better Blues (1990)_ (qv) and _Jungle Fever (1991)_ (qv). He achieved prominence and critical acclaim in the early 1990s with films such as _Patriot Games (1992)_ (qv), _Amos & Andrew (1993)_ (qv), _True Romance (1993)_ (qv), _Jurassic Park (1993)_ (qv), and his collaborations with director 'Quentin Tarantino' (qv), including _Pulp Fiction (1994)_ (qv), _Jackie Brown (1997)_ (qv), and later _Django Unchained (2012)_ (qv). Going from supporting player to leading man, his performance in _Pulp Fiction (1994)_ (qv) gave him an Oscar nomination for his character Jules Winnfield, and he received a Silver Berlin Bear for his part as Ordell Robbi in _Jackie Brown (1997)_ (qv). Jackson usually played bad guys and drug addicts before becoming an action hero, co-starring with 'Bruce Willis' (qv) in _Die Hard with a Vengeance (1995)_ (qv) and 'Geena Davis' (qv) in _The Long Kiss Goodnight (1996)_ (qv).With Jackson's permission, his likeness was used for the Ultimate version of the Marvel Comics character, Nick Fury. He later did a cameo as the character in a post-credits scene from _Iron Man (2008)_ (qv), and went on to sign a nine-film commitment to reprise this role in future films, including major roles in _Iron Man 2 (2010)_ (qv), _The Avengers (2012)_ (qv), _Captain America: The Winter Soldier (2014)_ (qv) and _Avengers: Age of Ultron (2015)_ (qv) and minor roles in _Thor (2011)_ (qv) and _Captain America: The First Avenger (2011)_ (qv). He has also portrayed the character in the second and final episodes of the first season of the TV show, Marvel's _Agents of S.H.I.E.L.D. (2013)_ (qv). He has provided his voice to several animated films, television series and video games, including the roles of Lucius Best / Frozone in Pixar's film _The Incredibles (2004)_ (qv), Mace Windu in _Star Wars: The Clone Wars (2008)_ (qv), Afro Samurai in the anime television series _Afro Samurai (2007)_ (qv), and Frank Tenpenny in the video game _Grand Theft Auto: San Andreas (2004)_ (qv).::wladimir van Heemst and Pedro Borges"], "spouse": ["'LaTanya Richardson Jackson' (qv)::(18 August 1980 - present) ( 1 child)"], "trade mark": ["Deep authoritative voice", "Rebellious characters who are disliked or considered strange by others in the story", "Often plays police officers or government officials. Both prone to intimidation or violence", "Often plays very wise and intelligent characters with great capacities for violence", "Frequently plays tough characters who swear a lot", "Frequent swearing", "Often sports a moustache or goatee in his films", "Shaven head", "Kangol hats", "Often plays hotheaded characters with a fiery temper", "Often shouts the word 'motherf*****' at some point in a film", "Frequently cast by 'Quentin Tarantino' (qv)"], "trivia": ["Daughter - 'Zoë Jackson' (qv) (b. 1982).", "One of Jackson's jobs as a struggling actor in New York was as a doorman at the popular Manhattan Plaza subsidized apts, home to hundreds of actors and artists, including 'Giancarlo Esposito' (qv), who co-starred with Jackson in _Amos & Andrew (1993)_ (qv).", "Ranked #44 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Was an admitted drug user until he completed drug rehab two weeks before playing a drug addict in _Jungle Fever (1991)_ (qv).", "Accomplished at playing brass instruments (french horn, trumpet) in school symphony orchestras from grade 3 to grade 12.", "Graduated from Morehouse College in Atlanta, Georgia in 1972.", "Was offered his role in _Star Wars: Episode I - The Phantom Menace (1999)_ (qv) after mentioning in an interview on UK television show _TFI Friday (1996)_ (qv) that he would really like to work with 'George Lucas' (qv).", "Daughter 'Zoë Jackson' (qv) attends Vassar College. [January 2002]", "Briefly suspended in 1969 from Morehouse College after taking hostage several members of the board of trustees, including the father of the Reverend Dr. 'Martin Luther King' (qv), during a protest of the failure of the university to have black trustees or a black studies program.", "Worked as a camera stand-in for 'Bill Cosby' (qv) during the filming of _The Cosby Show (1984)_ (qv).", "His character from _Pulp Fiction (1994)_ (qv), Jules Winnfield, ranked second in the \"coolest movie characters of all time\", in a poll by the UK's Empire Magazine (the winner was Tyler Durden of _Fight Club (1999)_ (qv)).", "In 2003, he spoke out against rappers turned actors, saying that as a classically trained thespian it was not his job to lend credibility to rappers by appearing in movies with them. But in reality, he has worked with more rappers than most actors in Hollywood, eleven times as of this writing: _Juice (1992)_ (qv) ('Tupac Shakur' (qv) and 'Queen Latifah' (qv)), _Menace II Society (1993)_ (qv) ('MC Eiht' (qv)), _One Eight Seven (1997)_ (qv) ('Method Man' (qv)), _Deep Blue Sea (1999)_ (qv) ('LL Cool J' (qv)), _Shaft (2000)_ (qv) ('Busta Rhymes' (qv)), _S.W.A.T. (2003)_ (qv) ('Eve' (qv) and 'LL Cool J' (qv)), _xXx: State of the Union (2005)_ (qv) ('Ice Cube' (qv) and 'Xzibit' (qv)), _Black Snake Moan (2006)_ (qv) ('David Banner' (qv)) and _Home of the Brave (2006)_ (qv) ('50 Cent' (qv)).", "His characters often feature the color purple: Mitch Hennessy wore a purple-violet gem ring in _The Long Kiss Goodnight (1996)_ (qv), Mr. Glass wore purple clothing in _Unbreakable (2000)_ (qv); Jackson chose to have Doyle Gipson wear a purple hat in _Changing Lanes (2002)_ (qv); Mace Windu, upon request by Jackson to 'George Lucas' (qv), wielded a purple lightsaber in _Star Wars: Episode II - Attack of the Clones (2002)_ (qv) and _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv); and Lazarus, his character in _Black Snake Moan (2006)_ (qv), plays a purple Gibson guitar.", "The commencement speaker at daughter 'Zoë Jackson' (qv)'s graduation from Vassar College (May 2004).", "Is an avid golfer.", "Was the first choice for \"Fallon\" in _Judgment Night (1993)_ (qv).", "He suffered from a stutter while growing up. A speech therapist suggested he audition for a play and it might help his speech. It did and he changed his major.", "One of the late bloomers of Hollywood, he was already 46 years old when _Pulp Fiction (1994)_ (qv) premiered and has acted in an average of 3-4 films a year since.", "Says that people who recognize him often mistake him for 'Laurence Fishburne' (qv) and vice versa.", "Hosted the 1998 MTV Movie 'Awards' (qv) (1998).", "Was an usher at Dr. 'Martin Luther King' (qv) Jr.'s funeral.", "His performance as Jules Winnfield in _Pulp Fiction (1994)_ (qv) is ranked #41 on Premiere Magazine's 100 Greatest Performances of All Time (2006).", "Made Forbes Celebrity 100 list in 2002 and 2003 with earnings of $34 million and $30 million respectively.", "Member of the jury at the Cannes Film Festival in 2006.", "To date (2006), his films have grossed more money at the box office than the work of any other actor in cinematic history.", "The success of _The Incredibles (2004)_ (qv) enabled Jackson to surpass 'Harrison Ford' (qv) as the actor whose movies have grossed the most money in the world - in excess of $3 billion. (January 2005). Though in 2016, Ford re-surpassed him due to the massive success of _Star Wars: Episode VII - The Force Awakens (2015)_ (qv).", "Before superstardom, he played a very minor role in _Goodfellas (1990)_ (qv), starring 'Robert De Niro' (qv). After superstardom, he co-starred in _Jackie Brown (1997)_ (qv), this time with 'Robert De Niro' (qv) playing a supporting role.", "During filming of _Black Snake Moan (2006)_ (qv), grew close with co-star 'Christina Ricci' (qv). The two remain good friends to this day.", "Was member of the dramatic jury at the Sundance Film Festival in 1995.", "His _Pulp Fiction (1994)_ (qv) diner scene with 'John Travolta' (qv), was re-enacted by Dark Horse Comics' mid-2000 issue of \"Star Wars Tales\". In it (with modifications), his Mace Windu character talks about the Jedi Academy and current Senate politics with Master Yoda, during a meal on Coruscant.", "Gave his consent for Marvel Comics to design their \"Ultimate\" version of the character Nick Fury after his likeness. He later went on to play Nick Fury in _Iron Man (2008)_ (qv).", "In real life, he was once a New York high-rise doorman, in _1408 (2007)_ (qv), he was a New York high-rise manager.", "He participated in Model United Nations during his years in school.", "Has the rare distinction of having played characters that have been eaten by both a shark and a dinosaur.", "Is an Anglophile, being fond of English culture and England in general.", "Like 'Christopher Walken' (qv), he makes films for the pleasure he gets out of acting, regardless of how the film turns out.", "While visiting Rio de Janeiro, Brazil in 2003, he stayed at the world-famous Copacabana Palace Hotel.", "Beverly Hills neighbors include, 'Denzel Washington' (qv), 'Eddie Murphy' (qv), 'Sylvester Stallone' (qv), 'Rod Stewart' (qv), 'Britney Spears' (qv), 'Mariah Carey' (qv), 'Prince' (qv), 'David Beckham' (qv) and 'Victoria Beckham' (qv), etc.", "Due to his prominent stature within the film industry, he is accorded a clause in all his movie contracts that guarantees him easy access to golf courses, no matter where the location shoot happens to be.", "Is a fan of the Atlanta Falcons football club. He appears in their \"Rise Up\" campaign (2010).", "The Jury of the Cannes Film Festival were so impressed with his performance as Gator in _Jungle Fever (1991)_ (qv), that they decided to recreate the rare Best Supporting Actor category in that year, honoring him with the award. To date (2016), he's one of the few actors to receive the honor along with 'Jack Thompson' (qv) for his performance in _Breaker Morant (1980)_ (qv) and 'Ian Holm' (qv) for his role in _Chariots of Fire (1981)_ (qv).", "Auditioned for a role in _Mississippi Burning (1988)_ (qv), but director 'Alan Parker' (qv) told him he did not sound Southern, even though he was raised in Chattanooga, Tennessee.", "Growing up, his idol was 'Errol Flynn' (qv) and dreamed about being a movie swashbuckler someday.", "Son of 'Elizabeth Jackson' (qv).", "In a 2012 interview with \"Nuts\" magazine, he cites _The Long Kiss Goodnight (1996)_ (qv) as a favorite film.", "The Guinness World Records named 'Samuel L. Jackson' (qv) as the highest-grossing film actor of all time, taking in more than $7.4 billion at the box-office. The residuals alone earn him about $300,000 a year.", "He was awarded a Star on the Hollywood Walk of Fame at 7020 Hollywood Boulevard in Hollywood, California on June 16, 2000.", "He originally intended to become a marine biologist before discovering acting in college.", "Although he had been acting in small roles and in theatre productions, it was not until he was 40 years old that he received his first major role in _Do the Right Thing (1989)_ (qv) and he was 45 when he became a star with _Pulp Fiction (1994)_ (qv).", "Has appeared in four films with 'Bruce Willis' (qv): _Loaded Weapon 1 (1993)_ (qv), _Pulp Fiction (1994)_ (qv), _Die Hard with a Vengeance (1995)_ (qv) and _Unbreakable (2000)_ (qv).", "Has appeared with 'Brad Dourif' (qv) in four films: _Ragtime (1981)_ (qv), _The Exorcist III (1990)_ (qv), _Jungle Fever (1991)_ (qv) and _Amos & Andrew (1993)_ (qv).", "He has made four films with 'Natalie Portman' (qv): _Star Wars: Episode I - The Phantom Menace (1999)_ (qv), _Star Wars: Episode II - Attack of the Clones (2002)_ (qv), _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv) and _Thor (2011)_ (qv).", "Selected _What's New Pussycat (1965)_ (qv) for the AFI's book, \"Private Screenings\", as the movie that influenced him most.", "Considers himself a close friend and admirer of British actor 'Michael Caine' (qv). The two have collaborated together on a couple of projects, including _A Shock to the System (1990)_ (qv) and _Kingsman: The Secret Service (2014)_ (qv).", "Highest grossing Black actor of all time, with over $4.6 billion brought to the box office.", "Is great friends with British actor 'Simon Pegg' (qv).", "Has appeared in a movie with each of the men that played Batman on the big screen. He appeared in _Jackie Brown (1997)_ (qv), _Out of Sight (1998)_ (qv), _The Other Guys (2010)_ (qv), and _RoboCop (2014)_ (qv) with 'Michael Keaton' (qv). He was in _True Romance (1993)_ (qv) with 'Val Kilmer' (qv). In _Shaft (2000)_ (qv), he shared the screen with 'Christian Bale' (qv). He was in _Changing Lanes (2002)_ (qv) with 'Ben Affleck' (qv) and he even appeared in _The New Age (1994)_ (qv) with 'Adam West' (qv).", "In _Coming to America (1988)_ (qv) he portrays a robber knocking off a restaurant (McDowell's) and calls one of the employees ('Louie Anderson' (qv)) \"fatboy\". In _Pulp Fiction (1994)_ (qv) he calls a restaurant employee \"fatman\" while it's being robbed.", "Is an avid Liverpool FC supporter and fan after his work in the city on 51st State (Formula 51) and often tweets on twitter when they win a game with simply 'Liverpoooool'.", "Ranked 2nd highest grossing actor of all time with all his previous films grossing a total of $ 4.6 billion.[February 2016].", "A fan of Judge Judy.", "As opposed to other actors and actresses he enjoys watching his own movies.", "Friends with 'Denzel Washington' (qv), 'Magic Johnson' (qv), and 'Alan Alda' (qv).", "Appeared in three Oscar Best Picture nominees: _Goodfellas (1990)_ (qv), _Pulp Fiction (1994)_ (qv) and _Django Unchained (2012)_ (qv), and was a narrator in a fourth _Inglourious Basterds (2009)_ (qv).", "Is once again the highest grossing actor of all time at $5.4 billion at the box office. [April 2018].", "Some of Samuel's golfing buddies include, 'Anthony Anderson' (qv), 'Don Cheadle' (qv), 'Johnny Gill' (qv) and 'Barry Bonds' (qv), all members of the MountainGate Country Club in Los Angeles.", "He has appeared in five films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _Do the Right Thing (1989)_ (qv), _Goodfellas (1990)_ (qv), _Jurassic Park (1993)_ (qv), _Pulp Fiction (1994)_ (qv) and 'Eve' (qv)'s Bayou (1997).", "Son of Elizabeth and Roy Henry Jackson. He was raised by his mother and maternal grandparents, Pearl (Brown) and Edgar Montgomery."], "quotes": ["[When asked about his character in _Star Wars: Episode I - The Phantom Menace (1999)_ (qv)] \"He's black.\"", "[on the subject of his character's inevitable death in _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv)] \"I don't mind dying, I just don't wanna go out like some punk.\"", "People mistake me for 'Laurence Fishburne' (qv) all the time. And he always gets mistaken for me. (And why not? We've both starred in 'Spike Lee' (qv) movies, haven't we?) 'Eve' (qv)n when we're standing together, people have called him by my name and me by his. A woman recently ran up to him and said, 'My daughter loved you in _Pulp Fiction (1994)_ (qv)! Could she have your autograph?' So he signed it, 'Respectfully yours, Samuel Jackson.'", "To be frank, I am as passionate about golf as I am about acting. I very seldom get angry at golf. The year I started golf I had a caddie and one day I did get angry with myself and threw a club. My caddie told me, 'You're not good enough to get mad'. I have never thrown a club since. I enjoy my golf, it does not matter whether I play great or badly. I let it go.", "I've played Loch Lomond - that's the one with the bogs isn't it? I played the one with the lighthouse. When we were in Liverpool we used to take the ferry and go to Northern Ireland. Films get in the way of my golf, but they have afforded me the chance to play a lot of golf.", "On playing Othello - \"I didn't realise how much I hated that play until I agreed to do it. I don't mind Shakespeare so much, but I really hate Othello. Here was a guy who had been all over the world, kicking ass, looting, plundering and probably raping the baddest babes on the planet. Then he falls in love with some teenager and loses his fucking mind. I don't like that idea at all. I mean, how stupid was he?\"", "People shout at me \"Hey, loved that _The Matrix (1999)_ (qv), man!\" Yeah - me too. I was actually on a plane last year and this guy sat down next to me. Finally, he said something to me, and we started talking about _Pulp Fiction (1994)_ (qv). He couldn't remember the actor's name, so I tried to help and said \"I think it might have been Samuel Jackson.\" He jumped in \"No, no, it's the other guy, that Fishburne guy\". We rode the whole flight having that conversation and then, right at the end, he looked hard at me and said, \"You sure look familiar, you're sure you're not 'Laurence Fishburne' (qv)?\" I said \"No, and I definitely am not in _Pulp Fiction (1994)_ (qv), either\".", "I think everyone who says they don't like watching themselves in movies should stop lying.", "People like the Ezekiel speech. I have to say that speech about three times a week to people, just to prove that I still know it.", "I was a square for so long and it totally amazes me that people think I am cool.", "[on how his look was created in _Pulp Fiction (1994)_ (qv)] \"'Quentin Tarantino' (qv) wanted Jules to have a big afro. He sent this PA out to buy a wig. She went to South Central and bought this jeri-curl wig. And Quentin was going off, saying, 'It's got to be an afro because he had this whole blaxploitation thing'. I told him, 'That's the South Central look.' You look at 'Ice Cube' (qv) and NWA. Guys had all this shit dripping down their necks. I had already grown the sideburns out and the mustache. It was perfect. Total Gangster.\"", "A movie is just a movie to me. They open, they close.", "I have a place that's pretty much cemented in Hollywood in terms of liability, box-office viability and everything else. The only thing an Oscar would do is jack my check up maybe $1 million.", "What kills me is that everybody thinks I like jazz.", "I can't say to myself, 'I haven't had a drink in 15 years, I could have a glass of champagne and be OK'. That might be true, but history says when I opened that bottle of champagne, I sat there and drank it until it was gone. People who've been through what I went through are always going to be tempted. I enjoyed drinking and I enjoyed taking drugs. But I have to remind myself every day that I can't have a drink.", "I feel like I have a kinship to England. I go about three or four times a year because you guys love me. Seriously, that's it right there. I just need to feel that love every once in a while. I like England because I can go anywhere on the tube and buses. So when I'm there I go to all the places where I used to hang out.", "Hollywood people tend to think that because one is successful in one aspect of entertainment they can bring them into this particular world and make a success out of them. They ask people like me to be in a film with those people that they are kind of headlining and your name ends up behind them. If you do that, it sanctions the fact that these people come into this world and you think they are worthy of you sharing your time on screen with them. I don't particularly think that. A month or so ago, someone called me about the '50 Cent' (qv) movie and I'm like, 'What are you calling me for?'. I don't even need to read that because that's not something I want to do. I like listening to '50 Cent' (qv) and I can groove to his music but I don't want to groove to him on screen, just yet. Maybe if he does five movies and he shows some talent. I mean how does he get to work with 'Jim Sheridan' (qv) and I don't. What is it about '50 Cent' (qv) that makes 'Jim Sheridan' (qv) say, 'I'd really like to make a movie with him.'?", "Definitely. And I always do - I love me on-screen! (On if he watches his own films)", "When I came to New York, it was bubbling. We watched each other, we encouraged each other, we went to auditions together, we rode trains together, and every Monday we had great parties. But it was also a time of, you know, drugs.", "I don't understand how people live without creating. You know? I don't know how you do one picture a year.", "I was the crackhead in _Jungle Fever (1991)_ (qv). I was two weeks out of rehab. I'd been smoking cocaine for a year and a half, two years, and I understood the nature of the disease. I had done the research. So when I started talking to Spike about it, I said, \"You don't see him high that much. You always see him when he needs something. He's on a mission to get some shit. That's what I wanna do.\" And that was my breakthrough. That got me into Hollywood. It was the perfect marriage of experience and opportunity.", "I was raised to be cautious. I went to work with my grandfather, who cleaned office buildings and furnaces, and there would be twenty-year-old guys callin' him Ed, and he called 'em Mister. My grandfather was this old guy, very dignified, but he never looked 'em in the eye. He'd look at me like, \"Turn your head down! Don't look the white men in the eye 'cause they'll think you being uppity or arrogant.\" Now the name of my production company is Uppity.", "I never asked for anything except a purple light saber. George said, \"Well, light sabers are either red or green.\" I said, \"Yeah, but I would like a purple one.\"", "I've never been to jail. I've never been arrested. I've never been locked up. I'm a good son, a good father, a good husband--I've been married to the same woman for thirty years. I'm a good friend. I finished college, I have my education, I believe in education, I donate money anonymously. So when people criticize the kind of characters that I play onscreen, I go, \"You know, that's part of a story.'", "I went to the movies a lot when I was a kid. That was my joy. Saturday mornings, my mom kicked me out of the house, I went to the movies at nine in the morning and watched cartoons and serials and the double-feature horror picture, and then I would meet her later for the adult stuff. So I love movies that way. So I'll do a movie like _Snakes on a Plane (2006)_ (qv), and I'll do a film that's very serious. And I'll do a comedy, because it's there.", "I haven't had a drug dream in ten or twelve years. All of a sudden, I had one, like, two weeks ago. 'Eve' (qv)n in the dream, you're hiding shit from people! People that you know pop up in the dream and you got this big-ass ball of cocaine in your hand and you stick it behind your back and go, \"Yeah, I'm all right.\" And then you wake up and you feel as bad as if you'd actually done it.", "[1992] A few years ago 'Morgan Freeman' (qv)'s granddaughter - she's a friend of my daughter - says, \"We're going to England. My grandfather's doing Robin Hood: 'Prince' (qv) of Thieves (1991)\". I got on the phone: 'How the hell did Morgan get Robin Hood?' They said the part was written for him. So I said, 'Are there any more black people in it?' I want to do a pirate. I want to swing from ship to ship with a knife in my teeth. I want to kick some butt. I would love to do that stuff. I don't want to ruin my artistic facade or anything, but I love splatter movies. I love stuff like _Scanners (1981)_ (qv). I've always liked to be freaked-out and I love to freak people out.", "(1992, on early film auditions) I've been told I wasn't African enough. And sometimes you don't get jobs because you're too good-'We wouldn't want to waste your talent on this meager part,' they say, and I'm sitting there thinking, 'I got a daughter who goes to school. She needs to eat, I need to eat.' When I auditioned for Mississippi Burning the director told me I didn't sound Southern. I grew up in Chattanooga, Tennessee! And this guy tells me I don't sound Southern! See, he was British.", "Want to know what the 'L.' in 'Samuel L. Jackson' (qv) means? None of your fucking business.", "I heard that you can do what ever you want in International Waters, that's why I filled my jacuzzi with International Water.", "I don't understand these actors who talk about how difficult it is to act with nothing there. I was an only child so most of the time I was always playing against something that didn't exist. It's called using your imagination.", "(2013, on his father) Once, when we were performing in Topeka, Kansas, my wife, my three-month-old daughter and I went to see my other grandmother, and it just so happened my father was living in her house again. I was in my 30s, and there was this woman and this older lady, and then this teenage girl comes downstairs with a little baby in her arms as young as my daughter. He's like, \"Hey, I want you to meet your sister.\" I think he's talking about the girl, but he's talking about the fucking baby. I'm like, \"You're a grown-ass, old-ass man doing this shit?\" Then the older lady's like, \"So when's the last time you saw your dad?\" And it was like, \"I haven't seen this motherfucker since I was three months old.\" We go outside and he gets angry, going, \"Why'd you have to tell her that?\" I said, \"Do you want me to tell her we hang out, that you've been taking care of me all these years? You're not my father; you're just a guy who happened to be my mom's sperm donor. I'm here to see your mother, not you.\" He passed not long after that. He was an alcoholic with cirrhosis and all that other shit. They had called me from the hospital: \"Mr. Jackson, your father's ­really ill now. If we have to take drastic measures, do you want us to keep him alive?\" I said, \"Are you calling to ask if I want you to put him on life support, or are you calling to see if I'm going to be responsible for his medical bill?\" They're like, \"Well....\" I said, \"He's got a sister in Kansas City-you should call her.\" Click. It's done.", "(2013) I was not the cool guy growing up. I was bookish. I had a stutter. I wasn't in the streets with all the other kids. I didn't dress cool or do cool shit. I played the trumpet, flute and French horn in the marching band and had great style on the field when we performed, but that wasn't the cool thing to do. I was popular because I was funny. I definitely didn't have the hot chicks.", "(2013, on his signature role) If there were one movie I wanted people to look at, it would be _A Time to Kill (1996)_ (qv)... It's an American story and a very Southern story. I'd like people to look at that one and say, \"Oh my God.\"", "(2013) 'W. Kamau Bell' (qv)'s FX show [Totally Biased with 'W. Kamau Bell' (qv) (2012)] had this whole segment where he was criticizing Django. He's a young black man with nappy hair and very dark skin, but he also has a very white wife and an interracial child. You can't tell me you know what people in the South did if you never spent time down there. He can say there had to be words Quentin (Tarantino) could use other than nigger. Well, what are they? These 20-somethings can't turn around and tell me the word nigger is fucked-up in Django yet still listen to Jay Z or whoever else say \"nigger, nigger, nigger\" throughout the music they listen to. \"Oh, that's okay because that's dope, that's down, we all right with that.\" Bullshit. You can't have it one way and not the other. It's art-you can't not censor one thing and try to censor the other. Saying Tarantino said \"nigger\" too many times is like complaining they said \"kike\" too many times in a movie about Nazis.", "[2013, on white directors doing films based on black history] There is this whole thing of \"Nobody can tell our story but us,\" but that's apparently not true, because the Jackie Robinson movie finally got made as 42. Spike (Lee) didn't make it, but people still went to see it. When 'Boaz Yakin' (qv) did _Fresh (1994)_ (qv) in 1994, all of a sudden it was like, \"Who is this Jewish motherfucker telling our stories?\" He's the Jewish motherfucker who wrote the story, that's who. If you got a story like that in you, tell it. We'll see when [director] 'Steve McQueen' (qv)'s movie _12 Years a Slave (2013)_ (qv) comes out, if it'll be like, \"What's this British motherfucker know about us?\" Somebody's always going to say something.", "(2013) I'm not trying to change the world. I'm just trying to entertain people.", "(2013, on directing) I don't have that directing thing. I don't want to be out there setting up shots all day. I like to act. I read the script and sign the contract. I like hanging out in my trailer watching _Judge Judy (1996)_ (qv) and eating sandwiches.", "(2013, on maintaining sobriety) What's it been now, 22 years or something? There's all kinds of shit in my house that I've never tasted in my life, like Cristal-stuff I couldn't afford back when I was drinking. All I'd have to do is walk in the closet, open a beer, and no one would know, but I know that I probably wouldn't stop at one beer. So I drink nonalcoholic beer. I'm not looking for the kick.", "(2013, on _Jungle Fever (1991)_ (qv) and staying sober) I got out of rehab, and about a week or something later, I was shooting the movie. I had a modicum of fame because I'd done other 'Spike Lee' (qv) movies, so when I'd go buy coke or something, the guys sitting around would go, \"Hey, man, __Do the Right Thing (1989)_ (qv)_(Qv)! Yeah, sit down!\" and I sat right down and got high with them. All of a sudden with _Jungle Fever (1991)_ (qv) I'm travelling in a different circle, which brought the next challenge because that circle has some darkness too-drink, drugs, only now they're offering them to you free. Now you have the chance to really get fucked-up. You know how it is. Make a wrong turn at a party and there's a bunch of people sitting around a table with more cocaine in front of them than you saw the entire time when you were using. I said to myself, Do you want to be fucked-up and think you're having a good time, or do you want to be satisfied artistically and spiritually in another way? I chose the other way.", "(2013, on quitting drugs & alcohol and re-establishing his career) In 1990 my wife said, \"Look, you're going to rehab,\" and the very next day I was in rehab. I didn't go kicking and screaming. I was tired, burned-out and at that low point of like, What the fuck is going on with me? They ask you in rehab to take an assessment of how you got to the point you're at, and I said, \"I guess I could have gone to that audition without my eyes red, without smelling like the beer I had or the weed I'd smoked.\" I never blamed anybody else for not being successful or not getting to the places I saw everybody else I worked with, like Wesley Snipes, get to. I had no problem doing roles like Black Guy in _Sea of Love (1989)_ (qv) or Hold-Up Man in _Coming to America (1988)_ (qv) or going to Boston once a year to get killed on _Spenser: For Hire (1985)_ (qv) or _A Man Called Hawk (1989)_ (qv). LaTanya asked, \"Why are you doing these piddly-ass jobs?\" I told her, \"Well, this or that guy I worked with is probably going to be something somewhere down the line.\" I always left an impression in an audition. I was memorable. In rehab I saw that I owed it to myself to see things another way and try it the other way. I opened my mind to what was being said... Like the petals were closed and, all of a sudden, the sun hit the flower and opened it up. People looked at it and it smelled great, it looked great to them. I'm like, Oh Jesus, this is not bad at all. I wondered whether I was going to be as much fun as I used to be, wondered whether people were going to think I was as good an actor. But the clarity and professional satisfaction that came with sobriety-couldn't beat it.", "[on _Snakes on a Plane (2006)_ (qv)) I stand by that movie!", "I did t.v., I did film, I did theater, I did children's theater. I just did what was there."], "salary history": ["_White Sands (1992)_ (qv)::$75,000", "_The Long Kiss Goodnight (1996)_ (qv)::$4,500,000", "_Shaft (2000)_ (qv)::$10,000,000", "_Unbreakable (2000)_ (qv)::$7,000,000", "_No Good Deed (2002)_ (qv)::$6,000,000"], "birth date": "1948-12-21", "birth notes": "Washington, District of Columbia, USA", "_actorID": "2", "_source": "IMDB", "actorID": "0000168", "created_utc_dt": "08/26/2019, 21:53:47"}