{"headshot": "https://m.media-amazon.com/images/M/MV5BMTMxMDIzMDEzNF5BMl5BanBnXkFtZTcwODcxMjE2Mg@@._V1_UY98_CR0,0,67,98_AL_.jpg", "nick names": ["Wilf"], "birth name": "John William Ferrell", "height": "6' 3\" (1.91 m)", "mini biography": ["John William Ferrell was born in Irvine, California, to Betty Kay (Overman), a teacher, and Roy 'Lee Ferrell' (qv), Jr., a musician. His parents were originally from Roanoke Rapids, North Carolina.A graduate of the University of Southern California, Ferrell became interested in performing while a student at University High School in Irvine, where he made his school's daily morning announcements over the public address system in disguised voices. He started as a member of the Los Angeles comedy/improvisation group The Groundlings, where fellow cast members 'Ana Gasteyer' (qv), 'Maya Rudolph' (qv) and former _Saturday Night Live (1975)_ (qv) repertory players such as 'Laraine Newman' (qv), 'Jon Lovitz' (qv) and 'Phil Hartman' (qv) began their careers. It was there he met 'Chris Kattan' (qv) and the two became good friends and both went on to _Saturday Night Live (1975)_ (qv) later. He has also appeared on several television programs, including _Strangers with Candy (1999)_ (qv), _Grace Under Fire (1993)_ (qv) and _Living Single (1993)_ (qv) during his time at The Groundlings. Will also lent his voice to the armless and legless dad of cartoon family \"The Oblongs\".In 1995 he became a feature cast member at _Saturday Night Live (1975)_ (qv) during the show's rapid re-casting. He was declared quite possibly the worst cast member ever during his first season. However, his talents of impersonations and range of characters shot him forward to making him arguably the greatest _Saturday Night Live (1975)_ (qv) cast member ever. During his seven year run he is one of the few cast members to ever be nominated for an Emmy for a performance and played 'George W. Bush' (qv) during the 2000 elections. He has appeared in every _Saturday Night Live (1975)_ (qv) movie since his premiere on the show in 1995. In 2002 he left _Saturday Night Live (1975)_ (qv) and was the only cast member to ever receive a farewell from all the current cast members at the end of the season finale show. Since leaving the show Will has pursued a career in films. In 2000, he married 'Viveca Paulin' (qv), and lives in L.A.::Rod Reece"], "spouse": ["'Viveca Paulin' (qv)::(12 August 2000 - present) ( 3 children)"], "trade mark": ["Often plays childish, immature characters", "Often appears either naked or shirtless in his movies", "Wild curly blond hair and blue eyes", "Towering height and slender frame"], "trivia": ["Lives in Los Angeles, Bend, Oregon and New York City.", "While he was in high school, Will made the daily morning announcements over the public access system in disguised voices. This is how he first became interested in performing.", "Attended and graduated from University High School in Irvine, California in 1986.", "His father, 'Lee Ferrell' (qv), was a longtime keyboardist and saxophonist for 'The Righteous Brothers' (qv).", "Attended and graduated from the University of Southern California with a degree in Sports Information.", "Celebrity impersonations include 'Alex Trebek' (qv), 'Jesse Ventura' (qv), 'Charlton Heston' (qv), 'Mark McGwire' (qv), 'George W. Bush' (qv), 'Janet Reno' (qv), 'Harry Caray' (qv) and (perhaps most famously) 'James Lipton' (qv).", "Older brother of 'Patrick Ferrell' (qv).", "His wife, 'Viveca Paulin' (qv), is Swedish.", "Became _Saturday Night Live (1975)_ (qv)'s highest paid cast member ever in 2001. Producers were desperate to keep him, resulting in a salary of over $350,000.", "Final appearance on _Saturday Night Live (1975)_ (qv) on May 18, 2002, followed by career move into full-time movie-acting.", "He can be heard (uncredited) in the movie _Kingpin (1996)_ (qv) in the background during the final bowling scene between 'Bill Murray' (qv) and 'Woody Harrelson' (qv)'s characters shouting, \"Ernie, you're the man!\".", "(April 21, 2003) Competed at the Boston Marathon. His official time was 4 hours, 2 minutes and 29 seconds.", "He and his wife 'Viveca Paulin' (qv) ran the Boston Marathon on April 21, 2003.", "He and his wife 'Viveca Paulin' (qv) ran in the New York City Marathon in 2001, finishing together in 5 hours, 1 minute and 56 seconds.", "Is a member of the Delta Tau Delta international fraternity.", "Studied at USC in the hopes of becoming a sports broadcaster. He graduated and interned at NBC Sports, but then drew laughs after ad-libbing a joke on-air during one of his broadcasting courses and switched to comedy.", "Was not a class clown in high school but a scholar and an athlete.", "Son, Magnus Paulin Ferrell, born on March 7, 2004. He weighed 8 lbs. 12 oz.", "Was voted the 3rd funniest person in America by Entertainment Weekly.", "Has played NWA-TNA announcer 'Don West' (qv) on _Saturday Night Live (1975)_ (qv).", "His style is unique among modern movie funnymen, a majority of whom have some sort of background in stand-up comedy. Ferrell's humor is character-driven and his genius lies in his improvised riffs from the minds of his typically cracked characters. His appearances on talk shows are often awkward, as he is uncomfortable appearing in public as himself.", "Is a member of what the media refers to as \"The Frat Pack\", along with 'Jack Black' (qv), 'Ben Stiller' (qv), 'Vince Vaughn' (qv), 'Steve Carell' (qv), 'Owen Wilson' (qv) and 'Luke Wilson' (qv). The \"Frat Pack\" name is a reference to the film _Old School (2003)_ (qv) featuring 'Vince Vaughn' (qv), Ferrell and 'Luke Wilson' (qv), due to the wide number of films featuring the seven actors. Ferrell's \"Frat Pack\" films include _Zoolander (2001)_ (qv), _Anchorman: The Legend of Ron Burgundy (2004)_ (qv), _Starsky & Hutch (2004)_ (qv) and _Wedding Crashers (2005)_ (qv).", "Ranked #51 in Premiere magazine's 2004 Power 100 List. It is his first appearance on the list.", "In _Jay and Silent Bob Strike Back (2001)_ (qv), he played Marshal Willenholly, a reference to Marshall, Will, and Holly from the television series _Land of the Lost (1974)_ (qv). Ferrell played Marshall in the movie adaptation of _Land of the Lost (2009)_ (qv).", "Ranked #38 on Premiere magazine's 2005 Power 50 List. Had ranked #51 in 2004.", "Once said that one of his favourite films is _Patton (1970)_ (qv).", "Is a member of an adult soccer league that plays at Crossroads School for Arts and Sciences - an exclusive private school in Santa Monica, California.", "Ranked #34 on Premiere magazine's 2006 \"Power 50\" list. Had ranked #38 in 2005.", "He has English, with smaller amounts of Irish, German, and Welsh, ancestry.", "Has three sons -- Magnus, Mattias and Axel. Mattias was born on December 30, 2006.", "Has three dogs.", "Parents are 'Lee Ferrell' (qv) and Kay Overman.", "Aside from University High School where he graduated, he also attended Rancho San Joaquin Middle School Irvine.", "A kicker for the Varsity football team, and still holds the school record for the most field goals made.", "Was chosen over future co-star 'Steve Carell' (qv) in 1995 to join _Saturday Night Live (1975)_ (qv).", "Was named #74 out of 137 on Entertainment Weekly's Must List (2004).", "Has a surgical scar on his upper right abdomen from a surgery he had as a baby to treat pyloric stenosis, a condition that causes frequent vomiting.", "Every summer, Will and his wife celebrate mid-summer in Sweden, a typical Swedish tradition.", "Is only seven years younger than 'Jane Lynch' (qv) who plays his mother in _Talladega Nights: The Ballad of Ricky Bobby (2006)_ (qv).", "Ranked #17 on EW's The 50 Smartest People in Hollywood (2007).", "According to Forbes magazine, his movies averaged $8 of gross income for every dollar the actor got paid. [December 2007]", "In January 2008, he spent two weeks traveling throughout Ireland with his father, Lee, and brother Patrick.", "His first son was born during the filming _Kicking & Screaming (2005)_ (qv), which is why it is his favorite of the films he appeared in. He said that he is eager for his son to see it, because he will always associate it with his birth.", "Has played the son of two _The Godfather (1972)_ (qv) cast members: 'James Caan' (qv) in _Elf (2003)_ (qv), and 'Robert Duvall' (qv) in _Kicking & Screaming (2005)_ (qv).", "Has been attacked by animals in several of his films. He is attacked by grizzly bears (while filming giant pandas) in _Anchorman: The Legend of Ron Burgundy (2004)_ (qv), a cougar in _Talladega Nights: The Ballad of Ricky Bobby (2006)_ (qv), a grizzly bear in _Semi-Pro (2008)_ (qv), etc...", "Worked as a teller at Wells Fargo when he was in high school.", "Has a brief cameo in _Naked Gun 33 1/3: The Final Insult (1994)_ (qv) as a man chasing a lawnmower down a flight of stairs during a parody of _The Untouchables (1987)_ (qv).", "Is a huge fan of the soccer clubs Celtic (from Glasgow) and Chelsea (From London). Can be seen wearing the jerseys from the clubs at events on television.", "He was the first and last guest on _The Tonight Show with Conan O'Brien (2009)_ (qv).", "Nominated for the 2009 Tony Award for Special Theatrical Event \"You're Welcome America. A Final Night with George W Bush\".", "Was roommates with 'Jon Stewart' (qv) during his early years on _Saturday Night Live (1975)_ (qv).", "Met his wife, 'Viveca Paulin' (qv), in an acting class in 1994.", "Third son, Axel Ferrell, was born on January 23, 2010 in Los Angeles.", "Former member of the comedy troupe The Groundlings.", "Does not do stand-up comedy like most of the _Saturday Night Live (1975)_ (qv) cast and alumni. He considers it to be \"hard, lonely and vicious\".", "Has appeared on the cover of GQ magazine three times: July 2004, July 2006 and December 2006.", "On October 24, 2011, he was the 14th recipient of the 'Mark Twain' (qv) Prize for American Humor at the Kennedy Center. Previous recipients include: 'Tina Fey' (qv), 'Bill Cosby' (qv), 'George Carlin' (qv), 'Billy Crystal' (qv), 'Neil Simon' (qv), 'Steve Martin' (qv), 'Lorne Michaels' (qv), 'Lily Tomlin' (qv), 'Bob Newhart' (qv), 'Whoopi Goldberg' (qv), 'Carl Reiner' (qv), 'Jonathan Winters' (qv) and 'Richard Pryor' (qv).", "On February 13, 2013, while working security during a Lakers game at the Staples Center, 'Will Ferrell' (qv) escorted a good-natured 'Shaquille O'Neal' (qv) away from his courtside seat. The name on Ferrell's official red jacket read \"Ted Vagina\".", "Received a star on the Hollywood Walk of Fame at 6767 Hollywood Boulevard in Hollywood, California on March 26, 2015.", "Turned down $28 million dollars to be in Elf 2 in late 2013.", "Endorsed 'Bernie Sanders' (qv) in the 2016 presidential election of the United States.", "The Evil Genius Beer Company named two of their beers from his dialogue: Santa!! I Know Him! festive saison from _Elf (2003)_ (qv), and Ma! The Meatloaf! mango Belgian wit from _Wedding Crashers (2005)_ (qv).", "Friends with 'John C. Reilly' (qv), and 'Mark Ryan Walberg' (qv)."], "quotes": ["I'm not really an exhibitionist. I'm drawn to the outrageous stuff because it's fun, not because it's some deep compulsion. I'm no tortured, anger-stoked, deeply neurotic comic. Just a pretty low-key normal guy. A, \"Hey, the glass is half-full\", kind of a guy. But please keep it quiet, or I may never work again.", "I often don't think a lot about the ramifications of anything I do.", "There's just something about yelling that's funny to me.", "[on being a comic]: I attribute it to growing up in safe, boring suburbia in California. I wasn't beaten up by anyone, there was a really low crime rate. There was really nothing to do except think of funny things.", "It was a gradual rise that started on SNL. I went from being the guy who did the cheer-leading thing, to the guy who plays the president to, \"Hey, that's 'Will Ferrell' (qv)!\" I saw that happen then in terms of films, and it was really _Old School (2003)_ (qv) that got me a real lead part. It was a scary thing when I left SNL (in 2003), but then \"Old School\" came out, and then _Elf (2003)_ (qv) happened the same year, and now _Talladega Nights: The Ballad of Ricky Bobby (2006)_ (qv).", "I saw a news story recently that said I'm 6' 4\". I'm creeping up, like in the high school football programs where you give yourself 15 more pounds. In three years I want to be 6' 5\" in stories. And I'm gonna do the opposite of these kids like LeBron James who are coming out of high school and going into the NBA. I'm gonna be the first 36-year-old white guy who tries to make it in the NBA.", "It doesn't really exist, this Frat Pack. We run into each other on occasions and we all like each other's films, I guess, but there isn't some big funny restaurant or bar where we all hang out. At least, if there is, they haven't invited me. I wasn't in _You, Me and Dupree (2006)_ (qv), 'Luke Wilson' (qv)'s last movie, and none of them was in _Talladega Nights: The Ballad of Ricky Bobby (2006)_ (qv) with me and, actually, nobody gives a shit.", "I've got no dark secrets, I wasn't beaten up, my parents were kind to me and there was a low crime rate where we lived. Maybe that's where the comedy comes from, as some sort of reaction to the safe, boring suburbs. Although, I gotta say, I never had any resentment of the place. I loved the suburbs.", "I'd much rather be in a comedy. In my view, comedy wins out in the long run. I'm not sure I'm a good enough actor to play real tragedy, so I bring a comic element to most things as my answer to the world's problems. I'm not a clown, though. I love goofing around, but I don't feel the need to act the clown in private - I do it at work, that's where I exorcise my demons. Although I confess that I do sometimes put together outfits to annoy my wife.", "I always forced myself to do crazy things in public. In college I would push an overhead projector across campus with my pants just low enough to show my butt.", "[on his role as a basketball player in _Semi-Pro (2008)_ (qv)] I love the fact that this is historically accurate and funny all at the same time. You can parody the sport and you can parody the era, but at the same time you have a built-in arc for the audience as they watch this team try to attain the lofty goal of fourth place.", "[on 'George W. Bush' (qv)] I had a couple of opportunities to go and meet him, and I declined, partly out of comedic purposes, because when I was on the show [_Saturday Night Live (1975)_ (qv)] at the time, it didn't make sense to really meet the people that you play, for fear of them influencing you. And then the other side of it is, from a political standpoint, I don't want to meet that guy.", "[on running in the Boston Marathon] I actually had people running up next to me with beer bongs and offering me shots. All of this crazy stuff. And no, I didn't take any of it.", "(2006) I was never the class clown. I was popular in high school and in college. I was good at sports. I've always been a 'but look, the glass is half-full' kind of guy. I used to worry that I wasn't crazy enough to succeed in comedy. Or troubled enough. In the beginning, people were surprised that a seemingly mild-mannered person could bring a script or a character to life. But I'm not above throwing a chair out a window just to see what happens. I may not have demons, but I am kind of immune to inhibitions.", "(2006, on living with his mother for three years after college) I had no ego about that. It's kind of sad.", "(on _Stranger Than Fiction (2006)_ (qv)) It was so freeing to not run around and act like a crazy person. It was so nice to be conversational and talk like a normal human being. I felt like my job on Stranger Than Fiction was to play really good defense. Don't throw the ball out of bounds. If you're open, take the shot but, otherwise, don't get too fancy.", "(2006) I do feel, at heart, that I'm a lazy person who found this thing that I love. Comedy makes me industrious. Without it, I'm just another guy.", "I rotate my clothes so everything is equally worn. Sometimes, that means orange shorts and red shoes. My wife is like \"Really?\".", "['Lorne Michaels' (qv)] never really has a moment where he says, \"So, welcome to the show.\" He phrases it, \"So, we're bringing you to New York.\" And I thought, God, another audition? And he goes, \"Cheri [Oteri]'s going to be there, too.\" And that's when it hit me: Oh, my God. I got the gig. But I didn't have a celebratory moment with him. Then I got self-conscious, like it came across that I didn't care about getting the job. So I stood up real quick, and I'm like \"Well, gosh, thank you. I just want to shake your hand.\" And he said, \"Do whatever you have to do.\"."], "salary history": ["_Anchorman: The Legend of Ron Burgundy (2004)_ (qv)::$7,000,000", "_Kicking & Screaming (2005)_ (qv)::$20,000,000", "_Bewitched (2005)_ (qv)::$20,000,000", "_Talladega Nights: The Ballad of Ricky Bobby (2006)_ (qv)::$20,000,000", "_Semi-Pro (2008)_ (qv)::$20,000,000", "_Land of the Lost (2009)_ (qv)::$20,000,000"], "birth date": "1967-07-16", "birth notes": "Irvine, California, USA", "_actorID": "59", "_source": "IMDB", "actorID": "0002071", "created_utc_dt": "08/26/2019, 21:54:27"}