{"headshot": "https://m.media-amazon.com/images/M/MV5BNDExMzIzNjk3Nl5BMl5BanBnXkFtZTcwOTE4NDU5OA@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Hugh Michael Jackman", "height": "6' 2\" (1.88 m)", "mini biography": ["Hugh Michael Jackman is an Australian actor, singer, multi-instrumentalist, dancer and producer. Jackman has won international recognition for his roles in major films, notably as superhero, period, and romance characters. He is best known for his long-running role as Wolverine in the X-Men film series, as well as for his lead roles in the romantic-comedy fantasy Kate & Leopold (2001), the action-horror film _Van Helsing (2004)_ (qv), the drama The Prestige and _The Fountain (2006)_ (qv), the epic historical romantic drama Australia (2008), the film version of _Les Misérables (2012)_ (qv), and the thriller _Prisoners (2013)_ (qv). His work in Les Misérables earned him his first Academy Award nomination for Best Actor and his first Golden Globe Award for Best Actor - Motion Picture Musical or Comedy in 2013. In Broadway theatre, Jackman won a Tony Award for his role in The Boy from Oz. A four-time host of the Tony 'Awards' (qv) themselves, he won an Emmy Award for one of these appearances. Jackman also hosted the 81st Academy 'Awards' (qv) on 22 February 2009.Jackman was born in Sydney, New South Wales, to Grace McNeil (Greenwood) and Christopher John Jackman, an accountant. He is the youngest of five children. His parents, both English, moved to Australia shortly before his birth. He also has Greek (from a great-grandfather) and Scottish (from a grandmother) ancestry.Jackman has a communications degree with a journalism major from the University of Technology Sydney. After graduating, he pursued drama at the Western Australian Academy of Performing Arts, immediately after which he was offered a starring role in the ABC-TV prison drama _Correlli (1995)_ (qv), opposite his future wife 'Deborra-Lee Furness' (qv). Several TV guest roles followed, as an actor and variety compere. An accomplished singer, Jackman has starred as Gaston in the Australian production of \"Beauty and the Beast.\" He appeared as Joe Gillis in the Australian production of \"Sunset Boulevard.\" In 1998, he was cast as Curly in the Royal National Theatre's production of 'Trevor Nunn' (qv)'s Oklahoma. Jackman has made two feature films, the second of which, _Erskineville Kings (1999)_ (qv), garnered him an Australian Film Institute nomination for Best Actor in 1999. Recently, he won the part of Logan/Wolverine in the 'Bryan Singer' (qv)- directed comic-book movie _X-Men (2000)_ (qv). In his spare time, Jackman plays piano, golf, and guitar, and likes to windsurf.::Anonymous"], "spouse": ["'Deborra-Lee Furness' (qv)::(11 April 1996 - present) ( 2 children)"], "trade mark": ["Ruggedly handsome features", "Renown for his persuasive American accent", "The role of Wolverine in the live-action X-Men films", "Muscular physique", "Deep resonant voice"], "trivia": ["For Sunset Boulevard (as Joe Gillis), he won a Variety Club, a Mo and a Green Room Award as best male actor in a musical. He was nominated for a 'Laurence Olivier' (qv) Award in 1998 as Curly in the Royal National Theatre's Oklahoma!.", "Adopted a son, Oscar Maximillian Jackman, in May 2000 (b. 15 May 2000).", "Met his wife, 'Deborra-Lee Furness' (qv), while co-starring in the Australian TV series _Correlli (1995)_ (qv).", "Chosen as one of People magazine's \"50 Most Beautiful People in the World\" 5 years in a row, 2000-2004.", "He was one of the presenters at the 2002 Academy 'Awards' (qv), but says he'll think twice about presenting again. He says, \"I slept for about an hour and I'd have liked a little bit of sushi to come down. There'll be a lot of drunken parties back home and people betting and that's usually what I'm at, so getting up there in a suit and talking for a little bit is kind of bizarre.\".", "He sang \"People Will Say We're in Love\" from \"Oklahoma!\" with 'Shirley Jones' (qv), when they reprised their respective roles of Curly and Laurie, at the opening of Fox Studios in Sydney.", "He was a last-minute addition to the _X-Men (2000)_ (qv) cast. 'Dougray Scott' (qv) was originally cast as Wolverine, but was injured in a motor bike accident and wouldn't have recovered in time for filming.", "In the comics, Wolverine stands 5-feet-3-inches, however Jackman stands a whole foot taller than his character, at 6'2 ½.", "He was nominated for a 1999 'Laurence Olivier' (qv) Theatre Award for the 1998 season for Best Actor in a Musical for his role in \"Oklahoma.\".", "Was offered the role of \"Captain William Gordon\" in _Mangal Pandey: The Rising (2005)_ (qv).", "While filming _Van Helsing (2004)_ (qv), he accidentally broke an extra's hand.", "Was voted one of \"The 50 Most Beautiful People in the World\" by People magazine in [2003].", "Named Best Actor in a Musical by Drama Desk in New York for his portrayal of 'Peter Allen' (qv) in \"The Boy From Oz\" (April 2004).", "Won Broadway's 2004 Tony Award as Best Actor (Musical) for his portrayal of Australian singer/songwriter 'Peter Allen' (qv) in \"The Boy From Oz.\" Jackman also served as host for the televised ceremony for the American Theatre Wing's annual Antoinette Perry (aka Tony) 'Awards' (qv) in 2003, 2004, and 2005.", "Before attending WAAPA (Western Australian Academy of Performing Arts), he did a year-long acting program called \"The Journey\" at the Actors Centre in Sydney.", "His parents separated when he was eight. His mother then moved back to England. His father, an accountant, brought up five children, by himself. The first 18 months of Hugh's life were spent with his godparents.", "He is terribly near-sighted and has extremely blurry vision when he isn't wearing contacts. Even when hosting the Tonys and _Saturday Night Live (1975)_ (qv), Jackman memorized almost everything he had to say so he wouldn't have to struggle to read.", "Once said in an interview with 'Jay Leno' (qv) that he is a fan of the \"Friday The 13th\" film series, and he became an actor because he wanted to play Jason in one.", "Was listed as a potential nominee on the 2005 Razzie Award nominating ballot. He was listed as a suggestion in the Worst Actor category for his performance in the film _Van Helsing (2004)_ (qv). However, he did not receive a nomination.", "Expressed great fondness for the comic book character Superman. Ironically, Superman is owned by DC Comics, the rival company of Marvel Comics, which owns X-Men and Wolverine.", "He admitted after _X-Men (2000)_ (qv) that it was difficult to summon up the rage and darkness necessary for the character of Logan/Wolverine and it took weeks off work with 'Bryan Singer' (qv) to find the right tone for the character. After that, however, it was relatively easy for him to play the angry character.", "Started his own movie-production company, Seed Productions, with his friend 'John Palermo' (qv). They produced _Deception (2008)_ (qv), _X-Men: The Last Stand (2006)_ (qv) and _The Greatest Showman (2017)_ (qv).", "Adopted a girl, Ava Eliot Jackman (b. July 10, 2005), in July 2005.", "Was school captain during his final year of high school, a school also attended by Australian actors 'Adam Garcia' (qv), 'Andrew Johnston' (qv), 'Reg Livermore' (qv), and 'Hugo Weaving' (qv); writer 'Stuart Beattie' (qv); and radio host 'John Laws' (qv).", "His two children have playtime sessions with 'Rupert Murdoch' (qv)'s younger children in New York.", "Took stunt-driving classes to prepare for his role in _Swordfish (2001)_ (qv).", "Had never seen an episode of _Saturday Night Live (1975)_ (qv) until he agreed to host the show. The producers sent him tapes of episodes so he could understand the format, and later said that his favorite was the one hosted by 'Conan O'Brien' (qv).", "Often his wife and, sometimes, members of his family stay with him while he is shooting on location.", "Hugh's parents were English immigrants to Australia. One of Hugh's paternal great-grandfathers, Nicholas Isidor Bellas, was Greek, while Hugh's maternal grandmother, Agnes Milroy, was of Scottish descent.", "Doesn't smoke in real life. He says he finds it horrible to smoke in movies.", "Was among the guests at the wedding of 'Nicole Kidman' (qv) and 'Keith Urban' (qv).", "Wants to produce and star in a film based on the life of _The Incredible Hulk (1978)_ (qv) actor 'Bill Bixby' (qv).", "Frequently gets offered roles based on comic books. He was offered _Daredevil (2003)_ (qv), _Hulk (2003)_ (qv), _Iron Man (2008)_ (qv), Mr. Fantastic in _Fantastic Four (2005)_ (qv), and Jonathan Kent in _Superman Returns (2006)_ (qv).", "He and his wife, 'Deborra-Lee Furness' (qv), suffered through two miscarriages, which they point to as the most difficult point in their lives. Both of their children are adopted.", "Upon meeting 'Olivia Newton-John' (qv) ('John Travolta' (qv) introduced the two while he and Jackman were filming _Swordfish (2001)_ (qv)), he confessed to her that under his desk in elementary school, there was a poster with Newton-John on it, and he would kiss the poster every day.", "Has two older brothers, Ian and Ralph, and two older sisters, Sonya and Zoe. Also has a half-sister from his mother's side of the family.", "Had to shave off all of the hair on his head and chest for scenes in the last third of the movie _The Fountain (2006)_ (qv).", "Was considered for the role of Harvey Dent/Two-Face in _The Dark Knight (2008)_ (qv). The part went to 'Aaron Eckhart' (qv), instead.", "Voted People Magazine's \"Sexiest Man Alive\" in 2008.", "Was cast straight out of drama school playing Kevin Jones in a 10-part drama series aired on Australia's ABC called _Correlli (1995)_ (qv), which was the original creation of actress 'Denise Roberts' (qv), who is also the principal director and CEO of Screenwise, Australia's leading film & TV school for actors in Sydney, Australia.", "One of his lifelong goals is to play Pharaoh in either a Broadway production or a West End London theatre production of \"Joseph and the Amazing Technicolor Dreamcoat.\".", "In (January 2010) he vacationed with his family in Rio de Janeiro, Brazil, staying at the world-famous Copacabana Palace Hotel.", "Lives in New York City, New York.", "Close friend of 'Liev Schreiber' (qv).", "His life goal as a young man was to be an international freelance journalist. He got a degree in journalism before turning to acting.", "He undergoes intense physical training each time he's played Wolverine. When in peak physical condition, he can bench press well more than 300 pounds.", "Was presented the 2,487th Star on the Hollywood Walk of Fame accompanied by his wife and two children, as well as his _Les Misérables (2012)_ (qv) director 'Tom Hooper' (qv) and co-stars 'Anne Hathaway' (qv) and 'Amanda Seyfried' (qv) (December 13, 2012).", "Hugh credits his good friend 'Russell Crowe' (qv) with catapulting his career into super stardom. After Crowe turned down the lead in _X-Men (2000)_ (qv), he personally recommended Jackman to director 'Bryan Singer' (qv) for the part.", "In April 2013, a woman Jackman had noticed hanging around outside his Manhattan apartment building ended up finding him at his Greenwich Village gym and throwing her electric razor at him, screaming \"I love you!\" The 47-year-old woman was arrested shortly thereafter.", "Godfather of 'Rupert Murdoch' (qv)'s daughters Grace and Chloe.", "In (October 2009) he was in New York City performing \"A Steady Rain\", a 2-man dramatic play, opposite 'Daniel Craig' (qv) (James Bond), until December 2009.", "New York, NY, USA: Reported that he had done a table reading of the late 'Nora Ephron' (qv)s final Broadway work 'Lucky Guy', though lead role eventually reverted to 'Tom Hanks' (qv), who years before, had turned down the role when it was proposed as a film. [February 2013]", "Was being treated for skin cancer in [November 22, 2013].", "When Hugh performed at the funeral of 'Joan Rivers' (qv), he sang \"Quiet Please, There's a Lady On Stage\" (from Broadway musical \"The Boy From Oz\"). Held at Temple Emanu-El, New York City on 7 September 2014.", "Watched 'Clint Eastwood' (qv)'s Dirty Harry films as inspiration for his performance as Wolverine.", "His wife initially told him he should turn down the role of Wolverine.", "Is the subject of a running joke in _Scrubs (2001)_ (qv) where 'John C. McGinley' (qv)'s character, Dr Cox, has an unexplained but deep hatred of him and frequently expresses a wish to hurt him.", "A big fan of professional wrestling.", "Good friends with: 'Russell Crowe' (qv), 'Nicole Kidman' (qv), 'Kylie Minogue' (qv), 'Neil Patrick Harris' (qv), 'Eric Bana' (qv), 'Liev Schreiber' (qv), 'Daniel Craig' (qv) and 'Kate Winslet' (qv).", "Jackman appeared on Forbes's annual Celebrity 100 list of the 100 most powerful celebrities and in 2013, he topped Forbes's Most Powerful Actors list.", "Jackman has been described as one of the world's most attractive men by various media outlets, and his perceived sex appeal has been picked up by many sources, including Empire, who named him one of the sexiest stars in film history, and People, who named him one of the World's Most Beautiful People. In 2008, Jackman won People Magazine's Sexiest Man Alive.", "He was originally cast as 'George Reeves' (qv) in _Hollywoodland (2006)_ (qv) but had to drop out. The role was eventually played by 'Ben Affleck' (qv).", "He has said that he thinks Tom Hardy would be a good choice to succeed him in the role of Wolverine.", "In China, he is nicknamed Wolf Uncle because his name does not translate easily.", "He was considered for The Huntsman in _Snow White and the Huntsman (2012)_ (qv), but he turned it down. So the role went to 'Chris Hemsworth' (qv).", "Is left handed.", "Was a PE teacher before becoming an actor."], "quotes": ["On turning down the chance to play 'Richard Gere' (qv)'s character in the 'Harvey Weinstein' (qv)-produced film _Chicago (2002)_ (qv): I thought I was too young for the role. You have some 34-year-old guy up against 'Catherine Zeta-Jones' (qv) and 'Renée Zellweger' (qv) and it becomes a different movie. At one point, Harvey was telling me they were thinking of 'Kevin Spacey' (qv), and Ivtold him, 'That's exactly right. You should hire him.' Then I was in New York when the movie opened and the queue was around the block. I sat down and thought that I had probably made the biggest mistake. But I still honestly think that it was the right thing to do. I still think I was too young for that part.", "Finally something my family can be proud of.", "Now I meet people with full-color Wolverine tattoos on their backs. Thank God I did okay, because I think if I handn't, they'd spit on me in the street. - on his role of Wolverine.", "There is something very secretive about the way they cast that role. I've never had an official call asking: 'Are you interested or not?' but there's no guy I know who wouldn't want that role -- and that includes me. Anyone who says otherwise is lying. [on the now (Nov. 2004) opened spot for the next James Bond]", "[on comic books] I never read comics as a kid, and when I was slipped the comics under my trailer door, 'Bryan Singer' (qv) didn't want us to read them. He was very frightened that we would come out with these 2-D characters, and I was amazed at how helpful they were, the images more than the story. The images, and how they capture emotion or an action sequence in just, say, three images. I have to say I used them as inspiration for some of the fighting stances or techniques. The way Wolverine stands and how he looks.", "[on Wolverine video game] I didn't do the motion-capture work; I didn't do any of that. I don't know if they've used my voice or not, they probably have.. I did a lot of recordings on the first movie for dolls and video games, so they probably just used the same stuff.", "[on his action figure] People can stick pins in it, put in the freezer. It's far more dangerous than a video game.", "[on playing Wolverine] The character I play is actually only 1.6 meters [5' 3\"]. Before I had any kind of acting profile I was encouraged to lie about my height. I was told to say I was about six foot [1.83 meters] tall. I was worried about it when I first had my audition because pleasing fans of the franchise is important. My height was brought up on the Internet. They didn't think it was right. A lot of people who never met me think I'm very short. 'James Marsden' (qv) (Cyclops), who's only 10 centimeters [4 inches] shorter than me, was put on boxes and platforms in our scenes together. You'll notice that every character in _X-Men (2000)_ (qv) looks taller than me.", "I've always felt that if you back down from a fear, the ghost of that fear never goes away. It diminishes people. So I've always said yes to the thing I'm most scared about. The fear of letting myself down -- of saying no to something that I was afraid of and then sitting in my room later going, 'I wish I'd had the guts to say this or that' -- that galvanizes me more than anything.", "Acting is something I love. It's a great craft that I have a lot of respect for. But I don't think it's any greater challenge than teaching 8-year-olds or any other career. In my life, I try not to make it more important than it is and I just hope that rubs off on the people around me.", "Becoming a father, I think it inevitably changes your perspective of life. I don't get nearly enough sleep. And the simplest things in life are completely satisfying. I find you don't have to do as much, like you don't go on as many outings.", "I have shocking teeth. . . . I'm being a little facetious - I just went to the dentist the other day, and he looked at my teeth and went, \"Oh, my God, you've got gray teeth.\"", "Joking about being selected 'most sexiest man' as People Magazine's annual choice, 2008: I think we ran a very strong campaign and I'm not proud of it -- I can admit it now. We're the first ones to run a negative campaign and we spent years bringing Clooney, Pitt, Damon, and McConaughey down to size. I was prepared to do absolutely anything.", "[on his 8-year-old adopted son Oscar] He said to me the other day, 'Dad, two o'clock, hot chick.' He walks over, and I heard him say, 'Hey, my dad's Wolverine.' That's his opening line! He brings them over and asks, 'Dad, can we have a few autographs for the girls?' I'm like, 'Am I pimping for my kids?'", "If ever there was any doubt about whether or not people wanted their comic book heroes dark and vulnerable, I think _X-Men (2000)_ (qv) started this idea, and _The Dark Knight (2008)_ (qv) last year really confirmed it. Audiences want to see that, they want to see the superhero's frailties, their doubts, and their battles.", "My idol was 'Olivia Newton-John' (qv)...I had her poster and I would kiss it every day. I met her and told her that...and she was like, \"Great\".", "[on his father] He never took ones day off in his life. He had five kids he was bringing up on his own. If any one deserved a day off it was my old man, but he never did. I learned that from him.", "When I came out of drama school I was like, 'I'm going to do anything I can just to keep working'. In drama school you do Shakespeare to movement to circus skills to singing all in one morning. I know a lot of people hated it but I reveled in it. I loved it. It's weird how it evolved.", "I can look back on my life, where there have been moments where things might have gone the other way. Everything is like stepping stones, and I've seen people I admire falter. We're all vulnerable.", "I was at a Warner Bros. event and all the stars were lining up backstage. 'Sylvester Stallone' (qv) was in front of me and ['Clint Eastwood' (qv)] was behind me and we were all embarrassingly close. I turned around before the line went off and said: 'Good day Mr. Eastwood, 'Hugh Jackman' (qv).' Clint replied: 'Yeah I know.' I continued: 'By the way, I know we've gotta go but I've been told I occasionally look like you in films.' Clint replied: 'You're holding up the line kid.' I'll never forget it. I went on stage bright red and never looked at him again. Clint has never asked me to be in any of his movies or have an audition.", "(on Father's Day gifts) The best is a hand written card. I don't know where some of my awards are, but I can tell you exactly where those cards are. I treasure them most.", "[on the look he wanted for _X-Men Origins: Wolverine (2009)_ (qv)] I had this image in my head of De Niro in that remake of _Cape Fear (1991)_ (qv). You were terrified of that character from the moment he took his shirt off and you saw all the tats; you know he was this coiled spring that would rip your head off, no matter how nonchalant he acted. That's who Wolverine is.", "The things that I really cherish are the everyday moments, like sitting around cooking pancakes together on Sunday morning, or getting home after a tough day and my kids come up and give me a hug and remind me what's really important.", "[on _Les Misérables (2012)_ (qv)] 'Victor Hugo' (qv)'s novel is the greatest handbook any actor ever had for a job. But Annie ['Anne Hathaway' (qv)] brought research to it that went even further than Hugo - about what it meant to be a woman in that time period, what it meant to be a prisoner.", "When I come home, my daughter will run to the door and give me a big hug, and everything that's happened that day just melts away.", "As a teenager I was explosively angry. I think rugby saved me because that's just organized violence.", "Nine out of 10 characteristics of Wolverine I don't share, but aggression is a primal thing and needs to be exercised in some way. When I was younger I was very explosive. I used to let most of it out playing rugby. I'm not as explosive now but in a sense it's still there. It's in our DNA ... far better to have it in a controlled violent environment. So in a way playing Wolverine is good therapy.", "[on persistent rumors that he is gay despite being married to 'Deborra-Lee Furness' (qv) for 17 years] If I was, I would be. I don't think - to me, it's not the most interesting thing about a person anyway, but I do get frustrated for Deb, because I see Deb go, 'Ah, this is crazy.' On some level it's a compliment, you know, because it only happens when you've got to a certain point in your career.", "[on Australians working in Hollywood] We dominate! We're the majority now! It's always good to be an Aussie wherever you are...it's because Hollywood accepts us. Aussies over there they just love them, they love the accent, they want to know everything about you, they really dig the Aussies. It's a good time to be an Aussie, I'm real proud of all the Aussies and real credit to how in Australia we train actors really well, and in general how Aussies will have a go and aren't afraid to pack up and have a crack.", "I understand at Marvel they've got The Avengers, they've got a lot of big things going on, but at some point I just find it almost impossible that there's not a way to bring Iron Man, all the Avengers characters, Wolverine, the X-Men characters, Spider-Man, and somehow get them in together.", "I just heard Oscar, my son who's thirteen, telling a friend, 'Enough about my dad, all right? The truth is he's nothing like Wolverine. He's not cool, he's not tough, he's nothing like that'.", "I'm a typical actor. Someone picks me up in the morning, they give me something to wear, tell me what to say, feed me and send me home.", "[on coping with the ultra-Scottish tradition of his Sydney school] I wasn't a bag-pipe guy, but I was a kilt guy - and had to endure endless ribbing on the train. Every Friday, if you were in the cadets, the school army - you had to wear the kilt. It wasn't traditional kilt-wearing: there was underwear involved. Just to clear that up for everybody.", "[on maintaining privacy in his life] With paparazzi, I'm constantly trying to see my kids' view of the situation - that if I start flipping the bird or throwing punches how frightening it would be for them. So I'm constantly sitting on it? Yeah. Would I like to handle it differently? Yes.", "[on casting challenges] The risk for me is constantly being considered Mr. Nice Guy, Mr. Wholesome. Labels are the enemy. I'm particularly drawn this character [Kelly Dover in _Prisoners_], maybe as a parent. I love looking at how people react under almost melodramatically extreme situations. As an actor, that's the ultimate stretch.", "[on preparing to play \"Keller Dover\" in _Prisoners (2013)_ (qv)] All the research I did was about sleep deprivation, because the movie takes place over eight or nine days. And when I read something from a father whose kid was gone, he said that the most maddening part of the whole thing is the powerlessness of the parent, knowing that the child is waiting for you and can't understand why you're not there, every second of every day. The idea of sleep or rest is impossible.", "[re working in _Prisoners (2013)_ (qv) with director 'Denis Villeneuve' (qv)] The common thing in cases like these is the ticking clock. Your hands start to shake, you forget things, you become unreasonable. [Villeneuve pushed us to] a place that is instinctive and primal. What he encouraged was a sense of abandon. It was ultimately very freeing.", "_Raiders of the Lost Ark (1981)_ (qv) blew my mind. I had no idea movies could be that great and awesome. I was 12 years old, and that's when I remember thinking, 'Oh, I'd love to do that one day.'", "[on the _Logan (2017)_ (qv)] If I did another one I'm 99.9% sure it would be the last, so that will inform what it is for me.", "[on his recurring bouts of skin cancer] I'm realistic about the future and it's more than likely that I'll have at least one more but probably many more, which is not uncommon for an Aussie particularly from English stock growing up in Australia where I don't remember ever being told to put sunscreen on. But the beauty of this is it's all preventable, it's just about getting proper check-ups. I can be typical man, a little lazy, I couldn't be bothered and now I'm not lazy at all.", "[on playing Wolverine] I love the character. I love the series. I would never take it for granted or do it for the hell of it. I have to feel like I really have something to offer and we're going to take Wolverine on a slightly different journey. Otherwise it'll be time to hand over the claws to someone else, and I'm sure there will be many lining up to do it.", "[on watching _X-Men: Days of Future Past (2014)_ (qv) with his kids] It is actually really cool to watch it with them until you get to the moment where you're naked on screen and you forgot to warn your almost nine-year-old daughter. And she says, 'Dad, why aren't you wearing underwear?'", "[observation, 2012] I believe this is the 2,487th star on the Walk of Fame. However, apart from Lassie, I'm the only one who's got it for playing the same character in fifteen movies.", "[on prepping to shoot _The Wolverine (2013)_ (qv) and _Les Misérables (2012)_ (qv) back-to-back] The roles are so different that it's hard to compare -- except for the level of intensity. I worked on my abs for months [for Wolverine], but there was a similar intensity preparing to play Jean Valjean.", "[on possibly integrating Irish mythology into the _Logan (2017)_ (qv)] So travel back to Ireland and proper investigate Logan's past. Shake things up. I guarantee you, there's some Irish blood in there. And I loved the myths and legends. A friend of mine from Ireland gave me a book of them and Cu Chulainn and those stories, they're amazing. Action packed. I'm quite surprised nothing has been done with them before. I'd love to see them in the next Wolverine. That could work great."], "salary history": ["_X-Men Origins: Wolverine (2009)_ (qv)::$20,000,000", "_Snow Flower and the Secret Fan (2011)_ (qv)::$1,500,000", "_Butter (2011)_ (qv)::$2,000,000", "_Real Steel (2011)_ (qv)::$9,000,000"], "birth date": "1968-10-12", "birth notes": "Sydney, New South Wales, Australia", "_actorID": "34", "_source": "IMDB", "actorID": "0413168", "created_utc_dt": "08/26/2019, 21:54:11"}