{"headshot": "https://m.media-amazon.com/images/M/MV5BMTkxMzk4MjQ4MF5BMl5BanBnXkFtZTcwMzExODQxOA@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Christian Charles Philip Bale", "height": "6' (1.83 m)", "mini biography": ["Christian Charles Philip Bale was born in Pembrokeshire, Wales, UK on January 30, 1974, to English parents Jennifer \"Jenny\" (James) and 'David Bale' (qv). His mother was a circus performer and his father, who was born in South Africa, was a commercial pilot. The family lived in different countries throughout Bale's childhood, including England, Portugal, and the United States. Bale acknowledges the constant change was one of the influences on his career choice.His first acting job was a cereal commercial in 1983; amazingly, the next year, he debuted on the West End stage in \"The Nerd\". A role in the 1986 NBC mini-series _Anastasia: The Mystery of Anna (1986)_ (qv) caught 'Steven Spielberg' (qv)'s eye, leading to Bale's well-documented role in _Empire of the Sun (1987)_ (qv). For the range of emotions he displayed as the star of the war epic, he earned a special award by the National Board of Review for Best Performance by a Juvenile Actor.Adjusting to fame and his difficulties with attention (he thought about quitting acting early on), Bale appeared in 'Kenneth Branagh' (qv)'s 1989 adaptation of Shakespeare's _Henry V (1989)_ (qv) and starred as Jim Hawkins in a TV movie version of _Treasure Island (1990)_ (qv). Bale worked consistently through the 1990s, acting and singing in 'News' (qv)ies (1992), _Swing Kids (1993)_ (qv), _Little Women (1994)_ (qv), _The Portrait of a Lady (1996)_ (qv), _The Secret Agent (1996)_ (qv), _Metroland (1997)_ (qv), _Velvet Goldmine (1998)_ (qv), _All the Little Animals (1998)_ (qv), and _A Midsummer Night's Dream (1999)_ (qv). Toward the end of the decade, with the rise of the Internet, Bale found himself becoming one of the most popular online celebrities around, though he, with a couple notable exceptions, maintained a private, tabloid-free mystique.Bale roared into the next decade with a lead role in _American Psycho (2000)_ (qv), director 'Mary Harron' (qv)'s adaptation of the controversial 'Bret Easton Ellis' (qv) novel. In the film, Bale played a murderous Wall Street executive obsessed with his own physicality - a trait for which Bale would become a specialist. Subsequently, the 10th Anniversary issue for \"Entertainment Weekly\" crowned Bale one of the \"Top 8 Most Powerful Cult Figures\" of the past decade, citing his cult status on the Internet. EW also called Bale one of the \"Most Creative People in Entertainment\", and \"Premiere\" lauded him as one of the \"Hottest Leading Men Under 30\".Bale was truly on the Hollywood radar at this time, and he turned in a range of performances in the remake _Shaft (2000)_ (qv), _Captain Corelli's Mandolin (2001)_ (qv), the balmy _Laurel Canyon (2002)_ (qv), and _Reign of Fire (2002)_ (qv), a dragons-and-magic commercial misfire that has its share of defenders.Two more cult films followed: _Equilibrium (2002)_ (qv) and _The Machinist (2004)_ (qv), the latter of which gained attention mainly due to Bale's physical transformation - he dropped a reported 60+ pounds for the role of a lathe operator with a secret that causes him to suffer from insomnia for over a year.Bale's abilities to transform his body and to disappear into a character influenced the decision to cast him in _Batman Begins (2005)_ (qv), the first chapter in 'Christopher Nolan' (qv)'s definitive trilogy that proved a dark-themed narrative could resonate with audiences worldwide. The film also resurrected a character that had been shelved by Warner Bros. after a series of demising returns, capped off by the commercial and critical failure of _Batman & Robin (1997)_ (qv). A quiet, personal victory for Bale: he accepted the role after the passing of his father in late 2003, an event that caused him to question whether he would continue performing.Bale segued into two indie features in the wake of Batman's phenomenal success: _The New World (2005)_ (qv) and _Harsh Times (2005)_ (qv). He continued working with respected independent directors in 2006's _Rescue Dawn (2006)_ (qv), 'Werner Herzog' (qv)'s feature version of his earlier, Emmy-nominated documentary, _Little Dieter Needs to Fly (1997)_ (qv). Leading up to the second Batman film, Bale starred in _The Prestige (2006)_ (qv), the remake of _3:10 to Yuma (2007)_ (qv), and a reunion with director 'Todd Haynes' (qv) in the experimental 'Bob Dylan' (qv) biography, _I'm Not There (2007)_ (qv).Anticipation for _The Dark Knight (2008)_ (qv) was spun into unexpected heights with the tragic passing of 'Heath Ledger' (qv), whose performance as The Joker became the highlight of the sequel. Bale's graceful statements to the press reminded us of the days of the refined Hollywood star as the second installment exceeded the box-office performance of its predecessor.Bale's next role was the eyebrow-raising decision to take over the role of John Connor in the Schwarzenegger-less _Terminator Salvation (2009)_ (qv), followed by a turn as federal agent Melvin Purvis in 'Michael Mann' (qv)'s _Public Enemies (2009)_ (qv). Both films were hits but not the blockbusters they were expected to be.For all his acclaim and box-office triumphs, Bale would earn his first Oscar in 2011 in the wake of _The Fighter (2010)_ (qv)'s critical and commercial success. Bale earned the Best Supporting Actor award for his portrayal of Dicky Eklund, brother to and trainer of boxer \"Irish\" Micky Ward, played by 'Mark Wahlberg' (qv). Bale again showed his ability to reshape his body with another gaunt, skeletal transformation.Bale then turned to another auteur, 'Yimou Zhang' (qv), for the epic _The Flowers of War (2011)_ (qv), in which Bale portrayed a priest trapped in the midst of the Rape of Nanking. Bale earned headlines for his attempt to visit with Chinese civil-rights activist Chen Guangcheng, which was blocked by the Chinese government.Bale capped his role is Bruce Wayne/Batman in _The Dark Knight Rises (2012)_ (qv); in the wake of the Aurora, Colorado tragedy, Bale made a quiet pilgrimage to the state to visit with survivors of the attack that left theatergoers dead and injured. He also starred in the thriller _Out of the Furnace (2013)_ (qv) with _Crazy Heart (2009)_ (qv) writer/director 'Scott Cooper' (qv), and the drama-comedy _American Hustle (2013)_ (qv), reuniting with 'David O. Russell' (qv).Bale will re-team with _The New World (2005)_ (qv) director 'Terrence Malick' (qv) for two upcoming projects: _Knight of Cups (2015)_ (qv) and an as-yet-untitled drama.In his personal life, he devotes time to charities including Greenpeace and the World Wildlife Foundation. He lives with his wife, 'Sibi Blazic' (qv), and their two children.::Anonymous"], "spouse": ["'Sibi Blazic' (qv)::(29 January 2000 - present) ( 2 children)"], "trade mark": ["Often portrays obsessive and detached or loner characters", "Frequently works with directors 'Christopher Nolan' (qv), 'Terrence Malick' (qv) and 'David O. Russell' (qv)", "Often stars in period films or plays historical figures", "Chameleon-like changes of appearance for different roles", "Fluent American accent", "Intense physical and mental commitment to his roles", "Remains in character almost constantly during the filming process even going so far as to conduct interviews using whatever accent he is using for that particular film.", "Often gains or loses weight for particular roles such as gaining muscle for the role of Batman/Bruce Wayne in The Dark Knight Trilogy (_Batman Begins (2005)_ (qv), _The Dark Knight (2008)_ (qv) and _The Dark Knight Rises (2012)_ (qv)), losing weight for _The Machinist (2004)_ (qv) and _The Fighter (2010)_ (qv), as well as gaining fat for _American Hustle (2013)_ (qv) and _Vice (2018)_ (qv)", "Mole in the corner of his outer right eye."], "trivia": ["Hand-picked by director/writer 'Mary Harron' (qv) and author 'Bret Easton Ellis' (qv) to star in _American Psycho (2000)_ (qv). Consequently, was noted by the media as the first star of _American Psycho (2000)_ (qv), only to lose the role to 'Leonardo DiCaprio' (qv) and then win it back again.", "Is an excellent horseman and an avid reader.", "He trained for 10 weeks in dancing and martial arts for the dance sequences in 'News' (qv)ies (1992) and _Swing Kids (1993)_ (qv).", "He has an uncanny ear for accents.", "Bale was handpicked by 'Winona Ryder' (qv) for the coveted role of Laurie (Theodore Laurence) in _Little Women (1994)_ (qv).", "His father, 'David Bale' (qv), married feminist icon 'Gloria Steinem' (qv) on September 3, 2000.", "A devoted animal lover, Christian has two dogs [Mojo and Ramone] and three cats [Miriam, Molly and Lilly], which are all strays that he found.", "Christian is active in many organizations, including Ark Trust, Greenpeace, the World Wildlife Foundation, the 'Dian Fossey' (qv) Gorilla Fund, the Redwings Sanctuary, and the Happy Child Mission, and a school for street kids in Rio De Janeiro.", "His grandfather doubled for 'John Wayne' (qv) in two movies, in Africa.", "His first on-screen role was in 1983 at age 9 in a British commercial for Pac-Man cereal.", "He replaced 'Leonardo DiCaprio' (qv) for the film _American Psycho (2000)_ (qv).", "His father, 'David Bale' (qv), died on December 30, 2003, from brain lymphoma at age 62.", "He was raised in England, Portugal and California.", "His great-uncle, Rex Bale, was an actor.", "His father was a former commercial pilot and his mother was a former circus dancer.", "Has three sisters: musician Erin Bale; computer professional Sharon Bale; and director/actress 'Louise Bale' (qv), who appeared in 'News' (qv)ies (1992).", "His grandfather was a stand-up comic and children's entertainer.", "Met his wife through 'Winona Ryder' (qv); she was Ryder's personal assistant.", "With _Batman Begins (2005)_ (qv), he has become the seventh actor to play Batman/Bruce Wayne in a live-action film. The others were: 'Lewis Wilson' (qv) in 1943, 'Robert Lowery' (qv) in 1949, 'Adam West' (qv) in 1966, 'Michael Keaton' (qv) for the first two installments of the Batman film series, to be replaced by 'Val Kilmer' (qv) and 'George Clooney' (qv).", "Dropped an amazing 63 pounds for his role as the emaciated insomniac Trevor Reznik in the film _The Machinist (2004)_ (qv) with only a single vitamin consultation with a nutritionist to guide him. For the most part, he only ate salads and apples, chewed gum, smoked cigarettes, and drank nonfat lattes.", "Considered getting formal acting training at the Royal Academy of Dramatic Art (RADA) when he was twenty, but decided to focus on working instead.", "Has been in two versions of the John Smith/Pocahontas story. He provides the voice of Thomas in _Pocahontas (1995)_ (qv) and plays John Rolfe in _The New World (2005)_ (qv).", "Turned down the opportunity to reprise the role of Patrick Bateman in the 'Roger Avary' (qv)-directed _The Rules of Attraction (2002)_ (qv).", "In the \"Fresh Air with Terry Gross\" radio interview first aired June 13, 2005, he admitted to Gross that because Batman is \"such an American icon\", he had decided not to perform his promotional interviews for the movie _Batman Begins (2005)_ (qv) in his natural English accent. Instead he spoke to Gross in an almost inflection-less mid-American accent, only revealing his dialectic roots with a few words.", "Two of his most famous characters' names have a difference of only one letter: Bateman and Batman.", "Since a young age, he was very ambitious about attending Drama School, and auditioned for the Royal Academy of Dramatic Art (RADA), the London Academy of Music and Dramatic Art (LAMDA), and the Central School of Speech and Drama at age 20. He was accepted to all, but was convinced by his parents to continue working instead. To this day, he regrets not attending drama school for his personal passion of learning his craft.", "The nameplate on his trailer for _Batman Begins (2005)_ (qv) read \"Bruce Wayne\" as opposed to Bale's name.", "Is the first non-American actor to portray Batman/Bruce Wayne.", "Is the youngest actor to portray Batman.", "Owned a home he shared with his sister, 'Louise Bale' (qv), in Manhattan Beach.", "Before he played Batman in _Batman Begins (2005)_ (qv), his sister 'Louise Bale' (qv) played Batman's mother in _The Death of Batman (2003)_ (qv).", "Auditioned for the role of Jack Dawson in _Titanic (1997)_ (qv) and almost got the role but people felt that it wouldn't be \"fair\" having two Brits playing two Americans (Rose was American as well; she says in the movie that the Titanic was a slave ship bringing her back to America).", "He was considered for the role of Will Turner in _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv), which went to 'Orlando Bloom' (qv).", "Is a distant relative of 19th-century thespian 'Lily Langtry' (qv).", "If he plays an American character, he will use an American accent in all the interviews related to the film. He says he does this so the audience is not confused.", "Became a father for the 1st time at age 31 when his wife 'Sibi Blazic' (qv) gave birth to their daughter Emmaline Bale on March 27, 2005.", "Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#13) (2007).", "Although born in Wales, his family is actually English. In 1976, when Bale was two years old, his family left Wales and returned to England.", "Was good friends with the late actor 'Heath Ledger' (qv).", "His fans refer to themselves as \"Baleheads\".", "His father was an activist and adventurer and his mother a circus dancer so he never lived in one place for very long while growing up.", "A very private individual, he has never publicly confirmed the name of his daughter.", "Beat out nearly 4,000 other auditions for the role of Jim Graham in 'Steven Spielberg' (qv)'s _Empire of the Sun (1987)_ (qv).", "Was introduced to acting by his sister, 'Louise Bale' (qv).", "Alongside 'Michael Keaton' (qv), he is the only other actor to portray Bruce Wayne/Batman in more than one live action film.", "Was arrested over verbal assault allegations made by his mother and his sister just hours after he attended the European premiere of his movie _The Dark Knight (2008)_ (qv) in London. Upon reviewing the case, the London police decided not to charge him with anything. [July 2008]", "While working on _Schindler's List (1993)_ (qv), 'Steven Spielberg' (qv) paid a visit to Bale on the set of _Swing Kids (1993)_ (qv), as both movies were partially filmed in Prague.", "He was considered for the role of James Bond in _Casino Royale (2006)_ (qv), which went to 'Daniel Craig' (qv).", "Has said that he considers it an honor to have been called a \"mofo\" by 'Samuel L. Jackson' (qv) in a movie.", "He and his wife belong to the Board of Trustees in the 'Dian Fossey' (qv) Gorilla Fund International.", "Dislikes doing interviews.", "Met 'Drew Barrymore' (qv) on the set of _Empire of the Sun (1987)_ (qv), who was visiting her godfather, 'Steven Spielberg' (qv). He was thirteen and she was twelve. They would both admit later to having a crush on each other at the time.", "He was involved in an infamous incident where he was recorded verbally assaulting cinematographer 'Shane Hurlbut' (qv) on the set of _Terminator Salvation (2009)_ (qv) for interrupting him during an intense scene. Bale has since apologized, but the incident was widely heard across the Internet.", "Is an avid fan of video games and cites Super Mario as one of his all-time favorites growing up.", "Has appeared in _Batman Begins (2005)_ (qv) and _Terminator Salvation (2009)_ (qv). Both were follow-ups to earlier films (_Batman & Robin (1997)_ (qv) and _Terminator 3: Rise of the Machines (2003)_ (qv)) that had starred 'Arnold Schwarzenegger' (qv).", "Has appeared in _The Dark Knight Rises (2012)_ (qv) opposite 'Gary Oldman' (qv) and 'Anne Hathaway' (qv), as Commissioner Gordon and Selina Kyle, respectively. He has also worked with both of their predecessors: 'Pat Hingle' (qv) in _Shaft (2000)_ (qv) and 'Michelle Pfeiffer' (qv) in _A Midsummer Night's Dream (1999)_ (qv). Hingle and Pfeiffer, for their parts, have worked with all three previous Batmans. Pfeiffer worked with 'Michael Keaton' (qv) in _Batman Returns (1992)_ (qv), 'Val Kilmer' (qv) in _The Prince of Egypt (1998)_ (qv), and 'George Clooney' (qv) in _One Fine Day (1996)_ (qv). Hingle, of course, appeared in all the previous Batman films.", "In 1984, he made his stage debut in the West End play \"The Nerd\", opposite 'Rowan Atkinson' (qv).", "Is the third Batman to win an Oscar. 'Ben Affleck' (qv) won Best Original Screeplay for _Good Will Hunting (1997)_ (qv) and 'George Clooney' (qv) won Best Supporting Actor for _Syriana (2005)_ (qv). Bale also won Best Supporting Actor for _The Fighter (2010)_ (qv).", "Has appeared twice on the cover of GQ magazine: March 2007 and June 2009.", "Was compared to a young 'Steve McQueen' (qv) by 'Steven Spielberg' (qv), while filming _Empire of the Sun (1987)_ (qv).", "Holds the records for the most weight lost (63 pounds for _The Machinist (2004)_ (qv)) and gained (80 pounds for _Batman Begins (2005)_ (qv)) for film roles.", "He was a huge fan of the Terminator films long before being cast as John Connor.", "Is the fourth and oldest actor to play the role of John Connor in the Terminator series. He is also the first non-American.", "Has spoken frequently of his dislike for the Disney film 'News' (qv)ies (1992).", "Has played the character of Bruce Wayne/Batman in more live-action films than any other actor.", "Is one of four consecutive Oscar winners in the Best Supporting Actor category whose name begins with Chris, the other actors being 'Christoph Waltz' (qv) (who won twice) and 'Christopher Plummer' (qv).", "He and 'Jeremy Sisto' (qv) have played the roles of both Batman and Jesus Christ in films. Bale is the only one to have played both in live-action productions.", "Has starred in two films about Native Americans and the founding of America: _Pocahontas (1995)_ (qv) and _The New World (2005)_ (qv).", "Has lived in Los Angeles, California since 1992.", "Visited victims of the 2012 Aurora shooting spree.", "Has a mole on his nose right before his right eye.", "Left school at the age of 16.", "He has two roles in common with 'Val Kilmer' (qv): (1) Kilmer played Batman / Bruce Wayne in _Batman Forever (1995)_ (qv) while Bale played _Batman Begins (2005)_ (qv), _The Dark Knight (2008)_ (qv) and _The Dark Knight Rises (2012)_ (qv) and (2) Kilmer played Moses in _The Prince of Egypt (1998)_ (qv) while Bale played him in _Exodus: Gods and Kings (2014)_ (qv).", "(March 8, 2014) He and his wife 'Sibi Blazic' (qv) are expecting their 2nd child together.", "Has played both Moses and Jesus, two of the most important figures in the Bible and Christianity in general.", "He and his wife 'Sibi Blazic' (qv) welcomed their second child, a son, in August 2014.", "He is still an avid motorcyclist he but gave up track racing after getting into multiple accidents and receiving a steel plate for his broken wrist, a titanium clavicle and 25 screws for his hand. At one point he also lost the top of his finger but it was later reattached.", "He has two roles in common with 'Jeremy Sisto' (qv): (1) Bale played Batman / Bruce Wayne in _Batman Begins (2005)_ (qv), _The Dark Knight (2008)_ (qv) and _The Dark Knight Rises (2012)_ (qv) while Sisto played him in _Justice League: The New Frontier (2008)_ (qv) and (2) Sisto played Jesus Christ in _Jesus (1999)_ (qv) while Bale played him in _Mary, Mother of Jesus (1999)_ (qv).", "Has a habit of starring with a host of Australia's biggest actors including 'Hugh Jackman' (qv) (_The Prestige (2006)_ (qv)), 'Cate Blanchett' (qv) (_I'm Not There (2007)_ (qv)), 'Heath Ledger' (qv) (_The Dark Knight (2008)_ (qv)), 'Nicole Kidman' (qv) (_The Portrait of a Lady (1996)_ (qv)), 'Toni Collette' (qv) (_Shaft (2000)_ (qv)), 'Joel Edgerton' (qv) (_Exodus: Gods and Kings (2014)_ (qv)), 'Sam Worthington' (qv) (_Terminator Salvation (2009)_ (qv)), 'David Wenham' (qv) (_Public Enemies (2009)_ (qv)), and 'Jason Clarke' (qv) (_Knight of Cups) to name only some.", "He won an Oscar for playing Dickie Eklund in _The Fighter (2010)_ (qv), making him one of 17 actors to win the Award for playing a real person who was still alive at the evening of the Award ceremony (as of 2015). The other sixteen actors and their respective performances are: 'Spencer Tracy' (qv) for playing Father Edward Flanagan in _Boys Town (1938)_ (qv), 'Gary Cooper' (qv) for playing Alvin C. York in _Sergeant York (1941)_ (qv), 'Patty Duke' (qv) for playing Helen Keller in _The Miracle Worker (1962)_ (qv), 'Jason Robards' (qv) for playing Ben Bradlee in _All the President's Men (1976)_ (qv), 'Robert De Niro' (qv) for playing Jake La Motta in _Raging Bull (1980)_ (qv), 'Sissy Spacek' (qv) for playing Loretta Lynn in Coal Miner's Daughter (1980)_, 'Jeremy Irons' (qv) for playing Claus Von Bullow in _Reversal of Fortune (1990)_ (qv), 'Susan Sarandon' (qv) for playing Sister Helen Prejean in _Dead Man Walking (1995)_ (qv), 'Geoffrey Rush' (qv) for playing David Helfgott in _Shine (1996)_ (qv), 'Julia Roberts' (qv) for playing Erin Brockovich in _Erin Brockovich (2000)_ (qv), 'Jim Broadbent' (qv) for playing John Bayley in _Iris (2001)_ (qv), 'Helen Mirren' (qv) for playing Queen Elizabeth II in _The Queen (2006)_ (qv), 'Sandra Bullock' (qv) for playing Leigh Anne Tuohy in _The Blind Side (2009)_ (qv), 'Melissa Leo' (qv) for playing Alice Eklund-Ward in _The Fighter (2010)_ (qv), 'Meryl Streep' (qv) for playing Margaret Thatcher in _The Iron Lady (2011)_ (qv) and 'Eddie Redmayne' (qv) for playing Stephen Hawking in _The Theory of Everything (2014)_ (qv).", "One of his favorite movies of all time is _Beverly Hills Ninja (1997)_ (qv).", "He gained 43 pounds for his role as Irving Rosenfeld in _American Hustle (2013)_ (qv).", "As of 2019, has appeared in four films that were nominated for the Best Picture Oscar: _The Fighter (2010)_ (qv), _American Hustle (2013)_ (qv), _The Big Short (2015)_ (qv) and _Vice (2018)_ (qv). These films also all earned him Academy Award nominations for acting, winning for The Fighter.", "He was considered for the role of Will Atenton / Peter Ward in _Dream House (2011)_ (qv) that went to 'Daniel Craig' (qv).", "He was considered for the role of Napoleon Solo in _The Man from U.N.C.L.E. (2015)_ (qv) that went to 'Henry Cavill' (qv).", "He auditioned for the role of Mercutio in _Romeo + Juliet (1996)_ (qv) that went to 'Harold Perrineau' (qv).", "He was considered for the role of Brian O'Conner in _The Fast and the Furious (2001)_ (qv) that went to the late 'Paul Walker' (qv).", "He auditioned for the role of Detective Jake Hoyt in _Training Day (2001)_ (qv) that went to 'Ethan Hawke' (qv).", "He turned down the lead role in _Noah (2014)_ (qv) in favour of _Exodus: Gods and Kings (2014)_ (qv).", "He turned down the role of Leo Demidov in _Child 44 (2015)_ (qv) that went to 'Tom Hardy' (qv).", "Contrary to popular belief, he didn't audition for the role of Robin/Dick Grayson in _Batman Forever (1995)_ (qv). He said, \"I'd never have auditioned to be bloody Robin\".", "He was considered for the lead role in _Robin Hood (2010)_ (qv) that went to 'Russell Crowe' (qv).", "He was going to star in Steve 'Job' (qv)s (2015) with 'David Fincher' (qv) directing.", "He was considered to play Norman Bates in _Psycho (1998)_ (qv) that went to 'Vince Vaughn' (qv).", "He was originally cast as Neil in _To the Wonder (2012)_ (qv), but dropped out. 'Ben Affleck' (qv) replaced him.", "He was considered for the role of Adrian Doyle Pryce/The Stranger in _Oldboy (2013)_ (qv) that went to 'Sharlto Copley' (qv).", "He was considered for the role of Tom Ripley in _The Talented Mr. Ripley (1999)_ (qv) that went to 'Matt Damon' (qv).", "He was originally cast as Rob Hall in _Everest (2015)_ (qv), but dropped out in favour of _Exodus: Gods and Kings (2014)_ (qv).", "He was considered for the role of Pvt/LCpl Anthony Swofford in _Jarhead (2005)_ (qv) that went to 'Jake Gyllenhaal' (qv).", "He was originally cast as 'George W. Bush' (qv) in _W. (2008)_ (qv). He spent months researching for the role, but dropped out after he was not satisfied with the prosthetic makeup tests. 'Josh Brolin' (qv) replaced him.", "He turned down the role of Bryan Woodman in _Syriana (2005)_ (qv), as he was busy filming _The New World (2005)_ (qv).", "Friends with Dark Knight Trilogy cast: Michael Caine, Katie Holmes, Maggie Gyllenhaal, 'Gary Oldman' (qv), 'Anne Hathaway' (qv), 'Tom Hardy' (qv), Marion Cottilard and Aaron Eckhart.", "Applied for U.S. citizenship in 2010 and received it in 2014.", "He was considered for the role of Norman Bates in _Psycho (1998)_ (qv) before 'Vince Vaughn' (qv) was cast.", "Won the 2019 Golden Globe Award in the Best Performance by an Actor in a Motion Picture - Musical or Comedy category for his role as Dick Cheney in _Vice (2018)_ (qv).", "Born on the same date as Olivia Colman.", "Shares the same month and day of birth--January 30--with Vice President Dick Cheney, who he portrays in _Vice (2018)_ (qv).", "Nominated for a 2019 Academy Award in the Best Actor in a leading Role category for his role as Dick Cheney in _Vice (2018)_ (qv) but lost to 'Rami Malek' (qv) for _Bohemian Rhapsody (2018)_ (qv).", "He is the first person to be nominated for an academy award for playing a real life vice president.", "He shares the same birthday as dick Cheney; whom he played in vice(2018)."], "quotes": ["[interview in Spin magazine, March 1996] An actor should never be larger than the film he's in.", "[on dealing with the resulting media attention of _Empire of the Sun (1987)_ (qv) at age 13] It was horrific. I was almost crying in interviews and running away during press conferences, pretending I was going to the bathroom and just disappearing.", "[on the sudden fame that resulted after _Empire of the Sun (1987)_ (qv)] I enjoyed making the film, but I was shocked when I received all the attention when I got home to Bournemouth. Girls were all over me, boys wanted to fight me, and I was being asked to open local fêtes when all I wanted to do was ride my BMX bike in the woods. I told my parents I wasn't interested in doing anything again because the attention ruined it.", "I don't want to know about the lives of other actors and I don't want people to know too much about me. If we don't know about the private lives of other actors, that leaves us as clean slates when it comes to playing characters. That's the point, they can create these other characters and I can believe them. I think if you're a good enough actor, that's the way to longevity in the film business. Keep everybody guessing.", "I started my career without fans.", "[on his 63-pound weight loss for _The Machinist (2004)_ (qv)] I had a stupid kind of feeling of invincibility, like, \"I can do it, I can manage it.\" I really did feel like I hit this point of enlightenment.", "I always like that. Whenever there's a project where everyone's going, \"Oooooh, it's a bit dodgy\", I always like it. If you actually look at it, there tends not to be anything risky at all. Why did I start acting in the first place? I didn't do it to be mediocre or to please everybody all the time.", "I'd love to remain a secret and still work, but I also want people to see the movies I'm in and get a higher profile because of that. I like to think that as long as you continue choosing diverse roles, you can avoid becoming predictable.", "It's the actors who are prepared to make fools of themselves who are usually the ones who come to mean something to the audience.", "[on his transformation into Patrick Bateman for _American Psycho (2000)_ (qv)] The character is so vain and obsessed with his looks. While the psychology of the character was something that I could perform, you can't fake the physicality. Being English, I tend to enjoy going down to the pub far more than going to the gym, so it was very unnatural for me. I just had to convince myself that I loved it, which was the most difficult thing about playing this part. Working out is incredibly boring. I swear it's true that the bigger your muscles get, the fewer brain cells you have. I found I had to stop thinking when I was in the gym because if I thought about it, I'd realize how ridiculous it was that I was pumping iron when I could've been out having a drink and a cigarette and enjoying some lunch. I did three hours a day for six weeks with a personal trainer and some time before that. I ate an awful lot during training and then almost nothing during filming.", "The only thing that I'm obsessed with is sleeping and, actually, it is more than an obsession, it is a pleasure. I love sleeping so much that I could do it 12 hours a day if I didn't have to turn on the alarm clock... and still, sometimes...", "Our Batman [_Batman Begins (2005)_ (qv)] is centered on the early days. It's an explanation. It's certainly not Batman No. 5. It's a reinvention. We want you to forget there has ever been a Batman before this one.", "[on _Batman Begins (2005)_ (qv)] I've never felt like the Batman character in the films was given as much time as any of the villains. The villains were always the most interesting characters, too. Batman has always been this very bizarre, almost blind character running through the middle of the story. Our film is different.", "[on _Batman Begins (2005)_ (qv)] I contacted them. I heard they were doing some low-budget Batman not aimed at kids and I was tantalized. I had appreciated the Batman movies, but I wasn't really a fan and I didn't know the TV series. But I read some of the graphic novels, and they were very dark and very interesting.", "I spent about three weeks in Chicago last July doing night shoots [for _Batman Begins (2005)_ (qv)]. It's a great city, but the humidity was tough under the Batsuit. Uh, it got a little bad. It's hot enough in the Batsuit, let alone in the Chicago heat.", "I needed money because I had just bought a house, but I just kept saying, \"I really can't do another movie that I know is not going to turn out the way I want it to, and that I have to make a lot of concessions in my head for.\".", "For me, there's a bigger risk trying [_Batman Begins (2005)_ (qv)]. Ultimately, the big point was that ['Christopher Nolan' (qv)], who you would not expect to be doing that kind of movie, was going to direct it, which is exactly what I was looking for, because you want to do something totally different from the other Batman movies. I always thought there could be a really good movie made about Batman and when I heard that Chris was doing it I thought, \"Well, he's not a director that you would expect, therefore you're going to get the unexpected from him.\" I think there's a great potential for going very dark with it, it's a fascinating character, very complex psychologically, which I've never seen done. You know, you have the two extremes, which are both very good. You can either go the very camp 'Adam West' (qv) TV series thing [_Batman (1966)_ (qv)], which was great in its own way, or you can go more the way of the graphic Dark Knight novels which delve somewhat deeper.", "I had spent weeks staring at the wall in my house out of depression because of things that had gone wrong and the choices I had made. When I read _The Machinist (2004)_ (qv), I just went, \"Wow! This is perfect.\" I was having dreams about the character and I couldn't stop thinking about it. I felt like this one was going to save my arse, and pull me out of the depressed state I had got into.", "I did other things, but my heart was never in it. A lot of actors say that theater's the thing for them. And that's great, and I'm not one to speak with any authority about it because of not having done it properly. For me, movies are what I love.", "At first, I was somewhat hesitant to do the role [_Batman Begins (2005)_ (qv)]. I mean, after all, Batman is an icon. But I remember, as clear as day, being at the grocery store the day the movie opened, and this little boy saw me. He couldn't have been more than five years old. He just walked right up to me and hugged me. He hugged me, and I was so moved by it that I hugged him back. Then he looked up at me and said, \"You're my hero.\" And in that moment, I knew that not only as an actor that I had done my job, but that I had made the right decision to play Batman. And I've never looked back on my the decision to play Batman since.", "[on playing Batman] You couldn't pull it off unless you became a beast inside that suit.", "I only sound intelligent when there's a good scriptwriter around.", "I'm English. Our dentistry is not world famous. But I made sure I got moldings of my old teeth beforehand because I miss them.", "I don't think I'm like any of the characters I've played. They're all really far from who I am.", "You can't help but find that violence is endlessly fascinating -- and I mean true violence, not action-movie violence, just because it is used as the answer to so many problems. We're all taught as kids not to be violent, but you can't help but also see that violence is what works very often. Bullies thrive.", "I think there's a kind of pretentiousness to the idea that serious work is only found in low-budget independent movies -- I can't stand that snobbery.", "I like being kept in the dark myself. You know, like mushrooms: Keep 'em in the dark and feed 'em shit. See, I think that's an enjoyable vegetable to be.", "At the time that ['Christopher Nolan' (qv)] asked me to do it [_Batman Begins (2005)_ (qv)], I actually couldn't do one push-up. They sent me to a trainer, who was having to hold my T-shirt at the back just to pull me up. I've come a long way from that.", "[on filming Batman films during the summer] I'm not really looking forward to wearing a black rubber suit in the summertime in humid Chicago. If you see a pool of sweat through the city, follow it and you will find me.", "[on director 'Christopher Nolan' (qv)'s method for filming _Batman Begins (2005)_ (qv)] We tend to shoot at night like some kind of covert operation. So, we have minimal people actually seeing me in that way.", "[on being asked if he knew how big a flop 'News' (qv)ies (1992) was] You say something bad about 'News' (qv)ies and you have an awful lot of people to answer to.", "[on the character of Batman] He's a messed-up individual, as well. He's got all sorts of issues. He's just as twisted and messed-up as the villains he's fighting, and that's part of the beauty of the whole story.", "[on his career] I've been able to work on movies that I like very much in the past few years, which I think have turned out how I had hoped that they would. And, I'm human, you know; that makes me feel good. I like it when people like what I do. I don't like it when people are laughing at me for what I do, you know? I mean, I'd love to say I was completely impervious to anybody's opinion, but that just ain't the truth. Of course, it matters. At the same time, there's also a danger when you start playing it too safe. After all, what am I paid to do? I'm paid to essentially make an ass out of myself, if needed. And occasionally, in doing that, you're going to fall flat on your face. But, I have learned, through doing that numerous times in my life, that there's also a ton of enjoyment to what other people see as humiliation. You can actually come to sort of thrive on that, because in a way, it kind of leads to a sort of fearlessness, if you genuinely don't mind. If the point is that you tried, I think that really is the most important thing. And, like you said, I feel like I've been very fortunate in the last couple of years that I've gotten to do what I loved, which is actually the making of movies, and on top of that, if I've liked how the movies have turned out themselves, then that's fantastic. But, to start getting too comfortable within that would be eventually to start churning out boring, boring chaff. (2007)", "I'm accustomed to not having any map for my life. I'd be reaching for an Uzi if I knew what was going to happen every day. If anybody tells me I shouldn't jump, of course all I want to do is jump and show it can be done.", "Life is not stable. There is a great strength that comes from not being shocked or scared by upheavals.", "I don't think I was particularly in need of superheroes. I never had any fascination with Superman or Spider-Man or a Batman kind of character. If it happened at all, it was imagined characters that I had invented. My dad was a role model for me. He was a fascinating man. There was intrigue and entertainment growing up with him. He gave me an edict that I still pursue: \"Life should never be boring\".", "[on meeting 'Arnold Schwarzenegger' (qv) in a car park] He's got bodyguards and they were all shouting at me and I was going, 'Hold on, hold on, I've met him before!' but they were getting very worried as I walked toward him. But we chatted a bit. He had questions about _Terminator Salvation (2009)_ (qv), he didn't know the script at all but I hear apparently he's now seen the movie... I'll wait to hear what his reaction is...", "Variety is essential for me. I love watching a 'Michael Mann' (qv) movie. I love watching a 'Christopher Nolan' (qv) movie. Just to talk about my stuff, I enjoy a _The Machinist (2004)_ (qv) kind of movie, a _Rescue Dawn (2006)_ (qv), a _3:10 to Yuma (2007)_ (qv), an _American Psycho (2000)_ (qv), whatever. But I also love watching _The Terminator (1984)_ (qv) movies, I love watching the _Batman (1989)_ (qv) movies...", "_Public Enemies (2009)_ (qv) is very timely. The Depression had people resenting the fat cats, the banks and so you've got someone like Dillinger being a hero because he was making a difference - he was getting it back for himself and so many people looked at him and romanticised that.", "You look back at the history of the Oscars - some of the best movies never got sh*t.", "[on 'Heath Ledger' (qv)'s Oscar win for _The Dark Knight (2008)_ (qv)] Heath winning Best Supporting Actor was fantastic. I had dinner with his family a couple of nights before the awards and liked very much they were the people who were picking it up for him. Of course I was really delighted that it did go that way.", "I'm actually someone that's very anti the whole B-Rolls, DVD extras and stuff like that. I understand people are interested, I get that they want to hear about it, but to me I look at it as old school movie magic and with magic you do not reveal your secrets.", "[_The Terminator (1984)_ (qv)] is the original nightmare of just being pursued that everyone has, by somebody who just will not stop, never stops, doesn't give up. And when you've got someone who looked like 'Arnold Schwarzenegger' (qv) coming after you it made a big difference.", "[on avoiding media coverage of 'Heath Ledger' (qv)'s death] I paid no attention to it. I knew him, I knew the family and why the hell would I sit there listening to idiots who don't know anything at all? I literally didn't read anything, didn't watch anything (after he died). If I happened to be watching anything that came on, I switched over straight away. It's incredible the way the voyeuristic outlook is accepted as news.", "[on _The Dark Knight (2008)_ (qv)] Many times, I'll work with actors and I can tell they're thinking: \"What are you doing? Why are you going that far with it?\" or \"You're nuts!\". With ['Heath Ledger' (qv)], I could feel him going: \"I love it!\".", "[on his infamous onset rant on _Terminator Salvation (2009)_ (qv)] I don't feel like I have to explain, \"Well, I'm not really like this. I'm a wonderful guy and I have a lovely smile and how can you not like me?\".", "[on his infamous onset rant on _Terminator Salvation (2009)_ (qv)] It wouldn't have happened if we hadn't been playing that scene, for Christ's sake, between John Connor and his wife, which is probably the most intense one in the movie. I'd definitely say that that guy who was yelling was at least half John Connor, and the rest was 'Christian Bale' (qv).", "Look, I hate to throw people under the bus for making movies I don't think are very good. But for _Terminator Salvation (2009)_ (qv) to be considered with any legitimacy, you have to throw number three [_Terminator 3: Rise of the Machines (2003)_ (qv)] under the bus. It began to spoof the whole thing. To me, that was a sign that the franchise was dead, the mythology was finished.", "[on _Terminator 2: Judgment Day (1991)_ (qv)] I really liked the second one. It had as much to do with the electric atmosphere in the theater when I saw it at 17, when I was first getting out to the States, and I'd never been in a movie theater that had that much noise and excitement throughout the entire movie.", "[on starting a new trilogy with _Terminator Salvation (2009)_ (qv)] I hope that it will be a really fun, great movie trilogy if this one takes off and that we get to do a second or third, with me or not, whatever the scenario is. I think there is actually - in the hands of the right people - a real revival for this and an extension to an already good mythology.", "I was up in Toronto and went to see that movie _Life Is Beautiful (1997)_ (qv). By myself. And when I came out, I had a craving for blood unlike anything I had ever experienced since I decided to go vegetarian at the age of 7. It was a compulsion. It was undeniable. I went to several restaurants, one right after the other, and got the biggest, bloodiest steaks I could get my hands on. It was the first time I had tasted flesh in almost twenty years.", "I've never felt Welsh. I was just born there and I don't remember it. In terms of growing up, it was completely English.", "I wouldn't want someone making a film of my life. I'd be on set every day saying they're telling it wrong.", "[on portraying Bruce Wayne as a jerk] That's always his cover. It's something that has to be there to make people never suspect that he's someone that would ever have the desire or belief, the passion or intelligence, the capability to be Batman. He has to be this kind of ridiculous cliché of a playboy.", "I have very strong opinions about why kids should not be working at such a young age. I think introducing children to a professional industry where they may not recognize the pressure is wrong. Very quickly they're going to be under pressure. This is an adult industry. I would be very skeptical putting anybody I cared about, who was close to me, in this profession at a young age. I absolutely support it as a hobby and as an amateur pursuit, but to enter into it in a professional way is a whole different ball game.", "To be honest, it was only a couple of years ago that I finally decided to stick at acting. Before that, I used to think, \"I don't want to do this any more - I want to quit. I hate it.\" It's such a silly job. Some days I'd think I should be doing something much more important than this. I'd like to say acting is a meaningful and difficult job but it's actually damn easy and pretty pointless. Sometimes I love it but other days I think, \"This sucks.\".", "[on 'David O. Russell' (qv)'s recent work] I think the thing that resonates so much for me with what David has been telling stories about recently is just the fact that the things that feel like disasters in your life, don't turn out to be disasters. That life throws you many curve balls. The things that seem like gifts, can turn out to be disastrous. And never to be surprised at how surprised you can be at life. [2014]", "[on his character's epic comb-over in _American Hustle (2013)_ (qv)] For me it was so unexpected to see this con artist having such an unconvincing con on his head. And that he was so brilliant at what he did but so terrible at what he did on top of his head. There was a great juxtaposition in it. It became a very vital thing to add to it. And very charming as well. Generally, people think of con men being very slick and maybe vain and certainly very smooth operators. We didn't want to make Irv that.", "[on how 'David O. Russell' (qv) likes to hide places on set] One of the funniest things for me on set [of _American Hustle (2013)_ (qv)] was watching where David was going to hide. He always likes to be very close to the actors. He likes to be able to feel the atmosphere of the scene. So literally he'd be trying to hide under our chairs and the DP would be \"No David, I see you there.\" And then he'd be jumping over a table somewhere and finding a spot where he could be very close and get a sense of being right there with us.", "I walk under ladders, I do all that stuff. I do it on purpose. I like provoking superstitions.", "[on 'Terrence Malick' (qv)] Terry has a thing where he loves it when you are not trying to please him, which is very different from most directors. Most directors want you to please them. And they've got a definite goal, which is not really always egotistical. The nature of having a script is that you have points and scenes where you have to take the audience to a certain place by the end of it. So there's always a goal there. With _The New World (2005)_ (qv), there was a script. But, he abandoned it most of the time. He would never have the scenes be in the same place or a repetition of them. There would never be a request of, 'Can you change that a little bit and then we've got it.' It would be, 'OK, let's discover something new about it. But what (working with Malick) means as an actor is that you are not trying so hard. You just sort of see what happens. If it comes naturally, you do it. If it doesn't, you don't. That's what he loves. With this one you've got a character who is a man of words, who has lost all use for his own words, who is tired of talking. But there would be certain scenes where Terry might say to me, 'Alright, this is the topic. Talk a little bit about this.' And it just felt wrong. And sometimes I would be totally silent and it would go great. It's all I needed. As long as you are not attempting something, you are just discovering it as you go along. That's what delights him. He's very excited by what he does and by making films.", "[on being called a 'star'] I'm embarrassed when people say things such as 'star'. It's so vacuous. What if it was the apocalypse right now? What use would I be to anybody? Most people have definite skills but I'd be going 'Yeah, you know what? I'm going to pretend to be somebody else'. That's a great leveller. Ultimately, I'm useless.", "[on _The Promise (2016)_ (qv) and the Armenian Genocide] To my shame, I knew nothing about the Armenian Genocide. When I first read the script, it was an uncanny moment. (...) I really only hope that the film can help and not actually exacerbate any problems. But to me, it doesn't take a genius to see that there's an embarrassment to having to acknowledge the atrocities that occurred in the birthing of a nation [Republic of Turkey]. It happens to many nations. [2017]", "[on _The Promise (2016)_ (qv)] There's something important about a film that many people have tried to stop being made for decades. One and a half million people were killed in the most brutal fashion, and I knew nothing about it, and that's not uncommon. That's improbably bizarre. This is modern history...The fact that this Armenian Genocide happened and no one was ever held accountable may have provoked other genocides since. [2017]", "Thank you to Satan for giving me inspiration on how to play this role! [2019 Golden Globes Award for role of Dick Cheney in 'Vice.']"], "salary history": ["_American Psycho (2000)_ (qv)::$1,000,000", "_The Machinist (2004)_ (qv)::$250,000", "_Batman Begins (2005)_ (qv)::$9,000,000", "_Terminator Salvation (2009)_ (qv)::$8,000,000 + % gross", "_The Dark Knight Rises (2012)_ (qv)::$15,000,000"], "birth date": "1974-01-30", "birth notes": "Haverfordwest, Pembrokeshire, Wales, UK", "_actorID": "66", "_source": "IMDB", "actorID": "0000288", "created_utc_dt": "08/26/2019, 21:54:32"}