{"headshot": "https://m.media-amazon.com/images/M/MV5BMjc4NDc3NDkzMl5BMl5BanBnXkFtZTcwMTAyNTQwMw@@._V1_UY98_CR3,0,67,98_AL_.jpg", "birth name": "Benjamin Edward Meara Stiller", "height": "5' 7\" (1.7 m)", "mini biography": ["Benjamin Edward Meara Stiller was born on November 30, 1965, in New York City, New York, to legendary comedians 'Jerry Stiller' (qv) and 'Anne Meara' (qv). His father is of Austrian Jewish and Polish Jewish descent, and his mother was of Irish Catholic descent (she converted to Judaism).His parents made no real effort to keep their son away from the Hollywood lifestyle and he grew up among the stars, wondering just why his parents were so popular. At a young age, he and his sister 'Amy Stiller' (qv) would perform plays at home, wearing Amy's tights to perform Shakespeare. Ben also picked up an interest in being on the other side of the camera and, at age 10, began shooting films on his Super 8 camera. The plots were always simple: someone would pick on the shy, awkward Stiller ... and then he would always get his revenge. This desire for revenge on the popular, good-looking people may have motivated his teen-angst opus _Reality Bites (1994)_ (qv) later in his career. He both directed and performed in the film, which co-starred 'Winona Ryder' (qv) and 'Ethan Hawke' (qv).Before he got to Hollywood, he put in several consistently solid years in the theater. After dropping out of UCLA, he performed in the Tony Award winner, \"The House of Blue Leaves\". While working on the play, Stiller shot a short spoof of _The Color of Money (1986)_ (qv) starring him (in the 'Tom Cruise' (qv) role) and his _American Playhouse: The House of Blue Leaves (1987)_ (qv) costar 'John Mahoney' (qv) (in the 'Paul Newman' (qv) role). The short film was so funny that 'Lorne Michaels' (qv) purchased it and aired it on _Saturday Night Live (1975)_ (qv). This led to his spending a year on the show in 1989.Stiller made his big screen debut in 'Steven Spielberg' (qv)'s _Empire of the Sun (1987)_ (qv) in 1987. Demonstrating early on the multifaceted tone his career would take, he soon stepped behind the camera to direct Back to Brooklyn for MTV. The network was impressed and gave Stiller his own show, The 'Ben Stiller' (qv) Show (1992). He recruited fellow offbeat comedians 'Janeane Garofalo' (qv) and 'Andy Dick' (qv) and created a bitingly satirical show. MTV ended up passing on it, but it was picked up by Fox. Unfortunately, the show was a ratings miss. Stiller was soon out of work, although he did have the satisfaction of picking up an Emmy for the show after its cancellation.For a while, Stiller had to settle for guest appearance work. While doing this, he saved up his cash and in the end was able to scrape enough together to make _Reality Bites (1994)_ (qv), now a cult classic which is looked upon favorably by the generation it depicted. Ben continued to work steadily for a time, particularly in independent productions where he was more at ease. However, he never quite managed to catch a big break. His first big budget directing job was 'Jim Carrey' (qv)'s _The Cable Guy (1996)_ (qv). Although many critics were impressed, 'Jim Carrey' (qv)'s fans were not. In 1998, _There's Something About Mary (1998)_ (qv) had propelled Stiller into the mainstream spotlight. He also starred in such hit movies as _Keeping the Faith (2000)_ (qv) and _Meet the Parents (2000)_ (qv).::Laffz00@aol.com"], "spouse": ["'Christine Taylor' (qv)::(13 May 2000 - present) ( filed for divorce) ( 2 children)"], "trade mark": ["His characters are often arrogant and short tempered", "Sarcastic deadpan disposition", "Often plays characters who frequently find themselves in very embarrassing, awkward situations", "Short but muscular frame", "Judaism is an often theme in his movies."], "trivia": ["Produced a short film parody of _The Color of Money (1986)_ (qv) entitled \"The Hustler of Money\" which got him noticed by _Saturday Night Live (1975)_ (qv) who eventually offered him employment there.", "Is a major fan of 'Tom Cruise' (qv) and has impersonated Tom for many years. He even portrayed 'Tom Cruise' (qv)'s fictitious crazed stunt double, Tom Crooze, on 2000 MTV Movie 'Awards' (qv) (2000) on a segment called Mission: Improbable. (This segment is included on the _Mission: Impossible II (2000)_ (qv) DVD.) Tom and Ben have been friends ever since 1996.", "Appeared in _Who Wants to Be a Millionaire (1998)_ (qv) on May 9, 2001 and walked away with $32,000 for Project ALS. He phoned his mother, actress 'Anne Meara' (qv), for help but lost on the question worth $250,000.", "Often casts/co-stars with 'Janeane Garofalo' (qv).", "Ben and his wife 'Christine Taylor' (qv), have both guest starred on the TV-show _Friends (1994)_ (qv), though not in the same episode.", "Attended UCLA School of Theater, Film, and Television.", "Briefly appears in the film clip for the song \"Tribute\" by 'Tenacious D' (qv), a band that includes fellow actors 'Jack Black' (qv) and 'Kyle Gass' (qv). He's one of the people walking past the studio booth in the shopping center.", "Ranked #78 in Premiere's 2003 annual Power 100 List. Had ranked #68 in 2002 and #80 in 2001.", "Stiller's famous parents, 'Anne Meara' (qv) and 'Jerry Stiller' (qv), often made cameo appearances in his movies. His sister is 'Amy Stiller' (qv).", "Has a Hollywood \"clique\" of close friends that have often appeared in his movies: 'Owen Wilson' (qv), 'Jack Black' (qv), 'Kyle Gass' (qv) and 'Janeane Garofalo' (qv).", "Helped 'Jenifer Estess' (qv) raised millions of dollars to combat A.L.S. ('Lou Gehrig' (qv)'s disease).", "His favorite actress of all time is 'Diane Keaton' (qv). He even wrote an article about her for Premiere magazine in 1997.", "Frequent co-star of 'Vince Vaughn' (qv), appearing with him in three movies in 2004 alone.", "Is a member of, what the media refers to as, \"The Frat Pack,\" along with 'Will Ferrell' (qv), 'Jack Black' (qv), 'Vince Vaughn' (qv), 'Steve Carell' (qv), 'Owen Wilson' (qv), and 'Luke Wilson' (qv). The \"Frat Pack\" name is a reference to the film, _Old School (2003)_ (qv), featuring Vaughn, Ferrell and 'Luke Wilson' (qv), due to the wide number of films featuring the seven actors. Stiller's \"Frat Pack\" films include _Zoolander (2001)_ (qv), _Envy (2004)_ (qv), _The Royal Tenenbaums (2001)_ (qv) and _Anchorman: The Legend of Ron Burgundy (2004)_ (qv)..", "Is a big fan of _Star Trek (1966)_ (qv). He named his production company \"Red Hour Films\" after an alien riot featured in the episode _Star Trek: The Return of the Archons (1967)_ (qv). Has a humorous, You Tube website \"gag\" episode of \"Star Trek\" where he is imitating Shatner's Captain Kirk.", "Holds a distinct Razzie Award record - nominated for most titles in one year. He was nominated in 2004 for Worst Actor in five of the six films in which he appeared: _Along Came Polly (2004)_ (qv), _Anchorman: The Legend of Ron Burgundy (2004)_ (qv), _Dodgeball: A True Underdog Story (2004)_ (qv), _Envy (2004)_ (qv), and _Starsky & Hutch (2004)_ (qv). The only film he was not nominated in for that year was _Meet the Fockers (2004)_ (qv).", "Has played two very similar characters in the movies _Heavyweights (1995)_ (qv) and _Dodgeball: A True Underdog Story (2004)_ (qv). In both films he plays an obnoxious, slightly insane and formerly overweight fitness instructor who's hell-bent on getting others into shape, and perhaps also on making other peoples' lives miserable.", "Played the part of an arrogant director in _Get Shorty (1995)_ (qv), but the scene was cut.", "In _The King of Queens: Shrink Wrap (2002)_ (qv) he played his own real-life father's father.", "Hosted the MTV Movie 'Awards' (qv) in 1996 along with 'Janeane Garofalo' (qv)", "He and wife 'Christine Taylor' (qv) have both guest-starred on the TV series _Arrested Development (2003)_ (qv). She played \"Sally Sitwell\", the love interest of \"Michael Bluth\" (two episodes) and he played the incompetent magician \"Tony Wonder\" in the episode \"The Sword of Destiny\".", "One of his first showbiz jobs was working as an intern on the 'Alan Thicke' (qv) show _Thicke of the Night (1983)_ (qv).", "His father is from an Ashkenazi Jewish family (from Austria and Poland). His mother, who was of Irish descent, was a convert to Judaism.", "Was considered for the role of \"Willy Wonka\" in _Charlie and the Chocolate Factory (2005)_ (qv).", "Revealed in 2005 that he has bipolar disorder and that it runs in his family.", "His estranged wife, 'Christine Taylor' (qv), appeared in one episode of _Seinfeld (1989)_ (qv) as 'Jerry Seinfeld' (qv)'s girlfriend. His father, 'Jerry Stiller' (qv), had a recurring role on that series as George Costanza's father.", "Every so often he and his father enjoy getting together and going to Alaska to fish in the summer.", "2007 - Ranked #20 on EW's The 50 Smartest People in Hollywood.", "In 2007, Forbes Magazine estimated his earnings for the year to be $38 million.", "Along with 'Kirk R. Thatcher' (qv), one of the few actors to give 'William Shatner' (qv) the middle finger (jokingly) on screen.", "According to \"Jews Who Rock,\" a book by 'Guy Oseary' (qv), Stiller was once a drummer in a band called Capital Punishment that released an album titled \"Roadkill\".", "Fractured his hand in a snowboarding accident on Sunday, December 21, 2008 and was taken to New York's Mount Sinai Hospital.", "Auditioned for a part in _Platoon (1986)_ (qv), even meeting with 'Oliver Stone' (qv).", "Admitted in a Playboy Magazine interview that he auditioned for three or four years before he got a part.", "Longtime friend of actor 'Anthony Barrile' (qv). They met at 12 years old as members of First All Children's Theatre Company in New York City, where they were among the 'Meri-Mini Players'.", "Lives in Los Angeles, California.", "(May 10, 2010) Merited a position in Time magazine's - The 100 Most Influential People in the World (\"Heroes\" category) - with an homage contributed by friend 'Robert De Niro' (qv).", "Along with 'Gerard Butler' (qv), 'Demi Moore' (qv), 'Susan Sarandon' (qv), and director 'Paul Haggis' (qv), he visited a camp for internally displaced persons managed by 'Sean Penn' (qv) and his Jenkins-Penn Humanitarian Relief Organization in Port-au-Prince, Haiti. [April 2010]", "Became a father for the 1st time at age 36 when his now ex-wife 'Christine Taylor' (qv) gave birth to their daughter Ella Olivia Stiller on April 10, 2002. Became a father for the 2nd time at age 39 when his now ex-wife 'Christine Taylor' (qv) gave birth to their son Quinlin Dempsey Stiller on July 10, 2005.", "Filming _Tropic Thunder (2008)_ (qv). [July 2007]", "Directed one Oscar nominated performance: 'Robert Downey Jr.' (qv) in _Tropic Thunder (2008)_ (qv).", "He is left-handed.", "Revealed in \"Medium\" magazine in 2016, that he was diagnosed with prostate cancer in 2014. After treatment, he was declared cancer-free.", "As of 2018, has never appeared in a film nominated for the the Best Picture Oscar.", "His acting mentor is his real-life father 'Jerry Stiller' (qv).", "As an actor, he was highly influenced by 'Jerry Stiller' (qv).", "Has highly praised his real-life father 'Jerry Stiller' (qv) for his stardom in acting as well as doing stand-up comedy.", "Comedian/actor 'Jerry Stiller' (qv) took him, under his wing, ever since birth.", "Credits his real-life father 'Jerry Stiller' (qv) as his favorite acting mentor/best friend."], "quotes": ["[on advice he receives from his father, 'Jerry Stiller' (qv)] My father is always telling me to take care of myself and get a lot of rest. He's always saying, \"Sleep will fix anything. Go take a nap\". I think he's right. I find when I get frazzled, if I get a good night's sleep, I feel much better about things.", "If my parents were, like, plumbers, who knows what I would be doing?", "There's an old saying in Hollywood: It's not the length of your film, it's how you use it.", "I have no problem with straight actors playing gay, but I always feel like I can tell. Does that sound horrible?", "I have not been an easygoing guy. I think it's called bipolar manic depression. I've got a rich history of that in my family. Our family has publicly gone into therapy, so that's out in the open.", "I pay a huge chunk of money to my agent and publicity people to shield me from my fan mail. I don't even want to know how many letters I get. I don't see fan mail as a good thing. It always makes me think of stalkers.", "Normally, people tend to shut off their ambitions and competitive thinking because it doesn't help them much in normal life. But in the movie business you've constantly got to prove yourself. So I can be a real asshole on the set sometimes.", "Show business is great, but when you're in a movie that made more than $120 million, the perspective changes. I'd never had the experience of being in a movie that so many people found funny. After the enormous success of _There's Something About Mary (1998)_ (qv), I was able to command much more money and I got recognized more. But the reason for all this is only because the movie made money, not because I'm any more talented or better looking.", "Every actor is out there trying to get parts, auditioning, going to acting class and creating a network of people who are in the same position you are. I couldn't sit around and wait to get work, because it wasn't happening. I would just try to create my own projects with friends who were filmmakers.", "I think most actors have incredibly big egos, but they're also incredibly insecure. That's a bad combination. I include myself in this group. For whatever psychological reasons, we want and need approval from everybody in the universe, though we also think we're totally unworthy of it. We need to validate ourselves through our work.", "(On his most memorable pre-acting job) For a summer I was a busboy and waiter at a place in New York called Cafe Central, which was a hip, trendy restaurant in 1985. First I bused tables and was really bad at it. I'm clumsy at carrying plates and glasses. You had to have a swiftness and a facility for carrying stacked objects. That wasn't me. I was interested in who was coming in, because it was an actor hangout. I would want to see who was talking to whom and what they were saying - basically, stuff you shouldn't do as a person of service. 'Dudley Moore' (qv) came into the restaurant and I was really interested in what he was saying. I kept going over to make sure that he and his companion had enough coffee and that their plates were cleared. I think I really annoyed him. I kept changing the ashtrays with that move where you put the clean ashtray over the full ashtray and remove both and put back the clean ashtray. I think I did that one time too many. Then I became a waiter there, and dealing with orders and the kitchen was worse. It prompted me to get acting work.", "(1998 quote on auditioning) It's hard to maintain a sense of dignity in an audition. I have done so many auditions where I've put it out there and have been met with that kind of blank stare - \"Great! Thanks! OK! Great work! Thanks for coming in!\" At the door I'm thinking, 'What the hell am I doing with my life?'", "[on _Zoolander (2001)_ (qv)] It wasn't a big hit. It came out 10 days after 9/11, so a strange time to release a movie but I'm not sure it wouldn't have been any bigger at any other time.", "What I really like about directing is that it's easier, a different pressure."], "salary history": ["_There's Something About Mary (1998)_ (qv)::$3,000,000", "_Zoolander (2001)_ (qv)::$2,500,000", "_Meet the Fockers (2004)_ (qv)::$10,000,000", "_Greenberg (2010)_ (qv)::$6,000,000", "_Little Fockers (2010)_ (qv)::$20,000,000", "_The Big Year (2011)_ (qv)::$1,000,000 (producer)", "_Tower Heist (2011)_ (qv)::$15,000,000"], "birth date": "1965-11-30", "birth notes": "New York City, New York, USA", "_actorID": "23", "_source": "IMDB", "actorID": "0001774", "created_utc_dt": "08/26/2019, 21:54:03"}