{"headshot": "https://m.media-amazon.com/images/M/MV5BMjA0MjMzMTE5OF5BMl5BanBnXkFtZTcwMzQ2ODE3Mw@@._V1_UY98_CR8,0,67,98_AL_.jpg", "nick names": ["Bruno"], "birth name": "Walter Bruce Willis", "height": "6' (1.83 m)", "mini biography": ["Actor and musician 'Bruce Willis' (qv) is well known for playing wisecracking or hard-edged characters, often in spectacular action films. Collectively, he has appeared in films that have grossed in excess of $2.5 billion USD, placing him in the top ten stars in terms of box office receipts.Walter 'Bruce Willis' (qv) was born on March 19, 1955, in Idar-Oberstein, West Germany, to a German mother, Marlene K. (from Kassel), and an American father, David Andrew Willis (from Carneys Point, New Jersey), who were then living on a United States military base. His family moved to the U.S. shortly after he was born, and he was raised in Penns Grove, New Jersey, where his mother worked at a bank and his father was a welder and factory worker. Willis picked up an interest for the dramatic arts in high school, and was allegedly \"discovered\" whilst working in a café in New York City and then appeared in a couple of off-Broadway productions. While bartending one night, he was seen by a casting director who liked his personality and needed a bartender for a small movie role.After countless auditions, Willis contributed minor film appearances, usually uncredited, before landing the role of private eye \"David Addison\" alongside sultry 'Cybill Shepherd' (qv) in the hit romantic comedy television series _Moonlighting (1985)_ (qv). The series firmly established 'Bruce Willis' (qv) as a hot new talent, and his sarcastic and wisecracking P.I. was in effect a dry run for the role of hard-boiled NYC detective \"John McClane\" in the monster hit _Die Hard (1988)_ (qv). This superbly paced action film balanced laconic humor and wholesale destruction as Willis' character single handedly battles a gang of ruthless international thieves in a Los Angeles skyscraper. Willis reprized the role of tough guy cop \"John McClane\" in the eagerly anticipated sequel _Die Hard 2 (1990)_ (qv) set at snowbound Washington's Dulles International Airport as a group of renegade Special Forces soldiers seek to repatriate a corrupt South American general. Excellent box office returns demanded a further sequel _Die Hard with a Vengeance (1995)_ (qv) this time also starring 'Samuel L. Jackson' (qv) as a cynical Harlem shopowner unwittingly thrust into assisting McClane during a terrorist bombing campaign on a sweltering day in NYC.Willis found time out from all the action mayhem to provide the voice of \"Mikey\" the baby in the very popular family comedies _Look Who's Talking (1989)_ (qv), and its sequel _Look Who's Talking Too (1990)_ (qv) also starring 'John Travolta' (qv) and 'Kirstie Alley' (qv). Over the next decade, Willis starred in some very successful films, some very offbeat films and some unfortunate box office flops. _The Bonfire of the Vanities (1990)_ (qv) and _Hudson Hawk (1991)_ (qv) were both large scale financial disasters that were savaged by the critics, and both are arguably best left off the CVs of all the actors involved, however Willis was still popular with movie audiences and selling plenty of theatre tickets with the hyperviolent _The Last Boy Scout (1991)_ (qv), the darkly humored _Death Becomes Her (1992)_ (qv) and the mediocre police thriller _Striking Distance (1993)_ (qv). During the 1990s, Willis also appeared in several independent and low budget productions that won him new fans and praise from the critics for his intriguing performances working with some very diverse film directors. He appeared in the oddly appealing _North (1994)_ (qv), as a cagey prizefighter in the 'Quentin Tarantino' (qv) directed mega-hit _Pulp Fiction (1994)_ (qv), the 'Terry Gilliam' (qv) directed apocalyptic thriller _Twelve Monkeys (1995)_ (qv), the 'Luc Besson' (qv) directed sci-fi opus _The Fifth Element (1997)_ (qv) and the 'M. Night Shyamalan' (qv) directed spine-tingling epic _The Sixth Sense (1999)_ (qv).Willis next starred in the gangster comedy _The Whole Nine Yards (2000)_ (qv), worked again with \"hot\" director 'M. Night Shyamalan' (qv) in the less gripping _Unbreakable (2000)_ (qv), and in two military dramas, _Hart's War (2002)_ (qv) and _Tears of the Sun (2003)_ (qv) that both failed to really fire with movie audiences or critics alike. However, Willis bounced back into the spotlight in the critically applauded 'Frank Miller' (qv) graphic novel turned movie _Sin City (2005)_ (qv), the voice of \"RJ\" the scheming raccoon in the animated hit _Over the Hedge (2006)_ (qv) and \"Die Hard\" fans rejoiced to see \"John McClane\" return to the big screen in the high tech _Live Free or Die Hard (2007)_ (qv) aka \"Die Hard 4.0\".Willis was married to actress 'Demi Moore' (qv) for approximately thirteen years and they share custody to their three daughters.::firehouse44@hotmail.com"], "spouse": ["'Emma Heming Willis' (qv)::(21 March 2009 - present) ( 2 children)", "'Demi Moore' (qv)::(21 November 1987 - 18 October 2000) ( divorced) ( 3 children)"], "trade mark": ["Frequently plays a man who suffered a tragedy, had lost something or had a  crisis of confidence or conscience.", "Frequently plays likeable wisecracking heroes with a moral centre", "Headlines action-adventures, often playing a policeman, hitman or someone in the military", "Often plays men who get caught up in situations far beyond their control", "Sardonic one-liners", "Shaven head", "Distinctive, gravelly voice", "Smirky grin.", "Known for playing cynical anti-heroes with unhappy personal lives"], "trivia": ["Was high school student council president.", "His recording of \"Respect Yourself\" reached #5 in January 1987.", "Bruce and Demi announce they are ending their marriage of 11 years. No reasons given. [June 1998]", "Ranked #22 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "He was born on a military base in Germany. His mother, Marlene, was German, and was born in Kassel, Germany. His father, David Willis, was American-born, and had English, and smaller amounts of Dutch, French, Irish and Welsh ancestry.", "Has appeared on Late Show with 'David Letterman' (qv) _(1993)_ (qv) to advertise for 'Demi Moore' (qv)'s _Striptease (1996)_ (qv) by doing his own undressing act. [1996]", "As a young man, his personality was very much like that of the character that he portrayed on _Moonlighting (1985)_ (qv). He was always getting into trouble because of this and was bodily ejected from parties by the hosts for being obnoxious.", "Has been very vocal in his support of almost every major Republican candidate in recent history except 'Bob Dole' (qv). He felt that presidential candidate Dole was out of line in his attacks on 'Demi Moore' (qv) and her role in the movie _Striptease (1996)_ (qv).", "Was the first actor to ever \"act\" in a video game (_Apocalypse (1998)_ (qv)). No one before had ever done voice work along with having their likeness and movements digitally added to the game, as well as receiving prominent billing on the game's cover.", "Has stated, in 1997, 2001 and 2013, that he will no longer be doing violent action or \"save-the-world\" movies.", "Wears his watch upside down with the face on the inside of his wrist. This is also visible in many movies he has done (_Die Hard with a Vengeance (1995)_ (qv), _Mercury Rising (1998)_ (qv), etc.) where they have not requested him to flip this over.", "Was arrested after reportedly disturbing the peace and assaulting a police officer who was called to quiet a raucous party at his home. The charges were dropped after Willis agreed to apologize to his neighbors. [May 1987]", "Acting helped him to overcome a debilitating childhood stutter. In an interview with GQ magazine (March 2013), Willis revealed: \"I had a terrible stutter. But then I did some theater in high school and when I memorized words, I didn't stutter, which was just miraculous. That was the beginning of the gradual dispelling of my stutter. I thought I was handicapped. I couldn't talk at all. I still stutter around some people now.\".", "His younger brother Robert Willis died of pancreatic cancer at age 42. [2001]", "Was originally cast as Terry Benedict in _Ocean's Eleven (2001)_ (qv) but dropped out.", "Attended Montclair State University in Montclair, New Jersey.", "Set a new benchmark for actors' salaries when he was paid $5 million for _Die Hard (1988)_ (qv) in 1988. Eight years later, his wife, 'Demi Moore' (qv), set a benchmark of $12 million with _Striptease (1996)_ (qv).", "His ineptness as a waiter forced him to become a bartender.", "Was named Man of the Year by Harvard University's Hasty Pudding Theatricals. [February 2002]", "Was president of a drama club at school.", "Worked in a chemical factory before going to college.", "He filled in as a last-minute host for 'David Letterman' (qv) on February 26, 2003, a show he was supposed to be the guest for. This was Letterman's first \"sick day\" in 20 years (other than his time off for heart surgery).", "Ranked #3 in Star TV's Top 10 Box Office Stars of the 1990s. [2003]", "Lives in Hailey, Idaho, where he owns the Mint bar and the Liberty Theater. He also owns the old Hailey Drug Store, but the building has been vacant and unused since the early 1990s.", "The scar on his right shoulder is from surgery due to complications from a broken arm when he was age 17.", "Personally recommended 'Bonnie Bedelia' (qv) for the part of his estranged wife in _Die Hard (1988)_ (qv), her most visible role since _They Shoot Horses, Don't They? (1969)_ (qv).", "Is the hero of singer 'Nick Lachey' (qv). Lachey's ex-wife, 'Jessica Simpson' (qv), unsuccessfully auditioned for the role of Kate McClane, John McClane's daughter in _Live Free or Die Hard (2007)_ (qv).", "He ad-libbed many of John McClane's one-liners in the \"Die Hard\" films.", "Attended and graduated from Penns Grove High School in Penns Grove, New Jersey. His class voted him \"Most School Spirit\". [1973]", "Recommended 'Michael Clarke Duncan' (qv) to play the role of John Coffey in _The Green Mile (1999)_ (qv).", "Sued Revolution Studios for unspecified damages related to a blow to his forehead that he received during \"ultrahazardous activity\" involved in the filming of _Tears of the Sun (2003)_ (qv). He claims that it has caused him extreme mental, physical and emotional pain and suffering. [October 2004]", "Attended the 'Stella Adler' (qv) Conservatory / Theatre program in New York City for three years.", "Plays the harmonica.", "France awarded him Officer of the Order of Arts and Letters in April 2005. \"France pays homage to an actor who represents the force of American cinema and the power of emotions that he invites us to share on screens throughout the world\", Culture Minister 'Renaud Donnedieu de Vabres' (qv) said. \"I'm nervous. Bonjour Paris\", he replied.", "After dating 'Brooke Burns' (qv) for ten months and finally being engaged to her, they decided to separate because of the difficulties with maintaining a long-distance relationship. [June 2004]", "Was chosen to play John McClane in _Die Hard (1988)_ (qv) because the producers felt he brought warmth and humor to an otherwise cold and humorless character. 'Arnold Schwarzenegger' (qv) and 'Sylvester Stallone' (qv) had turned down the role.", "Has been special ambassador of his birth town Idar-Oberstein since his 50th birthday.", "Was a guest at Moore's wedding to 'Ashton Kutcher' (qv).", "Ten directors cast him at least twice in their films: 'Blake Edwards' (qv), 'Amy Heckerling' (qv), 'Rob Reiner' (qv), 'Robert Benton' (qv), 'John McTiernan' (qv), 'Alan Rudolph' (qv), ''M. Night Shyamalan' (qv)', 'Quentin Tarantino' (qv), 'Robert Rodriguez' (qv) and 'Barry Levinson' (qv).", "Along with 'Arnold Schwarzenegger' (qv) and 'Charlton Heston' (qv), Willis was one of very few Hollywood celebrities to publicly support the Iraq war. While visiting the troops in 2003, he offered $1 million of his own money for the man who would capture 'Saddam Hussein' (qv). When Hussein was captured, it turned out that military rules prevent troops from collecting such a reward.", "Served as a delegate at the Republican National Convention in 1992. In 2000, he was unable to narrate a biographical film of previous presidents to be shown at the RNC due to scheduling conflicts.", "Has worked closely with two promising child stars: 'Miko Hughes' (qv) in _Mercury Rising (1998)_ (qv) and 'Haley Joel Osment' (qv) in _The Sixth Sense (1999)_ (qv). The boys had major roles in the films opposite him.", "Announced his intention to make a film in which American soldiers will be depicted as brave fighters for freedom and democracy. This will be based on the exploits of the heavily decorated members of \"Deuce Four\", the 1st Battalion, 24th Infantry, which has spent the past year battling insurgents in the northern Iraqi town of Mosul. Willis attended Deuce Four's homecoming ball this month in Seattle, Washington, where the soldiers are on leave, along with 'Stephen J. Eads' (qv), the producer of _Armageddon (1998)_ (qv) and _The Sixth Sense (1999)_ (qv). The actor said that he was in talks about a film of \"these guys who do what they are asked to for very little money to defend and fight for what they consider to be freedom\". Willis is likely to take on the role of the unit's commander, Lieutenant Colonel Erik Kurilla. [November 2005]", "Honored in Paris for his contribution to the film industry, by the French government. The actor was awarded Officer of the Order of Arts and Letters at a ceremony in the capital, where he was presented with his honor by French Culture Minister 'Renaud Donnedieu de Vabres' (qv). de Vabres said, \"This is France's way of paying tribute to an actor who epitomizes the strength of American cinema, the power of the emotions that he invites us to share on the world's screens and the sturdy personalities of his legendary characters.\" Willis replied in French that he was \"very touched\" to receive his medal, adding, \"Thank you France and Culture Minister for this great, great honor.\". [April 2005]", "In November 2005, he offered $1 million of his own money to anyone who turns in al-Qaeda terror leaders 'Osama bin Laden' (qv), 'Ayman Al-Zawahiri' (qv) or 'Abu Musab Al-Zarqawi', the alleged brains behind the 9/11 attacks. Willis announced his reward on the American television show _Rita Cosby Live & Direct (2005)_ (qv), where he also criticized what he claimed to be \"biased\" media coverage of the Iraq war.", "Appointed by President 'George W. Bush' (qv) as national spokesman for Children in Foster Care. [July 2002]", "His performance as John McClane in the \"Die Hard\" trilogy is ranked #46 on Premiere magazine's 100 Greatest Movie Characters of All Time.", "He and 'Linda Fiorentino' (qv) were employed as bartenders in the early 1980s at the Kamikaze Club in New York City.", "'Little Richard' (qv) presided over his wedding to Moore. 'Ally Sheedy' (qv) was one of the bridesmaids. The ceremony and reception was arranged by Tri-Star Pictures.", "Married 'Demi Moore' (qv) at the Golden Nugget Hotel in Las Vegas, Nevada.", "Turned down the role of Sam Wheat in _Ghost (1990)_ (qv) because he did not think the plot would work and that playing a ghost would be detrimental to his career. Ironically, he played a ghost in _The Sixth Sense (1999)_ (qv), which was a critical success and is widely regarded as one of his best performances.", "He apologized to Colombia after blaming the nation for America's drug problems. The star insisted the United States is as much to blame for the prolific trade and confessed he didn't mean to single out any one country as the supplier. He told the New York Daily 'News' (qv), \"I said Colombia because it was the first country to come to mind.\" The actor was dubbed \"ignorant\" and \"ungrateful\" by the Colombian president for his comments in March 2006, and advised not to base his arguments on \"Hollywood clichés\".", "In November 2000, he urged his fans to vote for Republican candidate 'George W. Bush' (qv) in the presidential election. He told an interviewer, \"If you guys vote for 'Al Gore' (qv), you're out of your minds ... Gore's a knucklehead ... just the lying and mendacity of the last eight years of the regime that 'Al Gore' (qv) was a part and parcel of ... I mean, there is only so much lying the American people will take before they go, 'Uh, this doesn't seem like a good idea.' You have to look at what he does and what he stands for.\".", "He was awarded a Star on the Hollywood Walk of Fame at 6915 Hollywood Boulevard in Hollywood, California on October 16, 2006. The ceremony was attended by his friends 'Don Johnson' (qv), 'Sylvester Stallone' (qv) and 'Kevin Costner' (qv).", "Has three younger siblings: Florence Willis, David Willis and Robert Willis.", "Often supports the careers of other actors he has met on set, and asks they be given supporting roles on later films, most famously 'Michael Clarke Duncan' (qv), whom he worked with on _The Whole Nine Yards (2000)_ (qv), asked for him on _Armageddon (1998)_ (qv) and suggested him to the producers of _The Green Mile (1999)_ (qv). Other actors include 'Billy Bob Thornton' (qv) (_Armageddon (1998)_ (qv), _Bandits (2003)_ (qv)), 'Johnny Messner' (qv) (_Tears of the Sun (2003)_ (qv), _The Whole Ten Yards (2004)_ (qv)), 'Nick Chinlund' (qv) (_Tears of the Sun (2003)_ (qv), _The Kid (2000)_ (qv)) and 'Cole Hauser' (qv) (_Hart's War (2002)_ (qv), _Tears of the Sun (2003)_ (qv)). Met and befriended 'Matthew Perry' (qv) on the set of _The Whole Nine Yards (2000)_ (qv) and then appeared on _Friends (1994)_ (qv) at Perry's request.", "Has appeared in 14 movies with numbers in the title: _The First Deadly Sin (1980)_ (qv), _Twelve Monkeys (1995)_ (qv), _Four Rooms (1995)_ (qv), _The Fifth Element (1997)_ (qv), _The Sixth Sense (1999)_ (qv), _The Whole Nine Yards (2000)_ (qv), _16 Blocks (2006)_ (qv), _The Whole Ten Yards (2004)_ (qv), _Die Hard 2 (1990)_ (qv), _Loaded Weapon 1 (1993)_ (qv), _Ocean's Twelve (2004)_ (qv), _Catch .44 (2011)_ (qv), _The Expendables 2 (2012)_ (qv) and _RED 2 (2013)_ (qv).", "Has the distinction of playing two psychologists who have suffered serious work-related emotional trauma: Dr. Bill Capa in _Color of Night (1994)_ (qv) and Dr. Malcolm Crowe in _The Sixth Sense (1999)_ (qv). Ironically, _Color of Night (1994)_ (qv) was a box-office bomb and was widely ridiculed by critics (this movie did much better business in home video market, though), while _The Sixth Sense (1999)_ (qv) became a box-office smash and received several Oscar nominations, including Best Picture.", "During the Lebanon crisis, Willis signed his name on an ad in the Los Angeles Times in support of Israel, along with 'Nicole Kidman' (qv) and numerous other Hollywood celebrities.", "He was the only celebrity that attended 'Julia Roberts' (qv)' wedding to 'Daniel Moder' (qv). Their friendship is referred to in _Ocean's Twelve (2004)_ (qv), when he mistakes Tess Ocean for 'Julia Roberts' (qv), and asks her about 'Danny'.", "Is a huge supporter of NFL team New York Jets.", "Co-founder of \"Planet Hollywood\" together with 'Demi Moore' (qv), 'Sylvester Stallone' (qv) and 'Arnold Schwarzenegger' (qv). [1991]", "Has named his acting idols as 'Robert De Niro' (qv), 'Gary Cooper' (qv), 'Steve McQueen' (qv) and 'John Wayne' (qv).", "Endorsed his friend and former co-star 'Fred Dalton Thompson' (qv) in his failed bid to win the Republican nomination for the 2008 presidential election.", "Maxim magazine had named his sex scenes in _Color of Night (1994)_ (qv) as the best sex scenes ever in film history.", "Became the first actor to guest star on _Friends (1994)_ (qv) and win an Emmy Award in the Outstanding Guest Actor category for their performance.", "Was considered for the role of Kyle Reese in _The Terminator (1984)_ (qv), which went to 'Michael Biehn' (qv).", "Thanked by the rock band 'Blink-182' (qv) in the liner notes of their album \"Enema of the State\" (1999).", "Bruce married his girlfriend of a year, 'Emma Heming Willis' (qv), at his home in Parrot Cay, Turks and Caicos. [March 2009]", "Among the guests at his wedding to 'Emma Heming Willis' (qv) were his three daughters, 'Demi Moore' (qv), 'Ashton Kutcher' (qv) and 'Madonna' (qv).", "He visited 'Michael Jackson' (qv) on the set of filming the \"Smooth Criminal\" segment for _Moonwalker (1988)_ (qv). Also visiting the set were 'Gregory Peck' (qv) and 'Robert De Niro' (qv).", "Was in consideration for the role of Lester Burnham in _American Beauty (1999)_ (qv) but 'Kevin Spacey' (qv), who went on to win a Best Actor Oscar for his performance, was cast instead.", "Has appeared with 'Samuel L. Jackson' (qv) in four films: _Loaded Weapon 1 (1993)_ (qv), _Pulp Fiction (1994)_ (qv), _Die Hard with a Vengeance (1995)_ (qv) and _Unbreakable (2000)_ (qv), even though they only shared scenes together in the last two.", "Was friends with 'John Goodman' (qv), during their New York City struggling actor days.", "Admitted to Playboy magazine in 1996 that he was once arrested at age 19 for possessing two joints.", "Filmed his role in the mystery thriller _Mortal Thoughts (1991)_ (qv) in ten days.", "Met 'Demi Moore' (qv) at a screening of 'Emilio Estevez' (qv)'s film, _Stakeout (1987)_ (qv). Moore had broken off her engagement to Estevez the previous December after it was revealed publicly that he'd fathered another woman's two children while in a relationship with Moore; so it was a little odd for her to be there in the first place. She and Willis were married 4 months later.", "Lives in Los Angeles, Malibu, California and Hailey, Idaho.", "Inducted into the New Jersey Hall of Fame in 2011 for his contributions to Arts and Entertainment.", "Is left-handed and is displayed in most of his films. In _The Sixth Sense (1999)_ (qv), he learned to write with his right hand so this would not be so easily noticeable that his character was not wearing his wedding ring.", "Is mentioned in 'Nicki Minaj' (qv)'s song \"Your Love\".", "Credits 'Will Smith' (qv) with helping him come to terms with his divorce from 'Demi Moore' (qv), and accepting 'Ashton Kutcher' (qv) as her new husband.", "Has regularly been named on \"Best Celebrity Tippers\" lists over the years. This is largely due to his early \"struggling\" waiter/bartender days.", "He was awarded Commander of the Order of Arts and Letters, the highest French culture award, in Paris, France. [February 2013]", "Once made an album (\"The Return of Bruno\" (1987)) that sold a million copies in the United Kingdom.", "Became a father for the first time at age 33 when his [now ex] first wife 'Demi Moore' (qv) gave birth to their daughter 'Rumer Willis' (qv) on August 16, 1988.", "Became a father for the second time at age 36 when his [now ex] first wife 'Demi Moore' (qv) gave birth to their daughter 'Scout Willis' (qv) on July 20, 1991.", "Became a father for the third time at age 38 when his [now ex] first wife 'Demi Moore' (qv) gave birth to their daughter 'Tallulah Willis' (qv) on February 3, 1994.", "Became a father for the fourth time at age 57 when his second wife 'Emma Heming Willis' (qv) gave birth to their daughter Mabel Ray Willis on April 1, 2012.", "As of 2014, has appeared in three films that were nominated for the Best Picture Oscar: _The Verdict (1982)_ (qv), _Pulp Fiction (1994)_ (qv) and _The Sixth Sense (1999)_ (qv).", "Is mentioned in the song \"Jizz in My Pants\" by The Lonely Island. One of the song's composers, 'Jorma Taccone' (qv), shares his birthday with Willis.", "Became a father for the fifth time at age 59 when his second wife 'Emma Heming Willis' (qv) gave birth to their daughter Evelyn Penn Willis on May 5, 2014.", "Willis has played many roles whose character names have the letter \"J\" in the beginning. Examples include _Die Hard (1988)_ (qv) (John McClane), _Mercury Rising (1998)_ (qv) (Art Jeffries), _Hostage (2005)_ (qv) (Jeff Talley), _Mortal Thoughts (1991)_ (qv) (James Urbanski), _Twelve Monkeys (1995)_ (qv) (James Cole), _The Whole Nine Yards (2000)_ (qv) (Jimmy \"The Tulip\" Tudeski), _Sin City (2005)_ (qv) (John Hartigan) and the title role in _The Jackal (1997)_ (qv).", "Has played five characters more than once in the movies: Hartigan from the Sin City films, John McClane from the Die Hard films, Frank from the Red films, Church from the Expendables films, and Jimmy \"The Tulip\" Tudeski from the Whole Nine Yard films. With his cameo as David Dunn in Split and his appearance as Dunn in the upcoming Glass, this counts to six characters he played more than once. If one would count his voice acting as Mikey in Look who's talking & R.J. in Over the Hedge, this sums up to eight characters he played more than once. He also appeared twice as Lt. Muldoon in a Grindhouse-Segment & in Planet Terror. So he comes to a total of nine characters, he played more than once.", "His _Inside the Actors Studio (1994)_ (qv) interview was taped on September 10, 2001. The episode was respectfully dedicated by Willis and the Actors Studio Drama School \"to the heroes who fell September 11th - and to the heroes who fight on.\".", "In 2015, he did a Broadway show of 'Stephen King' (qv)'s \"Misery\" with 'Laurie Metcalf' (qv).", "Willis, a variant of the name William, is a surname, of Scottish and English origin meaning (Son of Willie).The name William comes ultimately from the given name Wilhelm (cf. Old German Wilhelm > German Wilhelm and Old Norse Vilhjálmr). That is a compound of two distinct elements : wil = \"will or desire\" and helm: Old English helm \"helmet, protection\"; > English helm \"knight's large helmet\".", "Is left handed.", "Has been in three movies where he meets a younger version of himself: _Twelve Monkeys (1995)_ (qv), _The Kid (2000)_ (qv) and _Looper (2012)_ (qv).", "Has twice played a hit man: _The Jackal (1997)_ (qv) and _The Whole Nine Yards (2000)_ (qv). _The Whole Ten Yards (2004)_ (qv) really can not be counted because his character, Jimmy Tudeski was retired.", "Good friends with 'Don Johnson' (qv), 'Julia Roberts' (qv) and 'Sylvester Stallone' (qv).", "'Quentin Tarantino' (qv) opines that Willis's performance in _Unbreakable (2000)_ (qv) is the best of his career.", "Dated Geraldo's third ex-wife 'Sherri Rivera' (qv); models 'Maria Bravo' (qv), 'Eva Jasanovská' (qv), 'Emily Sandberg' (qv); actresses 'Nadia Bjorlin' (qv), 'Linda Fiorentino' (qv); and porn star 'Alisha Klass' (qv).", "In Hailey, Idaho, he and Moore were criticized for buying businesses in the town and not running them properly.", "Was considered for the role of Henry Miller in _Henry & June (1990)_ (qv), which later went to 'Fred Ward' (qv), who shaved his head for it. Willis and Ward both appeared in _The Player (1992)_ (qv), but did not share any scenes together.", "The name of his band is 'Bruce Willis' (qv) and the Accelerators. In 2002, the band had its largest tour to date, going to 15 cities.", "He turned down 'Jean-Claude Van Damme' (qv)'s role in _Sudden Death (1995)_ (qv) because he was already working on _Die Hard with a Vengeance (1995)_ (qv).", "Bruce and his ex-wife 'Demi Moore' (qv) both had young moms. Demi's mom had her at 18 and Bruce's mom had him at 19."], "quotes": ["I'm much more proud of being a father than being an actor.", "You can't undo the past... but you can certainly not repeat it.", "I'm staggered by the question of what it's like to be a multimillionaire. I always have to remind myself that I am.", "[on how he stays in shape, interview in People.com, 10 March 2005] Mostly weight resistance training, almost an hour of cardio at least three times a week. I have a gym in my house in Los Angeles and a gym trailer that I can take on the road with me when I'm on location. At my house there's a very long steep driveway. I do wind sprints that kick my 50-year-old ass. It's part of my job. I have come to associate working out as work. Whenever I don't have to do it for films, I kind of slack off.", "I am a sensitive guy. People think they know the real me, but they don't. And then they write things that make me sound like such a jerk.", "I hate working out. I work out for films solely. I associate working out with films. As soon as they stop, I stop working out.", "Fifty is the new forty. I always thought my best work would come in the years forty to sixty, if I was fortunate enough to hang around - and it is hard to stick around.", "Who I am as a father is far more important to me than the public perception.", "I am baffled to understand why the things that I saw happening in Iraq, really good things happening in Iraq, are not being reported on.", "[on _Hudson Hawk (1991)_ (qv)] I always thought it was a little ahead of its time, a little too hip for the room.", "I think the rules are going to have to change for me to ever run for public office. My checkered past will always keep me out of politics. If I ever did run I would run on the platform that I did all these bad things, but I no longer do them, and during the four years of being president or whatever office it might be, I would be good and serve my country. I want to serve my country.", "I'm a Republican only as far as I want a smaller government, I want less government intrusion, I want them to stop pissing on my money and your money, the tax dollars that we give 50 percent of, or 40 percent of, every year, and I want them to be fiscally responsible, and I want these goddamn lobbyists out of Washington. Do that and I'll say I'm a Republican. But other than that, I want the government to take care of people who need help, like the kids in foster care, the half a million kids who are in orphanages right now - they call them foster homes, but they're orphanages. I want them to take care of the elderly and give them free medicine, give them whatever they need. There's tons, billions and billions of dollars that are just being wasted. Okay? I hate government. I'm apolitical. Write that down: I'm not a Republican.", "[February 2006] Look at what happened to 'James Frey' (qv) in the last two weeks. That's a great book and so is the follow-up book. And just because his publisher chose to say that these were memoirs, it took it out of being a work of fiction, a great work of fiction and very well-written to this guy having to go be sucker punched on _The Oprah Winfrey Show (1986)_ (qv) by one of the most powerful women in television just to grind her own ax about it. Hey Oprah, you had President ['Bill Clinton' (qv)] on your show and if this prick didn't lie about a couple of things I'm going to set myself on fire right now. 'James Frey' (qv) is a writer, okay? He can write whatever he wants. It's fiction, and it's just hard, it's just shameful how he was treated in some of these things. It's just shameful and it's just not fair and not right...", "I'm not an action hero anymore, and I think it would be inappropriate for me to compare anything that happens in Hollywood and the entertainment industry to the tragic loss of life on September 11th.", "I spoke to the Colombians. It's fine. I get passionate sometimes. I said Colombia because it was the first country to come to mind. The drug problem has as much to do with what's going on in this country. If there wasn't a demand, there wouldn't be a supply.", "I think what the United States, and everyone who cares about protecting the freedoms that the largest part of the free world now has, should do whatever it takes to end terrorism in the world and not just in the Middle East. I'm talking also about going to Colombia and doing whatever it takes to end the cocaine trade. It's killing this country. It's killing all the countries that coke goes into. I believe that somebody's making money on it in the United States. If they weren't making money on it, they would have stopped it. They could stop it in one day. It's just a plant that they grow, and these guys are growing it like it's corn or tobacco or any other thing. By the time it gets here, it becomes a billion dollar industry. And I think that's a form of terrorism as well.", "The Iraqi people want to live in a world where they can move from their homes to the market and not have to fear being killed. I mean, doesn't everybody want that?", "I have zero interest in performing in films to try to convey any kind of message. My job is to be entertaining. There's a very different point of view about messages in films in Europe than there is in the States. Audiences rebel because they feel that they are being preached to.", "[on his planned film about the Iraq war] The movie is about these guys who do what they are asked for very little money to defend and fight for what they consider to be freedom.", "I thought about signing up but my friends told me I was too old. I called the White House, called President ['George Bush' (qv)] and asked what I could do. So I got involved with the national foster care program.", "If you take guns away from legal gun owners then the only people who would have guns would be the bad guys. Even a pacifist would get violent if someone were trying to kill him or her. You would fight for your life, whatever your beliefs. You'd use a rock or tear one of these chairs out of the floor. Hey, maybe I've been watching too many 'Bruce Willis' (qv) movies!", "I'm always being accused of being a Hollywood Republican, but I'm not! I have just as many Democratic ideas as Republican ones. If they could build three fewer bombs every month and give the money to foster care, that would be great.", "The idea of serving my country remained in my mind. Over the past few years from varying sources - Time magazine, books, and television - information began coming to my attention on Foster Care; its history and the current crisis of an antiquated system overburdened with 580,000 children who have no voice. Children need to be protected by interstate technology systems that can track placements, education, medical records and protect these children from predators traveling from state to state. I saw Foster Care as a way for me to serve my country in a system by which shining a little bit of light could benefit a great deal by helping kids who were literally wards of the government.", "Hair loss is God's way of telling me I'm human.", "[1998] Organized religions in general, in my opinion, are dying forms. They were all very important when we didn't know why the sun moved, why weather changed, why hurricanes occurred or volcanoes happened. Modern religion is the end trail of modern mythology. But there are people who interpret the Bible literally. Literally! I choose not to believe that's the way. And that's what makes America cool, you know?", "I don't think my opinion means jack shit, because I'm an actor. Why do actors think their opinions mean more because you act? You just caught a break as an actor. There are hundreds - thousands - of actors who are just as good as I am, and probably better. Have you heard anything useful come out of an actor's mouth lately? Although I liked 'George Clooney' (qv)'s documentary on Darfur.", "They still haven't caught the guy that killed ['John F. Kennedy' (qv)]. I'll get killed for saying this, but I'm pretty sure those guys are still in power, in some form. The entire government of the United States was co-opted.", "I happen to live in Los Angeles and it is probably one of the most toxic environments on earth. People live here and they know that the air is poisonous. They know that children are affected by the air in Los Angeles. They say that growing up in Los Angeles is the equivalent of smoking a pack and a half of cigarettes throughout your entire childhood. It's horrific when you can actually look at the air and see it.", "No, I am not in favor of the war in Iraq, so let me stop you right there. I am not pro-war but what I am is that, I like to support the young men and women who are over there participating in the war.", "[on Twitter] I just can't live with myself if I started twittering. I just think: \"That way lies madness\".", "[on _The Expendables (2010)_ (qv) sequel] I talked to Sly ['Sylvester Stallone' (qv)] and he's going for all the marbles this time, and he's going to get everybody in this time. Even Stone Cold 'Steve Austin' (qv), who took two bullets in the last film, is coming back. Hopefully, they'll start shooting it while we're young enough to survive!", "[on the possibility of 'Michael Bay' (qv) directing a a Die Hard film, specifically _Live Free or Die Hard (2007)_ (qv)] Would have ruined DH4. Few people will work with him now, and I know I will never work with him again.", "[on whether an R-rated 'Die Hard' could be done without producer 'Joel Silver' (qv)] Fuck 'Joel Silver' (qv). That is because you do not understand my relationship with Joel S. We are cordial now when we bump into each other, but we have not worked together since _The Last Boy Scout (1991)_ (qv).", "I'm really pleased to continue to be asked back to do other versions and other incarnations of _Die Hard (1988)_ (qv). The first one really is... that's all there is. Everything else is just trying to be as good as that film.", "[on _A Good Day to Die Hard (2013)_ (qv)] It's a difficult title. A Good Day to Die Hard? It's like, have a sandwich and let's go shopping - then die hard.", "I want to do _A Good Day to Die Hard (2013)_ (qv), then one final Die Hard movie - Die Hard 6 - before finally hanging that white vest up for good. At the moment, I can run and I can fight on screen. But there will come a time when I no longer want to do that. That's when I'll step away from the Die Hard films.", "[on missing a role in _Full Metal Jacket (1987)_ (qv)] I got the call two days before we were to start the first _Moonlighting (1985)_ (qv). I was crushed! I'd always been a student of the Vietnam war. As it turned out, it took them two years to complete the film and get it out. So, everything happens for a reason.", "I don't cheat, lie or go out of my way to mess people over, but I'm still amazed at the venal garbage that goes on in this town. People lie about you. People want to see you fail. It's so competitive here, you can see how much people want you to fail.", "[on 'Kim Basinger' (qv)] What sets her apart from other actresses is that she does a lot of things well. Kim is a throwback to '40s actresses. She's not afraid to act like a geek.", "[on his NYC bartending days at Cafe Central, during which time he had acquired the nickname 'Bruno'] The bar was always six-deep. It was where a lot of celebs and movie-star types and wannabes hung out. If you're serving them drinks and you're drinking with them, it's a very fraternal feeling. They're not way up on a pedestal. It's four in the morning and they're probably half in the bag. So I didn't have to deal with that mystique.", "For a long time, I don't know if there was a lot of controversy SURROUNDING me, but it was certainly more interesting to throw rocks and dump trash on me than it was to say nice things about me. That kind of controversy sells more. And has since become, in the last ten years since they started writing about me, the norm.", "Look, this is my face. If it's a curse, it's a curse. And I never said, hey, I'm smirking, America! Look at me! Love me! It's a little hook that they caught on and they've found a way to turn it against me and make it some negative thing, but that's how I smile. Nothin' I can do about it."], "salary history": ["_Die Hard (1988)_ (qv)::$5,000,000", "_Look Who's Talking (1989)_ (qv)::$10,000,000", "_Die Hard 2 (1990)_ (qv)::$7,500,000", "_Look Who's Talking Too (1990)_ (qv)::$10,000,000", "_The Bonfire of the Vanities (1990)_ (qv)::$3,000,000", "_The Last Boy Scout (1991)_ (qv)::$14,000,000", "_Pulp Fiction (1994)_ (qv)::$800,000", "_Die Hard: With a Vengeance (1995)_ (qv)::$15,000,000", "_Four Rooms (1995)_ (qv)::$0", "_Last Man Standing (1996)_ (qv)::$16,500,000", "_Armageddon (1998)_ (qv)::$14,800,000", "_The Siege (1998)_ (qv)::$5,000,000", "_The Sixth Sense (1999)_ (qv)::$14,000,000 (salary, gross and video participations)", "_The Kid (2000)_ (qv)::$20,000,000", "_Unbreakable (2000)_ (qv)::$20,000,000", "_Hart's War (2002)_ (qv)::$22,500,000", "_Live Free or Die Hard (2007)_ (qv)::$25,000,000"], "birth date": "1955-03-19", "birth notes": "Idar-Oberstein, West Germany", "_actorID": "22", "_source": "IMDB", "actorID": "0000246", "created_utc_dt": "08/26/2019, 21:54:02"}