{"headshot": "https://m.media-amazon.com/images/M/MV5BMTU2NTg1OTQzMF5BMl5BanBnXkFtZTcwNjIyMjkyMg@@._V1_UY98_CR1,0,67,98_AL_.jpg", "nick names": ["Cevans"], "birth name": "Christopher Robert Evans", "height": "6' (1.83 m)", "mini biography": ["Christopher Robert Evans began his acting career in typical fashion: performing in school productions and community theatre.He was born in Boston, Massachusetts, the son of Lisa (Capuano), who worked at the Concord Youth Theatre, and G. Robert Evans III, a dentist. His uncle is congressman 'Mike Capuano' (qv). Chris's father is of half German and half Welsh/English/Scottish ancestry, while Chris's mother is of half Italian and half Irish descent. He has an older sister, 'Carly Evans' (qv), and two younger siblings, a brother named 'Scott Evans' (qv), who is also an actor, and a sister named 'Shana Evans' (qv). The family moved to suburban Sudbury when he was 11 years-old. Bitten by the acting bug in the first grade because his older sister, Carly, started performing, Evans followed suit and began appearing in school plays. While at Lincoln-Sudbury Regional High School, his drama teacher cited his performance as \"Leontes\" in \"The Winter's Tale\" as exemplary of his skill. After more plays and regional theatre, he moved to New York and attended the 'Lee Strasberg' (qv) Theatre Institute.On the advice of friends, he landed an internship at a casting office and befriended a couple of the agents he regularly communicated with - one of whom later took him on as a client. The screen - not the stage - then became his focus; Evans soon began auditioning for feature films and television series. Evans made one of his first appearances on _The Fugitive (2000)_ (qv) (CBS, 2000-2001), a remake of the 1960s series and feature film starring 'Harrison Ford' (qv). In the episode \"Guilt\", Evans played the son of a small-town sheriff who tries to exact revenge after Dr. Richard Kimble - incognito as a liquor store owner - refuses to sell him and his friends alcohol. After small roles in _Cherry Falls (2000)_ (qv) and _The Newcomers (2000)_ (qv) - two unknown low-budget features - Evans appeared in _Boston Public (2000)_ (qv) (Fox, 2000-2004) as a murder suspect. He then appeared in his first major feature, _Not Another Teen Movie (2001)_ (qv), a spoof on teen comedies wherein he played a jock who makes a bet that he can turn an unpopular and unkempt girl ('Chyler Leigh' (qv)) into prom queen.After filming a couple of television pilots he was confident would be successful - _Just Married (2003)_ (qv) and _Eastwick (2002)_ (qv) - he appeared in another listless teen comedy, _The Perfect Score (2004)_ (qv), playing an average, ho-hum student who takes part in a plot to steal the SAT test. Hijinks naturally ensue. Then, Evans broke through to the Big Time, grabbing the lead in the kidnapping thriller, _Cellular (2004)_ (qv), a suspenseful B movie with a cheesy gimmick - a random wrong number on his cell phone forces him into a high-stakes race to save an unknown woman's life. Despite an unassuming performance from Evans and 'Kim Basinger' (qv) as the damsel in distress, _Cellular (2004)_ (qv) failed to break any box office records or please a wide majority of critics. Evans then prepared himself for super stardom when he signed on to play Johnny Storm in _Fantastic Four (2005)_ (qv), 20th Century Fox's long-awaited adaptation of the Marvel comic. Although the film was wildly uneven and disappointing, Evans nearly stole the show with his energetic, unfettered performance. In that year itself, Chris was noticed by critics and made it into magazine and Internet countdowns, scoring himself a third position of the hot body countdown from Gay.com and #18 on E! Television's 2006 101 Sexiest Celebrity Bodies.The year 2007 also proved to be one successful year for Chris, as he had two movies released around the world that same year, starting with the second installment of the Marvel franchise Fantastic Four. Chris received positive reviews for his performance. _The Nanny Diaries (2007)_ (qv), where Evans played Harvard Hottie, showed his sensitive. The year 2008 saw 'Chris Evans' (qv)' part of the movie _Street Kings (2008)_ (qv), playing the character Detective Paul Diskant. The movie is about police officers trying to cover up their wrongdoings and audiences got to see a serious side of Chris. In the same year, Chris also worked on the movie _The Loss of a Teardrop Diamond (2008)_ (qv).::Bryson Atud and Anastasia Andrew Veno"], "trade mark": ["Playing a key role in films adapted from comic books"], "trivia": ["Read for a role in 'Cameron Crowe' (qv)'s _Elizabethtown (2005)_ (qv), but lost out to 'Orlando Bloom' (qv).", "Had a dog named East, that was half American bulldog and half English bulldog.", "Chris's paternal grandfather, George Robert Evans Jr., had English, Scottish and Welsh ancestry (George's own grandfather, Matthew J. Evans, was Welsh). Chris's paternal grandmother, Alma Emma Behling, had German ancestry. Chris's maternal grandfather, Andrew Capuano, was the son of Italian parents, while Chris's maternal grandmother, Rita Marie Garvey, was from an Irish family.", "Scored 1180 on his SATs.", "Has a younger sister named 'Shana Evans' (qv), a younger brother named 'Scott Evans' (qv) and an older sister named 'Carly Evans' (qv).", "Had signed on to star in Fantastic Four films, but in the end only had two, and the third was canceled. Instead, a reboot was made, with 'Michael B. Jordan' (qv) in Chris's role as the Human Torch.", "Ranked #18 on E! Television's 2006 101 Sexiest Celebrity Bodies.", "Separated with 'Jessica Biel' (qv), his girlfriend of two years. [June 2006]", "Named one of People magazine's \"Hottest Bachelors\" (2006).", "Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#99) (2007).", "Son of actress 'Lisa Evans' (qv). Nephew of Congressman 'Mike Capuano' (qv).", "Read for the role of Scott Smith in _Milk (2008)_ (qv), but lost to 'James Franco' (qv).", "Has played three different comic book heroes - Captain America, Jensen (from _The Losers (2010)_ (qv)), and Johnny Storm, and one villain - Lucas Lee (League of Evil exes [_Scott Pilgrim vs. the World (2010)_ (qv)]).", "Has appeared in eleven films with 'Stan Lee' (qv): _Fantastic Four (2005)_ (qv), _Fantastic 4: Rise of the Silver Surfer (2007)_ (qv), _Captain America: The First Avenger (2011)_ (qv), _The Avengers (2012)_ (qv), _Thor: The Dark World (2013)_ (qv), _Captain America: The Winter Soldier (2014)_ (qv), _Avengers: Age of Ultron (2015)_ (qv), _Ant-Man (2015)_ (qv), _Captain America: Civil War (2016)_ (qv), _Spider-Man: Homecoming (2017)_ (qv) and _Avengers: Infinity War (2018)_ (qv).", "Very close friends with 'Scarlett Johansson' (qv), with whom he has appeared in nine films: _The Perfect Score (2004)_ (qv), _The Nanny Diaries (2007)_ (qv), _The Avengers (2012)_ (qv), _Captain America: The Winter Soldier (2014)_ (qv), _Avengers: Age of Ultron (2015)_ (qv), _Captain America: Civil War (2016)_ (qv), _Avengers: Infinity War (2018)_ (qv), _Captain Marvel (2019)_ (qv) and _Avengers: Endgame (2019)_ (qv).", "Has worked twice with 'Jason Statham' (qv) and 'Jessica Biel' (qv) in two films: _Cellular (2004)_ (qv) and _London (2005)_ (qv).", "Is good friends with 'Anthony Mackie' (qv), 'Cobie Smulders' (qv), 'Hayley Atwell' (qv), 'John Krasinski' (qv), 'Chris Hemsworth' (qv), 'Sebastian Stan' (qv) and 'Chris Pratt' (qv).", "Has appeared as Steve Rogers / Captain America in eleven films: _Captain America: The First Avenger (2011)_ (qv), _The Avengers (2012)_ (qv), _Thor: The Dark World (2013)_ (qv), _Captain America: The Winter Soldier (2014)_ (qv), _Avengers: Age of Ultron (2015)_ (qv), _Ant-Man (2015)_ (qv), _Captain America: Civil War (2016)_ (qv), _Spider-Man: Homecoming (2017)_ (qv), _Avengers: Infinity War (2018)_ (qv), _Captain Marvel (2019)_ (qv) and _Avengers: Endgame (2019)_ (qv).", "His mother, a former professional dancer, installed a tap dance floor in the basement of their house. Evans claims to still tap dance to work through anxiety.", "Suffered from migraines throughout making of _The Avengers (2012)_ (qv) because of the cowl he wore.", "Evans said in March 2014 that once his contract with Marvel is up, he may consider doing less acting so he could work more on directing, and believes he will be finished playing Captain America in 2017.", "Was unable to attend the world premiere and press tours of _Avengers: Infinity War (2018)_ (qv) due to scheduling conflicts and commitment to his Broadway play \"Lobby Hero\".", "Favorite television series is the animated sitcom _The Simpsons (1989)_ (qv).", "Favorite movies are _Braveheart (1995)_ (qv), _Hurlyburly (1998)_ (qv) and _The Royal Tenenbaums (2001)_ (qv).", "Had a crush on 'Sandra Bullock' (qv) as a teenager after seeing her in the action film _Speed (1994)_ (qv).", "Has stated at a press conference, that he would have liked a possible Captain America / Black Widow romance in the MCU following _Captain America: The First Avenger (2011)_ (qv).", "Usually jokes about fellow actor 'Chris Pine' (qv) becoming the new Captain America if he were to resign from the role.", "The costume department had him wear T-shirts and regular clothing a size or two less in order for his muscular-build to show while filming _Captain America: Civil War (2016)_ (qv).", "Only appeared in MCU films (_Avengers: Age of Ultron (2015)_ (qv), _Captain America: Civil War (2016)_ (qv) and a cameo post-credit scene in _Ant-Man (2015)_ (qv)) between 2015-2016.", "Shares the same birthday (June 13) as fellow Marvel Cinematic Universe co-stars 'Aaron Taylor-Johnson' (qv), 'Kat Dennings' (qv) and 'Stellan Skarsgård' (qv).", "Is a huge fan of 'Alice in Chains' (qv), 'Soundgarden' (qv), 'Led Zeppelin' (qv), 'Van Morrison' (qv), 'Paul Simon' (qv), 'Stone Temple Pilots' (qv), 'Radiohead' (qv), 'The Allman Brothers Band' (qv), 'Bill Withers' (qv) and 'Stevie Wonder' (qv).", "Invited to join the Academy of Motion Picture of Arts and Sciences (AMPAS) in 2017.", "Attended and graduated from Lincoln-Sudbury Regional High School.", "Has a great interest in the philosophies of Buddhism.", "Is a supporter of marriage equality and LGBT rights.", "Raised in the small town of Sudbury, Massachusetts."], "quotes": ["When I found out I had to take off my shirt in Teen Movie, I panicked and hit the gym. I was like \"It's going to be on film, documented, for my children to see. I can't be 140 pounds. I need to put on a little bit of muscle.\".", "Anyone who's had a tattoo knows once you get your first one, as you're walking out the door, you're planning the next.", "[on what it's like being home in Boston with his family] I'm reminded of who I am, who I was, and who I'm supposed to be.", "If you want to be around in 10 years you've got to do something to differentiate yourself from the pack.", "For the youth, the indignation of most things will just surge as each birthday passes.", "I really wanted to be a part of _Milk (2008)_ (qv), but I lost out to 'James Franco' (qv). I guess if you've got to lose, he's the guy to lose to.", "[on _Captain America: The First Avenger (2011)_ (qv)] Right now in America, how we handle ourselves in political and global issues is up for questioning. (He) might wear the red, white and blue but I don't think this is all about America. It is what America stands for.", "I want to get married, though I want children - to me that's the ultimate thing. When you're old and on your death bed, looking back at your life it's not going to be the films you've made or what you've accomplished, it's the relationships you have. You're survived by things that matter - the people you love and those who love you back.", "[on filming the iconic helicopter shot from Civil War] Yeah that's what the script said, \"Zoom in on the biceps.\" That was in the first week of filming. I was pumping iron just before we rolled. I am not going to pretend I wasn't. When you are filming these movies, you try and get as fit as you can by the time you start, and then throughout the filming, you just gradually lose weight, because in that suit every day, you're sweating nonstop, you're tired, your workouts kind of fall off a little bit. So they load all the scenes where I have to be in a T-shirt in the beginning of shooting. The day we did the helicopter shirt I am in a T-shirt and you want to look good. But I'm not going to pretend I walk around looking like that. You prepare. There is a lot of pressure to keep up. You wanna make sure you look the role. In the comic books he's 6'4, 240 pounds - a huge animal. I'm nowhere near that. You wanna make sure that you at least get close to the image the comic book fans have in their head.", "[on the helicopter scene from Civil War not being enhanced in any way] That was really my arm, and you know what, I took a page of 'Anthony Mackie' (qv)'s book. When we were doing Avengers: Age of Ultron, for certain scenes, I worked out just before the take but there were a bunch of scenes where I was the only one out of the cast doing it and I'd be embarrassed and feel shame. So I didn't do it that often. And then we started Civil War and Mackie has no shame. Before each take Mackie's just curling weights non-stop and I thought, \"Yeah! What are you doing Chris? Just curl some weights! Who cares? I am not going to worry about 20 people judging me as opposed to 200 million people seeing the scene forever.\" So before the helicopter scene, I lifted a lot of weights to get pumped. It's not like I woke up and I looked like that, that was me lifting weight for hours on end prior to filming that scene. There certainly was a lot of pressure. I was fully aware of what they wanted that shot to be. I wanted that shot to be great too.", "[on his frequent co-star 'Scarlett Johansson' (qv)] She really is a beautiful lady. She really got blessed, I love that girl, man. She's like my sister. I've known her for 10 years. She's just one of the smartest people I know. It's great when someone with a razor-sharp intellect wants to have fun. A lot of my buddies who like to have fun are a little low-brow, and that's fun. It's enjoyable but you can laugh at only so many farts.", "[on how it is hard to maintain his abs for Captain America at 35 years old] It's getting harder as I get older. I've noticed that no matter how hard I work out, I can still feel a little bit of a soft section around the middle, so I've had to start incorporating a bit of a diet. Nothing too strict but no late-night pints of ice cream. There's a lot of time in the gym - that's tough. My body doesn't naturally want to be this size."], "salary history": ["_Captain America: The First Avenger (2011)_ (qv)::$300,000", "_The Avengers (2012)_ (qv)::$2,000,000", "_Captain America: The Winter Soldier (2014)_ (qv)::$3,200,000", "_Avengers: Age of Ultron (2015)_ (qv)::$6,900,000", "_Captain America: Civil War (2016)_ (qv)::$15,000,000", "_Avengers: Infinity War (2018)_ (qv)::$15,000,000", "_Avengers: Endgame (2019)_ (qv)::$15,000,000"], "birth date": "1981-06-13", "birth notes": "Boston, Massachusetts, USA", "_actorID": "11", "_source": "IMDB", "actorID": "0262635", "created_utc_dt": "08/26/2019, 21:53:53"}