{"headshot": "https://m.media-amazon.com/images/M/MV5BMjE0MjAwOTMzMF5BMl5BanBnXkFtZTcwMDg1MjEyNw@@._V1_UY98_CR0,0,67,98_AL_.jpg", "birth name": "Martin John Christopher Freeman", "height": "5' 6½\" (1.69 m)", "mini biography": ["'Martin Freeman' (qv) is an English actor, known for portraying Bilbo Baggins in 'Peter Jackson' (qv)'s The Hobbit film trilogy, Tim Canterbury in the original UK version of sitcom mockumentary _The Office (2001)_ (qv), Dr. John Watson in the British crime drama _Sherlock (2010)_ (qv) and Lester Nygaard in the dark comedy-crime drama TV series _Fargo (2014)_ (qv).His other notable film roles include the romantic comedy _Love Actually (2003)_ (qv) and the comic science fiction film _The Hitchhiker's Guide to the Galaxy (2005)_ (qv).::Pedro Borges"], "trade mark": ["Usually plays mild-mannered characters in extraordinary circumstances", "Wide range of expressions and reaction shots", "Often plays characters from literary fiction (The Hitchhiker's Guide to the Galaxy, Sherlock, The Hobbit)", "Distinctive clipped, deliberate delivery of lines", "Reserved performances that often feature one or more extremely vocal outbursts", "Known for his willful attempts to make each and every take different", "Frequently clears his throat", "Almost always plays the put-upon everyman in his film and television roles."], "trivia": ["Attended the Central School of Speech and Drama in London, England.", "Didn't get his driving license until 2016. It's rumored he went and got it so he could drive in Start Up, but the real reason is unknown. 'Amanda Abbington' (qv), Martin's long term ex-partner, tweeted letting everyone know Martin finally got his driving license after years of not having one. During Series 2 Episode 2 of Sherlock, The Hounds of Baskerville, 'Benedict Cumberbatch' (qv) had to drive because Martin hadn't gotten his license yet.", "Owns two rescued miniature long-haired dachshunds named Archie and Jodie. However, since he split from his Long Time Partner, 'Amanda Abbington' (qv), after splitting the dogs stayed with her in Hertfordshire. Martin moved to a flat in London.", "Is the youngest of five children of Geoffrey and Philomena Freeman.", "Attended Salesian School, a Catholic secondary school in Chertsey, Surrey.", "Comes from an artistic family: older brother, 'Tim Freeman' (qv), was in the 1980s art-pop group, Frazier Chorus; another brother, Jamie Freeman, is a musician and website designer; cousin 'Ben Norris' (qv) is a stand-up comic.", "Was on the British national squash squad from the age of nine to fourteen.", "After his parents divorced, he lived with his father. After his father died (when Martin was ten), he moved back in with his mother and stepfather James.", "The first single he bought was \"Ghost Town\" by 'The Specials' (qv).", "Has appeared with 'Bill Nighy' (qv) in _Shaun of the Dead (2004)_ (qv), _The Hitchhiker's Guide to the Galaxy (2005)_ (qv), _Hot Fuzz (2007)_ (qv), _Wild Target (2010)_ (qv), _Love Actually (2003)_ (qv) and _The World's End (2013)_ (qv). He and Nighy have also both played hobbits. Nighy played \"Sam Gamgee\" opposite 'Ian Holm' (qv)'s \"Frodo\" in the BBC Radio drama of \"The Lord of the Rings\". Freeman plays the younger version of Holm's \"Bilbo\" in _The Hobbit: An Unexpected Journey (2012)_ (qv), _The Hobbit: The Desolation of Smaug (2013)_ (qv) and _The Hobbit: The Battle of the Five Armies (2014)_ (qv).", "Has two children with longtime ex-partner 'Amanda Abbington' (qv): Joseph (born 2006) and Grace (born 2008).", "Has worked with many of his predecessors in literary roles: The original Arthur Dent, 'Simon Jones' (qv), made a cameo appearance in _The Hitchhiker's Guide to the Galaxy (2005)_ (qv). 'Ian Holm' (qv), who previously played Bilbo Baggins, appeared in _The Hobbit: An Unexpected Journey (2012)_ (qv). 'Jude Law' (qv), who has also played Dr. Watson, appeared with him in _Breaking and Entering (2006)_ (qv).", "Longtime partner of actress 'Amanda Abbington' (qv) (Summer 2000 - Spring 2016).", "Has English and Irish ancestry.", "Good friends with 'Benedict Cumberbatch' (qv).", "Birthday is four days before that of 'Ian Holm' (qv), who preceded him in the role of Bilbo Baggins.", "One episode of _Sherlock (2010)_ (qv) was based on \"The Hound of the Baskervilles.\" A previous film adaptation of the story, _The Hound of the Baskervilles (1959)_ (qv) featured 'André Morell' (qv) as Dr. Watson. It also featured 'John Le Mesurier' (qv), who preceded him in the role of Bilbo. In another Tolkien connection, Morell subsequently played Elrond in _The Lord of the Rings (1978)_ (qv).", "Shares the role of Doctor Watson with 'Jude Law' (qv) and Bilbo Baggins with 'Ian Holm' (qv). Law and Holm appeared together in _The Aviator (2004)_ (qv), which is based on the life of 'Howard Hughes' (qv). Freeman appears in _Captain America: Civil War (2016)_ (qv), in which the character of Tony Stark ('Robert Downey Jr.' (qv)) is based on Hughes. Furthermore 'Robert Downey Jr.' (qv) plays Sherlock Holmes in two movies with 'Jude Law' (qv).", "Stars in 3 different TV series on IMDB's top 250 TV. Sherlock, Fargo and _The Office (2001)_ (qv).", "Born the same day as David Arquette.", "Shares the same last name coincidentally with Morgan Freeman also both are left-handed.", "Came to prominence playing Dr. John Watson on 'Sherlock (2009)(TV)', before taking on the role of Bilbo Baggins in _The Hobbit: An Unexpected Journey (2012)_ (qv). He is actually the last of four actors who have played Dr, Watson and a role from Tolkien's Middle-Earth novels. 'André Morell' (qv), 'Michael Hordern' (qv) and 'John Rhys-Davies' (qv) have all also played the part."], "quotes": ["Why does everyone have to pretend to be stupid and not know long words?", "God, no. I don't do any of that shit [partying with celebrities]. I've got a stag weekend coming up and I've said I'm not doing anything more than a few drinks. I won't have it. I'll go home and watch _Antiques Roadshow (1997)_ (qv).", "If I could get bands to come and play in my house, I'd like that. I've never been to a festival. I'm a creature of habit, mashed-potato comfort, I like rugs. Our sofa's squishy. Maybe too squishy - it's hard to get up sometimes.", "Most people have a passive relationship with music and clothes, with culture. But music was my first contact with anything creative. Music is it, as far as I'm concerned.", "Some people have that roar in their head, but I'm not sure I ever did. That live-fast-die-young thing. No one wants it really - 'Jimi Hendrix' (qv), 'Janis Joplin' (qv) - it's not good. I want to live with Amanda till I'm 70. I was never the kid that went all the way with naughtiness, never got caned or in serious trouble. I always knew when to pull back.", "I don't think it was a surprise that I ended up as an actor, and it was anything but a disappointment. My parents gave me the knowledge that reading isn't a bad thing, and admitting to liking a painting doesn't make you an arse-bandit. And that wouldn't have been a problem either.", "I'm not a practicing Catholic or I wouldn't be living unwed with a woman, and I don't think all poofs are going to hell, and I don't think everyone who's had an abortion is damned, most of my friends are atheists and I understand atheism, I get it, but I happen to be a theist. I believe in our answerableness to something else.", "My mum was Labour-voting, but wanted us to know we were important. Basically, everyone's equal, but you, my children, are a bit better.", "Once you've switched that switch [commitment], then, though you notice that other people are great, you're just not interested.", "Half of us are partly German! Half our language and culture, generally, in Anglo-Saxon terms, is German.", "I would wear a full-length cape if I could get away with it - I do love a good swirl in a fog.", "I did a play once where a reviewer said, 'Martin Freeman' (qv) is too nice to play a bad guy.' And I thought: 'Well, bad guys aren't always bad guys, you know?' When I see someone play the obvious villain, I know it's false.", "I can spot someone with similar fashion sense to me a mile off.", "I'm a big believer that life changes as much as you want it to.", "I think I'm less gloomy than I used to be - I've got a very supportive other half.", "I'm not posh or common, I'm in between.", "I think what 'The Hobbit' and Middle-earth deal in are quite universal and timeless themes of honor and love and friendship... so they're things that do resonate with people.", "My idea of a good night out is staying in.", "I'm not particularly affable in real life, I have to tell you. I've got that side to me, of course, but that's not all I am.", "I have a very extreme state of mind. Things are very black or very white.", "To my mind there are not enough things that show the Nazis as human, as smart people, charismatic people, who are not inhuman naturally. But who are able to be fantastically inhuman when they choose to be.", "I don't want to sound like a grumpy old man, but nothing winds me up more than people saying, 'Chill out' to me when I'm irritated!", "People misunderstand me.", "There are lots of things that keep me awake at night, but work isn't one of them. I mean, no-one's going to die if someone doesn't like what I do. So I don't feel a great pressure.", "I value being able to go into a record shop and people leaving me alone.", "Any pigeonhole is something to be rebelled against.", "I don't think anyone looks into their family tree and expects it to come up smelling of roses.", "I think people just like seeing friendship. I think people like seeing people who just drive each other up the wall, but at same time, can't live without each other.", "I like things that are simple, such as an alarm clock.", "'Michael Caine' (qv), 'Tom Courtenay' (qv) and 'Al Pacino' (qv) made me want to act. I've always been interested in men with a vulnerable side.", "Like any friendship or marriage, familiarity breeds more contempt, and love, and everything.", "There was very little drama and performance at my school, so I've never forgotten the people who did encourage me and I've thought whether it would be a good idea to even get in touch with them and just say thanks, because they really opened a door for me mentally and emotionally - that's really important.", "I've always loved Christmas and that's not really gone away from me from being a child to now. It's always a magical time and I'm unashamed in my love for Christmas.", "I don't want to be poor, of course. But I try not to make that the guiding force behind whether I choose to do something or not.", "Acting is the only thing I'm even vaguely good at and acting is something that I think I do know about.", "I like the quiet life sometimes. I also love a bustling press conference sometimes as well. I love a 600 meter red carpet.", "I am a fan of the Coen brothers. I'm not a fanatic. I'm a big admirer. They create unique worlds, and there is a real atmosphere to their films. Not everyone can get that. That's a massive part of their appeal: you can recognize them. Like all the great directors or artists, you know it when you see it.", "_Sherlock (2010)_ (qv) is one of the biggest things I will do, ever - we could never have predicted that level of insanity around the series.", "Disappointment is an endless wellspring of comedy inspiration.", "In London we give ourselves a pat on the back, rightly, for not killing one another, for our prejudice being subtle rather than lethal.", "I hate the fact that so much of our life is computerized rather than mechanized.", "Name anything - high-definition TV, computer obsolescence - and I'm pretty much annoyed by it.", "I'm one of the few people I know who believes in God.", "What makes Shakespeare eternal is his grasp of psychology. He knew how to nail stuff about us as human beings.", "I've got an overly developed sense of what selling out is, and I of course worry about it too much.", "Humor is - how do I say this without sounding pompous - it's a huge part of my life.", "I don't think it was a surprise that I ended up as an actor, and it was anything but a disappointment.", "I'm geek royalty now.", "Being a mod is more of a sensibility than a style.", "I love home. I'd rather be at home than anywhere else.", "I like uncertainty in roles, and I like uncertainty in art, really.", "I don't write anything off without reading a script, and if it's a good one, I'll consider it, whether it's for $20 or a million dollars.", "I love eating. I mean, I really, really love eating.", "I think the hardest part about anything you do for 18 months is just keeping yourself together for 18 months.", "I think the only directing I'd be any good at is theatre directing. It's the only thing I can see myself doing.", "I'm afraid I don't have a very pragmatic or unromantic view of props. I don't imbue them with any great sense of mystery or anything.", "I wanted to be an actor because I saw _Dog Day Afternoon (1975)_ (qv) you know what I mean?", "I'm always interested with other actors in what their process is, and are they still interested in acting, as opposed to being a star.", "I think the world needs to see more of my face.", "When I wear jeans I want to look like a man, not a child.", "If you are a plumber, you can work on a shed, or you can work on a mansion. It's just scale.", "Your slippers last a lot longer in your bedroom. On a film set, they do get very scuffed up.", "When people bully us, we are complicit in it in some way. We do allow it to happen to some extent.", "I've always been attracted to darkness.", "With superheroes and comics and fantasy and Sci-Fi being absolutely the popular currency in cinema, it's like people have said in endless magazines, it's the revenge of the geeks and all that. There's some truth in that.", "I've got a stag weekend coming up and I've said I'm not doing anything more than a few drinks. I won't have it. I'll go home and watch Antiques Roadshow.", "On 'Billy Bob Thornton' (qv): I love watching Billy Bob, just as a punter anyway. I like his work. But working with him is really easy and really straight-forward. He's immediately good. He doesn't have to work up to it. He doesn't make your life difficult. He listens. He's a very good listener, in terms of his acting.", "I never liked smoking. I like swearing. I think swearing serves a purpose.", "I've been doing interviews for years, and in all that time, I've virtually never read one and gone, 'Yep, factually and tonally that's exactly what happened.' Pretty much never.", "For a long time I was one of seven British actors who wasn't in Harry Potter. So I'd see all these films come out, and I was like, \"yeah, yeah, Harry Potter\". For a long time it was just me and six other people staring through the window like orphans in a Dickens novel."], "birth date": "1971-09-08", "birth notes": "Aldershot, Hampshire, England, UK", "_actorID": "91", "_source": "IMDB", "actorID": "0293509", "created_utc_dt": "08/26/2019, 21:54:48"}