{"headshot": "https://m.media-amazon.com/images/M/MV5BMTgzMDk3MjI4OF5BMl5BanBnXkFtZTgwMzQxMDY5NjE@._V1_UY98_CR5,0,67,98_AL_.jpg", "birth name": "Daisy Jazz Isobel Ridley", "height": "5' 7\" (1.7 m)", "mini biography": ["Daisy Jazz Isobel Ridley is an English actress. She is best known for her breakthrough role as \"Rey\" in the 2015 film, _Star Wars: Episode VII - The Force Awakens (2015)_ (qv). Daisy was born in Westminster, London, on April 10, 1992. She is the daughter of Louise Fawkner-Corbett and Chris Ridley. Her great-uncle was 'Arnold Ridley' (qv), an English actor, playwright, and appointed Officer of the Order of the British Empire (OBE), who was best known for his authorship of the play, \"The Ghost Train\", and his role as \"Private Godfrey\" in the British sitcom, _Dad's Army (1968)_ (qv). Daisy attended the Tring Park School for Performing Arts, located in Hertfordshire, England, where she trained in musical theater and graduated in 2010, at the age of 18. Aside from acting, her talent repertoire includes ballet, jazz dancing, Latin American, and tap. Her vocal range is mezzo-soprano, where she is notably skilled in jazz and cabaret singing. Upon graduation, Daisy was hired in a number of roles in television, film, and music. She was cast to play \"Jessie\" in the British comedy-drama, _Youngers (2013)_ (qv). In 2013, she played \"Fran Bedingfield\" in the BBC series, _Casualty (1986)_ (qv), and as \"Charlotte\" in the British comedy, _Toast of London (2012)_ (qv). In 2014, she played opposite to 'Jeremy Piven' (qv) as \"Roxy Starlet\" in the second season of the ITV series, _Mr Selfridge (2013)_ (qv), and as \"Hannah Kennedy\" in two episodes of the BBC crime drama, _Silent Witness (1996)_ (qv). She further had roles in short films, including Scrawl, 100% Beef, and Crossed Wires. She was featured in Blue Season, which was entered into the Sci-Fi-London 48-Hour Film Challenge, and Lifesaver, which was nominated for a BAFTA Award. She also appeared in 'Wiley' (qv)'s British rap music video, Lights On. In April 2014, it was announced that Daisy was cast to play the heroine main protagonist, Rey, in Star Wars: The Force Awakens, the first film in the new trilogy of the Star Wars franchise. Since its release in December 2015, the 'J.J. Abrams' (qv) directed movie has received critical acclaim and became the fastest movie, ever, to reach $1 billion at the box office, worldwide. In August 2015, it was announced that she would play the lead role of Taeko in the English dub of the 1991 animated film, Only Yesterday, which was released in 2016. In December 2017, Daisy reprised her role as Rey in the eighth Star Wars film, The Last Jedi, as well as the Star Wars TV show, Forces of Destiny. Ridley then played Mary Debenham in the Murder on the Orient Express. She also starred in the titular role in Ophelia, alongside Naomi Watts and Clive Owen, which was filmed in 2017 and debuted at the 2018 Sundance Film Festival. In February 2018, Daisy voiced Cottontail in the film adaptation of Beatrix Potter's children story. In 2019, Ridley co-stars with Tom Holland in the movie, Chaos Walking, playing Viola Eade in the film adaptation of the novel done by Patrick Ness, which is currently in post-production and set for release in 2020. Daisy further reprises her role as Rey in Star Wars Episode IX: The Rise of Skywalker, which started filming in 2018 and wrapped up in early 2019. The movie is set for release in December 2019 and will be Ridley's final cinematic role as Rey in the franchise. Daisy is currently connected to future projects, including Christy Hall's Daddio. She will star in The Lost Wife, which is based on the novel by Alyson Richman. She is reportedly also teaming up 'J.J. Abrams' (qv) in a couple projects, including the remake of 2003's Israeli TV movie, Kolma, and the film adaptation of Sonia Purnell's, A Woman of No Importance.::Danilo Tadeo, Jr."], "trade mark": ["Bright smile with dimples and infectious laugh", "Warm, slightly low-pitched voice", "Slim yet athletic figure", "Hazel-green, almond-shaped eyes", "Often wears her hair as a top-knot", "Light-hearted personality", "A small notch on her right cheek that resembles a scar", "British accent", "Freckles"], "trivia": ["She was cast in _Youngers (2013)_ (qv) straight out of school.", "Her great uncle is actor 'Arnold Ridley' (qv) who played Godfrey in the long running British sitcom _Dad's Army (1968)_ (qv).", "Trained as a dancer and singer at the Tring Park School for the Performing Arts.", "She appears in the music video for the song \"Lights On\" by 'Wiley' (qv) (feat Angel & 'Tinchy Stryder' (qv)). The song was released in 2013.", "Her character Rey is featured on a Star Wars postage stamp issued in October 2015 by the UK Royal Mail postal service..", "She has a tattoo of three stars on her left foot that she got when she was 15, a tattoo of the alchemical symbol of air on her upper right thigh, and a peace symbol tattoo behind her right ear.", "Is the youngest child of five sisters. Two of them are half-sisters, coming from her father's previous marriage.", "She cried after watching the trailer of _Star Wars: Episode VII - The Force Awakens (2015)_ (qv) for the first time.", "Is left-handed. Could also be considered \"cross-dominant\" as displayed in Star Wars; she writes/eats with her left hand, but shoots and uses her staff with her right hand.", "Won \"Best Breakthrough Performance\" at the MTV Movie 'Awards' (qv) on her 24th birthday.", "Since August 2016, she has her own wax figure featured in Madame Tussaud's wax museum. The sculpture is based on her character Rey and has been revealed during the Star Wars Celebration Europe in July 2016.", "In 2016, she recorded the song \"At the Ballet\", along with 'Barbra Streisand' (qv) and 'Anne Hathaway' (qv). The song is featured on the album \"Encore: Movie Partners Sing Broadway\", which was released in August 26, 2016.", "In 2012, about a year before her acting career took off, she appeared in a TV commercial for the British supermarket chain Morrisons.", "She is a fan of _The Great British Baking Show (2010)_ (qv).", "When 'Prince William' (qv) and 'Prince Harry' (qv) visited the set of _Star Wars: The Last Jedi (2017)_ (qv) at Pinewood Studios, Daisy was assigned to escort them on a VIP tour of the Star Wars sound stage facilities.", "Prior to acting, she worked as a bartender in London.", "Is allergic to cats.", "She became a vegan after watching the mocumentary _Carnage (2017)_ (qv). However, after initially cutting out dairy, eggs and meat, she decided to eat fish as a compromise. She also likes to drink her tea with honey.", "Although she is a skilled singer, she says it's one of her worst habits. During the production of _Star Wars: Episode VII - The Force Awakens (2015)_ (qv), she once lost a bet with 'J.J. Abrams' (qv) that she couldn't go an entire day without singing.", "In 2016, she started studying for a degree in social science.", "She and her two older sisters are named after flowers (Poppy-Sophia and Kika-Rose).", "In July 2016, she took a visit over a weekend to the Great Ormond Street Children's Hospital in London, dressed as Rey.", "For a scene in _Star Wars: The Last Jedi (2017)_ (qv), she had to practice a complex series of lightsaber movements, which, according to stunt coordinator 'Liang Yang' (qv), would usually take three days to get right. However, Ridley managed to learn them in only 90 minutes.", "Found out that got the part in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv) while she was at the theatre with a friend. Before the play started, she received an e-mail and a voice mail from 'J.J. Abrams' (qv), who asked her if she could call him. When she did, he said that she's gonna be in Star Wars; an information that made her speechless and excited. Right after the call, she went back to the theatre where the play had already started, and she had to sit through it without telling her friend what just happened.", "One of her very first parts was a short appearance in _Toast of London (2012)_ (qv), where she played a stagehand. 'Matt Berry' (qv) really wanted to bring her back to the show, but he couldn't get in touch with her. This was because at the time, she has been recently cast in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv) and therefore was temporarily unavailable. Berry expressed his delight in her casting, and admitted that his show really couldn't compete with Star Wars.", "She suffers from Endometriosis."], "quotes": ["[About where she grew up] London. And somebody did ask me if me and John [Boyega] got on because we're from the same place. We're not from the same place. He's from South London, I'm from West.", "[About the Star Wars Celebration event] I didn't think of it like that until dinner last night when somebody mentioned how many people might be watching. It was so cool to be part of a film that is loved so much, and then to be able to launch in that sphere with just fans and people who love what we're doing and are so excited about what's going to come in December, that was the best way to come out, as it were.", "[About her family] I've got sisters. I'm the youngest of actually five. We have been watching the movies again, and my middle sister is super excited. Last year when we were filming, everyone came round and we had dinner and watched Episode IV, A New Hope, which was super cool.", "[on her favourite location while filming Star Wars: The Force Awakens] Weirdly enough, probably Abu Dhabi, even though it was so hot, it was like you literally can't imagine that heat. The feeling of stepping onto a real set for the first time, it genuinely was a baptism of fire. To see creatures walking around and speeders chilling in the sand, that was amazing, and because I was shooting there, it was like everything had built up to that moment. So a few days in, I was like, OK. I'm getting my groove now.", "My great uncle was in _Dad's Army (1968)_ (qv). And I don't know if Americans will know that. It was a hugely popular show in England. They're redoing it as a film. Michael Gambon, who played Dumbledore [in the Harry Potter movies], is playing who my great uncle played. Both my parents are creative. My dad did act when he was younger, but they're both very creative.\" [...] \"My mum works in internal communications at a bank, and my dad's a photographer.", "[About her video reel being deleted] That was actually me! I wanted it to be so people could just concentrate on this. I'm so proud of what I've done before, but I wanted it to feel fresh. Which is what I think everyone else wanted, because everyone wanted just to see me as Rey and not as the people I've played before, even though the jobs I've done before are amazing and obviously led me to this incredible point. So here I am.", "I went to a school called Tring Park School for the Performing Arts. I went because initially I was very naughty, and my mom thought if I was busy, I'd be better. And I didn't really do acting until later on in the school, with an amazing teacher. I left, went traveling, came back. And then it all kind of went from there.", "[on auditioning for _Star Wars: Episode VII - The Force Awakens (2015)_ (qv)) I had heard about the role quite a while before I auditioned, and I emailed my agent that I have this really weird feeling; I really feel like I need to audition. Then months went by and the same people were reading for it. But I still really had this feeling of needing to read for it. So I emailed my agent again for an audition. I had four or five auditions over seven months, and it was a very emotional time. My first few auditions really didn't feel good, but my last audition suddenly felt like something clicked. You're so desperate to get a role, but I felt like even if I didn't get it, I did a good job, I'd done myself proud.", "What we've seen of Rey, she looks like she can handle her stuff. So most of the comments I get are from parents who say how wonderful it is that their little girls can see this character.", "The thing about _Star Wars: Episode IV - A New Hope (1977)_ (qv) is that every single person is important. Even though Rey is a big role, everyone influences everyone. If that wasn't so, why would so many people remember Admiral Ackbar?", "Sadly, people think a guy and a girl can't be friends without something romantic going on.", "Rey is so strong. She's cool and smart and she can look after herself. Young girls can look at her and know that they can wear trousers if they want to. That they don't have to show off their bodies.", "I love 'Felicity Jones' (qv). It was funny because I went to go see the 'Rogue One' set, and I was like, 'Oh my God, I love you.' And she's so tiny, and elegant, and she's just so small. Everyone's so much smaller than they seem.", "Your life goes on, and then your life goes on plus 'Star Wars'. It's just been an incredible time.", "When I feel comfortable, I just like to sing and hum, and I don't even know I'm doing it. But sometimes someone will come over to me like, 'I love that song you were singing, but it's distracting.'", "I can knit quite well. I make really long scarves.", "I don't know if I can prepare for what's to come because I don't know what will.", "Hope makes people good, a lot of the time. You hope for a brighter future, and resentment is outweighed.", "I actually wanted to be a zookeeper when I was 5.", "It's one thing for other people to see potential in you, and it's quite another for you to understand that and see it in yourself.", "I auditioned for this agency. I got an advertisement first, and then something else, which I got fired from. It was soul-destroying. And then the next thing I got, I thought was going to be my big break, and they cut the role. It was only the year that I started auditioning for 'Star Wars' when I really started getting roles.", "[August 2014; while doing the Ice Bucket Challenge] May the icy Force be with you.", "Both my parents are creative. My dad did act when he was younger, but they're both very creative.", "I was actually sacked from my first job. It was at a workshop for a short film this poet had written, about when she used to work in a strip club. After the first week, I was told not to come back.", "I've never been one for crushing on famous people.", "So many people look up to 'Jennifer Lawrence' (qv) playing Katniss in 'The Hunger Games.' For them to look up to Rey and what she represents would be fantastic. She's a wonderful character... The reason I love her so much is she does all the fun stuff. She fights, runs and protects herself and has an incredible emotional story.", "'Carey Mulligan' (qv) and 'Felicity Jones' (qv) are two of my favorites. I'm not so much younger than them. I like that. It's kind of aspirational."], "salary history": ["_Star Wars: Episode VII - The Force Awakens (2015)_ (qv)::$450,000 + percentage of box office"], "birth date": "1992-04-10", "birth notes": "London, England, UK", "_actorID": "87", "_source": "IMDB", "actorID": "5397459", "created_utc_dt": "08/26/2019, 21:54:45"}