{"headshot": "https://m.media-amazon.com/images/M/MV5BNTczMzk1MjU1MV5BMl5BanBnXkFtZTcwNDk2MzAyMg@@._V1_UY98_CR0,0,67,98_AL_.jpg", "nick names": ["Fresh Prince", "Mr. July"], "birth name": "Willard Carroll Smith Jr.", "height": "6' 2\" (1.88 m)", "mini biography": ["Willard Carroll \"Will\" Smith, Jr. (born September 25, 1968) is an American actor, comedian, producer, rapper, and songwriter. He has enjoyed success in television, film, and music. In April 2007, 'News' (qv)week called him \"the most powerful actor in Hollywood\". Smith has been nominated for five Golden Globe 'Awards' (qv), two Academy 'Awards' (qv), and has won four Grammy 'Awards' (qv).In the late 1980s, Smith achieved modest fame as a rapper under the name The Fresh Prince. In 1990, his popularity increased dramatically when he starred in the popular television series The Fresh Prince of Bel-Air. The show ran for six seasons (1990-96) on NBC and has been syndicated consistently on various networks since then. After the series ended, Smith moved from television to film, and ultimately starred in numerous blockbuster films. He is the only actor to have eight consecutive films gross over $100 million in the domestic box office, eleven consecutive films gross over $150 million internationally, and eight consecutive films in which he starred open at the number one spot in the domestic box office tally.Smith is ranked as the most bankable star worldwide by Forbes. As of 2014, 17 of the 21 films in which he has had leading roles have accumulated worldwide gross earnings of over $100 million each, five taking in over $500 million each in global box office receipts. As of 2014, his films have grossed $6.6 billion at the global box office. He has received Best Actor Oscar nominations for Ali and The Pursuit of Happyness.Smith was born in West Philadelphia, the son of Caroline (Bright), a Philadelphia school board administrator, and Willard Carroll Smith, Sr., a refrigeration engineer. He grew up in West Philadelphia's Wynnefield neighborhood, and was raised Baptist. He has three siblings, sister Pamela, who is four years older, and twins Harry and Ellen, who are three years younger. Smith attended Our Lady of Lourdes, a private Catholic elementary school in Philadelphia. His parents separated when he was 13, but did not actually divorce until around 2000.Smith attended Overbrook High School. Though widely reported, it is untrue that Smith turned down a scholarship to attend the Massachusetts Institute of Technology (MIT); he never applied to college because he \"wanted to rap.\" Smith says he was admitted to a \"pre-engineering [summer] program\" at MIT for high school students, but he did not attend. According to Smith, \"My mother, who worked for the School Board of Philadelphia, had a friend who was the admissions officer at MIT. I had pretty high SAT scores and they needed black kids, so I probably could have gotten in. But I had no intention of going to college.\"Smith started as the MC of the hip-hop duo 'DJ Jazzy Jeff' (qv) & The Fresh Prince, with his childhood friend Jeffrey \"'DJ Jazzy Jeff' (qv)\" Townes as producer, as well as Ready Rock C (Clarence Holmes) as the human beat box. The trio was known for performing humorous, radio-friendly songs, most notably \"Parents Just Don't Understand\" and \"Summertime\". They gained critical acclaim and won the first Grammy awarded in the Rap category (1988).Smith spent money freely around 1988 and 1989 and underpaid his income taxes. The Internal Revenue Service eventually assessed a $2.8 million tax debt against Smith, took many of his possessions, and garnished his income. Smith was nearly bankrupt in 1990, when the NBC television network signed him to a contract and built a sitcom, The Fresh Prince of Bel-Air, around him.The show was successful and began his acting career. Smith set for himself the goal of becoming \"the biggest movie star in the world\", studying box office successes' common characteristics. Smith's first major roles were in the drama _Six Degrees of Separation (1993)_ (qv) and the action film _Bad Boys (1995)_ (qv) in which he starred opposite Martin Lawrence.In 1996, Smith starred as part of an ensemble cast in Roland Emmerich's Independence Day. The film was a massive blockbuster, becoming the second highest grossing film in history at the time and establishing Smith as a prime box office draw. He later struck gold again in the summer of 1997 alongside 'Tommy Lee Jones' (qv) in the summer hit Men in Black playing Agent J. In 1998, Smith starred with Gene Hackman in Enemy of the State.He turned down the role of Neo in The Matrix in favor of _Wild Wild West (1999)_ (qv). Despite the disappointment of Wild Wild West, Smith has said that he harbors no regrets about his decision, asserting that Keanu Reeves's performance as Neo was superior to what Smith himself would have achieved, although in interviews subsequent to the release of Wild Wild West he stated that he \"made a mistake on Wild Wild West. That could have been better.\"In 2005, Smith was entered into the Guinness Book of World Records for attending three premieres in a 24-hour time span.He has planned to star in a feature film remake of the television series It Takes a Thief.On December 10, 2007, Smith was honored at Grauman's Chinese Theatre on Hollywood Boulevard. Smith left an imprint of his hands and feet outside the world-renowned theater in front of many fans. Later that month, Smith starred in the film I Am Legend, released December 14, 2007. Despite marginally positive reviews, its opening was the largest ever for a film released in the United States during December. Smith himself has said that he considers the film to be \"aggressively unique\". A reviewer said that the film's commercial success \"cemented [Smith's] standing as the number one box office draw in Hollywood.\" On December 1, 2008, TV Guide reported that Smith was selected as one of America's top ten most fascinating people of 2008 for a Barbara Walters ABC special that aired on December 4, 2008.In 2008 Smith was reported to be developing a film entitled The Last Pharaoh, in which he would be starring as Taharqa. It was in 2008 that Smith starred in the superhero movie Hancock.Men in Black III opened on May 25, 2012 with Smith again reprising his role as Agent J. This was his first major starring role in four years.On August 19, 2011, it was announced that Smith had returned to the studio with producer La Mar Edwards to work on his fifth studio album. Edwards has worked with artists such as T.I., Chris Brown, and Game. Smith's most recent studio album, Lost and Found, was released in 2005.Smith and his son Jaden played father and son in two productions: the 2006 biographical drama The Pursuit of Happyness, and the science fiction film After Earth, which was released on May 31, 2013.Smith starred opposite Margot Robbie in the romance drama Focus. He played Nicky Spurgeon, a veteran con artist who takes a young, attractive woman under his wing. Focus was released on February 27, 2015. Smith was set to star in the Sci-Fic thriller Brilliance, an adaptation of Marcus Sakey's novel of the same name scripted by Jurassic Park writer David Koepp. But he left the project.Smith played Dr. Bennet Omalu of the Brain Injury Research Institute in the sports-drama Concussion, who became the first person to discover chronic traumatic encephalopathy (CTE) in a football player's brain. CTE is a degenerative disease caused by severe trauma to the head that can be discovered only after death. Smith's involvement is mostly due to his last-minute exit from the Sci-Fi thriller-drama Brilliance. Concussion was directed by Peter Landesman and-bead filmed in Pittsburgh, according to the Pittsburgh Tribune-Review. It received $14.4 million in film tax credits from Pennsylvania. Principal photography started on October 27, 2014. Actress Gugu Mbatha-Raw played his wife. Omalu served as a consultant.As of November 2015, Smith is set to star in the independent drama Collateral Beauty, which will be directed by David Frankel. Smith will play a New York advertising executive who succumbs to an deep depression after a personal tragedy.Nobel Peace Prize Concert December 11, 2009, in Oslo, Norway: Smith with wife Jada and children Jaden and 'Willow Smith' (qv) married Sheree Zampino in 1992. They had one son, 'Trey Smith' (qv), born on November 11, 1992, and divorced in 1995. Trey appeared in his father's music video for the 1998 single \"Just the Two of Us\". He also acted in two episodes of the sitcom All of Us, and has appeared on The 'Oprah Winfrey' (qv) Show and on the David Blaine: Real or Magic TV special.Smith married actress Jada Koren Pinkett in 1997. Together they have two children: Jaden Christopher Syre Smith (born 1998), his co-star in The Pursuit of Happyness and After Earth, and Willow Camille Reign Smith (born 2000), who appeared as his daughter in I Am Legend. Smith and his brother Harry own Treyball Development Inc., a Beverly Hills-based company named after Trey. Smith and his family reside in Los Angeles, California.Smith was consistently listed in Fortune Magazine's \"Richest 40\" list of the forty wealthiest Americans under the age of 40.::Akram Braham"], "spouse": ["'Jada Pinkett Smith' (qv)::(31 December 1997 - present) ( 2 children)", "'Sheree Fletcher' (qv)::(9 May 1992 - 10 December 1995) ( divorced) ( 1 child)"], "trade mark": ["Often plays a policeman or an agent", "Frequently includes his catchphrase, \"Aw, hell no!\" in his movies", "Often plays rebellious, wise-cracking characters", "Big ears and goofy smile"], "trivia": ["Met wife 'Jada Pinkett Smith' (qv) when she tried out for the role of his girlfriend on _The Fresh Prince of Bel-Air (1990)_ (qv). The role eventually went to 'Nia Long' (qv).", "Has three children. Son, Willard Smith III ('Trey Smith' (qv)), born on November 11, 1992, with 'Sheree Fletcher' (qv). Son, Jaden Christopher Syre Smith ('Jaden Smith' (qv)), born July 8, 1998 and daughter, Willow Camille Reign Smith ('Willow Smith' (qv)), born October 31, 2000 with 'Jada Pinkett Smith' (qv).", "Has said he based his character Captain Steven Hiller in _Independence Day (1996)_ (qv) on his favorite big screen hero, 'Harrison Ford' (qv), most notably his performances of Han Solo in _Star Wars: Episode IV - A New Hope (1977)_ (qv) and its sequels.", "Also known as rap artist \"The Fresh Prince.\".", "Will's siblings are: Pam Smith (born in 1964), and twins Ellen and Harry Smith (born in 1971).", "Won a Grammy Award for the song \"Summertime\" during his rap career.", "Received the first ever Grammy Award for Best Rap Performance, for the song \"Parents Just Don't Understand\" in 1989 with his partner 'DJ Jazzy Jeff' (qv) (aka Jazzy Jeff).", "Enjoys playing chess.", "Chosen by People magazine as one of the 50 Most Beautiful People in the World. [1998]", "Smith's pilot test show for _The Fresh Prince of Bel-Air (1990)_ (qv) was directed by 'Debbie Allen' (qv).", "Met first wife, 'Sheree Fletcher' (qv), at a taping of _A Different World (1987)_ (qv) in 1991.", "As a public role model, hosted the Presidential Inaugural Celebration for Youth, as part of the Gala for President 'Bill Clinton' (qv). [January 1993]", "Graduate of Philly's legendary Overbrook High School, whose alumni include 'Wilt Chamberlain' (qv), 'Hal Lear' (qv), 'Wali 'Wonder' Jones' (qv), 'Walt Hazzard' (qv), 'The Dovells' (qv), 'The Orlons' (qv), 'Dee Dee Sharp' (qv), etc. and, in tribute to his student years there, his production company is called Overbrook Entertainment.", "Attended the prestigious Julia Reynolds Masterman Laboratory and Demonstration School in Philadelphia, as well as Catholic school and public Overbrook HS.", "First hip-hop artist to be nominated for an Academy Award.", "Speaks fluent Spanish.", "Ranked #2 on Star TV's Top Ten Box Office stars of the 1990s (2003).", "Had a chart-hit together with 'DJ Jazzy Jeff' (qv) (aka 'DJ Jazzy Jeff' (qv).", "Dropped from Columbia Records as an artist after lackluster sales of his third solo album, which was self-titled, and greatest hits compilation. [Summer 2003]", "Incorporates the line \"Aw, hell no!\" into all his movies as a running catch phrase like 'Arnold Schwarzenegger' (qv)'s \"I'll be back!\".", "Ranked #15 in TV Guide's list of \"TV's 25 Greatest Teen Idols\" (23 January 2005 issue).", "Gained a place in the Guinness World Records book for most public appearances in 12 hours, by attending three red carpet \"premieres\" for _Hitch (2005)_ (qv) on 22nd February 2005. He walked the red carpet and introduced the film at Manchester, Birmingham, and finally for the premiere in London, England.", "Once stated that in his whole career, he most regrets turning down the part of Neo in _The Matrix (1999)_ (qv) and the film that he most regrets making was _Wild Wild West (1999)_ (qv).", "He has been at his adult height of 6' 2\" since he was 13, although he is now about 60 pounds heavier than he first was when he reached this height.", "Premiere Magazine ranked him as #44 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature (2005).", "He sang a few lines \"Wild Wild West\" to his on screen cousin Carleton, a movie in which he starred 6 years later.", "Hosted the MTV Movie 'Awards' (qv) in 1994.", "Was considered for the role of \"Mr. Smith\" in _Mr. & Mrs. Smith (2005)_ (qv) before 'Brad Pitt' (qv) was cast.", "Is supposedly a huge fan of the Swedish well-known (but barely known in the U.S.) melodic heavy metal band 'Soilwork' (qv).", "Raked #66 in VH1's 100 greatest Teen Stars.", "Holds the record for most Kids Choice 'Awards' (qv) with a whopping six wins.", "Ranked #14 on Premiere's 2006 \"Power 50\" list. Had ranked #18 in 2005. He is the second-highest ranked actor, behind only 'Tom Cruise' (qv).", "He and 'Jada Pinkett Smith' (qv) were forced to leave their home in California because a bush fire threatened to destroy it and several other houses in the same area. [October 2005]", "His 1995 divorce from ex-wife 'Sheree Fletcher' (qv) led to a $900,000 lump sum divorce settlement for Zampino plus $24,000 per month in alimony and child support; this equals $288,000 a year.", "Lost his place in the Guiness World Records book for most public appearances in 12 hours to German actors 'Jürgen Vogel' (qv) and 'Daniel Brühl' (qv), who attended four red carpet premieres of their movie _A Friend of Mine (2006)_ (qv), one more than Will (22 October 2006).", "In the 1998 rap lyrics of \"Gettin' Jiggy\", 'Will Smith' (qv) says that 'Muhammad Ali' (qv) would call him \"The Greatest.\" Two and a half years later, he played the title role in _Ali (2001)_ (qv).", "An animated caricature of him appeared in _Men in Black: The Series (1997)_ (qv) (the animated series adaptation of _Men in Black (1997)_ (qv)), alongside a caricature of his MIB co-star 'Tommy Lee Jones' (qv), set against a shot that parodied one of the famous low angle shots of a building being threatened by a flying saucer, an in-joke reference to Smith's 1996 hit _Men in Black: The Series (1997)_ (qv), which preceded _Men in Black (1997)_ (qv).", "His character from _Men in Black (1997)_ (qv), Agent Jay, was not originally written to specifically be a black man. In fact, the role was offered to Caucasian actors 'Chris O'Donnell' (qv) and 'David Schwimmer' (qv) before Smith accepted the part.", "Had to undergo treatment on his shoulder in a New York hospital after he suffered a strain. [March 2007]", "Was among the guests at 'Tom Cruise' (qv)'s and 'Katie Holmes' (qv)'s wedding ceremony in Italy.", "Ranked #30 on VH1's 50 Greatest Hip Hop Artists along with 'DJ Jazzy Jeff' (qv) & The Fresh Prince.", "Ranked #29 on VH1's 100 Sexiest Artists.", "2007 - Ranked #5 on EW's The 50 Smartest People in Hollywood.", "December 2007 - According to Forbes, for each dollar he got paid, Smith's movies averaged $10 of gross income.", "Was a millionaire before the age of 20.", "In 2004, his net worth was estimated to be $188 million.", "In 2007, Forbes Magazine estimated his earnings for the year at $31 million.", "Huge fan of professional wrestling.", "Is often called \"Mr. July\" by the media due to the fact that most of his summer blockbusters open in July.", "He and his daughter 'Willow Smith' (qv) both had movies opening 2 July, 2008. His was _Hancock (2008)_ (qv), hers was _Kit Kittredge: An American Girl (2008)_ (qv).", "Has appeared in two films starting with the word \"I\", _I, Robot (2004)_ (qv) and _I Am Legend (2007)_ (qv).", "Wrote and performed the song, \"Just the Two of Us\", about his first son, 'Trey Smith' (qv).", "Was considered for the role of Detective James Carter in _Rush Hour (1998)_ (qv).", "As of _Hancock (2008)_ (qv), he holds the record for the actor to star in the most consecutive $100 million-grossing movies (8).", "Was in consideration for the part of Curtis Taylor Jr in _Dreamgirls (2006)_ (qv). However 'Jamie Foxx' (qv) was cast instead.", "Birth Card is the Queen of Hearts.", "Brother-in-law of 'Caleeb Pinkett' (qv).", "He has solved Rubik's cubes in both _The Fresh Prince of Bel-Air: The Alma Matter (1993)_ (qv) and _The Pursuit of Happyness (2006)_ (qv). This is a real talent of his; he has shown on live TV that he can solve a Rubik's Cube in under 55 seconds.", "_The Bridge on the River Kwai (1957)_ (qv) is his favorite movie.", "Acting mentor was 'James Avery' (qv).", "Living in Beijing, China for the next three months with his family while his son, 'Jaden Smith' (qv), films _The Karate Kid (2010)_ (qv). [July 2009]", "Recently purchased a home in south Stockholm, Sweden because he feels it is the best place to relax. [August 2004]", "Attended a press conference in Rio de Janeiro, Brazil to promote _I Am Legend (2007)_ (qv). He stayed at the famous Copacabana Palace Hotel. [January 2008]", "Many of his hit films have featured actors from the Star Trek franchise. _Where the Day Takes You (1992)_ (qv) featured 'Christian Slater' (qv). _Made in America (1993)_ (qv) featured 'Whoopi Goldberg' (qv). _Six Degrees of Separation (1993)_ (qv) featured 'J.J. Abrams' (qv). _Independence Day (1996)_ (qv) featured 'Brent Spiner' (qv) and 'Robert Pine' (qv), who is not only a Star Trek veteran himself, but also the father of 'Chris Pine' (qv). _Bad Boys (1995)_ (qv) was directed by 'Michael Bay' (qv), who is cousin to Star Trek veteran 'Susan Bay Nimoy' (qv) and has, through her, been related by marriage to 'John Schuck' (qv) and 'Leonard Nimoy' (qv). _Men in Black 3 (2012)_ (qv) featured 'Alice Eve' (qv). _I, Robot (2004)_ (qv) featured 'Bruce Greenwood' (qv) and 'James Cromwell' (qv).", "Shares a birthday with 'Michael Madsen' (qv), 'Michael Douglas' (qv), 'Mark Hamill' (qv), 'Donald Glover' (qv), 'Christopher Reeve' (qv), and 'Catherine Zeta-Jones' (qv).", "He and his wife 'Jada Pinkett Smith' (qv) were both cast in DC comics project in 2014 - Will as Deadshot in the film _Suicide Squad (2016)_ (qv) and Jada in the television show _Gotham (2014)_ (qv).", "On the two occasions to date (2016) where Will was Oscar-nominated for Best Actor, he lost out to fellow African-American actors, 'Denzel Washington' (qv) (2002) and 'Forest Whitaker' (qv) (2007).", "Was the first guest on _The Tonight Show Starring Jimmy Fallon (2014)_ (qv).", "Is a huge fan of _Buffy the Vampire Slayer (1997)_ (qv) and _Angel (1999)_ (qv) along with wife 'Jada Pinkett Smith' (qv).", "Made a private and unofficial deal with his father: his father would support his music career for one year, and if it didn't work out the way his father and Will wanted to, Will would have gone back to college.", "Received a Tony award nomination in 2010 for Best Musical as part of the producing team of \"Fela!\".", "Became part owner of the Philadelphia 76ers.[December 2016].", "Member of the 'Official Competition' jury at the 70th Cannes International Film Festival in 2017.", "Friends with 'Alfonso Ribeiro' (qv), 'DJ Jazzy Jeff' (qv), 'Tatyana Ali' (qv), 'Karyn Parsons' (qv), 'Jay Z' (qv), 'Tom Cruise' (qv), 'Eva Mendes' (qv), 'Tyra Banks' (qv), 'Tyrese Gibson' (qv), 'Mariah Carey' (qv), 'Duane Martin' (qv), 'Tommy Lee Jones' (qv), 'Chris Rock' (qv), 'Oprah Winfrey' (qv), 'Kevin James' (qv), and 'Terrence Jenkins' (qv).", "Son-in-law of 'Adrienne Banfield-Jones' (qv) and Robsol Grant Pinkett, Jr.", "He was considered for the role of Tre Styles in _Boyz n the Hood (1991)_ (qv), but turned it down due to his commitment to _The Fresh Prince of Bel-Air (1990)_ (qv).", "Shares a birthday with 'Christopher Reeve' (qv) and have both played superheroes. Reeve in _Superman (1978)_ (qv) and Smith in _Hancock (2008)_ (qv).", "No relation with 'Justice Smith' (qv)."], "quotes": ["[on his first season of _The Fresh Prince of Bel-Air (1990)_ (qv)] \"I was trying so hard. I would memorize the entire script, then I'd be lipping everybody's lines while they were talking. When I watch those episodes, it's disgusting. My performances were horrible.\"", "On the change in his body that Ali's intense physical training required: \"I'm human viagra. I'm Willagra. I'm a sex machine now. I'm raring to go every second of the day. My wife's loving it.\"", "My biggest emotional defeat and the greatest emotional pain I've had as an actor was when 'Wild Wild West' opened up to $52 million. The movie wasn't good. And it hurt so bad to be the No. 1 movie, to open at $52 million and to know the movie wasn't good.", "I want to stop at five - when asked by 'Jules Asner' (qv) about having more children.", "When I turned 28, everything clicked. I even got way better in bed.", "It's a whole different thing being an actor. A rapper is about being completely true to yourself. Being an actor is about changing who you are. You make yourself a different person. You become a different person.", "You're so much stronger when your partner is strong. I honestly believe there is no woman for me but Jada. Of all the women I've met - and there've been a few - no one can handle me the way Jada does. Once you feel someone locked in on you, it's no contest. As fine as other women can be, as tempting sexually, I'm not going anywhere. This is it. I can't imagine what anyone else could offer.", "I love being black in America, and especially being black in Hollywood.", "I really believe that a man and a woman together, raising a family, is the purest form of happiness we can experience.", "If you're not willing to work hard, let someone else do it. I'd rather be with someone who does a horrible job, but gives 110% than with someone who does a good job and gives 60%.", "People laugh, but if I set my mind to it, within the next 15 years I would be president.", "My grandmother once told me, 'Don't let failure go to your heart and don't let success go to your head.'", "[on _Star Wars: Episode IV - A New Hope (1977)_ (qv)] \"I might have been eight or nine. That was the movie that put me into a space where the science fiction element was almost a spiritual connection for me. I thought, if someone could imagine that and then put it on a screen and make me feel like that... and my entire career I've been trying to make people feel like _Star Wars: Episode IV - A New Hope (1977)_ (qv) made me feel.\"", "About 'Aishwarya Rai Bachchan' (qv): \"I really wanted to work with her in _Hitch (2005)_ (qv) but she was shooting _Bride & Prejudice (2004)_ (qv) at the time and she couldn't do it. She has this powerful energy where she doesn't have to say anything, do anything, she can just stand there. Anything she's making, I'll be there\" (February 2006).", "If I weren't a musician/actor, I'd be a computer engineer. I was always good at math. I probably would have been the guy who invented the remote control if I'd been around then.", "When I started in movies, I said, 'I want to be the biggest movie star in the world.' The biggest movie stars make the biggest movies, so [my producing partner 'James Lassiter' (qv) and I] looked at the top 10 movies of all time. At that point, they were all special-effects movies. So _Independence Day (1996)_ (qv), no-brainer. _Men in Black (1997)_ (qv), no-brainer. _I, Robot (2004)_ (qv), no-brainer.", "[on refusing to kiss 'Anthony Michael Hall' (qv) in _Six Degrees of Separation (1993)_ (qv)] It was very immature on my part. I was thinking, 'How are my friends in Philly going to think about this?' I wasn't emotionally stable enough to artistically commit to that aspect of the film. In a movie with actors and a director and writer of this caliber, for me to be the one bringing something cheesy to it... This was a valuable lesson for me. Either you do it or you don't.", "Give me a problem, I'll give you a solution. I just love living. That's a feeling you can't fake. I'm glad every single day. I think that even the camera can feel that I'm a happy man.", "(1996) I was nine and my older sister must have been 15. Some guys pulled a knife on me and took my money when I was coming home from school. I came in crying and my sister asked me why. I told her and she right away grabbed a baseball bat. We walked around for four hours looking for this guy. She had no concern for her own safety. Somebody had done something to her brother and she was going to do everything in her power to make sure they never did it again. We never found the guys, but that type of love and commitment is what I search for. My mother and my grandmother. That same kind of unconditional love. All women have the organs. But that's not what excites me about being in a relationship with women, that's not what makes me feel good. What I want to know is, 'Are you gonna grab a bat when someone steals my money?' Now, Miss Jada's so little, she might need two bats, but she's more than happy to go grab 'em. Outside of our love relationship, she's my best friend, too.", "(1996, Movieline Magazine) There's probably only four women in Los Angeles that have intimate knowledge of 'Will Smith' (qv). You know, I had my brief period, a short time in my life, but that got real old real quick. I want to love somebody. I just always prefer one woman. The intimacy is so much more enjoyable when it's with someone you love. Because I know I can pretty much have sex with anyone I choose, it becomes less appealing. It's no challenge. A successful relationship is much harder than sleeping with as many women as you can sleep with.", "(1996, on fame) There are members of the press who make their living infringing on people's private moments. You never know where these people are going to be. They stay outside your house and climb the gates and walk around looking in your windows. Now I've got a bunch of 140-pound Rottweilers. It's just a shame to have to live like that, because I like people so much. Still, you don't know what people will do. You can never feel completely safe. You've got to look around all the time. I'm kind of used to that, being black, watching out for white people coming to get you. Now it's tenfold...I'm having trouble dealing with the concept that you sacrifice your right to courtesy by being a celebrity. Because I'm a celebrity, someone is allowed to block my way from getting into my car. If I'm in the middle of a conversation, because I'm a celebrity, someone can come up to me and go, 'Can you sign this?' You're supposed to do the nice thing and sign, because if you don't, it's like, 'He's such an asshole. He doesn't sign autographs.' You're in mid-gulp at a restaurant and people ask you to put down your fork, take some dirty pen that you have no idea of where it's been, sign some filthy piece of paper ripped off a paper bag they found outside, then go back and put your hands in your food.", "(1996, on fame) I'm pretty good at diffusing potential situations, but I find myself having to diffuse them a lot more often than before. I heard 'Sylvester Stallone' (qv) say once that after he made _Rocky (1976)_ (qv), everybody wanted to fight him. Well, every big guy wants to fight me now. They go. 'Yo. I ain't no alien-hit me,' and I'm like, 'I don't want to hit you. I just want to get some cheese from the supermarket to make grilled cheese sandwiches for my son.' Why do people want to fight me? What did I do? I think of myself as a pretty calm, likable guy. It's really weird. I was nonthreatening on 'The Fresh Prince,' so nobody wanted to fight me, but then I buffed up for Independence Day, came on a little cocky, and suddenly people want to knock me down. People who know me from TV think I've seen them in their underwear drinking on their couch, so the response is more familiar, more friendly. Film gives you almost God status, you know? It makes people crazy.", "(1996, on fame) I was in Manhattan making _Men in Black (1997)_ (qv) and this girl was driving along, saw me and started mouthing over and over, 'Oh, my God. Oh, my God,' then crashed into another car.\" Smith shakes his head in amazement. \"Now, she gets out of her car, but she doesn't say, \"Oh. I crashed into the back of a car!' She runs over to me and asks for my autograph. That's when I thought: This is real different. Then, I was at the Virgin Megastore in Manhattan and this girl came up to me, pulled her shirt up and asked me to sign her breasts with a Sharpie. I mean, she's standing there in the middle of the store with her titties hanging out and I'm like, 'Listen, those are really nice breasts, but this is really an inappropriate time and place.' In another store, this toothless 80-year-old lady came up to me, grabbed my face and tried to kiss me right on the lips. I said, 'Now, ma'am, if I walked up to you, grabbed your face and tried to kiss you on the mouth, the cops would give me a Rodney King and take me right to jail.' And she was like, 'Oh, slop being mean. Just give me a kiss.'", "(1996) As for my life right now, the picture I always see in my mind is of that incredible game Michael Jordan had where he had 63 points. He just turned to the TV cameras and shrugged, like, 'Hey, I'm just throwing 'em up there and they're going in.' That's how I feel. I'd love to say that I'm brilliant, that I'm the second coming. The real answer is that I'm blessed. I throw 'em up from wherever I am and they just keep going in. How cool is that?", "(1996) I'm above average in talent, but where I think I excel is psychotic drive. All I need is for somebody to say I can't do something and this crazy switch inside me makes me attack whatever I'm doing. Psychotic drive is where I excel over people that are probably more naturally gifted.", "(1996) In film and TV, there's a natural, gradual decline to your career. In the music business, it's literally one day. The day your record hits the radio, you explode to number one on the countdown. You're the man, you're large, you're doing show after show. Then you're over just that fast. I had the ups of people telling me, 'You're the man, Will.' then the downs of selling your house because you can't afford all this stuff you bought because everybody told you were the man. The money disappeared. But, my God, I learned about myself because I had the ups and all the downs...I've been in really ugly situations, hostage situations, on the road with my music. You know, you get out to Albany, Georgia and the promoter didn't make his money, so he doesn't want to pay you. I mean, during the first part of my music career, we signed our first deal with a gangster who later tried to shoot us. He was a penny-ante gangster, but the bullets were for real. As we were driving away, he shot at the car five or six times. It was pretty scary, but you don't think about that while it's happening, you're just trying to get away. He would have killed us if he could actually shoot.", "[on turning down the lead role in _The Matrix (1999)_ (qv)] You know, _The Matrix_ is a difficult concept to pitch. In the pitch, I just didn't see it. I watched Keanu's performance - and very rarely do I say this - but I would have messed it up. I would have absolutely messed up _The Matrix (1999)_ (qv). At that point I wasn't smart enough as an actor to let the movie be. Whereas Keanu was smart enough to just let it be. Let the movie and the director tell the story, and don't try and perform every moment.", "As a child I watched 'Dallas', and that was the vision for my life as long as I can remember. The property had a name! It was called 'Southfork'. How does a property have a name? Ours was just 'Row House'.", "[on passing on the role of Django in _Django Unchained (2012)_ (qv)] Django wasn't the lead, so it was like, I need to be the lead. The other character was the lead! I was like, 'No, Quentin, please, I need to kill the bad guy!' I thought it was brilliant. Just not for me.", "[on 'Justin Bieber' (qv)] I talk to Justin once a week, and he is suffering from immature adulthood in the media and surrounding world. He's not doing anything that a normal nineteen-year-old wouldn't want to do and wouldn't need to do to become a man. The transition from boyhood to manhood is a very difficult transition that he's handling on a world stage better than 95 percent of the people who talk shit about him.", "I love to create. There's something about making movies that just really gets me excited. It's not the movie-making probably as much as the storytelling. I love people being wrapped in a story and being able to deliver that emotional punch line at the end of the story.", "[in an interview for _After Earth (2013)_ (qv) talking about what scares him the most in cinema] It's been an absolute necessity that the movie be a blockbuster, but I think I'm going to start moving out of that and finding more danger in my artistic choices.", "Being realistic is the most commonly traveled road to mediocrity.", "[Why he and his wife are boycotting the Oscars] When I look at it, the nominations reflect The Academy. The Academy reflects the industry and the industry reflects Hollywood and America. America reflects a series of challenges that we are having in our country at the moment which are on a regressive slide we are having towards separatism, towards racial and religious disharmony and that's not the Hollywood and the America I want to leave behind.", "[on making _Wild Wild West (1999)_ (qv)] I wanted to win and be the biggest movie star, and what happened was there was a lag around _Wild Wild West (1999)_ (qv) at the time. I found myself promoting something because I wanted to win versus promoting something because I believed in it. It's now in the hand of fans. I have to be in tune with their needs and not trick them into going to see Wild Wild West.", "[on making Wild Wild West] We went out on a limb with a couple of these scenes. I sure hope people think this is funny, because this is one of those setups that can either be hilarious or it can be something people will hate for the rest of their lives...We'll see on Big Willie Weekend what people think.", "[on why he decided to make Wild Wild West] The first time where it didn't work the way that I wanted was Wild Wild West. I was coming off of Men in Black, and everything was like, 'Oh, we can't lose,' you know? I was like, 'Oh! Tragedy!'... With a movie, it's like you never know; you can love it, you can have done what you think is the best work you've ever done, and you put it out on that Friday, and everybody hates it - and you've taken a year."], "salary history": ["_Where the Day Takes You (1992)_ (qv)::$50,000", "_Made in America (1993)_ (qv)::$100,000", "_Six Degrees of Separation (1993)_ (qv)::$500,000", "_Bad Boys (1995)_ (qv)::$2,000,000", "_Independence Day (1996)_ (qv)::$5,000,000", "_Men in Black (1997)_ (qv)::$5,000,000", "_Enemy of the State (1998)_ (qv)::$14,000,000", "_Wild Wild West (1999)_ (qv)::$7,000,000", "_The Legend of Bagger Vance (2000)_ (qv)::$10,000,000", "_Ali (2001)_ (qv)::$20,000,000", "_Men in Black II (2002)_ (qv)::$20,000,000", "_Men in Black II (2002)_ (qv)::$20,000,000 + 10% Gross", "_Bad Boys II (2003)_ (qv)::$20,000,000 + 20% of the gross", "_I, Robot (2004)_ (qv)::$28,000,000", "_The Pursuit of Happyness (2006)_ (qv)::$20,000,000", "_Hancock (2008)_ (qv)::$20,000,000", "_The Karate Kid (2010)_ (qv)::$5,500,000 (back-end for producing, based on worldwide gross of $358,000,000 plus share of DVD and pay-TV revenue)", "_Men in Black 3 (2012)_ (qv)::$20,000,000", "_Suicide Squad (2016)_ (qv)::$20 million"], "birth date": "1968-09-25", "birth notes": "Philadelphia, Pennsylvania, USA", "_actorID": "18", "_source": "IMDB", "actorID": "0000226", "created_utc_dt": "08/26/2019, 21:53:59"}