{"headshot": "https://m.media-amazon.com/images/M/MV5BMTY1ODkwMTQxOF5BMl5BanBnXkFtZTcwNzkwNDcyMw@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Kevin Michael Costner", "height": "6' 1\" (1.85 m)", "mini biography": ["Kevin Michael Costner was born on January 18, 1955 in Lynwood, California, the third child of 'Bill Costner' (qv), a ditch digger and ultimately an electric line servicer for Southern California Edison, and 'Sharon Costner' (qv) (née Tedrick), a welfare worker. His older brother, Dan, was born in 1950. A middle brother died at birth in 1953. His father's job required him to move regularly, which caused Kevin to feel like an Army kid, always the new kid at school, which led to him being a daydreamer. As a teen, he sang in the Baptist church choir, wrote poetry, and took writing classes. At 18, he built his own canoe and paddled his way down the rivers that Lewis & Clark followed to the Pacific. Despite his present height, he was only 5'2\" when he graduated high school. Nonetheless, he still managed to be a basketball, football and baseball star. In 1973, he enrolled at California State University at Fullerton, where he majored in business. During that period, Kevin decided to take acting lessons five nights a week. He graduated with a business degree in 1978 and married his college sweetheart, 'Cindy Costner' (qv). He initially took a marketing job in Orange County. Everything changed when he accidentally met 'Richard Burton' (qv) on a flight from Mexico. Burton advised him to go completely after acting if that is what he wanted. He quit his job and moved to Hollywood soon after. He drove a truck, worked on a deep sea fishing boat, and gave bus tours to stars' homes before finally making his own way into the films. After making one soft core sex film, he vowed to not work again if that was the only work he could do. He didn't work for nearly six years, while he waited for a proper break. That break came with _The Big Chill (1983)_ (qv), even though his scenes ended up on the cutting room floor -- he was remembered by director 'Lawrence Kasdan' (qv) when he decided to make _Silverado (1985)_ (qv). Costner's career took off after that.::John Sacksteder <jsack@ka.net>"], "spouse": ["'Christine Baumgartner' (qv)::(25 September 2004 - present) ( 3 children)", "'Cindy Costner' (qv)::(11 February 1978 - 12 December 1994) ( divorced) ( 3 children)"], "trade mark": ["Frequently appears in Westerns", "Frequently appears in sports-themed films, in particular baseball"], "trivia": ["Announced players who had been selected to Major League Baseball's All Century Team at the 1999 All Star game at Fenway Park in Boston.", "Voted most erotic male by the readers of the German magazine \"Amica\". [May 1998]", "Attended and graduated from Villa Park High School in Villa Park, California (1973).", "Father of 'Joe Costner' (qv), 'Annie Costner' (qv) and 'Lily Costner' (qv).", "Youngest of three sons of 'Bill Costner' (qv), an electrician and later utilities executive, and his wife 'Sharon Costner' (qv), a welfare worker.", "Ranked #27 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Children: (with ex-girlfriend Bridget Rooney) Liam Costner (born 1996); (with ex-wife 'Cindy Costner' (qv)) Anne Clayton Costner (born April 15, 1984), Lily McCall Costner (born August 4, 1986) and Joe Tedrick Costner (born January 31, 1988); (with wife 'Christine Baumgartner' (qv)) Cayden Wyatt Costner (born May 6, 2007), Hayes Logan Costner (born February 12, 2009) and Grace Avery Costner (born June 2, 2010).", "His first wife, 'Cindy Costner' (qv), played \"Snow White\" for Disneyland.", "Chosen by People magazine as one of the 50 Most Beautiful People in the World. [1990]", "Chosen by People magazine as one of the 50 Most Beautiful People in the World. [1991]", "He turned down the leading role in _WarGames (1983)_ (qv), which was played by 'Matthew Broderick' (qv), to play Alex Marshall in _The Big Chill (1983)_ (qv). His role was later deleted.", "Listed as one of twelve \"Promising New Actors of 1986\" in John Willis' Screen World, Vol. 38. [1986]", "Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#87). [1995]", "The lead role in _Air Force One (1997)_ (qv) was written for him but he was still heavily involved in filming _The Postman (1997)_ (qv) and suggested the part be given to 'Harrison Ford' (qv)).", "His frontal nude scene in _For Love of the Game (1999)_ (qv) was reportedly deleted after being met with laughter at test screenings.", "His character in _Dragonfly (2002)_ (qv) was written with the intention of 'Harrison Ford' (qv) taking the film role. Ford turned down the role to take a year off from movies.", "Costner and Ford's casting choices have crossed paths many times before. 'Harrison Ford' (qv) turned down the Jack Ryan role in _The Hunt for Red October (1990)_ (qv) as did 'Kevin Costner' (qv). 'Harrison Ford' (qv) instead made _Presumed Innocent (1990)_ (qv) and 'Kevin Costner' (qv) made his Oscar-winning _Dances with Wolves (1990)_ (qv). The Jack Ryan role went to then character actor 'Alec Baldwin' (qv).", "'Harrison Ford' (qv) later turned down the role of 'Jim Garrison' (qv) in 'Oliver Stone' (qv)'s _JFK (1991)_ (qv). 'Kevin Costner' (qv) decided to take the role after a meeting with the director Stone.", "The President of the United States role in the mega-blockbuster _Air Force One (1997)_ (qv) was written specifically for 'Kevin Costner' (qv). In fact, 'Kevin Costner' (qv) helped develop the action film with Beacon Communications and writer 'Andrew W. Marlowe' (qv) in 1996. But Kevin had to eventually pass on the film because of work delays with his futuristic _The Postman (1997)_ (qv). Costner called up 'Harrison Ford' (qv) personally and offered Harrison a once-in-a-lifetime role. 'Harrison Ford' (qv) accepted the role and has always thanked 'Kevin Costner' (qv) in interviews for his kind gesture. _Air Force One (1997)_ (qv) went on to become one of the highest grossing films of all time.", "Member of the Delta Chi Fraternity, along with 'G.D. Spradlin' (qv) and 'Ashton Kutcher' (qv).", "Sioux nation gave Costner a tract of land after making _Dances with Wolves (1990)_ (qv). Costner built a golf course on that land.", "Has starred in two films about 'John F. Kennedy' (qv), but has not played Kennedy; the two films are _JFK (1991)_ (qv) and _Thirteen Days (2000)_ (qv).", "Before succeeding in the acting business, Kevin worked as a skipper on the ride, the Jungle Cruise, at Disneyland in Anaheim, California.", "On June 26, 2003, he announced his engagement to his girlfriend 'Christine Baumgartner' (qv), having been a couple since 1999.", "For his entire career, he has purposely avoided doing sequels to his films. So far, he is one of the few blockbuster stars to never come back for a sequel.", "Turned down a role in _Platoon (1986)_ (qv) because he thought it portrayed American soldiers in Vietnam negatively and didn't want to insult his brother, who was a Vietnam veteran.", "In his role as Crash Davis in _Bull Durham (1988)_ (qv), he states his personal beliefs. One of those beliefs is \"...Lee Harvey Oswald acted alone\". In his role as 'Jim Garrison' (qv) in _JFK (1991)_ (qv), he plays a lawyer determined to prove that Oswald did not act alone.", "Co-owns the Midnight Star casino in Deadwood, South Dakota, which displays some of his movie memorabilia.", "Opened the Tatanka Interpretive site in Deadwood, South Dakota in 2003. The site features a bronze statue depicting the Lakota Sioux buffalo hunt. There is also a museum, gift shop, and living history of the Lakota Sioux tribe. Tatanka is the Lakota word for buffalo.", "On his and 'Christine Baumgartner' (qv)'s wedding day, there were 500 guests, including: 'Oprah Winfrey' (qv), 'Bruce Willis' (qv), 'Tim Allen' (qv), 'Don Johnson' (qv), 'Jack Nicholson' (qv), 'Mary McDonnell' (qv), 'David Giammarco' (qv), 'Michael Douglas' (qv) and wife 'Catherine Zeta-Jones' (qv).", "Owns a 165 acre ranch outside of Aspen, Colorado.", "Is a supporter of the Arsenal Football Club (UK). In 2003, he was working in London and decided to go to a game, only to find out Arsenal were playing away from home, so he booked a private helicopter to take him to the match 160 miles away.", "Has played at the celebrity golf tournament Pebble Beach, California, every year starting from 1996.", "He joins 'Sylvester Stallone' (qv), 'Prince' (qv), 'Roberto Benigni' (qv), 'William Shatner' (qv) and 'Tom Green' (qv) as being the only actors to direct themselves in performances that would \"win\" them a Razzie Award for Worst Actor.", "Some of his favorite films are _How the West Was Won (1962)_ (qv), _Cool Hand Luke (1967)_ (qv), _Giant (1956)_ (qv), _The Bridge on the River Kwai (1957)_ (qv), _The Great Escape (1963)_ (qv), _Hombre (1967)_ (qv), _The Searchers (1956)_ (qv), _The Man Who Shot Liberty Valance (1962)_ (qv), _Butch Cassidy and the Sundance Kid (1969)_ (qv) and _The Magnificent Seven (1960)_ (qv).", "Some of his favorite directors are 'Frank Capra' (qv), 'George Stevens' (qv), 'John Sturges' (qv), 'Martin Scorsese' (qv), 'Francis Ford Coppola' (qv) and 'Steven Spielberg' (qv).", "Movies he likes are _Red River (1948)_ (qv), _Ben-Hur (1959)_ (qv), _Lawrence of Arabia (1962)_ (qv) and _Spartacus (1960)_ (qv).", "His favorite movies are long epics with a great deal of stories.", "His favorite genre is the Western.", "Turned down the role of Bill in 'Quentin Tarantino' (qv)'s _Kill Bill: Vol. 1 (2003)_ (qv) and _Kill Bill: Vol. 2 (2004)_ (qv) to direct _Open Range (2003)_ (qv) instead.", "Along with 'Warren Beatty' (qv), 'Clint Eastwood' (qv), 'Mel Gibson' (qv), 'Richard Attenborough' (qv) and 'Robert Redford' (qv), he is one of six people to win an Academy Award for \"Best Director\", though they are mainly known as actors.", "Has done more baseball themed films than any other actor, except for 'Dennis Haysbert' (qv), who played Pedro Cerrano in all three Major League movies, as well as being in _Mr. Baseball (1992)_ (qv).", "Goes to Omaha, Nebraska, during the summer for the College World Series if California State Fullerton (his alma mater) qualifies for the tournament.", "He and his second wife, 'Christine Baumgartner' (qv), honeymooned in St. Andrews, Scotland. Their honeymoon coincided with the annual Dunhill Links Celebrity Golf Tournament, where regulars include 'Samuel L. Jackson' (qv), 'Tom Cruise' (qv) and 'Michael Douglas' (qv).", "From 2005-2006, he had owned a home in the Hollywood Hills. But in April 2006, he had sold his 10,000-square-foot Spanish Hacienda, on an acre behind gates, his five bedrooms plus staff quarters, a media room, a billiards room, a tennis court, a gym, a pool, a spa and grassy yards. Sold for $11.5 million to _American Idol (2002)_ (qv) host 'Ryan Seacrest' (qv).", "In April 2006, he spent $28.5 million on an oceanfront 17-acre ranch in Santa Barbara County, California. He and wife, 'Christine Baumgartner' (qv), are raising horses on their new ranch.", "Has two films on the American Film Institute's 100 Most Inspiring Movies of All Time. They are _Dances with Wolves (1990)_ (qv) at #59 and _Field of Dreams (1989)_ (qv) at #28.", "From the mid-1990s, following the commercial and critical failure of his ambitious science-fiction epic _Waterworld (1995)_ (qv), his box office appeal waned somewhat, reviving slightly with the political drama _Thirteen Days (2000)_ (qv).", "Was considered for the role of Colonel James Dolittle in _Pearl Harbor (2001)_ (qv), which he turned down. The role went to 'Alec Baldwin' (qv).", "Was considered the role of Cleveland Heep in _Lady in the Water (2006)_ (qv), but the studio could not contact Costner. The role was given to 'Paul Giamatti' (qv) instead.", "Supported 'Bill Clinton' (qv) in the 1992 and 1996 presidential elections.", "Once was a bus driver for tours to stars' Hollywood homes.", "Costner is frequently cited as a celebrity Republican, although he no longer is. He did socialize and golf with President 'George Bush' (qv), and in 1992, the Bush re-election campaign leaked word that he would appear in a commercial for the President. Costner, then a registered Republican, had no intention of aiding Bush, according to a close associate. He was a Clinton supporter. \"We had to tell the Bush campaign to stop saying he was going to do ads,\" the associate says. Before the 1996 election, Costner switched his registration to Independent. He gave $5,000 to the Democratic Party and attended the Democratic National Convention. Still, he continues to receive invitations to GOP fundraisers, and in February 1999, the New York Times referred to him as a Republican. \"He's not a particularly political guy,\" says the associate.", "Was attached to the role of Sgt. John McLoughlin in _World Trade Center (2006)_ (qv), which went to 'Nicolas Cage' (qv).", "His production companies are TIG Productions and Treehouse Films. Tig was the nickname of his paternal grandmother.", "Publicly called for increased gun controls following the Virginia Tech massacre.", "Graduated from the same college as 'Gilbert J. Menchaca' (qv).", "Played golf several times with former President 'Ronald Reagan' (qv) in the early 1990s.", "In both _The Upside of Anger (2005)_ (qv) and _Mr. Brooks (2007)_ (qv), songs by New Zealand indie band The Veils are featured in scenes in which he is on the phone with another character.", "Former fashion model.", "Singer of \"'Kevin Costner' (qv) and Modern West\", a rock/country band which he recently founded with the encouragement of his wife Christine. In October 2007, he was on a worldwide tour with the band, including sold-out shows in Istanbul and Rome.", "Has English, Irish, Scottish, Welsh, German, and Swiss-German ancestry. Has also stated that he has Cherokee roots, but it is not clear if this ancestry has been documented.", "Got to know 'Richard Burton' (qv) on the return plane from his honeymoon with Cindy in Puerto Vallarta, who advised him to give everything up completely if he wanted to pursue acting (1978).", "Although often compared with 'Gary Cooper' (qv), he has himself named 'James Stewart' (qv) as the western star who has most influenced his work. As a child, he was particularly fond of the five westerns Stewart made for director 'Anthony Mann' (qv).", "Has twice taken roles refused by both 'Harrison Ford' (qv) and 'Mel Gibson' (qv). The first was Eliot Ness in _The Untouchables (1987)_ (qv), the other was 'Jim Garrison' (qv) in _JFK (1991)_ (qv).", "He turned down the role of Jack Forrester in _Jagged Edge (1985)_ (qv), which went to 'Jeff Bridges' (qv).", "Was considered for the role of General Munro in _The Fifth Element (1997)_ (qv), which went to the late 'Brion James' (qv).", "He turned down the role of Adam Gibson in _The 6th Day (2000)_ (qv) because of family commitments. The role later went to 'Arnold Schwarzenegger' (qv).", "His role in _Bull Durham (1988)_ (qv) was originally written for 'Kurt Russell' (qv).", "A skilled equestrian, he did his own riding in _The Postman (1997)_ (qv).", "Was in consideration for the part of Lester Burnham in _American Beauty (1999)_ (qv) but 'Kevin Spacey' (qv), who went on to win a Best Actor Oscar for his performance, was cast instead.", "He and his country rock band, 'Kevin Costner' (qv) and Modern West played a concert at the Romania Film Festival on October 03, 2009 in the city of Arad.", "He was awarded a Star on the Hollywood Walk of Fame at 6801 Hollywood Boulevard in Hollywood, California on August 11, 2003.", "Has founded with his brother Dan, the Costner Industries Nevada Corporation (CINC) in Carson City. This company product a Liquid-Liquid Centrifugal Separator using clean-up the oil in the Gulf of Mexico.", "Spoke at the funeral of his _The Bodyguard (1992)_ (qv) co-star, 'Whitney Houston' (qv), on February 18, 2012.", "Friends with 'John J. Coinman' (qv). Uses John's songs in his movies.", "Inducted into the Irish-American Baseball Hall of Fame in 2008.", "The longest he has gone without a Razzie nomination is two years, between _The Bodyguard (1992)_ (qv) and _Wyatt Earp (1994)_ (qv).", "As of 2017, has appeared in four films that were nominated for the Best Picture Oscar (not counting his deleted appearance in _The Big Chill (1983)_ (qv)): _Field of Dreams (1989)_ (qv), _Dances with Wolves (1990)_ (qv), _JFK (1991)_ (qv) and _Hidden Figures (2016)_ (qv). _Dances with Wolves (1990)_ (qv) won in the category.", "Directed three Oscar nominated performance: 'Graham Greene' (qv), 'Mary McDonnell' (qv) and himself, all in _Dances with Wolves (1990)_ (qv).", "Sport features prominently in Kevin's films, especially his first love, baseball: _Chasing Dreams (1982)_ (qv), _Bull Durham (1988)_ (qv), _Field of Dreams (1989)_ (qv), _For Love of the Game (1999)_ (qv), _The Upside of Anger (2005)_ (qv) / Football (NFL): _Draft Day (2014)_ (qv) / Golf: _Tin Cup (1996)_ (qv) / Cycling: _American Flyers (1985)_ (qv) / (Running/cross country): _McFarland, USA (2015)_ (qv) / Tennis (secondary): _Revenge (1990)_ (qv), etc.", "Has appeared in two films with 'Sean Connery' (qv): _The Untouchables (1987)_ (qv) and Robin Hood: 'Prince' (qv) of Thieves (1991). Both of Connery's roles in those films were played on television by 'John Rhys-Davies' (qv).", "Along with 'Delbert Mann' (qv), 'Jerome Robbins' (qv), 'Robert Redford' (qv), 'James L. Brooks' (qv) and 'Sam Mendes' (qv), he is one of only six people to win the Academy Award for Best Director for their directorial debut: Mann for _Marty (1955)_ (qv), Robbins for _West Side Story (1961)_ (qv) (which he co-directed with 'Robert Wise' (qv), Redford for _Ordinary People (1980)_ (qv), Brooks for _Terms of Endearment (1983)_ (qv), Costner for _Dances with Wolves (1990)_ (qv) and Mendes for _American Beauty (1999)_ (qv).", "Fan of the New York Knicks.", "One of the few actors who has worked with all three stars of Goodfellas - Robert De Niro (The Untouchables); Joe Pesci (JFK) and Ray Liotta (Field of Dreams).", "Born just one day after what would have been his brother Mark's 2nd birthday.", "He has appeared in two films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _Field of Dreams (1989)_ (qv) and _Dances with Wolves (1990)_ (qv). He has also directed one film that is in the registry: Dances with Wolves.", "Has played several roles in films where his character takes on real-life famous criminals. In _The Untouchables (1987)_ (qv), he takes on Al Capone and the Chicago mob, in _Wyatt Earp (1994)_ (qv) he takes on The Clanton gang, and in _The Highwaymen (2019)_ (qv) he takes on Bonnie and Clyde."], "quotes": ["Real heroes are men who fall and fail and are flawed, but win out in the end because they've stayed true to their ideals and beliefs and commitments. -- Interview with 'David Giammarco' (qv), Cigar Aficionado Magazine, Nov/Dec 2000.", "I'm happy about the things I've done. Not always happy about the results, but happy about the decisions, because I made them myself. And I think that's an important way to go through life. -- Interview with 'David Giammarco' (qv), Cigar Aficionado Magazine, Nov/Dec. 2000.", "[on _Dances with Wolves (1990)_ (qv)] \"This is a bonding film for all. You could put it anywhere in history--the Berlin Wall, Kuwait\".", "My first introduction to English football was in 1990 when I was over here making Robin Hood and I got invited to an Arsenal game. Having watched sports all my life in America, there was no comparison in terms of the emotion that was in the stadium that day. And I really never forgot it. - on being an Arsenal fan.", "I'm really aware of my disappointments, what movies I didn't like when I was done. I'm not so sure they line up with public or critical disappointments. But if I have to reduce my life to the box office, I can see what the up-and-down thing is. Popularity now is cultural achievement. If you can be popular, you actually can make a living out of being popular. It's not my way. Other actors might have made \"Bull Durham 2\",\"Tin Cup 2\",\"Dances 2\" and \"Bodyguard 2\". But I don't think repeating yourself is very good.", "[on gaining weight for _The Upside of Anger (2005)_ (qv)] I put on 20 pounds for the film. I drank whole milk with sugar, bananas and ice cream. And chocolate and cookies.", "[on going bald] I'm not into plugs, rugs or drugs to correct this problem and would rather just shave it off.", "I registered as a Republican when I was twenty-one. My parents were Republicans. But as I've gotten older I've questioned my whole conservative background... I think you should be fair about how you treat people.", "[on the Iraq war] I don't want to turn my back on that [Bush] family. They've been gracious to me. We're supposed to evolve from frontier justice. I think that the old west mythology is a good thing to have in your spine. But it shouldn't operate your brain. It's nice to know that you are willing to fight, but it's good to know how smart you are about not fighting.", "The fact that I was 5 foot 2 as a sophomore didn't help. I'm 6 foot 1 now but still relate to those feelings. I didn't date in high school and didn't get my growth until college. I never got over being short.", "[on _Death of a President (2006)_ (qv)] It's awfully hard if you're his children, his wife, his mother, his dad; there's a certain thing we can't lose as human beings, which is empathy for maybe the hardest job in the world. Whether we think it's being performed right or not we can't, like, wish... or think that's even cute.", "I don't mind Hollywood. After all, I don't make movies that are like avant garde or not understandable. I just like to make a mainstream movie with all the edges that existed in the writing and I don't like to see it flattened out in order to cater to audiences. I don't really give a shit what people think about my movie after watching it and giving it a test score, but I really care about what you think about it when you see it in its purity, because I don't feel like I'm going to lose you. I don't feel like my movies are going to be for everyone because they're not, because sometimes they're more adult and that eliminates kids.", "I'm a hunter, I hunt but I think there should be gun laws. I think there should be a lot of gun laws. I don't want to lose my shotgun but there's a real good reason why I use my shotgun. It came from my grandpa. His cheek was on it. My dad's cheek was on it and I go out and hunt with my dogs. My gun's an heirloom to me and my son, one day, when I'm gone, is gonna know, \"Your dad hunted with that.\" But even though with the connection that I have to my gun, can I look at the NRA and say, \"I think you're out of line?\". I can say that.", "I think you have to look at screenwriting as an art form because it's not all that easy to do. Not all that many people can do it. So you have to go out and find the material, or develop it from scratch, and I'm one of the handful or people who actually spends his own money on developing and producing projects I like.", "Everyone feels like they could have done things differently in life. But I'm happy about the things I've done. Not always happy about the results, but happy about the decisions, because I made them myself. And I think that's an important way to go through life. -- Interview with 'David Giammarco' (qv), Cigar Aficionado Magazine, Nov/Dec. 2000.", "You know, the Kennedys have endured such a large amount of tabloidism over the last twenty years. But my feeling is that no matter what anybody thinks about the Kennedys, in those thirteen days they were absolutely golden. And if other individuals had been in that position, I think the legacy we would have been sharing in the year 2000 - instead of all the bright lights and parties when we hit the Millennium - would be 150 million people dead. It would make the Vietnam War pale in comparison. And if other men had been in power, they would have swallowed hook, line and sinker the recommendations of the military. -- Interview with 'David Giammarco' (qv), Cigar Aficionado Magazine, Nov/Dec. 2000.", "I can't say I really see much difference between my son and daughters except that my girls will occasionally make me a sandwich and my son won't.", "I don't prefer to be known as a conservative. I'm not a Republican. I basically was raised in a house that was a Republican house. My politics came out my kitchen table, listening to my parents. I thought the people that protested against the Vietnam war were unpatriotic because my brother was fighting over in Vietnam. I was only 14 years old. As I got time and distance I realized it was just a difference of opinion and their opinion wasn't necessarily wrong. As a person evolves they begin to have their own voice and their own way of thinking. I wasn't ahead of my time.", "You know, _Waterworld (1995)_ (qv) could probably be re-released based on my travelling around the world, and could make a lot of money again, because it's a lot of people's favorite movie. That's not bullshit. That's real. It's a movie that people talk to me about around the world. There'll be a moment in time when people will maybe see what really happened with Waterworld, and maybe take a more thoughtful look at it and maybe see the heroism of everything. I know forensically everything about that movie, what happened. I know all of it and I've never seen anybody really get it right. But that's okay. I wouldn't write the book. But if somebody wrote a book, I would know if they got it right. It's an amazing movie. I'm proud of this movie for a variety of reasons. I like my performance in it. I thought that 'Kevin Reynolds' (qv) has a great vision and some of the scenes he did are scenes that are really unforgettable. It's a flawed movie and almost every movie I've ever worked on is a flawed movie. I think it's a movie that really stands, myself.", "I've always known what a good movie is. I've not often known what a hit is. I think _The War (1994)_ (qv) is a good movie, but it's not a hit. I think _A Perfect World (1993)_ (qv) is a good movie, but it's not a hit. And so what should I have done? Should I have turned my back on those movies? I can't do that, I just can't. If I can be in a good movie, then I can feel okay about it. I can feel okay about _The Upside of Anger (2005)_ (qv), I can feel good about _Open Range (2003)_ (qv), I can feel good about _Mr. Brooks (2007)_ (qv). Is it a hit? It's not a hit, but it will make money. Am I proud of it? I am proud of it. _No Way Out (1987)_ (qv) was a movie that was in turnaround. It was not going to be made. _Bull Durham (1988)_ (qv) was not going to be made. We went to every studio twice. So when people want to look at my career in retrospect and go, \"Hit, hit, those movies were hits...\" Well those movies weren't going to be hits unless we forced them onto the screen.", "I had to make a big decision to become an actor, and when you decide to become an actor, there's a huge amount of doubt about what it means to those around you. Stuff like \"How's he going to do that?\" and \"What makes him think he can do that?\". But I think doubt is not a bad thing to have, because it means you keep asking yourself questions. And if you're going to ask yourself questions, you have to come out swinging harder. You push harder. And everything that's happened to me in acting has been a fundamental of work and being associated with really good people. [2009]", "[on press criticism of him in the mid-1990s] I saw what was happening. I knew why. It was like the planets had lined up for me. I had gotten a divorce and maybe people thought that that was because my head was too big or something with all the success. That simply wasn't what it was. If I was going to go crazy, I'd have gone crazy with the first hit, the second hit, the third, the fourth. It was much more complicated than that. It wasn't about fame. It wasn't about that at all. And I think maybe people were disappointed because they had seen me have a life. Was I the last hope for men and women? \"If they can't make it, no-one can!\" But we never projected ourselves in the press as a perfect couple. I didn't want that mantle, but when people project it on you and see it all dissolve....You see it. I don't know if people beg for it and then they can't get rid of it. I don't know what it is. I didn't court it. I never courted the press on any level except to promote a movie. You never saw me do press outside the lines of a movie. Twice in my career - and people don't know this - I took a year off. If you look at my filmography, I probably have fewer movies than anybody else in my category. If you did the math on movies, I think you'd be shocked that mine might be a third of what other people do.", "[on _A Perfect World (1993)_ (qv)] I read it; I thought that the writer....the muse was working perfectly on his shoulder. I was really happy to be in that movie and play that character and say those words. I learned a lot from Clint and Clint was able to understand that I had some stuff to do, playing a very flawed character.", "My movies are isolated. They all sit by themselves a little bit. I don't have three movies coming along behind each other just in case one of them doesn't work. I haven't tried to manipulate my career. I wouldn't really know how to do that. That doesn't seem very heroic to me! Meaning it feels kinda chicken. That's kinda chickenshit.", "[at 'Whitney Houston' (qv)'s funeral] I urge us all, inside and outside, across the nation and around the world, to dry our tears, suspend our sorrow and perhaps our anger just long enough, just long enough to remember the sweet miracle of Whitney.", "[on playing dress-up] I'm not a guy who likes Halloween. So I'm a little at odds with what I've chosen to do with my life. I never liked going to a party dressed as a pirate because when you get past that initial \"Ooh, you're a pirate!\", you feel a little silly for threat of the party. Putting on the guns, letting the beard go and getting a pipe? That is fun. You look at everybody and wink and say, \"Man, I have one of the great jobs in the world.\".", "The opening weekend is a hard one for me. Especially when you take a lot of time with a movie. I don't know how it is with other people's movies. It's like, you don't know how other people make love because you've only made love yourself and so unless you've watched them, how do you know if you're doing it right? I know how I try to make a movie; I know how I lose sleep over it; I know how I deliberate for hours over the difference between saying 'She went over there' or saying 'She's gone'. And people will ask say, \"What's the difference, Kevin?\" Well, it's a big difference to me, to find that exactly right line. And when you work hard on things like that, it's frustrating to me that a movie can be dismissed so easily. These movies for me are like the same kind of pictures my Mom put up on the refrigerator. I'm really proud of them and if they get dismissed, and even though you're not eight years old anymore, it hurts.", "[on funding _Black or White (2014)_ (qv) himself] 'Mike Binder' (qv) sent me Black or White, and it reminded me of everything that I like about screenplays. It was very similar to _Field of Dreams (1989)_ (qv), it was very similar to _Silverado (1985)_ (qv) - it was quality, just quality writing. To me, it's the same movie as _Dances with Wolves (1990)_ (qv). I think it's a powerful movie, I think it's very commercial. I think it smells like everything that studios want, which is money - and that's not bad. I don't think artistic and financial things are mutually exclusive. I couldn't get anybody to see what I saw in it. I literally walked into my own den and looked at my wife and said, 'I think I'm gonna pay for this movie', and she said 'Really?' and then she said 'If you think that's what you should do, then that's what you should do'. And I do feel that it's a movie to be seen, and a movie to be talked about - without trying. It doesn't preach, but it's quite humorous and ultimately very poignant. The studios are making the kinds of movies they want to make. They understand their business, but I have to equally understand my business of what I choose to do, and this has as much value as anything that I could imagine doing. I couldn't minimize it, and I wouldn't allow it to be minimized. The studios didn't fail; I would have failed if I didn't toughen up and just figure out how to do it. I think it would've been a sad thing if people didn't get to see this movie. That's how much I actually believed in it.", "There's so much about _The Postman (1997)_ (qv) that I love. I probably made a mistake with Postman: I should've started it with, \"Once upon a time,\" because it's a modern-day fairytale. It wraps itself up with a storybook ending with the statue. I liked it very much.", "Every year, I mark off two weeks in June for Omaha. People ask me why. It's for the College World Series. I like to attend if Cal State Fullerton makes it. It's one of the best sporting events in the country. I highly recommend everyone to attend it at least once in their lifetime.", "It would take a lot for me to vote for a Republican these days. My views don't line up with what they believe. I believe in civil rights, gun control, protecting the environment, affordable education, not fighting in all these wars, fair taxation and the Republicans take stances opposite of my views on almost all those issues.", "I grew up in Orange County, a very Republican area at the time. My parents were Republicans. I participated in Young Republicans in college. I voted for Reagan and Bush Sr. However, I looked more and more at my own beliefs and they just didn't line up with Republican ideology. I changed my affiliation to independent after I voted for 'Bill Clinton' (qv) in 1992. These days, I would call myself a moderate Democrat, but I'm still registered as an independent.", "[on what makes a great western] Most westerns are not good. They understand the black hat and the white hat, but they don't get the dilemmas people moving across the country faced. A really good western creates a level of drama that's so random and absolute that, in the dark, you measure yourself against the women who survived out there and think, Would I have made it?", "(On _Platoon (1986)_ (qv)) The one role that I regret refusing. My brother Dan was a Marine in Vietnam and had a problem with Vietnam movies that show vets as wigged-out guys. He's very proud that he came back, went to college and has a family. In fact, Platoon was real and right. But my consciousness was with my brother."], "salary history": ["_Bull Durham (1988)_ (qv)::$1,500,000", "_Dances with Wolves (1990)_ (qv)::$3,000,000", "_JFK (1991)_ (qv)::$7,000,000", "_Waterworld (1995)_ (qv)::$14,000,000 + percentage of gross", "_Thirteen Days (2000)_ (qv)::$15,000,000", "_Dragonfly (2002)_ (qv)::$15,000,000"], "birth date": "1955-01-18", "birth notes": "Lynwood, California, USA", "_actorID": "78", "_source": "IMDB", "actorID": "0000126", "created_utc_dt": "08/26/2019, 21:54:39"}