{"headshot": "https://m.media-amazon.com/images/M/MV5BMTY4Mjg0NjIxOV5BMl5BanBnXkFtZTcwMTM2NTI3MQ@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Harry"], "height": "6' 1\" (1.85 m)", "mini biography": ["'Harrison Ford' (qv) was born on July 13, 1942 in Chicago, Illinois, to Dorothy (Nidelman), a radio actress, and Christopher Ford (born John William Ford), an actor turned advertising executive. His father was of Irish and German ancestry, while his maternal grandparents were Jewish emigrants from Minsk, Belarus. Harrison was a lackluster student at Maine Township High School East in Park Ridge Illinois (no athletic star, never above a C average). After dropping out of Ripon College in Wisconsin, where he did some acting and later summer stock, he signed a Hollywood contract with Columbia and later Universal. His roles in movies and television (_Ironside (1967)_ (qv), _The Virginian (1962)_ (qv)) remained secondary and, discouraged, he turned to a career in professional carpentry. He came back big four years later, however, as Bob Falfa in _American Graffiti (1973)_ (qv). Four years after that, he hit colossal with the role of Han Solo in _Star Wars: Episode IV - A New Hope (1977)_ (qv). Another four years and Ford was Indiana Jones in _Raiders of the Lost Ark (1981)_ (qv).Four years later and he received Academy Award and Golden Globe nominations for his role as John Book in _Witness (1985)_ (qv). All he managed four years after that was his third starring success as Indiana Jones; in fact, many of his earlier successful roles led to sequels as did his more recent portrayal of Jack Ryan in _Patriot Games (1992)_ (qv). Another Golden Globe nomination came his way for the part of Dr. Richard Kimble in _The Fugitive (1993)_ (qv). He is clearly a well-established Hollywood superstar. He also maintains an 800-acre ranch in Jackson Hole, Wyoming.Ford is a private pilot of both fixed-wing aircraft and helicopters, and owns an 800-acre (3.2 km2) ranch in Jackson, Wyoming, approximately half of which he has donated as a nature reserve. On several occasions, Ford has personally provided emergency helicopter services at the request of local authorities, in one instance rescuing a hiker overcome by dehydration. Ford began flight training in the 1960s at Wild Rose Idlewild Airport in Wild Rose, Wisconsin, flying in a Piper PA-22 Tri-Pacer, but at $15 an hour, he could not afford to continue the training. In the mid-1990s, he bought a used Gulfstream II and asked one of his pilots, Terry Bender, to give him flying lessons. They started flying a Cessna 182 out of Jackson, Wyoming, later switching to Teterboro, New Jersey, flying a Cessna 206, the aircraft he soloed in. Ford is an honorary board member of the humanitarian aviation organization Wings of Hope.On March 5, 2015, Ford's plane, believed to be a Ryan PT-22 Recruit, made an emergency landing on the Penmar Golf Course in Venice, California. Ford had radioed in to report that the plane had suffered engine failure. He was taken to Ronald Reagan UCLA Medical Center, where he was reported to be in fair to moderate condition. Ford suffered a broken pelvis and broken ankle during the accident, as well as other injuries.::Ed Stephan and Pedro Borges"], "spouse": ["'Calista Flockhart' (qv)::(15 June 2010 - present) ( 1 child)", "'Melissa Mathison' (qv)::(14 March 1983 - 6 January 2004) ( divorced) ( 2 children)", "Mary Marquardt::(18 June 1964 - 3 October 1979) ( divorced) ( 2 children)"], "trade mark": ["Frequently plays characters who use their intelligence rather than physical strength", "Known to take a lot of hits and endure a lot of pain in his action films", "Quiet but charming personality", "Deep, soft, soothing voice", "Best known for his iconic roles as Han Solo and Indiana Jones", "Known for playing unwilling but quick-witted heroes who can think on their feet", "Often works with 'Steven Spielberg' (qv) and 'George Lucas' (qv)", "Sarcastic, world-weary sense of humor", "Has a scar on his chin and a pierced left ear", "Performs many of his own stunts", "Many of his films feature a scene of him pointing his finger in someone's face", "Known for his low-key, naturalistic performances and often doing minimal rehearsal to achieve the effect", "Characters with a cynical or world-weary personality"], "trivia": ["In 1995, he was chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#15).", "He was a master carpenter before becoming a movie star, a craft he still does as a hobby.", "He revealed on _Late Show with David Letterman (1993)_ (qv) that he has some false teeth; two were pulled by a dentist after some others were damaged when he fell on a gun during a stunt for a television appearance early in his career.", "He provided the whip-cracks on the song \"Desperation Samba (Halloween in Tijuana)\" for 'Jimmy Buffett' (qv)'s album \"Last Mango in Paris\".", "He is a private pilot, single engine fixed wing and helicopter. He owns a Bonanza, Gulfstream IV, DeHavland Beaver, and Bell 407 helicopter. Destroyed first 407 during simulated \"engine-out\" practice. Regularly flies himself between New York City and Wyoming homes. Has a loft in Tribeca, New York City.", "In 1998, he was chosen as People magazine's Sexiest Man Alive.", "In October 1997, he was ranked #1 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list.", "In 1997, he was chosen by People magazine as one of the 50 Most Beautiful People in the World.", "On 19 December 1996, he was listed as one of 50 people barred from entering Tibet. Disney clashed with Chinese officials over the film _Kundun (1997)_ (qv), which Ford's second wife, 'Melissa Mathison' (qv), wrote.", "He studied at Ripon College in Ripon, Wisconsin, but left without obtaining a degree.", "His ex-wife, 'Melissa Mathison' (qv), wrote the screenplay for _E.T. the Extra-Terrestrial (1982)_ (qv).", "He considers _The Mosquito Coast (1986)_ (qv) to be the favorite of all his movies.", "He lives in a white-painted ranch house that he built himself in Jackson Hole, Wyoming.", "He has a scar on his chin which he got in 1968 when he tried to \"buckle up\" while already driving, and lost control of the car. The scar has been explained in two of his films: in the 'River Phoenix' (qv) introductory sequence in _Indiana Jones and the Last Crusade (1989)_ (qv), an inexperienced young Indy hits himself in the chin the first time he tries to use the whip; and in _Working Girl (1988)_ (qv), he first says that he got the scar in a knife fight, then admits that the true story is that he knocked his chin on a toilet after fainting during an ear-piercing.", "He was billed as Harrison J. Ford until 1970 for less confusion between him and silent-screen actor 'Harrison Ford' (qv). He actually has no middle name.", "While attending Ripon College, Ford appeared as Mac the Knife in the musical play \"The Threepenny Opera\".", "He is the older brother of 'Terence Ford' (qv).", "On 31 July 2000, he piloted his helicopter to rescue dehydrated 20-year-old hiker Sarah George from Table Mountain near his ranch in Jackson Hole, Wyoming.", "He turned down the romance-action film _Proof of Life (2000)_ (qv) (the 'Russell Crowe' (qv) role), the summer-blockbuster _The Perfect Storm (2000)_ (qv) (the 'George Clooney' (qv) role), and finally, another summer-blockbuster, the war-epic _The Patriot (2000)_ (qv) (the 'Mel Gibson' (qv) role). Ford has said The Patriot was \"too violent\" for his tastes, especially considering that many children were killed and endangered throughout the film. He told People magazine that he also turned down the film because he felt the story was too simple: \"The Revolutionary War boiled down to one man seeking revenge\".", "He replaced 'Kevin Costner' (qv) in _Air Force One (1997)_ (qv) after Kevin had to turn the part down with still being heavily involved in filming _The Postman (1997)_ (qv) and suggested Harrison for the part.", "He was listed in the 2001 Guinness Book of Records as the richest male actor.", "He turned down the role of Judge Robert Wakefield in the movie _Traffic (2000)_ (qv), which went to 'Michael Douglas' (qv).", "He is credited with \"creating\" what many believe to be the best scene in _Raiders of the Lost Ark (1981)_ (qv) because he was suffering from a bout of dysentery at the time of filming: during the scene in Cairo with the swordsman in black, the script called for a much longer fight, but because of his condition, he quietly asked director 'Steven Spielberg' (qv) if they could shorten the scene. Spielberg's reply was that the only way it could be done would be if Indy pulled out his gun and \"just shot the guy\". The rest of the crew, not aware of the change, laughed at this, and it remained in the final cut.", "He is honored for his work with the environment, Ford was asked to name a current breed of butterfly. He named this after his daughter, Georgia.", "_Dragonfly (2002)_ (qv) was written with Ford in mind for the lead role. He turned down to take a year off from making movies, and the role was given to 'Kevin Costner' (qv).", "His and 'Kevin Costner' (qv)'s casting choices have crossed paths many times before. Ford turned down the Jack Ryan role in _The Hunt for Red October (1990)_ (qv), as did Costner. Ford instead made _Presumed Innocent (1990)_ (qv) and Costner made his Oscar-winning _Dances with Wolves (1990)_ (qv). The Jack Ryan role went to 'Alec Baldwin' (qv).", "He has a species of Central American ant (Peidole harrisonfordi) and spider (Calponia Harrisonfordi) named after him in honor of his conservation work.", "He suffered a back injury while filming _Indiana Jones and the Temple of Doom (1984)_ (qv) and underwent an experimental (at the time) disc operation utilizing a papaya enzyme. While he was away 'Steven Spielberg' (qv) filmed around him as best he could, including most of the conveyor belt scene, using 'Vic Armstrong' (qv), a British-born stuntman who looked so much like Ford that members of the crew were always confusing the two. Ford resumed doing his own stunts upon his return, and his close-ups were added later into the finished film.", "He recommended 'River Phoenix' (qv) for the role of the young Indiana Jones in _Indiana Jones and the Last Crusade (1989)_ (qv). Ford and Phoenix had previously played father and son in _The Mosquito Coast (1986)_ (qv).", "In 2003, he was ranked #8 in Star TV's Top 10 Box Office Stars of the 1990s.", "He was a member of Sigma Nu Fraternity at Ripon College.", "He received a star on the Hollywood Walk of Fame at 6801 Hollywood Boulevard in Hollywood, California in May 30, 2003.", "Both his Indiana Jones jacket and fedora hat are on display at the Smithsonian Institution.", "He nearly turned down the role of Henry Turner in _Regarding Henry (1991)_ (qv) because the main character was a trial lawyer. He had just played one in _Presumed Innocent (1990)_ (qv), and was afraid of being typecast. He took the role when he realized that Henry would only be functioning as a lawyer for the first ten minutes of the film.", "In October 2003, he had surgery on a torn rotator cuff.", "He was the second actor to play 'Tom Clancy' (qv)'s CIA man Jack Ryan (in _Patriot Games (1992)_ (qv) and _Clear and Present Danger (1994)_ (qv)) after the first actor, 'Alec Baldwin' (qv) backed out after _The Hunt for Red October (1990)_ (qv). 'Ben Affleck' (qv) was the third to take the role, followed by 'Chris Pine' (qv) and 'John Krasinski' (qv).", "He worked as a carpenter in Los Angeles before achieving fame in movies, mainly doing home remodeling work. He had a reputation as one of the best cabinetmakers in the city, and his services were much in demand on Los Angeles' trendy Westside long before he became a movie star.", "At the time, his divorce from 'Melissa Mathison' (qv) was the most expensive in the history of Hollywood. Today, this is ranked the fourth.", "He scared director 'Steven Spielberg' (qv) and the crew during _Indiana Jones and the Temple of Doom (1984)_ (qv) when, without warning, he ran out across the rope bridge used in the film's climax to test its safety. Spielberg later quipped \"What can I say? Harrison really IS Indiana Jones.\".", "During the scene where he is frozen in carbonite in _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), 'Carrie Fisher' (qv) says, \"I love you\" and Ford was supposed to reply \"I love you too\", but he suggested changing it to \"I know\".", "His children with Mary Marquardt, sons 'Ben Ford' (qv) (Benjamin) (b. September 22nd 1967) and Willard Ford (b. May 14th 1969); with 'Melissa Mathison' (qv), son 'Malcolm Ford' (qv) (b. March 10th 1987) and daughter 'Georgia Ford' (qv) (b. June 30th 1990).", "He was offered the role of Mike Stivic on _All in the Family (1971)_ (qv), which he turned down, citing the bigotry of Archie Bunker was too offensive.", "He has been in three films written by 'Lawrence Kasdan' (qv), but never one directed by him. Kasdan wrote _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv) and _Raiders of the Lost Ark (1981)_ (qv).", "His character, Han Solo, was ranked number 33 in Comedy Central's \"Mouthing Off: 51 Greatest Smartasses\".", "He had a role as the school principal in _E.T. the Extra-Terrestrial (1982)_ (qv) who reprimands Elliott about the dangers of alcohol. The scene was cut because director 'Steven Spielberg' (qv) felt that Ford's presence would break the flow of the film. The only footage known to exist appeared in The E.T. Storybook released at the same time as the film.", "His favorite record is \"On the Edge\", by his favorite artist, 'Patrick Rondat' (qv).", "He was voted the 46th Greatest Movie Star of all time by Entertainment Weekly.", "He said that _Blade Runner (1982)_ (qv) was one of the most frustrating films he had ever done, because the actual shoot was very grueling and because of the post-production changes which were meant to (but did not) help the film do better at the box office.", "He was originally brought in by 'George Lucas' (qv) to feed lines to other actors auditioning for _Star Wars: Episode IV - A New Hope (1977)_ (qv) because he wasn't allowed to audition (Lucas wanted new faces for the film). He eventually won Lucas over and the role of Han Solo went to him.", "He once described Han Solo as \"the great rapscallion of the universe\".", "Out of the three leads of the original Star Wars trilogy, he was the only one to appear in all three films without ever signing a contract.", "He was friends with 'Billy Dee Williams' (qv) before they appeared together in _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv). Williams had tested for the role of Han Solo in the original film.", "He has appeared alongside four actors from \"The Lord of the Rings\" series before they appeared in the trilogy: 'John Rhys-Davies' (qv) in _Raiders of the Lost Ark (1981)_ (qv); 'Viggo Mortensen' (qv) in _Witness (1985)_ (qv); 'Sean Bean' (qv) in _Patriot Games (1992)_ (qv) and 'Miranda Otto' (qv) in _What Lies Beneath (2000)_ (qv).", "When he arrived in England to start filming _Star Wars: Episode IV - A New Hope (1977)_ (qv), 'Alec Guinness' (qv) helped him find an apartment.", "He said in an interview that he felt compelled to do his own stunts for the Indiana Jones trilogy because the films were very \"action-oriented\" and he felt if he were not in the middle of it, there was really not much else for him to do.", "He said one of the things he enjoyed most about making both _Witness (1985)_ (qv) and _The Mosquito Coast (1986)_ (qv) was getting to apply his real life skills as a carpenter (example: the barn raising scene from _Witness (1985)_ (qv)).", "His characters, Han Solo and Indiana Jones respectively, are both brutally tortured in _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv) and _Indiana Jones and the Temple of Doom (1984)_ (qv), the second installments of both trilogies.", "_Witness (1985)_ (qv) was his first role that broke him away from the science fiction and fantasy genres that made him famous. However, this does still have a connection to his breakthrough role of Han Solo. One of the cast members was 'Robert Earl Jones' (qv), whose son, 'James Earl Jones' (qv), was the voice of Darth Vader. He also worked with Ford in _Patriot Games (1992)_ (qv) and _Clear and Present Danger (1994)_ (qv).", "His daughter Georgia attends Wildwood School in Los Angeles, where the children of 'Demi Moore' (qv), 'Bill Pullman' (qv), 'Bruce Willis' (qv), 'Eddie Murphy' (qv), 'Steven Spielberg' (qv) and several over music and entertainment personalities attend, and is great friends with Elliot Murphy, son of Eddie.", "Premiere magazine ranked him as #35 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature (2005).", "While filming _Firewall (2006)_ (qv) in Vancouver, British Columbia, he was so impressed with the beauty of Bowen Island that he purchased a $13-million waterfront property upon the request of girlfriend 'Calista Flockhart' (qv).", "Indiana Jones was voted the second greatest screen hero of all time by the American Film Institute, just behind 'Gregory Peck' (qv)'s Atticus Finch in _To Kill a Mockingbird (1962)_ (qv). Han Solo was ranked at #14.", "He has been pursued by two generations of the Fett family of bounty hunters. In _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), he is captured by Boba Fett in the ending of the film. In _Six Days Seven Nights (1998)_ (qv) he is pursued by 'Temuera Morrison' (qv), who played Jango Fett, and his progeny, the stormtroopers, in _Star Wars: Episode II - Attack of the Clones (2002)_ (qv) and _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv).", "In 2003, he accepted the Oscar for \"Best Director\" on behalf of 'Roman Polanski' (qv), who was not present at the awards ceremony, being a fugitive from United States justice since fleeing the country in 1978. Ford personally delivered the Oscar statuette to Polanski a few months after the ceremony. He went to Paris, where Polanski was living at the time, the same location both worked on years earlier in _Frantic (1988)_ (qv).", "He was initially argued against casting 'Sean Connery' (qv) as his father in _Indiana Jones and the Last Crusade (1989)_ (qv) because Connery was only 12 years older. He later changed his mind and found he enjoyed working with Connery immensely.", "He tore a ligament in his knee while filming the special shoot trailer for _The Fugitive (1993)_ (qv), in which he took the lead role after 'Alec Baldwin' (qv) backed out (as had happened with _Patriot Games (1992)_ (qv)). During the film's PR campaign, he complained that he had made it through the entire shoot unscathed, only to injure himself shooting a trailer for the movie after production was finished.", "He has worked with two leading cast members from the _Star Wars: Rebel Assault II - the Hidden Empire (1995)_ (qv) video game. 'Julie Eccles' (qv) as Irene in _Indiana Jones and the Last Crusade (1989)_ (qv), and 'Jamison Jones' (qv) as one of his fellow officers in _Hollywood Homicide (2003)_ (qv).", "'Carrie Fisher' (qv) had to stand on a box for most of her scenes with him in the original Star Wars trilogy because she was a foot shorter than him and did not properly fit into the frame.", "He was the subject of a song by folk singer Christine Lavin.", "He and his _Star Wars: Episode IV - A New Hope (1977)_ (qv) co-star 'Mark Hamill' (qv) were both considered for the role of the bumbling wizard Schmendrick in the animated film _The Last Unicorn (1982)_ (qv).", "He has played two (fictional) United States Presidents. In _Air Force One (1997)_ (qv), he plays President James Marshall. In _Patriot Games (1992)_ (qv) and _Clear and Present Danger (1994)_ (qv), based on 'Tom Clancy' (qv)'s series of books, he plays Jack Ryan. Although he did not play the actual President in those films, in Clancy's series Ryan is appointed Vice President and later succeeds to the Oval Office when the President dies.", "One of his jobs in his early acting days was as a roadie on tour with 'The Doors' (qv).", "He was offered the title role in _Schindler's List (1993)_ (qv) but declined, saying that some people would not be able to look past him as a star to see the importance of the film.", "He turned down the role of Dr. Curtis McCabe in _Vanilla Sky (2001)_ (qv), which went to 'Kurt Russell' (qv).", "During his carpenter days, he built a deck for 'Sally Kellerman' (qv).", "He graduated high school in the same class as Robert Piepho, the Dean of the UMKC School of Pharmacy.", "He turned down the role of Bob Barnes in _Syriana (2005)_ (qv). He later said that this was one of the few choices in his career that he regretted.", "Of all the characters he has played, he frequently cites Indiana Jones as both his favorite and the one he is most proud of.", "His performance as Indiana Jones in the Indiana Jones film series is ranked #7 on Premiere magazine's 100 Greatest Movie Characters of All Time.", "He was offered the role of Dr. Alan Grant in _Jurassic Park (1993)_ (qv), which he turned down. The role went to 'Sam Neill' (qv) instead.", "His two most famous roles were actually not written \"for him\". He became attached to _Star Wars: Episode IV - A New Hope (1977)_ (qv) when he was reading lines with other actors doing their screen tests. When it came time to cast _Raiders of the Lost Ark (1981)_ (qv), 'George Lucas' (qv) was adamant about not casting Ford because he did not want every movie he did to be a \"'Harrison Ford' (qv) movie\". However, after 'Tom Selleck' (qv) backed out, 'Steven Spielberg' (qv) suggested Ford again, and Lucas gave in.", "He presented his _Indiana Jones and the Last Crusade (1989)_ (qv) co-star Sir 'Sean Connery' (qv) with the American Film Institute's Lifetime Achievement Award, telling him, \"'John Wayne' (qv) gave us the Old West. 'James Stewart' (qv) gave us our town. You gave us the world.\" (June 8, 2006).", "He turned down 'Kevin Costner' (qv)'s roles in _JFK (1991)_ (qv), _The Untouchables (1987)_ (qv), _Dragonfly (2002)_ (qv), the role of Jack Ryan in _The Hunt for Red October (1990)_ (qv) and _The Sum of All Fears (2002)_ (qv), 'Russell Crowe' (qv)'s role in _Proof of Life (2000)_ (qv), 'Nick Nolte' (qv)'s roles in _Cape Fear (1991)_ (qv) and _The Thin Red Line (1998)_ (qv), 'Warren Beatty' (qv)'s role as _Dick Tracy (1990)_ (qv), 'Liam Neeson' (qv)'s role in _Schindler's List (1993)_ (qv), 'Mel Gibson' (qv)'s role in _The Patriot (2000)_ (qv), 'George Clooney' (qv)'s roles in _The Perfect Storm (2000)_ (qv) and _Syriana (2005)_ (qv), 'Val Kilmer' (qv)'s role in _Kiss Kiss Bang Bang (2005)_ (qv), a proposed sequel to _The Fugitive (1993)_ (qv), and 'Tom Skerritt' (qv)'s role in _Alien (1979)_ (qv). He was considered for the leads in _Jurassic Park (1993)_ (qv), _Insomnia (2002)_ (qv) and _Who Framed Roger Rabbit (1988)_ (qv).", "In March 2003, \"The New York Daily 'News' (qv)\" cleared up conflicting reports of the actor's stance on Iraq war. The newspaper had said numerous reports found Ford opposing the antiwar letter to President 'George W. Bush' (qv) in December 2002 from the celebrity group Artists United to Win Without War. However, speaking through his manager 'Patricia McQueeney' (qv), Ford responded his feelings are \"exactly the opposite\" of what had been reported. She told the Daily 'News' (qv) that Ford was \"appalled by the idea\" that anyone would think he supports a war with Iraq. \"What I'm for is a regime change on both sides,\" Ford told the Daily 'News' (qv) through McQueeney.", "Because of his _Blade Runner (1982)_ (qv) popularity, he became a product spokesperson for Japanese electronics in the 1980s.", "He sits on the Board of Directors for Conservation International.", "At one point, he was Hollywood's highest-paid actor.", "His paternal grandfather, John Fitzgerald Ford, was of Irish Catholic ancestry, and his paternal grandmother, Florence Veronica Niehaus, was of both German and Irish descent. Harrison's maternal grandparents, Harry Nidelman and Nachama (Annie) Lifshitz, were Jewish emigrants, from Minsk, now in Belarus, then part of the Russian Empire. When asked what religion he was raised in, Harrison has jokingly replied \"Democrat\", since he has never been observant of any particular religion.", "His mother Dorothy Ford died of lung cancer on February 10, 2004 at age 86.", "He joined a talent agency for the first time in his career in 1999, following the box office failure of _Random Hearts (1999)_ (qv).", "A Democrat, he was an opponent of the Iraq war and is very active in environmental issues. However, he prefers not to discuss his politics openly, as BBC interviewer 'Jonathan Ross' (qv) discovered during a conversation about _The Mosquito Coast (1986)_ (qv) for _Hollywood Greats (1977)_ (qv) in 2006.", "He cited as America's Favorite Movie Star in Harris Polls conducted over three consecutive years, from 1998-2000.", "Danish pop duo \"Souvenirs\" named a song after the actor. The track \"'Harrison Ford' (qv)\" is on the CD \"Villa Danmark\" from 1998.", "He has named 'Gregory Peck' (qv) and 'Gary Cooper' (qv) as his favorite actors. Two of his favorite movies are the anti-McCarthyism western _High Noon (1952)_ (qv), for which Cooper won his second Oscar, and the civil rights drama _To Kill a Mockingbird (1962)_ (qv), for which Peck won his only Oscar.", "Neither of his two most famous roles (Han Solo and Indiana Jones) were offered to him first. 'Tom Selleck' (qv) was the first choice to play Indiana Jones but there were issues with his contract with Magnum P.I.and 'Christopher Walken' (qv) was the first choice to play Han Solo. Han Solo was also turned down by 'Al Pacino' (qv).", "As of May 2007, the combined domestic box office grosses of his films total approximately $3.10 billion, with worldwide grosses approaching the $6 billion mark, making Ford the number 3 all time domestic box-office star behind 'Eddie Murphy' (qv) and 'Tom Hanks' (qv).", "In assembling the 2007 \"Final Cut\" version of _Blade Runner (1982)_ (qv), the scene in which Deckard is speaking with the snake dealer, Abdul Ben Hassan, was digitally altered so that Ford's lip movements matched the altered dialog. Since he was unavailable due to scheduling issues, his son 'Ben Ford' (qv), being about the same age as his father had been when filming the movie, was shot on an effects stage after being made up with his father's chin scar.", "He owns an Aviat Husky.", "He was named Star of the Year by the National Association of Theatre Owners (1994).", "During his carpentry days, he also remodeled the bathroom of 'Judy Evans' (qv), a costume designer, who later did the costumes for sitcoms such as _Soap (1977)_ (qv), _Benson (1979)_ (qv), _The Golden Girls (1985)_ (qv), and the dramatic series _Beauty and the Beast (1987)_ (qv).", "He was very close with and greatly admired 'River Phoenix' (qv).", "On 6 October 2006, he was awarded the Jules Verne Spirit of Nature Award for his work in nature and wildlife preservation. The ceremony took place at the historic Shrine Auditorium in Los Angeles, California.", "He was close friends and golf partners with former President 'Bill Clinton' (qv).", "He attended high school with 'Hillary Clinton' (qv) and 'Karen Black' (qv) (Maine East High School in Park Ridge, Illinois).", "One of his heroes is 'George Lucas' (qv), with whom he worked on _American Graffiti (1973)_ (qv), _Star Wars: Episode IV - A New Hope (1977)_ (qv) and the Indiana Jones films.", "He adopted fiancee 'Calista Flockhart' (qv)'s son 'Liam Flockhart' (qv).", "He has three grandchildren: Eliel (Willard's son) was born in 1993, Guiliana (Willard's daughter) was born in 1997 and Ethan (Ben's son) was born in 2000.", "In _Indiana Jones and the Last Crusade (1989)_ (qv), Harrison's character refers to a philosophy class taught down the hall by a Dr. Tyree. In real life, Dr. Tyree was Ford's college mentor as a philosophy major at Ripon College.", "He starred in five consecutive films (beginning with _Apocalypse Now (1979)_ (qv) and ending with _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv)) that are on the IMDb Top 250 list. He has eight films on the list overall, tying for second place with 'Robert De Niro' (qv). 'James Stewart' (qv) has the most with nine.", "He has played three characters named \"Jack\" in four films: _Working Girl (1988)_ (qv), _Patriot Games (1992)_ (qv), _Clear and Present Danger (1994)_ (qv) and _Firewall (2006)_ (qv).", "He became engaged to 'Calista Flockhart' (qv) after reportedly asking her to marry him during Valentine's Day weekend of 2009, after the couple had known each other for eight years.", "He was identified in \"Family Guy: Blue Harvest\", a Star Wars spoof, as the only actor not to have his career destroyed by featuring in _Star Wars: Episode IV - A New Hope (1977)_ (qv).", "He and his first wife, Mary Marquardt, had two children: 'Ben Ford' (qv) (Benjamin Ford) (b. September 22, 1967) and Willard Ford (b. May 14, 1969).", "He and his second wife, 'Melissa Mathison' (qv), had two children: 'Malcolm Ford' (qv) (Malcolm Carswell Ford) (b. October 3, 1987) and 'Georgia Ford' (qv) (b. June 30, 1991).", "He was offered the role of Garrett Breedlove in _Terms of Endearment (1983)_ (qv), which he turned down due to the age difference between himself and 'Shirley MacLaine' (qv). 'Jack Nicholson' (qv) was cast instead and went on to win a Best Supporting Actor Oscar for his performance.", "He had no formal training as a carpenter. He borrowed books on carpentry from the library, studied them and then practiced in an empty house before he got good enough at this that this became his primary job before becoming a major Hollywood actor. He found he enjoyed carpentry so much that he kept this as a hobby.", "He is mentioned in the song \"One Week\" by 'Barenaked Ladies' (qv).", "He lives in Los Angeles, California and Jackson, Wyoming.", "Of the famous \"friendship circle\" of 'Steven Spielberg' (qv), 'George Lucas' (qv) and 'Francis Ford Coppola' (qv), he is the only actor to have worked with all three.", "Ford and 'Calista Flockhart' (qv)'s Santa Fe wedding was presided over by New Mexico's governor 'Bill Richardson' (qv). The modest ceremony was attended by Richardson, his wife Barbara and the newlyweds' adopted son 'Liam Flockhart' (qv).The Couples Daughter Heather Lyn Ford born in 2002.", "He has appeared on the cover of GQ magazine five times: April 1982, November 1986, June 1994, November 1998 (with 'George Clooney' (qv) and 'Chris Rock' (qv)) and March 2000 (with 'Tom Cruise' (qv)).", "He stars in four of the American Film Institute's 100 Most Heart-Pounding Movies: _Raiders of the Lost Ark (1981)_ (qv) at #10, _Star Wars: Episode IV - A New Hope (1977)_ (qv) at #27, _The Fugitive (1993)_ (qv) at #33 and _Blade Runner (1982)_ (qv) at #74.", "He tested for the role of Joe Buck in _Midnight Cowboy (1969)_ (qv). However, the then-unknown actor was turned down for the role. 'Jon Voight' (qv) was eventually offered the role.", "He first worked with 'George Lucas' (qv) on _American Graffiti (1973)_ (qv). This actually almost cost him his iconic roles of Han Solo and Indiana Jones. Lucas originally decided he would not used any of the cast of American Graffiti on _Star Wars: Episode IV - A New Hope (1977)_ (qv), but changed his mind after asking to Harrison to read for an audition, just so he would have the same number of actors reading for Han as were reading for Luke and Leia. He was later 'Steven Spielberg' (qv)'s first choice for the role of Indiana Jones, but Lucas initially resisted, saying that, having made two films with him already, he did not want Ford to \"become my 'Robert De Niro' (qv)\", referring to 'Martin Scorsese' (qv)'s use of him in several films.", "He has starred in a film that has grossed at least 100 million dollars at the U.S. box office for five consecutive decades.", "His portrayal of Branch Rickey in _42 (2013)_ (qv) marked Ford's first film role in which he played a real-life character. But he was considered for Oskar Schindler's role in _Schindler's List (1993)_ (qv), turned down Jim Garrison's role in _JFK (1991)_ (qv) and was rumored to play V.P. Andrew Johnson in _Lincoln (2012)_ (qv).", "He broke his ankle on the set of _Star Wars: Episode VII - The Force Awakens (2015)_ (qv) when a door collapsed. Health and Safety were called upon to investigate.", "He was a Boy Scout earning the rank of Life Scout. He also served as a member and counselor at the Camp Napowan in central Wisconsin. While he was there, he taught the Reptile and Amphibian Study merit badge.", "As of 2018, has appeared in eight films that were nominated for the Best Picture Oscar: _American Graffiti (1973)_ (qv), _The Conversation (1974)_ (qv), _Star Wars: Episode IV - A New Hope (1977)_ (qv), _Apocalypse Now (1979)_ (qv), _Raiders of the Lost Ark (1981)_ (qv), _Witness (1985)_ (qv), _Working Girl (1988)_ (qv) and _The Fugitive (1993)_ (qv). Despite still acting, he has not appeared in one since 1993.", "He was made a lifetime member of the Shropshire Aero Club in England.", "He played Jack Ryan in both _Patriot Games (1992)_ (qv) and _Clear and Present Danger (1994)_ (qv), making him the only actor to play the role in more than one film. 'Alec Baldwin' (qv) played him in _The Hunt for Red October (1990)_ (qv), 'Ben Affleck' (qv) played him in _The Sum of All Fears (2002)_ (qv) and 'Chris Pine' (qv) played him in _Jack Ryan: Shadow Recruit (2014)_ (qv).", "He has played five characters in more than one film: Han Solo in _Star Wars: Episode IV - A New Hope (1977)_ (qv), _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv) and _Star Wars: Episode VII - The Force Awakens (2015)_ (qv), Indiana Jones in _Raiders of the Lost Ark (1981)_ (qv), _Indiana Jones and the Temple of Doom (1984)_ (qv), _Indiana Jones and the Last Crusade (1989)_ (qv) and _Indiana Jones and the Kingdom of the Crystal Skull (2008)_ (qv), Bob Falfa in _American Graffiti (1973)_ (qv) and _More American Graffiti (1979)_ (qv), Jack Ryan in _Patriot Games (1992)_ (qv) and _Clear and Present Danger (1994)_ (qv) and Rick Deckard in _Blade Runner (1982)_ (qv) and _Blade Runner 2049 (2017)_ (qv).", "As of 2016, he has appeared in three films with the \"Force\" as part of its title along with a number: _Force 10 from Navarone (1978)_ (qv), _Air Force One (1997)_ (qv) and _Star Wars: Episode VII - The Force Awakens (2015)_ (qv).", "As of 2015, after the release of Star Wars Episode VII: The Force Awakens, he has starred in five of the top thirty grossing movies of all time. Adjusted for inflation, he is the highest grossing US domestic box office star in history.", "He has appeared in seven films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _American Graffiti (1973)_ (qv), _The Conversation (1974)_ (qv), _Star Wars: Episode IV - A New Hope (1977)_ (qv), _Apocalypse Now (1979)_ (qv), _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), _Raiders of the Lost Ark (1981)_ (qv) and _Blade Runner (1982)_ (qv).", "He appeared in four films with 'Michael Sheard' (qv): _Force 10 from Navarone (1978)_ (qv), _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), _Raiders of the Lost Ark (1981)_ (qv) and _Indiana Jones and the Last Crusade (1989)_ (qv).", "He became the highest grossing actor of all time with the combined gross of _Star Wars: Episode VII - The Force Awakens (2015)_ (qv) including forty one of his previous films, totaling $4.7 billion.", "Has never appeared in a Best Picture Oscar winner."], "quotes": ["It's a little-known fact, but I wanted Han Solo to die at the end of _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv). I thought it would give more weight and resonance. But 'George Lucas' (qv) wasn't sympathetic. He didn't want me killed by those teddy bear guys.", "[to theater owners in Las Vegas] I'll make you a deal. I'll try to keep making films that put people in your theatre seats and you try to keep their shoes from sticking to the floor.", "[on being a leading man] I'm like a fireman. When I go out on a call, I want to put out a big fire, I don't want to put out a fire in a dumpster.", "I used to shake my head, as in \"No, I just look like him.\" But that's not fair. So I said to those little old ladies at Trenton Airport, \"Yes, I am 'Harrison Ford' (qv).\" And they still didn't believe it was me.", "[on playing Indiana Jones again in _Indiana Jones and the Kingdom of the Crystal Skull (2008)_ (qv)] No one wants to see a hero have to pick up his cane to hit someone, but I'm still quite fit enough to fake it.", "[on his marriage to 'Melissa Mathison' (qv)] It was just part of the continuum of the relationship... I don't know if I ever proposed to her.", "I don't do stunts - I do running, jumping and falling down. After 25 years, I know exactly what I'm doing.", "I don't think I've mastered anything. I'm still wrestling with the same frustrations, the same issues, the same problems as I always did. That's what life is like.", "[when asked, \"If heaven exists, what would you want God to say to you at the pearly gates\"?] You're a lot better looking in person.", "You know you are getting old when all the names in your black book have \"MD\" [Mother Dearest] after them.", "I think I did have a reputation for being grumpy. I don't think I'm grumpy. I have opinions. I have an independent vision. I am a purposeful person. But on a daily basis, I think I'm other than grumpy. I think it is a case where I am coming to do business and not there just to be flattered and cajoled and used.", "The loss of anonymity is something that nobody can prepare you for. When it happened, I recognized that I'd lost one of the most valuable things in life. To this day, I'm not all that happy about it.", "[1997, after the Star Wars trilogy was reissued, explaining his disinterest in repeating the role of Han Solo] Once a film is finished, it's over for me. I'm on to something else.", "[acknowledging that 'George Lucas' (qv) and 'Steven Spielberg' (qv) originally wanted another actor to play Indiana Jones] My playing Indy was mentioned to me about only six weeks before shooting started, but being second choice wasn't at all offensive. I would always assume that it would be normal for a director - once having worked with an actor in a particular part - not to think of him for something else. I'd presume that he'd want to accentuate the difference between the two characters by having another actor. I was more than happy when they did ask me to play Indiana Jones, because it promised to be a terrific role in a great film.", "[on the early days of his career] I started by chasing a Folger's commercial. But I just somehow couldn't manage to say, \"Honey, that's a great cup of coffee.\".", "[on what made him choose acting as a profession] Failure in all other fields.", "[People magazine, 6/23/03] There have been times in my life when I have felt I was lonely, but I don't think you want to live your life in order to mitigate against loneliness.", "[asked if he would ever play Indiana Jones again] In a New York minute.", "[asked if he would ever play Han Solo again] No, because I have outgrown that character.", "[after his first screen test] The studio guy told me, \"Kid, you have no future in this business.\" I said, \"Why?\" He said, \"When 'Tony Curtis' (qv) first walked onscreen carrying a bag of groceries -- a bag of groceries! -- you took one look at him and said, 'THAT'S a movie star!'\" I said, \"Weren't you supposed to say, 'That's a grocery delivery boy?'\".", "I had no expectation of the level of adulation that would come my way. I just wanted to make a living with a regular role in a television series.", "[on how Indiana Jones and Han Solo differed] Different clothes, different character. That's how I feel about it.", "[on _Blade Runner (1982)_ (qv)] It could have been so much more than a cult movie.", "Starring in a science-fiction film doesn't mean you have to act science fiction.", "Whoever had the bright idea of putting Indiana Jones in a leather jacket and a fedora in the jungle ought to be dragged into the street and shot.", "[on the appeal of Indiana Jones] Indiana Jones is always getting in way over his head and just barely getting out by the skin of his teeth.", "[asked if he believes in \"The Force\"] I think The Force is in you. Force yourself.", "[on 'George Lucas' (qv)] I think George likes people. I think George is a kind, warm-hearted person, but he can be a little impatient with the nature of acting, the need to work 'til you find something. He's like \"It's right there, it's right there, I wrote it, it's there, just do it.\" But you can't just do it that easily.", "I am not the first man who wanted to make changes in his life at 60 and I won't be the last. It is just that others can do it with anonymity. I was interested in changing my life. I have always had the ability to change and become other people through my acting. I took a good look at myself and decided I wanted something different from the way I was living. That's not such a bad thing, is it? But, because of my past, I think it took a lot of people by surprise. They wondered what was happening to me. I was very much aware of what was happening. I'm living the way I want to live.", "I think American films right now are suffering from an excess of scale. Lots of movies we're seeing now are more akin to video games than stories about human life and relationships. Twelve- to 20-year-olds are maybe the largest economic force in the US movie business. I'm not a very nostalgic person - but I enjoy a good story.", "I'm very troubled by the proliferation of arms, at the fact so many people in the United States carry guns. It obviously contributes greatly to the crime problems we have. I'm sure gun laws should be strengthened in the United States. I just don't know the correct mechanism.", "I'm very disturbed about the direction American foreign policy is going. I think something needs to be done to help alleviate the conditions which have created a disenfranchised and angry faction in the Middle East. I don't think military intervention is the correct solution. I regret what we as a country have done so far.", "What does that mean [when a director says] \"Trust me\"? Does that mean I should obviate all of my experience? Should I replace a certain knowledge with belief? Where does that get you? I have had experience in my life. I am 63 years old. Why should I be trusting a director?", "My approach to acting is the \"let's pretend\" school of acting. If real emotion is available, use it, otherwise I follow what I think is an AA rule: \"Fake it 'til you make it\". Emotions are an interesting language. Sometime they sneak up on you when you're not expecting, when you are available to it.", "[on _Star Wars: Episode IV - A New Hope (1977)_ (qv)] I understood the impact of those movies because I had young children who watched them religiously. I saw the Star Wars films so often in my house that I ended up knowing all of the other actors' lines.", "I am a kinder, gentler 'Harrison Ford' (qv) than I once was.", "It's very little trouble for me to accommodate my fans, unless I'm actually taking a pee at the time.", "Before, I was grateful for a job, almost any job. Now, I'm apprehensive but I know I have other options, and when I ask for the money, they pay it. It's that simple.", "I saw a bit of director 'Stephen Gaghan' (qv)'s movie _Syriana (2005)_ (qv), and I wish I'd played the part that was offered to me - ['George Clooney' (qv)]'s part. I didn't feel strongly enough about the truth of the material and I think I made a mistake. I think the film underwent some changes, and I think a lot of it is very truthful: the things that I thought weren't, were obviated after I left the table.", "I had a very strong feeling about the Vietnam War, and I had a strong feeling about participating in it. The military draft was in place, I was summoned for a physical exam, and I was either going to be classified as fit for military service or make my objection to it. So I made my objection to it.", "I grew up in the Midwest. You don't ask what a person's religion is, you don't ask what their politics are, you don't ask how much money they make and I pretty much still have that attitude about it. It's none of anybody's business and I don't advantage anyone by telling them what my personal politics are. The arguments are much too subtle to be entered in that way, to my mind. There are things that I think are happening in the world that are egregious mistakes but I'm only operating out of my own box and I don't have any expertise. I'm a voter... I have one vote, that's all I should have.", "I don't want to be a movie star. I want to be in movies that are stars.", "[1979, on Han Solo] He's not a cardboard character to me at all. He's as real as anything else. I never thought of the character as having only two dimensions until the critics said so. And they're wrong. The third dimension is me.", "Identification solely with _Star Wars: Episode IV - A New Hope (1977)_ (qv) could have been the beginning and the end, with no middle, to my career.", "[on registering as a conscientious objector during the Vietnam War] I confused them so badly that they never took action on my petition. My conscientious objection wasn't based on a history of religious affiliation, which made it difficult at the time. I went back to my philosophy training from college. I remembered Paul Tillich's phrase, \"If you have trouble with the word God, take whatever is central or most meaningful to your life and call that God.\" I always had trouble with the notion of God in a stand-up form. So I developed a thesis and took the Biblical injunction to love thy neighbor as thyself as the central and most meaningful thing in my life. I combined it all and typed for days and sent it off and never heard a word. Never got called in.", "[on _Inside the Actors Studio (1994)_ (qv)] As a man I've always felt Irish, as an actor I've always felt Jewish.", "Los Angeles is where you have to be if you want to be an actor. You have no choice. You go there or New York. I flipped a coin about it. It came up New York, so I flipped again. When you're starting out to be an actor, who wants to go where it's cold and miserable and be poor there?", "If people recognize me when I'm out in public, I'm very nice to them. I'm very nice to people even when they don't recognize me. I don't even mind if people come up to me while I'm eating dinner, but if they recognize me while I'm having sex, I refuse to sign autographs.", "I'm old enough to play my own father in this one. Sean's only twelve years older than I am. In _Indiana Jones and the Last Crusade (1989)_ (qv) I had to play so much younger than I am in order to make it work for him. It was really a strain.", "[on _The Mosquito Coast (1986)_ (qv)] That's a movie I like very much. It gave me an opportunity to turn people's perception of me on its head.", "[on fatherhood]: My first child was born when I was 25. Babies raising babies is not a pretty sight. I'm much better at it now.", "[on 'George Lucas' (qv)] A fountain from which my career sprang, more or less.", "[on acting] - I love it. I don't feel as useful any place as I do on a movie set. I'm very surprised and delighted at the luck I've had. I've been enormously lucky. I've had a long run. And now I have a chance to play old guys.", "[on what he looks for in a film] I look for those things that I can have an emotional investment in. I disadvantage myself by thinking, \"Oh, this is what I'm looking for, this is what I like.\" I don't know what I like. I like what I like... being an assistant storyteller, helping create characters that bring a story dramatic shape and dimension.", "I make a character out of those things that allow him to tell the story. I'm not an actor who will say, \"Well, my character would never do that.\" If the story requires it, then I'll find a way of accommodating that in character. For me, it's not about performance. It's about storytelling. Once I get a clear idea of what I want to accomplish, then acting is just dressing up and playing.", "[on 'Steven Spielberg' (qv)] It's hard to say why someone is successful or not successful, but Steven has all of the mental capacities and the film chops to make successful movies. I think he understands human emotion very well and he understands dramatic construction and he understands cinema. And if he chooses to do a popular film, it will likely be very successful. If he chooses to do something with a different kind of ambition, then Steven is secure enough I think to let the chips fall where they may.", "[on _Sabrina (1995)_ (qv)] Somehow 'Sydney Pollack' (qv) and I talked ourselves into working on that. Sydney's gone now. I miss him. We both lived long enough to regret it. There is no reason to do something that's already been done. But happily we launched the careers of 'Greg Kinnear' (qv) and 'Julia Ormond' (qv), who is wonderful in the movie. She's gone on to have a good career. It was a noble effort, a bizarre adventure for both of us.", "[on acting and accessing emotions] You have to be willing to *live* in front of people. Live in front of people. Let them see the good, the bad, the ugly, the weak, the strong, the conflicted, the terrible... One of the things about acting that gives me the greatest satisfaction is the opportunity for that emotional exercise. That investment to the point where it produces true emotion.", "[in 2010, on acting in film] I'm in it for the money. And I mean that in the nicest possible way. This is my job. Acting is my craft, I've spent my whole life working on it and I want to get paid well to do it, because otherwise I'm being irresponsible, not valuing what I do for a living. When I came into this business I didn't even know the names of the movie studios - I was under contract to a studio for $150 a week. One thing I learned is that the studios had no respect for a person who was willing to work for them for that amount. So I realized that the value I put on my own work was the value and respect I would get back.", "[in 2010, on fame] There's nothing good about being famous. You always think, 'If I'm successful, then I'll have opportunities.' You never figure the cost of fame will be a total loss of privacy. That's incalculable. What a burden that is for anybody. It was unanticipated and I've never enjoyed it. You can get the table you want in a restaurant. It gets you doctor's appointments. But what's that worth? Nothing. The real coin of the realm is freedom - to make choices, do the projects that you want to do and have some control over the stories and the way a film is released and sold.", "[in 2010] I'm so passionate about flying I often fly up the coast for a cheeseburger. Flying is like good music: it elevates the spirit and it's an exhilarating freedom. It's not a thrill thing or an adrenaline rush; it's engaging in a process that takes focus and commitment. I love the machines, I love the aviation community. I used to own airplanes and have pilots flying them for me, but I finally realized they were having more fun than I was. They were getting to play with my toys. I was 52 when I started flying - I'd been an actor for 25 years and I wanted to learn something new. Acting was my only identity. Learning to fly was a lot of work, but the net result was a sense of freedom and a pleasure in seeing to the safety of myself and the people who fly with me. All of my planes are great to fly, and that's why I've got so many of them. I have a Citation Sovereign, a long-range jet; a Grand Caravan, a turboprop aircraft capable of operating on unimproved strips; and a De Havilland, a bush plane. I have a 1929 Waco Taperwing open-top biplane; a 1942 PT-22 open-top monoplane trainer; an Aviat Husky, a two-seat fabric-covered bush plane; and a Bell 407 helicopter. I also have more than my fair share of motorbikes - eight or nine. I have four or five BMWs, a couple of Harleys, a couple of Hondas and a Triumph; plus I have sports touring bikes. I'm a single rider, and I love being out in the air. I like the focus that comes when you're riding - you really have to be very keyed into what you're doing. I ride up into the mountains in LA on twisty little canyon roads on Sunday mornings with a group of other enthusiasts.", "[in 2010] There's nothing better than seeing a herd of elk right outside the window of my house in Wyoming. My land gives me an opportunity to be close to nature, and I find spiritual solace in nature, contemplating our species in the context of the natural world. The property is much the same as it was 150 years ago. It's in the mountains and had never been developed when I bought it. Apart from the home and outbuildings, I've kept it pretty much in that state. I know that the property will be there for as long as I live and well after that in the hands of my children.", "When I started my career, I thought I would be a character actor. I never thought I had a chance at leading man roles. I thought that was for good-looking guys with talent.", "I used to think how great it would be to make a living as an actor, to not have to do something else. But I never thought I'd get to do the breadth of movies I got to do. I was thinking, 'maybe I'll get some parts in television shows.'", "[2013] At this point, I'm not thinking I can play the leading man in many of the popular films we see today.", "I knew there was a difference in how the business saw leading men and character actors, though I never really thought there was a difference. Still, I don't think people knew what to make of me. It wasn't until _Witness (1985)_ (qv) that people started considering me a leading man.", "[on _Raiders of the Lost Ark (1981)_ (qv)] When I read the script I thought, \"Man, this is the best thing I've seen - ever.\"", "[on _Ender's Game (2013)_ (qv)] None of Mr Card's ['Orson Scott Card' (qv)] concerns regarding the issue of gay marriage are part of the thematics of this film... I think his views outside of those that we deal with in this film are not an issue for me to deal with. I have really no opinion on that issue. I am aware of his statements admitting that the question of gay marriage is a battle that he lost. He admits that he lost it. I think we all know that we've all won, that humanity has won, and I think that's the end of the story.", "For a variety of reasons - which are more entertainingly conveyed in the film [_Ender's Game (2013)_ (qv)] than I can describe here - young people are very appropriate for the kind of warfare being practiced in the future. They have to be transformed from children into warriors.", "[on the 1985 novel \"Ender's Game\"] It's a really interesting book. It's required reading in some of the military academies here in the United States because of some of the things it says about military responsibility, command responsibility, aspects of leadership. And it was incredibly prescient. Some of the things it talks about, predicted about future war, are absolutely happening right before our eyes. We haven't had an alien invasion, but we have evolved the capacity to practice warfare at a distance.", "[lamenting earlier times in his career] People still went to movies in those days. People went to movie theaters. It was a community experience, and that was part of the fun. Now people see a movie on their iPad, alone, with interruptions for snacks.", "I'm not crazy about interviews. But I don't hate them. I have an aversion to celebrity. I have an argument with the place that celebrity has in this country and in this culture. There's just too much celebrity babble out there... I'm in a service occupation. It's like being a waiter or a gas station attendant. The guy in the restaurant is waiting on six people. I'm waiting on six million.", "[on his pierced left ear] I don't think in and of themselves earrings are sexy. If I did, I'd have six of them.", "[on _Witness (1985)_ (qv)] Making the movie was a wonderful experience, fast and fluid - great fun. 'John Seale' (qv), the brilliant cinematographer, also made an enormous contribution to the film. We were blessed with so many talented people working together, but it's a 'Peter Weir' (qv) film through and through.", "[2010 interview, on _Working Girl (1988)_ (qv)] I haven't seen it for a long time but I assume it's a good movie. It sure was fun to make.", "[after 'Donald Trump' (qv) announced that he admired the way Ford stood up for America in _Air Force One (1997)_ (qv)] Donald, it was a movie! In real life it's not actually like that.", "[on never winning an Oscar] I think I'll be alright.", "I find it impossible to compare directors to each other. With each of them that I've had the opportunity to work with, it was made in the context of a piece of material which makes each experience unique.", "[on _The Fugitive (1993)_ (qv)] As sometimes happens, we started without a complete script. We were still working on the script while we were shooting. We were to some extent making it up as we went along. The work experience to me was very gratifying because no matter what the difficult conditions were, I felt we overcame them, usually at the last moment. It's often the most difficult circumstances that produce some of the best movies.", "[on 'Carrie Fisher' (qv)] Carrie was one-of-a-kind...brilliant, original. Funny and emotionally fearless. She lived her life bravely.", "'May the Force be with you' is charming, but it's not important. What's important is that you become the Force - for yourself and perhaps for other people.", "I was just glad to be involved in it, I mean obviously Star Wars [_Star Wars: Episode IV - A New Hope (1977)_ (qv)] has been very, very good to me. It gave me a career that I have enjoyed and all the opportunities that have proceeded from that attachment to Star Wars [_Star Wars: Episode IV - A New Hope (1977)_ (qv)], so when George ['George Lucas' (qv)] called and asked if I might be interested in coming back, I said, 'Yes, why not?''", "There is science fiction I've read that I really enjoyed, but I can't say I was a fan of the genre. I don't think of Star Wars [_Star Wars: Episode IV - A New Hope (1977)_ (qv)] as science fiction, really. What I understood about it was from the context of the characters, that I was one of a kind of fairy tale setting. You had a wise old warrior in 'Alec Guinness' (qv) (as Obi-Wan Kenobi), you had the callow youth in 'Mark Hamill' (qv) (Luke Skywalker) and the beautiful princess, 'Carrie Fisher' (qv) (Princess Leia), and the smart ass.", "[Who shot first?] Who cares?"], "salary history": ["_Dead Heat on a Merry-Go-Round (1966)_ (qv)::$150", "_Luv (1967)_ (qv)::$150 /week", "_A Time for Killing (1967)_ (qv)::$150 /week", "_American Graffiti (1973)_ (qv)::$500 /week", "_Star Wars (1977)_ (qv)::$1,000 /per week", "_Star Wars: Episode VI - Return of the Jedi (1983)_ (qv)::$500,000", "_Witness (1985)_ (qv)::$4,000,000", "_The Mosquito Coast (1986)_ (qv)::$5,000,000", "_Presumed Innocent (1990)_ (qv)::$12,500,000", "_Patriot Games (1992)_ (qv)::$9,000,000", "_Clear and Present Danger (1994)_ (qv)::$10,000,000", "_The Devil's Own (1997)_ (qv)::$20,000,000", "_Air Force One (1997)_ (qv)::$22,000,000", "_Six Days Seven Nights (1998)_ (qv)::$20,000,000", "_Random Hearts (1999)_ (qv)::$20,000,000", "_What Lies Beneath (2000)_ (qv)::$20,000,000", "_K-19: The Widowmaker (2002)_ (qv)::$25,000,000 + 20% of the Gross", "_Firewall (2006)_ (qv)::$15,000,000", "_Star Wars: Episode VII - The Force Awakens (2015)_ (qv)::$25,000,000 + 0.5% of gross"], "birth date": "1942-07-13", "birth notes": "Chicago, Illinois, USA", "_actorID": "10", "_source": "IMDB", "actorID": "0000148", "created_utc_dt": "08/26/2019, 21:53:52"}