{"headshot": "https://m.media-amazon.com/images/M/MV5BNDMxNDM3MzY5N15BMl5BanBnXkFtZTcwMjkzOTY4MQ@@._V1_UY98_CR5,0,67,98_AL_.jpg", "birth name": "Donald Frank Cheadle", "height": "5' 7¾\" (1.72 m)", "mini biography": ["Donald Frank Cheadle was born in Kansas City, Missouri on November 29, 1964. His childhood found him moving from city to city with his family: mother Bettye (North), a teacher, father Donald Frank Cheadle, Sr., a clinical psychologist, sister Dawn, and brother Colin. After graduating high school in Denver, Colorado, Cheadle attended and graduated from the California Institute of the Arts with a Bachelor¹s Degree in Fine Arts. Encouraged by his college friends, he attended a variety of auditions and landed a recurring role on the hit series _Fame (1982)_ (qv), which led to feature film roles in 'Dennis Hopper' (qv)'s _Colors (1988)_ (qv) and 'John Irvin' (qv)'s _Hamburger Hill (1987)_ (qv).Early in his career, Cheadle was named Best Supporting Actor by the Los Angeles Film Critics for his breakout performance opposite 'Denzel Washington' (qv) in _Devil in a Blue Dress (1995)_ (qv). His subsequent film credits include: _Traitor (2008)_ (qv), an international thriller which he produced, starring opposite 'Guy Pearce' (qv); 'Kasi Lemmons' (qv)'s _Talk to Me (2007)_ (qv), with 'Chiwetel Ejiofor' (qv); the 2006 Oscar-winning Best Picture, _Crash (2004)_ (qv), which Cheadle also produced; _Hotel Rwanda (2004)_ (qv), for which his performance garnered Oscar, Golden Globe, Broadcast Film Critics and Screen Actors Guild award nominations for Best Actor; 'Steven Soderbergh' (qv)'s _Ocean's Eleven (2001)_ (qv), _Ocean's Twelve (2004)_ (qv) and _Ocean's Thirteen (2007)_ (qv), starring 'Brad Pitt' (qv) and 'George Clooney' (qv); 'Mike Binder' (qv)'s _Reign Over Me (2007)_ (qv) with 'Adam Sandler' (qv); the Academy Award-winning _Traffic (2000)_ (qv) and _Out of Sight (1998)_ (qv), with 'George Clooney' (qv) and 'Jennifer Lopez' (qv), both films also directed by Soderbergh; 'Paul Thomas Anderson' (qv)'s acclaimed _Boogie Nights (1997)_ (qv) with 'Julianne Moore' (qv) and 'Mark Wahlberg' (qv); _Bulworth (1998)_ (qv), directed by and starring 'Warren Beatty' (qv); _Swordfish (2001)_ (qv), with 'John Travolta' (qv) and 'Halle Berry' (qv); _Mission to Mars (2000)_ (qv) with 'Tim Robbins' (qv) and 'Gary Sinise' (qv); 'John Singleton' (qv)'s _Rosewood (1997)_ (qv), for which Cheadle earned an NAACP Image Award nomination; 'Brett Ratner' (qv)'s _The Family Man (2000)_ (qv), starring 'Nicolas Cage' (qv); and the independent features _Manic (2001)_ (qv) and _Things Behind the Sun (2001)_ (qv).Cheadle was honored by the CineVegas Film Festival and the Los Angeles Film Festival and received ShoWest's Male Star of the Year award. He is also well-recognized for his television work, including his portrayal of 'Sammy Davis Jr.' (qv) in HBO's _The Rat Pack (1998)_ (qv), for which he received a Golden Globe Award and a Best Supporting Actor Emmy nomination. That same year, he also received an Emmy nomination for his starring role in HBO's adaptation of the best-selling novel _A Lesson Before Dying (1999)_ (qv), opposite 'Cicely Tyson' (qv) and 'Mekhi Phifer' (qv).He also starred for HBO in 'Eriq La Salle' (qv)'s _Rebound: The Legend of Earl 'The Goat' Manigault (1996)_ (qv). Cheadle's TV series credits include his two-year stint in 'David E. Kelley' (qv)'s acclaimed series _Picket Fences (1992)_ (qv), a guest-starring role on _ER (1994)_ (qv) (earning yet another Emmy nomination) and a regular role on _The Golden Palace (1992)_ (qv) He also starred in the live television broadcast of _Fail Safe (2000)_ (qv) opposite 'George Clooney' (qv), 'James Cromwell' (qv), 'Brian Dennehy' (qv), 'Richard Dreyfuss' (qv) and 'Harvey Keitel' (qv). He also co-executive produced the TV version of _Crash (2008)_ (qv).His most recent big screen appearances have been in 'Antoine Fuqua' (qv)'s ensemble crime thriller _Brooklyn's Finest (2009)_ (qv) and 'Jon Favreau' (qv)'s _Iron Man 2 (2010)_ (qv), another mainstream breakthrough where he played Lt. Col. James 'Rhodey' Rhodes, replacing 'Terrence Howard' (qv) from the first film. _The Guard (2011)_ (qv), an art-house hit directed by 'John Michael McDonagh' (qv) and co-starring 'Brendan Gleeson' (qv), followed.Cheadle stars in _House of Lies (2012)_ (qv) on Showtime. Late in 2012, he was seen in _Flight (2012)_ (qv), 'Robert Zemeckis' (qv)'s return to live-action filmmaking. In 2013, he reprised his role as Rhodey in _Iron Man 3 (2013)_ (qv). Among his projects in development is a movie based on the life of jazz legend 'Miles Davis' (qv).A talented musician who plays saxophone, writes music and sings, he is also an accomplished stage actor and director and was nominated for a Grammy Award in 2004 for Best Spoken Word Album for his narration/dramatization of the 'Walter Mosley' (qv) novel \"Fear Itself\".Other notable off-stage achievements include the 2007 BET Humanitarian Award for the cause of the people of Darfur and Rwanda, and sharing the Summit Peace Award by the Nobel Peace Prize Laureates in Rome with 'George Clooney' (qv) for their work in Darfur.::Anonymous and Matt Dicker"], "trade mark": ["Frequently portrays law enforcement agents or professionals with a troubled social life and/or past."], "trivia": ["Brother of 'Colin Cheadle' (qv) and Cindy Cheadle.", "Lives with 'Bridgid Coulter' (qv), who plays his wife in _Rosewood (1997)_ (qv). [1997]", "Graduated from East High School in Denver, Colorado.", "Appears uncredited in two back-to-back movies, _Rush Hour 2 (2001)_ (qv) and _Ocean's Eleven (2001)_ (qv). He played a criminal in both films.", "Drives a hybrid car, Toyota Prius.", "After acting in _Hotel Rwanda (2004)_ (qv), a film about the early 1990s Rwandan genocide, he became an activist to raise awareness of the mid-2000s genocide in the Darfur region of Sudan. In January 2005, he traveled to Sudan with five members of Congress to see refugee camps and to meet survivors of the genocide. Upon his return, he reported on his trip for ABC 'News' (qv) Nightline (1980).", "Briefly worked as a stand-up comic early in his career.", "He and 'Bridgid Coulter' (qv) have two daughters, Ayana and Imani. (born in 1995 and 1997).", "The son of a child psychologist and teacher.", "Plays the saxophone.", "Sister is a teacher in Washington, D.C. and his brother works in Denver's mayor's office.", "In July 2005, he officially toured the Hotel des Milles Collines in Kigali, Rwanda on which the film _Hotel Rwanda (2004)_ (qv) is based.", "Got his first big break starring as the hotel clerk on the short lived _The Golden Girls (1985)_ (qv) spin-off _The Golden Palace (1992)_ (qv) alongside 'Cheech Marin' (qv).", "_Hotel Rwanda (2004)_ (qv) is ranked #90 on the American Film Institute's 100 Most Inspiring Movies of All Time, the most recent entry on the list.", "Was considered for the role of Huggy Bear in _Starsky & Hutch (2004)_ (qv).", "Appeared in _The Rat Pack (1998)_ (qv) as 'Sammy Davis Jr.' (qv), who along with the other Rat Pack members, appeared in the original _Ocean's 11 (1960)_ (qv). Cheadle then appeared in the remake, _Ocean's Eleven (2001)_ (qv).", "During the making of _Mission to Mars (2000)_ (qv), he asked to sleep overnight on the actual film set so that he could stay in full character.", "Replaced 'Terrence Howard' (qv) in the role of Col. James Rhodes for _Iron Man 2 (2010)_ (qv). Howard, who played Rhodes in _Iron Man (2008)_ (qv), had a falling out with Marvel Studios, because of a salary dispute.", "When he was younger he performed with the Colorado Children's Chorale of Denver, Colorado.", "Appearing in promotional advertisements for the National Football League (USA) and the race to its championship title game, Super Bowl XXXVIII. [January 2004]", "Friends with 'George Clooney' (qv)."], "quotes": ["But I don't think it helps to be thought of as a scene-stealer. That's not comforting for the other actors. They think, 'Well, I don't want to work with him. Go steal from someone else.' So I'm never going into a movie thinking that I want to grab the attention. Quite the opposite: I give that stuff away, because I'm wanting to make the best whole piece. I want to look back at my resume and think, 'That was a great movie,' not, 'Oh, those four movies were shit, but I was good in them.' I want to be a part of great things.", "I've been doing this since I was 10 years old, inhabiting different people and playing different roles. Thirty years later, there's still the same sort of excitement I get from it. It's still fun to inhabit different characters and play different things, so it's all in that panoply of acting.", "I also believe that you are what you have to defend, and if you're a black man that's always going to be the bar against which you are judged, whether you want to align yourself with those themes or not. You can think of yourself as a colourless person, but nobody else is gonna.", "In fifth grade I was Templeton the Rat in a production of 'Charlotte's Web'. I remember I had a friend who worked in a doughnut shop. I'd go in, get a doughnut and sit there with my script, going over the lines and making notes in the margin. I was serious!", "(2008 quote) I'm very critical of myself. I've yet to see a great performance from this kid. No, it's not comfortable; I hate watching myself. You don't like when you hear your voice on your voicemail; imagine having to see yourself 30 feet wide and 30 feet big.", "[on shooting the movie, _The Guard (2011)_ (qv), in Connemara, Ireland] It's like Mars. It's another place. It's vast, it's stark, there's stone walls. People kind of said \"well this is my property line\". Why? \"Well, cause I put a wall there\".", "[when asked by someone if they should be an actor], I'd say don't do it if you could anything else do that and if you can be dissuaded by me saying that you shouldn't be doing this anyway, if you want to really go after it your chances of making it are very very poor if you're a white male between the ages of twenty to forty you got the best shot and after that it falls off the shelf that being said obviously it can be done and many people have done it and you don't have to be good unfortunately and we see that too but you have to be tenacious and have a never say die attitude and with all the technology that's out now you can make a movie for two grand you can put yourself out there and package yourself in the best light you see"], "salary history": ["_Iron Man 2 (2010)_ (qv)::$1,000,000", "_House of Lies (2012)_ (qv)::$150,000 per episode"], "birth date": "1964-11-29", "birth notes": "Kansas City, Missouri, USA", "_actorID": "17", "_source": "IMDB", "actorID": "0000332", "created_utc_dt": "08/26/2019, 21:53:58"}