{"headshot": "https://m.media-amazon.com/images/M/MV5BNTZkYzU0ZGUtZTk1MC00MzJjLWFmMzItY2M0ODY1ZmI2OGQ0XkEyXkFqcGdeQXVyMjI0MjgwNjc@._V1_UY98_CR53,0,67,98_AL_.jpg", "nick names": ["Kahn", "Deacon Batista", "The Animal", "DJ"], "birth name": "David Michael Bautista Jr.", "height": "6' 6\" (1.98 m)", "mini biography": ["David Michael Bautista, Jr. was born on January 18, 1969 in Washington, D.C., to Donna Raye (Mullins) and David Michael Bautista, a hairdresser. His father is Filipino, and his mother has Greek ancestry.When WCW officials told him he'd never make it in sports entertainment, Bautista pushed himself to achieve his dream of being a Superstar. In May 2002, he made his debut on SmackDown using the ring name Batista, but it wasn't until a move to Raw and two victories over Kane that \"The Animal\" began to make noise in the WWE Universe. The wins impressed 'Ric Flair' (qv) and Triple H, who were looking to align themselves with the industry's brightest new stars. After a lengthy search, they identified 'Randy Orton' (qv) and Batista. Collectively the four Superstars became known as Evolution.Batista earned his first championship alongside \"The Nature Boy\" when the duo captured the WWE Tag Team Championships in December 2003. As Evolution dominated WWE, Batista started to emerge from the shadows of Triple H and 'Ric Flair' (qv). By the time Batista won the 2005 Royal Rumble Match, World Heavyweight Champion Triple H viewed him as a serious threat to his title.After a triceps injury at the hands of 'Mark Henry' (qv) forced Batista to relinquish the title in January 2006, he vowed to return. Batista successfully regained the World Heavyweight Championship at Survivor Series in 2006. Four months into his second reign, Batista faced the Undertaker at WrestleMania 23. \"The Animal\" took Undertaker to the limit, but was unable to stop the streak of \"The Deadman\" at WrestleMania. Though disappointed, Batista stayed hungry and always managed to keep himself in the championship hunt for the rest of his career.At Bragging Rights in 2009, Batista shocked the world when he blamed 'Rey Mysterio' (qv) for a loss to Undertaker, then attacked his former tag team partner. \"The Animal\" then became locked in a tense rivalry with another former friend, 'John Cena' (qv), over the WWE Championship. The grueling match at Over the Limit led to a wheelchair-bound Batista declaring \"I quit!\" the following night on Raw before fading from the WWE Universe in May 2010. Following his departure from WWE, Bautista appeared opposite 'Vin Diesel' (qv) in the Universal film _Riddick (2013)_ (qv) and RZA's feature directorial debut _The Man with the Iron Fists (2012)_ (qv), in which he played the villainous Brass Body and starred opposite 'Russell Crowe' (qv) and 'Lucy Liu' (qv). His other film credits include _The Scorpion King 3: Battle for Redemption (2012)_ (qv), where he played Argomael; the action film _House of the Rising Sun (2011)_ (qv); and _Wrong Side of Town (2010)_ (qv) opposite rapper 'Ja Rule' (qv).Two years later, he joined MMA and won his first professional MMA fight. In January 2014, he made his long awaited return to the WWE, before quitting a second time in June of that same year. He did this in order to promote _Guardians of the Galaxy (2014)_ (qv), which was released on August 1, 2014, and starred 'Chris Pratt' (qv), 'Benicio Del Toro' (qv), 'Zoe Saldana' (qv), and 'Djimon Hounsou' (qv), alongside Bautista.He will shoot _Kickboxer: Vengeance (2016)_ (qv), directed by 'John Stockwell' (qv), and co-starring martial artist 'Alain Moussi' (qv) and UFC fighter 'Georges St-Pierre' (qv). The remake of the 1989 'Jean-Claude Van Damme' (qv) film, _Kickboxer (1989)_ (qv) is about two brothers David and Kurt Sloan; When David wins the Karate World Championship, a promoter lures him to Hong Kong, despite his brother's protestations that the man is a crook. When Kurt travels to Thailand to meet his brother, he discovers he has died and seeks his revenge.After starring in films such as, _Guardians of the Galaxy Vol. 2 (2017)_ (qv), _Blade Runner 2049 (2017)_ (qv), _Avengers: Infinity War (2018)_ (qv), _Hotel Artemis (2018)_ (qv), _Escape Plan 2: Hades (2018)_ (qv), and _Final Score (2018)_ (qv), he made a special guest appearance on _WWE SmackDown Live (1999)_ (qv) for it's 1000 episode reuniting with his former Evolution members Triple H, 'Randy Orton' (qv), and 'Ric Flair' (qv) on October 16, 2018. The following year on February 25, 2019, he made his return to _WWE Raw (1993)_ (qv) when he attacked 'Ric Flair' (qv) on his 70th birthday at the end of the episode sending a message to Triple H that would ultimately lead to a No Holds Barred match for _WrestleMania 35 (2019)_ (qv). Batista added the stipulation that if he wins the match, Triple H will have to retire from in-ring competition. As a result, Triple H was finally able to beat Batista for the first time and won the match, which ultimately led to Batista announcing his official retirement from wrestling in the WWE. Following his retirement, he will continue with his career as an actor in Hollywood.His next films scheduled for release will be; _Stuber (2019)_ (qv), _Avengers: Endgame (2019)_ (qv), _Escape Plan: The Extractors (2019)_ (qv), and _My Spy (2020)_ (qv). He is one of many professional wrestlers to make the smooth transition from wrestling into the entertainment world.::Revitalizations@aol.com and jmmeisner@gmail.com"], "spouse": ["Sarah Jade::(7 October 2015 - present) ( separated)", "Angie Lewis::(16 November 1998 - 2006) ( divorced) ( 1 child)", "Glenda Fe Bautista::(25 March 1990 - 1 April 1998) ( divorced) ( 2 children)"], "trade mark": ["Smart dress and general appearance. In a similar style to the Four Horsemen of  the 1980s", "Finishing Move: Batista Bomb", "Finishing move: Batista Bomb/Demon Bomb (Sit-Down Powerbomb)", "Finishing move: Double Leg Spinebuster", "'Trademark' (qv) move: Clothesline", "'Trademark' (qv) move: Running Powerslam", "'Trademark' (qv) move: Spear", "'Trademark' (qv) move: Repeated Turnbuckle Thrusts", "Gravelly voice", "His tattoos", "Towering height and broad frame"], "trivia": ["Started his career in Ohio Valley Wrestling, a WWE developmental territory. He wrestled there in 2000-2002 under the name Leviathan. He was a member of OVW's Disciples of Synn. Won the OVW Heavyweight Championship title in November 2001. A few months later, he joined the WWE. He debuted in WWE as a bodyguard to 'Devon Hughes' (qv) (D-Von Dudley) on the 'SmackDown!' brand. He later moved to 'RAW' and began wrestling with 'Ric Flair' (qv) as his manager.", "Former member of Evolution with Triple H, 'Randy Orton' (qv) and 'Ric Flair' (qv).", "On March 1, 2003 at a WWE live event, Batista & 'Randy Orton' (qv) teamed up to face the Dudley Boyz. This was famous for being a match that nearly no one walked away from unhurt. Batista tore his bicep, Orton broke his leg and Bubba Ray Dudley injured his back. On May 1, 2003, Batista re-tore his right tricep muscle when he fell while running with his wife. Batista returned to the WWE on October 20, 2003 where he attacked Bill Goldberg.", "In December 2003, won the title World Tag Team Champion with 'Ric Flair' (qv) (as Evolution) at _WWE Armageddon (2003)_ (qv). They lost the title to 'Booker Huffman' (qv) (Booker T) and 'Rob Van Dam' (qv) at _WWE Raw (1993)_ (qv) in February 2004, but regained the title next month at Raw. In December 2005, with 'Rey Mysterio' (qv), defeated MNM ('Adam Birch' (qv) and 'John Hennigan' (qv)) for the title of WWE Tag Team Champion at _WWE SmackDown Live (1999)_ (qv). In August 2008, with 'John Cena' (qv), won the title of World Tag Team Champion on Monday Night RAW, defeating 'Ted DiBiase' (qv) & 'Cody Runnels' (qv) (Cody Rhodes) after Batista pinned DiBiase.", "His father is of Filipino descent and his mother has Greek ancestry.", "Is a keen collector of steel lunchboxes.", "Storyline wise was responsible for Stone Cold Steve Austin losing the RAW Co-General Manager post at Survivor Series 2003 (he interfered in the Team Austin v. Team Bischoff match by delivering the Batista Bomb to 'Shawn Michaels' (qv).)", "Is an accomplished break dancer, a skill used in a TV trailer for Summerslam 2004", "Was trained by the legendary 'Wild Samoan' Afa.", "Got into wrestling after meeting Road Warrior Animal & Curt Hennig at a body building show in Minneapolis.", "Grew up in the Washington DC area and often worked as a bouncer at many clubs in the area.", "Went to the WCW Power Plant for a tryout, where they told him he'd never make it in the wrestling business.", "#1 on the PWI top 500 wrestlers list in 2005.", "His sister was named after his mother, Donna Raye Bautista.", "Shares the same birth name as his father, David Michael Bautista.", "Has two daughters by his first wife, Keilani (born in 1990) and Athena (born in 1992). Also has two grandsons, Jacob and Aiden (by Keilani).", "Last name means \"Baptist\".", "The third pro wrestler to go by the nickname or stagename, \"Animal\". The other two were George Steele and Joe Laurinaitis.", "Published author.", "Won _WWE Royal Rumble (2005)_ (qv) and his first World Heavyweight Champonship at _WrestleMania 21 (2005)_ (qv) when he defeated Triple H ('Paul Levesque' (qv)) in the main event. Defended successfully his title at _WWE Backlash (2005)_ (qv) on May 1, 2005. The match was called Batista/Triple H 2. Defeated Triple again at _WWE Vengeance (2005)_ (qv). This marked Triple H's first ever loss in a \"Hell in a Cell\" match. In July, lost to JBL ('John Layfield' (qv) at _The Great American Bash (2005)_ (qv), but retained his title via disqualification. In August, defeated JBL in a \"No Holds Barred\" match at _Summerslam (2005)_ (qv). In January 2006, after suffering a serious tricep injury, was forced to surrender the title, ending his 9 month reign as champion.", "Returns to Smackdown! by attacking 'Mark Henry' (qv), The man who put him on the injury list. [July 2006]", "He was the final draft lottery pick from RAW to go to Smackdown. [June 2005]", "In November 2006, won back World Heavyweight title from 'Booker Huffman' (qv) (King Booker) at _Survivor Series (2006)_ (qv). In April 2007, lost the title to 'Mark Calaway' (qv) (The Undertaker) at _WrestleMania 23 (2007)_ (qv).In September 2007, defeated the 'Dalip Singh' (qv) (The Great Khali) and 'Rey Mysterio' (qv) in a triple threat match at _WWE Unforgiven (2007)_ (qv) to win his third World Heavyweight title. In November, successfully defended his title against The Undertaker in a 'Hell in a Cell' match at _Survivor Series (2007)_ (qv). In December, lost his title to 'Adam Copeland' (qv) (Edge) in a triple threat match against at _WWE Armageddon (2007)_ (qv).In October 2008, won his fourth World Heavyweight title at _WWE Cyber Sunday (2008)_ (qv), defeating 'Chris Jericho' (qv). However, Jericho won his title back in a Steel Cage match at \"RAW\".", "In April 2008, lost to 'Shawn Michaels' (qv) at _WWE Backlash (2008)_ (qv).", "Recouping after scalp stitches sustained from head-on skull butt from Edge on \"Monday Night RAW: 2008 Draft\". Only to compete again with said wrestler at \"Night of Champions\" June 29, 2008. [June 2008]", "In _Spectre (2015)_ (qv), he only has one word of dialogue.", "Teamed up with fellow Evolution members, Triple H and 'Ric Flair' (qv) to attack former Evolution member, 'Randy Orton' (qv) just a few minutes after he defended his World Heavyweight Championship against Chris Benoit 1 day after he won it. [August 2004]", "Has a younger half brother named Michael, from his father's second marriage.", "Won the _WWE Royal Rumble (2014)_ (qv). Lost to 'Bryan Danielson' (qv) (Daniel Bryan) at _WrestleMania XXX (2014)_ (qv) in the WWE World Heavyweight Championship match.", "Is a Registered Democrat.", "Has a Purple belt in Brazilian Jiu-Jitsu from Cesar Gracie, & is trained in Muay Thai, Wushu,& Kickboxing.", "In an interview prior to _Spectre (2015)_ (qv) with IMDb, he stated that his two favorite 007 movies were a tie between _Goldfinger (1964)_ (qv) and _Skyfall (2012)_ (qv).", "Batista tried out at the World Championship Wrestling (WCW) Power Plant, but was told he would never make it in the wrestling business by Sgt. Buddy Lee Parker.", "Worked as a lifeguard before becoming a bodybuilder.", "Admits to having grown up very poor.", "Left his second wife Angie while she was suffering from cancer.", "Although standing at 6' 4\", the Smackdown vs. Raw 2008 video game claims to have him measured at 6' 5\".", "Has a son named Oliver, who was born after the divorce from his second wife."], "quotes": ["I look like a gorilla, just the way I'm built.", "I had been struggling to get roles in Hollywood for three and a half years after leaving the WWE. Then I finally got an agent - the agent I have now. He's a great guy, but he turned me down three times before he even decided to take me on a as a client.", "I don't watch my playbacks because I hate to see myself act.", "It was always one of my favorite things, the action figures, the video games, when I was with WWE, even though I'm not a gamer. I would literally go out and buy the games just so I could play myself.", "People look at me, and they have a certain perception, and they slap a label on me. The guy you saw in a wrestling ring is not who I am.", "I was actually sitting on stage at a press conference one day, and I totally lost touch with reality. I just thought to myself: ''Vin Diesel' (qv) is sitting next to me, and 'Benicio Del Toro' (qv)'s on the other side. This is weird, man.'", "Know your lines; otherwise, have an open mind because you want to get lost in the moment. When you have talented actors and directors to work with, then it's pretty easy to do.", "For some reason, I struggle seeing myself as a leading man.", "I'm a professional wrestler at heart, and I miss it.", "Honestly, I don't aspire to be a huge movie star. I really just fell in love with acting... Everything I do on-screen is very subtle.", "Just getting auditions was rough. But also just learning how to act - when I did my first role, in a film I did which was a favor to a friend, I realized I was really bad at it.", "My first acting lessons were Shakespeare. The first time I ever started working with a coach was doing scenes from 'Measure for Measure,' which were tough dramatic scenes. And then 'Taming of the Shrew,' which required comedic timing. And that's the kind of stuff I love.", "Especially, I don't want to ever be compared to The Rock because I'd be the poor man's version of The Rock. I'm just not him; it's not who I am as a person or as a performer. The Rock's very big and bold, and I'm not.", "You do take a beating in professional wrestling. But I love it.", "For some reason, I'm the guy people love to hate, which I think is weird. People who know me find that very strange, but for some reason, I am. I don't mind being that guy - I have fun with it.", "I internalize everything, keep everything inside. I'm not used to spilling my guts, and when you have to do that on film to make a point, it's hard. It's rough. I don't think it's as easy as people think.", "The worst injury I have ever suffered in the ring was a torn triceps; they had to take a piece of my hamstring to repair the tear. It was brutal; I was out for 6 months.", "I never excelled at one sport or had a very strong passion for anything other than wrestling and bodybuilding.", "It's a weird thing... putting your emotions out there for everybody to see while filming. I think it puts you in a kind of vulnerable state.", "Drax isn't your average stereotypical soldier/warrior/musclehead. He actually has some depth. It was a character that I wanted to play, not only because I love acting so much, but also, I needed to play to get people to actually take me seriously as an actor and get away from the pro wrestling label.", "I'm not a big guy. I'm not a menacing guy. I'm not an intimidating guy. I may look that way, but just spend two seconds talking to me, and you know that's not who I am - not as a person, as a character. It's not who I intend to be.", "I don't want to intimidate people. There's nothing bullyish about me, you know. If there's anybody who's anti-bully, it's me.", "Yes, I am physical but never go looking for fights. I have been in my share of them but never looked for them.", "I was an amateur wrestler, which I loved. It was my passion, but I started really late; I was a junior in high school when I began."], "salary history": ["_WWF SmackDown! (1999)_ (qv)::$1,000,000", "_WrestleMania 23 (2007)_ (qv)::$500,000"], "birth date": "1969-01-18", "birth notes": "Washington, District of Columbia, USA", "_actorID": "49", "_source": "IMDB", "actorID": "1176985", "created_utc_dt": "08/26/2019, 21:54:21"}