{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQxMjUyOTY0Ml5BMl5BanBnXkFtZTcwNjI2MjA2Mw@@._V1_UY98_CR1,0,67,98_AL_.jpg", "nick names": ["Kris", "KStew", "Stew"], "birth name": "Kristen Jaymes Stewart", "height": "5' 5\" (1.65 m)", "mini biography": ["Though most famous for her role as Isabella \"Bella\" Swan in The _Twilight (2008)_ (qv) Saga, 'Kristen Stewart' (qv) has been a working actor since her early years in Los Angeles, California, where she was born. Her parents, 'John Stewart' (qv) and 'Jules Stewart' (qv), both work in film and television. Her mother is Australian. The family includes three boys, her older brother 'Cameron Stewart' (qv) and two adopted brothers Dana and Taylor.After a talent scout caught her grade school performance in a Christmas play at the age of eight, she appeared on television in a few small roles. Her first significant role came when she was cast as Sam Jennings in _The Safety of Objects (2001)_ (qv). Soon after that, she starred alongside 'Jodie Foster' (qv) in the hit drama, _Panic Room (2002)_ (qv) and was nominated for a Young Artist Award.Praised for her Panic Room performance, she went on to join the cast of _Cold Creek Manor (2003)_ (qv) as the daughter of 'Dennis Quaid' (qv) and 'Sharon Stone' (qv). Though the film did not do well at the box office, she received another nomination for a Young Artist Award. After appearing in a handful of movies and a Showtime movie called _Speak (2004)_ (qv), Stewart was cast in the role of a teenage singer living in a commune in 'Sean Penn' (qv)'s _Into the Wild (2007)_ (qv), a critically acclaimed biopic. A third Young Artist Award nomination resulted in a win for this role. She also appeared in 'Mary Stuart Masterson' (qv)'s _The Cake Eaters (2007)_ (qv) that same year.Just 17, Stewart took on the starring role in _Twilight (2008)_ (qv) which was based on a series of the same name written by 'Stephenie Meyer' (qv), the novel already had a huge following and the film opened to fans anxious to see the vampire romance brought to life. Awarded the MTV Movie Award for Best Female Performance, Stewart's turn as Bella continued in the sequels _The Twilight Saga: New Moon (2009)_ (qv) and _The Twilight Saga: Eclipse (2010)_ (qv). The final installments of the series start filming in late 2010.Despite her stratospheric launch into stardom with the Twilight films, she stayed true to her roots by working on a number of indie projects, including _Adventureland (2009)_ (qv) (filmed prior to the Twilight series) and _Welcome to the Rileys (2010)_ (qv). And she took on the daunting task of playing hard rocker 'Joan Jett' (qv) in 'Floria Sigismondi' (qv)'s _The Runaways (2010)_ (qv) alongside 'Dakota Fanning' (qv). Stewart received praise for her acting and musical performances and later won the 2010 BAFTA Rising Star Award and best actress at the Milan International Film Festival for _Welcome to the Rileys (2010)_ (qv).Stewart starred in several other movies filmed between the Twilight Saga installments including the #1 summer box office hit, _Snow White and the Huntsman (2012)_ (qv), and the Cannes selection _On the Road (2012)_ (qv)A few of Stewart's following projects are: Sundance drama _Camp X-Ray (2014)_ (qv), Cannes selection _Clouds of Sils Maria (2014)_ (qv) for which she won a César award, and the Lionsgate distributed action comedy, _American Ultra (2015)_ (qv), starring the _Adventureland (2009)_ (qv) duo.Stewart continues to live in Los Angeles, California.::Anonymous"], "trade mark": ["Often plays characters who are deeply troubled or have suffered an emotional trauma"], "trivia": ["Has an older brother, 'Cameron Stewart' (qv), who works as a grip in television and film, and two adopted brothers named Dana and Taylor. Her parents' home where she grew up is in Woodland Hills area of Los Angeles. Kristen owns homes in Malibu and Los Feliz areas of Los Angeles where she splits her time when she is not on location filming.", "Her father is 'John Stewart' (qv), a television producer who works at Fox-TV and co-produced _On-Air with Ryan Seacrest (2004)_ (qv). Since 2010, he has been working with 'George Lopez' (qv) at _Lopez Tonight (2009)_ (qv) on TBS-TV. Due to his job, he is often present for his daughter's television appearances.", "Born in Los Angeles and then spent some of her early years in Colorado and Pennsylvania before moving back to Los Angeles with her family when she was 8 years old.", "Stewart's favorite song by 'Joan Jett' (qv) is \"Love is Pain\". She portrayed Jett in her film _The Runaways (2010)_ (qv).", "Ranked #17 on Entertainment Weekly's \"30 Under 30\" the actress list [2008].", "Had to wear brown contact lenses for _Twilight (2008)_ (qv) because she has naturally green eyes while Bella's eyes are supposed to be brown. Stewart wore the brown colored contacts in the first four of the Twilight films. In the fifth and final film, Stewart wore red contacts when she was a newborn vampire and amber color contacts as she matures towards the ending of the film.", "Four times nominated, three consecutive years (2003-05) and in 2008 for the Young Artist Award.", "Named the Movie Fanatic's Hottest Young Actress [2008].", "Has three dogs: Bear, Bernie and Cole. Also has a cat named Max/Jella.", "Ranked #9 on Moviefone's \"The 25 Hottest Actors Under 25\" [2008].", "Her mother is Australian.", "Mother is 'Jules Stewart' (qv), a script supervisor who is directing her first film _K-11 (2012)_ (qv).", "Was introduced to Vegemite (an Australian spread) by her Sydney-born mother and names Noosa Heads (a Queensland resort town) as one of her favorite places on the planet. Her Australian heritage also inspired the name of her dog, a border collie named Oz.", "Attended Saint Martin of Tours in Philadelphia, Pennsylvania.", "Replaced 'Hayden Panettiere' (qv) as Sarah Altman in _Panic Room (2002)_ (qv) just before shooting began.", "After the release of _The Twilight Saga: New Moon (2009)_ (qv), 'Kristen Stewart' (qv) was called for jury duty in Los Angeles and was accepted to a jury for a case in which the defendant was accused of soliciting sex from an undercover police officer posing as a prostitute. The case proceedings took three days and ended with the jury finding the defendant not guilty.", "Ranked #1 on the list of \"Hollywood's Top-Earning Actresses in 2012\" by Forbes magazine. Her income between May 2011 and May 2012 was estimated to be $34.5 million.", "Was named \"Stonette of the Year\" by High Times magazine in 2010 (for her performance in _Adventureland (2009)_ (qv)).", "Ranked #3 in FHM Online \"Sexiest Women in the World\" (2010).", "Ranked #13 in the 2011 FHM list of \"Sexiest Women in the World\".", "Ranked #6 in the 2010 FHM list of \"Sexiest Women in the World\".", "Her favorite horror movie is _The Shining (1980)_ (qv).", "Was named Forbes magazine's fifth Highest Paid Celebrity Couple in 2011 with boyfriend, 'Robert Pattinson' (qv).", "Landed her first American Vogue cover in January 2011. She also appeared in a photo-shoot for Vogue Italia in 2011.", "Prior to filming _The Runaways (2010)_ (qv), she worked closely with 'Joan Jett' (qv) to perfect her mannerisms, stage presence, vocal tone, attitude and musical skill. Jett later praised Stewart for her dedication and overall performance stating the portrayal made her proud.", "Has played guitar for her role as 'Joan Jett' (qv) in _The Runaways (2010)_ (qv). She also recorded her own vocal tracks for six songs used in the film and its corresponding soundtrack.", "While filming an attack scene in _Snow White and the Huntsman (2012)_ (qv), she pulled a ligament in her right hand causing production to temporarily shut down. She also sustained a foot injury while on set.", "On November 3, 2011, Stewart and her Twilight co-stars 'Robert Pattinson' (qv) and 'Taylor Lautner' (qv) imprinted their handprints and footprints into cement in front of the famous Chinese Theater in Hollywood, California. Stewart wore black and white checkered Vans skate shoes for her footprints and later gave them to the theater to keep as a souvenir.", "_Welcome to the Rileys (2010)_ (qv) was the first movie Stewart filmed by herself as a legal adult. She felt being alone for the first time added to her role as a 16-year old runaway living alone in New Orleans.", "Attended A.E. Wright Middle School in Calabasas, California until eighth grade. Stewart was homeschooled for grades 9-12 due to her busy schedule. At age 19, she received her high school diploma while filming _The Twilight Saga: Eclipse (2010)_ (qv).", "Her favorite vampire film is _The Lost Boys (1987)_ (qv).", "Has appeared alongside 'Melissa Leo' (qv) twice: _The Cake Eaters (2007)_ (qv) and _Welcome to the Rileys (2010)_ (qv).", "Has appeared with 'Elizabeth Perkins' (qv) twice: _Speak (2004)_ (qv) and _Fierce People (2005)_ (qv). In both films, Perkins played Stewart's mother.", "At age eight, Stewart was discovered by a talent agent while singing in a school play. Although Stewart has since become an actress and not a singer, she has performed her own vocals in two films: _Into the Wild (2007)_ (qv) and _The Runaways (2010)_ (qv).", "Gave her _Zathura: A Space Adventure (2005)_ (qv) co-star, 'Josh Hutcherson' (qv), a turtle for his 13th birthday.", "Celebrated her 19th birthday while filming _The Twilight Saga: New Moon (2009)_ (qv) in British Columbia, specifically while shooting Bella Swan's 18th birthday scene.", "In preparation for her role as a runaway stripper-prostitute in _Welcome to the Rileys (2010)_ (qv), Stewart learned how to pole dance, deprived herself of sleep, chain-smoked and ate mostly junk food. As a result, her body and legs were covered with bruises, her skin was blemished and she constantly looked tired.", "Ranked #27 on Ask men's top 99 \"most desirable\" women of 2012 list.", "Stewart has been/is the face of two Balenciaga fragrances as well as the 2014 Pre-Fall Chanel fashion line.", "Did most of her own stunts for her role as Snow White in _Snow White and the Huntsman (2012)_ (qv).", "Stewart agreed to a salary less than $200,000 so she could remain be part of _On the Road (2012)_ (qv) after the film's budget was drastically cut. Stewart remained committed to the role of Marylou out of her love for the original novel by Jack Kerouac.", "Attended the 2012 MTV Movie 'Awards' (qv) with 'Scout Taylor-Compton' (qv), one of her co-stars from _The Runaways (2010)_ (qv). This was the first MTV 'Awards' (qv) show she attended without 'Robert Pattinson' (qv).", "Ranked #7 on Ask men's top 99 \"most desirable\" women of 2013 list.", "Used to frequent Los Feliz bar The Drawing Room. 'Jon Hamm' (qv), 'Bo Barrett' (qv), 'Michael Angarano' (qv), 'Robert Pattinson' (qv) were also regulars.", "Stewart plays the acoustic guitar and electric guitar, as well as the trumpet. She also enjoys photography as a hobby.", "Stewart's favorite director is 'John Cassavetes' (qv) and her favorite film is _A Woman Under the Influence (1974)_ (qv).", "Director 'Jake Scott' (qv) immediately decided to cast her in his film _Welcome to the Rileys (2010)_ (qv), after he saw her performance as Tracy Tatro in 'Sean Penn' (qv)'s _Into the Wild (2007)_ (qv).", "'Harvey Weinstein' (qv) said at the 2013 TIFF that a Middle Eastern prince donated $500,000 to the 12/12/12 Hurricane Sandy relief fund, in exchange for a 15 minute conversation with Stewart at the benefit. She was there to introduce Bon Jovi.", "Has a small cameo in the 'Jules Stewart' (qv) directorial debut, _K-11 (2012)_ (qv). She did a voice-over to play Karen, Raymond Saxx Jr.'s secretary, when he calls his office. The film is also her older brother 'Cameron B. Stewart' (qv)'s acting debut.", "Good friends with 'Scout Taylor-Compton' (qv), 'Riley Keough' (qv) and 'Dakota Fanning' (qv).", "Is one of only two American actors to win a César Award in France, the French equivalent to the Oscar. The other one is 'Adrien Brody' (qv).", "Was the first American actress in thirty years to be nominated for a Cesar Award and the only one to win for her role in _Clouds of Sils Maria (2014)_ (qv). The other was 'Julia Migenes' (qv), nominated for her work in _Carmen (1984)_ (qv).", "Attended the wedding of her close friend, 'Riley Keough' (qv), in February 2015 where she wrote a poem to be read during the reception. Also in attendance was 'Dakota Johnson' (qv), 'Cara Delevingne' (qv) and 'Zoë Kravitz' (qv). Stewart met Keough while filming _The Runaways (2010)_ (qv).", "When she went onstage to accept her César Award in 2015, she was so tense she could not open her hands to hold it and had to ask the presenter to put it on the podium for her so she could give her speech.", "Has appeared with 'Jesse Eisenberg' (qv) three times: _Adventureland (2009)_ (qv), _American Ultra (2015)_ (qv) and _Café Society (2016)_ (qv).", "Is the face of Chanel and Balenciaga fashion brands.", "In _Clouds of Sils Maria (2014)_ (qv), Kristen's character has a tattoo on her right arm. This is a piece of Picasso's Guernica. Kristen loved the temporary tattoo so much, she made this a real tattoo.", "Ranked #3 on Forbes magazine's highest paid actress in 2013 with a total earning of 22 million dollars, #10 in 2014 with 12 million dollars, and #9 in 2015 with 12 million dollars.", "She won the BAFTA Orange Rising Star Award (2010).", "Stewart was listed as the highest-earning female actress in the Vanity Fair \"Hollywood Top Earners List of 2010\", with an estimated earning of $28.5 million. In 2011, she was named #1 on Forbes magazine's list of \"Hollywood's Best Actors for the Buck\".", "She was named #1 for Glamour magazine's \"Best Dressed Women\" (2015).", "Stewart has starred with 'Jesse Eisenberg' (qv) in third films. The pair first starred opposite each other in _Adventureland (2009)_ (qv). They reunited to play another troubled couple in _American Ultra (2015)_ (qv) and then again as love interests in 'Woody Allen' (qv)'s _Café Society (2016)_ (qv).", "After months of speculation about her sexuality, she publicly came out as bisexual on _Saturday Night Live (1975)_ (qv) in February, 2017.", "She shaved her hair into a very short buzz cut for her role in _Underwater (2020)_ (qv). She has expressed a desire to shave her head completely.", "She has dual American and Australian citizenship.", "Member of the 'Official Competition' jury at the 71st Cannes International Film Festival in 2018.", "She was among the actresses considered for the role of Lisbeth Salander in The Girl With The Dragon Tattoo (2011) before Rooney Mara was cast.", "Of Clan Stewart."], "quotes": ["On working on _Panic Room (2002)_ (qv) with such a big name star as 'Jodie Foster' (qv): When I got Panic Room, I'm like \"Oh my God, that's huge! It's bigger than huge.\" I was kind of freaked out at first.", "(on her love for acting) I love it because I love to tell stories. I like being in movies that have a great story. I'm not so interested in being a Hollywood star. It's a job, you know. When you wake up at six in the morning every day for a week, it feels like hard work.", "I don't want to make movies for kids, and I don't want to make movies for adults either.", "Acting is such a personal thing, which is weird because at the same time it's not. It's for the consumption of other people. But in terms of creative outlets and expressing yourself, it's just the most extreme version of that that I've ever found. It's like running, it's exertion. When you reach that point where you can't go anymore and you stop and you take a breath, it's that same sort of clearing of the mind.", "A lot of actors think that what we do is so important, like we're saving people's lives or something.", "All I try to do in the press is be honest about something that I really care about.", "I've always had an aversion to looking sexy, but I've grown out of it.", "I start everything from the same place, with that sense of responsibility. On a bigger movie, you have to be aware that you can only control your aspect of the film. It's nice to be on a smaller movie because you're working with your friends and you feel so close-knit. It's your movie and you can do anything you want, and nobody's going to have anything to say. With a bigger movie, it concerns so many people. It's so much more of a process. But, in terms of what I do personally, it has to be the same, or else I'm just on some big movie, being a liar, and I can't do that.", "Really, I'm incredibly disjointed and not candid. Just in general, my thoughts tend to come out in little spurts that don't necessarily connect. If you hang around long enough, you can find the linear path. But it will take a second. That is why these interviews never go well for me.", "On having an aha moment when it came to pursuing an acting career: I have the \"Aha\" moments progressively -- they're like milestones and they hit you. I think my first \"Aha!\" moment was when I did this movie called _Speak (2004)_ (qv). I was just rolling with it, and ended up kind of really losing myself in it, so that I felt like I was a different person at the end. That was a big moment.", "You should have the opportunity to be more than one person with different people - because you have that within you. It's not like you're faking it. If everyone knows you so well and can always get a hold of you, then you're stuck to this thing that people think you are. You should have the opportunity to reinvent yourself. Because you do. Naturally.", "On whether she wants to develop her skills as a writer: I do want to work on writing, because writing's a skill. Writing is something that you can train yourself to know better. To know yourself better. And it's intimidating as hell. I mean, I definitely will always do what I've been doing. I've also started taking a lot of pictures, and they help the writing. The pictures help the writing. I mean, I want to make books. I want to take pictures and then write all over the pictures. And then I don't have to say a complete story, because I have the picture, and I have just a word.", "On Bella Swan in New Moon (2009): Well, she loses what basically gives her the drive to do anything in her whole life. She loses the man she's in love with, but she also loses her entire life plan, and she's so young to have to be forced into a decision like that. It's just a glorified, elaborate version of the worst breakup you've ever been through. All of a sudden, you question everything. All of a sudden, you know nothing and you're dropped in the middle of a freezing cold ocean. Oddly, we have a character that's warm enough and bright enough to bring her out of that, and it's truly gut-ripping. Because as perfect as Jacob is for her, she holds on to an ideal, the ultimate fiery love that she has for Edward even though it's not comfortable, it's not practical and it's not a good idea.", "This weird thing happens when you're in a movie that has some level of success. People start offering you all kinds of things, and they just expect you to do them because they'll be good for your career. It's not about the project's integrity or anything like that. It's about raising your profile and all that crap.", "I was just in Botswana in Africa. I wanted to learn something about the world. I just feel really ignorant whenever I leave the country. I don't know a lot of stuff, and I really want to. I figure that traveling is a good way to start if you want knowledge. Like, if you don't know something about a country, then go and check it out. That's what I did.", "On how her life has changed since _Twilight (2008)_ (qv): My life hasn't changed. Most circumstances I find myself in are different than they were a year ago, but I myself haven't changed... however a normal 18-year-old girl would change in a year. But it makes things so much easier. I would do it for free every day [even] if nobody saw it. I cannot describe how good it feels to actually have something that is truly into your heart and soul actually affecting people. And that's amazing. So that's the biggest change.", "On whether she wants to continue making movies or go to college: I absolutely have no foresight. I used to think I had a lot when I was younger. I worked really hard in school to give myself options, and I've literally taken those options and thrown them down the toilet. Purposely - not to make that sound totally negative. It's what I want. I want to keep doing what I'm doing. It's funny, people ask me all the time: \"What do you do for fun? What do you do when you're not acting?\". It's a strange thing, acting. It's a business, it's a job, everything like that. All it is, is self-reflection. You just never stop caring about people and I've never stopped doing that, so I'm sure it'll seep into other areas of my life. I want to write. I'm not going to school because I can't take the structure of it, but I'm not going to stop learning.", "Usually, I come in and sit down at roundtables in America and they look at me like \"What is wrong with you?\". Just because I don't fit... nobody fits into the frame that typical Hollywood young actresses do, but they try to. They try to be this thing. Try to memorize answers and make everybody happy. That's so horrifying and scary to me. So when you're not that, you get criticized for it. You get criticized for being honest and criticized for being nervous. So that's kind of annoying. I do a whole day of press and then I get calls from publicity people that are like \"You might want to be a little bit more bubbly.\" And I'm like \"no\". People get very upset in the States. It's weird. Fans of the book especially. They don't understand me. Which is fine. I guess it doesn't really matter who I am, it just matters that they like the movie.", "On doing interviews: Self-evaluation is not my strong point, and you're constantly asked to critique yourself. You just spent three months on a set and your whole life is wrapped up in that - and then it's like, \"Okay, define that right now in five seconds.\" I can't do that. I used to get so nervous that I would become a completely different person - and then they would think that was me. So I've tried to calm down, but no one's ever going to write, \"Oh, she's actually just a pretty f---in' average chick who really loves what she does.\" That's not gonna happen.", "On how fame changed her life: There's nothing you can do about it, to be honest. I don't leave my hotel room -- literally, I don't. I don't talk to anybody about my personal life, and maybe that perpetuates it, too. But it's really important to own what you own and keep it to yourself. That said, the only way for me not to have somebody know where I went the night before is if I didn't go out at all. I'm trading. It depends on what mood I'm in. Some nights, I think, \"You know what? I don't care. I'm going to do what I want to do.\" Then the next day I think, \"Ugh. Now everyone thinks I'm going out to get the attention.\" and I'm like, \"No, actually, for a second, thought that maybe I could be like a normal person.\".", "Speech after winning an Orange Bafta (2010): Wow. Thank you. I guess first I have to thank all the fans of Twilight for proving again and again to be THE most devoted and attentive fans ever. Considering this is voted, credit is due to them so thank you. To the other actors nominated, I am so blown away by you that I can't even describe it. To be voted among you is just overwhelming. And I'd like to say hi to my family.", "[in 2009, on her relationship with 'Robert Pattinson' (qv)] People always ask me if Im dating Rob (Pattinson). It's beyond annoying. What I say is, that, why would I want anything that's private to become entertainment for other people?", "My family are amazing. I had like, the perfect upbringing. It sucks for people like Lindsay [Lohan], but it's not her fault she's so off the rails - and she's smart, very smart.", "I'm totally preoccupied with cooking. And now I'm obsessed with the Food Network. I like Paula Deen because she's hilarious,.", "It's weird, because I would be the last person in my school to be in plays, but I was forced to sing a song in a school thing. I sang a dreidel song, which is funny for me. I've never celebrated Hanukkah - it wasn't in my upbringing, but it was one of those deals where everybody has to pick a song or participate somehow in the chorus. It wasn't the normal dreidel song; I can't really remember the words, but it was a more serious dreidel song. The dreidel was huge, it was really honored. And that's how I met my agent, who was in the audience. I was eight.", "[on her hair]: Since I started acting, I have never had by natural color, which is light brown. But it's fine, it's funny seeing yourself look different.", "I'm asked all the time in interviews about who I am, and I know a few people my age who have a strong sense of self, but I couldn't say I know myself and sum it up and give it to you in a little package. I don't know myself at all yet.", "[in 2010, if she is dating 'Robert Pattinson' (qv)] I wouldn't tell you anything about anybody I cared about because it becomes entertainment for other people, and it sort of just cheapens everything in your life. I would never tell you if I was dating anybody.", "I think romance is anything honest. As long as it's honest, it's so disarming.", "[on what fame changes] You build a perimeter of people that are really important to you.", "[on the down-side of fame]: There's no way to eloquently put this. I just can't go to the mall. It bothers me that I can't be outside very often. And also to not ever be just 'some girl' again. Just being some chick at some place, that's gone.", "Anytime I hear that somebody's really rich, the first question is, \"Do you do anything with it? Or do you, like, chill? You just sit on it?\".", "When I dress up, I have to have a lot of help. I was in a T-shirt until a few minutes ago.", "What you don't see are the cameras shoved in my face and the bizarre intrusive questions being asked, or the people falling over themselves, screaming and taunting to get a reaction.", "[in 2011, about her boyfriend 'Robert Pattinson' (qv)] I would never cheapen my relationships by talking about them.", "It's impossible to always get across what I'm trying to say, but, if I just stay honest, then I'm not going to look back on any of these interviews and wonder what I was trying to do or be.", "[on her rise to fame and claims that she is ungrateful or unhappy]: I totally am more comfortable now. I try not to have a celebrity skin, which is why I think I run into problems. So many people say \"Why don't you just play the part?\". I do, I really try to do that. I guess I should get a face transplant or something. I really love what I do, I really love everybody that I've ever worked with, I've gotten really lucky. I'm very appreciative, so that always kills me.", "I think it's funny that when I go onstage to accept an award, they think I'm nervous, uncomfortable, and awkward - and I am - but those are bad words for them.", "[on the paparazzi]: Once somebody finds out, you have to get the hell out of wherever you are. People freak out. And the photographers, they're vicious. They're mean. They're like thugs. I don't even want to drive around by myself anymore. It's dangerous.", "I don't think there's anything about being a celebrity that is desirable. I understand that everybody's going to know who you are and what you look like, but why be so obsessive?", "Maybe I'm completely different from everyone else. There are a lot of girls who can't wait to get married and plan their wedding a long time in advance. I'm not like that. I do want to start a family at some point, but I don't know when.", "[on punching 'Chris Hemsworth' (qv)] I have to say for anyone who's ever been in that situation where, as a girl, you think it's not going to do anything. It fucking does something. He was standing over me and I just went \"boom!\" I spun him around. I punched him right out of his close-up and then I started crying. I felt horrible.", "The strangest part about being famous is you don't get to give first impressions anymore. Everyone already has an impression of you before you meet them.", "On _Snow White and the Huntsman (2012)_ (qv): I'm having the most fulfilling experience as an actor. I'm close with 'Rupert Sanders' (qv), have his ear, and it's to his credit that I feel this way because I'm getting my first taste of really collaborating. Usually as an actor, you put your hands up and go, \"That's not my thing.\" I love acting. Honestly, I love looking at the call sheet where it says my character's name above my name. That's what I'm here for, but it's also cool to be on their level. To give an opinion and be taken seriously.", "I can't wait to not be working and go home and gain some interests. I want to see what I'm into. I want to figure out what I want.", "[on wearing colored contacts in _Twilight (2008)_ (qv)] The contacts suck so badly. You can't see anything thus people cannot see you, I feel. There is just no getting in there.", "[on choosing to leave public school] School became genuinely uncomfortable. I was feeling a little self-conscious about the acting thing with my peers, but also my teachers became a problem. They didn't want to do the extra work or put packages together so I could keep up while away. They failed me. My teachers failed me. Not one, but all of them. I'm always slightly ashamed, in a way, about what I do. I'm slightly embarrassed as I had such serious ambitions when I was younger. I just never imagined that I would ever have a reason not to go to school, but then this happened.", "[on her role as Melinda Sordino in _Speak (2004)_ (qv)] I was definitely aware of the film's subject matter, and it wasn't because of anything that had happened in my own life. Not at all. I grew up in a happy household.", "It took me a long time to realize that I was a girl as a teenager. At that point, I never really believed it. I looked like a boy for a long time. Now finally, I feel like a woman.", "[on the paparazzi] It really is not a nightmare, it's just one of those things. I guarantee whenever I get married or have a baby, everyone is going to want to know my kid's name and I'm not going to say it for ages. That's just the way I want to do it. It'll come out but it won't have come from me. They're going to be really pissed off that I won't say it and I'm just going to say, \"No!\"", "I play music but only for myself. For my ears only.", "If a woman isn't happy and un-opinionated and long-haired and pretty, then she's weird and ugly. I just don't get it. I hate it when they say I'm ungrateful and I fucking hate it when they say I don't give a shit, because nobody cares more than I do. I'm telling you I don't know anybody who does this that gives a shit more than I do.", "The reason I feel compelled to do movies is because of whatever feeling you get when you read it. And to have four years of not being done with the Twilight Saga, it constantly weighs on you. You're constantly thinking about going back and finishing the series.", "Every day, you come home from work you go, like, God I wish I could go back and do yesterday again because I'm better now.", "I know that I don't seem like the type of person that really loves to be in the center of things, but anyone to deny the type of energy, like the effect of shared love, you'd have to be a sociopath to not let it in.", "As an actor your life is so wrapped up in your job. It's not normal. People's jobs don't affect their whole lives. Mine is why I love my life and so to talk about it to you guys [the media] and to know that it's not just you guys, that I'm talking through you to the fucking world, it's really scary at first. Now it's not only because I'm used to it. It just takes time.", "I can't be anyone but myself, man!", "I don't want to be 'Angelina Jolie' (qv). Not that 'Angelina Jolie' (qv) is not the most talented, beautiful, successful, amazing, admirable person who does good things for the world, but I don't want to be a movie star like that. I don't think there's anything about being a celebrity that is desirable. I understand that everybody's going to know who you are and what you look like, but why be so obsessive?", "[in 2012, about her relationship with 'Robert Pattinson' (qv)] I would never cheapen my relationship by talking about them. People say, \"Just say who you're dating. Then people will stop being so ravenous about it.\" It's like \"No they won't! They'll ask for specifics.\"", "[on playing Marylou in _On the Road (2012)_ (qv)] She's generous in every aspect of her life and she wants it back just at much. I'm a slightly different person. I think that I liken myself much more to Sal's character, so to be that person running down the street with everyone chasing after was different. I think also she's so completely self-aware but not self-conscious and the same time and, like, I don't know how else to describe it other than there's just a generosity of absolutely everything. Because she wants everything in return she is willing to give you absolutely anything and I'm not like that. So it was fun. I also think that's why I loved the book initially. I wanna keep up with these characters. It's not that I'm so not like them, it's just that they inspire me.", "[on working with female directors] It's hard to generalize about that subject because the women I've worked with have all been so different. But if there's one consistency, it might be that you do have to handle yourself differently on a set. Women can be more emotional - at least they sometimes show it more.", "If you respect yourself and you love yourself, that's the only way anybody else is going to.", "Nowadays it's harder because everyone is on Facebook and everyone knows where you are all the time, and everyone's Twittering. I'm going to die because somebody is going to say where I am and somebody is going to kill me. Someone's going to Twitter my location and it's going to be, like, BOOM!", "[on the birth scene in _The Twilight Saga: Breaking Dawn - Part 1 (2011)_ (qv)] Even though the birth scene is horrible and grotesque, I think it's just the most beautiful moment. The fact that it's so gruesome and awful is why it's so gorgeous.", "We push boundaries in this business in terms of getting to know people. There are things that directors know about me that people shouldn't know.", "I have this weird aversion to people going, \"It's a nice, strong female movie. It's really strong.\" It's almost like you're kind of discrediting the strength.", "I am obsessed with ignoring the idea that we're creating products. I really choose every single project I do based on desire and on really just wanting to make that story happen.", "If you don't have anything to put in, you're not going to give a lot out. It's not breaks that help. It's managing input and output. The impulse to make stuff is not in everyone. Most people who have that impulse are weird. They need to take care of themselves.", "I'm not the most health conscious person, but I run. I'm active, I like to stay active because I'm hyperactive, so I need to get energy out.", "[on starting acting as a teenager] I'm sitting back and enjoying the benefits of a decision that I made when I was a person who I can still relate to but am not anymore.", "I became really successful at something at a young age, and that stunts you in every other aspect of your life because you feel like that's what you're good at and so that's what you need to stay in.", "Anybody who wants to talk shit about _Twilight (2008)_ (qv), I completely get it, but there's something there that I'm endlessly fucking proud of. My memory of it felt -- still feels -- really good.", "I can't, like, put on the show. I'm not a performer. And it's hard for people to accept a serious tone from a kid without thinking they're sort of stuck up.", "[on moving back and forth between independent and studio films] - I feel equally invested and fervently drawn to every part I've done. I've never done anything where I was like, \"Okay, let's just get this one finished.\" A lot of actors say \"One for them, one for me\", but I could never do that. I would be terrible. They would fire me.If you step outside of yourself and start tactically maneuvering your career, it actually makes no sense whatsoever, I don't think it's possible. Sure, there are sociopathic actors out there. But acting requires your heart to be so, so in it. Every single time I agree to do a movie, I'm terrified. I think, \"Oh my God, am I really going to tell them that I can do this?\". But then I jump in. It's always the same, the budget makes no difference.", "There's a cinematic culture in Paris that doesn't exist anywhere else.", "[on the negative reaction to _Personal Shopper (2016)_ (qv) at the Cannes Film Festival] If I was a journalist who wanted people to click on my article I would say \"'Kristen Stewart' (qv) Gets Booed at Cannes\". That's exactly what I would publish to get people to click on the article, you know. I think Personal Shopper takes a minute to digest. I think that initial, quick reaction is something people at film festivals feel entitled to, because they're allowed to have the first opinion. And when they didn't know how they felt they just say \"NO\". This movie is definitely not handed to you. You see a movie and you walk out with a friend, whoever you've seen it with and you're quiet and you don't talk about it maybe until tomorrow. That's the kind of movie that it is.", "[on _Personal Shopper (2016)_ (qv)] When you speak to someone on the phone, that is a decipherable, understandable exchange. But with text and social media, it's essentially a dialogue with yourself and your interpretation of a shadow. It's not invalid; it's a new language.", "[in 2017, on tolerance for the LGBT community] The whole issue with sexuality is so gray. I'm just trying to acknowledge that fluidity, that grayness, which has always existed. But maybe only now are we allowed to start talking about it. I think things (the culture) are changing. Individually we are all part of that change and so I can take some credit for it, I guess - there's no reason why I should shy away from that. I mean, yeah, it's definitely still there. People still have some horrendous experiences. But all the prejudice; it's going (away) for sure.", "I'm not your typical showman. But at the same time, I want so badly to expose myself. I want to be understood and I want to be seen, and I want to do that in the rawest, purest, most naked way I can.", "[in 2016, on her past relationship with 'Robert Pattinson' (qv)] When I was dating Rob (Pattinson), I was hiding everything that I did because everything personal felt like it was immediately trivialized, so I didn't like it. We were turned into these characters and placed into this ridiculous comic book, and I was like, 'That's mine. You're making my relationship something that it's not.' I didn't like that. But then it changed when I started dating a girl. I was like, 'Actually, to hide this provides the implication that I'm not down with it or I'm ashamed of it,' so I had to alter how I approached being in public. It opened my life up and I'm so much happier.", "[in 2016, on her relationship with 'Robert Pattinson' (qv) being displayed in the public media] People wanted me and Rob to be together so badly that our relationship was made into a product. It wasn't real life anymore. And that was gross to me. It's not that I want to hide who I'm with or hide anything I'm doing in my life. It's that I don't want to become a part of a story for entertainment value.", "[in 2017, on being bisexual] It's cool that you don't have to nail everything down any more. That whole certainty about whether you're straight or gay or whatever. You're not confused if you're bisexual. It's not confusing at all. For me, it's quite the opposite."], "salary history": ["_Twilight (2008)_ (qv)::$2,000,000", "_The Twilight Saga: Breaking Dawn - Part 1 (2011)_ (qv)::$12,500,000 + 7.5% of the gross", "_The Twilight Saga: Breaking Dawn - Part 2 (2012)_ (qv)::$12,500,000 + 7.5% of the gross"], "birth date": "1990-04-09", "birth notes": "Los Angeles, California, USA", "_actorID": "92", "_source": "IMDB", "actorID": "0829576", "created_utc_dt": "08/26/2019, 21:54:49"}