{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQwMDQ0NDk1OV5BMl5BanBnXkFtZTcwNDcxOTExNg@@._V1_UY98_CR0,0,67,98_AL_.jpg", "nick names": ["Kaz"], "birth name": "Karen Sheila Gillan", "height": "5' 10\" (1.78 m)", "mini biography": ["Karen Sheila Gillan was born and raised in Inverness, Scotland, as the only child of Marie Paterson and husband John Gillan, who is a singer and recording artist. She developed a love for acting very early on, attending several youth theatre groups and taking part in a wide range of productions at her school, Charleston Academy.At age 16, Karen decided she wanted to pursue her acting career further and, studied under the renowned theatre director Scott Johnston at the Performing Arts Studio Scotland. She later attended the prestigious Italia Conti Academy in London. During her first year, she landed a role on _Rebus (2000)_ (qv) and soon appeared in a variety of programs including Channel 4's _Stacked (2008)_ (qv) and _The Kevin Bishop Show (2008)_ (qv), as well as a two-year stint on the long-running series _Doctor Who (2005)_ (qv). Karen also stars in the film _Outcast (2010)_ (qv), starring 'James Nesbitt' (qv). Her most recent starring role is as Eliza Dooley on the situation comedy _Selfie (2014)_ (qv).::Questnl"], "trade mark": ["Red hair", "Energetic personality", "Scottish accent", "Towering height"], "trivia": ["Grew up in Inverness, Inverness-shire, Scotland, Great-Britain and Northern-Ireland.", "Attended the Italia Conti Academy of Theatre Arts in London, England.", "Loves rummaging through vintage clothes shops and playing the piano.", "Used the code word 'Panic Moon' (an anagram of 'Companion'), when auditioning for the role of the Doctor's assistant/companion.", "Cousin of 'Caitlin Blackwood' (qv), who plays the younger Amy Pond.", "Voted Best Actress by readers of \"Doctor Who\" magazine for her stint on the 2010 season of _Doctor Who (2005)_ (qv).", "Karen is part of the youngest pairing of the Doctor and companion on _Doctor Who (2005)_ (qv). In 2009, the new Doctor, 'Matt Smith' (qv), is 26, and she is just 21. Their combined age will be younger than that of 'Jon Pertwee' (qv), when he was playing the Time Lord in the 1970s.", "Karen admitted the first person she told when she got the role of Amy Pond was her mother, who the actress said was a huge fan of _Doctor Who (1963)_ (qv).", "Is the only child and daughter of John Gillan of Clan Macnab and wife Marie Paterson of Clan Paterson, considered part of Clan MacLaren or of Clan Farquharson.", "Good friends with 'Katee Sackhoff' (qv).", "The Daleks on the series had to be redesigned to match her height, as she's half a foot taller than 'Billie Piper' (qv), who was the first companion on the revival.", "Currently resides in Manhattan, New York, New York County, New York, and in Los Angeles, Los Angeles County, California.", "Two years before she was cast as Amy Pond on _Doctor Who (2005)_ (qv), Karen had a guest role in the episode, _Doctor Who: The Fires of Pompeii (2008)_ (qv). She was cast as a soothsayer.", "Became a huge fan of the situation comedy _Community (2009)_ (qv), after her flatmate told her about their Doctor Who parody, \"Inspector Spacetime\".", "Shaved her head completely bald to play Nebula in _Guardians of the Galaxy (2014)_ (qv).", "Went on record that she would like to play a female Bond antagonist in a future James Bond movie and that she wants to play the female incarnation of The Joker in a future Batman movie.", "Funko released Pop! vinyls of 'Karen Gillan' (qv)'s characters Amy Pond from Doctor Who and Nebula from the Cinematic Marvel Universe.", "Gillan shaved off her hair during Guardians of The Galaxy (2014). She revealed this during Comic-Con 2013. During the conference, she wore a wig then took it off to surprise fans.", "When she's not acting, she likes to play the piano and loves rummaging through vintage clothes shops."], "quotes": ["[discussing Amy's relationship with the Doctor] She (Amy Pond) doesn't take his (the Doctor's) word as gospel and she's always happy to challenge him. If he tells her to do something then she won't necessarily do it, she might go off and do her own thing which can sometimes create a rift between the two of them! They are best pals though and it's a very up and down relationship because they are both very passionate people.", "'Matt Smith' (qv) is an incredible actor and it is going to be so much fun to act alongside him. I just can't wait to get started.", "[on winning the role as Amy Pond on _Doctor Who (2005)_ (qv)] I am absolutely over the moon at being chosen to play the Doctor's new companion. The show is such a massive phenomenon that I can't quite believe I am going to be a part of it.", "I got a recall to come in and read with Matt [the eleventh Doctor] and that was quite funny, actually, because, I wasn't allowed to tell anyone that I was auditioning, what I was auditioning for, not even the people in the reception of the place that I was going to. So I had to give them a code name of 'Panic Moon'. It was fun but it was actually an anagram for 'companion' which is quite clever.", "I am legitimately Scottish. I can officially say - yes. Yeah, I am from Inverness in the Highlands of Scotland.", "To be honest, I wasn't really a huge follower of _Doctor Who (1963)_ (qv) before I got this part. I mean I knew it was huge, but ... I was nothing like my mum, who's a proper diehard Whovian. She's got a Tardis money-bag, and Dalek bubble-bath. But having read the first episode I was utterly smitten, and with the character. Amy's a sassy lady, funny and passionate, and her relationship with the doctor has a really interesting dynamic.", "[on the Doctor] He's just really unlikely as a hero - which makes him so brilliant, I think, because he's like this mad professor.", "I wasn't horrifically bullied. There was some name-calling but nothing awful. All kids get teased about something. And this was quite an obvious feature. When you're really tall and ginger and white at school, you're going to get it.", "[on _Oculus (2013)_ (qv)] I love horror films so much. I like being scared. I want to be in good films, obviously, rather than cheesy ones. And some horror films can be quite cheesy. I love watching them but I don't necessarily want to be in them.", "[asked about some directors she would like to work with] I want to work with 'Michael Haneke' (qv), the Austrian director, more than anything in the world. Can you make that happen for me? I love his films so much. He's my favourite director in the world.", "[on 'Michael Haneke' (qv)'s movies] I like his films because I like big films as well but they're far more manipulative, like we're going to make you feel sad at this point, then the music kicks in and you know what you're supposed to feel, and they're telling you what to feel, but Haneke's stuff is just this really unbiased view of events, and you choose how to feel about it, which is fun for me.", "[on playing Nebula in _Guardians of the Galaxy (2014)_ (qv)] I was a little worried that I was going to look like an overgrown fetus. Maybe that's true. But it's liberating. It's very liberating. Everyone here should shave their heads."], "birth date": "1987-11-28", "birth notes": "Inverness, Scotland, UK", "_actorID": "51", "_source": "IMDB", "actorID": "2394794", "created_utc_dt": "08/26/2019, 21:54:22"}