{"headshot": "https://m.media-amazon.com/images/M/MV5BNjUxNDcwMTg4Ml5BMl5BanBnXkFtZTcwMjU4NDYyOA@@._V1_UY98_CR4,0,67,98_AL_.jpg", "nick names": ["The Wall", "The One"], "birth name": "Keanu Charles Reeves", "height": "6' 1\" (1.86 m)", "mini biography": ["Keanu Charles Reeves, whose first name means \"cool breeze over the mountains\" in Hawaiian, was born September 2, 1964 in Beirut, Lebanon. He is the son of 'Patricia Taylor' (qv), a showgirl and costume designer, and Samuel Nowlin Reeves, a geologist. Keanu's father was born in Hawaii, of British, Portuguese, Native Hawaiian, and Chinese ancestry, and Keanu's mother is originally from England. After his parents' marriage dissolved, Keanu moved with his mother and younger sister, 'Kim Reeves' (qv), to New York City, then Toronto. Stepfather #1 was 'Paul Aaron' (qv), a stage and film director - he and Patricia divorced within a year, after which she went on to marry (and divorce) rock promoter Robert Miller and hair salon owner Jack Bond. Reeves never reconnected with his biological father. In high school, Reeves was lukewarm toward academics but took a keen interest in ice hockey (as team goalie, he earned the nickname \"The Wall\") and drama. He eventually dropped out of school to pursue an acting career.After a few stage gigs and a handful of made-for-TV movies, he scored a supporting role in the 'Rob Lowe' (qv) hockey flick _Youngblood (1986)_ (qv), which was filmed in Canada. Shortly after the production wrapped, Reeves packed his bags and headed for Hollywood. Reeves popped up on critics' radar with his performance in the dark adolescent drama, _River's Edge (1986)_ (qv), and landed a supporting role in the Oscar-nominated _Dangerous Liaisons (1988)_ (qv) with director 'Stephen Frears' (qv).His first popular success was the role of totally rad dude \"Ted Logan\" in _Bill & Ted's Excellent Adventure (1989)_ (qv). The wacky time-travel movie became something of a cultural phenomenon, and audiences would forever confuse Reeves's real-life persona with that of his doofy on-screen counterpart. He then joined the casts of 'Ron Howard' (qv)'s comedy, _Parenthood (1989)_ (qv) and 'Lawrence Kasdan' (qv)'s _I Love You to Death (1990)_ (qv).Over the next few years, Reeves tried to shake the Ted stigma with a series of highbrow projects. He played a slumming rich boy opposite 'River Phoenix' (qv)'s narcoleptic male hustler in _My Own Private Idaho (1991)_ (qv), an unlucky lawyer who stumbles into the vampire's lair in _Bram Stoker's Dracula (1992)_ (qv), and Shakespearean party-pooper Don John in _Much Ado About Nothing (1993)_ (qv).In 1994, the understated actor became a big-budget action star with the release of _Speed (1994)_ (qv). Its success heralded an era of five years in which Reeves would alternate between small films, like _Feeling Minnesota (1996)_ (qv) and _The Last Time I Committed Suicide (1997)_ (qv), and big films like _A Walk in the Clouds (1995)_ (qv) and _The Devil's Advocate (1997)_ (qv). (There were a couple misfires, too: _Johnny Mnemonic (1995)_ (qv) and _Chain Reaction (1996)_ (qv).) After all this, Reeves did the unthinkable and passed on the Speed sequel, but he struck box-office gold again a few years later with the Wachowski siblings' cyberadventure, _The Matrix (1999)_ (qv).Now a bonafide box-office star, Keanu would appear in a string of smaller films -- among them _The Replacements (2000)_ (qv), _The Watcher (2000)_ (qv), _The Gift (2000)_ (qv), _Sweet November (2001)_ (qv), and _Hardball (2001)_ (qv) - before _The Matrix Reloaded (2003)_ (qv) and _The Matrix Revolutions (2003)_ (qv) were both released in 2003.Since the end of The Matrix trilogy, Keanu has divided his time between mainstream and indie fare, landing hits with _Something's Gotta Give (2003)_ (qv), _The Lake House (2006)_ (qv), and _Street Kings (2008)_ (qv). He's kept Matrix fans satiated with films such as _Constantine (2005)_ (qv), _A Scanner Darkly (2006)_ (qv), and _The Day the Earth Stood Still (2008)_ (qv). And he's waded back into art-house territory with _Ellie Parker (2005)_ (qv), _Thumbsucker (2005)_ (qv), _The Private Lives of Pippa Lee (2009)_ (qv), and _Henry's Crime (2010)_ (qv).Most recently, as post-production on the samurai epic _47 Ronin (2013)_ (qv) waged on, Keanu appeared in front of the camera in _Side by Side (2012)_ (qv), a documentary on celluloid and digital filmmaking, which he also produced. He also directed another Asian-influenced project, _Man of Tai Chi (2013)_ (qv).In 2014, Keanu played the title role in the action revenge film _John Wick (2014)_ (qv), which became popular with critics and audiences alike. He reprised the role in _John Wick: Chapter 2 (2017)_ (qv), taking the now-iconic character to a better opening weekend and even more enthusiastic reviews than the first go-around.::Anonymous"], "trade mark": ["Intense contemplative gaze", "Deep husky voice", "Known for playing stoic reserved characters"], "trivia": ["Chosen by People magazine as one of the 50 Most Beautiful People in the World (1995).", "Ranked #23 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Arrested in Los Angeles, California; charged with drunk driving. [May 1993]", "Loves ballroom dancing.", "He owns at least two Norton Commando motorcycles whose engines were available in both 750cc and 850cc capacities, the high-compression version being the Combat Commando.", "Younger sister, 'Kim Reeves' (qv) (born in Australia in 1966). Through his mother, he has a half-sister named Karina Miller (born 1976 in Toronto). Through his father, he has a half-sister named Emma Reeves (born 1980 in Hawaii).", "Named after his uncle Henry 'Keanu Reeves' (qv). \"Keanu\" is a derivation of Reeves' great-great-uncle Keaweaheulu, whose name means \"the soft breeze raising\" in Hawaiian.", "Ex-stepson of film and stage director 'Paul Aaron' (qv).", "Had job sharpening ice skates.", "Was nicknamed \"the wall\" by high school hockey team De La Salle College \"Oaklands\".", "Father left the family when Keanu was very young.", "Was manager of a pasta shop in Toronto, Ontario.", "His father was a geologist who served time in prison. He was paroled after serving two years of a ten-year sentence for selling heroin at Hilo Airport (1992).", "His mother, 'Patricia Taylor' (qv), was a costume designer for rock stars such as 'Alice Cooper' (qv).", "His name means \"cool breeze over the mountains\" in Hawaiian.", "Dropped out of high school when he was 17 to become an actor.", "Hobbies include horseback riding and surfing (both inspired from movie roles).", "Was MVP on his high school hockey team, where he was a goalie.", "Keanu got his abdominal scar from a motorcycle wreck in Topanga Canyon. He was on a \"demon ride\" (no headlights at night) when he crashed into the side of a mountain. He was hospitalized for a week with broken ribs and a ruptured spleen. When the paramedics came to get him, an emergency medical technician trainee picked up one end of the stretcher... then dropped it by mistake! \"It made me laugh, but I couldn't breathe!\".", "When trying out for the roles of Bill and Ted in _Bill & Ted's Excellent Adventure (1989)_ (qv), each actor was paired up with another. 'Keanu Reeves' (qv) and 'Alex Winter' (qv) were paired up, Reeves trying out for the part of Bill while Winter tried out for the part of Ted. They were cast opposite what they auditioned for.", "His first name, Keanu, is pronounced \"kee-ah-noo\".", "Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#17). [August 1995]", "In November 1999, the baby girl he was expecting with girlfriend 'Jennifer Syme' (qv) was stillborn, just a few weeks shy of the actual delivery date. They had planned to name her Ava Archer Syme-Reeves.", "(April 2, 2001) His estranged girlfriend 'Jennifer Syme' (qv) was killed when her Jeep Cherokee careened onto the wrong side of a Los Angeles road near Highway 101 and smashed into three parked cars. The force of the crash flipped the car over and she was thrown through the windshield. She was killed instantly.", "Maintains Canadian citizenship and passport.", "Has appeared in three films whose title contains a US state: _Feeling Minnesota (1996)_ (qv), _My Own Private Idaho (1991)_ (qv) and _The Prince of Pennsylvania (1988)_ (qv) and his character in _Point Break (1991)_ (qv) was named John Utah.", "Was set to reprise his role as Jack Traven in the sequel to _Speed (1994)_ (qv) - _Speed 2: Cruise Control (1997)_ (qv) - but dropped out.", "Took a 90% pay cut on his salary on _The Replacements (2000)_ (qv) so 'Gene Hackman' (qv) could be cast. Previously, he had deferred $2 million of his salary so that 'Al Pacino' (qv) could be cast on _The Devil's Advocate (1997)_ (qv).", "Resides in the Hollywood Hills area, Los Angeles, California, and is said to maintain an apartment in Manhattan as well.", "Learned over 200 martial arts moves for _The Matrix Reloaded (2003)_ (qv).", "Played (bass) in the band Becky which also featured 'Robert Mailhouse' (qv) (drums), 'Paulie Kosta' (qv) (guitar) and 'Rebecca Lord' (qv) (vocals).", "Was originally offered the role of Private Chris Taylor in _Platoon (1986)_ (qv), which he turned down. The role went to 'Charlie Sheen' (qv).", "Was originally cast as Chris Shiherlis in _Heat (1995)_ (qv) but later backed out of the project. The role went to 'Val Kilmer' (qv).", "He attended high school at North Toronto, where his drama teacher was Paul Robert.", "Frequently plays men either strapped or sitting in a chair while some type of procedure is performed on him. All three Matrix films, _Johnny Mnemonic (1995)_ (qv), _Feeling Minnesota (1996)_ (qv), _Bram Stoker's Dracula (1992)_ (qv), _Constantine (2005)_ (qv), _A Scanner Darkly (2006)_ (qv), _The Day the Earth Stood Still (2008)_ (qv), _John Wick (2014)_ (qv).", "He was awarded a Star on the Hollywood Walk of Fame at 6801 Hollywood Boulevard in Hollywood, California on January 31, 2005.", "Read the script of _Constantine (2005)_ (qv) while filming _The Matrix Revolutions (2003)_ (qv).", "His first theater work was with Shakespeare and Company in Lenox, Massachusetts in \"The Tempest\".", "He learned to surf for his role in _Point Break (1991)_ (qv)", "Very good friends with his Bill & Ted co-star, 'Alex Winter' (qv) and has remained in contact with him. Keanu has also contributed cameo appearances and helped with a number of Winter's film projects.", "His best friend is his younger sister 'Kim Reeves' (qv).", "Has recently left the band Becky with former Dogstar bandmate 'Robert Mailhouse' (qv), due to scheduling conflicts.", "Auditioned for the Etobicoke School of the Arts in Etobicoke, Toronto, Ontario, Canada; but was rejected.", "Replaced 'Val Kilmer' (qv) as the title role in _Johnny Mnemonic (1995)_ (qv) when Kilmer left the project upon being offered the role of Bruce Wayne in _Batman Forever (1995)_ (qv). Ironically, Kilmer later replaced Reeves as Chris Siherlis in _Heat (1995)_ (qv).", "His best friend was actor 'River Phoenix' (qv). He is also friends with River's brother 'Joaquin Phoenix' (qv).", "His parents married in Hawaii and divorced in 1966. His mother later remarried 'Paul Aaron' (qv) (divorced in 1971) and Robert Miller (between 1976 and 1980).", "The character of Jimbo Jones on _The Simpsons (1989)_ (qv) is based on his character from _Bill & Ted's Excellent Adventure (1989)_ (qv).", "Lent one of his basses (a yellow Fender) to be used in the music video, \"100%\", by 'Sonic Youth' (qv), to bassist 'Kim Gordon' (qv).", "Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#28) (2007).", "Has played a former quarterback from the Ohio State University in two films: _Point Break (1991)_ (qv) and _The Replacements (2000)_ (qv).", "Turned down the role of Racer X in _Speed Racer (2008)_ (qv), which eventually went to 'Matthew Fox' (qv).", "'Joel Schumacher' (qv) considered him for the role of The Scarecrow (Jonathan Crane) in the fifth Batman movie had Schumacher gone on to direct Batman 5. The failure of _Batman & Robin (1997)_ (qv) prevented that from happening.", "Is an avid fan of Formula 1 and IndyCar racing.", "Was good friends with the late 'Anthony Quinn' (qv). They starred together in _A Walk in the Clouds (1995)_ (qv).", "Currently resides in Los Angeles, California.", "Close friends with _Speed (1994)_ (qv) co-star 'Sandra Bullock' (qv). He also was among the guests at her wedding to 'Jesse James' (qv) (2005).", "Keanu's father, who is an American from Hawaii, has English, Native Hawaiian, Portuguese, Scottish, and Chinese ancestry, with distant Dutch roots. Keanu's mother is English.", "Has named 'Peter O'Toole' (qv) as the actor who has influenced him the most.", "Is dyslexic.", "(August 4, 2001) Played baseball in the Dodgers Stadium, for the 43rd Hollywood Stars Celebrity Baseball Game. His team won 5 to 4. This was the first time Keanu played baseball.", "Played ice hockey for the California Senior Hockey League (1995).", "When Reeves first arrived in Hollywood, his agent thought his first name was too exotic, so during the early days of his film career he is sometimes credited as K.C. Reeves, Norman Kreeves or Chuck Spadina.", "Was raised in Beirut (since birth until six months), Sydney (until age 3), Upper West Side (Manhattan, New York, until age 6) and in Toronto (until age 21).", "Could have been a professional ice hockey player for the Canadian League, could have tried out for the Windsor Spitfires Ontario Hockey League, but set his heart on acting, leaving hockey as a hobby.", "Decided to become an actor at age 15 when he was doing Romeo and Juliet in 10th grade.", "Was trained for four months in martial arts (kung-fu) for _The Matrix (1999)_ (qv) (1998).", "Speaks French fluently.", "Attended the premiere of _The Day the Earth Stood Still (2008)_ (qv) in Tokyo, Japan. [December 2008]", "Attended the 2008 Bambi 'Awards' (qv) in Offenburg, Germany. [November 2008]", "Attending the IndyCar Long Beach Grand Prix as a guest of honor. [April 2009]", "Attended a press conference for _The Day the Earth Stood Still (2008)_ (qv) in Mexico City, Mexico. [December 2008]", "Attended the 59th Berlin International Film Festival in Germany. [February 2009]", "Announced that he is teaming up with friend Gard Hollinger of L.A. County Choprods to launch the Arch Motorcycle Company. [October 2012]", "Attended press conferences for _The Day the Earth Stood Still (2008)_ (qv) in Paris, France and Madrid, Spain. [November 2008]", "He starred in three films with actor 'Udo Kier' (qv): _My Own Private Idaho (1991)_ (qv), _Even Cowgirls Get the Blues (1993)_ (qv) and _Johnny Mnemonic (1995)_ (qv).", "'Stanley Kubrick' (qv), 'David Lean' (qv), 'Frank Capra' (qv) and 'Martin Scorsese' (qv) are some of his favorite filmmakers.", "Is jokingly considered to be immortal due to striking resemblances to Vlad the Impaler and Paul Manet.", "Had a bathtub scene in two films with 'Rachel Weisz' (qv), where she sits in the tub with clothes on and he is outside the tub: _Constantine (2005)_ (qv) and _Chain Reaction (1996)_ (qv).", "Writes left-handed, but shoots a gun or performs other actions with his right hand. In _The Matrix (1999)_ (qv), he signs for the package with his left hand, but opens the package and holds the phone with his right hand.", "He is a popular subject of jokes on the internet due to not having aged very visibly over the course of his career with many joking that he is immortal.", "He was among the actors considered for the role of Wolverine in X-Men (2000) before Hugh Jackman was cast.", "For a Halloween party as a teenager, Keanu once wore the bunny costume his mother 'Patricia Taylor' (qv) had designed for 'Dolly Parton' (qv)'s 1978 Playboy magazine cover.", "Considered for the role of Johnny Rico in _Starship Troopers (1997)_ (qv).", "In 1991, he coincidentally co-starred in two movies that featured members of the band Red Hot Chili Peppers in minor roles. 'Flea' (qv) starred in _My Own Private Idaho (1991)_ (qv) and 'Anthony Kiedis' (qv) starred in _Point Break (1991)_ (qv).", "Has a fear of the dark."], "quotes": ["What would happen if you melted? You know, you never really hear this talked about much, but spontaneous combustion? It exists!...[people] burn from within...sometimes they'll be in a wooden chair and the chair won't burn, but there'll be nothing left of the person. Except sometimes his teeth. Or the heart. No one speaks about this, but its for real.", "My name can't be *that* tough to pronounce!", "When I don't feel free and can't do what I want I just react. I go against it.", "[when told he would have to \"bite the bullet\"] Yes, but I don't have to eat the whole rifle.", "I'm a meathead, man. You've got smart people, and you've got dumb people. I just happen to be dumb.", "I'm sorry my existence is not very noble or sublime.", "[on being a star] It can still be very surreal. It's easy to become very self-critical when you're an actor. Then you get critiqued be the critics. Whether you agree with them or not, people are passing judgment on you.", "[on drugs] I've had wonderful experiences. I mean really wonderful. In teaching. Personal epiphanies. About life. About a different perspective -- help with different perspectives that you have. You know what I mean? Relationships to nature. Relationships with the self. With other people. With events.", "[when asked if he had any fears] I used to have nightmares that they would put \"He played Ted\" on my tombstone.", "I'm Mickey Mouse. They don't know who's inside the suit.", "Here comes 40. I'm feeling my age and I've ordered the Ferrari. I'm going to get the whole mid-life crisis package.", "It's always wonderful to get to know women, with the mystery and the joy and the depth. If you can make a woman laugh, you're seeing the most beautiful thing on God's Earth.", "[on 'River Phoenix' (qv)] You can't blame Hollywood for what happened to River. Kids are doing drugs everywhere in the world. He had his own very personal problems I will never discuss with the press. They're just way too personal. River had a self-destructive side to his personality. He was angry and hurt that he couldn't have a private life once he became famous. He just couldn't deal with having his private life on the front page all the time.", "[on 'River Phoenix' (qv)] River was a remarkable artist and a rare human being. I miss him every day.", "[on 'River Phoenix' (qv) and _My Own Private Idaho (1991)_ (qv)] We were doing _I Love You to Death (1990)_ (qv), and we got the Idaho script. We were driving in a car on Santa Monica Boulevard, probably on the way to a club, and were talking really fast about the whole idea. We were excited. It could have been like a bad dream, a dream that never follows through because no one commits, but we just forced ourselves into it. We said, \"Okay, I'll do it if you do it. I won't do it if you don't.\" We shook hands. That was it.", "[on 'Patrick Swayze' (qv) and working with him on _Point Break (1991)_ (qv)] He was a beautiful person, an artist! Patrick, he just wanted to experience life and, for his work, he wanted to take the opportunity of the film and it gave him that sense. There was some sky diving sequences in this film we did together and as filming was going on it came to be that Patrick was jumping out of airplanes all the time. I think he had over 30 jumps during the course of filming and so the production served him with a cease and desist which he listened to until they got to Hawaii. He jumps out of planes and did the flips and falling to the ground and he did it with an open heart. I'll always remember his buddy for lighting up a room with his presence. I can say what I know that he lived life to the fullest.", "[1995, on his idea of happiness] Lying in bed with my lover, riding my bike, sports, happy times with my friends, conversation, learning, the earth, dirt, a beautiful repast with friends, family with wine and glorious food and happy tidings and energy and zest and lust for life. I like being in the desert, in nature, being in extraordinary spaces in nature, high in a tree or in the dirt, hanging out with my family, my sisters.", "[1995] L.A. has been my place of abode for seven years and I have a little place in New York City. I don't even have a house house, but I have been living in the same place in Los Angeles for a couple of years and it's just now becoming a home. I like to be free and unfettered. I like the option of being able to do anything and go anywhere, anytime. I like to have my house open. A lot of my friends have keys to my houses and I like to have everything, you know, 'What's mine is yours,' and to drink wine, talk and hang out.", "[1995, on _My Own Private Idaho (1991)_ (qv)' You know what's great? Right after I finished _Bram Stoker's Dracula (1992)_ (qv), I went to Paris to visit a couple of friends, shipped over one of my Norton's, my '72 750 with California plates, and just hung out for two-and-a-half weeks. _My Own Private Idaho (1991)_ (qv) had just opened at a theater right near my friend's house where I was staying. I got stopped by a couple of American students who'd seen it and they bought me a beer. Which is what you should do in Paris: sit in cafés, talk, hang out. I had miraculous weather, so it didn't rain on my parade. Then, I went to New York to visit friends, sat down, hung out, and the same sort of thing happened there. So, do I want more movies that lead to experiences like that? Yes, please.", "[on auditioning for 'Oliver Stone' (qv)'s _The Doors (1991)_ (qv)] I auditioned a few times, but I don't think I was ever seriously in the running. I was terrified. I just read some of 'Jim Morrison' (qv)'s poetry and listened to some of his music and did what I could.", "[1992] It's only very recently that I've been approached with, 'Would you like to do this?' Mostly, I'm still auditioning, which there's something to be said for. Up to now, my only real choices have been: 'Hmmmm, an audition, go or not go? Go!' I auditioned seven times for _Bill & Ted's Excellent Adventure (1900)_ and all the 'finalists' had to read with everyone else-me, 'Pauly Shore' (qv), 'Josh Richman' (qv), 'Alex Winter' (qv) and others. I met with 'Francis Ford Coppola' (qv) three times before he asked me if I wanted to play the part in _Bram Stoker's Dracula (1992)_ (qv).", "[on his beliefs] Sure I believe in God and the Devil but they don't have to have pitchforks and a long white beard.", "[on directing himself as a villain in _Man of Tai Chi (2013)_ (qv) The first day was not fun, because one is so objective and one is so subjective. As an actor, you only have your responsibility to your role within the whole, and the director has a responsibility to the whole and you in it. So it's a different mindset. And you're literally, physically, in two different spaces.", "[on the possibility of Bill and Ted 3] It's a long story. There's lots of subterfuge and conspiracy theories. There's a whole thing... I might have to do one of those independent press, conspiracy, other-name kind of [statements] explaining why it hasn't happened yet, because it's pretty dark out there... There is [a script]. There's all sorts of stuff and it just can't - it's just - there's darkness out there that's keeping it from happening... It's that part of the story where it's looking grim. It's the dark period of the idea!", "[on turning down _Speed 2: Cruise Control (1997)_ (qv)] They said, \"You've got to do this\", And I said, \"I read the script and I can't. It's called Speed and it's on a cruise ship.\" I didn't work at Fox for 15 years.", "[on why he turn down the opportunity to reprise his role as Jack Traven for _Speed 2: Cruise Control (1997)_ (qv)] I didn't get to be in that. Well, I decided not to be in that. I loved working with 'Jan de Bont' (qv) and Sandra, of course. It was just a situation in life where I got the script and I read the script and I was like \"ugggghhh\". It was about a cruise ship and I was thinking, a bus, a cruise ship... Speed, bus, but then a cruise ship is even slower than a bus and I was like, I love you guys but I just can't do it.", "I love riding my bike through Los Angeles on the Pacific Coast Highway. I also go to the Santa Monica Mountains. It is like losing myself, like playing a musical instrument or any other pastime that takes away regular cares and responsibilities.", "[on what would surprise people about him] I read a lot. I have just finished Proust's A La Recherche Du Temps Perdu and John Updike's Rabbit novels. That was cool, reading literature looking at America over the past 40 years.", "[I am trying to give up] smoking. I didn't even start until I was 30. I got hooked making Feeling Minnesota and now it's a prison, but I want to stop.", "I never cared about the money, that's not why I started acting, and I never liked the fame. The paparazzi culture is more pervasive than it used to be, kind of: 'Let's watch the actor pump gas.' It's nice not to have to worry about bills, though. It's a cliche that money doesn't buy you happiness, but it does buy you the freedom to live your life the way you want. Knock on wood, I've been very fortunate: I've been able to earn a really good living and start a charity foundation, which is nice.", "As a kid, I didn't dream of becoming a movie star. No, I dreamt of travelling to distant planets in flying machines. I loved acting, though, and by the time I was a teenager, it was something I wanted to do with my life. I was acting professionally by the time I was 16. I grew up around the business - my stepfather was a director, my mother was a costume designer - but I also loved sport and, at one point, thought of doing that as a career. I played hockey, basketball and baseball.", "[on his biggest challenge] Settling down. I am pretty nomadic. Staying in one place is hard for me. I've rented homes before and I've stayed in hotels - I was in a hotel for almost four years in the early Nineties - but the road has also been my home. I was in Australia for 16 months doing _The Matrix Revolutions (2003)_ (qv) and _The Matrix Reloaded (2003)_ (qv). I've made more than 40 films, so if you think that each of those take three to four months minimum, living in a trailer, it works out at quite a few years on the road!", "[on whether he thinks he takes after his mother] Yes, my mother is the one who raised me - she is a very independent woman and she probably passed that on. She is from Hampshire, she left England when she was very, very young - 14 or 15 - but she gave me some English manners. She taught me which side the fork went on the plate, but also there was the two-fingers attitude, an irreverence. I love the irreverence and the word play of British humour and the social commentary. I was raised on _The Two Ronnies (1971)_ (qv) and Monty Python.", "I don't shop a lot, but I do like nice clothes and, I guess, if I have a look it is suits and T-shirts with casual boots. I like to have a suit that fits well. I wear Kiton, Costume National and Gucci once in a while.", "Mortality is very different when you're 20 to when you're 50.", "How do people relate to movies now, when they're on portable devices or streaming them? It's not as much about going to the movies. That experience has changed.", "I've been really fortunate to be able to do different kinds of films in different scales, different genres, different kinds of roles, and that is important to me.", "I am waiting for the right story to tell. Just like 'Man of Tai Chi' just seemed to be the right story to tell. So I'm looking for that. Because I really love directing. I love developing the story. I love actors. I love the cinema of it, the way that you tell a story visually.", "I believe in love at first sight. You want that connection, and then you want some problems.", "I've been pleased to work with so many wonderful stars through the years. This has been an amazing journey. I hope it continues.", "I am not handsome or sexy. Of course, it's not like I am hopeless.", "I don't know the law, the kind of law of quantity and quality, but I think the opportunity of people being able to express themselves and to have the means of production is a great thing. It's also changing how we're telling stories.", "People were saying that David Geffen and I had gotten married and it just blew me away. Not that they thought I was gay, but that they thought I could land a guy that hot.", "It's the journey of self, I guess. You start with this kind of loner, outside guy, which a lot of people can relate to, and he goes out into the world.", "I want to make a good, solid kung fu movie.", "I mean, if you didn't get it or if you didn't feel like you enjoyed it, sometimes that experience can change.", "But I did 'Bill & Ted's Excellent Adventure'. They made a cereal out of it, so once you've had a cereal, it doesn't get much more surreal than that. Surreal cereal.", "I have definitely been curious and involved in the process; even as a young actor. I was always looking at where the camera was, what story it was telling. And as my experience grew, I wanted to know even more.", "When the people you love are gone, you're alone.", "You know what, I'd done an interview show when I was like 16 or 17. One of my first jobs. I did interviews for this television show in Toronto.", "Letters are something from you. It's a different kind of intention than writing an e-mail.", "And of course to work with Jack Nicholson and Diane Keaton, and work with a wonderful, beautiful script directed by Nancy Meyers, it was really for me a dream come true.", "But, you know, it's still a drag to get your picture taken when you're eating a sandwich. It's a downer.", "When we talk about how movies used to be made, it was over 100 years of film, literal, physical film, with emulsion, that we would expose to light and we would get pictures.", "On a good night, I get underwear, bras, and hotel-room keys thrown onstage... You start to think that you're Tom Jones.", "I do think there must be some kind of interaction between your living life and the life that goes on from here.", "The simple act of paying attention can take you a long way.", "It's fun to be hopelessly in love. It's dangerous, but it's fun.", "Falling in love and having a relationship are two different things.", "I think the form, the Hollywood movie, I think the quality is obviously always going to be there and I think that the question of taste, there's always a question of taste.", "I think - I don't know, maybe it's nostalgia. But the choice, losing the choice to be able to use film is going to be - it's gone. It's going to be gone.", "I mean, I went to a Catholic boys' school for a year, but that was to play hockey. Religion class was quite contentious for me.", "Grief changes shape, but it never ends.", "I try not to think about my life. I have no life. I need therapy.", "Because we're actors we can pretend and fake it, but I'd rather the intimate investment was authentic.", "Artists are losing the choice to use film. People have a love for it - the grain, how it feels, the texture.", "The truth is often terrifying, which I think is one of the motifs of Larry and Andrew's cinema. The cost of knowledge is an important theme. In the second and third films, they explore the consequences of Neo's choice to know the truth. It's a beautiful, beautiful story.", "I have a producing partner named Stephen Hamel, and we've been trying to generate material.", "I just felt that if I went into Speed 2, I just... wouldn't have come up out of the water.", "Kissing someone is pretty intimate, actually very intimate, and your heart always kind of skips a beat before you do that.", "It's easy to become very self-critical when you're an actor. Then you get critiqued by the critics. Whether you agree with them or not, people are passing judgment on you.", "The whole aspect of cinema and film festivals should be a moment to come together and celebrate art and humanity. It would be a shame if there was such a divide.", "Energy can't be created or destroyed, and energy flows. It must be in a direction, with some kind of internal, emotive, spiritual direction. It must have some effect somewhere.", "I was always interested - I mean, it's kind of part of your job - I was always interested in the camera.", "Sometimes when you make a film you can go away for three months and then come back and live your life. But this struck a much deeper chord. I don't have the ability yet to speak about it in an objective.", "But I think we're also just talking about the literacy of the audience. The visual literacy of the audience. They've seen so many images now, especially here in the States. There's so much to look at, to watch. So the visual storytelling literacy is harder to impress.", "I had the classic 40 meltdown. I did. It's embarrassing. It was pretty funny. But then I recovered. To me, it was like a second adolescence. Hormonally, my body was changing, my mind was changing, and so my relationship to myself and the world around me came to this assault of finiteness.", "I've had the opportunity to work with so many great directors. Different styles, as well, like Gus Van Sant. He just does the casting and the milieu and lets you do your thing, quietly. Bertolucci, who can talk to you about your internal world in quite a creative way or just say, 'Well, put your hand over here.'", "How do I confront aging? With a wonder and a terror. Yeah, I'll say that. Wonder and terror.", "Money doesn't mean anything to me. I've made a lot of money, but I want to enjoy life and not stress myself building my bank account. I give lots away and live simply, mostly out of a suitcase in hotels. We all know that good health is much more important.", "I'm not a photographer, so I didn't get into F-stops or ND filters or background, foreground, cross-light, all that stuff. But I was interested in the camera and the lenses. That's the world that I'm moving in, in terms of acting and giving a performance.", "[answering Stephen Colbert's question made on _The Late Show with Stephen Colbert (2015)_ (qv) about what happens when people die] I know that the ones who loves us will miss us.", "You're breathtaking! You're all breathtaking!"], "salary history": ["_Youngblood (1986)_ (qv)::$3,000", "_Speed (1994)_ (qv)::$1,200,000", "_Johnny Mnemonic (1995)_ (qv)::$2,000,000", "_The Devil's Advocate (1997)_ (qv)::$8,000,000", "_The Matrix (1999)_ (qv)::$10,000,000 + 10% of the gross", "_The Replacements (2000)_ (qv)::$12,500,000", "_The Matrix Reloaded (2003)_ (qv)::$15,000,000 + 15% of the gross", "_The Matrix Revolutions (2003)_ (qv)::$15,000,000 + 15% of the gross"], "birth date": "1964-09-02", "birth notes": "Beirut, Lebanon", "_actorID": "69", "_source": "IMDB", "actorID": "0000206", "created_utc_dt": "08/26/2019, 21:54:33"}