{"headshot": "https://m.media-amazon.com/images/M/MV5BMjM4ODU5MDY4MV5BMl5BanBnXkFtZTgwODY1MjQ5MDI@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Carrie Frances Fisher", "height": "5' 1\" (1.55 m)", "mini biography": ["Carrie Frances Fisher was born on October 21, 1956 in Burbank, California, to singers/actors 'Eddie Fisher' (qv) and 'Debbie Reynolds' (qv). She was an actress and writer known for _Star Wars: Episode IV - A New Hope (1977)_ (qv), _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv) and _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv). Fisher is also known for her book, \"Postcards from the Edge\", and she wrote the screenplay for the movie based on her novel. 'Carrie Fisher' (qv) and talent agent 'Bryan Lourd' (qv) have a daughter, 'Billie Lourd' (qv) (Billie Catherine Lourd), born on July 17, 1992.::Jen Kilmer"], "spouse": ["'Paul Simon' (qv)::(16 August 1983 - 1984) ( divorced)"], "trade mark": ["Princess Leia Organa in the Star Wars films", "Often played smirking, sarcastic characters", "Large brown eyes", "Her husky voice, which grew much deeper over time.", "Small petite figure", "Her sharp sarcastic sense of humor"], "trivia": ["In 1998, she checked into a substance-abuse program for addiction to prescription drugs.", "Daughter of 'Eddie Fisher' (qv) and 'Debbie Reynolds' (qv).", "Her father, 'Eddie Fisher' (qv), left her mother, 'Debbie Reynolds' (qv), when Carrie was two years old in order to marry 'Elizabeth Taylor' (qv).", "Mother, with 'Bryan Lourd' (qv), of daughter 'Billie Lourd' (qv) (Billie Catherine Lourd), born on July 17, 1992.", "Older half-sister of 'Joely Fisher' (qv) and 'Tricia Leigh Fisher' (qv). Older sister of 'Todd Fisher' (qv).", "The punk rock group 'Blink-182' (qv) wrote a song called \"A New Hope\", in which her _Star Wars: Episode IV - A New Hope (1977)_ (qv) character Princess Leia is the lead singer's dream girl.", "She made her stage debut in 1975 in the chorus of the musical Irene, which starred her mother, 'Debbie Reynolds' (qv).", "Half-sister-in-law of 'Christopher Duddy' (qv) and 'Byron Thames' (qv).", "Attended the Central School of Speech and Drama in London.", "Appeared in _Jay and Silent Bob Strike Back (2001)_ (qv), which also starred 'Mark Hamill' (qv). It was the first time the two had appeared in the same film since _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv). Neither of them knew the other was involved in the project until shortly after filming had been completed. They would later reunite again in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv).", "She did her very first European signing in London, England in a hotel library on August 3, 2003. It was an exclusive one-day signing, and tickets limited to 500.", "She has confirmed in her autobiography that she disliked the \"bagel bun\" hairstyle she wore in the original _Star Wars: Episode IV - A New Hope (1977)_ (qv). However, prior to filming, the studio had requested that she lose some weight first, which she hadn't. Out of fear of being fired for it, she was eager to comply with everything that director 'George Lucas' (qv) suggested, which included the hairstyle.", "When asked to choose her favorite moment from the original _Star Wars: Episode IV - A New Hope (1977)_ (qv) trilogy, she explained that her favorite moments were the arguing scenes between her and 'Harrison Ford' (qv).", "She had to stand on a box for many of her scenes with 'Harrison Ford' (qv) in the original _Star Wars: Episode IV - A New Hope (1977)_ (qv) trilogy because she was roughly a foot shorter than him and did not fit into the frame.", "Former stepdaughter of 'Connie Stevens' (qv), 'Harry Karl' (qv) and 'Elizabeth Taylor' (qv).", "She was diagnosed with bipolar disorder and spoke on this topic to thousands of psychiatrists assembled for the American Psychiatric Association's Annual Meeting in May 2004 in New York City.", "She was listed as a potential nominee on the 2006 Razzie Award nominating ballot in the category of the Worst Supporting Actress category for her performance in the film _Undiscovered (2005)_ (qv), however, she failed to receive a nomination.", "Weighed 7 lbs 2 ozs at birth.", "Her mother, 'Debbie Reynolds' (qv), lived next door to her for most of her life.", "She was once engaged to 'Dan Aykroyd' (qv).", "She has one daughter, 'Billie Lourd' (qv), whose father is the film agent, 'Bryan Lourd' (qv). Fisher and Lourd never married. After he left her for a man, she used the experience as the opening premise for her novel, The Best Awful.", "She wrote several novels, including the semi-autobiographical Postcards from the Edge, a thinly veiled study of the relationship between Fisher and her mother, 'Debbie Reynolds' (qv). It later became the film _Postcards from the Edge (1990)_ (qv), which starred 'Meryl Streep' (qv) and 'Shirley MacLaine' (qv) in the Fisher and Reynolds roles respectively.", "She revealed in her memoir Wishful Drinking that she once had a romantic relationship with U.S. Senator 'Chris Dodd' (qv) (D-Connecticut). When Dodd was asked for a comment by a reporter from The Kansas City Star in 2007, he explained that \"it was a long, long time ago in a galaxy far, far away.\".", "She was good friends with 'Michael Jackson' (qv) and 'Meryl Streep' (qv). Streep portrayed Fisher in _Postcards from the Edge (1990)_ (qv).", "In her 2008 memoir Wishful Drinking, she noted that, like her mother in _Singin' in the Rain (1952)_ (qv), she became famous at age 19 for her role in a classic hit alongside two male co-stars. She also mentioned that the title of _Star Wars: Episode IV - A New Hope (1977)_ (qv) could also refer to her celebrity parents' infamous divorce.", "Her personal assistant was 'Kim Painter' (qv).", "She was author 'William Goldman' (qv)'s first choice for the character Buttercup in _The Princess Bride (1987)_ (qv), a role which went to 'Robin Wright' (qv) instead.", "She was longtime friends with 'Miguel Ferrer' (qv), who encouraged her and helped her prepare for her _Star Wars: Episode IV - A New Hope (1977)_ (qv) audition. Their mothers - 'Debbie Reynolds' (qv) and 'Rosemary Clooney' (qv) respectively - were both best known for their performances in hit 1950s musicals: _Singin' in the Rain (1952)_ (qv) and _White Christmas (1954)_ (qv).", "She continued to date 'Paul Simon' (qv) for 8 years after their divorce, until finally breaking up in 1991.", "She appeared in _Star Wars: Episode IV - A New Hope (1977)_ (qv) parody episodes of both _Family Guy (1999)_ (qv) and _Robot Chicken (2005)_ (qv). She played Mon Mothma, one of the few other female characters in the series. In the latter series, Princess Leia - now played by 'Alex Borstein' (qv) - says: \"I don't like her\".", "Sister-in-law of 'Catherine Hickland' (qv), and ex-sister-in-law of 'Donna Jean Freberg' (qv) and 'Donavan Freberg' (qv).", "Her paternal grandparents were Russian Jewish immigrants. Her mother had English, some Scottish, Scots-Irish (Northern Irish), and German, and distant French, ancestry.", "She wrote her own scene for her cameo appearance in _Scream 3 (2000)_ (qv).", "In 1990, she sold the big screen rights to her book, Surrender the Pink, to Warner Bros. for $1 million. 'Steven Spielberg' (qv) was producing, with 'Demi Moore' (qv) attached to star. Fisher wrote the screenplay, but the project stalled in development.", "In 1994, she did a rewrite of the script of _Intolerable Cruelty (2003)_ (qv), shortly after the original script sold. The Coen Brothers rewrote the script years later and none of Fisher's work remained in the finished film.", "She accomplished a 35-pound weight loss in her preparation for _Star Wars: Episode VII - The Force Awakens (2015)_ (qv).", "She admitted that she found it difficult to act opposite 'Peter Cushing' (qv) in _Star Wars: Episode IV - A New Hope (1977)_ (qv) for two reasons: she thought the dialog was awful, and Cushing was so nice and polite to her on set between takes that she found it very difficult to show the disdain her character, Princess Leia, felt towards Cushing's character, Grand Moff Tarkin.", "Her French bulldog Gary accompanied her everywhere, even onto TV talk show sets whenever she was a guest.", "She auditioned for the lead role in _Carrie (1976)_ (qv), while 'Sissy Spacek' (qv) auditioned for Princess Leia in _Star Wars: Episode IV - A New Hope (1977)_ (qv), as 'George Lucas' (qv) and 'Brian De Palma' (qv) were holding joint auditions. They ultimately swapped roles. Contrary to popular belief, Fisher did not turn down Spacek's role because of the nudity involved.", "In her 2016 autobiography The Princess Diarist, Fisher wrote that she and 'Harrison Ford' (qv) had a three-month affair during the filming of _Star Wars: Episode IV - A New Hope (1977)_ (qv) in 1976.", "Her final acting project was the third season of _Catastrophe (2015)_ (qv). She was the only cast member allowed to improvise and her own real life dog Gary portrays her dog on the show. She passed away a week after finishing work on the show.", "She co-starred with her daughter, 'Billie Lourd' (qv), in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv) and _Star Wars: The Last Jedi (2017)_ (qv). Lourd auditioned without Fisher's awareness.", "On the day after Carrie died, her grief-stricken mother 'Debbie Reynolds' (qv) suffered a stroke, and also passed away.", "She was well known for her sense of humor and quick wit. One of her father 'Eddie Fisher' (qv)'s first hits in the 1950s was a song entitled \"Oh! My Pa-Pa\". Her father, of course, had a scandalous affair with 'Elizabeth Taylor' (qv) and ultimately left her mother, 'Debbie Reynolds' (qv) to marry Taylor. When Fisher and Reynolds were making a joint television appearance, Fisher quipped that her mother could sing, too, and should have written and sang a song entitled, \"Oh! My Faux Pas\".", "She suffered an ectopic pregnancy whilst married to 'Paul Simon' (qv) in May 1984.", "She was considered for 'Kelly McGillis' (qv)'s roles in _Top Gun (1986)_ (qv) and _The Accused (1988)_ (qv).", "As well as working as a script doctor for films, she also polished scripts for 'George Lucas' (qv)' television series _The Young Indiana Jones Chronicles (1992)_ (qv). Lucas had directed Fisher as Princess Leia in the original _Star Wars: Episode IV - A New Hope (1977)_ (qv) trilogy. There exists a Stars Wars script purported to be hers, which shows extensive pen and ink changes to the dialog, perhaps marking the beginning of the script doctor part of her career. Lucas later hired her to polish the scripts of the original trilogy's prequels _Star Wars: Episode I - The Phantom Menace (1999)_ (qv), _Star Wars: Episode II - Attack of the Clones (2002)_ (qv), and _Star Wars: Episode III - Revenge of the Sith (2005)_ (qv).", "She was considered to star opposite her mother 'Debbie Reynolds' (qv) in _The Exorcist (1973)_ (qv).", "She died the same year as her _Star Wars: Episode IV - A New Hope (1977)_ (qv) co-star 'Kenny Baker' (qv).", "The character her daughter, 'Billie Lourd' (qv), plays in _Scream Queens (2015)_ (qv) is always seen wearing a pair of ear muffs, a tribute to Fisher's iconic hairstyle in her role as Princess Leia in _Star Wars: Episode IV - A New Hope (1977)_ (qv) and its sequels.", "In addition to her credited screenplay adaptation of her novel Postcards from the Edge and a credit on _Roseanne: Arsenic and Old Mom (1997)_ (qv), Fisher was for several years a highly sought-after, highly paid, uncredited Hollywood script doctor. Fisher did uncredited rewrites on such screenplays as _Hook (1991)_ (qv), _Sister Act (1992)_ (qv), _Last Action Hero (1993)_ (qv), _Lethal Weapon 3 (1992)_ (qv), _The Wedding Singer (1998)_ (qv), _Scream 3 (2000)_ (qv) (in which she also had a small role as Bianca), and the 1999-2005 Star Wars prequels.", "Was best friends with 'Richard Dreyfuss' (qv).", "Was good friends with 'Courtney Love' (qv), and 'Stephen Fry' (qv).", "(June 16, 2017) Her death was caused by sleep apnea and other undetermined factors, the Los Angeles County Coroner's Office revealed.", "In her later years, Fisher had an emotional support animal, a French Bulldog named Gary, whom she brought to numerous appearances and interviews. Following her death, reports indicated that Fisher's daughter 'Billie Lourd' (qv) would take care of Gary.", "In 2016, Harvard College gave Fisher its Annual Outstanding Lifetime Achievement Award in Cultural Humanism, noting that \"her forthright activism and outspokenness about addiction, mental illness, and agnosticism have advanced public discourse on these issues with creativity and empathy.\".", "In an interview with the New York Times, she revealed that she made 'George Lucas' (qv) give her a copy of _The Star Wars Holiday Special (1978)_ (qv) in exchange for recording DVD commentary for the Star Wars films. She added that she showed it at parties, \"mainly at the end of the night when I want people to leave.\".", "Fisher described herself as an \"enthusiastic agnostic who would be happy to be shown that there is a God\". She was raised Protestant, but often attended Jewish services (her father's faith) with Orthodox friends.", "She was originally contracted to portray Miss Scarlet in _Clue (1985)_ (qv), but withdrew to enter treatment for drug and alcohol addiction. 'Lesley Ann Warren' (qv) was cast instead.", "She hosted the episode of _Saturday Night Live (1975)_ (qv) that featured the first appearance of the Blues Brothers and appeared in _The Blues Brothers (1980)_ (qv).", "She was a spokesperson for Jenny Craig weight loss television ads that aired in January 2011.", "In her 2016 autobiography \"The Princess Diarist\", Fisher wrote that she and 'Harrison Ford' (qv) had a three-month affair during the filming of _Star Wars: Episode IV - A New Hope (1977)_ (qv) in 1976.", "She has the last line in her last movie _Star Wars: The Last Jedi (2017)_ (qv): \"We have everything we need.\".", "She was considered for the role of Linda in _Arthur (1981)_ (qv) which went to 'Liza Minnelli' (qv).", "She turned down the role of Emmeline Lestrange in _The Blue Lagoon (1980)_ (qv) which went to 'Brooke Shields' (qv) in order to star in _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv). She was also considered for Shields' roles in _Pretty Baby (1978)_ (qv) and _Endless Love (1981)_ (qv).", "She was considered for the role of Annie in _Speed (1994)_ (qv) which went to 'Sandra Bullock' (qv).", "She was considered for the role of Deborah Gelly in _Once Upon a Time in America (1984)_ (qv) which went to 'Elizabeth McGovern' (qv).", "She turned down the role of Sarah Connor in _The Terminator (1984)_ (qv) which went to 'Linda Hamilton' (qv).", "She was considered the role of Rizzo in _Grease (1978)_ (qv) which went to 'Stockard Channing' (qv).", "She was considered the role of Vicki Vale in _Batman (1989)_ (qv) which went to 'Kim Basinger' (qv).", "She was considered for the role of Catherine Tramell in _Basic Instinct (1992)_ (qv) which went to 'Sharon Stone' (qv).", "She was considered for the role of Iris in _Taxi Driver (1976)_ (qv) which went to 'Jodie Foster' (qv).", "She was considered for the role of Maerose Prizzi in _Prizzi's Honor (1985)_ (qv) which went to 'Anjelica Huston' (qv).", "She was considered for the role of Stephanie Mangano in _Saturday Night Fever (1977)_ (qv) which went to 'Karen Lynn Gorney' (qv).", "She was considered for the role of Alex Forrest in _Fatal Attraction (1987)_ (qv) which went to 'Glenn Close' (qv).", "She was considered for the role of Lois Lane in _Superman (1978)_ (qv) which went to 'Margot Kidder' (qv).", "She was considered for the role of Kate McCallister in _Home Alone (1990)_ (qv) which went to 'Catherine O'Hara' (qv).", "She was considered for the role of Thelma Dickinson in _Thelma & Louise (1991)_ (qv) which went to 'Geena Davis' (qv).", "She was considered for the role of Linda Barrett in _Fast Times at Ridgemont High (1982)_ (qv) which went to 'Phoebe Cates' (qv).", "She was considered for the role of Vivian Ward in _Pretty Woman (1990)_ (qv) which went to 'Julia Roberts' (qv).", "She was considered for the role of Elvira Hancock in _Scarface (1983)_ (qv) which went to 'Michelle Pfeiffer' (qv).", "She was considered for the role of Katharine Parker in _Working Girl (1988)_ (qv) which went to 'Sigourney Weaver' (qv).", "Fittingly, her most famous and popular role, Princess Leia, she played in only her second film and well as her final film.", "When her mother 'Debbie Reynolds' (qv) was going through her highly publicized divorce from Carrie's father 'Eddie Fisher' (qv), press crews were literally camped out around the clock on Reynolds' front lawn. To ingratiate herself to reporters, Reynolds would bring food and drinks out to them, often with her two toddlers Carrie and Todd in her arms. This childhood experience gave Carrie a level of comfort in dealing with media that few other movie stars have ever had.", "As of her death in 2016, she appeared in two films nominated for Best Picture Oscar: _Star Wars: Episode IV - A New Hope (1977)_ (qv) and _Hannah and Her Sisters (1986)_ (qv).", "Appeared in _The Blues Brothers (1980)_ (qv) (as the woman who kept trying to kill Jake Blues) & starred in _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv). Both films were released on the same day.", "Carrie appeared on To Tell the Truth 1990 episode 14-1 to identify her Housekeeper Gloria Crayton."], "quotes": ["I was street-smart, but unfortunately the street was Rodeo Drive.", "I have no ambitions as an actress. I'm going to do a day's work on _Scream 3 (2000)_ (qv), but that's all I can handle, a day's work.", "[on her father's gossipy 1999 autobiography] I'm going to have my DNA fumigated.", "I always wanted to do what my mother did-- get all dressed up, shoot people, fall in the mud. I never considered anything else.", "You can't find true affection in Hollywood because everyone does the fake affection so well.", "Females get hired along procreative lines. After 40, we're kind of cooked.", "[on merchandising for _Star Wars: Episode IV - A New Hope (1977)_ (qv)] I signed my likeness away. Every time I look in the mirror, I have to send ['George Lucas' (qv)] a couple of bucks.", "My father ['Eddie Fisher' (qv)] was a short Jewish man. My husband ['Paul Simon' (qv)] was a short Jewish man. Go figure.", "[on working with 'Harrison Ford' (qv) on _Star Wars: Episode IV - A New Hope (1977)_ (qv)] ['Mark Hamill' (qv)] was 24, I was 19 and he [Harrison] was 33. He was like the big man on campus. You looked at him and you said to yourself, \"He's going to be a star\".", "[on why gaffer's tape was sometimes used under her Princess Leia costume in _Star Wars: Episode IV - A New Hope (1977)_ (qv)] As we all know, there is no underwear in space.", "Acting engenders and harbors qualities that are best left way behind in adolescence. People-pleasing, going on those interviews and jamming your whole personality into getting the job, ingratiating yourself to people you wouldn't fucking spit on if they were on fire.", "[about the filming of _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv)] ['Mark Hamill' (qv)'] was off on Dagobah while ['Harrison Ford' (qv)] and I were were getting drunk in Cloud City.", "I was born into big celebrity. It could only diminish.", "Leia is not a real character. She is more of a caricature, and is somewhat one-dimensional. It's not really possible to write out a list of Princess Leia's likes and dislikes. I do know her favorite color, though, it's white. She wears white all the time. But that doesn't help me much.", "I've got a lot of photos of me when I was very young at parties with celebrities, but I don't really remember the people or when the photos were taken.", "I think of my body as a side effect of my mind.", "[on success] There is no point at which you can say, \"Well, I'm successful now. I might as well take a nap\".", "[on time] Instant gratification takes too long.", "[on experience] Maturity: A stoic response to endless reality.", "[on the cultural significance of her parents, ['Eddie Fisher' (qv) and 'Debbie Reynolds' (qv)] I don't know if they were culturally significant, but they were very popular. My mother and my father were America's sweethearts. They literally received that tag. Even my parents sort of went along with the assumption that they were a good couple, but they probably weren't a very good couple. Anyway, my father was best friends with a man named 'Mike Todd' (qv). 'Mike Todd' (qv) was married to 'Elizabeth Taylor' (qv). 'Mike Todd' (qv) died in a plane crash, and my father consoled 'Elizabeth Taylor' (qv) with his penis.", "[asked if the character Princess Leia was the dark side of the force in her professional career] Oh, no. It was fun! I was young. People want it to be a problem for me. No. Those are great movies. Why shouldn't I be proud of being in that? The dark side? You ever see _Hollywood Vice Squad (1986)_ (qv) or _The Star Wars Holiday Special (1978)_ (qv)? How about _Under the Rainbow (1981)_ (qv)? Was _Star Wars: Episode IV - A New Hope (1977)_ (qv) the dark side? There's so much competition for that one.", "[on the sale of Lucasfilm to Disney] I'm now a Disney Princess!", "[why Princess Leia never got her own light saber] Even in space, there's a double standard.", "[on her relationship with ex-husband 'Paul Simon' (qv)] I'm not as cooperative as you might want a woman to be . . . Every man, I think, or at least the ones I end up finding, there's no such thing as a consort. All men are kings. That was my little discovery in the process . . . I really thought men's fantasy is to have an intellectual geisha. So what I did was I learned to cook and I took a massage course. But that's not all of it. You have to also agree.", "[on her role as Princess Leia] I got to be the only girl in an all-boy fantasy, and it's a great role for women. She's a very proactive character and gets the job done. So if you're going to get typecast as something, that might as well be it for me.", "The father who flipped out about it [Lei's metal bikini in _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv)], \"What am I going to tell my kid about why she's in that outfit?\" Tell them that a giant slug captured me and forced me to wear that stupid outfit, and then I killed him because I didn't like it. And then I took it off. Backstage.", "[2008, in \"Wishful Drinking\"] Resentment is like drinking poison and waiting for the other person to die.", "[about shooting _Star Wars: Episode IV - A New Hope (1977)_ (qv)] 'George Lucas' (qv) up to me the first day of filming and he takes one look at the dress and says, \"You can't wear a bra under that dress.\" So, I say, \"Okay, I'll bite. Why?\" And he says, \"Because . . . there's no underwear in space.\" What happens is you go to space and you become weightless. So far so good, right? But then your body expands? But your bra doesn't--so you get strangled by your own bra. Now I think that this would make for a fantastic obit--so I tell my younger friends that no matter how I go, I want it reported that I drowned in moonlight, strangled by my own bra.", "[on being asked to lose weight for a part] They always do [ask me]. They want to hire part of me, not all of me. They want to hire about three-fourths, so I have to get rid of the fourth somehow. The fourth can't be with me. I made a joke!\"", "[on being the daughter of a Jewish father and Protestant mother] I always felt the Jewish part more. In fact, growing up I felt like a Jew among WASPs.", "I think I am Princess Leia; Princess Leia is me. It's like a Möbius strip tease.", "If my life wasn't funny it would just be true, and that is unacceptable.", "[in \"People Magazine\" in 1987, on her drug problems] I couldn't stop, or stay stopped. It was never my fantasy to have a drug problem. I'd say, \"Oh, fuck it, I haven't done anything for a couple of months, why not? Let's celebrate not doing them by doing them\". I got into trouble each time. I hated myself. I just beat myself up. It was very painful.", "Don't slide through life. Savor it. Slow down. Be kind. Pay attention. Because this isn't going to happen again.", "If there's a choice between companionship and anything else - especially career - choose companionship. It's the only thing that has the potential to last. Choose career and you'll spend unreasonable amounts of time attempting to look younger than you are and feeling you aren't succeeding.", "We treat beauty like an accomplishment, and that is insane. Everyone in L.A. says, 'Oh you look good,' and you listen for them to say you've lost weight. It's never 'How are you?' or 'You seem happy!", "The actor who played Boba Fett stood behind me while I was wearing the bikini, and he could see all the way to Florida.", "The only reason to go into acting is if you can kill a giant monster.", "[on meeting 'Richard Nixon' (qv)] My mother's fault. I said to her, 'I will not go. I want him impeached.' She said, 'I will take away your credit cards.' I said, 'I'm coming'.", "[on the next 'Star Wars' film, after _Star Wars: The Last Jedi (2017)_ (qv) finished filming (which will sadly not happen)]: I'd better be at the forefront of Episode IX!", "[on the order the Star Wars films should be watched] Watch the ones that I'm in and then you can do what you want."], "salary history": ["_Family Guy (1999)_ (qv)::$40,000 per episode", "_Scream 3 (2000)_ (qv)::$145,000", "_Heartbreakers (2001)_ (qv)::$250,000", "_Charlie's Angels: Full Throttle (2003)_ (qv)::$80,000", "_Wonderland (2003)_ (qv)::$200,000", "_Stateside (2004)_ (qv)::$50,000", "_Undiscovered (2005)_ (qv)::$65,000", "_The Women (2008)_ (qv)::$650,000", "_Catastrophe (2015)_ (qv)::$80,000 per episode", "_Star Wars: Episode VII - The Force Awakens (2015)_ (qv)::$1,500,000", "_Star Wars: Episode VIII - The Last Jedi (2017)_ (qv)::$2,000,000"], "birth date": "1956-10-21", "birth notes": "Burbank, California, USA", "death date": "2016-12-27", "death cause": "(sleep apnea and other undetermined factors)", "death notes": "in Los Angeles, California, USA (sleep apnea and other undetermined factors)", "_actorID": "85", "_source": "IMDB", "actorID": "0000402", "created_utc_dt": "08/26/2019, 21:54:44"}