{"headshot": "https://m.media-amazon.com/images/M/MV5BNzIxOTQ1NTU1OV5BMl5BanBnXkFtZTcwMTQ4MDY0Nw@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Gwynnie"], "birth name": "Gwyneth Kate Paltrow", "height": "5' 9\" (1.75 m)", "mini biography": ["A tall, wafer thin, delicate beauty, Gwyneth Kate Paltrow was born in Los Angeles, the daughter of noted producer and director 'Bruce Paltrow' (qv) and Tony Award-winning actress 'Blythe Danner' (qv). Her father was from a Jewish family, while her mother is of mostly German descent. When Gwyneth was eleven, the family moved to Massachusetts, where her father began working in summer stock productions in the Berkshires. It was here that she received her early acting training under the tutelage of her parents. She graduated from the all-girls Spence School in New York City and moved to California where she attended the UC Santa Barbara, majoring in Art History. She soon quit, realizing it was not her passion. She made her film debut with a small part in _Shout (1991)_ (qv) and for the next five years had featured roles in a mixed bag of film fare that included _Flesh and Bone (1993)_ (qv); _Mrs. Parker and the Vicious Circle (1994)_ (qv); _Se7en (1995)_ (qv); _Jefferson in Paris (1995)_ (qv); _Moonlight and Valentino (1995)_ (qv); and _The Pallbearer (1996)_ (qv). It was her performance in the title role of Emma Woodhouse in _Emma (1996)_ (qv) that led to her being offered the role of Viola in _Shakespeare in Love (1998)_ (qv), for which she was awarded the Golden Globe, Screen Actors Guild and Academy 'Awards' (qv) for Best Actress in a Leading Role. Her roles have also included _The Royal Tenenbaums (2001)_ (qv), _Shallow Hal (2001)_ (qv), _Sky Captain and the World of Tomorrow (2004)_ (qv), _Iron Man (2008)_ (qv), _Two Lovers (2008)_ (qv), and _Country Strong (2010)_ (qv). She has two children with her former husband, English musician 'Chris Martin' (qv).::Tom McDonough"], "spouse": ["'Brad Falchuk' (qv)::(29 September 2018 - present)", "'Chris Martin' (qv)::(5 December 2003 - 15 July 2016) ( divorced) ( 2 children)"], "trade mark": ["Often plays British characters", "Blonde hair and blue eyes", "Statuesque, model-like figure"], "trivia": ["Attended and graduated from the Spence School in New York City (1990).", "Voted \"Most Stuck-up\" in Movieline magazine's 100 Most. [October 1998]", "(August 15, 1998) Gave $21,000 watch to boyfriend 'Ben Affleck' (qv) as a birthday present.", "Named one of People magazine's 50 Most Beautiful People in the World (1998).", "Engaged to actor 'Brad Pitt' (qv) on December 20, 1996. She broke her much publicized engagement in 1997, citing the fact that neither she nor Pitt felt that they could pursue their respective careers and at the same time maintain a happy marriage. They remain good friends.", "Confirmed as the next 'Calvin Klein' (qv) model (1996).", "Attended the University of California at Santa Barbara (UCSB) for one year as an Art History major.", "After spending a time in her early teens in Talavera De la Reina, Toledo, Spain, she can speak fairly good Spanish.", "Turned down the role of Emma Peel in the movie _The Avengers (1998)_ (qv), which went to 'Uma Thurman' (qv).", "Met with 'James Cameron' (qv) for the role of Rose DeWitt Bukater in _Titanic (1997)_ (qv), which went to 'Kate Winslet' (qv).", "Spends Thanksgiving every year with 'Steven Spielberg' (qv) and 'Kate Capshaw' (qv) at their home in the Hamptons.", "As part of research for her role as an obese woman in _Shallow Hal (2001)_ (qv), wore the 200-pound latex \"fat\" suit she used for the film to a bar where people refused to make eye contact with her and treated her rudely. She said that this experience made her saddened by the injustice faced by overweight people in society.", "Has been friends with 'Maya Rudolph' (qv) (of _Saturday Night Live (1975)_ (qv) fame) since she was seven.", "Practices yoga and sticks to a macrobiotic diet.", "Older sister of 'Jake Paltrow' (qv); first cousin of actress 'Katherine Moennig' (qv), whose roles include Jacqueline 'Jake' Pratt on _Young Americans (2000)_ (qv) and Shane McCutcheon on _The L Word (2004)_ (qv), and 'Hillary Danner' (qv); niece of 'Harry Danner' (qv).", "Did her own singing in the comedy-drama movie _Duets (2000)_ (qv).", "Attended Crossroads High School in Santa Monica, California for one year.", "(April 13, 2003) Attended the ceremony in Talavera De la Reina, Toledo, Spain, in which she was named \"adopted daughter\". She first visited the town as a young schoolgirl and has since frequently returned there, enamored - she says - of the people, the food and the countryside.", "Has played Thomas Jefferson's daughter in _Jefferson in Paris (1995)_ (qv). Her mother, 'Blythe Danner' (qv), played Jefferson's wife, Martha, in _1776 (1972)_ (qv), just before Gwyneth was conceived. In the 'Ken Burns' (qv) miniseries, _Thomas Jefferson (1997)_ (qv), she played his granddaughter.", "Nominated for a London Evening Standard Theatre Award for Best Actress for her performance in \"Proof\", performed at the Donmar Warehouse in London, England (2002).", "She and her husband 'Chris Martin' (qv) purchased 'Kate Winslet' (qv)'s North London home in Belsize Park.", "Is the daughter of 'Bruce Paltrow' (qv) and 'Blythe Danner' (qv). Gwyneth's paternal grandparents, Arnold P. Paltrow and Dorothy Weigert, were both from Jewish families from Eastern and Central Europe (Poland, Russia, Belarus and Lithuania), and Gwyneth's father had many generations of rabbis in the family tree. Gwyneth's maternal grandparents were Harry Earl Danner and Katherine M. Kile, and Gwyneth's mother is of German, with smaller amounts of English and Irish, descent. Some of her mother's ancestors lived in Barbados.", "Her mother, 'Blythe Danner' (qv), was about five months pregnant with the future actress when she appeared in _Columbo: Étude in Black (1972)_ (qv). The episode also starred 'John Cassavetes' (qv), and aired during the series' first season.", "Her name can be heard over the P.A. system in many episodes of the medical drama _St. Elsewhere (1982)_ (qv). Gwyneth's father, 'Bruce Paltrow' (qv), was the producer of the series.", "Turned down the role of Rachel Keller in _The Ring (2002)_ (qv), which went to 'Naomi Watts' (qv).", "Is best friends with 'Madonna' (qv).", "Attended St. Augustine by the Sea (where she met 'Maya Rudolph' (qv)) in Los Angeles and the Spence School in New York City.", "Met husband 'Chris Martin' (qv) when she attended his band's ('Coldplay' (qv)'s) concert. [October 2002]", "She does not employ a nanny to take care of her daughter, a rarity among actors in the film business.", "Signed a contact with 'Estée Lauder' (qv) for $10 million to promote its new line of fragrance, \"Pleasures\".", "Her son, 'Moses Martin' (qv), is named after a song 'Chris Martin' (qv) wrote for her and appears on 'Coldplay' (qv)'s album \"Live 2003\". Moses is also her father's Hebrew name.", "She speaks French quite well, having spent a summer in Paris when in her early twenties.", "Good friends with 'Helena Christensen' (qv), who was one of the first people to visit Gwyneth in the hospital, after she gave birth to her son, 'Moses Martin' (qv) (Moses Bruce Anthony Martin).", "Longtime close friends with actress 'Mary Wigmore' (qv), who also appeared (albeit briefly) in Paltrow's films _The Royal Tenenbaums (2001)_ (qv) and _Shallow Hal (2001)_ (qv).", "Was the Maid of Honor at 'Madonna' (qv)'s wedding to 'Guy Ritchie' (qv).", "Her godfather 'Steven Spielberg' (qv) is also the godfather of 'Drew Barrymore' (qv).", "Godparents of her daughter, 'Apple Martin' (qv), are 'Simon Pegg' (qv), 'Mary Wigmore' (qv), and 'Chris Martin' (qv)'s 'Coldplay' (qv) bandmate, 'Jon Buckland' (qv).", "Was originally signed on for the role of 'Ava Gardner' (qv) in _The Aviator (2004)_ (qv), but dropped out. The role went to 'Kate Beckinsale' (qv).", "Auditioned for the role of Vickie Miner in _Reality Bites (1994)_ (qv), which went to 'Janeane Garofalo' (qv).", "She earns $3 million per year endorsing 'Estée Lauder' (qv) on television and in print advertisements.", "Attended Brown Ledge Summer Camp in Vermont.", "When she played 'Sharon Stone' (qv) on _Saturday Night Live (1975)_ (qv), Stone felt offended and criticized her performance (1999).", "Had suffered post-partum depression following the birth of her son, 'Moses Martin' (qv) on April 15, 2008.", "Attended the Spence School in Manhattan, an elite private girls' school that was also attended by 'Emmy Rossum' (qv) and 'Kerry Washington' (qv).", "Attended the 55th Tony 'Awards' (qv). She can be seen dancing with the revival cast of \"The Rocky Horror Show\" during \"The Time Warp\".", "Ambassador for the Entertainment Industry Foundation (EIF)'s Women's Cancer Research Fund (2008).", "Gwyneth's brother, 'Jake Paltrow' (qv)'s birthday is a day before hers (9/26 and 9/27, respectively).", "Friends with 'Cameron Diaz' (qv), 'Stella McCartney' (qv), 'Liv Tyler' (qv), 'Reese Witherspoon' (qv) and 'Tracy Anderson' (qv), and 'Kate Hudson' (qv).", "Returned to work ten months after giving birth to her daughter, 'Apple Martin' (qv), in order to begin filming _Running with Scissors (2006)_ (qv).", "Was six months pregnant with her son 'Moses Martin' (qv) when she completed filming _The Good Night (2007)_ (qv) and returned to work eleven months after giving birth, in order to begin filming _Iron Man (2008)_ (qv).", "Two of her ex-boyfriends have been named Sexiest Man Alive by People magazine: 'Brad Pitt' (qv) and 'Ben Affleck' (qv).", "Replaced 'Charlize Theron' (qv) in the role of Gerda Wegener in _The Danish Girl (2015)_ (qv), but after dropping out of the project herself she was replaced by 'Alicia Vikander' (qv).", "She was awarded a Star on the Hollywood Walk of Fame at 6931 Hollywood Boulevard in Hollywood, California on December 13, 2010. She was accompanied by 'Tim McGraw' (qv), her _Country Strong (2010)_ (qv) co-star 'Faith Hill' (qv), and _Glee (2009)_ (qv) co-star 'Matthew Morrison' (qv).", "Second cousin of Arizona Congresswoman 'Gabrielle Giffords' (qv), who was injured in the 2011 Tucson, Arizona shooting. Their fathers are first cousins.", "(March 26, 2011) Was in attendance at the wedding of 'Reese Witherspoon' (qv) to 'Jim Toth' (qv).", "Auditioned for the role of Kelly Taylor on _Beverly Hills, 90210 (1990)_ (qv), which went to 'Jennie Garth' (qv).", "Auditioned for the role of Susannah Fincannon in _Legends of the Fall (1994)_ (qv). She lost the role to 'Julia Ormond' (qv), but 'Brad Pitt' (qv) was so impressed with Gwyneth that he later hand-picked her to play his wife in _Se7en (1995)_ (qv).", "Is lifelong friends with 'Norman Lloyd' (qv), who knew her mother, 'Blythe Danner' (qv), for exactly 40 years, right around the same time she was born.", "Has two children with her ex-husband 'Chris Martin' (qv) - a daughter 'Apple Martin' (qv) (Apple Blythe Alison Martin; b. May 14, 2004) and a son 'Moses Martin' (qv) (Moses Bruce Anthony Martin; b. April 8, 2006).", "Revealed that she named her daughter Apple, because apples are whole, sweet and crisp. The baby's middle name honors her grandmothers, 'Blythe Danner' (qv) and Alison Martin.", "(March 17, 2013) Admitted that she had miscarried her future third child with her now estranged husband 'Chris Martin' (qv) and almost died.", "(March 25, 2014) Separated from her husband of 10 years 'Chris Martin' (qv).", "Was the 115th actress to receive an Academy Award; she won the Best Actress Oscar for _Shakespeare in Love (1998)_ (qv) at The 71st Annual Academy 'Awards' (qv) (1999) on March 21, 1999.", "Delivered her daughter Apple naturally after a 70-hour long labor but delivered her son Moses via Caesarean section out of fear of having another long labor.", "Is one of 15 Oscar-winning actresses to have been born in the state of California. The others are 'Fay Bainter' (qv), 'Gloria Grahame' (qv), 'Jo Van Fleet' (qv), 'Liza Minnelli' (qv), 'Tatum O'Neal' (qv), 'Diane Keaton' (qv), 'Sally Field' (qv), 'Anjelica Huston' (qv), 'Cher' (qv), 'Jodie Foster' (qv), 'Helen Hunt' (qv), 'Angelina Jolie' (qv), 'Marcia Gay Harden' (qv) and 'Brie Larson' (qv).", "Was offered a chance to be a roaster for \"The Comedy Central Roast of Rob Lowe\", but declined.", "Is one of 11 actresses who won the Best Actress Oscar for a move that also won the Best Picture Oscar (she won for _Shakespeare in Love (1998)_ (qv)). The others are 'Claudette Colbert' (qv) for _It Happened One Night (1934)_ (qv), 'Luise Rainer' (qv) for _The Great Ziegfeld (1936)_ (qv), 'Vivien Leigh' (qv) for _Gone with the Wind (1939)_ (qv), 'Greer Garson' (qv) for _Mrs. Miniver (1942)_ (qv), 'Louise Fletcher' (qv) for _One Flew Over the Cuckoo's Nest (1975)_ (qv), 'Diane Keaton' (qv) for _Annie Hall (1977)_ (qv), 'Shirley MacLaine' (qv) for _Terms of Endearment (1983)_ (qv), 'Jessica Tandy' (qv) for _Driving Miss Daisy (1989)_ (qv), 'Jodie Foster' (qv) for _The Silence of the Lambs (1991)_ (qv) and 'Hilary Swank' (qv) for _Million Dollar Baby (2004)_ (qv).", "Was supposed to star in _She's Out of My League (2010)_ (qv) but backed out due to production delays. 'Alice Eve' (qv) replaced her.", "Greatly admires 'Johnny Depp' (qv). She worked with him on _Mortdecai (2015)_ (qv).", "As a teenage model, she appeared in a 1991 ad urging high school kids to use condoms.", "Is one of 25 actresses who have received an Academy Award for their performance in a comedy; hers being for _Shakespeare in Love (1998)_ (qv). The others in chronological order, are: 'Claudette Colbert' (qv) (_It Happened One Night (1934)_ (qv)), 'Loretta Young' (qv) (_The Farmer's Daughter (1947)_ (qv)), 'Josephine Hull' (qv) (_Harvey (1950)_ (qv)), 'Judy Holliday' (qv) (_Born Yesterday (1950)_ (qv)), 'Audrey Hepburn' (qv) (_Roman Holiday (1953)_ (qv)), 'Goldie Hawn' (qv) (_Cactus Flower (1969)_ (qv)), 'Glenda Jackson' (qv) (_A Touch of Class (1973)_ (qv)), 'Lee Grant' (qv) (_Shampoo (1975)_ (qv)), 'Diane Keaton' (qv) (_Annie Hall (1977)_ (qv)), 'Maggie Smith' (qv) (_California Suite (1978)_ (qv)), 'Mary Steenburgen' (qv) (_Melvin and Howard (1980)_ (qv)), 'Jessica Lange' (qv) (_Tootsie (1982)_ (qv)), 'Olympia Dukakis' (qv) (_Moonstruck (1987)_ (qv)), 'Cher' (qv) (_Moonstruck (1987)_ (qv)), 'Jessica Tandy' (qv) (_Driving Miss Daisy (1989)_ (qv)), 'Mercedes Ruehl' (qv) (_The Fisher King (1991)_ (qv)), 'Marisa Tomei' (qv) (_My Cousin Vinny (1992)_ (qv)), 'Dianne Wiest' (qv) (_Bullets Over Broadway (1994)_ (qv)), 'Mira Sorvino' (qv) (_Mighty Aphrodite (1995)_ (qv)), 'Frances McDormand' (qv) (_Fargo (1996)_ (qv)), 'Helen Hunt' (qv) (_As Good as It Gets (1997)_ (qv)), 'Judi Dench' (qv) (_Shakespeare in Love (1998)_ (qv)), 'Penélope Cruz' (qv) (_Vicky Cristina Barcelona (2008)_ (qv)), and 'Jennifer Lawrence' (qv) (_Silver Linings Playbook (2012)_ (qv)).", "Is one of 14 actresses to have won both the Best Actress Academy Award and the Best Actress in a Comedy/Musical Golden Globe for the same performance; hers being for _Shakespeare in Love (1998)_ (qv). The others, in chronological order, are: 'Judy Holliday' (qv) for _Born Yesterday (1950)_ (qv), 'Julie Andrews' (qv) for _Mary Poppins (1964)_ (qv), 'Barbra Streisand' (qv) for _Funny Girl (1968)_ (qv), 'Liza Minnelli' (qv) for _Cabaret (1972)_ (qv), 'Glenda Jackson' (qv) for _A Touch of Class (1973)_ (qv), 'Diane Keaton' (qv) for _Annie Hall (1977)_ (qv), 'Sissy Spacek' (qv) for _Coal Miner's Daughter (1980)_ (qv), 'Cher' (qv) for _Moonstruck (1987)_ (qv), 'Jessica Tandy' (qv) for _Driving Miss Daisy (1989)_ (qv), 'Helen Hunt' (qv) for _As Good as It Gets (1997)_ (qv), 'Reese Witherspoon' (qv) for _Walk the Line (2005)_ (qv), 'Marion Cotillard' (qv) for _La Vie en Rose (2007)_ (qv), and 'Jennifer Lawrence' (qv) for _Silver Linings Playbook (2012)_ (qv).", "She was offered the role of Emma Peel in _The Avengers (1998)_ (qv), which she turned down. Coincidentally, she later played Pepper Potts in an unrelated film of the same _The Avengers (2012)_ (qv).", "Mother 'Blythe Danner' (qv) mentioned in her Emmy Award acceptance speech in 2015, that 'Kiefer Sutherland' (qv) babysat her daughter as a child.", "Is one of 3 actresses who have won both the Best Actress Oscar (hers being for _Shakespeare in Love (1998)_ (qv)) and the Outstanding Guest Actress in a Comedy Series Emmy (hers being for _Glee (2009)_ (qv)). The other actresses are 'Emma Thompson' (qv) and 'Kathy Bates' (qv).", "Practices Transcendental Meditation.", "Involved in a \"Sliding Doors\" moment for a woman who missed a train and arrived late for work at the World Trade Center on 9/11. On her way to the train, Lara Lundstrom Clarke jaywalked in front of Paltrow's car, then stopped in the street when she recognized the star. The two stared each other down long enough for Clarke to arrive at the station just in time to see the train pulling out, her life changed by a chance delay and a narrowly-missed train, like Paltrow's character in \"Sliding Doors.\" By the time Clarke reached the World Trade Center, the first tower had already fallen.", "(September 29, 2018) Married her boyfriend of 4 years 'Brad Falchuk' (qv) in a private wedding ceremony in the Hamptons following a 10-month-long engagement. The guests included 'Jerry Seinfeld' (qv), 'Steven Spielberg' (qv), 'Cameron Diaz' (qv), 'Benji Madden' (qv) and 'Robert Downey Jr.' (qv).", "Turned down the role of Kathy in _Cool as Ice (1991)_ (qv) (as did 'Lisa Marie Presley' (qv)) because her parents thought the script was garbage.", "Has two step-children, Brody and Isabella.", "She was to be the original narrator for _Thomas & Friends: The Great Discovery - The Movie (2008)_ (qv) but instead the role went to 'Pierce Brosnan' (qv)."], "quotes": ["Beauty, to me, is about being comfortable in your own skin. That, or a kick-ass red lipstick.", "[on her father's ('Bruce Paltrow' (qv)'s) struggle with throat cancer] It changed me more than anything else. You don't want to get to that place where you're the adult and you're palpably in the next generation. And, this shoved me into that.", "[on her 1997 separation with 'Brad Pitt' (qv)] It really changed my life. When we split up, something changed, permanently, in me. My heart sort of broke that day, and it will never be the same.", "I try to remember, as I hear about friends getting engaged, that it's not about the ring and it's not about the wedding. It's a grave thing, getting married. And it's easy to get swept up in the wrong things.", "I find _Sex and the City (1998)_ (qv) irreverent and shocking. It's one step beyond how girls really talk. I would do a cameo on that show in a flash.", "I realised life is so short and precious, you should do things that make you feel inspired, that push you and teach you something. I'd rather not have a big house, a huge closet of clothes, diamonds and a private plane, and instead a body of work that I'm proud of.", "I'm glad that some day my children will be able to see my father and hear his voice, get a sense of who he was. One of the things that disturbs me the most about the fact that he's dead, is that I feel like a statistic. I sort of feel like one of those people who was unfortunate and lost their father when they were 30, and life goes on. But he was so unique and so incredible, I don't like to think about it in those terms.", "I worked so much in my 20s and I really burnt the candle at both ends. I wasn't too picky about what I did and I was lucky that I did some really good films, but I also did some really rubbish films, I think part of the downside about being so successful and winning the Oscar at the age of 26 is that I sort of became insouciant about the things that I chose. I thought, \"Oh, I'll just try this, it'll be fun or I'll do that for the money.\" Things like that now I would absolutely never do.", "The simpler things are, the happier they are.", "The work gets more difficult as you get older. You learn more and you gather more experiences, there is deeper pain and higher highs.", "There are certain women in this business who have children and I just think, \"You must never, never see them!\". You can't do movies back to back and see your child if they go to school.", "Our marriage is between us. If we decide to continue being together or not, it's our business.", "[on being pregnant while filming _Proof (2005)_ (qv)] It was very, very difficult. I was trying not to barf. I felt terrible.", "Even actresses that you really admire, like 'Reese Witherspoon' (qv), you think, another romantic comedy? You know. You see her in something like _Walk the Line (2005)_ (qv) and think, \"God, you're so great!\" And then you think, \"Why is she doing these stupid romantic comedies?\". But of course, it's for money and status. I just think, \"Wouldn't it be great if all of those movies people went to see were about real women?\".", "I love the English way, which is not as capitalistic as it is in America. People don't talk about work and money. They talk about interesting things at dinner parties. I like living here because I don't tap into the bad side of American psychology, which is \"I'm not achieving enough, I'm not making enough, I'm not at the top of the pile!\".", "I'm very happy here [in London] and I really like the way the film industry works, everybody cares. I like that it doesn't have this big capitalistic feeling. When you do something in L.A., you really feel the crew are punching the clock.", "I sort of look at some peers of mine and I think, \"No, you've got it all wrong!\". I just want to tell them all to have babies and be happy and not get sucked into that Hollywood thing.", "I find the English amazing how they got over 7/7. There were no multiple memorials with people sobbing as they would have been in America. There, they are constantly scaring people but at the same time, people think nothing of going to see a therapist.", "Brits are far more intelligent and civilised than Americans. I love the fact that you can hail a taxi and just pick up your pram and put in the back of the cab without having to collapse it. I love the parks and places I go for dinner and my friends. It's a pretty city, you know.", "British people don't seem to ask each other out on dates. If someone asked you out they're really going out on a limb, whereas in America it happens all the time. Someone will come up to you and ask you for dinner and you'll say, \"Sure!\" It's no big deal and no weight should be attached to it. It's only dinner, for God's sake. Yet in Britain, mostly what happens seems to be that people meet at work. If there's a little something there, then they hang out together and, all of a sudden, they're boyfriend and girlfriend.", "It would be a lot easier on 'Brad Pitt' (qv) and 'Jennifer Aniston' (qv) now had they not talked to the press about each other and everything to begin with. I learned my lesson at 24.", "[on daughter Apple's accent] She says \"Mummy\" instead of \"Mommy\", I don't mind that. I will if she starts saying \"basil\" and \"pasta\" the English way, as that really drives me nuts.", "[on the paparazzi] If I have my daughter in the car and they are making me nervous, I'll do whatever I have to do. I keep a whole log. I take pictures of their cars, write down license plate numbers, everything. If they do it again, I can go to the police. I know my rights and, believe me, I will have them arrested. I will stop at nothing.", "[on 'Madonna' (qv)] She has evolved with so much wisdom and grace that I would say my favorite 'Madonna' (qv) is today's 'Madonna' (qv). She's a beautiful product of all her explorations and incarnations. (Style magazine, September 2006)", "I'd rather smoke crack than eat cheese from a tin.", "My father found joy in feeding the people he loved - genuine, bursting happiness. He instilled in me the idea that a meal made for your family is an expression of love.", "[on the \"scenery\" in _View from the Top (2003)_ (qv)] It's like, all of a sudden, I'm in underwear for half the movie.", "When you're having dinner with your kids and your husband and someone says something funny or your dying laughing because your three-year-old made a joke, it doesn't matter what else is going on. That's real happiness.", "Women really need to examine why they're so vitriolic to other women.", "[on 'Johnny Depp' (qv)] Whether it's 'Morgan Freeman' (qv) [_Se7en (1995)_ (qv)] at the beginning of my career or 'Johnny Depp' (qv) in my last movie [_Mortdecai (2015)_ (qv)], I feel on-my-knees gratitude for being considered a good enough actor to work with actors of that caliber. Johnny is a true genius and when he works he envisages everything. You know I read the script and I thought it was really funny. I have always wanted to work with Johnny and I'm so lucky they asked me as he is amazing. We had so much fun on set that it was hard not to laugh.", "I am who I am. I can't pretend to be somebody who makes $25,000 a year."], "salary history": ["_Shakespeare in Love (1998)_ (qv)::$750,000", "_Possession (2002)_ (qv)::$5,000,000", "_View from the Top (2003)_ (qv)::$10,000,000", "_Infamous (2006)_ (qv)::$3,600,000"], "birth date": "1972-09-27", "birth notes": "Los Angeles, California, USA", "_actorID": "41", "_source": "IMDB", "actorID": "0000569", "created_utc_dt": "08/26/2019, 21:54:15"}