{"headshot": "https://m.media-amazon.com/images/M/MV5BMjQyNzM2MjM1Ml5BMl5BanBnXkFtZTcwMDE5NjI3Mg@@._V1_UY98_CR2,0,67,98_AL_.jpg", "nick names": ["Sandman"], "birth name": "Adam Richard Sandler", "height": "5' 9¾\" (1.77 m)", "mini biography": ["Adam Richard Sandler was born September 9, 1966 in Brooklyn, New York, to Judith (Levine), a teacher at a nursery school, and Stanley Alan Sandler, an electrical engineer. He is of Russian Jewish descent. At 17, he took his first step towards becoming a stand-up comedian when he spontaneously took the stage at a Boston comedy club. He found he was a natural comic. He nurtured his talent while at New York University (graduating with a Bachelor of Fine Arts degree in 1991) by performing regularly in clubs and at universities. During his freshman year, he snagged a recurring role as the Huxtable family's friend Smitty on _The Cosby Show (1984)_ (qv). While working at a comedy club in L.A., he was \"discovered\" by 'Dennis Miller' (qv), who recommended him to _Saturday Night Live (1975)_ (qv) producer 'Lorne Michaels' (qv) and told him that Sandler had a big talent. This led to his being cast in the show in 1990, which he also wrote for in addition to performing. After _Saturday Night Live (1975)_ (qv), Sandler went on to the movies, starring in such hit comedies as _Airheads (1994)_ (qv), _Happy Gilmore (1996)_ (qv), _Billy Madison (1995)_ (qv) and _Big Daddy (1999)_ (qv). He has also starred in _Mr. Deeds (2002)_ (qv) alongside 'Winona Ryder' (qv); _Eight Crazy Nights (2002)_ (qv), an animated movie about the Jewish festival of Chanukah; and _Punch-Drunk Love (2002)_ (qv). He also writes and produces many of his own films and has composed songs for several of them, including _The Wedding Singer (1998)_ (qv). Sandler has had several of his songs placed on the \"Billboard\" charts, including the classic \"The Chanukah Song\".::A. Nonymous"], "spouse": ["'Jackie Sandler' (qv)::(22 June 2003 - present) ( 2 children)"], "trade mark": ["Often casts 'Allen Covert' (qv), 'Blake Clark' (qv), 'Peter Dante' (qv), 'Jonathan Loughran' (qv), 'Steve Buscemi' (qv), 'Henry Winkler' (qv) and former _Saturday Night Live (1975)_ (qv) players in his films", "His characters often have a penchant for a particular brand name food (i.e.  Snack Packs, Subway, Popeye's chicken, etc.)", "Often plays a character with a bad temper, or a short fuse", "Frequently appears in 'Rob Schneider' (qv) films either with a large role or a small cameo", "Frequently uses 1980s music for the soundtrack of his movies", "His characters frequently wear licensed professional sports team apparel, based on the locale of the film", "In the films he writes, the female characters often have names that begin with the letter V (Veronica Vaughn, Virginia Venit, Vicki Vallencourt, Vanessa, Valerie Veran)", "In the films he writes, his characters' names often end with the letter Y (Billy Madison, Sonny Koufax, Bobby Boucher, Happy Gilmore, Nicky, etc.)"], "trivia": ["His comedy album \"Stan and Judy's Kid\" set a record for most albums sold by a comedy album in its first week. It debuted at #16 on the Billboard charts. All three of his previous comedy albums have gone platinum.", "Attended and graduated from New York University's Tisch School of the Arts (1991).", "Grew up in Manchester, New Hampshire after moving there when he was five years old.", "Was originally cast for a role in the black comedy _Very Bad Things (1998)_ (qv).", "In 1988, he was hired as a repertory player for MTV's TV-trivia game show _Remote Control (1987)_ (qv).", "Announced engagement to longtime girlfriend, model/actress 'Jackie Sandler' (qv). [June 2002]", "Ranked #35 in Premiere magazine's 2003 annual Power 100 List. Had ranked #43 the previous two years.", "Father was an electrician. His brother is an attorney. One sister is a dentist; the other sister is a waitress.", "Formed his production company, Happy Madison Productions, which is behind most of his films.", "His production company, Happy Madison, is named after two of his films, _Happy Gilmore (1996)_ (qv) and _Billy Madison (1995)_ (qv).", "His beloved dog, 'Meatball' (qv), who also has a section on Adam's official website with photos and videos, passed away due to a heart attack, at 4 years old. He was the son of Mr. Beefy, the talking dog in _Little Nicky (2000)_ (qv). 'Meatball' (qv) was best \"man\" at Sandler's wedding and was dressed in a tux, with a yarmulka on his head [January 27, 2004].", "Is a major fan of the New York Mets.", "Is a huge fan of 'Van Halen' (qv), 'The Police' (qv) and 'Styx' (qv). There is usually a reference or song in his movies.", "He was originally set to play taxi driver Max in _Collateral (2004)_ (qv), opposite 'Tom Cruise' (qv), but he backed out to work on _Spanglish (2004)_ (qv). 'Jamie Foxx' (qv) was cast in _Collateral (2004)_ (qv) instead. 'Jamie Foxx' (qv) went on to be nominated for an Academy Award for the role.", "Was parodied by 'Jimmy Fallon' (qv) on _Saturday Night Live (1975)_ (qv). [1995]", "In 2004, he performed at the RNC (Republican National Committee) convention.", "Was a Resident Advisor in Brittany Hall during his time at New York University.", "Spoke at Manchester Central High School's 2003 graduation, the same school he graduated from. His nephew was one of three Valedictorians that year.", "Attended WWE's _WrestleMania 21 (2005)_ (qv). [April 2005]", "Has starred alongside 'Drew Barrymore' (qv) in three movies: _The Wedding Singer (1998)_ (qv), _50 First Dates (2004)_ (qv) and _Blended (2014)_ (qv).", "On June 22, 2003, Adam wore an Armani tuxedo in his wedding to 'Jackie Sandler' (qv).", "Was considered for the role of Willy Wonka in _Charlie and the Chocolate Factory (2005)_ (qv), which went to 'Johnny Depp' (qv).", "Has worked with director 'Frank Coraci' (qv) four times: _The Wedding Singer (1998)_ (qv), _The Waterboy (1998)_ (qv), _Click (2006)_ (qv) and _Blended (2014)_ (qv).", "Ranked #24 on Premiere magazine's 2006 \"Power 50\" list. Had ranked #24 in 2005 as well.", "Good friends with comedians 'Chris Rock' (qv), 'Norm MacDonald' (qv), 'David Spade' (qv), 'Steven Brill' (qv), 'Chris Farley' (qv) and 'Rob Schneider' (qv).", "Owns a white and tan English bulldog named Motzaball.", "Is a huge fan of professional wrestling, and most of his self-written films have references to professional wrestling in them (the principal in _Billy Madison (1995)_ (qv), Captain Insano in _The Waterboy (1998)_ (qv), Chief Jay Strongbow's sleeper hold in _Big Daddy (1999)_ (qv), mind-wrestling and 'Tommy 'Tiny' Lister' (qv) - a.k.a. the WWF's Zeus - in _Little Nicky (2000)_ (qv), etc). Sandler even appeared on _WWE SmackDown Live (1999)_ (qv) to promote _Little Nicky (2000)_ (qv). 'Kevin Nash' (qv), 'Bill Goldberg' (qv), 'Steve Austin' (qv); all professional wrestlers, appeared in Adam's recent film, _The Longest Yard (2005)_ (qv). Wrestler/producer 'Anthony Begonia' (qv) almost appeared in _50 First Dates (2004)_ (qv) as an ukulele player.", "His favorite cartoon character is _SpongeBob SquarePants (1999)_ (qv).", "According to Forbes magazine, for each dollar he got paid, his movies averaged $9 of gross income. [September 2007]", "In 2007, Forbes magazine estimated his earnings for the year at $30 million.", "Former roommate of writer/director/producer 'Judd Apatow' (qv) during his time on _Saturday Night Live (1975)_ (qv).", "Has homes in Pacific Palisades, Malibu and La Quinta, California, and Highland Beach, Florida.", "Received a star on the Hollywood Walk of Fame at 6262 Hollywood Boulevard in Hollywood, California on February 1, 2011. At the ceremony were his wife, 'Jackie Sandler' (qv), their daughters Sadie and Sunny, 'Henry Winkler' (qv) and 'Kevin James' (qv).", "Purchased 'Goldie Hawn' (qv) and 'Kurt Russell' (qv)'s Hollywood home after his wife 'Jackie Sandler' (qv) fell in love with the place during a New Year's Eve party there (her best friend is 'Erinn Bartlett' (qv), Goldie's daughter-in-law). [2004]", "According to Forbes magazine, Sandler was the second highest earning actor, along with 'Leonardo DiCaprio' (qv), earning $37 million from 2011-2012.", "The longest he has gone without a Razzie nomination is five years, between _Eight Crazy Nights (2002)_ (qv)/_Mr. Deeds (2002)_ (qv) and _I Now Pronounce You Chuck & Larry (2007)_ (qv).", "Became a father for the first time at age 39 when his wife 'Jackie Sandler' (qv) gave birth to their daughter Sadie Madison Sandler on May 6, 2006.", "Became a father for the second time at age 42 when his wife 'Jackie Sandler' (qv) gave birth to their daughter Sunny Madeline Sandler on November 2, 2008.", "Father of daughters 'Sadie Sandler' (qv) and 'Sunny Sandler' (qv).", "Son of 'Stan Sandler' (qv) and 'Judith Sandler' (qv).", "Sandler revealed in 2010 during an interview on _Late Night with Conan O'Brien (1993)_ (qv) that he and 'Chris Farley' (qv) were fired from _Saturday Night Live (1975)_ (qv) in 1995.", "Enjoys filming at locations near a gym so he can play basketball on his breaks. He plays once or twice a day.", "'Chris Rock' (qv) dedicated 'Chris Rock' (qv): Never Scared (2004), the recording of a stand-up performance he did at Constitution Hall in Washington, D.C., to the memory of three people: his father, Julius Rock; 'Monteria Ivey' (qv), comic radio personality and TV announcer; and 'Stan Sandler' (qv), Adam's father.", "Owns a production company named Happy Madison Productions.", "Extended his deal with Netflix by four films to eight films total.", "He often has big name casts in his movies. This is arguably due to the high box office of his movies and the fact that he is generally known to be a nice, friendly man to work with.", "Friends with 'Kathy Bates' (qv), 'Kevin James' (qv), 'Bob Barker' (qv) and 'Tom Cruise' (qv).", "Currently resides in New York City and Los Angeles, California.", "Has Russian Jewish ancestry.", "Is referred to in _American Reunion (2012)_ (qv). See quotes for that movie.", "Former student of New York acting teacher, David Gideon."], "quotes": ["[after getting laser eye surgery] Now I realize how ugly I am.", "I never had a speech from my father [saying], \"This is what you must do or shouldn't do\", but I just learned to be led by example. My father wasn't perfect. He had a temper. I took some of that. He would snap, but the older he got, he started calming down. He learned about life, but the thing that he taught my whole family was that family was the most important thing and, no matter what, if a family member needs you, you go and help them out, you get there. He just made us feel comfortable and respectful to other families, my mother also... part of my father having a temper led to me developing a sense of humor to calm the old man down. That kind of sense of humor.", "I wasn't a kid growing up thinking, \"One day, I'll get an Oscar and make a speech.\" That wasn't on my mind. I want to just do the best work I can do.", "To be honest with you, when I got into this I never thought about reviews. I never thought about what people would say about me. I was just a young guy who was excited to become a comedian and an actor and I just wanted to get to do what I got to do.", "[on how he became involved in _Click (2006)_ (qv)] If it's something I feel I can do alright, I like being in those, and some that I think 'Rob Schneider' (qv) and 'David Spade' (qv) would be funnier at than me, I tell them to do it. I don't have any clue how we decide. There's this thing, this \"Click\", actually, one of my friends called me up, my partner told me about this idea that 'Steve Koren' (qv) had. 'Steve Koren' (qv), by the way, the guy who wrote it with 'Mark O'Keefe' (qv), 'Steve Koren' (qv) I've known since I was 22. He was a page at _Saturday Night Live (1975)_ (qv). He would answer the phones and he'd give us phone messages and then he'd give you a message and he'd say, \"Oh yeah. I wrote a joke.\" And he'd tell you the joke and you go, \"Hey. 'Steve Koren' (qv)'s pretty funny\" and then all of a sudden he's written _Bruce Almighty (2003)_ (qv) and this thing and he's a giant writer and he's just a great guy. And anyway, they told me about the premise of the movie and asked if I was interested in that and I didn't even read the script, I just said, \"Yeah. That's a huge idea, it sounds great.\" That's how I decided to do this script, just off three sentences about what the movie's about, I knew it could be awesome.", "[on extending his deal with Netflix by four films, becoming 8 total] I Love working with Netflix and collaborating with them. I love how passionate they are about making movies and getting them out there for the whole world to see. They've made me feel like family and I can't thank them enough for their support."], "salary history": ["_Billy Madison (1995)_ (qv)::$1,700,000", "_Bulletproof (1996)_ (qv)::$2,500,000", "_The Wedding Singer (1998)_ (qv)::$5,500,000", "_Big Daddy (1999)_ (qv)::$8,000,000", "_Little Nicky (2000)_ (qv)::$20,000,000 plus 20% (star)", "_Punch-Drunk Love (2002)_ (qv)::$7,000,000", "_Mr. Deeds (2002)_ (qv)::$20,000,000 against 20%", "_Anger Management (2003)_ (qv)::$25,000,000 against 25% of the gross", "_50 First Dates (2004)_ (qv)::$25,000,000", "_Grown Ups (2010)_ (qv)::$25,000,000", "_Just Go with It (2011)_ (qv)::$25,000,000 (includes producer fee)", "_Bucky Larson: Born to Be a Star (2011)_ (qv)::$2,500,000", "_Zookeeper (2011)_ (qv)::$2,000,000", "_Jack and Jill (2011)_ (qv)::$20,000,000 (includes producer fee)", "_Murder Mystery (2019)_ (qv)::$20,000,000 (includes producer fee)"], "birth date": "1966-09-09", "birth notes": "Brooklyn, New York City, New York, USA", "_actorID": "21", "_source": "IMDB", "actorID": "0001191", "created_utc_dt": "08/26/2019, 21:54:01"}