{"headshot": "https://m.media-amazon.com/images/M/MV5BMjE1MDkxMjQ3NV5BMl5BanBnXkFtZTcwMzQ3Mjc4MQ@@._V1_UY98_CR2,0,67,98_AL_.jpg", "nick names": ["Orli", "OB"], "birth name": "Orlando Jonathan Blanchard Bloom", "height": "5' 11\" (1.8 m)", "mini biography": ["Orlando Jonathan Blanchard Bloom was born in Canterbury, Kent, England on January 13, 1977. His mother, Sonia Constance Josephine (Copeland), was born in Kolkata, India, to an English family then-resident there. The man he first knew as his father, Harry Bloom, was a legendary political activist who fought for civil rights in South Africa. But Harry died of a stroke when Orlando was only four years old. After that, Orlando and his older sister, 'Samantha Bloom' (qv), were raised by their mother and family friend, Colin Stone. When Orlando was 13, Sonia revealed to him that Colin is actually the biological father of Orlando and his sister; the two were conceived after an agreement by his parents, since Harry, who suffered a stroke in 1975, was unable to have children.Orlando attended St. Edmund's School in Canterbury but struggled in many courses because of dyslexia. He did embrace the arts, however, and enjoyed pottery, photography and sculpturing. He also participated in school plays and was active at his local theater. As a teen, Orlando landed his first job: he was a clay trapper at a pigeon shooting range. Encouraged by his mother, he and his sister began studying poetry and prose, eventually giving readings at Kent Festival. Orlando and Samantha won many poetry and Bible reciting competitions. Then Orlando, who always idolized larger-than-life characters, gravitated towards serious acting. At the age of 16, he moved to London and joined the National Youth Theatre, spending two seasons there and gaining a scholarship to train with the British American Drama Academy. Like many young actors, he also auditioned for a number of television roles to further his career, landing bit parts in British television shows _Casualty (1986)_ (qv), _Midsomer Murders (1997)_ (qv) and _Smack the Pony (1999)_ (qv). He also appeared in the critically acclaimed movie _Wilde (1997)_ (qv).He then attended the Guildhall School of Music and Drama. It was there, in 1998, that Orlando fell three stories from a rooftop terrace and broke his back. Despite fears that he would be permanently paralyzed, he quickly recovered and returned to the stage. As fate would have it, seated in the audience one night in 1999 was a director named 'Peter Jackson' (qv). After the show, he met with Orlando and asked him to audition for his new set of movies. After graduating from Guildhall, Orlando began work on the \"Lord of the Rings\" trilogy, spending 18 months in New Zealand bringing to life \"Legolas\", a part which made him a household name. Today, he is one of the busiest and most sought-after actors in the industry.::J.W. Braun"], "spouse": ["'Miranda Kerr' (qv)::(22 July 2010 - 2013) ( divorced) ( 1 child)"], "trade mark": ["Often cast in historical or fantasy-based \"costume epic\" roles (Kingdom ofHeaven, The Lord of the Rings, Troy, Pirates of the Caribbean)", "Often plays experts in weaponry, whether they be swordsmen (the Pirates of the Caribbean films) or archers (the Lord of the Rings films, Troy)"], "trivia": ["During the filming for _The Lord of the Rings: The Fellowship of the Ring (2001)_ (qv), he fell off his horse and broke one of his ribs.", "Chosen as one of Teen People magazine's \"25 Hottest Stars Under 25\" (2002).", "Originally auditioned to play the role of Faramir in the Lord of the Rings trilogy but lost out on that role and was instead asked to play the role of Legolas.", "Learned to surf during the filming of the Lord of the Rings trilogy in New Zealand.", "He won the 2002 MTV Movie Award for \"Breakthrough Male\".", "Was nominated with the entire _The Lord of the Rings: The Fellowship of the Ring (2001)_ (qv) cast for \"Best Ensemble Acting\" at the Screen Actors Guild 'Awards' (qv).", "Won the award at the 2002 Empire 'Awards' (qv) for \"Best Debut\".", "Underwent a great deal of training with knives, horseback riding, canoeing and archery before his role as Legolas.", "According to Screensavers.com, 'Orlando Bloom' (qv) replaced 'Britney Spears' (qv) at the top of the website's celebrity download index in January 2004.", "One of People (USA) magazine's 50 Most Beautiful People in the World (2004).", "Website Ananova.com chose him as the sexiest actor in Britain (2004).", "One of People magazine's \"Hottest Bachelors\" in 2004.", "His cousin, the photographer/director 'Sebastian Copeland' (qv), is 'Brigitte Nielsen' (qv)'s ex-husband.", "He made archery a very popular sport in the United Kingdom. Many youngsters saw him with a bow in the Lord of the Rings trilogy and decided to join archery schools.", "Chosen as Teen People magazine's #1 Hottie for the October 2004 issue.", "Chosen as the sexiest male movie star by Empire magazine. Overall, he was 3rd; ahead of him were 'Keira Knightley' (qv) (1st) and 'Angelina Jolie' (qv) (2nd). [September 2004]", "He used to be a vegetarian, but he had to go back to eating meat when he was filming _The Lord of the Rings: The Fellowship of the Ring (2001)_ (qv).", "Named as one of nine \"off the charts\" sexy superstars by People magazine in 2004, along with 'Jake Gyllenhaal' (qv), 'Usher Raymond' (qv), 'Colin Farrell' (qv), 'Brad Pitt' (qv), 'Matt Damon' (qv), 'Ben Affleck' (qv), 'Bruce Willis' (qv) and 'Johnny Depp' (qv).", "Was visited by Baroness, Maria Von Ritchie Lopez during filming of _The Lord of the Rings: The Return of the King (2003)_ (qv).", "Received a great amount of \"stage combat\" training while at the Guildhall School of Music and Drama (as part of the drama program in conjunction with the British Academy of Stage and Theatre Combat), which helped prepare him a great deal in the characters he has chosen to play, that fight with swords, bows and knives.", "Has received an invitation to join the Royal Shakespeare Company (RSC) in Stratford Upon Avon, which he plans to do in the near future when he has some time off from working on film. His goal is to perform \"Hamlet\" on the Swan stage (RSC main), one of Shakespeare's most challenging works.", "Voted #1 star most women would like to kiss under the mistletoe in a poll for Sky Movies.", "Has an older sister: 'Samantha Bloom' (qv).", "Attended and graduated from the Guildhall School of Music and Drama in 1999.", "Amusingly enough, his 2000 guest appearance in the television show, _Midsomer Murders (1997)_ (qv) references and discusses 'J.R.R. Tolkien' (qv)'s masterpiece \"The Lord of the Rings\" (Particularly \"Lothlorien\"), for which he was eventually cast (_The Lord of the Rings: The Fellowship of the Ring (2001)_ (qv)).", "Found his dog, Sidi, while filming _Kingdom of Heaven (2005)_ (qv).", "Wears a replica of the One Ring that says \"To wherever it may lead.\" It was given to him by one of the makeup artists on the Lord of the Rings trilogy.", "Is \"mildly dyslexic\".", "Has three A-Levels. One A in Art, one A in Photography and one C in Religious Studies.", "Speaks French fluently.", "His first car was a dark green VW Golf that cost £160.", "His first job was as a clay trapper at a pigeon shooting range when he was 13.", "First concert he attended was in Canterbery watching Jamiroquai.", "Is a supporter of the English football team Manchester United.", "He used to smoke, but quit in 2002, which started making him bite his nails instead.", "Was listed as a potential nominee on both the 2005 and 2006 Razzie Award nominating ballots. He was suggested in the Worst Supporting Actor category on the 2005 ballot for his performance in the film _Troy (2004)_ (qv). And he was suggested again the next year in the Worst Actor category for his performances in the films _Elizabethtown (2005)_ (qv) and _Kingdom of Heaven (2005)_ (qv). He failed to receive either nomination.", "Ranked 76 on VH1's 100 Hottest Hotties.", "Is 18 months younger than 'Judy Greer' (qv) but still plays her older brother in _Elizabethtown (2005)_ (qv).", "(September 5, 2006) Split with girlfriend 'Kate Bosworth' (qv).", "Voted #4 in Elle (France) magazine's \"15 Sexiest Men\" poll. [June 2006]", "Voted to be on the top 10 list of worst autograph signers by \"Autograph Collector\" magazine. [October 2003]", "Is one of only three actors who appear in two of the seven movies that grossed over one billion dollars in the box office: _The Lord of the Rings: The Return of the King (2003)_ (qv) and _Pirates of the Caribbean: Dead Man's Chest (2006)_ (qv). The others are 'Johnny Depp' (qv) and 'Bernard Hill' (qv).", "Was involved in a minor car collision in Hollywood on October 12, 2007. His childhood friend was hospitalized with a minor neck injury.", "(2007/08) Nomination for London Newcomer of the Year, for his theatre role in \"In Celebration\", Theatregoers' Choice 'Awards' (qv).", "Was named Empire magazine's #21 in the list of 100 Sexiest Stars.", "Gets name-checked in the theme song to the Disney Channel series _Hannah Montana (2006)_ (qv) when Hannah sings, \"Is that 'Orlando Bloom' (qv)?\".", "(February 21, 2008) Boyfriend of 'Miranda Kerr' (qv).", "(June 16, 2009) Was involved in a car collision in Los Angeles, which occurred a few miles from his 2007 car collision.", "(October 12, 2009) Was named UNICEF Goodwill Ambassador.", "Lives in Los Angeles, California.", "(June 21, 2010) Engaged to 'Miranda Kerr' (qv).", "Became a father for the 1st time at age 34 when his wife 'Miranda Kerr' (qv) gave birth to their son Flynn Christopher Blanchard Copeland Bloom on January 6, 2011.", "Has appeared twice on the cover of GQ magazine: January 2004 and November 2005.", "Good friends with Lord of the Rings co-star 'Liv Tyler' (qv).", "He was awarded a Star on the Hollywood Walk of Fame at 6927 Hollywood Boulevard in Hollywood, California on April 2, 2014.", "Although he played 'Lee Pace' (qv)'s son in _The Hobbit: The Desolation of Smaug (2013)_ (qv) and _The Hobbit: The Battle of the Five Armies (2014)_ (qv), he is more than two years his senior in real life.", "Has two tattoos and his left ear pierced.", "He was rumored to be a contender for the role of Batman in Batman v Superman: Dawn Of Justice (2016). The role eventually went to 'Ben Affleck' (qv).", "His mother, Sonia Constance Josephine (Copeland), was born in India, to an English family. During his early years, Orlando had believed that his biological father was Harry Bloom, a South African Jewish journalist and novelist, who was an anti-apartheid writer. As Harry was then unable to have children, Orlando's mother conceived him and his sister with a family friend, Colin Stone.", "On his mother's side, he is the grandson of Betty Constance Josephine (Walker) and Francis John Copeland. Orlando's mother's English ancestors had lived in Calcutta, India; Tasmania; Assam, India; and Melbourne, Australia.", "Friends with Courteney Cox, David Blaine and Eric Bana.", "Good friends with Kirsten Dunst, Jennifer Aniston and 'Johnny Depp' (qv)."], "quotes": ["On his character Legolas and the way Legolas moves: Legolas doesn't speak a lot - he prefers to let his actions speak for him. Legolas' moves are smooth and elegant, like a cat. You know how cats can jump and land steadily on their paws? That's what I'm trying to do. There's a strength in that, but it's very balletic. It's also bloody hard to do without falling over!", "It's all very surreal. I've had two very fantastic experiences. In The Lord of the Rings and in Black Hawk Down. I feel very lucky. I'm sort of doubly excited.", "I'm rather accident-prone, I have to admit. I've broken my back, my ribs, my nose, both my legs, my arm, my wrist, a finger and a toe and cracked my skull three times.", "On how he got the part in _Black Hawk Down (2001)_ (qv): My character breaks his back, and I had mentioned I had done that when I was up for the part. Who knows why one actor gets a job and another doesn't? I think it was just good timing that I happened to be there and I had had the experience - I mean, I was lucky.", "I broke my back. I fell out of a window... some friends had a roof terrace on the landing before their apartment, and I fell off the drain pipe. It gave way, actually, and I fell three floors. I was told I might not walk again. So, for about four days, I was contemplating that as a serious part of reality. Then they operated, and I walked out of the hospital in about twelve days.", "Vig used to call me \"elf boy\", and I'd call him \"filthy human\". As an Elf, I never got a scratch on me, never got dirty. And Vig would come out with blood and sweat all over him. And he'd say to me, \"Oh, go manicure your nails.\".", "On his 2002 Empire Award: I think my mum will have [my award] in pride of place somewhere beside my grandmother on the mantelpiece.", "We have these digs at each other. Viggo will go on about Elves and how they're always doing their nails and brushing their long, blonde hair, and being all prissy. And I just say: Well, at least I'm going to live forever! Got that? LIVE FOREVER!", "You have to be quite serious about tattoos [because] they're there forever.", "For a young actor like me to have the opportunity to work with the genre of actors and directors on The Lord of the Rings is unbelievable. There was no, should I should I not. It was like, where do I sign up! It was just bonkers. It was like here, have a life.", "It's a bit strange to be included in those sexiest people polls and all that sort of thing. I don't really even know who I'm up against!", "Elf Envy...they all had it.", "Aged nine, I had this girlfriend, and we used to have running races in the park to see who would be her boyfriend for the day. I wanted to be like Superman and fly in and rescue her. Once I realised Superman was an actor, I thought, \"That's for me.\".", "On being in love in general: I'm in love with love. It's heavenly when you're falling for someone and you can't stop thinking about her.", "The girls have got a bit excited. I spoke to my agent and she says she's wading through the fan mail. We've got bags of it. I'm like, \"Okay, well, what do we do with that, then?\" And she explains that we're sending them pictures and stuff, which is great.", "It was like a drama school of its own, being on set. Peter [Jackson] is a genius. 'Ian McKellen' (qv) is the greatest theatre actor in Britain. He's somebody I look at and say, \"That's what I would like to do.\" I had studied videos of his performances, so it was bizarre to be thrown into an environment with him.", "The thing with Ridley [Scott] is he's been doing this forever, he knows what it is he wants and how to get it. There's absolutely no messing around on set. Having said that, he's very accessible to actors, very open to what you want to do and willing to talk about it. He casts people who he feels are going to bring something to the role and allows them to take care of the situation, to do what it is that they do.", "I'm quite sensitive to women. I saw how my sister got treated by boyfriends. I read this thing that said when you are in a relationship with a woman, imagine how you would feel if you were her father. That's been my approach, for the most part.", "Theatre is something that I feel very important for an actor to keep doing. I think it keeps you sharp. But at the moment I'm intrigued with movies and filmmaking. It hasn't lured me away from theatre, but I'm just going to try to ride this wave and then jump onto another and see how far it takes me.", "I did send a girl a plane ticket, asking her for a visit, I guess that's quite romantic.", "I'd like to grow old gracefully or pain free at least.", "I know how lucky I am. I've no complaints about the work.", "Fame and celebrity were not something that I contemplated because they were too far ahead to imagine.", "When I'm not working, I prefer to sit and do nothing. The simple things suddenly become more enjoyable.", "If life isn't about humanity, then tell me what it's about, because I'd love to know.", "[on Pirates of the Carribean] It's the best gig in the world, are you kidding me?", "I always feel like a pirate.", "I see my career as a marathon. I don't see it as a sprint. Hopefully, I'll be around for a long time, to see my son grow up and have the opportunity to keep working on films.", "It's harder on some days than on others. It's (difficult) if ten cars with cameras are following you. My first priority is trying to protect my family.", "[on his wife and son] Attraction doesn't stop when a child is born. It's the opposite. Being a mom and dad makes you even sexier. It's the most challenging part of my life. And I feel blessed. Flynn totally turned my world upside down. Everything I considered important suddenly faded from the spotlight. Now my favorite pastime is to take a bath with my son.", "[on 'Johnny Depp' (qv)] -- Johnny's always telling me, \"Don't go for the money. Follow your heart, Orlando!\" He's a role model for me. He has integrity and makes choices that are brave and unusual. He doesn't have hissy fits; he conducts himself with grace and humility.", "[on 'Johnny Depp' (qv)] -- Johnny is Johnny. It's a whole different level. 'Johnny Depp' (qv) was a big draw. I've always admired him. To be on the set with somebody like him and see how he handles himself and see how he goes about it, it's a real privilege. To learn as you go. When the real captain of the Interceptor disappeared, and Johnny took control of the ship, it had a really strange effect on me. I looked up and saw Johnny in control of the ship with his pirate costume, and his gold teeth. It felt like we were really pirates for a couple minutes!"], "salary history": ["_Kingdom of Heaven (2005)_ (qv)::$2,000,000", "_Elizabethtown (2005)_ (qv)::$3,000,000", "_Pirates of the Caribbean: Dead Man's Chest (2006)_ (qv)::$11,900,000", "_Pirates of the Caribbean: At World's End (2007)_ (qv)::$11,900,000"], "birth date": "1977-01-13", "birth notes": "Canterbury, Kent, England, UK", "_actorID": "88", "_source": "IMDB", "actorID": "0089217", "created_utc_dt": "08/26/2019, 21:54:46"}