{"headshot": "https://m.media-amazon.com/images/M/MV5BMjEzMjA0ODk1OF5BMl5BanBnXkFtZTcwMTA4ODM3OQ@@._V1_UY98_CR1,0,67,98_AL_.jpg", "nick names": ["Lizzie", "Liz"], "birth name": "Elizabeth Chase Olsen", "height": "5' 6\" (1.68 m)", "mini biography": ["Elizabeth Chase \"Lizzie\" Olsen (born February 16, 1989) is an American actress. She is known for her roles in the films _Silent House (2011)_ (qv), _Liberal Arts (2012)_ (qv), _Godzilla (2014)_ (qv), _Avengers: Age of Ultron (2015)_ (qv), and _Captain America: Civil War (2016)_ (qv). For her role in the critically-acclaimed _Martha Marcy May Marlene (2011)_ (qv), she was nominated for numerous awards, including the Independent Spirit Award for Best Female Lead. She is the younger sister of actresses and fashion designers 'Mary-Kate Olsen' (qv) and 'Ashley Olsen' (qv).Olsen was born in Sherman Oaks, California to Jarnette \"Jarnie\", a personal manager, and David \"Dave\" Olsen, a real estate developer and mortgage banker. She is the younger sister of twins 'Mary-Kate Olsen' (qv) and 'Ashley Olsen' (qv), who became famous as TV and movie stars at an early age. Her oldest brother is named 'Trent Olsen' (qv), and she has two younger half-siblings. In 1996, Olsen's parents divorced. The Olsens have Norwegian and English ancestry.As a child, Olsen received ballet and singing lessons. She began acting at age 4, and by 11 she'd had small roles in How the West Was Fun and the straight-to-video series The Adventures of Mary-Kate & Ashley. Having appeared in her sisters' videos, when she was in the fourth grade, Olsen began to go on auditions for other projects, auditioning for the film Spy Kids. She almost quit acting in 2004 over the media frenzy surrounding Mary-Kate's eating disorder.She attended Campbell Hall School in North Hollywood, California from kindergarten through grade 12. After graduation, she enrolled at New York University's Tisch School of the Arts. In 2009, Olsen spent a semester studying in Moscow, Russia at the Moscow Art Theatre School through the MATS program at the Eugene O'Neill Theater Center.Olsen's breakout role came in 2011, when she appeared in the film Martha Marcy May Marlene. The film, along with Olsen's performance, received critical acclaim. Olsen was nominated for and won numerous critics awards for her portrayal of the titular character Martha, a girl suffering from delusions and paranoia after fleeing her life in a cult and returning to her family. She next appeared in the horror film remake Silent House, in which she played the role of Sarah. The film received mixed reviews, although Olsen's performance was once again praised. Olsen also appeared in the music video \"The Queen\" by Carlotta. Olsen filmed the movie Red Lights during mid-2011, and it was released in the U.S. on July 13, 2012. She starred in Josh Radnor's film Liberal Arts, which was released on January 22, 2012. She and Dakota Fanning starred in Very Good Girls, a 2013 release.In January 2013, Olsen was nominated for the BAFTA Rising Star Award. She co-starred in the 2013 American remake of the 2003 South Korean film Oldboy; she played Marie, a young social worker who developed a relationship with the protagonist, played by Josh Brolin. She played Edie Parker, Jack Kerouac's first wife and the author of the Beat Generation memoir You'll Be Okay, in Kill Your Darlings.In 2014, Olsen starred in Legendary's Godzilla a reboot, opposite Bryan Cranston and 'Aaron Taylor-Johnson' (qv). Olsen joined the Marvel Cinematic Universe by playing the Scarlet Witch in Avengers: Age of Ultron, the 2015 Avengers sequel. She first appeared as the character in a mid-credits scene of the film Captain America: The Winter Soldier, again alongside her Godzilla co-star Taylor-Johnson, who portrayed her brother Quicksilver. She reprised this role as the Scarlet Witch in the 2015 film Avengers: Age of Ultron and the 2016 film Captain America: Civil War.In September 2014, it was announced that Olsen would portray Audrey Williams, Hank Williams' wife, manager, and duet partner in the upcoming 2015 biopic I Saw the Light directed by Marc Abraham and starring Tom Hiddleston as Hank Williams.In January 2016, it was announced that Olsen would team up with her Avengers: Age of Ultron co-star Jeremy Renner in Taylor Sheridan's directorial feature film debut, Wind River.Olsen attended New York University's Tisch School of the Arts and the Atlantic Theater Company and graduated in March 2013 after six years of intermittent study. Her sisters' clothing line \"Elizabeth and James\" was named after her and her older brother.Olsen started dating fellow actor Boyd Holbrook in September 2012 after meeting him on the film Very Good Girls. They became engaged in March 2014 but called it off in January 2015.::Akram Braham"], "trade mark": ["Warm brown hair", "Clear green eyes"], "trivia": ["Younger sister of 'Mary-Kate Olsen' (qv) and 'Ashley Olsen' (qv).", "Elizabeth was born to 'Jarnette Olsen' (qv), a former dancer with the LA ballet, and 'David Olsen' (qv), a mortgage broker in Los Angeles. She is well-known as the little sister of 'Mary-Kate Olsen' (qv) and 'Ashley Olsen' (qv) and she has an older brother, 'Trent Olsen' (qv).", "A graduate of NYU Tisch School of the Arts and the Atlantic Theater Company Acting School in NYC.", "Was cast as the lead in _Martha Marcy May Marlene (2011)_ (qv), just two weeks before shooting.", "When she was growing up, her favorite actress and role model was 'Michelle Pfeiffer' (qv). She got to meet her while she was on the set of _I Am Sam (2001)_ (qv).", "She enjoys playing volleyball.", "One of her favorite films growing up was _Tremors (1990)_ (qv).", "Voted #94 in Ask men's 'most desirable' woman of 2012 list.", "Elizabeth has a younger half-brother, 'Jake Olsen' (qv).", "Elizabeth has a younger half-sister, Courtney 'Taylor Olsen' (qv).", "Worked with 'Aaron Taylor-Johnson' (qv) on three different films in two years: _Captain America: The Winter Soldier (2014)_ (qv), _Godzilla (2014)_ (qv), and _Avengers: Age of Ultron (2015)_ (qv).", "Her middle name is Chase because her parents wanted her to chase after her sisters.", "Ex-stepdaughter of 'McKenzie Olsen' (qv).", "Auditioned for the role of Daenerys Targaryen _Game of Thrones (2011)_ (qv) which eventually went to 'Emilia Clarke' (qv).", "As a child Lizzie took ballet and singing lessons. Lizzie auditioned for \"Spy Kids\", but she didn't get the role."], "quotes": ["[on _Martha Marcy May Marlene (2011)_ (qv)] 'Sean Durkin' (qv) really wrote a complex character that really hasn't been written, and that's challenging. It's such a smart way of writing, you totally understand the characters and I was just completely obsessed and in love with \"Martha\" and the script.", "When I was 14 or 15, I was a really good volleyball player, so I thought, 'Well, maybe I'll just get a scholarship to an Ivy League school through volleyball.' Then I quit when I decided to focus on theater.", "If you don't like something, talk about something else that's great and maybe someone else will discover it and think it's great too.", "I always went to see independent films, they're the movies I'm usually most excited to see.", "And I think in theater, people don't really focus on the media unless there's a huge superstar doing a play or something.", "I get way too much happiness from good food.", "I feel it is obvious when someone has thought too much about what they're wearing.", "I don't know about you, but my girlfriends have been my girlfriends forever, and they're my sisters and my family.", "I auditioned equally for film and theater. The difference is that theater has seasons, while film, it's always happening.", "I had a great drama teacher in high school, and that's when I started to learn about the history of theater.", "The tabloids create their own stories about people's lives that don't exist.", "\"The Sun Also Rises\", by 'Ernest Hemingway' (qv), is my favorite book. You feel manly reading it.", "My brother knows more about film sets than I do, because he works at New York Film Academy.", "I've always loved being a student.", "I've always had a complex about being taken seriously.", "I just need to figure out how to grow without compromising.", "I find acting conservatories really important. I've gone to four different ones, and all of them provided totally different tools for me.", "I believe that you are only in control of so much. So whatever you are not in control of you can't worry about.", "I also want to go to an Italian island and do cuisine properly with some famous Italian chef and, like, his mother.", "And I've been taking acting classes since I was 7.", "Everyone is always surprised by how old I am. They think I'm older, but it's always been that way. I'm the youngest of four - maybe you grow up quicker because you just watch the big people.", "I would love to date a chef. I'd probably get really fat, but I don't care.", "I think every day you try to soak up as much as you can to learn and understand things better.", "I really actually enjoy auditioning.", "I never wanted anyone to think that I would use my family name to get me anywhere.", "I like men-inspired outfits.", "It's interesting to watch myself with an audience; I'm trying hard to learn from it.", "I've never read a young adult novel, though. I'm sure I would love it, but I've never read one.", "I'm the first one who sees every romantic comedy in theaters.", "I'm the curvy one of the family.", "I'm terrified of improv. Improv in a show or in front of an audience sounds terrifying.", "Yes, I don't read books for entertainment.", "Well, I'd love to work with 'Kate Winslet' (qv) - she's amazing.", "Normally I don't feel like having a belly full of pasta.", "No, I wouldn't want the paparazzi ever following me in my life.", "My friends and I started making films when I was still in kindergarten.", "I think a lot of films do themselves a disfavor by putting in way too much information, and everyone knows what's gonna happen next, and no one can actually discover things as they go.", "I never understood why anyone would do magazines. Like, why would someone put their face out there so much? It's because those people reading magazines will go see the movie, so you do it.", "But I have a list of books that I want to read before I die, and whenever I get time to read something that isn't a script, I'll read something from that.", "And at NYU, I went to the Atlantic Theater Company, and they have two main points. One of them is to always be active in something instead of just feeling it. And the other is figuring out your character.", "You want everyone to succeed in your family.", "What keeps you confident in a healthy way is knowing that everyone else around you is going to support you and teach you and you're going to learn from them. I just feel open to learning from people.", "Movies are in a much longer production conversation before an actor is even involved. I always thought of actors as the last piece of the puzzle - so you're a tool.", "I've only done one shoot where it's modeling clothes, not like me in my environment. And the stylist, literally, I had her stand behind the photographer and do poses.", "I was embarrassed that I even wanted to become an actress because coming from L.A., with two older sisters in the business and a mom who had been a ballet dancer, it was such a cliché.", "I've been really interested in how people's physicality can manipulate their emotions, as opposed to emotions manipulating someone's physicality.", "It just felt playful, like you're playing make-believe. I can imagine myself during recess or before school on the playground being like, 'I'm Scarlet Witch! Pow!' To think of little girls being like 'I'm powerful and strong and tough!'- that's really cool.", "[on doing her nude scenes in _Martha Marcy May Marlene (2011)_ (qv)] My dad, when he found out there was nudity in the film, was like, are you sure this is a good idea? Me as a person, I don't even wear things that show my midriff ever. I'm a very covered-up human being.", "I used to think of him [Jeremy Renner] as this kind of grumpy, funny dude who, like, stretched a lot. But what I got to see making [Wind River] was a much more sensitive, full-rounded person."], "birth date": "1989-02-16", "birth notes": "Sherman Oaks, California, USA", "_actorID": "42", "_source": "IMDB", "actorID": "0647634", "created_utc_dt": "08/26/2019, 21:54:15"}