{"headshot": "https://m.media-amazon.com/images/M/MV5BMTc0NDQzODAwNF5BMl5BanBnXkFtZTYwMzUzNTk3._V1_UY98_CR1,0,67,98_AL_.jpg", "nick names": ["Ed", "Murph"], "birth name": "Edward Regan Murphy", "height": "5' 9\" (1.75 m)", "mini biography": ["Edward Regan Murphy was born April 3, 1961 in Brooklyn, New York, to 'Lillian Lynch' (qv) (born: Lillian Laney), a telephone operator, and Charles Edward Murphy, a transit police officer who was also an amateur comedian and actor. After his father died, his mother married 'Vernon Lynch' (qv), a foreman at a Breyer's Ice Cream plant. His brothers are 'Charlie Murphy' (qv) & 'Vernon Lynch' (qv) Jr. Eddie had aspirations of being in show business since he was a child. A bright kid growing up in the streets of New York, Murphy spent a great deal of time on impressions and comedy stand-up routines rather than academics. His sense of humor and wit made him a stand out amongst his classmates at Roosevelt Junior-Senior High School. By the time he was fifteen, Murphy worked as a stand-up comic on the lower part of New York, wooing audiences with his dead-on impressions of celebrities and outlooks on life.In the early 1980s, at the age of 19, Murphy was offered a contract for the Not-Ready-For-Prime-Time Players of _Saturday Night Live (1975)_ (qv), where Murphy exercised his comedic abilities in impersonating African American figures and originating some of the show's most memorable characters: Velvet Jones, Mr. Robinson, and a disgruntled and angry Gumby. Murphy made his feature film debut in _48 Hrs. (1982)_ (qv), alongside 'Nick Nolte' (qv). The two's comedic and antagonistic chemistry, alongside Murphy's believable performance as a streetwise convict aiding a bitter, aging cop, won over critics and audiences. The next year, Murphy went two for two, with another hit, pairing him with 'John Landis' (qv), who later became a frequent collaborator with Murphy in _Coming to America (1988)_ (qv) and _Beverly Hills Cop III (1994)_ (qv). _Beverly Hills Cop (1984)_ (qv) was the film that made Murphy a box-office superstar and most notably made him a celebrity worldwide, and it remains one of the all-time biggest domestic blockbusters in motion-picture history. Murphy's performance as a young Detroit cop in pursuit of his friend's murderers earned him a third consecutive Golden Globe nomination. Axel Foley became one of Murphy's signature characters. On top of his game, Murphy was unfazed by his success, that is until his box office appeal and choices in scripts resulted into a spotty mix of hits and misses into the late 1980s and early 1990s.Films like _The Golden Child (1986)_ (qv) and _Beverly Hills Cop II (1987)_ (qv) were critically panned but were still massive draws at the box office. In 1989, Murphy, coming off another hit, _Coming to America (1988)_ (qv), found failure with his directorial debut, _Harlem Nights (1989)_ (qv). _Another 48 Hrs. (1990)_ (qv) and his turn as a hopeless romantic in _Boomerang (1992)_ (qv) did little to resuscitate his career. However, his remake of 'Jerry Lewis' (qv)'s _The Nutty Professor (1996)_ (qv) brought Murphy's drawing power back into fruition. From there, Murphy rebounded with occasional hits and misses but has long proven himself as a skilled comedic actor with laudable range pertaining to characterizations and mannerisms. Though he has grown up a lot since his fast-lane rise as a superstar in the 1980s, Murphy has lived the Hollywood lifestyle with controversy, criticism, scandal, and the admiration of millions worldwide for his talents. As Murphy had matured throughout the years, learning many lessons about the Hollywood game in the process, he settled down with more family-oriented humor with _Doctor Dolittle (1998)_ (qv), _Mulan (1998)_ (qv), _Bowfinger (1999)_ (qv), and the animated smash _Shrek (2001)_ (qv), in a supporting role that showcased Murphy's comedic personality and charm. Throughout the 2000s, he further starred in the hits _The Haunted Mansion (2003)_ (qv), _Shrek 2 (2004)_ (qv), _Dreamgirls (2006)_ (qv) (for which he was nominated for a Best Supporting Actor Oscar), _Norbit (2007)_ (qv), _Shrek the Third (2007)_ (qv), and _Shrek Forever After (2010)_ (qv).Murphy was married to 'Nicole Mitchell Murphy' (qv) from 1993 to 2006. Murphy has eight children.::Anonymous"], "spouse": ["'Nicole Mitchell Murphy' (qv)::(18 March 1993 - 17 April 2006) ( divorced) ( 5 children)"], "trade mark": ["His goofy laugh", "His moustache", "Often plays multiple characters in one movie", "Big smile", "Boundlessly energetic"], "trivia": ["Was cast by _Saturday Night Live (1975)_ (qv) and NBC in 1980 when he was 19 years old.", "Ranked #78 in Empire (UK) magazine's Top 100 Movie Stars of All Time list. [October 1997]", "Born at 1:30pm-EST.", "In a TV commercial never shown in the United States, 'Eddie Murphy' (qv) kissed the front bumper of a Toyota sedan.", "He has 10 children. His first and oldest child was with Paulette McNeely: son, Eric (born on 10 July 1989). He also fathered 5 children with his ex-wife, 'Nicole Mitchell Murphy' (qv): daughter, 'Bria L. Murphy' (qv); son, Miles Mitchell (born on 7 November 1992); daughter, 'Shayne Audra Murphy' (qv); daughter, Zola Ivy (born on 24 December 1999, in Los Angeles); and daughter, Bella Zahra (born on 29 January 2002). Murphy also has a son, Christian (born on 29 November 1990) with 'Tamara Hood' (qv); a daughter, Angel Iris Murphy-Brown (born on 3 April 2007) with his ex-girlfriend, 'Mel B' (qv). He fathered 2 children with fiancée, 'Paige Butcher' (qv): daughter, Izzy Oona Murphy (born on May 3, 2016) & son, Max Charles Murphy (born on November 30, 2018.", "Attended Nassau Community College in Garden City, New York, before beginning his acting career.", "Did stand-up comedy at the same Bay Area Comedy Club as 'Robin Williams' (qv) and Caryn Johnson (whose stage name eventually became 'Whoopi Goldberg' (qv)) before getting into acting.", "Was voted Most Popular while attending Roosevelt Junior-Senior High School in Roosevelt, New York, due to the stand-up comedy routines he would perform in the school's auditorium and jokes he would tell classmates during lunch.", "Older brother 'Charlie Murphy' (qv) is also an actor. Younger brother Vernon Jr. was half of the hip-hop group K-9 Posse, which released two albums in the late 1980s and early 1990s.", "Tthe role of Winston Zeddemore in _Ghostbusters (1984)_ (qv) was originally written with him in mind and was meant to be much bigger. He turned it down in favour of starring in _Beverly Hills Cop (1984)_ (qv) and the role went to 'Ernie Hudson' (qv).", "Idolized 'Richard Pryor' (qv) and was inspired by him to do comedy. Went on to cast Pryor in his directorial debut _Harlem Nights (1989)_ (qv).", "At the height of his popularity in the mid 1980s, he began a music career, spawning the popular song \"Party All the Time\", which he recorded with 'Rick James' (qv). Also recorded an album in the early 1990s, entitled \"Whazzupwitu\", in which he performs in a video of the single of the same name, alongside 'Michael Jackson' (qv). Murphy appeared in Jackson's video \"Remember the Time\" in 1992 alongside fellow celebrities 'Magic Johnson' (qv) and 'Iman' (qv).", "Close friends with former late night talk show host 'Arsenio Hall' (qv)", "Paid for the funeral of comedic inspiration 'Redd Foxx' (qv).", "Was criticized tremendously by 'Spike Lee' (qv) for not using his show business stature to help black actors break into film.", "Named one of E!'s Top 20 Entertainers of 2001.", "(January 30, 2002) His wife 'Nicole Mitchell Murphy' (qv) gave birth to their daughter Bella Zahra.", "Is the only cast member of _Saturday Night Live (1975)_ (qv) to host while still a cast member. 'Nick Nolte' (qv) was to host but fell ill and Eddie replaced him.", "Was in a relationship with singer 'Whitney Houston' (qv) before she married former husband 'Bobby Brown' (qv).", "Former wife, 'Nicole Mitchell Murphy' (qv), is an Associate with Pre-Paid Legal Services, Inc.", "In 1997, he and his late-night encounter with 'Shalimar Seiuli' (qv) was ranked #61 on E! TV's The Greatest Shocking Moments In Entertainment History.", "His brother 'Charlie Murphy' (qv) is a regular performer on the hit sketch comedy show _Chappelle's Show (2003)_ (qv) on Comedy Central.", "Has a house in Englewood, New Jersey.", "Scored two hits on the Billboard Hot 100 singles charts with \"Party All the Time\" (US #2, 1985) and \"Put Your Mouth on Me\" (US #27, 1989).", "Although arguably the biggest movie star ever to come out of _Saturday Night Live (1975)_ (qv), he has never attended a cast reunion and is not known to even talk about having been on the show.", "Chosen as #10 in Comedy Central's 100 Greatest Stand-Up Comics of All Time.", "Stepson of 'Vernon Lynch' (qv).", "Hosted the MTV Movie 'Awards' (qv) in 1993", "At one time, he was considered to play The Grinch in _How the Grinch Stole Christmas (2000)_ (qv), before 'Jim Carrey' (qv) was cast.", "Met 'Nicole Mitchell Murphy' (qv) in 1988 at an NAACP Image 'Awards' (qv) show. They lived together for a year and a half before they married. They were married at the Grand Ballroom of The Plaza Hotel in New York City.", "Was one of the last movie actors to sign an exclusive contract with a studio. In this case, it was Paramount Pictures, which released all of his early films.", "'Chris Rock' (qv) is an admirer of Murphy and considers him his role model and inspiration to become an actor and comedian.", "Is a huge fan of the original _Star Trek (1966)_ (qv) series.", "Nephew of 'Uncle Ray Murphy' (qv).", "The first actor to receive $1,000,000 for his first film.", "Is a huge fan of 'Elvis Presley' (qv) and 'Kylie Minogue' (qv).", "Is mentioned, along with 'Vanessa Redgrave' (qv), and 'Joe Piscopo' (qv) in the song \"Jammin' Me\", by 'Tom Petty' (qv) and the Heartbreakers.", "He and his ex-wife, 'Nicole Mitchell Murphy' (qv), celebrated their first wedding anniversary in Montego Bay, Jamaica where they stayed for one week.", "Ex-girlfriend 'Mel B' (qv) gave birth to a daughter, Angel Iris Murphy Brown, on 3 April 2007.", "One of 115 people invited to join AMPAS in 2007.", "Is a huge fan of the bands Ratt and Cinderella, particularly the former as can be seen in _The Golden Child (1986)_ (qv) where their song \"Body Talk\" (from their 1986 album \"Dancing Undercover\") is featured.", "Got the idea of playing multiple roles in one film after watching another one of his idols, 'Peter Sellers' (qv), in one of his all time favorite films _Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964)_ (qv).", "Married 'Tracey E. Edmonds' (qv) in a private ceremony on an island off Bora Bora on 1 January 2008, but their nuptials were not legal in the United States. They initially decided to renew their vows in America, but eventually separated two weeks after their island wedding.", "After picking up a pre-op transsexual prostitute on Santa Monica Boulveard in West Hollywood, he was arrested by LAPD deputies, but finally released (2 May 1997).", "Was heavily influenced by 'Bill Cosby' (qv).", "Born to Charles Edward Murphy, a transit police officer, and his wife Lilian, a telephone operator. Charles left the family when Eddie was three years old and was stabbed to death five years later. Charles was also an amateur stand-up comedian.", "Is an avid fan of professional wrestling, with 'Hulk Hogan' (qv) as his all time favorite wrestler.", "Supports Senator 'Barack Obama' (qv)'s bid to win the Democratic nomination for the 2008 presidential election.", "Was considered for the movie _Star Trek IV: The Voyage Home (1986)_ (qv) as a UFO-file who gets involved with Captain Kirk's search for a humpback whale.", "Although he frequently plays multiple characters in films and television, and has lent his voice to a dozen animated projects, he has never once voiced more then one character in the same animated project.", "Was considered for the role of Furious Styles in _Boyz n the Hood (1991)_ (qv), which went to 'Laurence Fishburne' (qv).", "At first, he denied that he was the father of 'Mel B' (qv)'s daughter Angel until a DNA-test proved that he was.", "He does an excellent impersonation of 'Stevie Wonder' (qv). This can be seen and heard on Saturday Night Live; Best of 'Eddie Murphy' (qv) (last scene).", "He doesn't drink alcohol, smoke cigarettes and the only drug he takes is caffeine.", "Sold his Granite Bay vacation home, near Sacramento, for $6.1 million shortly after divorcing ex-wife, Nicole. [2008]", "Vacations in Hawaii nearly every year, almost always staying at Maui's Four Seasons Hotel.", "Was considered for the title role in _Candyman (1992)_ (qv), which went to 'Tony Todd' (qv).", "The first (and so far only) actor to receive a BAFTA nomination for a voice-over performance - Best Supporting Actor for _Shrek (2001)_ (qv).", "He was offered the lead role in _Who Framed Roger Rabbit (1988)_ (qv) that went to 'Bob Hoskins' (qv), but turned it down. He deeply regrets this decision.", "Has a state of the art recording studio in his basement. 'Simon Cowell' (qv) once heard an album Murphy put out and called it \"crap\".", "He was nominated for a 2013 New Jersey Hall of Fame for Arts and Entertainment.", "The longest he has gone without a Razzie nomination is 13 years, between _Harlem Nights (1989)_ (qv) and _The Adventures of Pluto Nash (2002)_ (qv)/_I Spy (2002)_ (qv)/_Showtime (2002)_ (qv).", "Has played a human who can talk to animals (_Doctor Dolittle (1998)_ (qv)) and an animal (Donkey) who can talk to humans (_Shrek (2001)_ (qv)).", "He was awarded a Star on the Hollywood Walk of Fame at 7000 Hollywood Boulevard in Hollywood, California on June 26, 1996.", "He was nominated for the 2014 New Jersey Hall of Fame in the Arts and Entertainment Category.", "Won the 2015 Mark Twain Prize for American Humor, awarded by the John F. Kennedy Center for the Performing Arts, Washington, DC.", "Is an admirer of martial artist 'Bruce Lee' (qv), naming him as the only actor he has ever consciously imitated onscreen. Murphy first adopted Lee's \"tough guy face\" in _48 Hrs. (1982)_ (qv) and has quipped that, since then \"whenever you see me holding a gun onscreen, I'm doing Bruce!\".", "Even though he played cops or characters with guns, he deeply dislikes guns.", "He was nominated for the 2015 New Jersey Hall of Fame for his services in the Performance Arts.", "He refused to return to _Saturday Night Live (1975)_ (qv) for several years after 'David Spade' (qv) made an insulting joke about him on Weekend Update in the 90's. However, Murphy himself made an similarly insulting joke about 'Garrett Morris' (qv) on Weekend Update in the early 80's.", "He turned down the role of James Carter in _Rush Hour (1998)_ (qv) in order to star in _Holy Man (1998)_ (qv). The role went to 'Chris Tucker' (qv).", "Had his ninth child with girlfriend 'Paige Butcher' (qv), a daughter Izzy Oona Murphy (b. May 3, 2016).", "Eddie's multiple roles have been played in the films: _Coming to America (1988)_ (qv) (4), _Vampire in Brooklyn (1995)_ (qv) (3), _The Nutty Professor (1996)_ (qv) (7), _Bowfinger (1999)_ (qv) (2), _Nutty Professor II: The Klumps (2000)_ (qv) (8), _Norbit (2007)_ (qv) (3), _Meet Dave (2008)_ (qv) (2).", "Uncle of 'Brandon Lynch' (qv).", "Son of 'Lillian Lynch' (qv).", "Cousin of 'Ray Murphy Jr.' (qv).", "Keeps a bowling alley in the basement at his home.", "Owns the original 'Ernie Barnes' (qv) painting \"The Sugar Shack\" from the popular TV series _Good Times (1974)_ (qv).", "Is a big fan of the TV series _Jail (2007)_ (qv).", "In his first animated role he played a dragon. In his second he played a donkey who falls in love with a dragon.", "Two of his movies - _Beverly Hills Cop (1984)_ (qv) and _The Golden Child (1986)_ (qv) - started out as serious action films with 'Sylvester Stallone' (qv) and 'Mel Gibson' (qv) respectively, before becoming comedies.", "Ranked 5th highest grossing actor of all time with his previous films grossing $3.8 billion, as of 2016.", "Graduated high school as Most Popular boy.", "Close friends with Jeffrey Katzenberg.", "One of two African American actors in the top 5 highest grossing actors of all time, the other actor is 'Morgan Freeman' (qv), as of 2016.", "The 2015 recipient of the Mark Twain Prize for American Humor.", "Considers his impression of his brother Charlie his best impression.", "He turned down the lead role in _Life with Mikey (1993)_ (qv) in order to star in _The Distinguished Gentleman (1992)_ (qv). The role went to 'Michael J. Fox' (qv).", "He agreed to star in _Showtime (2002)_ (qv) purely to work with 'Robert De Niro' (qv).", "He expressed interest in 'Steve Martin' (qv)'s role in _Dirty Rotten Scoundrels (1988)_ (qv).", "His comedic influences include 'Bill Cosby' (qv), 'Richard Pryor' (qv), 'Redd Foxx' (qv), and 'Robin Williams' (qv).", "He was considered to voice the Genie in _Aladdin (1992)_ (qv).", "He was considered to star in _Driving Miss Daisy (1989)_ (qv) opposite 'Bette Midler' (qv).", "He was a candidate to play Jules Winfield in _Pulp Fiction (1994)_ (qv). The role went to 'Samuel L. Jackson' (qv).", "He has donated money to the AIDS Foundation, and cancer, education, creative arts, family/parent support, health and homeless charities. He has donated to the Martin Luther King, Jr. Center, various cancer charities and $100,000 to the Screen Actors' Guild's strike relief fund.", "'Frank Oz' (qv) wanted him to voice Audrey II in _Little Shop of Horrors (1986)_ (qv).", "He agreed to star in _Bowfinger (1999)_ (qv) purely to work with 'Steve Martin' (qv), whom he had long admired.", "Friends with 'Redd Foxx' (qv), 'Arsenio Hall' (qv). and 'Sean 'Diddy' Combs' (qv).", "'Adam Sandler' (qv) tried to get him to costar as Dr. Buddy Rydell in _Anger Management (2003)_ (qv). The role went to 'Jack Nicholson' (qv).", "He was considered to play the Eighth Doctor in _Doctor Who (1996)_ (qv).", "He was considered for 'Chris Rock' (qv)'s role in _Lethal Weapon 4 (1998)_ (qv).", "He was considered for 'Michael Keaton' (qv)'s role in _Gung Ho (1986)_ (qv).", "He originally wasn't supposed to be a cast member on _Saturday Night Live (1975)_ (qv). When 'Jean Doumanian' (qv) was gathering her cast, she had another token black cast member in mind ('Robert Townsend' (qv), after failing to get comedian and street performer Charlie Barnett, who, despite being talented enough for TV, was a barely-literate high school dropout), but an SNL writer at the time named 'Neil Levy' (qv) and Murphy's agent urged Doumanian to give him a chance. Murphy was let on the show after Townsend forgot (or refused) to sign his cast member contract, and even then, Murphy was relegated to background roles (even though he was a feature player along with 'Patrick Weathers' (qv), 'Yvonne Hudson' (qv), and 'Matthew Laurence' (qv)) and fought hard to be more prominent on the show. When Doumanian was running out of material for the episode hosted by 'Ray Sharkey' (qv), Murphy stepped in and did a stand-up bit about black people fighting and was promoted to repertory player on the next episode (hosted by 'Karen Black' (qv).", "He was the original choice for Steven Hiller in _Independence Day (1996)_ (qv).", "He has apologised for the homophobic jokes he made in his stand-up routine, such as in 'Eddie Murphy' (qv): Delirious (1983).", "He named _Best Defense (1984)_ (qv), _The Golden Child (1986)_ (qv), _Beverly Hills Cop III (1994)_ (qv), _Vampire in Brooklyn (1995)_ (qv) and _The Adventures of Pluto Nash (2002)_ (qv) as among his least favourite films of his own.", "He was going to star in _Bad Boys (1995)_ (qv) opposite 'Wesley Snipes' (qv).", "He made fun of _Best Defense (1984)_ (qv) when he hosted _Saturday Night Live (1975)_ (qv) in 1984, joking that the reason he did the film was that \"four guys came in the room carrying a cheque.", "He was originally considered to star in _Critical Condition (1987)_ (qv). It became a 'Richard Pryor' (qv) vehicle.", "Had his tenth child with girlfriend 'Paige Butcher' (qv), a son Max Charles Murphy (b. November 30, 2018).", "Eddie now has 10 children he and his fiancée 'Paige Butcher' (qv) welcomed their second child a son named Max on Friday November 30th 2018 weighing 6 LBs 14 Oz and measuring 19 in long their first child daughter Izzy Oona was born May 3rd 2016 weighing 7 LBs 15 Oz and 19.5 in long average birth weight between the 2 is 7 LBs 6.5 Oz average length at birth is 19 1/4 in."], "quotes": ["[in 1985] I'd like to produce, direct, write, score, and star in a film in exactly the way ['Charles Chaplin' (qv)] did. I'll do that before I'm thirty.", "Every bad decision I've made has been based on money. I grew up in the projects and you don't turn down money there. You take it, because you never know when it's all going to end. I made [_Beverly Hills Cop III (1994)_ (qv)] because they offered me $15 million. That $15 million was worth having 'Roger Ebert' (qv)'s thumb up my ass.", "I started out as an impressionist and that's all about observing - how people move, their voice quality, their attitudes and quirks.", "[on why he accepted a part in _Best Defense (1984)_ (qv)] The door opened and four guys came in carrying a check.", "That's my idol, 'Elvis Presley' (qv). If you went to my house, you'd see pictures all over of Elvis. He's just the greatest entertainer that ever lived. And I think it's because he had such presence. When Elvis walked into a room, 'Elvis Presley' (qv) was in the fucking room. I don't give a fuck who was in the room with him---['Humphrey Bogart' (qv)], 'Marilyn Monroe' (qv).", "If you're involved in with something that's original, you know, you'll always go back and try to rehash it.", "The advice I would give to someone is to not take anyone's advice.", "I keep telling people I'll make movies until I'm fifty and then I'll go and do something else. I'm going to be a professional gentleman of leisure.", "The only reason I did _Showtime (2002)_ (qv) was 'Robert De Niro' (qv). I definitely consider him to be in the top 5 all time best actors.", "[on rumours he will play The Riddler in the next Batman movie] I would love to be in one of those Batman movies. 'Jim Carrey' (qv) did The Riddler once and he did a wonderful job. Egghead, I could be Egghead.", "[on 'Dan Aykroyd' (qv)] Robotic the way he handles people: \"Ah, yes, good to meet you.\" Very straightforward, very clean-cut, very polite, real nice guy.", "[on 'Richard Pryor' (qv), 'Charles Chaplin' (qv), 'Bill Cosby' (qv) and 'George Carlin' (qv) being his greatest influences] I feel like those are the most brilliant comic minds ever. You can draw a line from them to anyone who's trying to do comedy - or just be funny - today, including me.", "I know what I'm capable of doing and what I'm capable of not doing. To be perfectly honest, I'm a little afraid of doing a straight dramatic film. I'm not saying I couldn't do it. I'm saying I'm afraid to. Everyone is afraid of failure.", "With the success that I've had and the money that I make, if I and a white man went out to get a cab together, the cab wouldn't stop for me. It would stop for the white man.", "[on why he lost his trademark laugh] I don't laugh like that anymore, somehow it doesn't come out. It's weird to change something that's as natural as that. But it started out as a real laugh, then it turned into people laughing because they thought my laugh was funny, and then there were a couple of times where I laughed because I knew it would make people laugh. Then it got weird. People came up to me and said, \"Do that laugh,\" or if you laugh, someone turns around and goes, \"Eddie?\" I just stopped doing it.", "[on what his younger self would think of his family films] Would the 27-year-old have wondered what I was doing in _Doctor Dolittle (1998)_ (qv)? No. Or in those _Shrek (2001)_ (qv) movies? No. But, you know, both the 27-year-old and the 48-year-old was like, \"Why am I in _Imagine That (2009)_ (qv)?\" The movie didn't have a chance at the box office - it's just me and this little girl and a blanket.", "[on being the biggest star from _Saturday Night Live (1975)_ (qv)] That's only because 'John Belushi' (qv)'s dead. Belushi's like Spanky of the Little Rascals series. I guess that makes me Stymie, but that's cool. I'll be Stymie. Think of all the people who came off that show. I bet you could figure out the combined grosses of people who came off Saturday Night Live in the movies - me, 'Adam Sandler' (qv), 'Will Ferrell' (qv), 'Mike Myers' (qv), 'Bill Murray' (qv), 'Dan Aykroyd' (qv). I bet it's $15 billion. It's no coincidence - that show's like Harvard for a comic actor. When you come off the show and get into the movie business, it's like you're moving in slow motion for a couple of years. You've been working like a crazy person in a pressure cooker, then you're in the movies, just sitting in your trailer.", "[on returning to stand-up comedy] If I ever get back onstage, I'm going to have a really great show for you all - an hour and a half of stand-up and about 40 minutes of my shitty band. But I don't know. The way that used to come about, you'd be around the house, hanging out, say something funny and it'd be like, \"I'm going to go to the club, try that out tonight.\" That still happens, but it's been a long time. I'm not that guy in the leather suit anymore. The hardest thing for comics nowadays is to find your fucking voice.", "[on his legacy] Technology has it to where they gonna play this stuff forever. But the reality is, all this shit turns into dust, everything is temporary. No matter what you do, if you're around here long enough, you'll wind up dribbling and shitting on yourself, and you won't even remember the shit you did. I saw this documentary on 'Ronald Reagan' (qv), and it was like, \"Whoa.\" They say he came into the house, and he had the toy White House that he had taken out of a fish tank, and he goes, \"I don't know what I'm doing with this, but I know it has something to do with me.\" He had even forgotten he was the president. No matter what you do, that shit is all getting turned into gobbledy­gook. In 200 years, it's all dust, and in 300 years, it ain't nothing, and in 1,000 years, it's like you wasn't even fucking here. But if you're really, really lucky, if you really did something special, you could hang around a little longer.", "[on 'Charlie Murphy' (qv)] We were so different that people would see us and be like, \"Y'all are brothers? I didn't know you was brothers.\" And Charlie was in gangs, and even now, Charlie's like extra ultramacho - piranha, pit bulls, hatchets, axes, machetes. He has a black belt in karate. I got through a lot of school because the kids knew I was his brother, nobody was fucking with me. \"You don't fuck with Eddie, his brother will kill you.\" Charlie was a really tough guy.", "[on scripts he receives] They'll come to you with this stuff, dialogue like \"Hey, jive turkey!\" Like, \"you can play this irate black man.\" I'm going, \"Hey, you have a script?\" \"No, that's it, you're angry with society and you beat up a Mafia person and you're friends with 'Drew Barrymore' (qv).\" It's like they had to throw in a white person there.", "[in 1982, about _Saturday Night Live (1975)_ (qv)] If I don't die in a plane crash or something, this country has a rare opportunity to watch a great talent grow.", "[2015] I'm not doing anything unless the script's incredible. I did some movies where they offer you a bunch of money and you go, \"OK, I'll do it!\" I've done enough of those - I don't have to do them any more.", "[2015] I just finished a movie. But it's not a comedy. It's called _Mr. Church (2016)_ (qv), directed by 'Bruce Beresford' (qv). I hadn't done a movie in five years; I'd been waiting for something really special. Then this thing came along. It got me off the couch. It's about a man who's hired to cook for a dying woman for six months and becomes part of the family. You'll be hearing about it.", "[His high school yearbook quote] In reality, all men are sculptors, constantly chipping away the unwanted parts of their lives, trying to create their idea of their masterpiece.", "[on the hits and misses on his career] I kind of see it from a different perspective than the way you guys [journalists] may see it. In my view, I've never had a flop movie or a movie that didn't work. If I did the movie, and they paid me lots and lots of money to do it, it's a f-ing smash!\". \"Any movie that I was in that they paid me a lot of money for was a f-ing smash. And, to be perfectly honest, we celebrate Pluto Nash at my house. We don't have Christmas Day, we have Pluto Nash Day. And we don't have Halloween, we have _Vampire in Brooklyn (1995)_ (qv).\"", "Well, I don't think the New Yorker will be singing the praises of _Meet Dave (2008)_ (qv). \"That was a gem!\" I don't know if there's some \"Pluto Nash\" Appreciation Club out there. The Friends of \"Holy Man\" Group. The \"Vampire in Brooklyn\" Club.", "I haven't read a review in, easily, 20, 25 years. I used to. I remember when _Coming to America (1988)_ (qv) came out, Siskel and Ebert gave it two thumbs way down, saying it sucked. Then 10, 15 years later, I remember seeing them do a retrospective and they were both, \"The classic 'Coming to America' blah blah blah.' The shelf life of movies changes over the years."], "salary history": ["_Saturday Night Live (1975)_ (qv)::$4,500 /episode (1981)", "_Saturday Night Live (1975)_ (qv)::$30,000 /episode (1982)", "_48 Hrs. (1982)_ (qv)::$450,000", "_Best Defense (1984)_ (qv)::$1,000,000", "_Beverly Hills Cop II (1987)_ (qv)::$8,000,000", "_Coming to America (1988)_ (qv)::$8,000,000", "_Another 48 Hrs. (1990)_ (qv)::$7,000,000", "_Beverly Hills Cop III (1994)_ (qv)::$15,000,000", "_The Nutty Professor (1996)_ (qv)::$16,000,000", "_Doctor Dolittle (1998)_ (qv)::$17,500,000", "_Nutty Professor II: The Klumps (2000)_ (qv)::$20,000,000 (and 20% of the gross)", "_Shrek (2001)_ (qv)::$3,000,000", "_Dr. Dolittle 2 (2001)_ (qv)::$20,000,000", "_The Adventures of Pluto Nash (2002)_ (qv)::$20,000,000", "_Shrek 2 (2004)_ (qv)::$10,000,000", "_Shrek Forever After (2010)_ (qv)::$4,000,000 (Back end bonus)", "_Tower Heist (2011)_ (qv)::$7,500,000"], "birth date": "1961-04-03", "birth notes": "Brooklyn, New York City, New York, USA", "_actorID": "13", "_source": "IMDB", "actorID": "0000552", "created_utc_dt": "08/26/2019, 21:53:56"}