{"headshot": "https://m.media-amazon.com/images/M/MV5BMTkyNDQ3NzAxM15BMl5BanBnXkFtZTgwODIwMTQ0NTE@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["The People's Champion", "The Brahma Bull", "The Great One", "The Rock", "Dewey"], "birth name": "Dwayne Douglas Johnson", "height": "6' 4\" (1.93 m)", "mini biography": ["Dwayne Douglas Johnson, also known as The Rock, was born on May 2, 1972 in Hayward, California. He is the son of 'Ata Johnson' (qv) (born Feagaimaleata Fitisemanu Maivia) and professional wrestler 'Rocky Johnson' (qv) (born Wayde Douglas Bowles). His father, from Amherst, Nova Scotia, Canada, is black (of Black Nova Scotian descent), and his mother is of Samoan background (her own father was 'Peter Fanene Maivia' (qv), also a professional wrestler). While growing up, Dwayne traveled around a lot with his parents and watched his father perform in the ring. During his high school years, Dwayne began playing football and he soon received a full scholarship from the University of Miami, where he had tremendous success as a football player. In 1995, Dwayne suffered a back injury which cost him a place in the NFL. He then signed a three-year deal with the Canadian League but left after a year to pursue a career in wrestling.He made his wrestling debut in the USWA under the name Flex Kavanah where he won the tag team championship with Brett Sawyer. In 1996, Dwayne joined the WWE and became Rocky Maivia where he joined a group known as \"The Nation of Domination\" and turned heel. Rocky eventually took over leadership of the \"Nation\" and began taking the persona of The Rock. After the \"Nation\" split, The Rock joined another elite group of wrestlers known as the \"Corporation\" and began a memorable feud with 'Steve Austin' (qv). Soon the Rock was kicked out of the \"Corporation\". He turned face and became known as \"The Peoples Champion\". In 2000, the Rock took time off from WWE to film his appearance in _The Mummy Returns (2001)_ (qv). He returned in 2001 during the WCW/ECW invasion where he joined a team of WWE wrestlers at _The Scorpion King (2002)_ (qv), a prequel to _The Mummy Returns (2001)_ (qv).Dwayne has a daughter, Simone Alexandra, born in 2001, with his ex-wife 'Dany Garcia' (qv), and daughters, Jasmine, born in 2015, and Tiana Gia, born in 2018, with his wife, singer and songwriter 'Lauren Hashian' (qv).::Zak Hamza < mj_zak@yahoo.co.uk> / ritual < vsritual@vsritual.com>"], "spouse": ["'Lauren Hashian' (qv)::(18 August 2019 - present) ( 2 children)", "'Dany Garcia' (qv)::(3 May 1997 - 19 May 2008) ( divorced) ( 1 child)"], "trade mark": ["Wrestling finisher: The People's Elbow", "As his wrestling character The Rock, often referred to himself in the third person.", "Removing elbow pad before delivering the People's Elbow", "'Trademark' (qv) move: Spine on the Pine (modified Spinebuster)", "'Trademark' (qv) move: Three open handed punches, followed by a hand spitting motion, followed by a fourth punch which typically levelled the opponent.", "'Trademark' (qv) move: Flowing DDT", "'Trademark' (qv) move: Floatover DDT", "'Trademark' (qv) move: Sharpshooter", "'Trademark' (qv) move: Samoan Drop", "'Trademark' (qv) move: Charging Double Leg Spinebuster", "Finishing move: Rock Bottom", "'Trademark' (qv) Phrase: \"Just bring it!\"", "'Trademark' (qv) Phrase: \"Lay a smack down on your candy ass\"", "Very muscular physique", "Towering height", "Deep commanding voice", "'Trademark' (qv) phrase: \"Do you smell what The Rock is cookin'?\""], "trivia": ["First ever 8 time WWE World Heavyweight Champion.", "Was the first person to ever kick out of the \"Stone Cold Stunner\" while fighting Stone Cold 'Steve Austin' (qv) ('Steve Austin' (qv)) at Wrestlemania XV.", "His favorite eyebrow trademark (not including his own) is 'Groucho Marx' (qv)'s.", "Was a member of Miami's NCAA national championship football team (1991). Later in his career, he played as 'Warren Sapp' (qv)'s backup at defensive tackle.", "Received guidance and training from 'Bret Hart' (qv) (aka \"The Hitman\") when he first came to the WWF.", "A member of the elite group of wrestlers, such as 'Hulk Hogan' (qv) and 'Ric Flair' (qv) to hold the WWF and WCW world titles on several different occasions.", "Named one of Entertainment Television's \"top 20 entertainers of 2001\".", "He once appeared on _Martha Stewart Living (1996)_ (qv) to cook one of his favorite family recipes.", "Attended and graduated from Freedom High School in Bethlehem, Pennsylvania. Another former student was 'Daniel Dae Kim' (qv).", "Has a wax figure likeness of himself at Madame Tussaud's museum.", "Met, 'Dany Garcia' (qv), when she was 22, and they married the day after his 25th birthday. He did not meet her parents until shortly before their wedding. 'Tonga Fifita' (qv), the wrestler known as Haku, was his Best Man.", "Decided to attend the University of Miami in Coral Gables, Florida because they did not openly express interest in him.", "His $5.5-million paycheck for _The Scorpion King (2002)_ (qv) earned him a listing in the Guinness Book of World Records, as his salary was the highest for any actor receiving top billing for the first time.", "First athlete to host _Saturday Night Live (1975)_ (qv) for a second time. Though, he was promoting the film (_The Scorpion King (2002)_ (qv)) with his second stint, his pro-wrestling and CFL background makes him the show's first two-time athlete-host.", "He owns the rights to name \"The Rock\" (including logos, phrases, etc). The rights to the name \"The Rock\" were previously owned by WWE, Inc. (which is the main reason why 'Vince McMahon' (qv) has received executive producer credits in some of the Rock's films).", "Once, while putting on a show for WWF road agent Pat Patterson, sold his opponent's moves so well, his then-girlfriend 'Dany Garcia' (qv) thought he was actually hurt.", "Growing up, he considered what his father did, \"wrestling\"; he once tried amateur wrestling, and found he did not like this.", "He was offered a promotional deal with \"Dunkin' Donuts\", which would have seen the company name a donut after him. Thinking it would make him appear big-headed, he graciously turned the offer down.", "His last match in the WWE before leaving to film _The Rundown (2003)_ (qv) was against 'Bill Goldberg' (qv) at the 2003 Backlash Pay-Per-View.", "Accidentally smashed the tail-light of a Porsche while filming the movie _Walking Tall (2004)_ (qv).", "Dwayne's father, a native of Canada, is black, of Black Nova Scotian descent, and was born in Amherst, Nova Scotia (Dwayne's father's ancestors were African-Americans who moved to Canada). Dwayne's mother is of Samoan background.", "Was teammates with 'Doug Flutie' (qv) with the Calgary Stampeders of the Canadian Football League (CFL).", "In his first semester at the University of Miami, he earned a .7 grade point average. He was majoring in criminology.", "His wedding anniversary falls on the same day as 'Stu Hart' (qv)'s birthday. Stu's son, 'Bret Hart' (qv), would often give him tips on how to improve in his matches.", "Has played his own father in an episode of the situation comedy _That '70s Show (1998)_ (qv).", "In _The Rundown (2003)_ (qv), he tells one of the rebels that 'Muhammad Ali' (qv) would win a match against 'Mike Tyson' (qv). To intimidate his opponents, his father, 'Rocky Johnson' (qv), would often perform the \"Ali shuffle\" during his wrestling matches.", "While filming _The Scorpion King (2002)_ (qv), accidentally hit 'Michael Clarke Duncan' (qv) during a fight sequence. Duncan leaned in too far for a hit, and his chin connected with The Rock's elbow.", "Is the third youngest superstar to hold the IC Championship. 'Jeff Hardy' (qv) is the youngest at 23, and 'Randy Orton' (qv) is the second youngest, also at 23, only a few months older than Hardy.", "He weighed 290 pounds during his college football career, but reduced his weight to about 265 pounds late in his wrestling career. He has lost an addition 30 pounds recently for his part in _Southland Tales (2006)_ (qv), some of which he since regained.", "Dwayne is a skilled light tackle salt water fisherman.", "Major Title Wins Include: WWF/WWE Heavyweight Title (8); WWF Intercontinental Title; WWF Tag Team Title w/'Mick Foley' (qv); WWE Tag Team Title w/'Chris Jericho' (qv); WWF Royal Rumble Winner; WCW Heavyweight Title; USWA Tag Team Titles w/Bret Sawyer.", "Son of 'Ata Johnson' (qv) and 'Rocky Johnson' (qv).", "Ranked #61 on VH1's 100 Hottest Hotties", "The WWE named their Thursday night show _WWE SmackDown Live (1999)_ (qv) after one of The Rock's catchphrases, \"Layeth the Smack Down\".", "Officially proclaimed himself \"The Rock\" during a promo where he attacked 'Ron Simmons' (qv) (Faarooq) in a _WWE Raw (1993)_ (qv) telecast.", "He originally chose \"Flex Kavana\" as his stage name, because he didn't want to seem like he was trading off his family's legacy ('Rocky Johnson' (qv), his father, and High Chief 'Peter Fanene Maivia' (qv) his grandfather). Ironically, WWE officials came up with \"Rocky Maivia\" after they felt \"Flex Kavana\" wasn't exactly a great name.", "When Rocky Maivia was first considering going by the name The Rock for short, he resisted because he felt this would be stealing the former nickname of WWE Hall-of-Famer 'Don Muraco' (qv). He was talked into this by 'Vince Russo' (qv).", "Was good friends with the late actor 'Michael Clarke Duncan' (qv).", "His cousin, 'Tanoai Reed' (qv), is his stunt double for many of his movies.", "During a visit to Samoa in July 2004, he was anointed by Head of State Susuga Malietoa Tanumafili II with the chiefly title of 'Seiuli, Son of Malietoa'.", "Attended the Republican National Convention (2004).", "Cousin of 'Solofa Fatu Jr.' (qv) (Rikishi) and 'Yokozuna' (qv) ('Yokozuna' (qv)).", "As of 2017, _Doom (2005)_ (qv), _Southland Tales (2006)_ (qv), _Faster (2010)_ (qv), _Pain & Gain (2013)_ (qv) and _Baywatch (2017)_ (qv) are the only R-rated films he has starred in. All of his other films have received PG-13, at the most.", "While filming _Be Cool (2005)_ (qv), he was _Punk'd (2003)_ (qv) by 'Ashton Kutcher' (qv)'s crew. They set his trailer on fire, which did not seem to faze him. This was only after Vince, one of the _Punk'd (2003)_ (qv) crew, blamed the fire on him that things got really heated and they revealed the gag.", "He was 'Tim Burton' (qv)'s second choice for the role of Willy Wonka in _Charlie and the Chocolate Factory (2005)_ (qv), which went to 'Johnny Depp' (qv).", "Has three daughters: Simone Alexander Johnson with ex-wife 'Dany Garcia' (qv) (born August 14, 2001 in Davie, Florida), and Jasmine Johnson and Tiana Gia Johnson with wife 'Lauren Hashian' (qv) (born December 16, 2015) and (born April 17, 2018).", "With his wife, donated $2 million to the University of Miami for the new Robert and Judi Prokop Newman Alumni Center's living room, to be named \"The Dany and Dwayne 'The Rock' Johnson Living Room\". The donation was announced at the Miami premiere of _Gridiron Gang (2006)_ (qv).", "Made his WWF television debut at the _Survivor Series (1996)_ (qv).", "In an interview with \"Entertainment Magazine\", he no longer wants to be known as \"The Rock\". Because of his retirement from the wrestling business, he now considers himself an actor: \"I no longer am a wrestler, I am now pursuing a future as an actor and someday as a director. I am not the Rock. I am 'Dwayne Johnson' (qv).\". [October 2006]", "Not only was his father, 'Rocky Johnson' (qv), a wrestler, but his grandfather, three uncles, and six cousins (one adopted) have been in wrestling too.", "Ex-brother-in-law of 'Hiram Garcia' (qv).", "Has a fear of spiders.", "Remains close friends with WWE writer 'Brian Gewirtz' (qv).", "Inducted his father and grandfather, 'Rocky Johnson' (qv) and 'Peter Fanene Maivia' (qv), respectively, into the WWE Hall of Fame on March 29, 2008.", "Honored by the Congressional Award in Washington, D.C. on June 19, 2008 with the Horizon Award. The Horizon Award is a special recognition from the Joint Leadership of the United States Congress and the Congressional Award Board of Directors. The Horizon Award is presented to individuals from the private sectors who have contributed to expanding opportunities for all Americans through their own personal contributions, and who have set exceptional examples for young people through their successes in life.", "Has expressed his desire to play a villain in a James Bond film. Dwayne's grandfather 'Peter Fanene Maivia' (qv) appeared as a Bond villain in _You Only Live Twice (1967)_ (qv).", "Although he has lived in the United States for most of his life, he has Samoan citizenship as his mother is Samoan. He has often stated in interviews he is proud of his Samoan heritage and feels honored to be a Samoan.", "Has stated that the film adaptation of _Doom (2005)_ (qv) was a complete failure, and that the movie did a huge disservice to fans of the video game franchise.", "He was contacted about appearing at the Flair farewell address the night following _WrestleMania XXIV (2008)_ (qv), but declined due to scheduling conflicts.", "After becoming successful in the movie industry, Dwayne was able to fulfill an ambition he had listed on his agenda of priority \"To Do\" items, and bought a home for his parents, a luxury they had never theretofore known. His first major personal indulgence was his purchase of a Rolex watch.", "Is a published author.", "While he was filming his swordfight scene with 'Michael Clarke Duncan' (qv) in _The Scorpion King (2002)_ (qv), the breaking of the swords was real and unintended, and openly stated that this was extremely dangerous because this was not planned and this could have cut anybody.", "The Rock returned to the WWE, and in 2013, he won the WWE Championship by defeating CM Punk at the Royal Rumble and retained the title at Elimination Chamber pay per views.", "Indian actor Varun Dhawan is a self-professed die hard fan of The Rock.", "His ex-wife, 'Dany Garcia' (qv), is his manager.", "First movie experience at 8-years-old was _Raiders of the Lost Ark (1981)_ (qv).", "Is an official Priest registered in California for a special YouTube video for his best friend (Nick Mundy). The video is called Dwayne 'The Rock' Johnson's Wedding Surprise!.", "While on tour to promote _San Andreas (2015)_ (qv), he set a world record of 105 selfies in three minutes, averaging out to one selfie every 1.7 seconds.", "Ate at the fast food restaurant, In-N-Out, for the first time ever. [February 2017]", "As a high school student, he found this very difficult to make friends due to his lofty (6' 4\" / 225 lbs.) and mustachioed demeanor which led his fellow students to suspect he was an undercover policeman, not unlike 'Johnny Depp' (qv)'s _21 Jump Street (1987)_ (qv) character.", "By the time Dwayne was 16-years-old, he had already enrolled in four high schools due to his frequent expulsions: McKinley High School (Honolulu, Hawaii), Glencliff High School (Nashville, Tennessee), McGavock High School (Nashville, Tennessee) and Freedom High School (Bethlehem, Pennsylvania).", "(December 16, 2015) Has two daughters named Jasmine Johnson and Tiana Gia Johnson (April 17, 2018)., with his wife 'Lauren Hashian' (qv).", "Cousin of former wrestler Umaga and wrestler Roman Reigns.", "Uncle to wrestlers Jimmy (Jonathan Solofa Fatu) and Jey (Joshua Samuel Fatu) Also known as \"The Usos\".", "'Dwayne Johnson' (qv) was named as Forbes magazine's highest-paid actor. He commanded $64.5 million between June 2015 and June 2016, more than doubling his earnings from the previous year and bumping 'Robert Downey Jr.' (qv) from the top of the list, where he was perched for three consecutive years.", "According to Forbes, his estimated earnings for 2016 was approximately $64.5 million making him the highest paid actor for that year.", "Although standing at 6' 5\", the movie _The Rundown (2003)_ (qv) claims him to be 6' 4\". This also claimed to be wrong in Smackdown vs. Raw (2008) in which he is listed at 6' 5\".", "People magazine named him the Sexiest Man Alive of 2016.", "Signed an endorsement deal with Under Armour. [January 2016]", "Has more than 82 million Instagram followers and 11 million Twitter followers. [March 2017]", "Designed training sneakers for Under Armour called Project Rock Delta. [March 2017]", "Often plays a character who appears in a sequel of a franchise without having been in the first movie. Examples include _The Mummy Returns (2001)_ (qv), _Be Cool (2005)_ (qv), _Fast Five (2011)_ (qv), _Journey 2: The Mysterious Island (2012)_ (qv), _G.I. Joe: Retaliation (2013)_ (qv) and _Jumanji: Welcome to the Jungle (2017)_ (qv).", "In a YouTube video by Joe Weller, 'Dwayne Johnson' (qv) was asked to talk about his first kiss. He said that his first kiss lasted eight minutes with a teacher when he was in fourth grade.", "His net worth is $190 million.", "Time magazine named him one of the 100 Most Influential People in the World (2016).", "Friends with 'Kevin Hart' (qv).", "Second highest paid actor of 2017, earning $65 million.", "He wanted to play the title role in _Jack Reacher (2012)_ (qv) but was passed over in favor of 'Tom Cruise' (qv).", "(December 12, 2017) Announced that he and his girlfriend Lauren are expecting their second daughter in Spring 2018.", "'Dwayne Johnson' (qv)'s character creation of \"the Rock\" became one of the most charismatic and dynamic characters the WWE industry has ever seen.", "He was awarded a Star on the Hollywood Walk of Fame at 6801 Hollywood Boulevard in Hollywood, California on December 13, 2017.", "He was offered the role of Cade Yeager in _Transformers: Age of Extinction (2014)_ (qv), but he declined, in order to star in _Hercules (2014)_ (qv). The role went to 'Mark Wahlberg' (qv).", "In 2012 Dwayne formed the film company \"Seven Bucks Productions\" with ex-wife 'Dany Garcia' (qv) and her brother 'Hiram Garcia' (qv) to produce their own variety of projects. The company name was reportedly inspired by Dwayne's predicament after ditching his football career when he ended up with just \"seven bucks\" to his name."], "quotes": ["Finally...The Rock...has come back to [whatever city he's in at the time]", "You will go one on one with the Great One!", "Who in the blue hell are you?", "[Referring to his 0.7 grade point average in college] It's pretty hard to get a point seven. You have to do close to nothing.", "Can you smell what The Rock is cooking!", "The Rock will take you down Know Your Role Boulevard which is on the corner of Jabroni Drive and check you directly into the Smackdown Hotel!", "It doesn't matter what you think.", "I have so much love and respect for the fans. I'll never forget where I came from. I love the business. I grew up in the business. And everyone always asks me, from Letterman ['David Letterman' (qv)] to 'Stone Phillips' (qv), what I miss about wrestling. Hands down, I miss the interaction with the fans. Outside of the ring I loved it, too. I mean, how hard is it to sign an autograph? Don't be an a**hole to your fans. And there's many [in WWE] that won't, which is bulls**t. But inside the ring, just that energy and feeding off that energy is great. There's something so special about it. And every night I would just have a blueprint of what I would say and rely so much on ad-libbing and waiting to see what happens when I get out there and let it materialize organically and see what happens. Every night was a different crowd and they gave me so much energy, and I'll always love that and always miss that for sure. [Interview with WWE.com in October 2005]", "To a degree, all of my promos are scripted, in that there are certain lines and phrases that I plan to include.", "[on his wrestling career] I am amazed at the number of people who think I only work on the days and nights they see me on television.", "A huge percentage of football players at Division I-A schools - especially those that are typically ranked in the top 25 - do not make the active roster as freshmen.", "[on playing Hercules in 'Brett Ratner' (qv)'s adaptation of _Hercules (2014)_ (qv)] Understand, for me when I was a kid, Hercules was always a hero of mine, from Steve Reeves to the multiple guys who have played Hercules, but the idea and the notion of this man. When I first got into movies, I thought, \"Gosh, I would love to do that one day.\" I always thought that the version of Hercules that I want to play was one that was more dramatic and survived in barren lands and not necessarily slick in any way or anything like that. It's been around and been on my mind for some time.", "No matter who you are, being kind is the easiest thing you can do.", "It's nice to be important but more important to be nice. I heard that from a friend when I was about 15, and I've never forgotten it.", "Success isn't overnight. It's when every day you get a little better than the day before. It all adds up."], "salary history": ["_The Scorpion King (2002)_ (qv)::$5,500,000", "_The Rundown (2003)_ (qv)::$12,500,000", "_Walking Tall (2004)_ (qv)::$15,000,000", "_Hercules (2014)_ (qv)::$12,000,000", "_Ballers (2015)_ (qv)::$700,000 an episode", "_Jumanji: Welcome to the Jungle (2017)_ (qv)::$20 .000.000", "_Skyscraper_ (qv)::$20 .000.000"], "birth date": "1972-05-02", "birth notes": "Hayward, California, USA", "_actorID": "27", "_source": "IMDB", "actorID": "0425005", "created_utc_dt": "08/26/2019, 21:54:06"}