{"headshot": "https://m.media-amazon.com/images/M/MV5BOWViYjUzOWMtMzRkZi00MjNkLTk4M2ItMTVkMDg5MzE2ZDYyXkEyXkFqcGdeQXVyODQwNjM3NDA@._V1_UY98_CR13,0,67,98_AL_.jpg", "birth name": "Adam Douglas Driver", "height": "6' 2½\" (1.89 m)", "mini biography": ["Adam Douglas Driver was born in San Diego, California. His mother, Nancy (Needham) Wright, is a paralegal from Mishawaka, Indiana, and his father, Joe Douglas Driver, who has deep roots in the American South, is from Little Rock, Arkansas. His stepfather is a Baptist minister. His ancestry includes English, Dutch, German, Irish, and Scottish. Driver was raised in Mishawaka after his parents' divorce, attending Mishawaka High School, where he appeared in plays. After 9/11, he enlisted in the Marines, serving for more than two years before being medically discharged after he suffered an injury, which prevented him from being deployed.Driver attended the University of Indianapolis (for a year) and then transferred to study drama at Juilliard in New York, graduating in 2009. He began acting in plays, appearing on Broadway, before being cast in 'Lena Dunham' (qv)'s series _Girls (2012)_ (qv), as her character's love interest, Adam Sackler. The role gained him attention, and he subsequently began a robust film career, appearing in small roles in _J. Edgar (2011)_ (qv) and _Lincoln (2012)_ (qv), supporting roles in _Frances Ha (2012)_ (qv) and _Inside Llewyn Davis (2013)_ (qv), and graduating to major parts in the comedy-drama _This Is Where I Leave You (2014)_ (qv) and the upcoming _Star Wars: Episode VII - The Force Awakens (2015)_ (qv) and 'Martin Scorsese' (qv)'s _Silence (2016)_ (qv), the latter film opposite 'Andrew Garfield' (qv).::Anonymous"], "spouse": ["'Joanne Tucker' (qv)::(22 June 2013 - present)"], "trade mark": ["Towering height and slender frame", "Long black hair", "Deep commanding voice"], "trivia": ["Graduated from Juilliard.", "Served in the Marine Corps, and now runs a non-profit foundation called Arts in the Armed Forces that stages theatrical performances for military personnel.", "Says he 'originally passed on' his Adam Sackler role on _Girls (2012)_ (qv) because he \"thought TV was evil\".", "'Lena Dunham' (qv) thanked Driver profusely for his support when she won her Golden Globe award in Jan. 2013.", "Lives in Brooklyn Heights, New York City.", "Was briefly enrolled in the University of Indianapolis theatre department.", "His stepfather is a minister.", "Growing up, he sang in the church choir.", "He is the son of Joe Douglas Driver and Nancy (Needham) Wright. Adam has English, German, Dutch, Irish, Scottish, Scots-Irish/Northern Irish, and distant Swedish, ancestry. His father is from Arkansas and his mother is from Indiana. Their families have lived in those states for many generations. Some of his Dutch ancestors were from Friesland.", "While serving in the Marines, he missed active duty in Iraq due to a mountain biking accident in which he broke his sternum.", "Does not watch his own performances onscreen, and even declines to listen to audio clips of himself while being interviewed on the radio.", "He was considered for the role of Lex Luthor in Batman v Superman: Dawn Of Justice (2016).", "He was rumored to be playing Dick Grayson/Nightwing in Batman v Superman: Dawn Of Justice but denied any involvement. Despite this, he expressed an interest in the role and has been a popular choice among fans ever since.", "Has stated his interest in working with 'Pedro Almodóvar' (qv), 'Paul Thomas Anderson' (qv), 'Michael Haneke' (qv) and 'Mike Leigh' (qv).", "Before becoming an actor he once worked as a door-to-door Kirby Vacuum salesman, a telemarketer for a basement water-proofing company, and Ben Franklin construction company.", "Prior to his major mainstream roles like in the Star Wars franchise, he has often played socially awkward characters.", "Nominated for the 2019 Golden Globe Award in the Best Performance by an Actor in a Supporting Role in any Motion Picture category for his role as Flip Zimmerman in _BlacKkKlansman (2018)_ (qv), but lost to 'Mahershala Ali' (qv) for _Green Book (2018)_ (qv).", "Nominated for a 2019 Academy Award in the Best Supporting Actor category for his role as Flip Zimmerman in _BlacKkKlansman (2018)_ (qv) but lost to 'Mahershala Ali' (qv) for _Green Book (2018)_ (qv)."], "quotes": ["Just the service aspect of running a nonprofit is so gratifying because it takes the attention off yourself. I'm not an acting monk or anything. I'm not, like, the most well-adjusted actor. But it's really designed to focus on yourself, or it can be. So it's good to have something else to focus on that reminds you that it's not always about you. Something I learned in the Marine Corps that I've applied to acting is, one, taking direction, and then working with a group of people to accomplish a mission and knowing your role within that team.", "\"I'm like a sight gag, I have this really big face...I don't totally get it. I mean, when I read for _Girls (2012)_ (qv) I was, like, the script says 'Handsome Carpenter,' so someone else is going to get the part. They'll have someone handsome, not me. I mean, I'm not in any danger of getting leading-man parts.", "The deadly thing in my job is to attach too much meaning to everything. You have to have a sense of humor about yourself...I'm definitely trying to figure this all out as I go along, how to craft a career. As things get bigger, I have days of depression, sitting in the house and wondering 'What are you doing? Is it even relevant?'", "I auditioned in Chicago for Juilliard and didn't get in. I was basically living in a back room of my parents' house, paying rent and not doing anything with my life. I'd like to say it was patriotic to join the Marines, but it was also that I was doing nothing honorable with my life, and spending too much time at McDonald's.", "In the military, you learn the essence of people. You see so many examples of self-sacrifice and moral courage. In the rest of life you don't get that many opportunities to be sure of your friends.", "At the Emmy awards, everybody runs up to you and says, 'Aren't you having the time of your life?' I mean, I was never after trying to get an Emmy. The whole spectacle seems cheesy and dated. The thing that motivates me most is being petrified of not having a place to put my voice.", "[observation 2013, on continuing to perform in 'Girls'] Every season is a different thing. The first season we were still trying to figure out what it is we're doing, and I think that still applies to the third season, which we just did. There's still an ambitious pursuit of 'How do we go deeper and surprise ourselves?'", "[on his musical contribution to _Inside Llewyn Davis (2013)_ (qv)] They keep the music department very separate from the actors at Juilliard. I am musical though. I grew up in church and did a lot of singing at choir, and a lot at choir in school, and playing the piano - things like that. But I wouldn't call myself a musician by any means compared to the [others]. Musical in that I own instruments that are at my house that I play with people. But not like in that I have mastered any of them.", "[on working with the Coen brothers] I think they have a common theme, even though they work in completely different ways. Specificity of story - so clear with what it is they're after - and different opinions about how to get there. They're kind of unanimous in that way. Just to see the Coens at the state they are in with their careers, and how they still have this relentless pursuit to to tell the best version possible, and do all their homework - it's incredible to have been able to witness."], "birth date": "1983-11-19", "birth notes": "San Diego, California, USA", "_actorID": "83", "_source": "IMDB", "actorID": "3485845", "created_utc_dt": "08/26/2019, 21:54:43"}