{"headshot": "https://m.media-amazon.com/images/M/MV5BMTI4MzIxMTk0Nl5BMl5BanBnXkFtZTcwOTU5NjA0Mg@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Benjamin Géza Affleck-Boldt", "height": "6' 3½\" (1.92 m)", "mini biography": ["American actor and filmmaker Benjamin Géza Affleck-Boldt was born on August 15, 1972 in Berkeley, California, and was raised in Cambridge, Massachusetts. His mother, Chris Anne (née Boldt), is a school teacher, and his father, Timothy Byers Affleck, is a social worker; the two are divorced. Ben has a younger brother, actor 'Casey Affleck' (qv), who was born in 1975. He is of mostly English, Irish, German, and Scottish ancestry. His middle name, Géza, is after a Hungarian family friend who was a Holocaust survivor.Affleck wanted to be an actor ever since he could remember, and his first acting experience was for a Burger King commercial, when he was on the PBS mini-series, _The Voyage of the Mimi (1984)_ (qv). It was also at that age when Ben met his lifelong friend and fellow actor, 'Matt Damon' (qv). They played little league together and took drama classes together. Ben's teen years consisted of mainly TV movies and small television appearances including _Hands of a Stranger (1987)_ (qv) and _The Second Voyage of the Mimi (1988)_ (qv). He made his big introduction into feature films in 1993 when he was cast in _Dazed and Confused (1993)_ (qv). After that, he did mostly independent films like 'Kevin Smith' (qv)'s _Mallrats (1995)_ (qv) and _Chasing Amy (1997)_ (qv) which were great for Ben's career, receiving renowned appreciation for his works at the Sundance film festival. But the success he was having in independent films didn't last much longer and things got a little shaky for Ben. He was living in an apartment with his brother Casey and friend Matt, getting tired of being turned down for the big roles in films and being given the forgettable supporting ones. Since Matt was having the same trouble, they decided to write their own script, where they could call all the shots. So, after finishing the script for _Good Will Hunting (1997)_ (qv), they gave it to their agent, 'Patrick Whitesell' (qv), who showed it to a few Hollywood studios, finally being accepted by Castle Rock. It was great news for the two, but Castle Rock wasn't willing to give Ben and Matt the control over the project they were hoping for. It was friend 'Kevin Smith' (qv) who took it to the head of Miramax who bought the script giving Ben and Matt the control they wanted and, in December 5, 1997, _Good Will Hunting (1997)_ (qv) was released, making the two unknown actors famous. The film was nominated for 9 Academy 'Awards' (qv) and won two, including Best Original Screenplay for Ben and Matt. The film marked Ben's breakthrough role, in which he was given for the first time the chance to choose roles instead of having to go through grueling auditions constantly.Affleck chose such roles in the blockbusters _Armageddon (1998)_ (qv), _Shakespeare in Love (1998)_ (qv), and _Pearl Harbor (2001)_ (qv). In the early years of the 2000s, he also starred in the box office hits _Changing Lanes (2002)_ (qv), _The Sum of All Fears (2002)_ (qv), and _Daredevil (2003)_ (qv), as well as the disappointing comedies _Gigli (2003)_ (qv) and _Surviving Christmas (2004)_ (qv). While the mid 2000s were considered a career downturn for Affleck, he received a Golden Globe nomination for his performance in _Hollywoodland (2006)_ (qv). In the several years following, he played supporting roles, including in the films _Smokin' Aces (2006)_ (qv), _He's Just Not That Into You (2009)_ (qv), _State of Play (2009)_ (qv), and _Extract (2009)_ (qv). He ventured into directing in 2007, with the thriller _Gone Baby Gone (2007)_ (qv), which starred his brother, 'Casey Affleck' (qv), and was well received. He then directed, co-wrote, and starred in _The Town (2010)_ (qv), which was named to the National Board of Review Top Ten Films of the year. For the political thriller _Argo (2012)_ (qv), which he directed and starred in, Affleck won the Golden Globe Award and BAFTA Award for Best Director, and the Academy Award, Golden Globe Award, and BAFTA Award for Best Picture (Affleck's second Oscar win).In 2014, Affleck headlined the book adaptation thriller _Gone Girl (2014)_ (qv). He starred as Bruce Wayne/Batman in the superhero film _Batman v Superman: Dawn of Justice (2016)_ (qv), briefly reprised the character in _Suicide Squad (2016)_ (qv), and did so again in _Justice League (2017)_ (qv).Affleck married actress 'Jennifer Garner' (qv) in 2005. The couple has three children. In June 2015, Affleck and Garner separated, and in April 2017 they filed for divorce.::TrendEkiD@aol.com and Pedro Borges"], "spouse": ["'Jennifer Garner' (qv)::(29 June 2005 - 4 October 2018) ( divorced) ( 3 children)"], "trade mark": ["Frequently plays arrogant and ruthless characters", "Opens his films with narration or title cards", "Often works with brother 'Casey Affleck' (qv) and friend 'Matt Damon' (qv)", "His films often feature corrupt but well-meaning law enforcement figures", "His films often focus on characters caught in situations out of their depth", "Frequently sets his films in his hometown of Boston", "Often casts 'Titus Welliver' (qv) and 'Victor Garber' (qv)", "Square jaw", "Frequently cast by 'Kevin Smith' (qv)"], "trivia": ["Fined $135 for driving in Massachusetts with a suspended license. [1999]", "Older brother of actor 'Casey Affleck' (qv).", "Friend of and frequent collaborator with actor 'Matt Damon' (qv).", "Owns vintage Ms. Pac-Man and Millipede video-arcade games.", "He was accidently knocked unconscious by football player 'Dana Stubblefield' (qv) during the filming of _Reindeer Games (2000)_ (qv). Stubblefield slipped, and Affleck was knocked down. He was taken to the hospital, but fully recovered.", "When he was little, he asked his mom for a dog, and she tested him by making him walk an imaginary dog for a week. Ben only lasted for 5 days and didn't get the dog.", "Graduated from Cambridge Rindge and Latin High School in 1990.", "Dropped out of the University of Vermont after 1 semester.", "Dropped out of Occidental College after 1 year, where he had studied Middle Eastern studies.", "He and 'Matt Damon' (qv) sold their _Good Will Hunting (1997)_ (qv) script for $600,000.", "Has his teeth capped.", "Owns 5 motorcycles.", "Chosen as one of People Magazine's 50 Most Beautiful People in the World [2000]", "Chosen as one of People Magazine's Most Beautiful People in the World [1999]", "Auditioned for 'Corey Haim' (qv)'s part in _License to Drive (1988)_ (qv).", "Was an extra with friend 'Matt Damon' (qv) in _Field of Dreams (1989)_ (qv).", "'Charlie Sheen' (qv) drove him to Promises Rehabilitation Center in August, 2001", "Ranked #77 in Premiere's 2002 annual Power 100 List.", "Is known for being a very good impressionist. He usually picks one of his costars while filming a movie and studies them. He displays his impressions on _The Tonight Show with Jay Leno (1992)_ (qv) almost every time he is a guest. While filming _The Sum of All Fears (2002)_ (qv), he chose to study co-star 'Morgan Freeman' (qv). When he showed Morgan his impression on set, it was so accurate Freeman told him, \"You ever do that again, I'll kill you\".", "Confirms engagement to 'Jennifer Lopez' (qv), after giving her a reported $3.5 million ring. (Nov. 2002)", "His ancestry is mostly English, Irish, German, Scottish, and Scots-Irish/Northern Irish, and distant/remote Swiss-German, Swedish, French, and Welsh. His maternal great-grandfather, Joseph Raymond Boldt, was born in Rhode Island, to German immigrants, and his maternal great-grandmother, Anne Rita Lenihan, was Irish, born in County Down.", "Named People Magazine's \"Sexiest Man Alive\" (2002).", "Voluntarily entered Promises Rehabilitation Center in Malibu, California for alcohol abuse. [July 2001]", "He was inspired to contribute to the Neil Bogart Memorial Fund, which supports cancer research at Los Angeles Children's Hospital, after meeting Molly Hanna, who died of cancer in 2002. She was a student in his mother's fifth-grade class.", "Growing up, the Marvel Comic book character Daredevil was his hero. He got to play the character in the 2003 movie.", "Ranked #41 in Premiere's 2003 annual Power 100 List.", "Was paid $1.5 million for doing commercials for L'Oreal Shampoo. (2003).", "Has a Boston Celtics logo painted on the basketball court at his house.", "In the fall of 2003, he volunteered to spend several days with children with disabilities.", "Speaks Spanish and French.", "'Jennifer Lopez' (qv) wrote the song \"Dear Ben\" about him and how much she loved him.", "With the exception of _Clerks (1994)_ (qv), he has appeared in all of 'Kevin Smith' (qv)'s View Askewniverse films.", "He learned to speak Arabic.", "He won $356,000 by winning the California State Poker Championships in June 2004 - defeating some of the best poker players in the world in the process.", "Is a first-time uncle to younger brother 'Casey Affleck' (qv)'s son, 'Indiana Affleck' (qv), born on May 31, 2004 in Amsterdam, to Casey and his fiancée, actress 'Summer Phoenix' (qv).", "Appeared in a prop photo used in the movie _Mermaids (1990)_ (qv).", "In 2001, was filming four movies simultaneously: _Pearl Harbor (2001)_ (qv), _Jay and Silent Bob Strike Back (2001)_ (qv), _Changing Lanes (2002)_ (qv), and _The Sum of All Fears (2002)_ (qv).", "When he was dating 'Jennifer Lopez' (qv), hated the paparazzi referring to them as \"Bennifer.\"", "Is a staunch Democrat and has supported Senator 'John Kerry' (qv)'s 2004 presidential campaign.", "In 1999, he was nominated for the Razzie Award, Worst Screen Couple in the movie _Armageddon (1998)_ (qv), with actress 'Liv Tyler' (qv). In 2004, he was again nominated for, and subsequently \"won\", the Worst Screen Couple Award with co-star 'Jennifer Lopez' (qv) in the movie _Gigli (2003)_ (qv). One year later (2005), he was nominated, once again, for Worst Screen Couple, this time with both of the actresses ('Jennifer Lopez' (qv) or 'Liv Tyler' (qv)) in the film _Jersey Girl (2004)_ (qv).", "As of 2005, has a total of seven Razzie Nominations (including three for Worst Actor) and two \"wins\".", "Prior to achieving leading man status, he was often cast as a bully.", "Had four different stunt men for _Daredevil (2003)_ (qv), each one with a different specialty (fighting, wire works, etc.). He tried to do as much of his own stunts as he possibly could, feeling that it would add more credibility to the film.", "Is a fan of the Red Sox baseball team", "Appeared with wife 'Jennifer Garner' (qv) in two movies _Daredevil (2003)_ (qv) and _Pearl Harbor (2001)_ (qv). It would have been three, but Affleck's small scene in _Elektra (2005)_ (qv), was cut from the final film.", "Quit smoking when Violet was born.", "'Tom Clancy' (qv) wrote a script for a new Jack Ryan film entitled \"Red Rabbit\", with him in mind. \"Red Rabbit\" is set in the early 1980s, (when Clancy's novel version of Ryan was about Affleck's age) and chronicles a Soviet plot to kill Pope John Paul II only a few years into his reign.", "At one point after _Good Will Hunting (1997)_ (qv) was released, Affleck was writing a script with 'Matt Damon' (qv) and his brother 'Casey Affleck' (qv). The plot concerned teenagers in a half way house. It is not clear if this script will ever be completed.", "Was to have cameos in two 'Kevin Smith' (qv) produced movies but had to back out due to scheduling conflicts. The two movies were _Vulgar (2000)_ (qv) and _Big Helium Dog (1999)_ (qv).", "Is an avid fan of 'Robert Englund' (qv).", "Besides being known as the title character in the Daredevil franchise, is also known as Superman in the George Reeves bio-pic \"Hollywoodland\".", "Winner of the 2006 Venice Film Festival's Volpi Cup for Best Actor for his role in \"Hollywoodland\".", "His father was at one time a janitor at Harvard University, the inspiration for Will Hunting's job at MIT in _Good Will Hunting (1997)_ (qv).", "Has a fear of flying.", "Turned down the part of Bobby Mercer in _Four Brothers (2005)_ (qv), as he found the script to be \"ultra-violent\". The part eventually went to 'Mark Wahlberg' (qv).", "He and his wife, 'Jennifer Garner' (qv), both had movies open on January 26 2007: his was _Smokin' Aces (2006)_ (qv) and hers was _Catch and Release (2006)_ (qv).", "Was originally set to play \"Don Haskins\" in _Glory Road (2006)_ (qv), but pulled out of the project due to scheduling conflicts.", "2002: Voted Most Eligible Bachelor by People Magazine.", "Dec. 2007 - Ranked 50 in EW's The 50 Smartest People In Hollywood.", "Since late 2007 he has made four separate trips to the Democratic Republic of Congo to bring attention to the plight of that country. [November 2008]", "(November 11, 2008) Attended the star-studded opening of Dubai's lavish Atlantis Palms resort. Guests were welcomed in style with a display of one million fireworks, said to be visible from space.", "Was considered for the role of Billy Loomis in _Scream (1996)_ (qv).", "He has an entry in 'Jean Tulard' (qv)'s \"Dictionnaire du Cinéma/Les Acteurs\", published in Paris in 2007 (pgs. 15/16).", "Majored in Middle Eastern affairs in college.", "Claims that his hero is 'Harrison Ford' (qv).", "As a teenager, he lived in México where he learned to speak Spanish.", "Lives in Pacific Palisades, California.", "Has directed 3 actors in Oscar-nominated performances: 'Amy Ryan' (qv), 'Jeremy Renner' (qv), and 'Alan Arkin' (qv).", "Ben and 'Jennifer Garner' (qv) are expecting their third child [August 22, 2011].", "At age 25, he was the youngest person ever to win an Oscar for 'Best Original Screenplay'. He went 15 years without another nomination until 2013, and won 'Best Picture' for _Argo (2012)_ (qv).", "When he and best friend 'Matt Damon' (qv) were struggling actors, they both shared a Boston bank account.", "The first director ever to win all the precursor awards (Golden Globe, BAFTA, Critics Choice and the Directors Guild awards) for Best Director after failing to earn an Oscar nomination for the same work, for _Argo (2012)_ (qv). In fact, this is only time such an anomaly has ever occurred in any Oscar category (whether it'd be for directing, writing, acting etc.).", "Since the Directors Guild started awarding its DGA award for Best Director in 1948, Affleck is only the third director to ever win this award while also failing to even be nominated for an Oscar as Best Director. The two other directors likewise snubbed by Academy voters were 'Ron Howard' (qv) for _Apollo 13 (1995)_ (qv) and 'Steven Spielberg' (qv) for _The Color Purple (1985)_ (qv).", "At forty years old, he is the oldest actor to be cast in the role of Bruce Wayne/Batman.", "He is the tallest actor to play Bruce Wayne/Batman and is in fact an inch and half taller than the version seen in the comics who stands at six-feet two inches tall.", "He has played two comic book characters whose most famous story lines were written by Frank Miller: Batman and Daredevil.", "He is the third Academy-award winner to play the role of Bruce Wayne/Batman after 'George Clooney' (qv) and 'Christian Bale' (qv). He and Clooney are both two-time Oscar winners, and won their second Oscar together as producers of _Argo (2012)_ (qv). He is the first to have won before playing Batman.", "Became a father for the 1st time at age 33 when his wife 'Jennifer Garner' (qv) gave birth to their daughter Violet Anne Affleck on December 1, 2005.", "Became a father for the 2nd time at age 36 when his wife 'Jennifer Garner' (qv) gave birth to their daughter 'Seraphina Rose Elizabeth Affleck' (qv) on January 6, 2009.", "Became a father for the 3rd time at age 39 when his wife 'Jennifer Garner' (qv) gave birth to their son 'Samuel Garner Affleck' (qv) on February 27, 2012.", "Began an intense two-hour a day workout regime the day after he was cast as Batman.", "He has the distinction of being the only actor to wear both a Batman suit and Superman suit in two different films.", "Starred alongside Alec Baldwin in ''_Pearl Harbor (2001)_ (qv)'' and once played him in a skit on ''Saturday Night Live''. In addition to both playing the part of 'Tom Clancy' (qv)'s character Jack Ryan, both men share the distinction of playing iconic golden age comic book characters who used fear and intimidation: Baldwin played the title role in ''The Shadow (1994)'' and Affleck plays Bruce Wayne/Batman.", "As of 2014, he has appeared in four films that were nominated for the Best Picture Oscar: _Field of Dreams (1989)_ (qv), _Good Will Hunting (1997)_ (qv), _Shakespeare in Love (1998)_ (qv) and _Argo (2012)_ (qv), with the two latter winning in the category.", "He is one year and five months older than 'Christian Bale' (qv), making him the second actor to play Bruce Wayne/Batman older than his predecessor, the first being 'Robert Lowery' (qv).", "With his casting in the new Batman vs. Superman movie, Affleck has portrayed 3 superheroes (Daredevil, Hollywoodland, and Batman vs Superman: Dawn of Justice).", "In his film _Jersey Girl (2004)_ (qv), Affleck refers to his transportation as \"the Batmobile.\" Ironically, he was cast as Batman for _Batman v Superman: Dawn of Justice (2016)_ (qv).", "Of the first three actors to play Jack Ryan, he was 'Tom Clancy' (qv)'s favourite.", "Was only five-foot one when entering high school and describes himself as having been ''An awkward theater geek''.", "Received a lifetime ban from playing blackjack at Las Vegas' Hard Rock Casino due to his card counting skills.", "He appeared in two Best Picture Academy Award winners: _Shakespeare in Love (1998)_ (qv) and _Argo (2012)_ (qv). He also directed the latter.", "He and to-be-ex wife 'Jennifer Garner' (qv) announced their divorce on June 30, 2015, which is exactly 10 years and one day after their wedding occurred.", "With his casting in _Suicide Squad (2016)_ (qv), he is the first actor to play Bruce Wayne/Batman in two different films released in the same year.", "He is the first actor to be cast as Bruce Wayne/Batman by two different directors.", "He has appeared in six films directed by 'Kevin Smith' (qv): _Mallrats (1995)_ (qv), _Chasing Amy (1997)_ (qv), _Dogma (1999)_ (qv), _Jay and Silent Bob Strike Back (2001)_ (qv), _Jersey Girl (2004)_ (qv) and _Clerks II (2006)_ (qv).", "He appeared in four films with 'Joey Lauren Adams' (qv): _Dazed and Confused (1993)_ (qv), _Mallrats (1995)_ (qv), _Chasing Amy (1997)_ (qv) and _Jay and Silent Bob Strike Back (2001)_ (qv). The first of these, which was directed by 'Richard Linklater' (qv), was the only one of the four not directed by 'Kevin Smith' (qv).", "Father (with 'Jennifer Garner' (qv)) of 'Violet Affleck' (qv), 'Seraphina Rose Elizabeth Affleck' (qv) and 'Samuel Garner Affleck' (qv).", "Brother-in-law of 'Summer Phoenix' (qv).", "Avid poker player.", "He is a member of the Five-Timers club, a nickname for performers who have hosted Saturday Night Live (1975 - ) at least five times.", "Tenth cousin once removed of 'Matt Damon' (qv).They are both descendants of William Knowlton Jr., a bricklayer who came to the United States from England in the 1630s.", "He is distantly related to sixteen U.S. presidents including 'Barack Obama' (qv). He is also distantly related to the late 'Princess Diana' (qv).", "Close friends with 'George Clooney' (qv) who has also played the role of Batman.", "The May 4, 1988, edition of Variety, announced the film \"Atuk\" began filming February 16, 1988, but production halted after one day. Director was 'Alan Metter' (qv). The cast included 'Christopher Walken' (qv) and 'Ben Affleck' (qv).", "His great-great-grandfather Heinrich/Henry Boldt, as a twelve year-old, discovered the 10th century concave gold disc, the Curmsun Disc, at the Groß- Weckow village in Pomerania. He was playing with friends and found the door to the cellar crypt where the disc was located."], "quotes": ["[on the celebrity women the tabloids falsely link him to] Sometimes it's 'Britney Spears' (qv), and sometimes it's 'Carrie Fisher' (qv). I can't tell if I have a Lolita complex or an Oedipus complex.", "I feel like fame is wasted on me.", "[on tabloid coverage of his life] It feels like being in a soap opera that you were unwittingly cast in and you have no choice about it. I get to watch my life like everyone else and think. \"I can't believe they did that\". And, for whatever reason, you become less special for movie audiences. It cheapens the brand if you want to look at it in a really crass sense. But I figure it has to go away at some point. Eventually someone will come along and have a sex tape or someone will play grab-ass with some kids and I'll be off page one.", "[answering a 'Chris Matthews' (qv) question about why Hollywood actors sometimes presume to be sophisticated about politics] Everyone's entitled to express their political beliefs. I don't presume to tell anybody who to vote for. I am comfortable telling people what my opinions are. But you have to look also to the media, where you have a vast majority of the loudest and most influential political voices in America media from people who came from the entertainment world. You have 'Rush Limbaugh' (qv), was a radio disc jockey. 'Bill O'Reilly' (qv) came from _Inside Edition (1988)_ (qv). 'Michael Moore' (qv)'s a filmmaker. 'Al Franken' (qv) was on _Saturday Night Live (1975)_ (qv). The line is increasingly blurred between news and entertainment. Secondarily, the media's also shoving celebrities down our throats all the time. As a person, I'm much more interested in what an actor has to say about something substantial and important than who they're dating or what clothes they're wearing or some other asinine, insignificant aspect of their life.", "[when asked by 'Chris Matthews' (qv) what he thought about 'Whoopi Goldberg' (qv)'s remarks at a 'John Kerry' (qv) fund raiser that resulted in her being fired as a spokesman for SlimFast] I wasn't there. I went to the Los Angeles fund raiser. I wasn't in the one in New York. I think when you have somebody -- you know, if you did a rock concert that was a benefit and 'The Who' (qv) played their music or 'The Rolling Stones' (qv), you'd expect to get, you know, \"Satisfaction\" or \"My Generation.\" When you hire 'Whoopi Goldberg' (qv), you're going to get her brand of humor. And I think there is a fine line, and you have to be a little bit mindful. And I, for one, am not going to do any scatological jokes or puns about the president's last name on your show, mostly for that reason. But I also think I expect a different code of behavior maybe from comedians who have made a career with a certain kind of comedy than I do from, oh, say, the Vice President of the United States [referring to Vice President ['Dick Cheney' (qv), who told Vermont Sen. 'Patrick Leahy' (qv) to \"Go fuck yourself\" on the floor of the Senate], who used this vulgar language, you know, to a senator and was sort of unapologetic about it. So I think the Republicans hitting her [Whoopi] too hard for that is a little bit hypocritical.", "[to 'Dee Dee Myers' (qv), when asked how people react to his campaigning for candidates he supports] Well, I mean, to be perfectly honest, probably the most effective things that celebrities do for political candidates is raise money. You know, that's something that you can do. And unlike, say, fund-raisers sponsored by -- you know, engineered by insurance companies or oil companies, at least what you can say for celebrities is they're not expecting, you know, deregulation of their industry in return. So that's one of things that I'm, I've been able to do and to try to help them do it. Other than that, you know, I've lived this sort of strange, sometimes unpleasant, but mostly very lucky life that's involved lately a lot of media attention. And one of the things that feels good to me to do is to try to steer that in a direction of something more significant and at least be -- try to create some political dialogue. And that's satisfying. Some people react to me kindly, and others don't. That's sort of the nature of politics. [Myers follows up: \"Do you think it's kind of a risk for your career as movie star to get in bed with one party?\"] Unequivocally. Absolutely. And I think that's why, you know, actually, people say, Well, you see all these celebrities. To my mind, you see very, very few. Most feel like, and probably correctly so, that to be identified with one side of the ideological fence or other risks alienating a segment of your audience that may like your movies, may want to buy your tickets, and in fact, may make it more difficult for them to suspend their disbelief when they go see you in a movie because they have you closely identified with something else. For me, part of that is already compromised, and it's also something that's interesting enough for me, and I don't care quite so much about that kind of image that I'm able to do it. But I think a lot of people shy away from it, and many celebrities you see who've gone out there, tried to be active, have gotten pretty beaten down, you know? And so I think there is a risk, yes. [July 27, 2004, quoted in the MSNBC Transcripts]", "[told by 'David Gergen' (qv) that many were surprised by how well he \"elucidated\"] Well, David, I think I benefit from the same thing that helped 'George W. Bush' (qv) in the [2000] debates, which is tremendously low expectations.", "[when asked why he thought 'George W. Bush' (qv), after hearing that New York was under attack on Sept 11, remained in a Florida classroom, doing nothing, for several minutes] It's obviously very disturbing footage. On the one hand, you see a reaction on a man's face that he is clearly pained and shocked. I probably did the same thing sitting on my chair. I was completely freaked out and a little devastated. On the other hand, one does hope that in one's leaders, that they have the instinct to spring into action, to take some action or make the appearance of taking some action. And I was disappointed to see that he didn't do that, although I don't entirely hold it against him because, frankly, I was as shocked and devastated as he was. Although I think flying around in Air Force One for 11 hours before coming back and landing in the White House was probably less forgivable.", "When I got to L.A., my family had me go to dinner with this guy who had been acting here for 20 years. He gave me this big lecture and said, \"You know how much money I made in 20 years of acting? Eight thousand dollars. And I'm a carpenter.\" He was just really unhappy and it was depressing. Then he got really stoned and I went home and felt sick. I think it was just morbid fear. I was 18. That fear stays with you so intensely and you're constantly just getting turned down for what you think of as the most vapid, stupid kind of paycheck, _Baywatch (1989)_ (qv) things, and you think, \"Jesus, if I'm not good enough for this, then I'm not going to make it\". This town is too hard, and people were always telling me, \"You're too big, you're too tall, you can only play bullies and you will never be a leading man.", "[on his struggles as an actor before becoming successful] I lived all over the place. I lived in Hollywood, then I moved. ['Matt Damon' (qv)] and I got money from _School Ties (1992)_ (qv), and we blew it all in a couple of months. We made $35,000 or $40,000 each and thought we were rich. And we were shocked later on to find out how much we owed in taxes. We were appalled: $15,000! What? But we rented this house on the beach in Venice and 800 people came and stayed with us and got drunk. Then we ran out of money and had to get an apartment. It was like everything was exciting. So we lived in Glendale and Eagle Rock and we lived in Hollywood, West Hollywood, Venice, by the Hollywood Bowl, all over the place. We'd get thrown out of some places or we'd have to upgrade or downgrade depending on who had money.", "It's like Christmas: it's all advertising, and the first rule of selling somebody something is to make them seem inadequate. Make them feel like they need it. Like fabric softener. Nobody really needs fabric softener and yet, all of a sudden, you feel like a jackass if you don't have fabric softener, so people buy it. And that's how Christmas has become, because 50% of all retail sales happen in December. You are bombarded with this stuff - money will make you happy, and keeping up with the Joneses. Obviously that stuff doesn't make you happy, otherwise there wouldn't be all these unhappy rich people. They'd all be happy in their jacuzzis and OK, some of them are.", "God help me if I ever do another movie with an explosion in it. If you see me in a movie where stuff is exploding you'll know I've lost all my money.", "Sure, I suffered a lot. But it's not like the end of the world and it's not who I am. I lead quite a pleasant life and I'm able to divorce a perceived reality from my actual experience of life.", "[on his career path and choice of movies] I have definitely noticed that I care less about certain things. Other actors are like, \"You can't do that\", or \"You can't do this. This will position you in the wrong way.\" That's not my thing. And obviously so, because you can see I don't craft or cultivate my career.", "I've finally learnt how to say, \"No comment\". To appear in the tabloids is a real learning curve and a steep one at that. You had better learn quick or you get burnt.", "[about the New York Yankees' principal owner] You know 'George M. Steinbrenner III' (qv) is the center of all evil in the universe.", "I'm not known for having great relationships with ex-girlfriends, but I've been able to continue one with ['Gwyneth Paltrow' (qv)] that's really valuable.", "I'm always described as \"cocksure\" or \"with a swagger\", and that bears no resemblance to who I feel like inside. I feel plagued by insecurity.", "I remember back when I was a kid there was a comic strip called Plastic Man. His body was elastic and he could make his extremities as long as he wanted. As a youngster I didn't fully appreciate. But I'm now thinking Plastic Man was probably pretty popular with the ladies.", "I hate the whole reluctant sex-symbol thing. It's such bull. You see these dudes greased up, in their underwear, talking about how they don't want to be a sex symbol.", "I kinda see my current position like this: \"Here's your five minutes in the toy store, so you gotta do all the good movies you can before 'Chuck Woolery' (qv) rings the bell\".", "When I look up at the screen and see myself I always have to laugh. Not because I think I'm doing a horrible job, quite the contrary, I just feel it's so surreal to feel like one person can entertain so many at one time.", "I just feel like sometimes I'm a force to be dealt with. My talents are sometimes overused and also sometimes underused. It's not easy being me.", "I never know what my next move will be in Hollywood. It's such an unpredictable town. People get jaded and lost and I've been able to stay a float. I think the next logical step in my career would be to start my own filmmaking empire like ['Harvey Weinstein' (qv)] and ['Bob Weinstein' (qv)] did so many years ago. I think if only the unions weren't so strict in Boston, I'd set up shop there and make films of a certain quality you don't see represented these days. I'm full of ideas and dreams.", "[asked by 'Dee Dee Myers' (qv) if he thought it was risky for his career to be identified with a particular political party] Unequivocally. Absolutely. And I think that's why, you know, actually, people say, \"Well, you see all these celebrities\". To my mind, you see very, very few. Most feel like, and probably correctly so, that to be identified with one side of the ideological fence or other risks alienating a segment of your audience that may like your movies, may want to buy your tickets, and in fact, may make it more difficult for them to suspend their disbelief when they go see you in a movie because they have you closely identified with something else. For me, part of that is already compromised, and it's also something that's interesting enough for me, and I don't care quite so much about that kind of image that I'm able to do it. But I think a lot of people shy away from it, and many celebrities you see who've gone out there, tried to be active, have gotten pretty beaten down, you know? And so I think there is a risk, yes.", "I think we don't need to know anything about a political figure's sex lives. I guess 'Matt Drudge' (qv) did break [the 'Monica Lewinsky' (qv)] story, if you think that's a story worth breaking. I think it was a story that bogged down the wheels of government for two years. I don't care, personally. Some people say that's a fair reflection of a candidate's character. I don't. I'm not voting for your sexual predilection, I'm voting for your policy positions.", "'News' (qv)papers have gotten lazy and gotten nervous and started sourcing from blogs, and that, I think, is dangerous. Because you could pick any blog. I could start a blog tomorrow and write, 'I heard that so-and-so is an alien' -- a lot of false stories got started and got some currency because they were placed in blogs.", "Part of the blogging culture that's good is it's made the traditional press much more nervous. They've become more accountable, because they are sensitive to what the bloggers are going to say. Most Americans don't spend the day waiting for what the bloggers are going to say. The mainstream media sweats it, because for the first time they are actually accountable to someone who is going to write about them and their work. Which has a real strong impact on the mainstream media and how they work.", "I was no longer in control of my life. I thought I wanted certain things, but I didn't. I got lost. I felt suffocated, miserable and gross. I should never have gone down that route or got sucked in to all the publicity. I was typecast as myself. Too many people weren't getting past what they read about me. That was damaging. I can tell from experience it's bad for you, and bad for your career. So I took a break, went away for a while and let things calm down. (Claiming that his high-profile engagement with 'Jennifer Lopez' (qv) damaged his career.)", "I finally decided to quit smoking when I found out I was going to have a child. That was the thing that sort of put it over the top for me. I decided to go to a hypnotist. You sit in a chair and the hypnotist sips water and just talks to you for an hour, and explains how nicotine is poison. All of a sudden, I thought, 'This is asinine that I've been doing this to myself for all these years.' My last cigarette was on November 10th, 2005, and I feel a huge difference in my health now that I don't smoke. I feel like I'm in better shape than I was five years ago.", "[on turning down the offer to direct Superman: _Man of Steel (2013)_ (qv)] - The one benefit of having done all kinds of movies as an actor is, you learn the pros and cons of being tempted to do a really big movie because it costs a lot of money.With \"Superman\", I think they're going to do a great version. 'Christopher Nolan' (qv) is brilliant and they've got a great director for it.... Also there are a lot of guys ahead of me on the list to do epic effects movies.", "I'd love to do [direct] something like _Blade Runner (1982)_ (qv), but a lesson I've learned is to not look at movies based on budget, how much they'll spend on effects, or where they will shoot. Story is what's important.", "[on starting out as a film director] I knew how the sausage was made. Whether I could make a good sausage I didn't know. But I knew how to get into the sausage factory and stuff intestines.", "[on \"Argo\" and the relationship between Hollywood and the government] There is a symbiotic relationship. People make movies about military. When you go on a tour with the military all these guys are movie buffs. Movies are a big part of our culture. The military, the movies, and our intelligence services are inventing things. For movies, it's for art and entertainment. For intelligence services, it's for God knows what. That's one of the themes of this story: the power of storytelling, whether it's political theater, relating to our children, or trying to get people out of danger. Telling stories is incredibly powerful. There's a shot I really like where there's this firing squad, then you go to this read through, and then there's a firearm, a rifle, and a camera. Hopefully this is subtle, but that suggests the camera is more powerful than the gun. I think that's been really worn out with the Youtube era.", "[on life after 'Gigli' and 'Jersey Girl'] Unfortunately there's an aspect of (press coverage) that's like one of those fights you see on YouTube where one of them falls down and then a bunch of people, who were standing around, come over to kick the person. They don't know them, they have no involvement in the fight, but they recognize a moment that they can get a free shot in. And for some people it's just too much to resist. And that was definitely me at that point. I was the guy. I was the designated person to loathe.", "[reviewing his career, 2013] I was nobody auditioning, and then I was seen as this young, emerging talent, writer, Oscar-winner, and then I was seen as this blockbuster actor, and then I was seen as this train-wreck actor, and then I was seen as this resurgent director. And now I think I'm kind of seen as just sort of somebody in Hollywood who works.", "[on Roger Ebert's death] It just broke my heart that he had died. And the fact that his last review [of 'To the Wonder'] was through the prism of this wonderful man who was at the end of his life was one of the most powerful things to ever happen to me in my career.", "[his acceptance speech at the 2013's SAG 'Awards' (qv)] I can't believe I'm standing in the place where Daniel Day-Lewis just was. Feel like I may be a better actor just for the radiation.", "[2013: Excerpt from the closing remarks of his Best Picture acceptance speech] I want to thank [The Academy] and I want to thank what they taught me, which is that you have to work harder than you think you possibly can. You can't hold grudges. It's hard but you can't hold grudges. And it doesn't matter how you get knocked down in life, because that's gonna happen. All that matters is that you gotta get up.", "Having a family makes things you have that much richer. It's much nicer to share it with the people you love.", "[on _Enough Said (2013)_ (qv)] 'Nicole Holofcener' (qv)'s \"Enough Said\" is sublime. The performances and the direction are honest and restrained. She expertly coaxes the characters along through the story, and she manages to accomplish that rare feat: to make the performances so realistic you think it's a bunch of actors improvising as themselves, only to reveal a carefully constructed, interlocking story - woven expertly around profound themes. She has a graceful directorial touch. She makes space for her actors' success and seems to know precisely when they've achieved it. Her modesty as a director, her insistence not to step in front of the movie, at first serves to immerse us more fully into the film - and then pulls us from the feelings we didn't even know were there (and had been, no doubt, percolating on Ms. Holofcener's timetable all along). Her direction is void of spectacle, distraction or maudlin sentiment. She directs with the humanist, realist sensibility of Renoir, and like the great humanist films, \"Enough Said\" depicts our shared experience, illuminates the individual and celebrates what it means to be human.", "[on _Gigli (2003)_ (qv)] 'Martin Brest' (qv) is one of the really great directors. Most of what I've learnt that is good comes from Martin - but it just didn't work, in its essence. Also the studio wanted to change it into a love story because they thought, \"That's what people want to see because you guys are together now.\" Which is one of the great miscalculations in the history of miscalculations.[2012]", "[on being inspired by co-star Henry Cavill] I saw the first movie Man Of Steel and Henry was in it and I saw the kind of shape he was in it and it was very intimidating. I was like, \"Wow, I got to look like that? That's going to be a lot of work. I'm not sure I can be in quite that good of a shape. But Henry definitely set a high bar. But he has to be at that high bar because he's playing an alien. I figured I have a lower bar to reach, I'm just playing a man.\"", "[o why he stepped down as director on The Batman]There are certain characters who hold a special place in the hearts of millions,performing this role demands focus, passion, and the very best performance I can give. It has become clear that I cannot do both jobs to the level they require. Together with the studio, I have decided to find a partner in a director who will collaborate with me on this massive film. I am still in this, and we are making it, but we are currently looking for a director. I remain extremely committed to this project, and look forward to bringing this to life for fans around the world", "I have completed treatment for alcohol addiction; something I've dealt with in the past and will continue to confront.I want to live life to the fullest and be the best father I can be. I want my kids to know there is no shame in getting help when you need it, and to be a source of strength for anyone out there who needs help but is afraid to take the first step. I'm lucky to have the love of my family and friends, including my co-parent, Jen, who has supported me and cared for our kids as I've done the work I set out to do. This was the first of many steps being taken towards a positive recovery.[March 2017]", "I went to rehab when I was 29 and partying too much and not having a lot of boundaries and to clear my head and try to get some idea of who I wanted to be, It was more a 'let me get myself straight, before it became a rite of passage.", "[on producer 'Harvey Weinstein' (qv)] I knew he was sleazy and a bully, but unfortunately that wasn't that uncommon. I was brand new to Hollywood; I was 24 years old; I had never made a movie. I didn't know much of anything. [Nov. 2017]", "[on his infamous back tattoo] I like it. It's something I sort of kept private. It wasn't like I was sort of doing photo shoots or whatever. We were two hours north of the city on some island in Hawaii, and we didn't know paparazzi was there. So they got a picture of my tattoo and, yeah, the sentiment ran, you know, against. I was like, 'I love my tattoo.' I'm very happy with it. Luckily I'm the one who has it."], "salary history": ["_Field of Dreams (1989)_ (qv)::$30", "_Daddy (1991)_ (qv)::$20,000", "_School Ties (1992)_ (qv)::$30,000", "_Chasing Amy (1997)_ (qv)::$7,000", "_Good Will Hunting (1997)_ (qv)::$300,000 (split $600,000 script sale with 'Matt Damon' (qv))", "_Armageddon (1998)_ (qv)::$600,000", "_Reindeer Games (2000)_ (qv)::$6,000,000", "_Bounce (2000)_ (qv)::$12,500,000", "_Pearl Harbor (2001)_ (qv)::$10,000,000 ($250,000 salary + 7% backend participation)", "_Changing Lanes (2002)_ (qv)::$10,000,000", "_The Sum of All Fears (2002)_ (qv)::$10,000,000", "_Daredevil (2003)_ (qv)::$11,500,000 + gross participations", "_Gigli (2003)_ (qv)::$12,500,000", "_Paycheck (2003)_ (qv)::$15,000,000", "_Jersey Girl (2004)_ (qv)::$10,000,000", "_Hollywoodland (2006)_ (qv)::$2,800,000"], "birth date": "1972-08-15", "birth notes": "Berkeley, California, USA", "_actorID": "48", "_source": "IMDB", "actorID": "0000255", "created_utc_dt": "08/26/2019, 21:54:20"}