{"headshot": "https://m.media-amazon.com/images/M/MV5BNjYyNjg1OTU1M15BMl5BanBnXkFtZTgwNzYyNTkzMDI@._V1_UX67_CR0,0,67,98_AL_.jpg", "height": "5' 7\" (1.7 m)", "mini biography": ["'Danai Gurira' (qv) was born in Grinnell, Iowa, to Josephine and Roger Gurira, who were from Zimbabwe. Her father was then teaching Chemistry at Grinnell College. When she was five, the family moved back to Zimbabwe, residing in the capital Harare. Gurira later returned to the United States, and studied social psychology at Macalester College, receiving an MFA from New York University's Tisch School of the Arts. She is the co-author of the play, \"In the Continuum\", with 'Nikkole Salter' (qv).::msb"], "trivia": ["She was nominated for the 2007 'Joseph Jefferson' (qv) Award for Actress in a Principal Role in a Play for \"In the Continuum\", at the Goodman Theatre in Chicago, Illinois.", "When Gurira's play \"Eclipsed\" was produced at the Yale Repertory Theater in 2009, the lead role of \"the Girl\" was performed by actress 'Adepero Oduye' (qv) and understudied by then-Yale Drama School student 'Lupita Nyong'o' (qv). A few years later, Oduye and Nyong'o both acted in the film _12 Years a Slave (2013)_ (qv), and Nyong'o won an Academy Award for that performance. When the same play was produced at New York's Public Theater six years later, Nyong'o this time played the lead role.", "She was awarded the 2012 Los Angeles Drama Critics Circle Award for Writing for \"The Convert\", in a co-production with McCarter Theatre Center and Goodman Theatre at the Kirk Douglas Theatre in Los Angeles, California.", "She was awarded the 2013 NAACP Theatre Award for Best Playwriting for \"The Convert\", in a co-production with McCarter Theatre Center and Goodman Theatre at the Kirk Douglas Theatre in Los Angeles, California.", "She was nominated for the 2016 Antoinette Perry (Tony) Award for Best Play for \"Eclipsed\", which she wrote, on Broadway in New York City.", "She was born in Grinnell, Iowa but resided in her parents' native Zimbabwe from ages five to eighteen, when she returned to the United States to attend college.", "She was awarded the 2016 Saturn Award for Best Supporting Actress on Television in _The Walking Dead (2010)_ (qv), and the 2018 Saturn Award for Best Supporting Actress in _Black Panther (2018)_ (qv).", "Co-founded Almasi Arts Inc., an organization dedicated to supporting arts education in Zimbabwe (2011). She currently serves as the Executive Artistic Director.", "Founded Love Out Girls, a non-profit organization which aims to highlight the issues and challenges that specifically affect women all through the world (2016).", "Attended and graduated from Dominican Convert High School, a private Catholic school in Harare, Zimbabwe.", "Received her Bachelor of Arts degree in Psychology from Macalester College in Saint Paul, Minnesota (2001).", "Received her Master of Fine Arts degree in Theatre from the Tisch School of the Arts, New York University.", "Currently resides in Los Angeles, California and spends regular time in New York City.", "Has two older sisters, Shingai and Choni Gurira, and one older brother, Tare Gurira.", "Speaks four languages fluently: English, French, Shona and basic Xhosa.", "Danai means \"loving each other\" in Shona.", "Her play, \"Eclipsed,\" in a Pegasus Theatre Chicago production at the Chicago Dramatists in Chicago, Illinois was nominated for a 2019 Non-Equity 'Joseph Jefferson' (qv) Award for Play Production.", "The ensemble of her play, \"Eclipsed\" in a Pegasus Theatre Chicago production at the Chicago Dramatists in Chicago, Illinois was nominated for a 2019 Non-Equity 'Joseph Jefferson' (qv) Award for Ensemble."], "quotes": ["[on preparing to play a sword-wielding zombie slayer in _The Walking Dead (2010)_ (qv)] I do have some dings on my apartment wall from tricks I was attempting at home. I don't advise that.", "I was a jock when I was a kid, so I've always wanted to physically live through a character - one of those really tough chicks."], "birth date": "1978-02-14", "birth notes": "Grinnell, Iowa, USA", "_actorID": "56", "_source": "IMDB", "actorID": "1775091", "created_utc_dt": "08/26/2019, 21:54:25"}