{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQ2MjMwNDA3Nl5BMl5BanBnXkFtZTcwMTA2NDY3NQ@@._V1_UY98_CR0,0,67,98_AL_.jpg", "birth name": "Thomas Jeffrey Hanks", "height": "6' (1.83 m)", "mini biography": ["Thomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His mother's family, originally surnamed \"Fraga\", was entirely Portuguese, while his father was of mostly English ancestry. Tom grew up in what he has called a \"fractured\" family. He moved around a great deal after his parents' divorce, living with a succession of step-families. No problems, no alcoholism - just a confused childhood. He has no acting experience in college and credits the fact that he could not get cast in a college play with actually starting his career. He went downtown, and auditioned for a community theater play, was invited by the director of that play to go to Cleveland, and there his acting career started.'Ron Howard' (qv) was working on _Splash (1984)_ (qv), a fantasy-comedy about a mermaid who falls in love with a business executive. Howard considered Hanks for the role of the main character's wisecracking brother, which eventually went to 'John Candy' (qv). Instead, Hanks landed the lead role and the film went on to become a surprise box office success, grossing more than $69 million. After several flops and a moderate success with the comedy _Dragnet (1987)_ (qv), Hanks' stature in the film industry rose. The broad success with the fantasy-comedy _Big (1988)_ (qv) established him as a major Hollywood talent, both as a box office draw and within the film industry as an actor. For his performance in the film, Hanks earned his first Academy Award nomination as Best Actor.Hanks climbed back to the top again with his portrayal of a washed-up baseball legend turned manager in _A League of Their Own (1992)_ (qv). Hanks has stated that his acting in earlier roles was not great, but that he subsequently improved. In an interview with Vanity Fair, Hanks noted his \"modern era of movie making ... because enough self-discovery has gone on ... My work has become less pretentiously fake and over the top\". This \"modern era\" began for Hanks, first with _Sleepless in Seattle (1993)_ (qv) and then with _Philadelphia (1993)_ (qv). The former was a blockbuster success about a widower who finds true love over the radio airwaves. Richard Schickel of Time magazine called his performance \"charming\", and most critics agreed that Hanks' portrayal ensured him a place among the premier romantic-comedy stars of his generation.In Philadelphia, he played a gay lawyer with AIDS who sues his firm for discrimination. Hanks lost 35 pounds and thinned his hair in order to appear sickly for the role. In a review for People, Leah Rozen stated, \"Above all, credit for Philadelphia's success belongs to Hanks, who makes sure that he plays a character, not a saint. He is flat-out terrific, giving a deeply felt, carefully nuanced performance that deserves an Oscar.\" Hanks won the 1993 Academy Award for Best Actor for his role in Philadelphia. During his acceptance speech, he revealed that his high school drama teacher Rawley Farnsworth and former classmate John Gilkerson, two people with whom he was close, were gay.Hanks followed Philadelphia with the blockbuster _Forrest Gump (1994)_ (qv) which grossed a worldwide total of over $600 million at the box office. Hanks remarked: \"When I read the script for Gump, I saw it as one of those kind of grand, hopeful movies that the audience can go to and feel ... some hope for their lot and their position in life ... I got that from the movies a hundred million times when I was a kid. I still do.\" Hanks won his second Best Actor Academy Award for his role in Forrest Gump, becoming only the second actor to have accomplished the feat of winning consecutive Best Actor Oscars.Hanks' next role - astronaut and commander 'Jim Lovell' (qv), in the docudrama _Apollo 13 (1995)_ (qv) - reunited him with 'Ron Howard' (qv). Critics generally applauded the film and the performances of the entire cast, which included actors Kevin Bacon, Bill Paxton, 'Gary Sinise' (qv), 'Ed Harris' (qv), and Kathleen Quinlan. The movie also earned nine Academy Award nominations, winning two. Later that year, Hanks starred in Disney/Pixar's computer-animated film _Toy Story (1995)_ (qv), as the voice of Sheriff Woody. A year later, he made his directing debut with the musical comedy _That Thing You Do! (1996)_ (qv) about the rise and fall of a 1960s pop group, also playing the role of a music producer.::Pedro Borges"], "spouse": ["'Rita Wilson' (qv)::(30 April 1988 - present) ( 2 children)", "'Samantha Lewes' (qv)::(24 January 1978 - 19 March 1987) ( divorced) ( 2 children)"], "trade mark": ["Frequently plays ordinary characters in extraordinary situations", "Likable, mild-mannered and good-natured personality", "Frequently works with 'Robert Zemeckis' (qv), 'Steven Spielberg' (qv), and 'Ron Howard' (qv)"], "trivia": ["Is a frequent guest host on _Saturday Night Live (1975)_ (qv).", "Received the Distinguished Public Service Award, the United States Navy's highest civilian honor, on Veterans Day 1999 for his work in the epic _Saving Private Ryan (1998)_ (qv).", "Entertainment Weekly chose him as the only actor worthy of $20 million.", "Dislocated his shoulder when he fell through a rotting floor in a building in Germany while scouting locations with 'Steven Spielberg' (qv) for the HBO series _Band of Brothers (2001)_ (qv) (1999).", "Second actor to win back-to-back Best Actor Oscars, for his work in _Philadelphia (1993)_ (qv) and _Forrest Gump (1994)_ (qv). The first was 'Spencer Tracy' (qv), for _Captains Courageous (1937)_ (qv) and _Boys Town (1938)_ (qv).", "Ranked #17 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list (October 1997).", "Attended Skyline High School in Oakland, California.", "Attended Chabot College in Hayward, California.", "Attended California State University, Sacramento.", "Voted best actor by the readers of Us magazine (1995).", "Younger brother of Sandra Hanks and Larry Hanks and older brother of 'Jim Hanks' (qv).", "After a one-shot guest appearance on _Happy Days (1974)_ (qv), producer 'Ron Howard' (qv) asked him to read for a secondary role in _Splash (1984)_ (qv), and he got the lead role instead.", "Married his first wife 'Samantha Lewes' (qv) (real name: Susan Dillingham) two months after their son Colin's birth.", "Hanks cited the help of a nearby ice cream shop which helped him gain 30 pounds for his role in _A League of Their Own (1992)_ (qv).", "Received emergency treatment for serious staph infection in leg after returning from overseas location shoot (1999).", "Was asked to play the title role in _Jerry Maguire (1996)_ (qv), which eventually went to 'Tom Cruise' (qv).", "His Oscar acceptance speech for _Philadelphia (1993)_ (qv) led to the plot of the movie _In & Out (1997)_ (qv). Hanks thanked a gay teacher in his speech.", "Has another brother who is a professor at the University of Illinois in Champaign-Urbana, Illinois.", "Received American Film Institute's Life Achievement Award, presented by fellow Oscar winner 'Steven Spielberg' (qv), the youngest ever to receive that award (12 June 2002).", "Returned to his old high school, Skyline High School in Oakland, California, to dedicate a renovated theater named for Rawley T. Farnsworth, the retired drama teacher he thanked in his _Philadelphia (1993)_ (qv) Oscar speech. Oakland Tribune reports Hanks donated about 1/4 of the $465,000 cost of the project. Then he led the audience of some 1000 people in a chorus of \"There's No Business Like Show Business\" (6 March 2002).", "Is a member of the International Thespian Society (a group supporting theatre for high school students internationally).", "'Jim Lovell' (qv), who Hanks played in _Apollo 13 (1995)_ (qv), is actually left-handed, but Hanks refused to write with his left hand for the movie.", "He is a third cousin, four times removed, of former U.S. President 'Abraham Lincoln' (qv). Their common ancestors were John Hanks (1680 - 1740) and his wife, Catherine, who were the great-great-grandparents of Lincoln, and the six times great-grandparents of 'Tom Hanks' (qv). 'Tom Hanks' (qv) is also a seventh cousin, once removed, of actor 'George Clooney' (qv) (Catherine and John Hanks were the seven times great-grandparents of Clooney).", "Ranked #13 in Premiere magazine's 2003 annual Power 100 List. Had ranked #15 in 2002.", "Is a diehard fan of the Cleveland Indians baseball team.", "Ranked #1 on Star TV's Top Ten Box Office stars of the 1990s (2003)", "Lost 30 pounds for his role as Andrew Beckett in _Philadelphia (1993)_ (qv).", "He gained weight for and later lost 55 pounds playing Chuck Noland in _Cast Away (2000)_ (qv).", "Is a fan of English Premier League soccer team Aston Villa and was presented with a shirt on a TV show with the print 'Hanks 1' on the back.", "Has been referred to by many as \"the modern 'James Stewart' (qv)\".", "'Biography' (qv) in: \"Who's Who in Comedy\" by Ronald L. Smith, pg. 205-206. New York: Facts on File, 1992.  ISBN 0816023387", "His heroic Oscar-winning gay character Andrew Beckett in the 1993 film _Philadelphia (1993)_ (qv) was ranked #49 on the Amerian Film Institute's heroes list of the 100 years of The Greatest Screen Heroes and Villians.", "He was voted the 26th Greatest Movie Star of all time by Entertainment Weekly.", "His three favourite bands/artists are 'Elvis Presley' (qv), 'Patrick Rondat' (qv) and Alabama Thunderpussy.", "His first wife 'Samantha Lewes' (qv) died of cancer 14 years after their divorce.", "Had made five films with director 'Steven Spielberg' (qv), four of which are tied to Europe. _Saving Private Ryan (1998)_ (qv) revolved around his character and his infantry unit seeking out a missing private in Europe during WW II. _Catch Me If You Can (2002)_ (qv) involved his character tracking down 'Frank Abagnale Jr.' (qv) in France; in _The Terminal (2004)_ (qv), his character was from the fictional eastern European country of Krakohzia, and _Bridge of Spies (2015)_ (qv) was a Cold War thriller where his character had to go to Berlin, Germany.", "Shortly before the release of Columbia Pictures' _Final Fantasy: The Spirits Within (2001)_ (qv), he was one of several actors speaking out against the use of \"synthespians\" (computer-generated actors) in the place of flesh-and-blood humans. Nevertheless, he took the lead role in the computer-animated film _The Polar Express (2004)_ (qv), a film highly-publicized for its use of new (and expensive) technique of digital actors.", "Between 1994 and 2004, he was the performer nominated for the most Academy 'Awards' (qv) (four times, along with 'Sean Penn' (qv), 'Meryl Streep' (qv), 'Judi Dench' (qv) and 'Ed Harris' (qv)) and won the most (twice).", "Was considered for the role of Peter Banning (Peter Pan) in _Hook (1991)_ (qv), which went to 'Robin Williams' (qv).", "Was listed as a potential nominee on both the 2005 and 2007 Razzie Award nominating ballots. He was suggested in the Worst Actor category on the 2005 ballot for his roles in the films _The Polar Express (2004)_ (qv) (referred to as \"Bi-Polar Express\" on the ballot), _The Ladykillers (2004)_ (qv) and _The Terminal (2004)_ (qv). He was suggested again in the Worst Actor category two years later, for his performance in _The Da Vinci Code (2006)_ (qv). He failed to receive either nomination.", "Has been good friends with 'Bruce Springsteen' (qv) since his youth.", "He once worked as a hotel bellman. Some of the celebrity guests whose bags he carried were 'Cher' (qv), 'Sidney Poitier' (qv), 'Slappy White' (qv) and 'Bill Withers' (qv).", "Premiere magazine ranked him as #28 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature (2005).", "He is an environmental conservationist and often advocates and supports natural causes.", "In three of his movies, he has a scene where he is stranded at sea: _Splash (1984)_ (qv), _Joe Versus the Volcano (1990)_ (qv), and _Cast Away (2000)_ (qv).", "Has worked with two actors who played 'Howard Hughes' (qv). In _Philadelphia (1993)_ (qv), he worked with 'Jason Robards' (qv), who played Hughes in _Melvin and Howard (1980)_ (qv) for director 'Jonathan Demme' (qv). His cast mate in _Catch Me If You Can (2002)_ (qv) was 'Leonardo DiCaprio' (qv), who played Hughes in _The Aviator (2004)_ (qv) for 'Martin Scorsese' (qv).", "He and his good friend 'Meg Ryan' (qv) have been co-stars in three movies as love interests: _Sleepless in Seattle (1993)_ (qv), _Joe Versus the Volcano (1990)_ (qv) and _You've Got Mail (1998)_ (qv).", "Shares his birthday with 'Jack White' (qv), 'David O'Hara' (qv), 'Courtney Love' (qv), 'Chris Cooper' (qv), 'O.J. Simpson' (qv) and 'Donald Rumsfeld' (qv).", "On his father's side, Tom is of English, and some German, ancestry. Two of his paternal great-grandparents were English immigrants. Tom's maternal grandparents were both of Portuguese descent (from the Azores Islands). Tom's maternal great-grandfather had changed his surname from \"Fraga\" to \"Frager\".", "Born to Amos Mefford Hanks, a chef, and his wife Janet Marylyn Frager, a hospital worker, his parents divorced in 1960.", "Is a member of the Board of Governors of the Academy of Motion Picture Arts and Sciences (AMPAS) (Actors Branch) since 2001.", "Related to 'Bill Cosby' (qv)'s wife 'Camille O. Cosby' (qv) (née Camille Olivia Hanks), as both share a biological lineage to 'Abraham Lincoln' (qv) through Lincoln's mother, Nancy Hanks.", "Stepson of the former Frances Wong, whom his father married in 1965.", "Sold popcorn and peanuts as a teenager at the Oakland Coliseum.", "His performance as Josh Baskin in _Big (1988)_ (qv) is ranked #15 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "His performance as Chuck Noland in _Cast Away (2000)_ (qv) is ranked #46 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "His top five all-time favorite films are _2001: A Space Odyssey (1968)_ (qv), _The Godfather (1972)_ (qv), _Fargo (1996)_ (qv), _Elephant (2003)_ (qv) and _Boogie Nights (1997)_ (qv), with 'Stanley Kubrick' (qv)'s film holding the top ranking.", "His performance as Forrest Gump in _Forrest Gump (1994)_ (qv) is ranked #43 on Premiere magazine's 100 Greatest Movie Characters of All Time.", "Is the third most-represented actor (behind 'Sidney Poitier' (qv) and 'Gary Cooper' (qv)) on the American Film Institute's 100 Most Inspiring Movies of All Time, with four of his films making the list. They are: _Forrest Gump (1994)_ (qv) at #37, _Philadelphia (1993)_ (qv) at #20, _Apollo 13 (1995)_ (qv) at #12, and _Saving Private Ryan (1998)_ (qv) at #10.", "Ranked #16 on Premiere magazine's 2006 \"Power 50\" list. Had ranked #16 in 2005 as well.", "'Biography' (qv)/bibliography in: \"Contemporary Authors\". Volume 244, pages 199-202. Farmington Hills, MI: Thomson Gale, 2006.", "He once shared a record (with 'Tom Cruise' (qv) and 'Will Smith' (qv)) as the actor to star in the most consecutive $100 million-grossing movies (7). As of 2008, Smith holds the record alone with 8 movies.", "Frequently works with director 'Steven Spielberg' (qv), and is related to Nancy Hanks, the mother of 'Abraham Lincoln' (qv). He was not involved in Spielberg's film about Lincoln, despite his frequent involvement in historical projects.", "Forbes magazine estimated his 1999 earnings at $71.5 million.", "Cited as America's Favorite Movie Star in Harris Polls conducted in 2002, 2004, 2005, a record number of times as the #1 favorite. 'Harrison Ford' (qv) and 'Clint Eastwood' (qv) are the only other actors to have achieved that feat.", "Was a member of Monty Python for one night only, filling in for 'John Cleese' (qv), at A Concert For George.", "Married 'Rita Wilson' (qv) at Saint Sophia's Church, after converting to Eastern Orthodox Christianity.", "Was in attendance at 'Princess Diana' (qv)'s funeral along with 'Steven Spielberg' (qv), 'Tom Cruise' (qv), 'Nicole Kidman' (qv), among others.", "Auditioned for the role of Joel Goodson in _Risky Business (1983)_ (qv), which eventually went to 'Tom Cruise' (qv).", "Has also credited 'Joe Spano' (qv), former co-star of the television series _Hill Street Blues (1981)_ (qv), as being another of his most important early inspirations.", "Favorite baseball team is the Cleveland Indians. He purchased a stone in the front of Jacobs Field when it was built.", "In 2007, Forbes magazine reported that his earnings were estimated to be $74 million the previous year.", "The asteroid \"12818 tomhanks\" was named after him.", "Enjoys collecting typewriters, purchasing over 80 of them around the globe. His interest in them generated an idea for an iPad application that he developed called Hanx Writer, that simulates antique typewriters sound and feel. It was very successful and made it to to top list on Appstore in August 2014.", "Publicly endorsed Senator 'Barack Obama' (qv) in the 2008 presidential election.", "Is a diehard fan of the Oakland Raiders. Featured in the documentary _Rebels of Oakland: The A's, the Raiders, the '70s (2003)_ (qv).", "Is a huge fan of _Law & Order: Special Victims Unit (1999)_ (qv), and has expressed desire to one day guest star on the series.", "Is a huge fan of _Doctor Who (1963)_ (qv).", "Was originally cast in the dual role of Charlie Kaufman/Donald Kaufman in _Adaptation. (2002)_ (qv), but later dropped out. 'Nicolas Cage' (qv), who went on to receive a Best Actor Oscar nomination for his performance, was cast instead.", "When he appeared on _The Tonight Show with Conan O'Brien (2009)_ (qv), Conan's last NBC show in L.A. (Jan. 22, 2010), the Tonight Show Band played 'The Beatles' (qv)' \"Lovely Rita\" as Hanks made his entry, undoubtedly a nod to the lovely 'Rita Wilson' (qv), Tom's beloved wife.", "Lives in Pacific Palisades, Malibu, California and Ketchum, Idaho.", "Both 'Tom Hanks' (qv) and his son, 'Colin Hanks' (qv), have been \"Not My 'Job' (qv)\" quiz contestants on the National Public Radio show, \"Wait Wait...Don't Tell Me!\". Both won the quiz.", "Has often done films which (comically) use urinating/using the bathroom as a plot device (e.g. _The Green Mile (1999)_ (qv), _Apollo 13 (1995)_ (qv), _Forrest Gump (1994)_ (qv), _A League of Their Own (1992)_ (qv) and _Dragnet (1987)_ (qv)).", "Has been diagnosed with Type 2 diabetes on October 7, 2013.", "Became a father for the first time at age 21 when his girlfriend [now ex-wife] 'Samantha Lewes' (qv) gave birth to their son 'Colin Hanks' (qv) on November 24, 1977.", "Became a father for the second time at age 25 when his first [now ex] wife 'Samantha Lewes' (qv) gave birth to their daughter 'Elizabeth Hanks' (qv) on May 17, 1982.", "Became a father for the third time at age 34 when his second wife 'Rita Wilson' (qv) gave birth to their son 'Chet Hanks' (qv) on August 4, 1990.", "Became a father for the fourth time at age 39 when his second wife 'Rita Wilson' (qv) gave birth to their son Truman Theodore Hanks on December 26, 1995.", "Became a grandfather for the first time at age 54 when his granddaughter Olivia Jane Hanks, via son 'Colin Hanks' (qv), was born on February 1, 2011.", "Became a grandfather for the second time at age 56 when his granddaughter Charlotte Bryant Hanks, via son 'Colin Hanks' (qv), was born on July 1, 2013.", "New York City: Opens on Broadway in \"Lucky Man\", the last play written by his friend and frequent director, the late 'Nora Ephron' (qv). This was also be Hanks's first-ever appearance in a stage production since he was in junior college, and he co-starred with another old friend, his old _Bosom Buddies (1980)_ (qv) co-star, 'Peter Scolari' (qv). [February 2013]", "Some of his movies use comedic scenes of his character urinating: _The Money Pit (1986)_ (qv), _A League of Their Own (1992)_ (qv), _Forrest Gump (1994)_ (qv), _Apollo 13 (1995)_ (qv) and _The Green Mile (1999)_ (qv).", "Hanks, 'Leonardo DiCaprio' (qv), 'Tilda Swinton' (qv), 'Marion Cotillard' (qv), 'Emma Thompson' (qv), 'Daniel Brühl' (qv), 'Jake Gyllenhaal' (qv) and 'Amy Adams' (qv) are the only actors to receive a Golden Globe, SAG, BAFTA and Critics' Choice Award nomination for the same performance and then fail to be Oscar-nominated for it: for their performances in _Captain Phillips (2013)_ (qv), _The Departed (2006)_ (qv), _We Need to Talk About Kevin (2011)_ (qv), _Rust and Bone (2012)_ (qv), _Saving Mr. Banks (2013)_ (qv),_Rush (2013)_ (qv),_Nightcrawler (2014)_ (qv) and _Arrival (2016)_ (qv), respectively.", "As of 2018, has appeared in 9 films that were Oscar nominated as Best Picture: _Forrest Gump (1994)_ (qv), _Apollo 13 (1995)_ (qv), _Saving Private Ryan (1998)_ (qv), _The Green Mile (1999)_ (qv), _Toy Story 3 (2010)_ (qv), _Extremely Loud & Incredibly Close (2011)_ (qv), _Captain Phillips (2013)_ (qv), _Bridge of Spies (2015)_ (qv) and _The Post (2017)_ (qv). Of those, _Forrest Gump (1994)_ (qv) is a winner in the category.", "Has played a captain in five different movies: _Forrest Gump (1994)_ (qv), _Apollo 13 (1995)_ (qv), _Saving Private Ryan (1998)_ (qv), _Captain Phillips (2013)_ (qv) and _Sully (2016)_ (qv).", "A recipient of the 2014 Kennedy Center Honors. Other recipients this year were 'Al Green' (qv), 'Patricia McBride' (qv), 'Sting' (qv), and 'Lily Tomlin' (qv).", "Nine actors received an Oscar nomination for Best Supporting Actor for their work in a movie starring Hanks: 'Gary Sinise' (qv) in _Forrest Gump (1994)_ (qv), 'Ed Harris' (qv) in _Apollo 13 (1995)_ (qv), 'Michael Clarke Duncan' (qv) in _The Green Mile (1999)_ (qv), 'Paul Newman' (qv) in _Road to Perdition (2002)_ (qv), 'Christopher Walken' (qv) in _Catch Me If You Can (2002)_ (qv), 'Philip Seymour Hoffman' (qv) in 'Charlie Wilson' (qv)'s War (2007), 'Max von Sydow' (qv) in _Extremely Loud & Incredibly Close (2011)_ (qv), 'Barkhad Abdi' (qv) in _Captain Phillips (2013)_ (qv) and 'Mark Rylance' (qv) in _Bridge of Spies (2015)_ (qv). Out of all these movies, Hanks was only nominated (and won) for 'Forrest Gump'.", "Is a huge fan of _Monty Python's Flying Circus (1969)_ (qv). That's the reason he agreed upon playing one of the Canadian Mounties in the Lumberjack song during _Concert for George (2003)_ (qv).", "'Tom Hanks' (qv) was, respectively, 38 and 39 when he won his back-to-back Best Actor Oscars in 1994 and 1995, exactly like 'Spencer Tracy' (qv) when he won in 1938 and 1939.", "Hanks designated _2001: A Space Odyssey (1968)_ (qv) as his favorite film for an AFI poll.", "His daughter 'Elizabeth Hanks' (qv) appears in the movie, _Forrest Gump (1994)_ (qv), as the girl on the school bus who refuses to let young Forrest Gump ('Michael Conner Humphreys' (qv)) sit next to her.", "In 2015, 'Tom Hanks' (qv) started using his official Twitter feed in part to post photos and locations of lost items (such as gloves, shoes, socks, etc.) that he saw on the streets of New York. In at least one case, this resulted in the lost property being returned to its owner--in October 2015, he found the Fordham College ID for a woman named Lauren, and she retrieved it from his office.", "Has worked with nine directors who have won a Best Director Oscar: 'Ron Howard' (qv), 'Jonathan Demme' (qv), 'Robert Zemeckis' (qv), 'Steven Spielberg' (qv), 'Sam Mendes' (qv), 'Joel Coen' (qv) and 'Ethan Coen' (qv), 'Mike Nichols' (qv) and 'Clint Eastwood' (qv).", "After his parents Amos and Janet divorced in 1960, siblings Tom, Larry and Sarah went to live with their father, staying in 10 different homes in 5 years, while younger brother Jim remained with their mother.", "Has portrayed seven real-life people in his films: 'Jim Lovell' (qv) in _Apollo 13 (1995)_ (qv), 'Charlie Wilson' (qv) in 'Charlie Wilson' (qv)'s War (2007), Captain 'Richard Phillips' (qv) in _Captain Phillips (2013)_ (qv), 'Walt Disney' (qv) in _Saving Mr. Banks (2013)_ (qv), 'James B. Donovan' (qv) in _Bridge of Spies (2015)_ (qv), Captain 'Chesley Sullenberger' in _Sully (2016)_ (qv) and Ben Bradlee in _The Post (2017)_ (qv).", "_That Thing You Do! (1996)_ (qv) is the only film to feature Tom, wife 'Rita Wilson' (qv), son 'Colin Hanks' (qv) and daughter 'Elizabeth Hanks' (qv).", "He was awarded the Presidential Medal of Freedom, the nation's highest civilian award, by President 'Barack Obama' (qv), in a live televised ceremony held in the East Room of the White House, on November 22, 2016, along with twenty other recipients, the the largest, and final Medal of Freedom ceremony of Obama's presidency. At this ceremony, the twenty-one recipients, in alphabetical order, included: 'Kareem Abdul-Jabbar' (qv), 'Elouise Cobell' (qv) (posthumous award given to her son), 'Ellen DeGeneres' (qv), 'Robert De Niro' (qv), 'Richard Garwin' (qv), 'Bill Gates' (qv), 'Melinda Gates' (qv), 'Frank Gehry' (qv), 'Margaret Hamilton' (qv) (as Margaret H. Hamilton), 'Tom Hanks' (qv), Rear Admiral 'Grace Hopper' (qv) (posthumous award given to her niece), 'Michael Jordan' (qv), 'Maya Lin' (qv), 'Lorne Michaels' (qv), 'Newton Minow' (qv), 'Eduardo Padron' (qv) (as Eduardo Padrón), 'Robert Redford' (qv), 'Diana Ross' (qv), 'Vin Scully' (qv), 'Bruce Springsteen' (qv) and 'Cicely Tyson' (qv).", "His company Playtone Entertainment is named after the fictional Playtone Records in the movie _That Thing You Do! (1996)_ (qv).", "He was awarded a Star on the Hollywood Walk of Fame at 7000 Hollywood Boulevard in Hollywood, California on June 1, 1992.", "Ranked third highest grossing actor of all time with all of his films grossing 4.3 billion dollars in the United States [2016].", "Jokingly sent the White House press corps a new espresso machine with a note that read \"Keep up the good fight for Truth, Justice, and the American Way, especially for the Truth part.\". [March 2017]", "In an interview with NPR, Hanks reflected on his first Oscar nomination for _Big (1988)_ (qv). He claimed that up until that time, he never considered himself an actor, per se, but rather a comical performer who appeared in movies. He said he took that nomination as validation from others that maybe he actually knew what he was doing. He further said that because of that movie, he began making a conscious decision to take more serious roles, and that he sort of attributes much of the success of the second half of his career to that one event.", "Bought the film rights to a true crime story, outbidding other studios by paying $1 million for A Cold Case, about a detective's quest to solve the 1970 murder of a New York restaurant owner. As well as producing it, he's also interested in taking the lead role.", "Friends with 'Julia Roberts' (qv), 'Steven Spielberg' (qv), 'Ron Howard' (qv), 'Denzel Washington' (qv), and 'Frances McDormand' (qv).", "Though known for his on-screen charisma and versatility, Tom admits he was a \"horribly, painfully, terribly shy\" kid.", "He often meets children in random places such as elevators who don't understand how he is \"Woody\" from Toy Story, but he makes them close their eyes so he can perform the voice, to their enjoyment.", "Is distantly related to 'Bill Cosby' (qv)'s wife Camille Cosby, they are related by way of 'Abraham Lincoln' (qv)'s mother Nancy Hanks.", "In both of the movies for which he won his Best Actor Oscars his character's mothers were played by previous Best Actress Oscar winners; 'Joanne Woodward' (qv) in _Philadelphia (1993)_ (qv), who won in 1958 for _The Three Faces of Eve (1957)_ (qv), and 'Sally Field' (qv) in _Forrest Gump (1994)_ (qv), who won in 1980 for _Norma Rae (1979)_ (qv) and in 1985 for _Places in the Heart (1984)_ (qv).", "Son of Amos (1924-1992) and Janet (née Frager) Hanks (1932-2016). Both were born and raised in the state of California.", "Paternal grandson of Ernest Buel Hanks (1890-1935) and Gladys Hilda Ball (1888-1965). Maternal grandson of Clarence (1903-1945) and Elexio (née Rose) Frager (1907-1955). His maternal grandparents were born and raised in the state of California, both of them of Portuguese ancestry.", "Maternal great-grandson of Manuel (1872-1933) and Mary (née Enos) Frager (1878-1930). Both were born and raised in the state of California.", "In _Toy Story (1995)_ (qv), his co-star, Buzz Lightyear was an astronaut. Hanks himself had played an astronaut in _Apollo 13 (1995)_ (qv).", "His father's paternal grandmother was daughter of Jacob M. Mefford (b. Newport, Campbell County, Kentucky, July 10, 1829, d. Shelby County, Missouri, August 7, 1921) and wife (m. Owen County, Kentucky, June 1852) Sarah F. Critchlow, paternal granddaughter of John Mefford (b. 1798) and wife Mary Parker and maternal granddaughter of Johnson R. Critchlow (b. Kentucky, 1807) and wife Rebecca Stafford.", "His father's paternal grandfather was son of Thomas Hanks (b. Kentucky, May 15, 1819, d. Missouri, aft. 1880) and wife Rachel Rayburn Cull (b. Kentucky, May 27, 1817) and paternal grandson of Thomas Hanks (b. Richmond County, Virginia, March 11, 1791, d. Carroll County, Kentucky, January 20, 1882) and wife (m. December 22, 1812) Sarah Tandy (b. Lexington, Fayette County, Kentucky, June 23, 1791, d. Carroll County, Kentucky, February 11, 1862).", "He has appeared in four films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: _A League of Their Own (1992)_ (qv), _Forrest Gump (1994)_ (qv), _Toy Story (1995)_ (qv) and _Saving Private Ryan (1998)_ (qv)."], "quotes": ["It's just as hard staying happily married as it is doing movies.", "I've made over 20 movies, and 5 of them are good.", "[on the CGI used in _The Polar Express (2004)_ (qv)] It's the same stuff they used in that fourth Lord of the Rings movie. Or was it the 19th Lord of the Rings movie? You know, the one where Boldo and Jingy travel across the bridge? I don't know, I don't know their names. When I watch Lord of the Rings, I just think, \"Someone got their finger stuck on the word processor for too long\".", "If you're funny, if there's something that makes you laugh, then everyday's going to be okay.", "I do not want to admit to the world that I can be a bad person. It is just that I don't want anyone to have false expectations. Moviemaking is a harsh, volatile business, and unless you can be ruthless, too, there's a good chance that you are going to disappear off the scene pretty quickly. So appearances can be deceptive, particularly in Hollywood.", "My wife keeps on telling me my worst fault is that I keep things to myself and appear relaxed. But I am really in a room in my own head and not hearing a thing anyone is saying.", "Some people go to bed at night thinking, \"That was a good day.\" I am one of those who worries and asks, \"How did I screw up today?\"", "I love what I do for a living, it's the greatest job in the world, but you have to survive an awful lot of attention that you don't truly deserve and you have to live up to your professional responsibilities and I'm always trying to balance that with what is really important.", "I must say that I do wrestle with the amount of money I make, but at the end of the day what am I gonna say? I took less money so 'Rupert Murdoch' (qv) could have more?", "My favorite traditional Christmas movie that I like to watch is _All Quiet on the Western Front (1930)_ (qv). It's just not December without that movie in my house.", "The year I was born, 1956, was the peak year for babies being born, and there are more people essentially our age than anybody else. We could crush these new generations if we decided to.", "[regarding the WGA Strike and how it could affect the Academy 'Awards' (qv)] The show must go on, that is one of the tenets of everything. I am a member of the board of governors of the Academy, and we definitely want to put on a great show and honor the films that have come out in the course of the year. I just hope that the big guys who make big decisions, up high in their corporate boardrooms and what not, get down to honest bargaining and everyone can get back to work.", "As you know, the election between 'Thomas Jefferson' (qv) and 'John Adams' (qv) was filled with innuendo, lies, a bitter, partisan press and disinformation. How great we've come so far since then.", "In this business, careers are based upon longevity.", "If I was to direct 'Ron Howard' (qv), I guarantee you, I would put him through a living hell every day. I would demand so much of him. We wouldn't quit until he leaves the set crying. Weeping! Spent!", "My work is more fun than fun but, best of all, it's still very scary. You are always walking some kind of high wire. I guess it's like being a sportsman. When people ask great football stars or cricketers what they will miss most when the time comes to stop, they'll tell you that it's that moment when the ball comes to them. In that moment, there's that wonderful anxiety, that feeling of \"Please don't let me screw this up\". If I didn't have the chance to do what I do, it's that I would miss more than anything. That terror is what makes me feel alive. It's a wonderful feeling, unlike anything else in the world.", "[on 'Charlie Wilson' (qv)] Wilson may have lived his life in a certain way, but to give him his due, he severed the Achilles' heel of the Soviet Union. It was just nine months after they pulled out of Afghanistan that the Berlin wall came down. And one of the reasons it fell was that the Soviet government knew that the cream of its armed forces had been decimated by a bunch of people in a place called Afghanistan. That meant they couldn't defend their borders in East Germany and Poland. That has 'Charlie Wilson' (qv) all over it.", "[on _The Bonfire of the Vanities (1990)_ (qv)] When we were making it, that movie was huge. We couldn't make a move anywhere in New York City. Everybody was talking about it. Everybody was miscast, me particularly. 'Brian De Palma' (qv) deals with iconography more than filmmaking. He is the most uncompromising filmmaker - both in a good way and a bad way - that you'll ever come across. This is the guy who made _Scarface (1983)_ (qv). So his take on it one just one of those things. You can't take a book like that, that has changed the way people talk and think and change it into a palatable movie, or alter the thrust of what the source material is talking about. It may not translate in a way that is going to work.", "[on _The Pacific (2010)_ (qv)] Back in World War II, we viewed the Japanese as \"yellow, slant-eyed dogs\" that believed in different gods. They were out to kill us because our way of living was different. We, in turn, wanted to annihilate them because they were different. Does that sound familiar, by any chance, to what's going on today?", "[In a New York Times article on 'Julia Roberts' (qv)]: What am I, just another in your long line of I Love Julia calls?", "[on _Bachelor Party (1984)_ (qv)] I'm the only one at the bachelor party not to get laid. The movie is just a sloppy rock-and-roll comedy that has tits in it. It was made when the studios were making lots of _Porky's (1981)_ (qv) and _National Lampoon's Animal House (1978)_ (qv) kinds of things.", "When you have a hit, you get so much attention paid to you. _Splash (1984)_ (qv) made eighty million dollars and _Bachelor Party (1984)_ (qv) made forty million. You think, Oh, I know how to do this. But you can't even begin to know anything after two movies, though you can get arrogant and lazy. I didn't become an actor to develop a personality cult or to get power over people. I went into this because it's fun, because it's a great way to make a living. That really governs my reaction to it all. But you get all this attention. Your head can play all sorts of bizarre tricks. By now, I think I have a pretty good grasp of how this stuff works. I fought my battles a long time ago. I guess you have a period when you think you deserve all the attention you're getting. You have people surrounding you, telling you that you're the greatest thing in the world. I honestly don't think I have an inflated view of myself now. But it happens.", "[on _The Man with One Red Shoe (1985)_ (qv)] Not a very good movie. It doesn't have any real, clear focus to it. It isn't about anything particularly that you can honestly understand. It made no money at all.", "[on _Nothing in Common (1986)_ (qv)] Has a bit of a split personality, because we're trying to be very funny in the same movie in which we're trying to be very touching. It's the best work that I had done up to then. It didn't go through the roof, but it did very well.", "[on _Every Time We Say Goodbye (1986)_ (qv)] Disappeared without a trace, even though it's probably the most visually beautiful movie I've made.", "[on _Dragnet (1987)_ (qv)] Made a lot of money but probably not nearly as much as anticipated. It's convoluted. There are problems with it. It should be funnier.", "[on _Punchline (1988)_ (qv)] That's the hardest one to make any sort of judgment on. The movie didn't do that well, which was really disappointing. If I were going to figure out why, I would end up taking a bunch of cheap shots at an awful lot of people who tried real hard, and that's not fair. What can you say? But it's the best work I've ever done. We were talking some real naked truths about the characters and, in a lot of ways, about myself. I was too close. The guy in Punchline probably has the worst aspects of my worst aspects. He is extremely competitive, for one thing. Competitive to a fault. He is unable to balance his daily existence so that real life and what he does for a living have an equal weight. I've certainly had those problems; I think any actor has: The only time you really feel alive is when you're working. I've gotten a little more mature since I was like that, but I think that's what really drives actors absolutely stark-raving mad and why they develop ulcers and drug problems. Part of it is the insecurity factor-every time, you feel like you're never going to get another chance again. They're going to catch on, and that'll be it. Even when you're working a lot, you think, \"How many of these do I get?\", It's like they give you only so many dollars in your wallet and once those dollars are spent, you're broke.", "[on working with 'Jackie Gleason' (qv) in _Nothing in Common (1986)_ (qv)] I was intimidated up to a point, but we worked as peers. I was certainly deferential and respectful. He wasn't feeling a hundred percent as far as his health, so he was kind of slow. But it was amazing: He came in exactly at nine, worked straight through to five. He had it down, knew what he wanted to do, got up and did it. He was just very, very professional.", "As a child, I had an incredible amount of freedom to do whatever I wanted to do. By the time I was in junior high school, I was wandering around, freely, as much as I wanted to. A free spirit.", "[on why his parents divorced] Mostly because of money. They weren't well off, and neither one of them could deal with four kids at one time. Also, my dad wanted us. Since then, I've had a divorce myself and I went back and talked to my parents. I asked them how they could do that, split us up. The answer was that you do what you have to do at the time. After that, my dad met another woman and married her and we moved to Reno. She had five kids of her own. Suddenly, it was, like-bang, zoom!-there were eight kids around. We were total strangers, all thrust together. I remember in school we had to draw a picture of our house and family and I ran out of places to put people. I put them on the roof. I drew Dad in bed, sleeping, since he worked so hard in the restaurant. When he and she split up, I never saw those people again.", "[on his on-screen heroes] 'Robert Duvall' (qv). All he has to do is walk across the street. And certainly 'Jack Nicholson' (qv). And 'Robert De Niro' (qv). I would see whatever 'Jason Robards' (qv) did. 'Steve McQueen' (qv); he was really cool. Also, film directors. 'Stanley Kubrick' (qv) was a huge thing for me; _2001: A Space Odyssey (1968)_ (qv) was probably the most influential film, movie, story, artistic package, whatever, that I ever saw. It was just bigger. It affected me much, much more than anything I had ever seen. There was just awe. I've seen that movie twenty-two times. In theaters, not on video tape. Every time I saw it, I saw something new, something else that Kubrick had put in. He was able to suspend my disbelief. I just felt, We are in space. The only other things that affected me as profoundly were reading Catcher in the Rye and finding out, in the fifth or sixth grade, about the Holocaust. I remember feeling as alone as Holden Caulfield did, thinking, This isn't talking about me, or my life, yet I know how he feels. Another thing about that book: I remember being very impressed at seeing the word crap in print.", "[on experimenting with drugs] As to drugs, there isn't anybody who didn't smoke pot. And I also had done some blow. But I never did LSD. I never even did Quãaludes or anything like that, though all of this stuff, especially for someone who worked in the theater, was abundant. Smoking pot just made me the stupidest human being in the world.", "I think my world image would have been very different if I had lost my virginity in high school, but I didn't. No _Bachelor Party (1984)_ (qv) antics, I'm afraid. I just had a girlfriend for a long time. But something important did happen in high school. I took a drama class that determined my career. In the course of ten weeks, I saw five completely different types of theater. I felt that the theater was as magical a place as existed, and I wanted to be involved in it. So I majored in theater arts. After I saw a Berkeley Repertory Theater production of The Iceman Cometh, I knew I'd do anything to be a part of it. I went to Chabot College, where they had a great theater department. I started out operating the lights and building the sets. Later on, I began to perform and went off to the Great Lakes Shakespeare Festival in Cleveland as slave labor. That was my big break. I went back to Sacramento as a professional actor and then went to New York with my wife and child. It was a war of survival, really. I was a kid who had never been in such a big city before. I was on unemployment and trying to act. My wife was an actress as well, and she was pursuing that as best she could. This went on for two years. Finally, I got a job in a low-budget movie, and after that, I got a development deal with ABC and we moved to California.", "[on landing _Bosom Buddies (1980)_ (qv)] I had lived in New York for a couple of years and had developed, I guess, a defense mechanism when it came to auditions. And that was not to care about them too much. So I was able to go in and be so casual, so nonchalant about impressing those people that I'd screw it up-as opposed to trying to show them how great and unique a talent you are. People hate you when you do that. Eventually, a development deal was struck, which meant I would probably work in some ABC-TV series. It worked out to be \"Bosom Buddies\". We all had a great time. I thought we did some really excellent television shows. We, as actors, got to be a very, very finely-honed team. It was a great marriage, as far as that goes...By the end of two seasons, we were pretty well flagged. We were just exhausted. Everybody probably would have said the show was canceled at the right time, because we would have begun to chew each other's heads off.", "[on working with 'Penny Marshall' (qv) on _Big (1988)_ (qv)] Well, one thing she did that drove me crazy was to test over and over and over again with all sorts of actors. There were scenes that I must have done two hundred times on video tape and then two hundred more in the rehearsal process. Penny just wanted to see all sorts of things. I would say, \"I can't do this scene one more time. I don't care who it is. I cannot read these same goddamn words one more time or by the time we get to making the movie, I'm going to hate it so much that I'm not going to do it at all\". Well, what happened instead was, I knew the material so well that by the time we shot it, it turned out to be the best rehearsed of all the movies that I've done. There are only certain people I would accept that from. Penny is one. To most others, I would say, \"Look, you either tell me exactly what is wrong or what is right about this or I'm going to strangle you\".", "[on filming the keyboard dancing sequence in _Big (1988)_ (qv)] It was exhausting. We rehearsed until we dropped. 'Robert Loggia' (qv) plays three sets of tennis every day, so he was in shape for it. It was like jumping rope for three and a half hours every time we did the scene. It was really hard work.", "[on peers he admires] 'Sean Penn' (qv) brings an integrity to his work that I think we all wish we had. 'Mickey Rourke' (qv) is a guy I'll pay five dollars to walk across the street and see. There's something he does that he loads up his movies with, whether they're good or bad. Also 'Kevin Costner' (qv), 'Tom Berenger' (qv) and 'Michael Keaton' (qv). I rarely go to the movies when I don't think, \"Man, I wish I had that part\", you know?", "[on if he's gotten use to being rich and famous] It's a kick in the head, but it doesn't add to my ability. It doesn't add to my self-worth. I've always felt I could buy whatever I wanted, to tell you the truth, even when I didn't have any money. I honestly don't need an awful lot to keep me happy. What the money can do is guarantee the security of an awful lot of other people. I've been able to help my family. It's great to be able to do nice things for the people I care about. (As far as being famous), I remember that I'm not a rocket scientist. The only thing I have to protect from too much attention is my family, which I can do, for the most part. I talk to the press all the time. I'm accessible. It makes things easier. People leave you alone more. It is still a bit disconcerting to see a picture of myself and my wife in a tabloid or something like that, but big deal. I don't really go out into real public situations. I don't know what's going to happen if I try to go to hockey games next year and I can't get out of the place. But I still pursue the things that are important to me.", "[on Twitter]: Tweeting is like sending out cool telegrams to your friends once a week.", "[on being a supporter of British soccer team Aston Villa]: I fell in love with Aston Villa because I thought the name sounded like a lovely island off Sardinia.", "[on _Larry Crowne (2011)_ (qv)] At the end, Larry Crowne is living in a crappy apartment. He still has a lousy job, he can't even afford to pay for the gas in his big car, and he's going to school with no real set future of what's going to happen. But he has this amazing new forceful presence in his life, and he can honestly say that the best thing that ever happened to him was getting fired from his job.", "[on _Larry Crowne (2011)_ (qv)] We wanted to examine the theme of reinvention - not reinvention by way of fate dictating it, but by your own proactive place in how you move on to whatever the next chapter is going to be. It really began [this way]: I lose my job, I go to college, my teacher is 'Julia Roberts' (qv). What would happen?", "We are competing in a marketplace in which the thing we might have going for us is the true battle against cynicism. That's what _Larry Crowne (2011)_ (qv) is about, more than anything else.", "[on 'Nora Ephron' (qv)] Knowing and loving Nora meant her world - or her neighborhood - became yours. She gave you books to read and took you to cafes you'd never heard of that became legends. You discovered Krispy Kremes from boxes she held out, and you learned there is such a thing as a perfect tuna sandwich. She would give your kids small, goofy parts in movies with the caveat that they might not make the final cut but you'd get a tape of the scene. For a wrap gift she would send you a note saying something like, \"A man is going to come to your house to plant an orange tree - or apple or pomegranate or whatever - and you will eat its fruit for the rest of your days.\"", "I am a lay historian by nature. I seek out an empirical reflection of what truth is. I sort of want dates and motivations and I want the whole story. But I've always felt, unconsciously, that all human history is that connection from person to person to person, event to event to event, and from idea to idea.", "[on preparing for his role in _Cast Away (2000)_ (qv)] The idea of looking at four months of constant vigilance as far as what I ate, as well as two hours a day in the gym doing nothing but a monotonous kind of workout - that was formidable. You have to power yourself through it almost by some sort of meditation trickery. It's not glamorous.", "Anytime you go off to do something new, you're involved in a reinvention, and any actor who says otherwise is just trying to lower expectations.", "I have a great affection for the Irish. My professional experience was started by a great man named 'Vincent Dowling' (qv) - as much a creature of the Irish theatre as has ever existed.", "May you live as long as you want and not want as long as you live.", "There's no substitute for a great love who says, \"No matter what's wrong with you, you're welcome at this table\".", "You learn more from the things that don't work out than the things that do. I worked harder on _Turner & Hooch (1989)_ (qv) than I did on 80% of the films I've made.", "[When asked why we glorify acting the way we do] I think it's the basic need for all of human kind to be a part of something bigger than themselves because as actors we get to create that.", "[on turning 60, and what his advice would be to his younger self would be]: Floss, Do something about your blood sugar now you idiot and just learn how to relax.", "One of the things that I do in acting and movies is I assemble a very intricate backstory, the stuff that happens before the movie. I don't tell anybody this. I don't write it down. It's not like I get together with the director or screenwriter and say \"You know what this guy went through?\" You don't do that. But you put it together in your head so that every single movie moment that you are called upon to recreate, to make manifest on the set, has come from a specific place.", "[on 'Harvey Weinstein' (qv)] We're at a watershed moment, this is a sea change. His last name will become a noun and a verb. It will become an identifying moniker for a state of being for which there was a before and an after.", "[in an interview about _The 'Burbs (1989)_ (qv)] The suburbs are supposed to be as idyllic a place as you go to live, you have your house and you have your land and you stay there and it's a great place to retire to, it's a great place to raise a family. That's what the suburbs are supposed to be but in fact in the last 20 years or so, the suburbs have become this place where anything can happen. You have these neighbors that nobody knows what they're up to, they could be, you know, anything from insomniacs who are lazy, or you know, suburban psycho killers who have a death factory in their basement.", "If you're going to make a movie based on a true story, why not knuckle down, do the research, find out what actually happened, and start from there? Otherwise, it's just one big, fat, fake movie", "I don't cause riots, but I do cause confusion. People freeze when they spot me.", "A hero is somebody who voluntarily walks into the unknown.", "The same way that I know that I'll never do a movie as good or as celebrated as _Forrest Gump (1994)_ (qv), I know that I'll never do a movie as bad as _The Bonfire of the Vanities (1990)_ (qv).", "I've made an awful lot of movies that didn't make any sense, and didn't make any money, but that doesn't alter the work that goes into it, or even what your opinion of it is. Like, I made a movie that altered my entire consciousness - _Cloud Atlas (2012)_ (qv) - I thought, jeez, this thing is so fab; it's the only movie I've been in that I've seen more than twice. And it didn't do any business. And there's nothing you can do about it. And you must allow yourself a week of thinking, jeez, I'm so bummed out. But that's not the only reason to do it. It's lovely when it all works and you get ballyhooed. But if it's 50/50, you're way ahead of the game. In reality, I think it's more like 80/20; 80% of what you do doesn't work."], "salary history": ["_He Knows You're Alone (1980)_ (qv)::$800", "_Splash (1984)_ (qv)::$70,000", "_Big (1988)_ (qv)::$1,750,000", "_Punchline (1988)_ (qv)::$5,000,000", "_The 'Burbs (1989)_ (qv)::$3,500,000", "_The Bonfire of the Vanities (1990)_ (qv)::$5,000,000", "_Forrest Gump (1994)_ (qv)::$70,000,000 (gross and profit participations)", "_Toy Story (1995)_ (qv)::$50,000", "_Saving Private Ryan (1998)_ (qv)::$40,000,000 + (gross and profit participations)", "_You've Got Mail (1998)_ (qv)::$20,000,000", "_Toy Story 2 (1999)_ (qv)::$5,000,000", "_The Green Mile (1999)_ (qv)::$20,000,000", "_Cast Away (2000)_ (qv)::$20,000,000", "_The Da Vinci Code (2006)_ (qv)::$18,000,000 + profit participation", "_Angels & Demons (2009)_ (qv)::$50 000 000", "_Toy Story 3 (2010)_ (qv)::$15,000,000"], "birth date": "1956-07-09", "birth notes": "Concord, California, USA", "_actorID": "4", "_source": "IMDB", "actorID": "0000158", "created_utc_dt": "08/26/2019, 21:53:49"}