{"headshot": "https://m.media-amazon.com/images/M/MV5BMjI3MDA3NjA1N15BMl5BanBnXkFtZTcwMDcyMDYzNw@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Rupert Alexander Lloyd Grint", "height": "5' 8\" (1.73 m)", "mini biography": ["Rupert Alexander Lloyd Grint was born in Harlow, Essex, England, the elder son of Joanne (Parsons) and Nigel Grint, who dealt in memorabilia. The first of 5 children, Rupert has one brother and 3 sisters. His brother James was born when Rupert was a year old, Georgina and Samantha were born in 1993 and 1996 respectively, and last, but not least, Charlotte, who was born in 1999.Rupert grew up in Hertfordshire, the English county directly to the north of London, conveniently placed for commuting to Leavesden Film Studios. Before successfully auditioning for the Harry Potter films, Rupert attended Richard Hale Secondary School in Hertford: here he took an active interest in school plays, being cast as Rumplestilskin in the Brothers Grimm fairy tales. He was also a regular attendee at weekend drama classes at Top Hat Stage School, also in Hertford.Time at school was limited, as Rupert was needed on set for the Harry Potter films, where all of the child actors were tutored for four hours a day on set, to keep up with legal requirements. During the summer of 2004, he took his GCSE (General Certificate of Secondary Education) exams and completed his formal education.::BarbieWelsh"], "trade mark": ["Red hair", "Catchphrase: \"Bloody hell!\""], "trivia": ["Has one brother and three sisters.", "On his audition tape for Harry Potter, he performed hip-hop lyrics that he wrote to promote himself for the role of Ron Weasley.", "Loving the Harry Potter series, 'Rupert Grint' (qv) found out that there were auditions for the feature film, so he got the part although he had previously only acted in one school play.", "Siblings are: James (b. 1990); Georgina (b. 1993); Samantha (b. 1996); and Charlotte (b. 1998).", "Says he would like to be invisible so he could sneak out of detention at school", "Has arachnophobia and, as of 2010, has still not watched the whole, completed Aragog scene from _Harry Potter and the Chamber of Secrets (2002)_ (qv).", "Plays the guitar a little bit and also plays the didgeridoo.", "He attended an all boys-school in his hometown.", "He likes all kinds of music, but his favorite is classic rock and roll.", "His favorite actor is 'Jim Carrey' (qv). He likes movies like _Shrek (2001)_ (qv), _Ace Ventura: Pet Detective (1994)_ (qv), _How the Grinch Stole Christmas (2000)_ (qv), and _Dumb and Dumber (1994)_ (qv).", "Neglected to write the essay describing Ron Weasley for director 'Alfonso Cuarón' (qv), reasoning \"that's what Ron would have done.\".", "Took GCSEs at Richard Hale School, Hertford.", "After taking his GCSE exams in May/June 2004, he chose to finish school at the age of sixteen to focus on his role in the Harry Potter films.", "Can ride a unicycle.", "He had a role in _A Cinderella Story (2004)_ (qv) but was forced to drop so he can be committed to _Harry Potter and the Prisoner of Azkaban (2004)_ (qv).", "Bought a quad bike with his _Harry Potter and the Sorcerer's Stone (2001)_ (qv) earnings.", "He and his \"Harry Potter\" co-stars 'Daniel Radcliffe' (qv) and 'Emma Watson' (qv) were named #9 on Entertainment Weekly's Best Entertainers of the Year, 2005.", "In an interview in 2001 on Nickelodeon with 'Emma Watson' (qv) and 'Daniel Radcliffe' (qv), he stated his favorite show was _SpongeBob SquarePants (1999)_ (qv).", "Passed his driving test in the fall of 2006 after two attempts.", "Attended Top Hat Stage & Screen School in Hertford.", "Has 2 dogs, Ruby (a black lab) and Fudge (a chocolate lab).", "His father once ran a Motor Car Racing Memorabilia Company.", "Was ranked #16 on Forbes List of The 20 Top-Earning Young Superstars.(2007).", "One of his favorite bands is the 'Arctic Monkeys' (qv).", "On an on-line poll for Popstar Magazine in 2007, he was ranked the number one international celebrity.", "'Emma Roberts' (qv) and 'Alexa PenaVega' (qv) list him as their favorite actor.", "Radio One's movie critic James King named \"Ron Weasley\" and \"Hermione Granger\", played by 'Rupert Grint' (qv) and 'Emma Watson' (qv), as number 4 in his Top 5 Movie Couples list on 'Edith Bowman' (qv) show.", "Was considered one of the 55 faces of the future by Nylon Magazine's Young Hollywood Issue.", "After the immense success of the Harry Potter movies, the actor was able to fulfill a childhood fantasy of, not just driving an ice cream van, but actually owning one. According to friend 'Emma Watson' (qv), Grint bought a fully equipped van with all the traditional accoutrements (interview: _Late Night with Conan O'Brien: Episode #14.178 (2007)_ (qv)).", "Close friend of his Harry Potter co-star Tom Felton.", "Used to live in Cheryl Cole's old house in the Hertfordshire countryside.", "Currently filming the movie _Driving Lessons (2006)_ (qv) co-starring fellow \"Harry Potter\" star 'Julie Walters (I)'. [June 2005]", "Currently filming _Harry Potter and the Half-Blood Prince (2009)_ (qv). [October 2007]", "Filming _Cherrybomb (2009)_ (qv). [August 2008]", "Filming _Harry Potter and the Order of the Phoenix (2007)_ (qv). [February 2006]", "Filming _Wild Target (2010)_ (qv) with 'Emily Blunt' (qv) and 'Bill Nighy' (qv). [September 2008]", "Filming _Harry Potter and the Deathly Hallows: Part 1 (2010)_ (qv). [2009]", "Filming _Harry Potter and the Goblet of Fire (2005)_ (qv). [April 2004]", "Skjåk, Oppland, Norway: Filming Norwegian movie _Into the White (2012)_ (qv). [March 2011]", "Is a supporter of English football team Tottenham Hotspur.", "He is of English and 1/8th Irish ancestry.", "Rupert's arachnophobia is so severe, he still hasn't been able to bring himself to watch the scenes from Harry Potter and the Chamber of Secrets which he shared with Aragog, an acromantula (giant spider) in the film, even though the spider is completely rendered in CGI. In fact, Grint's look of extreme fright and discomfort in those scenes wasn't from acting, that was his arachnophobia manifesting from the mere thought of there being a spider nearby, especially a giant one like Aragog."], "quotes": ["[Answering to \"Is 'Emma Watson' (qv) actually bossy like Hermione?\"] I'd tell you, but she'd hurt me.", "Too bad brooms can't really fly. Now if you miss the bus you can't just go in your room and fly to school with a nimbus two thousand!", "Being famous is wicked, but it's better to be normal.", "Oh, they're scary. To think that people are going to be playing with you! [About Harry Potter action figures]", "All my brothers and sisters and friends have really helped me. They make my life normal. I still have arguments with my brother. And the little ones don't really understand. They just treat me like Rupert. Which is brilliant, really.", "Fans asking for my autograph is really weird. It's hard to get used to.", "I've tried several disguises and stuff but that doesn't work. I do get recognised sometimes but it's cool,.", "Things at home didn't change much. I still have to clean my own room!", "When I read the books, I imagined that the family of Ron Weasley was my family. After reading the books, I knew the Weasleys inside out.", "[Rupert would also like to play Malfoy]: \"He's pretty nasty all times, and that would be quite fun. It would be cool to have the audience against me.\"", "It's really weird to get recognized and people call you 'Ron.'", "I am the biggest \"Harry Potter\" fan; I even was before I knew there was going to be a film. I read all the books. The fourth one is amazing. It's scary, but I like all the books. You've got to read them all to get the complete Harry Potter experience. In the third book, I like all the bits about Scabbers being an Animagus. And I like that Ron gets an owl.", "[about \"don't be an assiduous student in school\"]: \"There is some truth in that statement. I don't like school, which makes it easier for me not to do my homework. Evidently, my professors aren't very happy, and being in the \"Harry Potter\" movies doesn't give me any special treatment. For example, when I returned to school after _Harry Potter and the Prisoner of Azkaban (2004)_ (qv) finished shooting, I had several hours of detention because I hadn't done my schoolwork.\"", "[Refering to 'Emma Watson' (qv) and her Table Tennis playing skills] We rarely play her now because it gets quite embarrassing.", "I do get one chance to dance, I had to dance with 'Maggie Smith' (qv). That was the only dancing experience I had, which was actually quite enough really. [About his dancing experience with 'Maggie Smith' (qv) in _Harry Potter and the Goblet of Fire (2005)_ (qv)].", "[on attempts to artificially age him as the stories progressed] In the first attempt, my character was particularly terrifying. The image still haunts me. I looked like a monster, really, a sort of Donald Trump mixture.", "[on red hair] I get a lot of people from the ginger community shaking my hand. In England. Not so much in America. It's not the coolest thing, really, and they get hassled. It's nice I can get some respect for the gingers. And 'Prince Harry' (qv) is really cool, too.", "[When he began to act on the Philosopher's Stone film, he was overcome by the grandness of the sets, describing how he felt as-] Walking into the Great Hall for the first time was absolutely incredible - all these effects with all the candles floating in the air, all lit and everything, food on the table, all the flambeaus were lit - it was just incredible, it was the most amazing thing I've ever seen in my life.", "[When _Harry Potter and the Chamber of Secrets (2002)_ (qv) started filming in late 2001, just three days after the release of _Harry Potter and the Sorcerer's Stone (2001)_ (qv) (Philosopher's Stone), Rupert was more accustomed to the filming methods and techniques on set and said filming the second film was] ...a lot more fun because we were a lot more comfortable with working, I guess - because of working with 'Kenneth Branagh' (qv), who's really funny, and more confident with the camera.", "[When asked what it was like to work with spiders, Rupert admitted] I hate them - even rubber ones I get scared of. Luckily some of them were CGI [computer graphics]. But that big car-sized one, that was actually there unfortunately. So that wasn't my favorite scene to film.", "[Loaded with sex, drugs and violence, the arty and stylish Cherrybomb was exactly the darker type of role which many fans had waited for, and when asked about the adult scenes, Rupert admitted] It's really hard. It's very hard to lose yourself in the moment and just kind of get absorbed by it because there's always going to be a big fat guy nearby holding a boom.", "The truth is that Ron is my hero. He's always there for his friends - sometimes belligerently, but there nevertheless. He's also the comic relief in stressful situations; the funny guy with a great one-liner. And no matter how scared he may be, he will put aside his fears to support and protect the people he loves. To me, that represents true courage.", "[2011] [Can you tell us a secret about the final Harry Potter?] Well, I wear a wig, even though I've always had long hair. I wear hairpieces to make my hair look wilder because we're kind of living rough. I had four pieces glued in and was constantly picking bits of glue out of my hair."], "salary history": ["_Harry Potter and the Sorcerer's Stone (2001)_ (qv)::$125,000", "_Harry Potter and the Chamber of Secrets (2002)_ (qv)::$125,000", "_Harry Potter and the Prisoner of Azkaban (2004)_ (qv)::$125,000", "_Harry Potter and the Order of the Phoenix (2007)_ (qv)::$4,000,000", "_Harry Potter and the Deathly Hallows: Part 1 (2010)_ (qv)::$15,000,000", "_Harry Potter and the Deathly Hallows: Part 2 (2011)_ (qv)::$15,000,000"], "birth date": "1988-08-24", "birth notes": "Stevenage, Hertfordshire, England, UK", "_actorID": "44", "_source": "IMDB", "actorID": "0342488", "created_utc_dt": "08/26/2019, 21:54:17"}