{"headshot": "https://m.media-amazon.com/images/M/MV5BMTc4OTI3Mzg2Nl5BMl5BanBnXkFtZTcwMDAxNTU3OA@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Chan"], "birth name": "Channing Matthew Tatum", "height": "6' 1\" (1.85 m)", "mini biography": ["'Channing Tatum' (qv) was born in a small town, Cullman, Alabama, 50 miles north of Birmingham. He is the son of Kay (Faust), an airline worker, and Glenn Matthew Tatum, who worked in construction. Growing up, he was full of energy and somewhat troublesome, so his parents decided to enroll him in different sports such as track and field, baseball, soccer, and football to keep him out of trouble. In the ninth grade he was sent to Catholic school. It was there that he discovered his passion for football and his hopes became centered on earning an athletic college scholarship. Channing's goal was finally met, and in his senior year in high school, he was recruited and earned a full athletic college scholarship to a school in West Virginia.Tatum is also skilled in Kung Fu and in Gor-Chor Kung Fu, a form of martial arts, in which he has earned belts. Channing later left college and, in the meantime, worked as a construction worker, a stripper, a mortgage broker and salesman. He has modeled for Abercrombie & Fitch, Nautica, Gap, Aeropostale, Emporio Armani, and has been featured in television commercials for American Eagle, Pepsi, and some very popular Mountain Dew commercials.Channing can be seen on the big screen as a featured actor in _Coach Carter (2005)_ (qv), in which he plays a high school basketball player. He was also in the very popular TV series _CSI: Miami (2002)_ (qv) where he played the role of Bob Davenport.::Nickole"], "spouse": ["'Jenna Dewan' (qv)::(11 July 2009 - present) ( filed for divorce) ( 1 child)"], "trade mark": ["Deep resonant voice", "Muscular physique", "Often works with Steven Soderbergh and Jonah Hill"], "trivia": ["Has modeled for Abercrombie & Fitch, Dolce & Gabbana and Aeropostale. In 2002, he starred in commercials for both Mountain Dew (\"Drive\") and Pepsi (\"Scratching\").", "His first fashion show was at Level Nightclub in South Beach, Miami (November 2000) for Men's Health magazine. His friend 'Vincent De Paul' (qv) asked him to do the show with him. After the fashion show, he began booking editorials for Ocean Drive magazine and his modeling career began.", "His family has lived in the American South for many generations, at least since the 1700s. He has English, some Irish and Scots-Irish (Northern Irish), and distant Scottish, German, Welsh, and French ancestry. Channing has sometimes been said to have some degree of Native American roots, although these claims appear to be unverified; all of Channing's grandparents, great-grandparents, and great-great-grandparents were listed as \"White\" on United States Censuses.", "Was sent to a military school in ninth grade, where he joined the football team and intended to get a scholarship to play after graduation.", "Big break was being cast in 'Ricky Martin' (qv)'s music video \"She Bangs\", where he was paid $400 for a 7-day shoot.", "Moved from Alabama to Mississippi at age 6, where his family lived on a bayou.", "Stills spends his summer time with his grandparents back in Alabama.", "Auditioned for the role of Gambit in _X-Men: The Last Stand (2006)_ (qv) before the role was eliminated, but will portray him in Gambit (????).", "Had worked as a construction worker, a mortgage broker, a salesman at the cologne counter of Dillard's, and a worker in a puppy/kitty nursery before started a modeling career.", "Became good friends with 'Adam Scarimbolo' (qv) and 'Shia LaBeouf' (qv) on the set of _A Guide to Recognizing Your Saints (2006)_ (qv).", "Received a full athletic football scholarship at Glenville State College in West Virginia, but he dropped out of college.", "When in ninth grade, he was given the option of either military school or a private school; he chose the military school.", "During his time in school, he played football, soccer, track and baseball.", "His first fashion show was at Level Nightclub in South Beach, Miami, for Men's Health magazine.", "Attended the 'Deena Levy' (qv) Theatre Studio.", "His favourite childhood film was the adventure comedy film _The Goonies (1985)_ (qv).", "When he was a child, his grandparents raised him during the summers.", "Made the transition from modeling to acting because he did not find modeling challenging enough for him.", "Signed with Innovative Artists, a talent agency, to improve his acting career.", "Has played two characters called \"Duke\": _She's the Man (2006)_ (qv) and _G.I. Joe: The Rise of Cobra (2009)_ (qv) and the sequel _G.I. Joe: Retaliation (2013)_ (qv).", "Has a dog named Meeka with his fiancée 'Jenna Dewan' (qv).", "(September 10, 2008) Engaged to 'Jenna Dewan' (qv), his co-star from the dance movie _Step Up (2006)_ (qv).", "Chosen by People magazine as the Sexiest Man Alive in 2012. He is the first person born in the 1980s to have been given the title (and thus could be considered the first millennial to have been given it).", "Became a father for the 1st time at age 33 when his (now estranged) wife 'Jenna Dewan' (qv) gave birth to their daughter Everly Elizabeth Maiselle Tatum on May 31, 2013.", "Ranked #17 in Glamour magazine's list of \"50 Sexiest Men\" in 2013.", "Already an accomplished dancer, Channing learned 1940s style tap dancing for the Coen Brothers' _Hail, Caesar! (2016)_ (qv), in which he plays an actor working in a 1950 musical/dance movie called \"Last Call\". In a barroom scene, with a dozen dancing sailors, his dance work required highly acrobatic tap combined with swing style. Doing his own work, one number included going from a standing position in front of the bar to a sustained handstand on the edge of the bar, culminating in somersaults to the end of the bar.", "Suffered from ADHD and dyslexia as a child.", "Has a female pit-bull mix Lulu.", "Born on the same date as 'Jordana Brewster' (qv)."], "quotes": ["(2009, on his career) I got crazy lucky. Like sometimes, I think I won the lottery or something. At times, it feels like the bottom's gonna fall out. Just 'cause I don't really know how I got here. But I just keep moving forward, and it just keeps getting better and better.", "[on _Haywire (2011)_ (qv)] My wife always hates when I go, \"I just don't love female action movies.\" I don't know why. I'll watch them, but I don't run to go and see them. I'd say, \"Find a girl that can, pardon my French, whup my ass, and I will go to the movie.\" And they did! They went and found [MMA champion 'Gina Carano' (qv)] and she did! And it was awesome. I truly loved it.", "Men go to strip clubs for a pretty simple reason. It's a carnal, visual thing. The point of male stripping is to bring women onstage and embarrass them so their friends can cheer them on. Women go to watch their friends' faces turn red and to have a night of camaraderie with their girlfriends.", "The more you try to look sexy, the lamer it is, so you just have to commit to the comedy.", "[on being told that People magazine voted him the 2012 Sexiest Man Alive] Y'all are messin' with me.", "My mother taught me how to love. My mom is the most loving person I know.", "I don't remember who said it, but I do believe that whatever age you become famous, you end up staying that age. Because from that point you're not asked to be a normal citizen. I worry about [Justin] Bieber, man. That kid's wildly talented. I hope he doesn't fall down into the usual ways of famous young kids because it's so hard for someone to be responsible when they're not asked to be.", "[on performing with 'Mark Ruffalo' (qv) in _Foxcatcher (2014)_ (qv)]. Mark and I went through the grinder together. It was pretty easy to bond when you are bleeding together.", "It's really hard for men to tell other men \"I love you\" without putting a 'man' at the end of it. Like \"I love you... man.\" You just can't look at another man and say \"I love you.\".", "[on signing on to perform in _Foxcatcher (2014)_ (qv)] I read it and honestly, I didn't know why Bennett [Miller] wanted to make this movie. I don't think I had the tools to understand the nuance of the script or the characters or really anything, and - thankfully - Bennett and I found each other on the Sony lot seven years after and I think we had both done a lot of growing. Especially me."], "birth date": "1980-04-26", "birth notes": "Cullman, Alabama, USA", "_actorID": "75", "_source": "IMDB", "actorID": "1475594", "created_utc_dt": "08/26/2019, 21:54:37"}