{"headshot": "https://m.media-amazon.com/images/M/MV5BOGY2MjI5MDQtOThmMC00ZGIwLWFmYjgtYWU4MzcxOGEwMGVkXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_UY98_CR53,0,67,98_AL_.jpg", "birth name": "Mark Richard Hamill", "height": "5' 9\" (1.75 m)", "mini biography": ["'Mark Hamill' (qv) is best known for his portrayal of Luke Skywalker in the original Star Wars trilogy - _Star Wars: Episode IV - A New Hope (1977)_ (qv), _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), and _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv) - a role he reprised in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv) and _Star Wars: The Last Jedi (2017)_ (qv). He also starred and co-starred in the films _Corvette Summer (1978)_ (qv), _The Big Red One (1980)_ (qv), and _Kingsman: The Secret Service (2014)_ (qv). Hamill's extensive voice acting work includes a long-standing role as the Joker, commencing with _Batman: The Animated Series (1992)_ (qv).Hamill was born in Oakland, California, to Virginia Suzanne (Johnson) and William Thomas Hamill, a captain in the United States Navy. He majored in drama at Los Angeles City College and made his acting debut on _The Bill Cosby Show (1969)_ (qv). He then played a recurring role (Kent Murray) on the soap opera _General Hospital (1963)_ (qv) and co-starred on the comedy series _The Texas Wheelers (1974)_ (qv).Released on May 25, 1977, _Star Wars: Episode IV - A New Hope (1977)_ (qv) was an enormous unexpected success and made a huge impact on the film industry. Hamill also appeared in _The Star Wars Holiday Special (1978)_ (qv) and later starred in the successful sequels _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), and _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv). For both of the sequels, Hamill was honored with the Saturn Award for Best Actor given by the Academy of Science Fiction, Fantasy and Horror Films. He reprised the role of Luke Skywalker for the radio dramatizations of both \"Star Wars\" (1981) and \"The Empire Strikes Back\" (1983), and then in a starring role in _Star Wars: The Last Jedi (2017)_ (qv). For the radio dramatization of \"Return of the Jedi\" (1996), the role was played by a different actor.He voiced the new Chucky in _Child's Play (2019)_ (qv), taking over from 'Brad Dourif' (qv).::Pedro Borges"], "spouse": ["'Marilou York' (qv)::(17 December 1978 - present) ( 3 children)"], "trade mark": ["The voice of the Joker on Batman: The Animated Series", "Luke Skywalker in the Star Wars films", "Ability to change his voice, and be unrecognizable in a variety of animated roles", "Geeky/Nerdy personality to his fans."], "trivia": ["Father of 'Nathan Hamill' (qv) (born 25 June 1979), 'Griffin Hamill' (qv) (born 4 March 1983) and 'Chelsea Hamill' (qv) (born 27 July 1988). Nathan was born in the United Kingdom while dad Mark was on location there shooting _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv).", "In an ironic counterpoint to his problem of being typecast as a upright hero like Luke Skywalker in live-action roles, he has found that his successful career as an animation voice actor has typecast him as a player of flamboyant villains like The Joker on _Batman: The Animated Series (1992)_ (qv).", "Attended Nile C. Kinnick High School (known as Yo-Hi) in Yokohama, Japan, where as a senior he played Henry Aldrich in the high school production of Clifford Goldsmith's \"What a Life\". School is now on the Yokosuka Naval Base in Japan, where it is known by its original name, Kinnick High. Original site of the high school where Hamill acted is now a MyCal department store.", "Hamill met his wife, Mary Lou York, when she was his dental hygienist.", "He did all his own stunts in _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv) -- except two places: where Luke Skywalker jumps off the plank into the Sarlaac, turns, and flips back onto the plank and on the Death Star when Darth Vader throws his lightsaber at the supports of the catwalk. According to \"The Making of Return of the Jedi\" by John Philip Peecher (c. 1983), his stunt double, 'Colin Skeaping' (qv), performed both of these stunts.", "He accidentally hit 'Peter Stormare' (qv) during a fight scene in _Commander Hamilton (1998)_ (qv).", "He did most of his own stunts in _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv), except in the scene in Cloud City where he is sucked out of a window.", "He was originally cast as David Bradford on _Eight Is Enough (1977)_ (qv), and asked to be released from his contract before _Star Wars: Episode IV - A New Hope (1977)_ (qv) came out because he sensed the movie would be successful, and Hamill wanted to focus on his movie career. ABC refused to release him from his contract, thinking that having a successful movie star connected with the show would help \"Eight Is Enough\" (1977). Hamill was then in a car crash in December 1976 and injured his face. This made him unavailable for shooting the television series, and ABC was forced to recast the role of David, which then went to 'Grant Goodeve' (qv).", "Is the fourth of seven children of William Thomas and Virginia Suzanne Hamill.", "Auditioned for the comedy-drama _American Graffiti (1973)_ (qv).", "Has appeared in _Jay and Silent Bob Strike Back (2001)_ (qv), which also starred 'Carrie Fisher' (qv). It was the first time the two had starred together since _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv). Neither of them knew that the other was involved in the project until shortly after filming had been completed.", "Claims his inspiration for the vocal interpretation as The Joker on _Batman: The Animated Series (1992)_ (qv) came from a mixture of Hannibal Lecter and 'Jerry Lewis' (qv).", "Attended Annandale High School in Annandale, Virginia before his father was transfered.", "He kept his Luke Skywalker boots, from the first \"Star Wars\" movie. When the movie was re-released to theaters in the late 1990s, his son asked if he could wear the boots to a showing. Hamill said no, telling him he didn't think the boy would \"get out alive\" if fans knew his boots were the originals.", "Though in the original Star Wars trilogy he shoots a pistol and swings a lightsaber right-handed, he eats and writes left-handed. He can be seen eating left-handed in _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv) when in Yoda's home, throwing the skull left-handed to defeat the Rancor in _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv), and when writing left-handed on a guest appearance on the sitcom _3rd Rock from the Sun (1996)_ (qv).", "Director 'Stephen Weeks' (qv) originally wanted him for the role of Sir Gawain in _Sword of the Valiant: The Legend of Sir Gawain and the Green Knight (1984)_ (qv) but the producers refused and insisted on 'Miles O'Keeffe' (qv).", "Mark and his \"Star Wars\" co-star 'Harrison Ford' (qv) were both considered for the role of the bumbling wizard Schmendrick in the animated adaptation of _The Last Unicorn (1982)_ (qv).", "Has played the infamous Flash villain, The Trickster aka James Jesse (a word play for old west bandit Jesse James, a popular stunt for \"Flash\" creator 'Gardner Fox' (qv) and other series writers), in both the short lived live-action CBS series _The Flash (1990)_ (qv), in 1991 (two episodes), and in the animated _Justice League (2001)_ (qv) series in 2005, in the episode \"Flash and Substance\".", "Worked for free on the comedy-drama _Britannia Hospital (1982)_ (qv).", "He campaigned for 'George McGovern' (qv) during the 1972 presidential race.", "For the New Jedi Order novelization, he reprised his role as Luke Skywalker playing his own voice in a commercial.", "He and 'Robert Englund' (qv) are friends, the actor best known for playing Freddy Krueger in the Nightmare on Elm Street films. Englund, himself, auditioned for the role of Luke Skywalker and, when he did not get the role, he encouraged Mark to go and audition after him.", "Got along quite well with his _Star Wars: Episode VI - Return of the Jedi (1983)_ (qv) castmate 'Ian McDiarmid' (qv), as they both had a taste for British comedy.", "Has actually played two roles in the original Star Wars trilogy. That's Mark's voice on the PA system announcing that \"The first transport is away\" in _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv).", "Trained with swordmaster 'Bob Anderson' (qv) for his role as Luke Skywalker; Anderson also trained 'David Prowse' (qv) (Darth Vader).", "Mark's maternal grandfather was of Swedish descent. Mark's other ancestry includes English, Irish, Scottish and Welsh.", "Attended Hale Junior High School in the Clairemont Community of San Diego, California.", "Has played the same character (the Joker) on eight different series: _Batman: The Animated Series (1992)_ (qv), _Superman: The Animated Series (1996)_ (qv), _The New Batman Adventures (1997)_ (qv), _Static Shock (2000)_ (qv), _Justice League (2001)_ (qv), _Birds of Prey (2002)_ (qv), _Robot Chicken (2005)_ (qv) and _Justice League Action (2016)_ (qv).", "Is one of three actors, along with 'Anthony Daniels' (qv) and 'Billy Dee Williams' (qv), to reprise their same roles from the original Star Wars trilogy in the NPR radio dramatizations of the trilogy.", "In addition to playing Luke Skywalker in the original Star Wars trilogy, he played the role in the NPR radio dramatizations of \"Star Wars\" (1981) and \"The Empire Strikes Back\" (1983). However, he was not available to reprise the role for \"Return of the Jedi\" (1996).", "Has played the DC Comics supervillain, The Trickster, in both live-action (_The Flash (1990)_ (qv)) and animated form (_Justice League (2001)_ (qv)).", "Has played the same character (Luke Skywalker) on three different series: _The Muppet Show (1976)_ (qv), _Family Guy (1999)_ (qv) and _Robot Chicken (2005)_ (qv).", "Has played the DC Comics supervillain, The Joker, longer and in more adaptations than any other actor.", "A lifelong Democrat.", "He, 'Joe Mantegna' (qv), and 'Elizabeth Taylor' (qv) are the only actors to play both themselves and a fictional character on _The Simpsons (1989)_ (qv). Coincidentally, Hamill and Mantegna both appear in _The Simpsons: Mayored to the Mob (1998)_ (qv).", "Has played the DC Comics supervillain, The Trickster, in both live-action (_The Flash (1990)_ (qv), _The Flash (2014)_ (qv)) and animated form (_Justice League (2001)_ (qv)).", "'George Lucas' (qv) had asked Hamill if he would be interested in playing an Obi-Wan type Jedi Master in Star Wars Episodes VII, VIII and IX where he would pass on the excalibur to the next young hope and that it would be out around 2011. Disney will now make these films for 2015, 2017 and 2019.", "In _The Flash: Tricksters (2015)_ (qv), he delivers (in a raspy creepy voice) the famous line Darth Vader spoke to Luke Skywalker, \"I am your father\".", "His daughter Chelsea is a huge fan of _Criminal Minds (2005)_ (qv). When he was offered the role of John Curtis in _Criminal Minds: The Replicator (2013)_ (qv), she was thrilled to learn that, since his role had been hinted at all through season 8, he would be playing the Replicator.", "Is a huge fan of _Brooklyn Nine-Nine (2013)_ (qv) and the British rock group 'The Kinks' (qv).", "Attended the LACC Theater Academy. Other alumni include 'Clint Eastwood' (qv), 'Morgan Freeman' (qv), 'Cindy Williams' (qv), 'Donna Reed' (qv) and 'Rene Michelle Aranda' (qv).", "Does not like having a beard, but agreed to have one for the Star Wars sequel trilogy.", "Replaced 'Tim Curry' (qv), as the voice of the Joker in _Batman: The Animated Series (1992)_ (qv).", "Even though Luke Skywalker was his most successful role in his entire acting career, (other then the movies, The Star Wars Holiday Special and the first 2 N.P.R. Radio adaptions of episodes 4 and 5) he never reprized his role since, not in any of the cartoon shows, the video games (All formats) not in anything.", "As an honor to him, the Castleton Drive in Clairmont, San Diego, was renamed into 'Mark Hamill' (qv) Drive. The Castleton Drive was an important part of his life, as he lived several years of his childhood there after moving with his family to San Diego. He attended the ceremony on July 30, 2017.", "After the release of _Star Wars: Episode VII - The Force Awakens (2015)_ (qv), demands for autographs signed by him skyrocketed, especially via eBay. Through Twitter, Hamill got requests by fans to verify the authenticity of autographs they were about to buy. He kindly responded to any request.", "A great deal of the voice-overs for Luke Skywalker in \"Star Wars\" were done by another actor. Hamill remarks he was never contacted with requests for the spin-off video games, books-on-tapes and such as they probably thought he would never want to do that character after it completely pigeonholed his career.", "He was an early fan of 'David Letterman' (qv), having occasionally appeared on Late Show with 'David Letterman' (qv) _(1993)_ (qv), as well as taping every episode and keeping a journal documenting the show. After encountering writer 'Chris Elliott' (qv), Hamill was asked for assistance in helping determine the 1,000th Viewer Mail that Letterman had answered. His practice continued to Letterman's new show on CBS, but eventually stopped.", "He auditioned to play 'Wolfgang Amadeus Mozart' (qv) in _Amadeus (1984)_ (qv), having played the role on Broadway. The role went to 'Tom Hulce' (qv).", "Is the co-writer of The Black Pearl, a comic book miniseries published by Dark Horse Comics. He wrote an introduction to the Trade Paperback Batman: Riddler Two-Face which reprints various stories involving the Riddler and Two-Face to tie in with Batman Forever. He has also written several stories for Simpsons Comics, including \"Catastrophe in Substitute Springfields!\", which parodies DC's Crisis on Infinite Earths and also references several other classic comics.", "He became a supporter of English football club Wolverhampton Wanderers F.C. (2017).", "He was considered for a role on _Battlestar Galactica (1978)_ (qv) (possibly either Captain Apollo or Lieutenant Starbuck).", "Is a lifelong fan of Laurel and Hardy. In June 2016, he called into The Ross Owen Show on Black Sky Radio to talk for over an hour about his passion for Stan and Ollie.", "He was almost tricked into appearing in the documentary The People vs. 'George Lucas' (qv) (2010), but he quickly realized, even before the title was finalized, that it had an anti-Lucas vibe to it, and refused to take any part in it.", "Tweeted he has never met 'Natalie Portman' (qv) and revealed that the 'Annie Leibovitz' (qv) photoshoot for Vanity Fair magazine which featured the stars of both Star Wars trilogies was actually shot individually.", "He was awarded a Star on the Hollywood Walk of Fame at 6834 Hollywood Boulevard in Hollywood, California on March 8, 2018.", "He was offered a zombie cameo in the horror comedy _Zombieland (2009)_ (qv).", "Good friends with fellow voice actor 'Charlie Adler' (qv).", "As of 2018, has appeared in one Best Picture Academy Award nominee: _Star Wars: Episode IV - A New Hope (1977)_ (qv)."], "quotes": ["I have a sneaking suspicion that if there were a way to make movies without actors, George (Lucas) would do it.", "Acting in \"Star Wars\", I felt like a raisin in a giant fruit salad, and I didn't even know who the cantaloupes were.", "\"I had the accident way before Star Wars came out, but what really happened has been terribly distorted. I broke my nose, that's it! But I've read accounts about how my face has been reconstructed with plastic surgery and how I was pulling myself along the highway with one arm looking for help. I even heard that I drove off a cliff! That's the best one of all.\" - 'Mark Hamill' (qv) on his auto accident.", "The idea of The Force is basically \"Religion's Greatest Hits\".", "You know how there are some stars out there who know how to market themselves? I don't have that.", "You know where [the pride] comes from? It's not so much from the industry ... but the 9-year-old kid who looks at you like a cross between Superman and Santa Claus. And you'd have to be a really, really hardened cynic not to be moved by that. Not only that, but just doing the interviews for this animation series, I can't tell you how many people have said, 'I got into the business because of that movie.' ... I totally understand that because I remember walking out of _Jason and the Argonauts (1963)_ (qv) and saying, 'I don't know how they got those skeletons to fight, but someday I want that to be my job. To make skeletons fight.'", "I never saw myself so much as an actor. I wanted to be a cartoonist like 'Charles M. Schulz' (qv) and create my own world and be able to have a studio at home and not commute and be able to be with my family. I just didn't have the skills to pull that off and so I've gravitated toward theater because I like all of it.", "I think theater has given me the opportunity to show what a character actor I can be.", "I've learned that the movies [Star Wars] will never finally end. It just goes on and on and on and on. I mean, it's going to be in 3D, then it's going to be smellivision, then it's going to be a ride in an amusement park, then they'll come to your house and perform it with puppets on your lawn ... it'll never end! I accepted that a long time ago.", "I can't tell you how much we laughed on the set to have 'Alec Guinness' (qv) in a scene with a big, furry dog that's flying a space ship.", "I love comic books.", "I'm waiting for my body to catch up with my age.", "I've been married to a dental hygienist for years and if you think I haven't heard \"Use the Floss\" you'd be mistaken.", "[When asked by 'Kevin Smith' (qv) on _Dinner for Five (2001)_ (qv) if he's tired of talking about Star Wars] To be honest with you, sure. I'm human. I mean, I like ice cream, but I don't eat it three times a day. And I've forgotten a lot of it. If I was still working on it, it might be different, but I've put it in perspective. I want to be supportive without being critical, but it's not mine anymore.", "[Talking about Star Wars co-stars 'Harrison Ford' (qv) and 'Carrie Fisher' (qv)]: Actually, Harrison and I never fought in either picture. It was Carrie and I who had the screaming matches from time to time, though afterward neither of us could remember what they were about.", "If you don't vote for 'Barack Obama' (qv), you're insane. 'Cause without him, I think the middle class will completely disappear. (Mid-July 2012 at Comic-Con)", "[on completing filming on Skellig Michael, a remote island off the coast of Ireland's County Kerry, for a scene in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv)] Ireland you are wonderful! Love the country, love the people!", "[on The Joker in _The Dark Knight (2008)_ (qv)] When I saw _The Dark Knight (2008)_ (qv) I just was amazed at what an original take that it was. I mean, he was joyless and was all but a heroin addict. It was tremendous. I mean, what an accomplishment! I've never seen such a Tom-centric performance since Hannibal Lecter where he creeped you out with that slithery tongue. I thought it was so original. Whether it was the screenwriter or 'Heath Ledger' (qv) or 'Christopher Nolan' (qv) or all three combined. It's like an alternate reality and that's as valid a Joker as anything that has ever been done. Mine is sort of old school comic book and that's fine but I just have to take my hat off to all of them. I thought they were fantastic.", "[on Luke Skywalker turning evil] As an actor that would be more fun to play. I just thought that's the way it was going from when we finished. I figured that's what will be the pivotal moment. I'll have to come back, but it will be I have Han Solo in my crosshairs and I'll be about to kill him or about to kill the Princess or about to kill somebody that we care about. It's an old cornball movie, like World War II movies.", "[on being cast as The Joker in _Batman: The Animated Series (1992)_ (qv)] But to make a long story short, after doing that one episode, they called a few months later and said, \"Would you be interested in auditioning for The Joker.\" And I thought, \"Of course. I'll do that. I'll never get it, because my association with Luke Skywalker is going to preclude me from being considered.\" I remember the controversy when they cast Michael Keaton as Batman, just because he was a more comedic actor. So anyway, without having any fear that I was getting it, I went in and just let it rip. And I had been on the road and on Broadway doing Amadeus so long that I had an arsenal of giggles and laughs that I used for Mozart. That was one of the requirements of that role: It startled Salieri in the Viennese court that this man that was capable of writing this celestial music had a donkey bray of a laugh that was just so unsettling. It just didn't fit with who they thought he was. And I had to play around with that laugh a lot. When you do eight a week, just to keep it interesting I had a huge palette of different kinds of laughs. And the only reason I say all this is because later I said, \"What got me the part, by the way?\" And they said, \"Oh, it was your laugh. It was your maniacal laugh that really sealed the deal.\"", "(On the death of 'Carrie Fisher' (qv)) It's never easy to lose such a vital, irreplaceable member of the family, but this is downright heartbreaking. Carrie was a one-of-a-kind who belonged to us all-whether she liked it or not. She was OUR Princess, damn it, and the actress who played her blurred into one gorgeous, fiercely independent and ferociously funny take-charge woman took our collective breath away. Determined and tough, but with a vulnerability that made you root for her and want her to succeed and be happy. She played such a crucial role in my professional and personal life, and both would have been far emptier without her. I am grateful for the laughter, the wisdom, the kindness and even the bratty self-indulgent crap my beloved space-twin gave me through the years. Thanks, Carrie. I love you.", "(his eulogy for 'Carrie Fisher' (qv)) We occupied a unique area in each other's lives. It was like we were in a garage band together that somehow hit it huge. We had no idea the impact Star Wars would have on the world. I remember we were out on tour right before the movie opened. By the time, we got to Chicago, there was a crowd at the airport. I said, hey look, you guys, there must be somebody famous on the plane. I was looking around to see who it might be. And then in the crowd I saw a kid dressed in a Han Solo vest. Then I saw girl dressed like Princess Leia. I said, oh my God, look, Carrie, there's somebody dressed just like you. She's got the buns on her head! The first time I met Carrie was at dinner in London before we started filming together. I had been the first one to go over to Africa with Sir 'Alec Guinness' (qv) and the robots, to film all the desert planet stuff, then I came back to London and then 'Harrison Ford' (qv) came over. Carrie was the last piece in the puzzle to come to London. So, I said to the production office, I'd like to meet her before we work together. They worked out that we'd meet for dinner. You know, she was 19 years old at the time. I was a worldly 24 years old. So, I was thinking, oh my God what it'll be like working with a high school kid. But I was just bowled over. I mean she was just so instantly ingratiating and funny and outspoken. She had a way of just being so brutally candid. I had just met her but it was like talking to a person you'd known for ten years. She was telling me stuff about her stepfather, about her mom, about 'Eddie Fisher' (qv), it was just harrowing in its detail. I kept thinking, Should I know this? I mean, I wouldn't have shared that with somebody that I had trusted for years and years and years. But she was the opposite. She just sucked you into her world. I was so middle class. Growing up, the closest thing to a celebrity we had was our next-door neighbor, who was a baggage handler who returned 'Jerry Lewis' (qv)' wallet that fell on the tarmac in San Diego. But she was something completely different. She dropped out of high school to be in the chorus of Irene on Broadway. I was just in awe of her. She was so committed to joy and fun and embracing life. She had an Auntie Mame quality to her. I would do crazy things to amuse her on the set. Making her laugh was always a badge of honor. I remember during Empire we were split up story wise; it was a difficult film to shoot and there was a lot of tension on the set. I was off in the swampland with the puppets and robots, but at least Carrie and Harrison got to work with human beings. Once at lunchtime she said, you should try on my jumpsuit. I said, The one-piece white jumpsuit? You're what, five foot two inches? I'll never get in! She said, just try it. I put on that Princess Leia zipper jump suit and it was so tight I looked like a Vegas lounge singer. If that wasn't ridiculous enough, she had me put on one of those bald cap masks with the Bozo hair and glasses and nose and then she walked me around the back lot. The lengths I would go to hear her laugh, there were no limits. I loved her and loved making her laugh. She would do these crazy things and make me do these crazy things, but I really don't think they were crazy after all. In a way, it was a defense mechanism for her. She was so off the wall, she could use it as protection. Part of what was so poignant about her was that she was vulnerable, that there was this glimmer of a little girl that was so appealing and it roused the protective nature in my personality. I'm grateful that we stayed friends and got to have this second act with the new movies. I think it was reassuring to her that I was there, the same person, that she could trust me, as critical as we could sometimes be with each other. We ran the gamut over the years, where we were in love with each other, where we hated each other's guts. I'm not speaking to you, you're such a judgmental, royal brat! We went through it all. It's like we were a family. When you were in her good graces, you couldn't have more fun with any person on the planet. She was able to make you feel like you were the most important thing in her life. I think that's a really rare quality. And then you could go 180 degrees opposite, where you were furious with one another and wouldn't speak for weeks and weeks. But that's all part of what makes a relationship complete. It's not all one sided. Like I say, she was a handful. She was high maintenance. But my life would have been so much drabber and less interesting if she hadn't been the friend that she was.", "[on 'Billie Lourd' (qv)] So much like her mother in so many ways- it was almost as if we were cuddling our Princess again!", "'Ginny McSwain' (qv) is quite simply a master of her. Her empathy with actors, her easy going humor and her complete understanding of subtle shading and nuance brings out the best in every performer. You couldn't be in more able hands.", "(Concerning Luke Skywalker's self-imposed isolation in _Star Wars: The Last Jedi (2017)_ (qv)) Even if I was traumatised by something, I might take a year of meditation, but he would double down and come back harder. Jedis don't give up! But it's not my story any more and I just have to accept that. And I then bonded very deeply with Rian, but I had to let him know how I felt."], "salary history": ["_Star Wars (1977)_ (qv)::$650,000"], "birth date": "1951-09-25", "birth notes": "Oakland, California, USA", "_actorID": "82", "_source": "IMDB", "actorID": "0000434", "created_utc_dt": "08/26/2019, 21:54:42"}