{"headshot": "https://m.media-amazon.com/images/M/MV5BMjA1MjE2MTQ2MV5BMl5BanBnXkFtZTcwMjE5MDY0Nw@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "William Bradley Pitt", "height": "5' 11\" (1.8 m)", "mini biography": ["An actor and producer known as much for his versatility as he is for his handsome face, Golden Globe-winner 'Brad Pitt' (qv)'s most widely recognized role may be Tyler Durden in _Fight Club (1999)_ (qv). However, his portrayals of Billy Beane in _Moneyball (2011)_ (qv), and Rusty Ryan in the remake of _Ocean's Eleven (2001)_ (qv) and its sequels, also loom large in his filmography.Pitt was born William Bradley Pitt on December 18th, 1963, in Shawnee, Oklahoma, and was raised in Springfield, Missouri. He is the son of Jane Etta (Hillhouse), a school counselor, and William Alvin Pitt, a truck company manager. He has a younger brother, Douglas (Doug) Pitt, and a younger sister, Julie Neal Pitt. At Kickapoo High School, Pitt was involved in sports, debating, student government and school musicals. Pitt attended the University of Missouri, where he majored in journalism with a focus on advertising. He occasionally acted in fraternity shows. He left college two credits short of graduating to move to California. Before he became successful at acting, Pitt supported himself by driving strippers in limos, moving refrigerators and dressing as a giant chicken while working for \"el Pollo Loco\".Pitt's earliest credited roles were in television, starting on the daytime soap opera _Another World (1964)_ (qv) before appearing in the recurring role of Randy on the legendary prime time soap opera _Dallas (1978)_ (qv). Following a string of guest appearances on various television series through the 1980s, Pitt gained widespread attention with a small part in _Thelma & Louise (1991)_ (qv), in which he played a sexy criminal who romanced and conned 'Geena Davis' (qv). This lead to starring roles in badly received films such as _Johnny Suede (1991)_ (qv) and _Cool World (1992)_ (qv).But Pitt's career hit an upswing with his casting in _A River Runs Through It (1992)_ (qv), which cemented his status as an multi-layered actor as opposed to just a pretty face. Pitt's subsequent projects were as quirky and varied in tone as his performances, ranging from his unforgettably comic cameo as stoner roommate Floyd in _True Romance (1993)_ (qv) to romantic roles in such visually lavish films as _Interview with the Vampire: The Vampire Chronicles (1994)_ (qv) and _Legends of the Fall (1994)_ (qv), to an emotionally tortured detective in the horror-thriller _Se7en (1995)_ (qv). His portrayal of frenetic oddball Jeffrey Goines in _Twelve Monkeys (1995)_ (qv) won him a Globe for Best Performance by an Actor in a Supporting Role.Pitt's portrayal of Achilles in the big-budget period drama _Troy (2004)_ (qv) helped establish his appeal as action star and was closely followed by a co-starring role in the stylish spy-versus-spy flick _Mr. & Mrs. Smith (2005)_ (qv). It was on the set of Mr. & Mrs. Smith that Pitt, who married 'Jennifer Aniston' (qv) in a highly publicized ceremony in 2000, met his current partner 'Angelina Jolie' (qv). Pitt left Aniston for Jolie in 2005, a break-up that continues to fuel tabloid stories years after its occurrence.He continues to wildly vary his film choices, appearing in everything from high-concept popcorn flicks such as _Megamind (2010)_ (qv) to adventurous critic-bait like _Inglourious Basterds (2009)_ (qv) and _The Tree of Life (2011)_ (qv). He has received two Best Actor Oscar nominations, for _The Curious Case of Benjamin Button (2008)_ (qv) and _Moneyball (2011)_ (qv). In 2014, he starred in the war film _Fury (2014)_ (qv), opposite 'Shia LaBeouf' (qv), 'Logan Lerman' (qv), 'Jon Bernthal' (qv), and 'Michael Peña' (qv).Pitt and Jolie have six children, including two sons and a daughter who were adopted.::Anonymous and JJH"], "spouse": ["'Angelina Jolie' (qv)::(14 August 2014 - present) ( filed for divorce) ( 6 children)", "'Jennifer Aniston' (qv)::(29 July 2000 - 2 October 2005) ( divorced)"], "trade mark": ["Chiseled good looks", "Strong jawline and bold blue eyes", "Frequently works with 'David Fincher' (qv)"], "trivia": ["Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#23) (1995).", "Turned down a role as an astronaut in _Apollo 13 (1995)_ (qv) to accept his role in _Se7en (1995)_ (qv).", "Posed for a campus calendar in college.", "A girl went to Pitt's Hollywood-area home shortly after midnight January 7, 1999 and crawled in through an open window, dressed herself in his clothes and stayed for 10 hours before the alarm went off. Athena Rolando, 19, was ordered not to contact the actor and to stay 100 yards away from him for three years (1999).", "Ranked #32 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Banned from entering China because of his role in _Seven Years in Tibet (1997)_ (qv) (1997).", "Chosen by People (USA) magazine as one of the 50 Most Beautiful People in the World (1997).", "(December 20, 1996) Engaged to actress 'Gwyneth Paltrow' (qv).", "Donated $100,000 to the Discovery Center - a children's learning museum in his hometown of Springfield, Missouri. [June 1996]", "Chosen by People (USA) magazine as one of the 50 Most Beautiful People in the World (1996).", "His first starring role in a feature film was in _The Dark Side of the Sun (1988)_ (qv), shot in pre-war Yugoslavia during the summer of 1988. As editing neared completion, civil war broke out in the region and much of the footage was lost. In 1996, after a five-year search, all of the lost footage was found and returned to producer 'Andjelo Arandjelovic' (qv), who is working on getting a distribution deal. Pitt was paid $1,523 per week for seven weeks. He played a young American taken by his family to the Adriatic Sea to search for a cure for a rare skin disease.", "Purchased a mansion in Southern California from the actress who portrays Elvira, Mistress of the Dark ('Cassandra Peterson' (qv)). He reportedly paid $1.7 million for the house. This mansion is filled with antiques and has a \"vampirish\" look to it (1996).", "Resided in Southern California with friend 'Buck Simmonds' (qv), who starred with him in _A River Runs Through It (1992)_ (qv). [May 1992]", "He was the third choice for the role of J.D. in _Thelma & Louise (1991)_ (qv). 'William Baldwin' (qv), the first choice, left to star in _Backdraft (1991)_ (qv).", "Had to learn to fly-cast for his role in _A River Runs Through It (1992)_ (qv). He practiced on top of buildings in Hollywood. During these practices, he frequently hooked himself in the back of his head.", "Voted \"Best Actor\" by viewers of MTV's _The Big Picture (1988)_ (qv) (1995).", "Was a journalism major in college with an advertising focus.", "Listed as one of twelve \"Promising New Actors of 1991\" in John Willis' Screen World, Vol. 43 (1991).", "Attended and graduated from Kickapoo High School in Springfield, Missouri (1982).", "Dropped out of the University of Missouri School of Journalism (Columbia, Missouri).", "In high school, he was a member of the golf, swim and tennis teams.", "Belonged to the Key Club and the Forensics Club in High School.", "Listed in People Weekly magazine's \"Most Intriguing People\" list (December 25, 1995/January 1, 1996 issue).", "Has a brother, Doug Pitt, (born 1966) and a sister, 'Julie Pitt' (qv) (born 1969).", "He was considered for the lead role in _The Matrix (1999)_ (qv), which went to 'Keanu Reeves' (qv).", "Has his teeth capped.", "(July 18, 2001) Sued Damiani International, the company which created the wedding ring he gave 'Jennifer Aniston' (qv). According to Pitt, the ring was his design and was to be exclusive. The company has since been selling replicas and indicating Pitt/Aniston's endorsement of the ring.", "He and ex-wife 'Jennifer Aniston' (qv) spent $1 million on their wedding (2000).", "For the last couple of years, he has been the spokesman for Edwin Jeans commercials in Japan. In 2001, he was also the face of the ads for a current Japanese canned coffee which is named Roots. Was replaced in these television commercials (2002) by 'Kevin Costner' (qv).", "Studied acting with the late 'Roy London' (qv).", "Did a television commercial for Toyota (Altis model) that aired only in Asia. The car became very popular and its sales resulted in Toyota getting an almost 32% share of the passenger car market.", "Has a home at Lake Mohawk in Sparta, New Jersey.", "Auditioned for the role of J.D. in the black comedy _Heathers (1988)_ (qv) and, though he showed talent, casting directors thought him to be \"too sweet\" for the role, which later went to 'Christian Slater' (qv). He would later go on to a very similar role in the horror film _Cutting Class (1989)_ (qv).", "Is a member of the Sigma Chi Fraternity. The Xi Xi chapter at the University of Missouri, Columbia.", "After watching _Lock, Stock and Two Smoking Barrels (1998)_ (qv), Pitt asked director 'Guy Ritchie' (qv) if he could be in his next film. He could not master the English accent, so Ritchie gave him the role of Mickey the One Punch Pikey, an Irish fighter, in _Snatch (2000)_ (qv).", "With 'Brad Grey' (qv)'s departure for Paramount Pictures and after the divorce settlement with ex-wife 'Jennifer Aniston' (qv), he now solely owns Plan B Entertainment.", "Tore his Achilles tendon during the production of _Troy (2004)_ (qv), in which he plays, coincidentally, Achilles. His injury caused the production of _Ocean's Twelve (2004)_ (qv) to be pushed back to April 2004 (2003).", "Is the first man ever to be named \"Sexiest Man Alive\" twice by People magazine (1994 and 2000).", "He and ex-wife 'Jennifer Aniston' (qv) campaigned in the United States to save _EastEnders (1985)_ (qv) from being axed there (2003).", "Showed his parents the \"Chemical Burn\" scene to convince them not to watch _Fight Club (1999)_ (qv).", "Got into better shape and eventually gained over 20 pounds of muscle for _Troy (2004)_ (qv).", "Has appeared in three movies with the number seven in the title (_Se7en (1995)_ (qv), _Seven Years in Tibet (1997)_ (qv) and _Sinbad: Legend of the Seven Seas (2003)_ (qv)). Has also appeared in three movies with the number twelve in the title (_Twelve Monkeys (1995)_ (qv), _Ocean's Twelve (2004)_ (qv) and _12 Years a Slave (2013)_ (qv)).", "He was ranked #6 on VH1's \"100 Hottest Hotties\".", "His high school nickname was Brad the \"Pitt-bull\".", "He took Greek language lessons in secret to surprise his then-wife 'Jennifer Aniston' (qv) who is of Greek ancestry.", "Voted #1 in Company magazine's annual \"100 Sexiest Men\" poll (2004).", "His favorite movies are _Planet of the Apes (1968)_ (qv), _Saturday Night Fever (1977)_ (qv) and the Bosnian war film _Remake (2003)_ (qv).", "Announced on January 7, 2005 that he and 'Jennifer Aniston' (qv) are separating after 4 1/2 years of marriage.", "Was listed as a potential nominee on the 2005 Razzie Award nominating ballot. He was listed as a suggestion in the Worst Actor category for his performance in the film _Troy (2004)_ (qv). However, he did not receive a nomination.", "'Dianne Wiest' (qv) is his favorite actress.", "Premiere magazine ranked him as #50 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature (2005).", "A short while after completing _A River Runs Through It (1992)_ (qv), he fled to Amsterdam where he briefly resided for three months by himself in a small basement apartment before returning to the United States to film _Kalifornia (1993)_ (qv).", "He and his ex-wife 'Jennifer Aniston' (qv) met on a blind date, which was arranged by their agent.", "He and his _Ocean's Eleven (2001)_ (qv) / _Ocean's Twelve (2004)_ (qv) co-stars, 'Julia Roberts' (qv), 'George Clooney' (qv) and 'Elliott Gould' (qv), all have guest-starred on the sitcom _Friends (1994)_ (qv), though not in the same episodes.", "Owns and plays Taylor Guitars.", "In 2001, renowned architect 'Frank Gehry' (qv) renovated the wine cellar in the home in which Pitt and wife 'Jennifer Aniston' (qv) resided. Pitt subsequently did an informal apprenticeship in Gehry's Los Angeles office.", "Owns the rights to the Hong Kong thriller _Infernal Affairs (2002)_ (qv). He wanted it to be remade with he and 'Tom Cruise' (qv) in the leading roles. The movie was eventually remade as _The Departed (2006)_ (qv). Pitt served as a producer on the movie.", "On the invitation of Virgin CEO 'Richard Branson' (qv), he visited over 100 orphans affected by HIV at a facility run by The Salvation Army in South Africa as well as personally meeting 'Nelson Mandela' (qv) and discussing Mandela's 46664 campaign (named for his prison ID number) to call attention to South Africa's devastating AIDS epidemic. After South Africa, he then flew to Ethiopia on behalf of DATA, a third-world lobby group co-founded by 'U2' (qv)'s 'Bono' (qv). [November 2004]", "As of 2014, has appeared in 10 movies with a number in the title - though only two of them use an actual number rather than spelling the word out: _Se7en (1995)_ (qv), which is a combination of the two, and _12 Years a Slave (2013)_ (qv). He has appeared in one movie with zero in the title, one with the number two in the title, three with the number seven in the title, one with the number eleven and three with number twelve.", "Is a huge fan of MTV's reality show _Jackass (2000)_ (qv). He even asked the cast if he could join them during one of their stunt jokes. He eventually made an appearance dressed in an ape outfit, in order not to be recognized, which would have ruined the joke.", "Raised in Springfield, Missouri, and is an alumni of Kickapoo High School. Other alumni include 'Adrienne Wilkinson' (qv) and 'Jay Kenneth Johnson' (qv).", "Broke his arm during the filming of _Se7en (1995)_ (qv). The injury was written into the movie.", "Adoptive father of 'Maddox Jolie-Pitt' (qv) and 'Zahara Jolie-Pitt' (qv) with 'Angelina Jolie' (qv).", "Wanted to play Darcy in _Bride & Prejudice (2004)_ (qv), but was not able to work out the filming dates.", "Ranked #15 on Premiere magazine's 2006 \"Power 50\" list. Had ranked #31 (2005).", "Was considered for two roles which went to 'Johnny Depp' (qv): Ichabod Crane in _Sleepy Hollow (1999)_ (qv) and Willy Wonka in _Charlie and the Chocolate Factory (2005)_ (qv). Both were directed by 'Tim Burton' (qv).", "The first commercial that 'Brad Pitt' (qv) ever booked was through Matrix Talent Agency, Los Angeles. His agent was Linda Olhava, sister of film director 'Jody Lee Olhava' (qv).", "Has Single Engine Land pilot license.", "Occasionally flies a Cessna 208B Caravan belonging to Chivan Productions.", "Initially did not want to appear in _Mr. & Mrs. Smith (2005)_ (qv), although he was the one who gave the screenplay to director 'Doug Liman' (qv).", "Originally cast as Colin Sullivan in _The Departed (2006)_ (qv), but later dropped out. He continued to produce the film under his (and his then wife 'Jennifer Aniston' (qv)'s) production company, Plan B.", "His first job was dancing in a chicken suit to draw in customers at an El Pollo Loco restaurant on Sunset Boulevard in Hollywood.", "He and girlfriend 'Angelina Jolie' (qv) adopted a three-year-old boy named Pax Thien from Vietnam (born November 29, 2003). [March 2007]", "Made a cameo appearance with 'Matt Damon' (qv) for free in _Confessions of a Dangerous Mind (2002)_ (qv) as a favor to _Ocean's Eleven (2001)_ (qv) co-star and close friend 'George Clooney' (qv) - the film was Clooney's directorial debut.", "Has been in six movies where the title contains the name of the character he plays: _Johnny Suede (1991)_ (qv), _Meet Joe Black (1998)_ (qv), _Sinbad: Legend of the Seven Seas (2003)_ (qv), _Mr. & Mrs. Smith (2005)_ (qv), _The Assassination of Jesse James by the Coward Robert Ford (2007)_ (qv) and _The Curious Case of Benjamin Button (2008)_ (qv).", "He was considered for the lead role in _Crimson Tide (1995)_ (qv), which eventually went to 'Denzel Washington' (qv).", "Voted #6 in Elle (France) magazine's \"15 Sexiest Men\" poll. [June 2007]", "Mentioned in the song \"High School Never Ends\" by 'Bowling for Soup' (qv), as \"the quarterback\".", "He was trained to handle weapons by renowned Hollywood gun coach 'Thell Reed' (qv), who has also trained such actors as 'Val Kilmer' (qv), 'Leonardo DiCaprio' (qv), 'Russell Crowe' (qv), 'Sam Elliot' (qv), 'Girard Swan' (qv), 'Ben Foster' (qv) and 'Kurt Russell' (qv).", "He and 'Russell Crowe' (qv) were director 'Ridley Scott' (qv)'s first two choices for the lead in _American Gangster (2007)_ (qv). Crowe was eventually cast.", "Used to act at the Vandevort Theater in Springfield, Missouri. He still visits and donates to the theater.", "Donated five million dollars of his own money to rebuild homes in Katrina-ravaged New Orleans.", "In 2005, he earned $4,500,000 for a Heineken commercial that aired during the 2005 Super Bowl.", "In 2007, Forbes magazine estimated his earnings for the year to be $35 million.", "Is a patron of the Mineseeker Foundation and the Sole of Africa, a campaign dedicated to detecting and removing land mines in Africa. The Foundation's patrons include 'Nelson Mandela' (qv), Sir 'Richard Branson' (qv), 'Queen Noor' (qv), 'Graça Machel' (qv) and 'John Paul DeJoria' (qv).", "Ranked #10 in the 2008 Forbes The Celebrity 100 list. His girlfriend, 'Angelina Jolie' (qv), ranked #3.", "In November 2005, he visited Pakistan with 'Angelina Jolie' (qv) to see the impact of the 2005 Kashmir earthquake. In 2006, Jolie and Pitt also went to Haiti where they visited a school supported by Yéle Haïti, a charity founded by Haitian-born hip hop musician 'Wyclef Jean' (qv).", "Was officially in the BAFTA long-list for Best Actor in a Supporting Role for his performance in _Babel (2006)_ (qv). However, he did not received the nomination.", "Considers _One Flew Over the Cuckoo's Nest (1975)_ (qv), _Fitzcarraldo (1982)_ (qv) and _The Assassination of Jesse James by the Coward Robert Ford (2007)_ (qv) among his personal favorite movies.", "He auditioned for the role of Mike in _Phantasm II (1988)_ (qv), but director 'Don Coscarelli' (qv) instead chose 'James Le Gros' (qv).", "Along with 'Angelina Jolie' (qv), he traveled to Syria and Jordan on a United Nations Goodwill visit to displaced Iraqi civilians. [October 2009]", "Resides in Los Angeles, Malibu, Goleta, California, Benerville, France and New Orleans, Louisiana.", "Ex-son-in-law of 'John Aniston' (qv) and 'Nancy Dow' (qv). Ex-stepson-in-law of 'Sherry Rooney' (qv).", "Has appeared in two films that took place in the Northwest during the first decades of the 20th Century, and in which he defends a Native American's right to be served alcohol in a bar: _A River Runs Through It (1992)_ (qv) and _Legends of the Fall (1994)_ (qv).", "When he and 'Juliette Lewis' (qv) began their relationship in 1989, she was 16 years old while Pitt was 26. They met on the set of the TV movie _Too Young to Die? (1990)_ (qv), in which they played a couple, and worked together again in _Kalifornia (1993)_ (qv). They resided together and the relationship ended after four years, in 1993.", "He has English, some Scots-Irish/Northern Irish, and small amounts (to varying degrees) of German, Scottish, Welsh, Irish, Swedish, Dutch and French ancestry. In 2012, Brad stated on _Inside the Actors Studio (1994)_ (qv) that he might have Seminole and Cherokee roots. These lineages are unverified.", "The longest he has gone without an Academy Award nomination is 13 years, between _Twelve Monkeys (1995)_ (qv) and _The Curious Case of Benjamin Button (2008)_ (qv).", "Owns multiple houses in ultra trendy Los Angeles neighborhood, Los Feliz. 'Giovanni Ribisi' (qv), 'Bo Barrett' (qv), 'Scarlett Johansson' (qv), 'Chris Pine' (qv), 'Ryan Reynolds' (qv), 'Mark Ruffalo' (qv), 'Kristen Stewart' (qv) and 'Robert Pattinson' (qv) are among the other actors who also call Los Feliz home.", "Girlfriend 'Angelina Jolie' (qv) gave birth to the couple's second daughter, Shiloh Nouvel Jolie-Pitt, on May 27, 2006 in Namibia, Africa.", "Girlfriend 'Angelina Jolie' (qv) gave birth to the couple's fifth and sixth children, son Knox Leon and daughter Vivienne Marcheline, on July 12, 2008 in Nice, France.", "Mentioned in the song \"That Don't Impress Me Much\" by 'Shania Twain' (qv).", "As of 2016, has appeared in seven films that were nominated for the Best Picture Oscar: _Babel (2006)_ (qv), _The Curious Case of Benjamin Button (2008)_ (qv), _Inglourious Basterds (2009)_ (qv), _The Tree of Life (2011)_ (qv), _Moneyball (2011)_ (qv), _12 Years a Slave (2013)_ (qv) and _The Big Short (2015)_ (qv). Of those, _12 Years a Slave (2013)_ (qv), won the Oscar in the category. In addition, Pitt produced the Oscar winning _The Departed (2006)_ (qv).", "He appeared on the last episode of _Jackass (2000)_ (qv), where the crew \"kidnapped\" him.", "(May 29, 2014) Was attacked by 'Vitalii Sediuk' (qv) and a restraining order was issued, ordering him to stay away from Brad.", "Despite an announcement that they would only marry when gay marriage was legal in all American States, 'Brad Pitt' (qv) and 'Angelina Jolie' (qv) married in August 2014.", "Once visited Simba River Camp in Kenya, a safari lodge.", "He and 'Angelina Jolie' (qv) married in California on August 14, 2014 and in southern France on August 23, 2014.", "'Angelina Jolie' (qv) filed for divorce from Brad on September 20, 2016.", "As of 2016, he is the only actor to work on two films each with 'Ridley Scott' (qv), and his brother 'Tony Scott' (qv).", "Has worked with seven directors who have won a Best Director Oscar: 'Robert Redford' (qv), 'Barry Levinson' (qv), 'Steven Soderbergh' (qv), 'Alejandro G. Iñárritu' (qv), 'Joel Coen' (qv) & 'Ethan Coen' (qv), and 'Robert Zemeckis' (qv).", "He was scheduled to star in Urban Townies (2001) for director 'Mike Figgis' (qv), but pulled out to star in _Spy Game (2001)_ (qv), causing Mike to then walk away.", "He was scheduled to make _Waking Up in Reno (2002)_ (qv) with 'Juliette Lewis' (qv) but the date kept being moved which meant he was available when director 'Guy Ritchie' (qv) asked him to do Diamonds which was retitled _Snatch (2000)_ (qv) on release. By the time Waking Up was ready, he and Jennifer were unavailable so their roles went to 'Billy Bob Thornton' (qv) and 'Natasha Richardson' (qv).", "Paid $29 million in a divorce settlement to 'Jennifer Aniston' (qv).", "His favorite football team is the New Orleans Saints.", "Friends with 'George Clooney' (qv), 'Julia Roberts' (qv), 'Matt Damon' (qv), 'Cate Blanchett' (qv) and 'Edward Norton' (qv).", "As of 2018, was producer or executive producer of seven films nominated for Best Picture Oscars: _The Departed (2006)_ (qv), _The Tree of Life (2011)_ (qv), _Moneyball (2011)_ (qv), _12 Years a Slave (2013)_ (qv), _Selma (2014)_ (qv), _The Big Short (2015)_ (qv) and _Moonlight (2016)_ (qv). The Departed, 12 Years a Slave and Moonlight all won Best Picture, but 'Brad Pitt' (qv) was only awarded the Oscar for producing 12 Years a Slave.", "Is mentioned by name in 'Travie McCoy' (qv)'s 2010 song \"Billionaire\" (featuring 'Bruno Mars' (qv)).", "Manager is 'Cynthia Pett-Dante' (qv).", "Says his children are home schooled so they can have more freedom with their education.", "'Brad Pitt' (qv) met with the director to discuss the role of Cable in _Deadpool 2 (2018)_ (qv), but could not commit due to scheduling conflicts, so the role was given to 'Josh Brolin' (qv). Although he was cast as Vanisher instead.", "According to an E! 'News' (qv) story published on January 3, 2018, the actor humorously went by his first name, William, when flirting with a young lady in line at a coffee shop.", "He was engaged to actress 'Jill Schoelen' (qv) for three months, before she broke off the engagement in Budapest (1989).", "Speaks French fluently.", "Has twice played soldiers who fought the Germans and scalped them, in _Legends of the Fall (1994)_ (qv), and _Inglourious Basterds (2009)_ (qv).", "_Remake (2003)_ (qv) is one of his favorite films."], "quotes": ["I'm gonna design my own fleet of trailers. No! I'm gonna record an album like 'Jennifer Lopez' (qv). It'll be an acoustic version of 'KC & The Sunshine Band' (qv). Then maybe I'll design a line of clothes like ['Sean 'Diddy' Combs' (qv)] but all in synthetic fur.", "I'd like to design something like a city or a museum. I want to do something hands on rather than just play golf which is the sport of the religious right.", "[Viasat magazine, May 2001] Fame is a bitch, man.", "[on what keeps him humble] You know, I telephoned my grandparents the other day, and my grandfather said to me, \"We saw your movie.\" \"Which one?\". I said, and he shouted, \"Betty, what was the name of that movie I didn't like?\". I thought that was just classic. I mean, if that doesn't keep your feet on the ground, what would?", "I'm one of those people you hate because of genetics. It's the truth.", "Success is a beast. And it actually puts the emphasis on the wrong thing. You get away with more instead of looking within.", "[Time magazine, October 13, 1997] You shouldn't speak until you know what you're talking about. That's why I get uncomfortable with interviews. Reporters ask me what I feel China should do about Tibet. Who cares what I think China should do? I'm a f---ing actor! They hand me a script. I act. I'm here for entertainment. Basically, when you whittle everything away, I'm a grown man who puts on makeup.", "When you see a person, do you just concentrate on their looks? It's just a first impression. Then there's someone who doesn't catch your eye immediately, but you talk to them and they become the most beautiful thing in the world. The greatest actors aren't what you would call beautiful sex symbols. I'll tell you who my favorite actress is, 'Dianne Wiest' (qv), and you wouldn't call her a sex symbol. 'Dianne Wiest' (qv) is, to me, the most beautiful woman on the screen.", "[when asked by 'Conan O'Brien' (qv) how he got into character as stoner Floyd in _True Romance (1993)_ (qv)] I'm a method actor.", "[May 2005, on his impending divorce to 'Jennifer Aniston' (qv)] The thing I don't understand is looking at this as a failure. It's talked about like it failed, I guess because it wasn't flawless. Me, I embrace the messiness of life. I find it so beautiful, actually.", "[2003] It's amazing what an impending midlife crisis will do for you, really. It got me motivated, having turned 40 in December.", "[on having children] It really changes your perspective on the world. You know, I've had my day. I made some films, and I've really had a very fortunate life, and it's time for me to share that a little bit. Having children takes the focus off yourself, which I'm really grateful for. I'm so tired of thinking about myself. I'm sick of myself. You feel you want to be there and not miss out on anything. It's a true joy and a very profound love. You can write a book, you can make a movie, you can paint a painting, but having kids is the most extraordinary thing I've ever taken on.", "[on how his children will influence his future roles] My thoughts these days are, \"Oh, my God, what did I do? What are they going to see from the past?\". It definitely colors what I'll approach in the future. I'll try to be a little bit more mature about my decisions.", "[on how his earlier, lesser film roles ultimately improved him as an actor]: I believe I'm quite capable and we, as people, can learn to do anything, and that's proof of it! And my education is on film, on record! Now I can take on anything that comes my way and find truth in it an do a pretty good job.", "[on 'Quentin Tarantino' (qv)] The set is heaven and he is God. Heretics are not allowed.", "[2010 - on New Orleans] Truthfully, my favorite sound in the entire world is opening up the balcony doors in the French Quarter and hearing four different sounds playing at once from the apartments across the way or down the street. It's a balmy night, twilight, and I'm drinking a beer, and this feeling just falls over me, of contentment. It gives me goosebumps to talk about it.", "[on being dumped by ex-fiancée 'Jill Schoelen' (qv) in 1989] She called me up in Los Angeles and was crying on the phone. She was lonely and there was a huge drama. At this point, I had $800 to my name and I spent $600 of it getting a ticket from Los Angeles to Hungary to see her. I got there, went straight to the set where she was filming and that night we went out to dinner. She told me that she had fallen in love with the director of the film. I was so shocked I said, \"I'm outta here.\" I spent my night in Budapest, sitting on a bench, smoking, with just a local bum to talk to who couldn't speak English. These are the days and nights you remember when you have success. I returned to America absolutely broke. This is why recognition does not bother me too much.", "Fame makes you feel permanently like a girl walking past construction workers.", "[2009] What's valuable to me has become clearer as I've got older. To me, it's about the value of your time and your day and the value of the people you spend it with. It's about me being a strong father and guide and a good match for my significant other. Then, if I'm going to go to work, it must be something of value to me. I'm much more experienced now, so I can find films that are interesting quicker and cut out the films that don't really matter. It means more to me now because my kids are going to see them, and I want them to be proud.", "[1998, on why he moved to Los Angeles] A lot of the attraction before I came out was the fame, the lifestyle... now my motivation is more, \"I want to be good!\".", "We make breakfast like everyone else and it's chaos and pancake batter splashed all over the place and bath time at night. Ultimately, I'm dad. I have the concerns a dad has. Is everyone safe? Am I spending enough time with them? These are the things that keep me awake.", "[on comparing his own parenting style with that of his character in _The Tree of Life (2011)_ (qv)]: They say actions speak louder than words. It's even more true with my kids. And so it's quite important to me not to put my frustrations on them or bring them in the door. I want to keep them to be free and not encumbered with my junk. In the film it's the exact opposite. I find it very sad, a very sad man who was embittered by his situation, doesn't feel he can get ahead, always feels like he's on the losing end, feels quite oppressed by his surroundings and predicament, doesn't know why it isn't working out for him and why is it working out for other people. That poisoned view of things.", "There are no secrets in our house. We tell the kids, \"Mom and Dad are going off to kiss.\".", "[2011] I spent the '90s trying to hide out, trying to duck the full celebrity cacophony. I started to get sick of myself sitting on a couch, holding a joint, hiding out. It started feeling pathetic. It became very clear to me that I was intent on trying to find a movie about an interesting life, but I wasn't living an interesting life myself. I think that my marriage [to 'Jennifer Aniston' (qv)] had something to do with it. Trying to pretend the marriage was something that it wasn't.", "[2011, on 'Angelina Jolie' (qv)] One of the greatest, smartest things I ever did was give my kids Angie as their mom. She is such a great mom. Oh, man, I'm so happy to have her.", "[2011, on learning to be a parent] I was surprised at how automatic it is, how much of it is instinctual. And now I have a great confidence and trust in those instincts. I mean, one sound at night and you're awake and up because they may need you. Or when they start to have a tantrum, you know to divert them from spinning out by helping them focus on something. It just goes on and on. I tell them, \"You can make a mess, but you've got to clean it up.\".", "[2011, on his religious upbringing] I had my problems with it. It doesn't work for me. I had a lot of questions. But to get to that point where I actually questioned something that I'd based my life on - it wasn't until I was 20 that I really started separating from it, knowing that the ideas didn't make sense. I remember this scary moment where I didn't have anything to pin my existence on, to be comforted by. At the same time, it didn't work for me, man. I had to go up against this thing. I've since... My family accepts me for who I am and they worry for me because I'm gonna burn in an eternal pit of fire. But...", "[on the stress of filming _Interview with the Vampire: The Vampire Chronicles (1994)_ (qv)] One day, it broke me... I called David Geffen, who was a producer... I said, \"David, I can't do this anymore. I can't do it. How much will it take to get me out?\". And he goes, very calmly, \"Forty million dollars.\".", "[on playing the leading character in _The Tree of Life (2011)_ (qv)] That's certainly not my father. But I do understand the father-knows-best mentality, the oppression the father figure can have on his kids, the pressure he is under to be the leader and provide, and feeling like he's falling short and having wants and desires himself. The tragedy is coming home and bringing that on the kids, and then feeling bad about it. It's just this vicious cycle.", "[on the Academy 'Awards' (qv) nomination process] I've been around long enough to know it's very fickle and it's a cyclical wheel. But I will say this: it's surprisingly fun when your number comes up.", "[2012: while accepting the New York Film Critics Circle Award for Best Actor for _Moneyball (2011)_ (qv) and _The Tree of Life (2011)_ (qv)] This is a really big honor for me, considering I'm a guy who had never ridden in an airplane until I was 25. That first trip was here in 1989 to New York. I had an audition for a soap opera. But I had to put myself up, and I stayed at a friend's apartment. That apartment was in the Village on Christopher Street. My first impression of the city was: my god, there's a lot of guys around here. But they're so nice. This is a real pleasure for me to see some of the faces behind the formidable names that instill such fear and reverence in the film industry, although I thought you'd be taller. We are complex, we are mysteries to ourselves, we are difficult to each other, we live in continual flux and instability and conflict. Christians and Muslims, Democrats and Republicans, Denby and Rudin.", "I grew up very religious, and I don't have a great relationship with religion. I oscillate between agnosticism and atheism.", "[2012: on whether he would consider becoming a director] No, not a chance. It makes sense on some level, but I really enjoy being a creative producer and I enjoy my day job as an actor. It's enough for me. I want to also be a dad, first and foremost. After two days it gets itchy. I miss them. I just know how I'd be. I see how much time it takes to mount the thing and put it together. It wouldn't be a good match.", "I think I'm at a point now where I feel like I can jump into anything and lay something down that's quality. Someone may be better at it - or maybe not - but I know that if I have a feeling for it, then I can make it interesting. But even more as I get older, it's about the company that I keep. That's the most important thing to me - that if I'm gonna spend however long it takes to make a movie, give up 14 hours a day for however many weeks or months, then it's very important for me to know that I'm working with people who I respect and enjoy and that we're going for something together.", "[on _World War Z (2013)_ (qv)] We liked this idea of taking a genre and using that as, I guess, a metaphor for pandemics, and if one of those pandemics jumped the tracks. Would we be ready? What countries would be in better shape, what countries would take the biggest hit? A movie is only good if it speaks about our time, if it's personal in some way, and it plugs into the zeitgeist to irritate a little bit. I think we got that here.", "[2012, on _The Assassination of Jesse James by the Coward Robert Ford (2007)_ (qv)] Jesse James is absolutely one of my favourites, and I think the more it decants the better it gets. About three other people think that as well, but I think it's got legs. It's elegant. 'Andrew Dominik' (qv) is a phenomenal director.", "[on _The Devil's Own (1997)_ (qv)] We had no script. Well, we had a great script but it got tossed for various reasons. To have to make something up as you go along - Jesus, what pressure! It was ridiculous. It was the most irresponsible bit of filmmaking - if you can even call it that - that I've ever seen. The movie was the complete victim of this drowning studio head ('Mark Canton' (qv)) who said, \"I don't care. We're making it. I don't care what you have. Shoot something.\"", "Terrence's Voyage of Time is an incredibly beautiful and unique experiential IMAX film for children and families chronicling the birth of time, I'm very grateful to be part of such a fascinating and educational project, but I'm currently focused on my family situation and don't want to distract attention away from this extraordinary film, which I encourage everyone to see.", "[_Real Time with Bill Maher (2003)_ (qv), August 14, 2009] Because for a democracy to work, we have to know the facts to make an informed decision. Then yes, I see it. But when you see it devolving into talks of socialism and the dismantling of the country, no one is helped by this. And let me tell you, I guarantee you these people have never been to a socialist country. I've been to a socialist country. We're fine. We're great.", "[on _A River Runs Through It (1992)_ (qv)] That was a big deal. I grew up on Redford films and Newman films and 'Clint Eastwood' (qv) and a lot of the Westerns. It was a beautiful story and one I understood because of how I grew up. 'Robert Redford' (qv) made a quality movie. But I don't think I was skilled enough. I think I could have done better. Maybe it was the pressure of the part, and playing someone who was a real person - and the family was around occasionally - and not wanting to let Redford down. But again, it's been a long time since I've seen it. I was much more critical then. I was more self-conscious."], "salary history": ["_Less Than Zero (1987)_ (qv)::$38", "_Cutting Class (1989)_ (qv)::$12,000", "_Thelma & Louise (1991)_ (qv)::$6,000", "_Kalifornia (1993)_ (qv)::$500,000", "_Interview with the Vampire: The Vampire Chronicles (1994)_ (qv)::$3,000,000", "_Se7en (1995)_ (qv)::$4,000,000", "_Sleepers (1996)_ (qv)::$10,000,000", "_The Devil's Own (1997)_ (qv)::$8,000,000", "_Seven Years in Tibet (1997)_ (qv)::$10,000,000", "_Meet Joe Black (1998)_ (qv)::$17,500,000", "_Fight Club (1999)_ (qv)::$17,500,000", "_The Mexican (2001)_ (qv)::$10,000,000", "_Spy Game (2001)_ (qv)::$17,500,000", "_Ocean's Eleven (2001)_ (qv)::$30,000,000 ($10m salary + backend participations)", "_Troy (2004)_ (qv)::$17,500,000", "_Mr. & Mrs. Smith (2005)_ (qv)::$20,000,000", "_The Assassination of Jesse James by the Coward Robert Ford (2007)_ (qv)::$1,000,000", "_Inglourious Basterds (2009)_ (qv)::$10,000,000", "_Once Upon a Time... in Hollywood (2019)_ (qv)::$10,000,000"], "birth date": "1963-12-18", "birth notes": "Shawnee, Oklahoma, USA", "_actorID": "52", "_source": "IMDB", "actorID": "0000093", "created_utc_dt": "08/26/2019, 21:54:23"}