{"headshot": "https://m.media-amazon.com/images/M/MV5BMTM2MjIwOTc0Nl5BMl5BanBnXkFtZTcwNzQ5ODM1Mw@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Zoë Yadira Saldaña Nazario", "height": "5' 6½\" (1.69 m)", "mini biography": ["'Zoe Saldana' (qv) was born on June 19, 1978 in Passaic, New Jersey, to Asalia Nazario and Aridio Saldaña. Her father was Dominican and her mother is Puerto Rican. She was raised in Queens, New York. When she was 10 years old, she and her family moved to the Dominican Republic, where they would live for the next seven years. While living there, Zoe discovered a keen interest in performance dance and began her training at the prestigious ECOS Espacio de Danza Dance Academy where she learned ballet as well as other dance forms. Not only did her training provide an excellent outlet for the enthusiastic and energetic youngster, it would also prove to be a fortunate precursor for the start of her professional acting career. At age 17, Zoe and her family moved back to the United States where her love for dance followed and an interest in theater performance became stronger.She began performing with the Faces theater troupe which put on plays geared to provide positive messages for teens with themes dealing with issues such as substance abuse and sex. These performances not only gave her valuable experience but also a source of great pride knowing that she was making a difference in the lives of young people like herself. While performing with the Faces troupe and also the New York Youth Theater, Zoe was recruited for a talent agency and her dance training years before coupled with her acting experience greatly helped her land her first big screen role as Eva Rodriguez, the talented and headstrong ballet dancer in the film _Center Stage (2000)_ (qv). Since her professional career began several years ago, Zoe's talent and determination has allowed her to be involved in blockbuster films and act with major actors, actresses and industry insiders at a pace that very few young professionals have experienced.Zoe has not only held her own in major motion picture productions but gained the respect and praise from industry insiders such as 'Jerry Bruckheimer' (qv) and 'Steven Spielberg' (qv) and actors/actresses such as 'Tom Hanks' (qv), 'Bernie Mac' (qv), 'Keira Knightley' (qv), 'Ashton Kutcher' (qv), 'Kirsten Dunst' (qv) and 'Orlando Bloom' (qv). According to many of her co-stars, producers and directors, the sky is no limit for this young star who has incredible range, intense concentration, and a steely determination to be involved with projects that challenge her professionally with wide-ranging subject matters and characters. Just to ask practically anyone who she has worked for or with about her, glowing comments abound and earned friendships and respect are readily revealed. A star has been born, and growing every day.::LeoRMC"], "spouse": ["'Marco Perego Saldana' (qv)::(June 2013 - present) ( 3 children)"], "trade mark": ["Often plays strong, dominant heroines"], "trivia": ["Her father was Dominican and her mother is Puerto Rican. She has also said that she has Haitian and Lebanese ancestry.", "Ranked #42 on Maxim magazine's Hot 100 Women of 2008 list.", "In _The Terminal (2004)_ (qv), Saldana's character, Torres, is revealed to be a huge fan of Star Trek. Saldana went on to be cast as Nyota Uhura in _Star Trek (2009)_ (qv).", "Had not seen the original _Star Trek (1966)_ (qv) series before she was cast in _Star Trek (2009)_ (qv).", "To prepare for her role as Nyota Uhura in _Star Trek (2009)_ (qv), she met with 'Nichelle Nichols' (qv) who played the same character on the original series.", "Admires 'Whoopi Goldberg' (qv) and 'Angelina Jolie' (qv).", "Was chosen as one of People magazine's annual 100 Most Beautiful People in the World, Beauty at Every Age section, for age 28. [May 2007]", "She had a smaller role in _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv), and was set to star in the sequels, but never did. When filming the final scene of _Pirates of the Caribbean: Dead Man's Chest (2006)_ (qv), the cast were told an \"old friend\" would return and the actors were led to believe that Saldana would be the one coming back. However, it was 'Geoffrey Rush' (qv). The actors were misinformed in order to get real authenticity in their faces. Zoe never did reprise her role.", "Did an intense nonstop six-month preparation for _Avatar (2009)_ (qv) including martial arts, archery and horseback riding.", "Likes to play strong female characters. And said in an interview with a Danish film-site that she was really looking forward to evolving her character of Uhura into a stronger, kick-ass lady in future _Star Trek (2009)_ (qv) sequels.", "Says she's a sci-fi geek who just happens to dress nice.", "Revealed on _Jimmy Kimmel Live! (2003)_ (qv) that she is often mistaken for 'Thandie Newton' (qv). Even her own mother once mistook the two of them.", "Was in a relationship with actor 'Keith Britton' (qv) from 2005-2011.", "Ranked #3 on Maxim magazine's Hot 100 Women of 2010 list.", "Ranked #37 on Maxim magazine's Hot 100 Women of 2011 list.", "Ranked #91 in the 2011 FHM list of \"100 Sexiest Women in the World\".", "Ranked #24 in the 2010 FHM UK list of \"100 Sexiest Women in the World\".", "Was engaged to 'Keith Britton' (qv) in June 2010 but they separated in November 2011.", "Co-founder, with 'Keith Britton' (qv), of website, My Fashion Data Base (MyFDB.com). They are also business partners in the website.", "Currently resides in New York City and Los Angeles, California.", "Saldana and her _Star Trek (2009)_ (qv) co-star 'Rachel Nichols' (qv) both went on to work with 'Stephen Lang' (qv). Saldana, with Lang in _Avatar (2009)_ (qv); Nichols, with Lang in _Conan the Barbarian (2011)_ (qv).", "Ranked #29 on Maxim magazine's Hot 100 Women of 2014 list.", "Daughter of Aridio Saldana and Asalia Nazario.", "Has two sisters, Cisely and Mariel Saldana, and one half-brother, Nipo Saldana.", "Married her boyfriend of 3 months 'Marco Perego Saldana' (qv). [June 2013]", "Her husband 'Marco Perego Saldana' (qv) took her surname.", "Has three sons with her husband 'Marco Perego Saldana' (qv): twins Cy Aridio Perego-Saldana and Bowie Ezio Perego-Saldana (born November 27, 2014 in Los Angeles) and Zen Perego-Saldana (born December 12, 2016).", "Returned to work 7 months after giving birth to her twins Cy and Bowie to begin filming _Star Trek Beyond (2016)_ (qv).", "Sang with 'Diego Luna' (qv) on the song \"No Matter Where You Are\" for the soundtrack of the animated comedy _The Book of Life (2014)_ (qv).", "While filming _The Words (2012)_ (qv), she began a relationship with co-star 'Bradley Cooper' (qv), which ended in 2013. Also starred with him in _Guardians of the Galaxy (2014)_ (qv).", "Her favorite teen movie growing up was _Some Kind of Wonderful (1987)_ (qv).", "Is a supporter of FINCA International, a non-profit microfinance organization.", "She studied ballet from the time she was ten to her teens when she gave this up as she \"didn't have the feet\".", "Sons Cy and Bowie are named after the artist Cy Twombly and the singer David Bowie.", "Was 8 months pregnant with her son Zen when she completed filming _I Kill Giants (2017)_ (qv).", "Returned to work 2 months after giving birth to her son Zen to begin filming _Avengers: Infinity War (2018)_ (qv).", "She was awarded a Star on the Hollywood Walk of Fame at 6920 Hollywood Boulevard in Hollywood, California on May 3, 2018.", "She is the first (and to date, the only) actress in history to star in three films that made more than two billion dollars at the box office: _Avatar (2009)_ (qv), _Avengers: Infinity War (2018)_ (qv) and _Avengers: Endgame (2019)_ (qv).", "She is left-handed."], "quotes": ["When I go to the D.R., the press in Santo Domingo always asks, \"¿Qué te consideras, dominicana o americana?\" (\"What do you consider yourself, Dominican or American?\") I don't understand it, and it's the same people asking the same question. So I say, time and time again, \"Yo soy una mujer negra.\" (\"I am a black woman.\") [They go] \"Oh, no, tú eres trigueñita.\" (\"Oh no, you are 'dark skinned'\") I'm like, \"No! Let's get it straight, yo soy una mujer negra.\" (\"I am a black woman.\")", "I am actually! I'm very proud to say I am a geek. But I'm kind of a cool geek. I grew up in a very sci-fi home so I've seen a lot of sci-fi movies, from _Dune (1984)_ (qv) to _Alien (1979)_ (qv), _2001: A Space Odyssey (1968)_ (qv), _E.T. the Extra-Terrestrial (1982)_ (qv), _*batteries not included (1987)_ (qv)... All these films I go crazy for. But never \"Star Trek\".", "I tend to be very picky, so I look for the perfect man! So if Spock and Kirk can mix, they would become my perfect man. That's the kind of guy I'd go for. I don't only go for muscles, I don't only go for brains. You just need to have a little bit of a bad boy and a geek and then you've got the perfect guy.", "[on auditioning for _Avatar (2009)_ (qv)] I was still living in New York at the time, and I heard that 'James Cameron' (qv) was getting ready to shoot a movie. At first, I thought it was going to be that Japanese franchise that he owns; I read for that and it disappeared. Then, like a month later, they want to put me back on tape... the script excerpts used for auditions were about this girl from a tribe in the jungle and I was like, this is weird. But I put myself on tape again and, a month later, around July 2006, they called me and told me that in a week, I was going to L.A. to meet 'James Cameron' (qv). I remember being very nervous, but he was just such a polite and approachable person. It felt like a meeting where we were getting to know each other, as opposed to an audition, where I have to put my act on.", "[on the current landscape of quality roles for actresses] They're out there - people just aren't investing in them. We can sit here forever discussing it, because it has a chicken vs. the egg quality. Bottom line, producers are business people. Hollywood is a moneymaking machine. At the end of the day, they have to produce numbers that will help them keep their jobs and companies alive. But we as consumers have a lot more power than we think. Women need to demand better roles and get audiences to see their films. Because if a film doesn't make $150 million, producers and studios aren't going to bankroll a similar film next time. If there were more filmmakers that were female, trust me, it would be all about women.", "[on 'James Cameron' (qv) creating strong female characters] I don't know if its something that he's been consciously aware of, to be honest. What do know is that he's been impacted by interesting women all his life, because you can tell he's in tune with his feminine side. I've learned this about men who write good roles for women - there's a very beautiful sentimentality to them. Their exteriors are sugarcoated with this manly presence, but deep on the inside, there's also this [fragility]. During the shortness of my career, I've managed to work with 'Steven Spielberg' (qv), 'J.J. Abrams' (qv), and now Jim - all directors who are known for having strong female protagonists. They don't feel diminished by it as men; they can tap into the complexities of how woman really are.", "... I will say is that my _Avatar (2009)_ (qv) character, Neytiri, has been the most challenging of my entire career - physically, mentally and spiritually. It's the first time I played a non-human, I had to learn a different language, and it was hard to part with her at the end. No matter how intense other characters have been, I've only been in their skins for at most four months - never a year and a half.", "I love sex. I love skin. I don't believe the body is something to hide. I think in American society, we're messing up our kids by taking away the education on, and awareness of, our sexuality and replacing it with violence, guns and video games - and we're breeding little criminals.", "[on her dislike of making _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv)] I didn't like the experience of working on Pirates and I feel that it is my job to be completely honest. To me, that's what a Hollywood movie felt like. If that's what I have to witness, and have to go through, to do a Hollywood movie, I'd rather do something else. It was just too massive. You really felt the immensity of it. Just not my taste.", "[on expanding her career to become a film director] It is more satisfying. You are more of a participant in the conception. I like having control. I think I have the capability. I am a storyteller and an artist and I love what I do. So I want to be part of it more and not just show up and say my lines.", "When you are shooting a film like _Blood Ties (2013)_ (qv), when the budget is not as big and you are shooting in a city like New York, which is a very expensive city, all the budget goes into the movie and you just make compromises. You are happy to do so because you are collaborating with amazing people. It is a good day at the office. The office might be smaller but it is good.", "It doesn't matter how much backlash I will get for it. I will honor and respect my black community because that's who I am.", "Behind the scenes, the actors are the ones with the least power. You're told what to do, what to wear, where to stand. Your creative inputs are ignored."], "birth date": "1978-06-19", "birth notes": "Passaic, New Jersey, USA", "_actorID": "7", "_source": "IMDB", "actorID": "0757855", "created_utc_dt": "08/26/2019, 21:53:50"}