{"headshot": "https://m.media-amazon.com/images/M/MV5BNzMwODE1NjA3OV5BMl5BanBnXkFtZTgwNTY5MzM2OTE@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Simon John Beckingham", "height": "5' 10\" (1.78 m)", "mini biography": ["English actor, writer and comedian 'Simon Pegg' (qv) was born Simon John Beckingham in Brockworth, Gloucestershire, to Gillian Rosemary (Smith), a civil servant, and John Henry Beckingham, a jazz musician. His parents divorced when Pegg was seven. He later took his stepfather's surname, \"Pegg\". He was educated at Brockworth Comprehensive Secondary School in Gloucestershire and went on to Stratford-upon-Avon College to study English literature and performance studies. He then attended the University of Bristol, and earned a bachelor's degree in drama. In the early 1990s, Pegg moved to London and began forging a successful career in stand-up comedy. Television opportunities followed including roles in _Six Pairs of Pants (1995)_ (qv), _Asylum (1996)_ (qv) and _We Know Where You Live (1997)_ (qv). In 1999, Pegg and 'Jessica Hynes' (qv) teamed up to write and star in cult sitcom _Spaced (1999)_ (qv), directed by 'Edgar Wright' (qv). The series also featured Pegg's best friend, 'Nick Frost' (qv). Pegg's breakthrough in film came with the zom-rom-com _Shaun of the Dead (2004)_ (qv), which he also co-wrote with director 'Edgar Wright' (qv). Again, the film featured 'Nick Frost' (qv). The trio also scored a hit with police comedy _Hot Fuzz (2007)_ (qv). Further film successes followed for Pegg, notably in the iconic role of Montgomery \"Scotty\" Scott in _Star Trek (2009)_ (qv) and alongside 'Tom Cruise' (qv) in _Mission: Impossible III (2006)_ (qv) and _Mission: Impossible - Ghost Protocol (2011)_ (qv).::Anonymous"], "spouse": ["'Maureen Pegg' (qv)::(23 July 2005 - present) ( 1 child)"], "trade mark": ["References sci-fi and pop culture in his films and shows", "Characters who are often arrogant but likeable", "Often works with 'Nick Frost' (qv) and 'Edgar Wright' (qv)", "Often plays losers and underachievers", "Often works with JJ Abrams", "Often stars in movies about aliens; Star Trek, Paul, The World's End, Absolutely Anything, Star Wars: The Force Awakens"], "trivia": ["Graduated from Bristol University in 1991 with a Bachelor's degree in theatre, film and television.", "Is a huge Star Wars fan and his work often includes references to the Star Wars saga.", "In addition to the numerous visual reference to _Star Wars: Episode IV - A New Hope (1977)_ (qv) in _Shaun of the Dead (2004)_ (qv), his flatmate, Pete, is played by 'Peter Serafinowicz' (qv), the voice of Darth Maul.", "Attended Brockworth School in Gloucester and opened their new business centre in 2004.", "Was offered the lead role of Rorschach in the doomed movie adaptation of the comic book miniseries \"The Watchmen\". He turned it down because it would become too \"'Simon Pegg' (qv) *is* Rorschach\".", "Auditioned for the role of Rufus in the romantic comedy _Love Actually (2003)_ (qv).", "Was the drummer in a band called \"God's Third Leg\" when he was 16.", "He was part of the same comedy troupe as 'David Walliams' (qv), 'Matt Lucas' (qv) and 'Dominik Diamond' (qv).", "Is godfather of 'Chris Martin' (qv) and 'Gwyneth Paltrow' (qv)'s daughter, 'Apple Martin' (qv).", "Was originally slated to play Rose Tyler's father in the first series of _Doctor Who (2005)_ (qv), but due to a scheduling conflict took the role of The Editor in another episode.", "Was offered a role in _Dog Soldiers (2002)_ (qv), but turned it down at 'Edgar Wright' (qv)'s request, as Wright wanted _Shaun of the Dead (2004)_ (qv) to be Pegg's first role in a horror movie.", "'Nick Frost' (qv), who co-stars with Pegg in _Hot Fuzz (2007)_ (qv), _Spaced (1999)_ (qv) and _Shaun of the Dead (2004)_ (qv), is Pegg's real life best friend and former flatmate. Before they first starred in _Spaced (1999)_ (qv) together, Frost had no formal training as an actor, but is now a top comedy name in the United Kingdom.", "He was cast in the role of Benji Dunn in _Mission: Impossible III (2006)_ (qv) after 'Ricky Gervais' (qv) was unable to take the role. 'J.J. Abrams' (qv), director of the film, is said to be a huge fan of _Shaun of the Dead (2004)_ (qv).", "Pegg revealed that he would like to return to _Spaced (1999)_ (qv), in the form of a one-hour special. The one-off show would reveal what became of the main characters. Pegg revealed this in a 2007 interview with \"Spaced\" co-star 'Bill Bailey' (qv).", "Lost two stone (28 pounds) for his role in _Hot Fuzz (2007)_ (qv).", "When asked by a journalist whether England had not become too small for him after the worldwide success of _Shaun of the Dead (2004)_ (qv), he replied \"It's not like I'm going to be starring in Mission: Impossible III.\". Six months later, he was cast as Benji Dunn in _Mission: Impossible III (2006)_ (qv).", "Is 'Darick Robertson' (qv)'s \"model\" for Wee Hughie in \"The Boys\", by 'Garth Ennis' (qv) and 'Darick Robertson' (qv).", "Is a huge fan of 'Gillian Anderson' (qv) and _The X-Files (1993)_ (qv).", "Attended Stratford-Upon-Avon College, and studied Performance Studies and English.", "Along with 'Alan Dale' (qv), 'Daphne Ashbrook' (qv), 'Guy Siner' (qv), 'Maurice Roëves' (qv), 'Olaf Pooley' (qv), 'Barrie Ingham' (qv), 'John Franklyn-Robbins' (qv), 'Christopher Neame' (qv) and 'Deep Roy' (qv), he is one of only ten actors to have speaking roles in both the Doctor Who and Star Trek franchises. He played the Editor in _Doctor Who: The Long Game (2005)_ (qv) and Montgomery \"Scotty\" Scott in _Star Trek (2009)_ (qv). He appeared with Roy in the latter.", "Parents are John Henry and Gillian Rosemary Beckingham.", "Worked at British department store Debenhams in the menswear department, at the Bristol store, before he went into acting.", "His favourite movie is _Raising Arizona (1987)_ (qv) and his favourite television series are _The X-Files (1993)_ (qv) and _Buffy the Vampire Slayer (1997)_ (qv).", "On July 1, 2009, Simon announced on his official website that his wife 'Maureen Pegg' (qv) (nee McCann) had given birth to a daughter a few days earlier. However, he added \"name, weight, time, place, etc. all belong to us and we won't be going out of our way to divulge them anytime soon\". Later, he stated on UK GQ's \"'Simon Pegg' (qv) Breaks Down His Most Iconic Characters\" that his daughter was born in Los Angeles during shooting _Paul (2011)_ (qv).", "Worked with director 'J.J. Abrams' (qv) on _Mission: Impossible III (2006)_ (qv) and then again on _Star Trek (2009)_ (qv). Both films were based on television series from the 1960s, and 'Leonard Nimoy' (qv) appeared on both.", "Simon is friends with 'Coldplay' (qv) and has played drums and harmonica for the band, as well as appearing in some of their videos.", "Has two pet Mini Schnauzer dogs.", "One of his favourite horror films is _Poltergeist (1982)_ (qv). 'Steven Spielberg' (qv), who produced the film, had a brief voice cameo in Pegg's sci-fi comedy _Paul (2011)_ (qv). Spielberg was a great admirer of Pegg's horror-comedy _Shaun of the Dead (2004)_ (qv). Spielberg later cast Pegg and Shaun co-star 'Nick Frost' (qv) as the Thompson twins in _The Adventures of Tintin (2011)_ (qv).", "(July 1, 2009) Simon and his wife, 'Maureen Pegg' (qv), welcomed their first child, a girl named Matilda.", "As a teenager, he had a crush on 'Sigourney Weaver' (qv) and 'Diane Keaton' (qv). He even wrote a poem about Sigourney at Bristol University. He would get his wish when he would work her in one scene in _Paul (2011)_ (qv),.", "He and 'Deep Roy' (qv) are the only actors to have credits in adaptations of Doctor Who, Star Trek and Star Wars.", "He had a crush on 'Carrie Fisher' (qv) when he was a child. He admitted that he had a picture of her beside his bed and would kiss it every night before he went to sleep.", "He has sectoral heterochromia - his eyes are grey-blue, and his right iris has a noticeable brown spot.", "Is the only actor aside from 'Tom Cruise' (qv) and 'Ving Rhames' (qv) to play a team member in more than one Mission: Impossible film.", "His character on _Spaced (1999)_ (qv) once remarked that \"It's a fact of life sure as eggs is eggs and every odd numbered Star Trek film is s---.\" He later appeared in _Star Trek (2009)_ (qv) which was the eleventh film. He later said \"Fate put me in that film to show I was talking out of my ass.\".", "Has expressed admiration for fellow comedic actors such as 'Ricky Gervais' (qv), 'Will Ferrell' (qv), 'Eddie Izzard' (qv), 'Chris Rock' (qv) and 'Ben Stiller' (qv).", "Met fellow comic 'Adam Sandler' (qv) on the Jonathan Ross Show in 2009. In fact the two comedians were originally supposed to appear on screen together in 'Quentin Tarantino' (qv)'s Inglourious Basterds, however both passed up the roles to do other projects; their parts went to 'Eli Roth' (qv) and 'Michael Fassbender' (qv). Interestingly, comic actor 'Eddie Murphy' (qv) also declined a role in the same film.", "Arguably the most famous actor to appear in both a Star Wars film and a Star Trek film. Other character actors have had bit roles in both, but Pegg plays Scotty in the new Star Trek film series and has a small but important role as Unkar Plutt in _Star Wars: Episode VII - The Force Awakens (2015)_ (qv).", "Loves the USA and frequently travels there.", "Is good friends with actor 'Samuel L. Jackson' (qv).", "In 2011, he met actor 'Tom Hanks' (qv) on \"The Graham Norton Show\"; the two had a very pleasant, friendly conversation on the air together and to this day remain good friends.", "Is a huge fan of horror movies."], "quotes": ["[on seeing _Star Wars: Episode IV - A New Hope (1977)_ (qv) for the first time as a child] It was like an awakening.", "You know what, despite my complaints about The Phantom Menace and Episode II, when Episode III comes out I'll be first in line. I genuinely love it.", "Every person should have their escape route planned. I think everyone has an apocalypse fantasy, what would I do in the event of the end of the world, and we just basically - me and Nick - said what would we do, where would we head?", "I always loved horror and that's sort of the reason we decided to make the film. We were nourished on those sorts of films, so it was a labor of love.", "'Chris Martin' (qv)'s a good friend of mine. I'm actually Apple's godfather. He's an old friend and we've been mates for quite a few years now.", "_Doctor Who (1963)_ (qv) was a big part of my childhood so it was a great honour to be in it.", "But I think there's plenty of British comedy that Americans have never seen that they would like but sometimes things just get through.", "Both me and Edgar are firm believers in never underestimating or talking down to an audience, and giving an audience something to do, to give them something which is entirely up to them to enter into the film and find these hidden things and whatever.", "As a certain kind of threat, as monsters from the id, they're more affective as aggressive killing machines, but I think the whole point of the zombie as Romero framed it was that it's us. They're like larva. They just keep coming.", "Because once the word got out that we were making _Shaun of the Dead (2004)_ (qv), we didn't want people to think we were backtracking or changing our minds.", "And also, isn't the root of the word zombie from somnambulist, which means sleepwalker. By the very running immediately stops them from being zombies.", "American audiences tend to be more expressive than British ones.", "[_Shaun of the Dead (2004)_ (qv)] I wrote _Spaced (1999)_ (qv) with 'Jessica Hynes' (qv) (aka Jessica Stevenson), who plays Yvonne in the film - who is our savior that comes and gets us at the end.", "I used to lie in bed in my flat and imagine what would happen if there was a zombie attack.", "In England, we don't have any guns whatsoever.", "It's the very British thing of reserve and keeping everything shut in, that's what people do with their emotions, shut the curtains on them.", "I think that the joke and the ghost story both have a similar set up in that you kind of set something up and pay it off with a laugh or a scare.", "I think at its best the American sense of humor is the same as the British sense of humor at its best, which is to be wry and ironic and self deprecating.", "I don't know about doing a sequel. I think you can retroactively damage a product by adding to it.", "I just love listening to the laughter.", "I loved playing Shaun, he's not that different from me.", "I mean, yeah, I'm sure that Python and the other things have paved the way for a greater understanding of the British sense of humor, but I don't think it's all that different than the American sense of humor.", "I once showed a holiday video to my entire family and forgot there was a point where I flashed. I only realized about one second before it happened and couldn't get to the remote in time to stop them all from seeing me pull down my trousers and reveal myself. My sister screamed and my mum said, \"Ooh, that's changed.\".", "Being the Doctor? I don't think I'd do it for two reasons. One, I'm really loving doing movies. I'm really enjoying working in the US. Second, I really love _Doctor Who (2005)_ (qv) and I'd hate to have to sit down every Saturday night and have it be me. David's ('David Tennant' (qv)) done such an incredible job, he's gonna be a tough act to follow. It would feel awful if I just went and balled up the franchise by just being rubbish.", "[on taking over the role of \"Scotty\" from the late 'James Doohan' (qv)] I didn't want to do an impression of 'James Doohan' (qv), because the guy's a legend. I wanted to make it a tribute to him. His son, 'Christopher Doohan' (qv), was on the Enterprise with me. He was my assistant, so I was able to talk to him about his experiences with his dad.", "[on his _How to Lose Friends & Alienate People (2008)_ (qv) co-star 'Megan Fox' (qv)] She's really sharp and actually a bit of a geek. Queen of the geeks - the most beautiful geek I've ever met. Even if she did keep pointing out I was old enough to be her father.", "Being a geek is all about being honest about what you enjoy and not being afraid to demonstrate that affection. It means never having to play it cool about how much you like something. It's basically a license to proudly emote on a somewhat childish level rather than behave like a supposed adult. Being a geek is extremely liberating.", "After a barrage of tweets on the matter, allow me to clarify, I am not in the running for, nor do I have any desire to be the next Doctor. I actually haven't watched the show since I was in it. I'm very method that way.", "[on 'Ricky Gervais' (qv)] Publicly he has zero humility. He would never say anything nice about anyone. He's incredibly competitive and it's not enough that he be the best, everyone else has to die horribly. In person he actually has some humility and is very sweet. He can be a nice guy.", "['Will Ferrell' (qv)] is a great example of a guy who people aren't sure about when he does something serious. I really loved [_Stranger Than Fiction (2006)_ (qv)], which was a serious film he did, but the audiences didn't turn out so much.", "[on _Terminator 2: Judgment Day (1991)_ (qv)] Not as good as the first by any means - the thumb in the lava at the end is one of the most ridiculous moments in any film, ever.", "[on the death of his comedy hero 'Rik Mayall' (qv)] It is a terrible loss, he was a true pioneer and an incredible force. His peers and him were as important to comedy as 'Sex Pistols' (qv) were to music. They shook things up and changed it for the better. For me, _The Young Ones (1982)_ (qv) will always be his signature performance. Rick was just a character for the ages. I'm really sad.", "[on 'J.J. Abrams' (qv) directing _Star Wars: Episode VII - The Force Awakens (2015)_ (qv)] He's very, very keen to make the film in line with the original three in terms of the mode of production. It's being shot on film, they're using a huge amount of physical effects, puppets, masks, stuff that will make it feel very much continuous with the original three even though its set 30 years later. And it's going to be awesome. I think it's going to drop bombs on the world. It's going to be absolutely amazing.", "The beauty of _Point Break (1991)_ (qv) was that 'Kathryn Bigelow' (qv) took a ludicrous idea, cast Reeves/Swayze/Busey and made a classic. Good luck remake.", "(On fame) It's like jumping into a pool full of sharks.", "[on the first time his daughter was seeing Yoda in _Star Wars: Episode V - The Empire Strikes Back (1980)_ (qv)] When he appears, I saw her sort of sit up. She looked at the screen and then she looked at me and then she looked back at the screen and she watched it for a bit. And then she said - \"Daddy, he's real!\". And I kind of like burst out crying. I was like - \"You're my child!\" And it's because he's there. He's there interacting with 'Mark Hamill' (qv). Even if he was CG, we'd still know he wasn't really there because he's a sort of a little long-eared alien. But the fact that it was a puppet who's existing in the same space as 'Mark Hamill' (qv), talking to him, it made her believe in him in a way that CG would never do.", "[on \"E.T. the Extra-Terrestrial\"] This was a film that was between Star Wars' for me. I remember hearing about it when I was on holiday and my stepdad was excitedly telling me all about this \"brand-new Spielberg film.\" As he'd obviously done Raiders of The Lost Ark before then and Close Encounters of The Third Kind, I was already somewhat aware of Spielberg. It was another film that had a massive box office impact in the States after Star Wars came out and the idea of the \"blockbuster\" had just sort of been born; this was the next huge one I think. I remember going to see it and it really made me cry. I was wearing one of those parkas and I put my hood up to hide the tears; it made it look like I was wearing a snorkel. I started crying towards the end and I remember putting my hood up because I was embarrassed about showing emotion [laughs]. But I absolutely loved it and I even went and bought the soundtrack on cassette from Debenhams which was across the road from the cinema. I would just listen to that on a loop - the whole soundtrack from beginning to end, over and over. I was twelve when it came out; I might have gone to see it on my own - I can't remember. I do remember that I took my little sister years later (when it was re-released and it came back round again) to show her and I was convinced she was going to cry but she didn't. I'm pretty sure I went to see it on my own - I seem to remember lining up to see it. There was a cinema in Gloucestershire called the ABC - it's not there anymore, it's a bar now - but that's where I saw all my formative movies. I remember lining up for it and not really knowing anything about it. In those days, prior to the internet and prior to any kind of concerted film journalism for young people, there was nothing, only really what you'd seen on Film 82 or whatever. It was extraordinarily affecting for me."], "birth date": "1970-02-14", "birth notes": "Gloucester, Gloucestershire, England, UK", "_actorID": "99", "_source": "IMDB", "actorID": "0670408", "created_utc_dt": "08/26/2019, 21:54:54"}