{"headshot": "https://m.media-amazon.com/images/M/MV5BMTY4NTEwNDg1MV5BMl5BanBnXkFtZTgwODMwMDA0ODE@._V1_UY98_CR5,0,67,98_AL_.jpg", "nick names": ["Fred"], "birth name": "Paul Stephen Rudd", "height": "5' 10\" (1.78 m)", "mini biography": ["Paul Stephen Rudd was born in Passaic, New Jersey. His parents, Michael and Gloria, both from Jewish families, were born in the London area, U.K. He has one sister, who is three years younger than he is. Paul traveled with his family during his early years, because of his father's airline job at TWA. His family eventually settled in Overland Park, Kansas, where his mother worked as a sales manager for TV station KSMO-TV. Paul attended Broadmoor Junior High and Shawnee Mission West High School, from which he graduated in 1987, and where he was Student Body President. He then enrolled at the University of Kansas in Lawrence, majoring in theater. He graduated from the American Academy of Dramatic Arts-West in Los Angeles and participated in a three-month intensive workshop under the guidance of 'Michael Kahn' (qv) at the British Drama Academy at Oxford University in Britain. Rudd helped to produce the Globe Theater's production of 'Howard Brenton' (qv)'s \"Bloody Poetry,\" which starred Rudd as 'Percy Bysshe Shelley' (qv).::A. Nonymous"], "spouse": ["'Julie Rudd' (qv)::(23 February 2003 - present) ( 2 children)"], "trade mark": ["Low-key, sardonic sense of humor", "Deadpan delivery", "Frequently co-stars with 'Steve Carell' (qv) and 'Seth Rogen' (qv)", "Sarcastic wit", "Often cast by 'Judd Apatow' (qv).", "Vivid green eyes"], "trivia": ["1998: Began filming on a movie called \"Chicken Blood and Other Tales\", but production was canceled before it wrapped.", "Was disappointed by the final result of _Halloween 6: The Curse of Michael Myers (1995)_ (qv) because filming had him believing it was going to be a high-caliber suspense film, but the reaction to the film was overwhelmingly negative.", "Was classmates with 'Matthew Lillard' (qv) at the American Academy of Dramatic Arts.", "Was a disc jockey at Bar Mitzvahs before his career became successful.", "2/23/03: Married his girlfriend, 'Julie Rudd' (qv) in upstate New York. They live in Manhattan. As of 2009, they have been together for 14 years.", "Prior to joining the cast of _Friends (1994)_ (qv), he co-starred with 'Jennifer Aniston' (qv) in _The Object of My Affection (1998)_ (qv).", "Attended the University of Kansas. Is a member of Sigma Nu Fraternity.", "His parents were both born in England. His father was from Edgware and his mother was raised in Surbiton, both in London. Both of his parents' families were Jewish (they moved from Poland, Belarus, and Russia to England). Paul's paternal grandfather, born Davis Rudnitsky, had anglicized his family's surname from \"Rudnitzky\" to \"Rudd\", while Paul's maternal grandfather, born Louis Goldstein, anglicized his family's surname to \"Granville\". Paul was raised in Reform Judaism, and had a Bar Mitzvah ceremony.", "He is a self-described \"mega-fan\" of the television series _Lost (2004)_ (qv). He volunteered to interview cast member 'Emilie de Ravin' (qv), whom he has never met, for Interview magazine because of his love for the series.", "Has two children with 'Julie Rudd' (qv): Jack Rudd (born 2006) and daughter Darby Rudd (born 2010).", "Friends with television writer 'Rob Thomas' (qv) and 'Jon Hamm' (qv).", "He spray painted his name on Shawnee Mission West High School's stage wall. Another ex-Shawnee Mission West student was 'Jason Sudeikis' (qv).", "Came up with the idea of the \"'Kelly Clarkson' (qv)!\" call-out during 'Steve Carell' (qv)'s infamous chest wax in _The 40-Year-Old Virgin (2005)_ (qv).", "As part of a running gag during his appearances on _Late Night with Conan O'Brien (1993)_ (qv), Rudd often brought a clip from the film _Mac and Me (1988)_ (qv) where wheelchair user Eric ('Jade Calegory' (qv)) flies off a cliff while Mac watches on, instead of showing clips from the actual movie he is there to promote. The only exception was when he came to promote _Knocked Up (2007)_ (qv). 'Judd Apatow' (qv) showed up specifically to make sure Rudd would not do so.", "Improvised the \"You know how I know you're gay?\" sequence in _The 40-Year-Old Virgin (2005)_ (qv) with 'Seth Rogen' (qv).", "While on 'Kevin Pollak' (qv)'s Chat Show (2009), Rudd told 'Kevin Pollak' (qv) that when Rudd was a freshman theater student at the University of Kansas, he appeared in a highly experimental production of 'William Shakespeare' (qv)'s \"Macbeth\" in which there were two different actors playing a \"good\" Macbeth and a \"bad\" Macbeth; Rudd played the \"good\" Macbeth. Many years later, while he was auditioning to appear in the original production of \"Bash: Latter-Day Plays\", he learned that the play's author, 'Neil LaBute' (qv), had seen that \"Macbeth\" while LaBute was a graduate student at KU; Rudd was worried that LaBute would make the connection between Rudd and that \"Macbeth\" and would no longer want him to be in the play. They later became friends and frequent collaborators.", "Was billed under his full name, \"Paul Stephen Rudd\", in his early roles, as there was already an actor in the Screen Actors Guild who took the name \"'Paul Rudd' (qv)\".", "Is an avid fan of the Kansas City Royals. Threw out the first pitch before a game with the cross-state rival St. Louis Cardinals on June 22, 2012.", "Paul's parents were both from London (UK), his father from the Edgware district and his mother from the Surbiton area of southwest London.", "(January 16, 2009) Attended the premiere of _Role Models (2008)_ (qv) at the Pathe De Munt Cinema in Amsterdam, Netherlands.", "(April 8, 2009) Attended the VIP screening of _I Love You, Man (2009)_ (qv) at the Soho Hotel in London, England.", "Has played a character named \"George\" three times: _The Object of My Affection (1998)_ (qv), _How Do You Know (2010)_ (qv) and _Wanderlust (2012)_ (qv) -- the 1st and 3rd movie saw him play opposite _Friends (1994)_ (qv) co-star 'Jennifer Aniston' (qv). Moreover, he played opposite 'Reese Witherspoon' (qv) in the 2nd movie, who coincidentally also stared in two episodes of _Friends (1994)_ (qv) as Gill, 'Jennifer Aniston' (qv) character's younger sister. Rudd and Witherspoon appeared in different seasons and, thus, shared no scenes with each other.", "Has been friends with 'Jennifer Aniston' (qv) since they were age 21, before they both succeeded.", "Received a star on the Hollywood Walk of Fame at 6834 Hollywood Boulevard in Hollywood, California on July 3, 2015.", "Describes himself as a megafan of the television series _Lost (2004)_ (qv), starring 'Evangeline Lilly' (qv). The two appeared together in the film _Ant-Man (2015)_ (qv).", "Huge fan of the rock band Rush. This was not only incorporated into the movie \"I Love You, Man\", but he and costar Jason Siegel (also a huge fan) did a short film as their characters from that film (Peter and Sidney, respectively) for a short outtake film used during Rush's Time Machine Tour. Rudd also did the narrating for Rush:Time Stand Still, the band's 2016 documentary of their last tour.", "Appeared in a Super Nintendo commercial in 1991.", "Paul's dad was an avid Titanic historian which, unfortunately, did not help Paul land a key role in _Titanic (1997)_ (qv) when he auditioned.", "In _Knocked Up (2007)_ (qv), his character makes a reference to seeing _Spider-Man 3 (2007)_ (qv) at the movies. Nine years later, his character Ant-Man in _Captain America: Civil War (2016)_ (qv) literally fights Spider-Man.", "Discovered on the show _Finding Your Roots with Henry Louis Gates, Jr. (2012)_ (qv) that his parents were second cousins. His paternal great-grandmother, Etia/Ethel Gejer/Gayer, was the sister of his maternal great-grandfather, Isaac Gayer.", "Not a relation with 'Emily Rudd' (qv).", "He auditioned for the role of Jack Dawson in _Titanic (1997)_ (qv) as his father had been an avid Titanic historian. During his audition, Rudd was able to rattle off various facts about the ship."], "quotes": ["Theater is the most enriching and thrilling thing to do as an actor. It trumps movies and all that other stuff. People say, \"You must love the instant feedback,\" and we're all attention whores for sure - that's why we choose this profession. But it goes beyond that: There's something magical about a shared experience in a theater, with actors and an audience. I don't know if the audience members realize just how huge a part they play in a production. How they are determines how we are, and when it all works, it's magical.", "There's a feeling of enrichment and challenge when it comes to doing a play, and especially doing, you know, a classical play or a tragic play. In a way, it works a different set of muscles, I guess. But I do love it, and I love great writing, whatever it is, and there are so many great plays, and a lot of the writing in a lot of plays is just stellar, and no one is making movies like that, or if they are, I'm certainly not getting cast in them. But you know, working on a comedy with your friends. Like, I would say that with _Anchorman: The Legend of Ron Burgundy (2004)_ (qv) and _The 40-Year-Old Virgin (2005)_ (qv) and _Wet Hot American Summer (2001)_ (qv), I was working with people who are completely inspiring. I love being around that company, and I try and step up to the level of their game.", "I can, and do, walk the street. No one bothers me or anything, because most people wouldn't know who I am.", "When I was doing _The Shape of Things (2003)_ (qv), which we'd done as a play, it was just so tired by the time we rolled tape.", "I think there's something great and generic about goldfish. They're everybody's first pet.", "[on _Clueless (1995)_ (qv)] It's really cool being in a movie that I think was a seminal movie for a lot of kids. When we were shooting it, we all hoped that [Clueless] would fall into that kind of pantheon of movies like 'John Hughes' (qv) made, or that really struck a chord with us when we were teenagers - and that years after it was released that we all kind of felt that it had. It actually had achieved that status for a lot of people. What a cool thing it is to be involved in something that attains that level of importance in a lot of kids' lives. So keeping that in mind, I certainly don't tire talking about that if people want to hear about it. It isn't one of those things where it's like \"I've moved past that! I've done other things!\". I don't feel that way about anything. I've done good and bad. I tend to be like \"Oh, ask me about something that I was in whether it was something that was good or something that was just terrible.\" I'll talk about either of them freely.", "[on the role of \"Ned\" in _Our Idiot Brother (2011)_ (qv)] I think this character is actually very smart. [He] is living his life the way he wants to. People call him an idiot because he's loving and he's sincere. But he made the decision to be that way and, if he can do it, maybe others can rise to the occasion.", "I don't consider myself a comedian because I don't really concern myself too much with jokes. I think I've dealt with any kind of trauma in my life with humor, and I was a fan of comedians and comedy growing up. I still am. But I never had that thing where, after Anchorman or something, I was \"Okay, now I want to play a serial killer\" or \"Now I want to do something totally different.\" That seemed kind of false to me.", "A movie like _I Love You, Man (2009)_ (qv) is certainly a comedy. But a lot of the humor just derives from awkwardness, insecurity and discomfort - all stuff I relate to. It's a real thing, and it's not funny to me when I'm feeling it in real life. And it's not funny to the character when he's experiencing that in the movie.", "[on his Jewish identity] My whole family is Jewish; my wife, Julie, is Jewish - there isn't anyone in my family who isn't Jewish. I was bar mitzvahed Reform; we were pretty laid back, but it's like, oh yeah, I went to synagogue. I know what it's like to look for matzoh. [laughs] I know the culture and I know the food. I know what a Haggadah is! I know these things, and I did a play many years ago [in 1997] called \"The Last Night at Ballyhoo\", which was a new play at the time, about Eastern European Jews and the anti-Semitism they faced by German Jews in the South. Alfred Uhry, the playwright, became somewhat of a surrogate father to me in New York - I live in New York still and he does, too. And every seder at Alfred's house he would say, \"You know, if you are Jewish, it almost doesn't even matter how religious you are. If you're Jewish, it's just in the marrow of your bones.\" We have a lineage that is so many thousands of years old, that you just relate. It is a tribe; it's like \"Oh, yeah, that's my team,\" and I feel that for sure."], "birth date": "1969-04-06", "birth notes": "Passaic, New Jersey, USA", "_actorID": "76", "_source": "IMDB", "actorID": "0748620", "created_utc_dt": "08/26/2019, 21:54:38"}