{"headshot": "https://m.media-amazon.com/images/M/MV5BMTM0ODU5Nzk2OV5BMl5BanBnXkFtZTcwMzI2ODgyNQ@@._V1_UY98_CR1,0,67,98_AL_.jpg", "nick names": ["Mr. Stench", "Colonel"], "birth name": "John Christopher Depp II", "height": "5' 10\" (1.78 m)", "mini biography": ["'Johnny Depp' (qv) is perhaps one of the most versatile actors of his day and age in Hollywood.He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer.Depp was raised in Florida. He dropped out of school when he was 15, and fronted a series of music-garage bands, including one named 'The Kids'. However, it was when he married Lori Anne Allison ('Lori A. Depp' (qv)) that he took up the job of being a ballpoint-pen salesman to support himself and his wife. A visit to Los Angeles, California, with his wife, however, happened to be a blessing in disguise, when he met up with actor 'Nicolas Cage' (qv), who advised him to turn to acting, which culminated in Depp's film debut in the low-budget horror film, _A Nightmare on Elm Street (1984)_ (qv), where he played a teenager who falls prey to dream-stalking demon Freddy Krueger.In 1987 he shot to stardom when he replaced 'Jeff Yagher' (qv) in the role of undercover cop Tommy Hanson in the popular TV series _21 Jump Street (1987)_ (qv).In 1990, after numerous roles in teen-oriented films, his first of a handful of great collaborations with director 'Tim Burton' (qv) came about when Depp played the title role in _Edward Scissorhands (1990)_ (qv). Following the film's success, Depp carved a niche for himself as a serious, somewhat dark, idiosyncratic performer, consistently selecting roles that surprised critics and audiences alike. He continued to gain critical acclaim and increasing popularity by appearing in many features before re-joining with Burton in the lead role of _Ed Wood (1994)_ (qv). In 1997 he played an undercover FBI agent in the fact-based film _Donnie Brasco (1997)_ (qv), opposite 'Al Pacino' (qv); in 1998 he appeared in _Fear and Loathing in Las Vegas (1998)_ (qv), directed by 'Terry Gilliam' (qv); and then, in 1999, he appeared in the sci-fi/horror film _The Astronaut's Wife (1999)_ (qv). The same year he teamed up again with Burton in _Sleepy Hollow (1999)_ (qv), brilliantly portraying Ichabod Crane.Depp has played many characters in his career, including another fact-based one, Insp. Fred Abberline in _From Hell (2001)_ (qv). He stole the show from screen greats such as 'Antonio Banderas' (qv) in the finale to 'Robert Rodriguez' (qv)'s \"mariachi\" trilogy, _Once Upon a Time in Mexico (2003)_ (qv). In that same year he starred in the marvelous family blockbuster _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv), playing a character that only the likes of Depp could pull off: the charming, conniving and roguish Capt. Jack Sparrow. The film's enormous success has opened several doors for his career and included an Oscar nomination. He appeared as the central character in the 'Stephen King' (qv)-based movie, _Secret Window (2004)_ (qv); as the kind-hearted novelist James Barrie in the factually-based _Finding Neverland (2004)_ (qv), where he co-starred with 'Kate Winslet' (qv); and Rochester in the British film, _The Libertine (2004)_ (qv). Depp collaborated again with Burton in a screen adaptation of 'Roald Dahl' (qv)'s novel, _Charlie and the Chocolate Factory (2005)_ (qv), and later in _Alice in Wonderland (2010)_ (qv) and _Dark Shadows (2012)_ (qv).Off-screen, Depp has dated several female celebrities, and has been engaged to 'Sherilyn Fenn' (qv), 'Jennifer Grey' (qv), 'Winona Ryder' (qv) and 'Kate Moss' (qv). He was married to Lori Anne Allison in 1983, but divorced her in 1985. Depp has two children with French singer/actress 'Vanessa Paradis' (qv): Lily-Rose Melody, born in 1999 and Jack, born in 2002. He married actress/producer 'Amber Heard' (qv) in 2015.::mikedavies86 and Sidhartha Shankar"], "spouse": ["'Amber Heard' (qv)::(3 February 2015 - 13 January 2017) ( divorced)", "'Lori A. Depp' (qv)::(24 December 1983 - 7 March 1986) ( divorced)"], "trade mark": ["Deep, whispering voice", "Frequently plays freakishly eccentric outcasts whose oddities are misunderstood by society, and usually have a flamboyant appearance and mannerism. Examples: _Edward Scissorhands (1990)_ (qv), _Ed Wood (1994)_ (qv), _Don Juan DeMarco (1994)_ (qv), _Dead Man (1995)_ (qv), _Fear and Loathing in Las Vegas (1998)_ (qv), _Sleepy Hollow (1999)_ (qv), _Before Night Falls (2000)_ (qv), the \"Pirates of the Caribbean\" films and _Sweeney Todd: The Demon Barber of Fleet Street (2007)_ (qv).", "Frequently works with director 'Tim Burton' (qv)", "Often stars alongside 'Helena Bonham Carter' (qv)", "Dark, intense eyes and highly defined cheekbones", "Known for wearing outlandish clothing and numerous tattoos", "Never watches his own movies"], "trivia": ["Chosen by Empire magazine as one of the \"100 Sexiest Stars in Film History\" (#1). [1995]", "In July 2012, Depp announced he would be co-editor, alongside 'Douglas Brinkley' (qv), of folk singer 'Woody Guthrie' (qv)'s unpublished novel House of Earth. The book was published in 2013.", "Ranked #67 in Empire (UK) magazine's The Top-100 Movie Stars of All Time list. [October 1997]", "Chosen by People (USA) Magazine as one of the 50 Most Beautiful People in the World. [1996]", "Voted Empire's (UK) Sexiest Male Movie Star of All Time. [1995]", "Has twice recorded with British band 'Oasis' (qv). Most notably, he plays lead slide guitar on the track \"Fade In-Out\", from the 1997 album Be Here Now. 'Noel Gallagher' (qv), 'Oasis' (qv)'s lead guitarist, was allegedly too drunk to perform it himself, so celebrity pal Depp stepped in and nailed the lead on one take.", "Arrested for trashing a New York hotel room. Depp claimed that an armadillo was responsible, saying that he had found the animal hidden in a closet and it had gone crazy, wrecking the hotel room before leaping out the window. [1994]", "Ex-fiancées: 'Sherilyn Fenn' (qv), 'Kate Moss' (qv), 'Jennifer Grey' (qv), and 'Winona Ryder' (qv).", "When engaged to 'Winona Ryder' (qv), he had \"Winona forever\" tattooed on his arm. After the broke up, he had the n and a surgically removed to simply say \"Wino forever!\"", "Was the guitarist in a band called The Kids and currently plays in a band called P.", "Adopted Goldeneye, the one-eyed Andalusian horse who played Gunpowder, Ichabod Crane's steed in _Sleepy Hollow (1999)_ (qv), thereby saving him from the glue factory.", "Got his \"Betty Sue\" tattoo May 31, 1988.", "Named one of E!'s Top 20 Entertainers of 2001.", "Chosen #2 on E!'s 25 sexiest entertainers list", "With 'Chuck E. Weiss' (qv), Depp reportedly paid US $350,000 for the Central Nightclub in Los Angeles, California, and turned it into the Viper Room at 8852 Sunset Blvd. Other stars in contention to buy the club in 1993 included 'Arnold Schwarzenegger' (qv) and, separately, 'Frank Stallone' (qv).", "Lists British comedy _The Fast Show (1994)_ (qv) -- renamed \"Brilliant\" for American television -- as his favorite television program of all time. He used to take tapes of the series on tour with him to keep him amused. Made a guest appearance in the last-ever sketch in its last-ever episode.", "Was named one of the 50 Most Beautiful People by People Magazine in 2001.", "Wrote the foreword to Mark Salisbury's biography of 'Tim Burton' (qv), \"Burton on Burton.\" He credits Burton's belief in him for rescuing him from being \"a loser, an outcast, just another piece of expendable Hollywood meat.\"", "Johnny's two children with 'Vanessa Paradis' (qv) have the same names of the two main characters in _Legend (1985)_ (qv): Lily (b. 1999) and Jack (b.2002).", "Gave 'Noel Gallagher' (qv) a white guitar with the letter \"P\" on it, which he regularly plays during 'Oasis' (qv)' gigs. \"P\" is the name of a band that Depp was in.", "Has a song about him by the late famed schizophrenic Chicago street artist 'Wesley Willis' (qv).", "Parents: John Christopher Depp and Elizabeth \"Betty\" Sue Wells. His parents divorced when he was 15.", "He wanted some of his teeth to be gold-capped for _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv) but thought the producers would never agree. He found a dentist and had lots more capped than he wanted. Disney boss 'Michael Eisner' (qv) like them but thought there were way too many and told Depp to remove all but a few.", "Resides in France, Los Angeles, and an island he owns in the Bahamas. Divides his time in France between Meudon, a suburb of Paris and a villa in Plan-de-la-Tour, an hour outside of St Tropez in Southern France.", "Siblings: Danny ('D.P. Depp' (qv)), 'Christi Dembrowski' (qv), and Deborah (Debbie).", "Was People Magazine's Sexiest Man Alive in 2003.", "The building in which Depp's Viper Room is housed was once owned by infamous gangster 'Bugsy Siegel' (qv). It's also where 'River Phoenix' (qv) passed away. The two never appeared in any films together.", "Chosen as E!'s 2003 Entertainer of the Year.", "According to the liner notes for the soundtrack CD of _Once Upon a Time in Mexico (2003)_ (qv), he wrote his own theme music, the music for Sands (Track 9 on the CD).", "Shot all of his scenes in nine days for _Once Upon a Time in Mexico (2003)_ (qv), but after his filming was done he didn't want to leave. So he suggested to 'Robert Rodriguez' (qv) that he play a small part, the priest that 'Antonio Banderas' (qv) talks to in the church, and use his 'Marlon Brando' (qv) impression.", "Reportedly based his portrayal of \"Ichabod Crane\" in _Sleepy Hollow (1999)_ (qv) on \"Withnail\" from _Withnail & I (1987)_ (qv), as played by 'Richard E. Grant' (qv).", "Has been in seven films in which the title contains the name of the character he plays: _Edward Scissorhands (1990)_ (qv), _Cry-Baby (1990)_ (qv), _What's Eating Gilbert Grape (1993)_ (qv), _Ed Wood (1994)_ (qv), _Don Juan DeMarco (1994)_ (qv), _Donnie Brasco (1997)_ (qv) and _Sweeney Todd: The Demon Barber of Fleet Street (2007)_ (qv).", "Persuaded actor 'Rey-Phillip Santos' (qv) to give acting a try.", "Received a Star on the Hollywood Walk of Fame at 7018 Hollywood Boulevard in Hollywood, California on November 19, 1999. 'Tim Burton' (qv) and 'Martin Landau' (qv) were guest speakers.", "Has a niece, Megan; she works for popular online entertainment magazine TYCP.", "Was ranked #5 on VH1's 100 Hottest Hotties.", "Based the character of Captain Jack Sparrow on rock legend 'Keith Richards' (qv) and the Looney Tunes character, Pepe Le Pew.", "Purchased 'Bela Lugosi' (qv)'s Los Angeles home.", "Sports his son's nickname, Jack, tattooed on his arm and a beaded bracelet made by his daughter Lily Rose.", "Is hugely interested in Jack the Ripper. He starred in _From Hell (2001)_ (qv), which was about Jolly Jack.", "Ranked #4 in TV Guide's list of TV's 25 Greatest Teen Idols (23 January 2005 issue).", "Has something in common with actor 'Robert Englund' (qv), famed for portraying dream-stalking Freddy Krueger in the \"Nightmare on Elm Street\" movies. Both of them appeared in the first _A Nightmare on Elm Street (1984)_ (qv), and both had played characters with blades for hands: Englund as Freddy Krueger, and Depp as the title character in _Edward Scissorhands (1990)_ (qv). And, strangely, both of them were born in June, with their birthdays three days apart, and they share the same height, which is 5' 10\".", "A movie buff with a somewhat encyclopedic knowledge of older films, he admits he watches few movies anymore, other than the children's films that his \"kiddies\" prefer. He also enjoys most of them.", "Loves watching animated films with his daughter such as _Shrek (2001)_ (qv) and _Finding Nemo (2003)_ (qv).", "Co-owns a restaurant/club in Paris called 'Man Ray' (qv) (named after avant-garde artist 'Man Ray' (qv)) with 'Sean Penn' (qv) and 'John Malkovich' (qv). The restaurant is located in a renovated theater and serves Tibetan cuisine.", "Premiere Magazine ranked him as #47 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature (2005).", "When he was cast as \"Willy Wonka\" in _Charlie and the Chocolate Factory (2005)_ (qv), many newspapers published headings about \"Depp's Willy\" and \"Deppy's Willy is a Bit Wonkier\".", "Apparently conceived his portrayal of 'Edward D. Wood Jr.' (qv) as a cross between 'Ronald Reagan' (qv) (the wobbly-headed thing), the Tin Man from _The Wizard of Oz (1939)_ (qv), and the voice of 'Casey Kasem' (qv).", "Dropped out of high school at age 16 to pursue a career as a musician.", "As a teen, he and his punk rock/New Wave band \"The Kids\" opened for 'Iggy Pop' (qv), 'Duran Duran' (qv), and 'The B-52's' (qv), among others.", "As a child, he was allergic to chocolate.", "In 2004, 'Renée Zellweger' (qv) accepted the Screen Actors Guild Award for \"Outstanding Performance by a Male Actor in a Leading Role\" on his behalf, because he wasn't present at the awards ceremony", "Learned French to be able to converse with 'Vanessa Paradis' (qv)' parents.", "He also played slide for an acoustic recording of Fade Away, recorded in 1995 for the War Child: Help album.", "Had come into professional contact with the great screen villains 'Vincent Price' (qv) and 'Christopher Lee' (qv). Price co-starred with Depp in _Edward Scissorhands (1990)_ (qv), and Lee co-starred with him in _Sleepy Hollow (1999)_ (qv), _Charlie and the Chocolate Factory (2005)_ (qv) and _Corpse Bride (2005)_ (qv). Oddly, all of them were 'Tim Burton' (qv) films.", "Great admirer of 'Marlon Brando' (qv). He was also good friends with the legendary actor, who described Depp as one of the greatest actors of his generation.", "Although unable to attend, he was awarded the 'Gary Cooper' (qv) Spirit of Montana Award at the 2005 HatcH audiovisual festival in Bozeman, Montana. HatcH honored Depp for his outstanding career and his role as a mentor and inspiration to young and aspiring artists.", "Has portrayed a real-life character in elven films: 'Edward D. Wood Jr.' (qv) in _Ed Wood (1994)_ (qv), Lt. Victor/Bon Bon in _Before Night Falls (2000)_ (qv), 'Hunter S. Thompson' (qv) in _Fear and Loathing in Las Vegas (1998)_ (qv), Insp. Fred Abberline in _From Hell (2001)_ (qv), 'Joseph D. Pistone' (qv)/Donnie Brasco in _Donnie Brasco (1997)_ (qv), George Jung in _Blow (2001)_ (qv), 'J.M. Barrie' (qv) in _Finding Neverland (2004)_ (qv), 'John Wilmot, The Second Earl of Rochester' in _The Libertine (2005)_ (qv), 'Jack Kerouac' (qv) in _The Source: The Story of the Beats and the Beat Generation (1999)_ (qv), 'John Dillinger' (qv) in _Public Enemies (2009)_ (qv) and Whitey Bulger in _Black Mass (2015)_ (qv).", "'Sherilyn Fenn' (qv)'s name is scrawled across his helmet in _Platoon (1986)_ (qv).", "Johnny's family has lived in Kentucky for many generations, and many of his antecedents have lived in the United States, in general, since the 1600s. His ancestry includes English, as well as Irish, Scots-Irish, Scottish, Welsh, French, Dutch, Belgian (Flemish), and German. Also, in 2013, researchers for Ancestry.com established that Johnny has remote African ancestry; they traced his lineage back to Elizabeth Key, a biracial woman, born c. 1630, who was the first woman of African ancestry to successfully sue to emancipate herself from slavery in the North American colonies (she emancipated her son, as well). Johnny has frequently stated that he believes that he has Cherokee, or other recent Native American, ancestry, although this ancestry has never been verified by genealogists. Asked the origin of his last name by 'James Lipton' (qv) on Inside the Actors Studio, Depp stated, perhaps jokingly, that his name means \"idiot\" in German.", "Was listed as a potential nominee on the 2006 Razzie Award nominating ballot. He was suggested in the Worst Actor category for his performance in the film _Charlie and the Chocolate Factory (2005)_ (qv), however, he failed to receive a nomination.", "His ownership of the Viper room ended in 2004 when he signed it over to Amanda Fox, the daughter of his missing partner in the club, Anthony Fox.", "Was voted the Second Greatest Actor (behind 'Marlon Brando' (qv)) in British Channel Channel 4's Greatest Actor Poll.", "His performance as Edward Scissorhands in _Edward Scissorhands (1990)_ (qv)  is ranked #22 on Premiere Magazine's 100 Greatest Performances of All Time (2006).", "His performance as Captain Jack Sparrow in _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv) is ranked #79 on Premiere Magazine's 100 Greatest Performances of All Time (2006).", "He turned down the lead role in _Oz the Great and Powerful (2013)_ (qv) in favour of _The Lone Ranger (2013)_ (qv).", "Ranked #1 in the \"Best Hollywood Signers 2006\" list by \"Autograph Collector\" magazine (May 2006).", "Was close with his grandfather who died when he was seven years old.", "His performance as Captain Jack Sparrow in _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv) is ranked #87 on Premiere Magazine's 100 Greatest Movie Characters of All Time (2006).", "His performance as Edward Scissorhands in _Edward Scissorhands (1990)_ (qv) is ranked #65 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "Ranked #18 on Premiere's 2006 \"Power 50\" list. Had ranked #23 in 2005.", "He was considered for 'Christian Slater' (qv)'s roles in _Robin Hood: Prince of Thieves (1991)_ (qv) and _Mobsters (1991)_ (qv).", "Is the second actor to be nominated for the Oscar in the Lead Actor category in a Disney film (_Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv)). The first was Richard Farnsworth for _The Straight Story (1999)_ (qv).", "He was considered for Dr. Ian Malcolm in _Jurassic Park (1993)_ (qv).", "'Oliver Stone' (qv) seriously considered casting him in 'Charlie Sheen' (qv)'s role in _Platoon (1986)_ (qv), but the studio thought Depp was \"too young.\" Sheen is actually two years younger than Depp!", "He missed out on several roles that went to 'Keanu Reeves' (qv). He was considered for Johnny Utah in _Point Break (1991)_ (qv); he was 'Francis Ford Coppola' (qv)'s original choice for Johnathan Harker in _Bram Stoker's Dracula (1992)_ (qv), but the studio wanted a heartthrob; he turned down the role of Jack Traven in _Speed (1994)_ (qv); and he was the Wachowskis' choice for Neo in _The Matrix (1999)_ (qv), but the studio didn't think he was a big enough name.", "Has been described as the \"jester of cinema, the Method clown.\" His incredibly bizarre on-screen persona brings to mind the off-screen behavior of the late 'Marlon Brando' (qv), who was famously eccentric and quirky once he retired from acting.", "Once painted on a billboard featuring his _21 Jump Street (1987)_ (qv) character because he didn't like his picture or the message the billboard gave. He was stopped by a security guard who actually let him finish what he was doing when he realized it was Johnny's own face.", "As of 2014, has appeared in eight films directed by 'Tim Burton' (qv): _Sweeney Todd: The Demon Barber of Fleet Street (2007)_ (qv), _Charlie and the Chocolate Factory (2005)_ (qv), _Corpse Bride (2005)_ (qv), _Sleepy Hollow (1999)_ (qv), _Ed Wood (1994)_ (qv), and _Edward Scissorhands (1990)_ (qv), _Alice in Wonderland (2010)_ (qv), _Dark Shadows (2012)_ (qv).", "He was good friends with 'Hunter S. Thompson' (qv) until his death. Depp helped to fulfill Thompson's last wish after the writer died. Thompson wanted his remains to be shot out of a 150 foot long canon.", "Born in Kentucky but moved to Florida at age 7.", "He is the youngest of four children.", "Has admitted in interviews that one of his favorite pastimes is watching cartoons (especially _Dave the Barbarian (2004)_ (qv), of whom he is a big fan) with his children.", "Named after his father, John Christopher Depp.", "Was considered for the role of Florentino Ariza in _Love in the Time of Cholera (2007)_ (qv), but director 'Mike Newell' (qv) refused to work with big name Hollywood stars. 'Javier Bardem' (qv) got the role instead.", "Owns a customised 1960's 650cc Triumph Bonneville motorcycle.", "Has two silver teeth.", "Originally cast as John Smith in _Mr. & Mrs. Smith (2005)_ (qv), but turned it down after being overworked with other movies he was shooting.", "Is a great admirer and good friend of 'Tom Baker' (qv).", "His children have the same names as \"Mad\" Jack and Lilly the Mermaid from the movie _Magic Island (1995)_ (qv).", "Was engaged to 'Sherilyn Fenn' (qv), whom he met on the set of the 1985 short student film \"Dummies\" directed by 'Laurie Frank' (qv). Their engagement was broken off after three years and a half.", "Is a fan of 'The Rolling Stones' (qv) and the gypsy musical group 'Taraf de Haidouks' (qv).", "He was considered for Andy Dufrene in _The Shawshank Redemption (1994)_ (qv).", "2007 - Ranked #21 on EW's The 50 Smartest People in Hollywood.", "Was named Empire Magazine's #5 in the list of 100 Sexiest Stars.", "In 2007, it was reported by Forbes Magazine that his earnings for the year 2006 were estimated to be $92 million.", "Was named Top Money Making Star for the second year in a row in the 76th annual Quigley Publishing Co. poll for year 2007.", "Is a godfather of 'Tim Burton' (qv)'s son Billy Ray Burton.", "Donated $2 million to the Great Ormond Street Hospital in London. He gave the gift as thanks for the treatment his daughter Lily-Rose received at the facility in March 2007 after contracting an E. Coli infection that caused kidney failure.", "Was a fan of the British improvisational show _Whose Line Is It Anyway? (1988)_ (qv).", "Good friend of Serbian film director 'Emir Kusturica' (qv).", "Guest with 'Jim Jarmusch' (qv) of Belgrade Film Festival FEST in 1992. With Jarmusch, 'Emir Kusturica' (qv) and Serbian rock 'n' roll band Partybreakers (Partibrejkersi) he held a concert.", "Had a nightclub named after him in Tartu, Estonia. The nightclub was called \"Who wouldn't like 'Johnny Depp' (qv)?\".", "Was originally set to play the lead character Jean-Dominique Bauby in 'Julian Schnabel' (qv)'s movie _The Diving Bell and the Butterfly (2007)_ (qv). However, he dropped from the project due to scheduling conflicts.", "Is good friends with actress 'Helena Bonham Carter' (qv), partner of his best friend 'Tim Burton' (qv).", "Made a voice message for seventeen-year-old British girl who has been in a coma for five months. Parents of the girl asked him to tape a voice message because he's the favorite actor of their daughter and they will play that message to her every day hoping she'll wake up. Depp was touched by the letter and he said that he'll do whatever he can to help. [March 2008]", "Co-wrote the song \"Mary\" by the hard rock band Rock City Angels.", "Was originally supposed to play the on screen version of Billy Loomis in the original version of Scream 2 (1997), but was replaced by 'Luke Wilson' (qv).", "He and 'Vanessa Paradis' (qv) grow grapes and have wine making facilities in their vineyard in Plan-de-la-Tour north of Saint-Tropez.", "Closed down the \"Viper Room\" for two weeks after 'River Phoenix' (qv) died there and he also closed it on every 31 October until 2004 (when he sold his share of the club), which was the date of Phoenix's death.", "'Nicolas Cage' (qv) got him his first acting job.", "Ranked #6 in the 2008 Forbes The Celebrity 100 list.", "Is a fan of the popular British series _Midsomer Murders (1997)_ (qv). He also stated that he would like to make a guest appearance in this long-running show.", "Was originally going to play opposite the English comedian 'Sally Phillips' (qv) in _The Man Who Killed Don Quixote (2018)_ (qv), which 'Terry Gilliam' (qv) was going to direct, but the movie got scrapped.", "Has expressed interest in getting French, British or Australian citizenship when he retires from an active movie career.", "Donated his fee earned for _The Imaginarium of Doctor Parnassus (2009)_ (qv) to the daughter of late 'Heath Ledger' (qv). 'Jude Law' (qv) and 'Colin Farrell' (qv) did the same thing after Depp gave that idea.", "Was considered for the role of Cal McCaffery in _State of Play (2009)_ (qv) after 'Brad Pitt' (qv) dropped out. The role went to 'Russell Crowe' (qv) instead.", "Was considered for the role of Detective Trupo in _American Gangster (2007)_ (qv).", "Was considered one of the top three actors of his generation by 'Dustin Hoffman' (qv), his co-star in _Finding Neverland (2004)_ (qv).", "Based his characterization of 'Edward D. Wood Jr.' (qv) on a mixture of \"the blind optimism of 'Ronald Reagan' (qv), the enthusiasm of \"The Tin Man\" from _The Wizard of Oz (1939)_ (qv) and 'Casey Kasem' (qv)\".", "Turned down the role of Bruce Banner in _Hulk (2003)_ (qv).", "Named beaches on his own island in Bahamas after his once-girlfriend 'Vanessa Paradis' (qv), his children and public figures like 'Hunter S. Thompson' (qv) and 'Marlon Brando' (qv). There is also a patch of water named \"Heath's Place\" after 'Heath Ledger' (qv).", "Was considered for many roles in _Pulp Fiction (1994)_ (qv): Butch Coolidge (which went to 'Bruce Willis' (qv)), Pumpkin/Ringo (which went to 'Tim Roth' (qv)), and Lance (which went to 'Eric Stoltz' (qv)).", "Close friend of 'Abigail Breslin' (qv).", "Is a fan of _Doctor Who (1963)_ (qv) and _Downton Abbey (2010)_ (qv).", "People Magazine's \"Sexiest Man Alive\" in 2009.", "Received the prestigious Career Achievement Award at 2009. Bahamas International Film Festival (BIFF). Festival Patron 'Sean Connery' (qv) presented Depp with his award.", "Attended the Küstendorf Film and Music Festival in Serbia. [January 2010]", "Nominated for Grammy award along with 'Douglas Brinkley' (qv) in the category of Best Album Notes for Gonzo: The Life and Work of Dr. 'Hunter S. Thompson' (qv) Music from the Film. [2010]", "At the 2010 People's Choice 'Awards' (qv), he won the award for Favorite Movie Actor of the Decade. Depp was honored by _Sweeney Todd: The Demon Barber of Fleet Street (2007)_ (qv) co-star 'Sacha Baron Cohen' (qv).", "Was present during the filming of then-girlfriend 'Sherilyn Fenn' (qv)'s movie _The Wraith (1986)_ (qv) and was living in the film crew's hotel with Fenn. [1986]", "While dining at Chicago's famous Gibsons Bar and Steakhouse with a group of friends, including _Public Enemies (2009)_ (qv) co-star 'Marion Cotillard' (qv) and director 'Michael Mann' (qv), Depp dropped a mammoth tip in the amount of $4,000 on a bill for $4,400, in effect, leaving an incredible 90% gratuity. The party of 15 were celebrating a red carpet screening of Depp's then latest release _Public Enemies (2009)_ (qv). [June 2009]", "Is the only actor to appear in 3 of the 10 films to gross $1 billion with _Pirates of the Caribbean: Dead Man's Chest (2006)_ (qv), _Alice in Wonderland (2010)_ (qv) and _Pirates of the Caribbean: On Stranger Tides (2011)_ (qv).", "Appeared on the cover of GQ magazine three times: October '93, August '03 and February '10.", "As of 2011, his favorite characters played are Jack Sparrow, Edward Scissorhands and Ed Wood.", "'Johnny Depp' (qv) was interested in playing \"Arturo Bandini\" in the movie, _Ask the Dust (2006)_ (qv), back in 1993 but they couldn't get financing on it. It was later made and released in 2006 with 'Colin Farrell' (qv) playing \"Arturo\".", "Depp was honored with a life-size statue in Serbia (2010). The statue was unveiled to him by his friend, Serbian director 'Emir Kusturica' (qv).", "His performance as Captain Jack Sparrow in _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv) was ranked at #79 by Premiere Magazine's 100 Greatest Performances of All Time.", "Has amicably separated from 'Vanessa Paradis' (qv), his girlfriend of fourteen years. [June 2012]", "June 2012 won the MTV Generation Award.", "Hasn't yet met his fan, actress 'Tippi Hedren' (qv), even though she named one of her house cats after him. He did act with her son-in-law, 'Antonio Banderas' (qv), in _Once Upon a Time in Mexico (2003)_ (qv) and had a cameo in the feature film version of _21 Jump Street (2012)_ (qv), which featured her granddaughter, 'Dakota Johnson' (qv), in a supporting role.", "Ranked #13 on Empire Online list of the 100 Sexiest Movie Stars in 2013.", "Became a father for the 1st time at age 35 when his [now ex] partner 'Vanessa Paradis' (qv) gave birth to their daughter 'Lily-Rose Depp' (qv) on May 27, 1999.", "Became a father for the 2nd time at age 38 when his [now ex] partner 'Vanessa Paradis' (qv) gave birth to their son John Christopher \"Jack\" Depp II on April 9, 2002.", "According to 'Bob Gale' (qv), he auditioned for Marty McFly in _Back to the Future (1985)_ (qv). \"I looked through the notes, and I said, 'Geez, I don't even remember that we read 'Johnny Depp' (qv)!' So whatever he did, it wasn't all that memorable, I guess!\".", "He turned down the lead role in _Ferris Bueller's Day Off (1986)_ (qv). He has no regrets about missing out on this one.", "He auditioned for the lead role in _Near Dark (1987)_ (qv) that went to 'Adrian Pasdar' (qv).", "He turned down the role of Sam Wheat in _Ghost (1990)_ (qv) in favour of _Edward Scissorhands (1990)_ (qv).", "He was considered for JD in _Thelma & Louise (1991)_ (qv).", "He turned down the role of Jack Dawson in _Titanic (1997)_ (qv).", "He was Disney's first choice to star in _The Rocketeer (1991)_ (qv).", "He was 'James O'Barr' (qv)'s preferred choice to star in _The Crow (1994)_ (qv).", "At one point, he was interested in starring in _Warcraft: The Beginning (2016)_ (qv).", "He was going to star in a 'Howard Hughes' (qv) biopic written and directed by the Hughes Brothers that never got made.", "In March 2016, Depp cut ties with his management company, the Management Group, and accused them of improperly managing his money. The Management Group later sued Depp for unpaid fees and countersued him for damages alleging that Depp was responsible for his own fiscal mismanagement. Depp filed new papers, including receipts from America's Internal Revenue Service (IRS), to have the countersuit dismissed. On July 16, 2018, Deadline reported that Depp and TMG had agreed to settle their lawsuit, and though details of the settlement were not released, both sides were reportedly happy with the outcome.", "Engaged to 'Amber Heard' (qv) [January 17, 2014].", "Suffers from near-sightedness since birth, and is nearly blind in his left eye. He claims that the condition cannot be corrected by surgery.", "It took Depp two years to learn how to play the guitar.", "Depp has said that he wears two silver skull rings to remind him that life is short and every moment needs to be lived to the fullest.", "He and 'Vanessa Paradis' (qv) grew grapes and had wine making facilities in their vineyard in Plan-de-la-Tour north of Saint-Tropez.", "Is good friends with 'Marilyn Manson' (qv), owns the prosthetic breasts Manson wore on the cover of his 1998 album Mechanical Animals, and also played guitar on 'Marilyn Manson' (qv)'s 2012 cover of 'Carly Simon' (qv)'s \"You're so vain\".", "As of 2014, has appeared in three films that were nominated for the Best Picture Oscar: _Platoon (1986)_ (qv), _Chocolate (2000)_ (qv) and _Finding Neverland (2004)_ (qv). Of those, Platoon won in the category.", "He was rumored to star in _Doctor Strange (2016)_ (qv).", "He has made six films with 'Helena Bonham Carter' (qv): _Charlie and the Chocolate Factory (2005)_ (qv), _Corpse Bride (2005)_ (qv), _Sweeney Todd: The Demon Barber of Fleet Street (2007)_ (qv), _Alice in Wonderland (2010)_ (qv), _Dark Shadows (2012)_ (qv) and _The Lone Ranger (2013)_ (qv).", "He has made six films with 'Christopher Lee' (qv): _Sleepy Hollow (1999)_ (qv), _Charlie and the Chocolate Factory (2005)_ (qv), _Corpse Bride (2005)_ (qv), _Alice in Wonderland (2010)_ (qv), _Hugo (2011)_ (qv) and _Dark Shadows (2012)_ (qv).", "Namechecked in the opening lines of the song \"Mermaid\" by US band Train (2012): \"Can't swim so I took a boat / To an island so remote / Only 'Johnny Depp' (qv) has ever been to it before\".", "He was considered for the role of 'Charles Chaplin' (qv) in _Chaplin (1992)_ (qv) before 'Robert Downey Jr.' (qv) was cast.", "_Black Mass (2015)_ (qv) is his favorite of his own films.", "Good friends with: 'Christina Ricci' (qv), 'Helena Bonham Carter' (qv), 'Abigail Breslin' (qv), 'Freddie Highmore' (qv), 'Orlando Bloom' (qv) and 'Robert Downey Jr.' (qv).", "In 2015 Johnny, as part of the rock group 'Hollywood Vampires' (qv), released an album, \"'Hollywood Vampires' (qv)\", with fellow band members 'Joe Perry' (qv) and 'Alice Cooper' (qv). The album featured guest appearances by 'Dave Grohl' (qv), 'Paul McCartney' (qv) and 'Christopher Lee' (qv).", "In 2015 'Johnny Depp' (qv), 'Aerosmith' (qv) guitarist 'Joe Perry' (qv) and 'Alice Cooper' (qv) formed the band 'Hollywood Vampires' (qv). The name of the band was derived from \"The 'Hollywood Vampires' (qv)\", a celebrity drinking club that was formed in the 1970s by 'Alice Cooper' (qv) and included members such as 'Ringo Starr' (qv) of 'The Beatles' (qv) and 'Keith Moon' (qv) of 'The Who' (qv).", "His $3 Million Kentucky Horse Farm Failed to Sell at Auction Due to Low Bids.[Sept 2017].", "On May 24 2016, Johnny as part of the band 'Hollywood Vampires' (qv), embarked on their first concert tour across Europe.", "'Amber Heard' (qv) filed for divorce from 'Johnny Depp' (qv) on 25th May, 2016. The following day, Heard was granted a temporary domestic violence restraining order against Depp in relation to a physical altercation between the couple, which resulted in Heard filing for divorce in the first place. Heard was granted $7 million as part of the former couple's divorce, all of which she claimed she would donate to charity within a year of receiving it.", "A big fan of 'Buster Keaton' (qv), having a large collection of his films.", "The judge had denied Depp's request to impose a $100,000 sanction on Heard for allegedly delaying the divorce proceeding.", "Will not allow paparazzi to take photos of his children because he feels they didn't ask for the celebrity attention.", "Considers renting a silent movie theater for a date with 'Vanessa Paradis' (qv) as the most romantic gesture he's ever done for a date.", "He was considered for 'John Leguizamo' (qv)'s role in _To Wong Foo Thanks for Everything, Julie Newmar (1995)_ (qv).", "He met with 'Terrence Malick' (qv) to discuss a part in _The Thin Red Line (1998)_ (qv).", "He was considered for Mikael Blomkvist in _The Girl with the Dragon Tattoo (2011)_ (qv).", "He was considered for Max in _Collateral (2004)_ (qv).", "He was considered for 'Tom Cruise' (qv)'s role in _Legend (1985)_ (qv), _Interview with the Vampire: The Vampire Chronicles (1994)_ (qv), and _Jerry Maguire (1996)_ (qv).", "He was originally considered for M. Gustave in _The Grand Budapest Hotel (2014)_ (qv).", "He turned down 'William Baldwin' (qv)'s roles in _Backdraft (1991)_ (qv) and _Sliver (1993)_ (qv).", "He was considered for Artemus Gordon in _Wild Wild West (1999)_ (qv).", "He was considered for 'Michael J. Fox' (qv)'s role in _Mars Attacks! (1996)_ (qv).", "He was considered for 'Will Smith' (qv)'s roles in _Independence Day (1996)_ (qv), _Collateral Beauty (2016)_ (qv), and _Suicide Squad (2016)_ (qv).", "He was so ashamed of _Private Resort (1985)_ (qv) that he and 'Rob Morrow' (qv) swore a pact to destroy every copy.", "He was the first choice for Jackie Boy in _Sin City (2005)_ (qv). The part went to 'Benicio Del Toro' (qv), his costar in _Fear and Loathing in Las Vegas (1998)_ (qv).", "Along with 'Sean Penn' (qv), 'John Malkovich' (qv) and 'Mick Hucknall' (qv), he co-owned the French restaurant-bar 'Man Ray' (qv), located near the Champs-Élysées in Paris.", "He was going to star in _American Psycho (2000)_ (qv) with 'Stuart Gordon' (qv) directing a script by 'Bret Easton Ellis' (qv).", "He was considered for Pennywis in _It (2017)_ (qv).", "He was considered for John Nash in _A Beautiful Mind (2001)_ (qv).", "He turned down 'Woody Harrelson' (qv)'s role in _Indecent Proposal (1993)_ (qv).", "He was considered for 'Val Kilmer' (qv)'s roles in _Batman Forever (1995)_ (qv), _Heat (1995)_ (qv) and _The Saint (1997)_ (qv).", "He was considered to star in _Speed Racer (2008)_ (qv) when the project was in its early development in the 1990s.", "He was considered for Zaphod Beeblebrox in _The Hitchhiker's Guide to the Galaxy (2005)_ (qv).", "Intensely protective of his private life, _Inside the Actors Studio (1994)_ (qv) is one of the few televised interviews he's granted.", "In _Nick of Time (1995)_ (qv) played a character from Santa Maria, California. He appeared again in _Pirates of the Caribbean: At World's End (2007)_ (qv) which was filmed in a suburb called Nipomo.", "Currently dating 'Lisa Marie Presley' (qv) (not to be confused with Depp's _Ed Wood (1994)_ (qv) co-star 'Lisa Marie' (qv)). [July 2018]", "He was arrested in 1999 for brawling with paparazzi outside a restaurant while dining in London with 'Vanessa Paradis' (qv).", "He was adopted as an honorary son by LaDonna Harris, a member of the Comanche Nation, on May 22, 2012, making him an honorary member of Harris's family but not a member of any tribe.", "In 2012, disabled UC Irvine medical professor Robin Eckert sued Depp and three security firms, claiming to have been attacked by his bodyguards at a concert in Los Angeles in 2011. During the incident, she was allegedly hand-cuffed and dragged 40 feet across the floor, resulting in injuries including a dislocated elbow. She argued in court that, as the security guards' direct manager, Depp failed to intervene, even though he did not actively take part in the battery. In October 2012, it was decided that Eckert could seek compensation and punitive damages from Depp, with a trial date set for August 12, 2013. Depp ultimately settled with Eckert for an undisclosed sum.", "In July 2018, he was sued for allegedly punching a crew member twice in the ribs during a foul-mouthed tirade on the set of _City of Lies (2018)_ (qv). Court documents stated that the actor \"reeked of alcohol\" and took drugs on set.", "He was arrested in Vancouver in 1989 for assaulting a security guard after the police were called to end a loud party at his hotel room."], "quotes": ["Anything I've done up till 27 May, 1999 was kind of an illusion, existing without living. My daughter, the birth of my daughter, gave me life.", "[on the money he makes] You use your money to buy privacy because during most of your life you aren't allowed to be normal.", "I don't pretend to be captain weird. I just do what I do.", "[on 'Vincent Price' (qv)] One of the most incredible moments I've ever had was sitting in Vincent's trailer . . . I was showing him this first-edition book I have of the complete works of ['Edgar Allan Poe' (qv)], with really amazing illustrations. Vincent was going nuts over the drawings, and he started talking about _The Tomb of Ligeia (1964)_ (qv). Then he closed the book and began to recite it to me in this beautiful voice, filling the room with huge sounds. Such passion! I looked in the book later, and it was verbatim. Word perfect. It was a great moment. I'll never forget that.", "The only creatures that are evolved enough to convey pure love are dogs and infants.", "One of the greatest things I've ever seen happen was the morning I opened the newspaper and it said that some very powerful government officials had decided to change the name of \"french fries\" to \"freedoom fries\" and \"french toast\" to \"freedom toast\". It was impressive. I wanted to write a letter to them just to thank them, just for proving globally that they were absolute imbeciles.", "America is dumb. It's like a dumb puppy that has big teeth that can bite and hurt you, aggressive. My daughter is four, my boy is one. I'd like them to see America as a toy, a broken toy. Investigate it a little, check it out, get this feeling and then get out.", "Taken in context, what I was saying was that, compared to Europe, America is a very young country and we are still growing as a nation. It is a shame that the metaphor I used was taken so radically out of context and slung about irresponsibly by the news media. There was no anti-American sentiment. In fact, it was just the opposite. I am an American. I love my country and have great hopes for it. It is for this reason that I speak candidly and sometimes critically about it. I have benefited greatly from the freedom that exists in my country and for this I am eternally grateful.", "France and the whole of Europe have a great culture and an amazing history. Most important thing, though, is that people there know how to live! In America they've forgotten all about it. I'm afraid that the American culture is a disaster.", "[on his character in _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv)] Captain Jack Sparrow is like a cross between 'Keith Richards' (qv) and Pepe Le Pew.", "I can remember when I finished _Edward Scissorhands (1990)_ (qv), looking in the mirror as the girl was doing my make-up for the last time and thinking -- it was like the 90th or 89th day of shooting -- and I remember looking and going, \"Wow, this is it. I'm saying goodbye to this guy, I'm saying goodbye to Edward Scissorhands\". You know, it was kind of sad. But in fact, I think they're all still somehow in there.", "With any part you play, there is a certain amount of yourself in it. There has to be, otherwise it's just not acting. It's lying.", "The only gossip I'm interested in is things from the Weekly World 'News' (qv) 'Woman's bra bursts, 11 injured.' That kind of thing.", "I'm an old-fashioned guy . . . I want to be an old man with a beer belly sitting on a porch, looking at a lake or something.", "[when asked by 'James Lipton' (qv) on _Inside the Actors Studio (1994)_ (qv) what attracts him to funny hats] I don't know, maybe I just read too much 'Dr. Seuss' (qv) as a kid.", "[asked if he is a romantic] Am I a romantic? I've seen _Wuthering Heights (1939)_ (qv) ten times. I'm a romantic.", "[about being dragged behind a carriage in the woods on _Sleepy Hollow (1999)_ (qv)] I wasn't afraid of getting hurt. I was just afraid that the horses may relieve themselves on the journey.", "I'm shy, paranoid, whatever word you want to use. I hate fame. I've done everything I can to avoid it.", "When kids hit one year old, it's like hanging out with a miniature drunk. You have to hold onto them. They bump into things. They laugh and cry. They urinate. They vomit.", "This is a rumor-filled society and if people want to sit around and talk about whom I've dated, then I'd say they have a lot of spare time and should consider other topics... or masturbation.", "The character I've played, that I've responded to, there has been a lost-soul quality to them.", "Sure, I find it touching, honestly, but awards are not as important to me as when I meet a ten-year-old kid who says, \"I love Captain Jack Sparrow\" . . . that's real magic for me.", "The term \"serious actor\" is kind of an oxymoron, isn't it? [Like] \"Republican party\"  \"airplane food\".", "On a film you start to get closer and closer with the people you're working with, and it becomes like this circus act or this travelling family.", "If you turn on the television and see the horrors that are happening to people in the world right now, I think there's no better time to strive to have some kind of hope through imagination. I think it's a time to close your eyes and try to make a change, or at least hope to make a change, or we're going to explode.", "I suppose nowadays it's all a question of surgery, isn't it? Of course the notion is beautiful, the idea of staying a boy and a child forever, and I think you can. I have known plenty of people who, in their later years, had the energy of children and the kind of curiosity and fascination with things like little children. I think we can keep that, and I think it's important to keep that part of staying young. But I also think it's great fun growing old.", "All the little films I've done that were perceived by Hollywood as these obscure, weird things, I always thought could appeal to a larger audience. I mean, box office is such a mystery to me that I can't . . . you know . . . I have enough trouble doing my own gig.", "[asked why he hides his looks behind strange wigs, fake teeth and girly squeals] I think it's an actor's responsibility to change every time. Not only for himself and the people he's working with, but for the audience. If you just go out and deliver the same dish every time . . . it's meat loaf again . . . you'd get bored. I'd get bored.", "We had been shooting [_Charlie and the Chocolate Factory (2005)_ (qv)] for about a month, and I was beginning to get nervous because there weren't any phone calls. I called my agent and asked, \"Has no one called from the studio to complain or say, 'Hey, what's he doing?' or 'Hey, he's freaking us out?' \" And when she said, \"No\", I thought, \"Christ, I'm not doing enough! Something's wrong!\" Then some of the studio brass came over to the set, and they were sitting in my trailer and I was all decked out as Wonka with the little bangs. And I just had to know. So I said, \"Okay, who was the first one, when you started seeing the dailies, that got a little worried?\" And there was this beautiful 30-second silence. And [Warner Bros. president] 'Alan Horn' (qv) finally said, \"Yeah, that was me\". I felt better instantly.", "[on 'Gene Wilder' (qv)'s comment on the remake of _Willy Wonka & the Chocolate Factory (1971)_ (qv)] Hearing about that was disappointing, but I can understand where he's coming from, I guess. The one thing I didn't understand was that apparently he was quoted as saying, \"Well, they just did this for money\". Well, hey, man, where have you been? When didn't they ever do anything for money? Nobody's ever made a film in the history of cinema where they weren't expecting some return on their dough.", "[on his daughter, Lily-Rose] I see this amazing, beautiful, pure angel-thing wake up in the morning, and nothing can touch that. She is the only reason to wake up in the morning, the only reason to take a breath. Everything else is checkers.", "[on director 'Tim Burton' (qv)] He can ask me everything. If he wants me to have sex with an aardvark in one of his next movies, then I will do that.", "[on reactions to his directorial debut] You know what was traumatizing, what was very, very strange in terms of this film I directed a few years back called _The Brave (1997)_ (qv). Well, I guess I wouldn't say traumatizing, but I would say weird: at the premiere of the film the reception of it was beyond any expectation that I had. I had no idea I'd be looking at ['Bernardo Bertolucci' (qv)] or ['Michelangelo Antonioni' (qv)] sitting there watching my film. And then to receive the applause that my film got, it was so incredible. And then the next day the majority of the American press just turn it into this horrible thing. Once again, everybody is entitled to their opinion, man. Maybe it's a bad film? Maybe it's a good film? To me it's just a film. It's something I needed to make.", "I started out as a guitarist in the early '80s. I hooked up with a guy who idolized 'James Dean' (qv) and he gave me a copy of the Dean biography, \"The Mutant King\", which I thought was really interesting. While reading the book I watched _Rebel Without a Cause (1955)_ (qv), and I thought, \"Wow, this guy really has something\", and I was hooked. I wasn't really into acting at the time - but 'James Dean' (qv) was the catalyst.", "I don't have a mental picture of the houses we lived in because there were so many.", "[on being an uncle] My sister Christi had a baby when I was 17, and I had just heard about crib death. The horrible thing was that it wasn't understood. For some unknown reason the baby would stop breathing. So I would sneak into where the baby was sleeping and put my hand in her crib, hold her little finger, and I'd sleep on the floor like that. It was stupid, I'm sure. But I thought the warmth of my hand might help, that maybe if she felt my pulse it would remind her to breathe.", "'Marlon Brando' (qv) is maybe the greatest actor of the last two centuries. But his mind is much more important than the acting thing. The way that he looks at things, doesn't judge things, the way that he assesses things. He's as important as, uh... who's important today? Jesus, not many people... 'Stephen Hawking' (qv)!", "There's nothing - you know - nothing else like music. Nothing that touches us on that, uh, that deep level. Music can open up so many emotions that we didn't know we had. It's the magical thing about musicals, you know, on the stage or on film or whatever. Love songs. They work so well because music touches us, emotionally, where words alone can't.", "As a teenager I was so insecure. I was the type of guy that never fitted in because he never dared to choose. I was convinced I had absolutely no talent at all. For nothing. And that thought took away all my ambition, too.", "[asked by Rolling Stone if there was a \"gay undercurrent\" in his character Capt. Jack Sparrow in the \"Pirates of the Caribbean' films] Well, there was a great book I read . . . What was it called? \"Sodomy and the Pirate Tradition\". A very interesting book. I wasn't exactly going for that with the character. And Keith is not flamboyant in his actions. Keith is pretty stealth. But with Jack, it was more that I liked the idea of being ambiguous, of taking this character and making everything a little bit . . . questionable. Because women were thought to be bad luck on ships. And these pirates would go out for years at a time. So, you know, there is a possibility that one thing might lead to another.", "['Marlon Brando' (qv)] wanted me to escape movies for a while - \"Take a year off. Go on. Study Shakespeare\". So it's one of the things that keep ricocheting around in my head. He told me that by the time he had got to the point where he felt he could do \"Hamlet\", it was too late. So he said, \"Do it now, do it while you can\". And I would like to do it - although it's one of the more frightening ideas I've had. I think as an actor it is good to feel the fear of failing miserably. I think you should take that risk. Fear is a necessary ingredient in everything I do. But if I do \"Hamlet\" it will probably be in a small theater on a small stage and it will have to be very, very soon because I'm getting a little long in the tooth for it.", "Having kids was a huge change for me. Becoming a father. But I think more than changing, I feel like I've been revealed to myself, I kind of found out who I was. When you meet your child for the first time and you're looking at this angel, you start realizing what an idiot you've been for so many years and how much time you've wasted. As far as being feet-on-the-ground, once again my kids and ['girlfriend 'Vanessa Paradis' (qv)] have given me a proper foundation. A sense of home that I never had in my life, a real sense of a place to be.", "I loved playing _Edward Scissorhands (1990)_ (qv) because there's nothing cynical, jaded or impure about him. It's almost a letdown to look in the mirror and realize I'm not Edward.", "What I said was, the United States of America is a young country compared to Europe, compared to, you know, other countries. We're young. We're 200 and something years old.", "[on director 'Tim Burton' (qv)] What more can I say about him? He is a brother, a friend, my godson's father. He is a unique and brave soul, someone that I would go to the ends of the earth for, and I know, full and well, he would do the same for me.", "(on preparing to sing as Sweeney Todd] It's a bit like jumping into cold water. There's no preparing, you just do it.", "[about _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv)] It was mentioned that they were considering a movie based on the Pirates of the Caribbean ride, and I said I was in. There was no screenplay, no director, nothing. For some unknown reason, I just said I was in.", "[about girlfriend 'Vanessa Paradis' (qv)] I pretty much fell in love with Vanessa the moment I set eyes on her. As a person, I was pretty much a lost cause at that time in my life. She turned all that around for me with her incredible tenderness and understanding.", "I love our house in the country. I can walk to the nearby village and have a coffee and no one pays any notice. I'm just another dad with my daughter on my knee. The time I've spent in France with [girlfriend 'Vanessa Paradis' (qv)] has solidified my belief that I can keep a major distance from Hollywood and still keep in the game. Acting is my living, but I don't want to live it. Living in France is the first time I can honestly say I feel at home.", "There's a drive in me that won't allow me to do certain things that are easy. I can weigh all the options, but there's always one thing that goes: \"Johnny, this is the one.\" And it's always the most difficult - it's always the one that will cause the most trouble.", "All the amazing people that I've worked with - 'Marlon Brando' (qv), 'Al Pacino' (qv), 'Dustin Hoffman' (qv) - have told me consistently: don't compromise. Do your work, and if what you're giving is not what they want, you have to be prepared to walk away.", "[about _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv)] I only wanted to be in a movie that my kids could see.", "I had never experienced that before. And it's been fun to visit Hollywood and talk to studios as a bankable actor for a change.", "I've been around long enough to know that one week, you're on the exclusive list of guys who can open a movie, and then the next week, you're off the list. It's been a fun ride, and I'm enjoying it for all it's worth.", "[about 'Edward D. Wood Jr.' (qv)] Like him I also grew up feeling like an obtuse piece of machinery. It was the same feeling I had about Edward Scissorhands.\"", "(about his mother, Betty Sue) Years and years I watched her wait tables. I'd count her change at the end of the night. She cursed like a sailor, played cards and smoked cigarettes.", "I was a weird kid. I wanted to be 'Bruce Lee' (qv). I wanted to be on a SWAT team. When I was five, I think I wanted to be Daniel Boone.", "My cousins had a gospel group and they came down and played gospel songs, and that was the first time I ever saw an electric guitar. I got obsessed with the electric guitar, so my Mom bought me one from them for $25. I was about twelve years old. Then I locked myself in a room for a year and taught myself how to play, learned off records, and then I started playing in little garage bands. The first group I was ever in was called Flame. Then I was in The Kids. They were the ones who moved to Hollywood.", "[about living in the small town of Miramar as a kid] Miramar was like Endora, the town in _What's Eating Gilbert Grape (1993)_ (qv). It had two identical grocery stores opposite each other and nothing much ever happened there.", "At first we'd wear T-shirts that said \"Flame\" on them. At 13 I was wearing plain T-shirts. Then I used to steal my mom's clothing. She had all these crushed velvet shirts with French-cut sleeves. And, like, seersucker bell bottoms. I dreamed of having platforms, but couldn't find any.", "I'd been in high school three years, and I may have just walked in yesterday. I had, like, eight credits. I was in my third year of high school and I didn't want to be there. I was bored out of my mind and I hated it.", "I hung around with bad crowds. We used to break and enter places. We'd break into the school and destroy a room or something. I used to steal things from stores.", "[about one of his old teachers asking for an autograph] I mean, what was I supposed to say? He'd failed me. I remember one time this teacher yelled at me so heavily in front of the entire class. He didn't have any time for me then, and now, all of a sudden, he wants my autograph? They all thought I was going to end up a drug addict, in jail.", "I started smoking at 12, lost my virginity at 13 and did every kind of drug there was by 14. Pretty much any drug you can name, I've done it. I wouldn't say I was bad or malicious, I was just curious. I certainly had my little experiences with drugs. Eventually, you see where that's headed and you get out.", "I played rock'n'roll clubs in Florida. I was underage, but they would let me come in the back door to play, and then I'd have to leave after the first set. That's how I made a living, at about $25 a night. At times we could make $2,100 - we used to make that for the entire group and the road crew, which is a lot.", "My father left and my mother was deeply hurt and sick physically and emotionally. That's a very traumatic thing for a family to go through, so we all pulled together and did the best we could.", "These are the most important people in my life. You know, I would die for these people. If someone were to harm my family or a friend or somebody I love - I would eat them. I might end up in jail for 500 years - but I would eat them.", "I remember carving my initials on my arm and I've scarred myself from time to time since then. In a way your body is a journal and the scars are sort of entries in it.", "I can remember my parents fighting and us kids wondering who was going to go with whom if they got divorced.", "[about his first marriage] I guess I have very traditional kinds of sensibilities about that kind of stuff - you know, a man and a woman sharing their life together and having a baby, whatever - and I think for a while I was trying to right the wrongs of my parents because they split up when I was a kid, so I thought I could do it differently - make things work. I had the right intentions, but the wrong timing - and the wrong person. But I don't regret it; I had fun and I learned a lot.", "You know, I was married, when I was 20. It was a strong bond with someone, but I can't necessarily say I was in love. That's something that comes around once, man, maybe twice if you're lucky. And I don't know that I experienced that, let's say, before I turned 30.", "[about a scene in _A Nightmare on Elm Street (1984)_ (qv)] I love this stuff. The kid falls asleep and it's all over, he's sucked right into the bed and spit out as blood. His bloody body rises straight out and then topples over, too. I heard somebody talk about having a dummy shot out of the bed, but I said, \"Hey, I want to do this! It'll be fun! Lemme do it!\"", "[about _A Nightmare on Elm Street (1984)_ (qv)] I was just not what [director 'Wes Craven' (qv)] had written for the story. He had written the part of a big, blond, beach jock, football player guy. And I was sort of emaciated, with old hairspray and spiky hair, earrings, a little catacomb dweller. Then five hours later that agent called me and said, \"You're an actor\".", "[about his career as a salesman] The last couple of times I did it, I just said, \"Listen, you don't want this stuff, man\".", "[about his job of selling pens over the phone] I was working a day job selling ink pens over the phone and getting maybe $100 a week, but I thought, \"What have I got to lose?\"", "[about The Kids in Hollywood] It was horrible. There were so many bands it was impossible to make any money. So we all got side jobs. We used to sell ads over the telephone. Telemarketing. We got $100 a week. We had to rip people off. We'd tell them they'd been chosen by so-and-so in their area to receive a grandfather clock. They would order $500 worth of these fucking things and we would send them a cheap grandfather clock. It was horrible.", "I like to think that I'm very considerate of other people's feelings, and I was trained as a small child to always try my best at everything. I think I'm a mixture of romantic and realist. I'm a realist about some stuff, but I also wholeheartedly believe that in a society where people get divorced every five minutes you can still stay married for 50 or 75 years. It's been done and it's beautiful. When I see a couple celebrating their 75th wedding anniversary, I just think that it's totally incredible.", "(About his early relationship) I don't regret any of them. I had a good time. Most of what's been written about me has been completely false. People have created an image that has absolutely nothing to do with me, and they have the power to sell it, to shove it down the throats of people. I'm an old-fashioned guy who wants marriage and kids.", "[on _Platoon (1986)_ (qv)] I went to read for 'Oliver Stone' (qv), and Oliver scared the shit out of me! I read for him and he said, \"OK, I need you for ten weeks in the jungle.\" It was a great experience.", "I made some shitty movies when I was first starting out, but I'm not embarrassed by them, especially as I didn't think I was going to be an actor - I was just trying to make some money. I was still a musician. When I first started out I was just given the opportunity, and there was no other way to make that kind of money. Apart from crime. I couldn't believe how much they were paying me.", "[on the difficulties of his singing in _Sweeney Todd: The Demon Barber of Fleet Street (2007)_ (qv)] The one [song] that was probably the most challenging was \"Johanna [Act II]\"... And as far as I was concerned, when 'Stephen Sondheim' (qv) writes the note and it has to be held for this many beats, you do it. I don't care if you're from Miramar or Kentucky or you're an ass and you don't sing. It doesn't matter. Don't be a pussy, you fucking hold that note. You can't cheat. You can't whisper. You can't do the 'William Shatner' (qv) thing. You just gotta belt it out. So I really beat myself up, making sure I could hold those notes. In \"Johanna,\" some are, like, twelve beats. That was a bugger. At one point, I was very close to passing out-- I got dizzy and saw black. But that's what Sondheim wrote, so that's what you do.", "(About teen magazines) They had come to me in the beginning and said, \"We want you to do these interviews and stuff for these magazines,\" and I said, \"What magazines?\" And they said, \"Sixteen! Teen Beat! Teen Dream! Teen Poop! Teen Piss! Teen Shit!\"", "(About Peter DeLuise, friend from 21 Jump Street) If Peter wasn't on the show I would have gone insane or jumped into the river. He's my savior.", "(About his character in 21 Jump Street) Hanson is not someone I'd want to have pizza with. I don't believe in having undercover cops in high school - it's spying. The only thing I have in common with Tom Hanson is that we look alike.", "(About 21 Jump Street) I got a call from my agents, who said, \"These people want you to come and read for this TV thing.\" And I said, \"No, no, no, no, no\". I didn't want to sign some big contract that would bind me for years. So they hired somebody else to do it, and they fired him after about a month, and then they called me again and said, \"Would you please come in and do it?\" My agent said, \"The average span of a TV series is thirteen episodes, if that. One season.\" So I said OK.", "When I see someone who just follows their dream and succeeds, and just does basically what they want to do and doesn't have to answer to anyone, obviously not harming anyone, that's great.", "Now it's starting to get to profound [things]. She sat me down the other day, sort of like, \"Dad, I need to have a talk with you.\" You know, she's four. I said, \"Alright sweetheart, what do you got?\" She said, \"I just want to ask you three questions.\" I said, \"Ok, what do you got?\" She said, \"Is God afraid of dogs?\" I thought about it. I said, \"No honey, I don't think he is. Probably not.\" She said, \"Ok. Has He seen the dinosaurs?\" I said, \"Yes, I think he has.\" And then she said, \"Does God have a maid?\" And I didn't know how to answer it!", "(About 21 Jump Street) I'm afraid I started navel-gazing. I started thinking like, There are 365 days in a year, but for 275 of those days, I'm saying someone else's words. And they're bad words. And I only get to say my own for 90 days.", "Kids write to me and say they are having these problems or they want to commit suicide or something. It's scary. I have to say, Listen, I'm just an actor, not a professional psychologist. If you need help, you should go and get it.", "I've gotten weird letters, suicide letters, girls threatening to jump if I don't get in touch with them. So you think, This is bullshit, but then you think, What if it's not? Who wants to take that chance? I write them back, tell them to hang in there - if things are that bad they have to get better. But I'm not altogether stable myself, so who am I to give advice?", "It's scary. It's terrifying. People come up to you and start crying. Everybody compares everyone to 'James Dean' (qv) these days. If you're lucky they mention Brando ['Marlon Brando' (qv)] or De Niro ['Robert De Niro' (qv)]. They invite you to put on an instant image.", "(About teen magazines) Those are things that are out of my control. It's very nice to be appreciated, but I'm not really comfortable with it. I've never liked being the centre of attention. It comes with the territory.", "(about his high school) I was around 15 when I left. I went back 2 weeks later, thinking \"You know what, this is crazy, I should go back.\" So I went back, and I talked to the dean of the school, and he said, \"Johnny... we don't *want* you to come back.\" He said, it was really sweet actually, \"You have this music thing, I think you should run with it. That's your passion, you should go with it.\" So I did.", "[on buying a private island] Money doesn't buy you happiness, but it buys you a big enough yacht to sail right up to it.", "[on 'Elizabeth Taylor' (qv)] The best old-school dame I've ever met. A regular, wonderful person.", "I have a really soft spot for blondes. I find myself attracted to blonde women the most.", "I'm not sure I could give up pork. Steak, OK. Maybe hamburgers. But nothing in the world can make me stop eating swine. I mean, I had a great-grandmother, Mimmy, who ate the greasiest food you ever saw and chewed tobacco till the day she died, and she lived to be 102.", "I pray on airplanes. I get instant religion during takeoff, then when we're safely in the air I sit there thinking about the fact that any little thing that goes wrong could send us crashing to the ground.", "(On growing up) We moved like gypsies. From the time I was five until my teens we lived in 30 or 40 different houses. That probably has a lot to do with my transient life now. But it's how I was raised so I thought there was nothing abnormal about it. Wherever the family is, that's home. We lived in apartments, on a farm, in a motel. Then we rented a house, and one night we moved from there to the house next door. I remember carrying my clothes across the yard and thinking, This is weird, but it's an easy move.", "(1996 - On fame) If there's anything I really want, it's privacy. You do get to where your money can help your family, and that's a great thing. You can buy that wristwatch you want, too. But mostly you now have to pay for simplicity. You use your money to buy privacy because during most of your life you aren't allowed to be normal. You're on display, always looked at, which puts you at a disadvantage for the people looking at you know that it's you. They say, \"It's you!\" But you don't know them. That's bad for an actor because the most important thing you can do is observe people. And now you can't because you're the one being observed.", "(On first seeing himself on-screen) I got sick. I went to see dailies on _A Nightmare on Elm Street (1984)_ (qv). I was 21, and didn't know what was going on. It was like looking in a huge mirror. It wasn't how I looked that bothered me, though I did look like a geek in that movie. It was seeing myself up there pretending.", "(Joking about 'Ryan Reynolds' (qv) taking over the title \"Sexiest Man Alive 2010\") I feel emasculated. I feel like I've been beaten down like some horrible ... you know, like some pathetic harp seal. But, I mean, that's how it goes, isn't it? I think I can work my way forward, but will I try for it again? No. ... I worked so hard to gain that title.", "[1995] You can never, ever understand fully what a woman's life might be like until you step into her shoes. The same thing goes for transvestites. [Talking about his role in _Ed Wood (1994)_ (qv)]", "[1995] I think the stuff I do could be accepted by the wide movie going audience if the audience weren't programmed to think in certain ways...but maybe we'd be better off if there were more films around that made you think, made you have to use your own brain to figure things out. That's why people don't read any more. They don't chew their own food. They just want to swallow it, get it fucking down then move on. [When asked if it bugs him that the Studios' sell films as _What's Eating Gilbert Grape (1993)_ (qv) as \"small and \"special\"]", "[on what he hopes for in his future career] Smooth sailing with no big ups, no big downs. Just full steam ahead. {Maybe a geriatric Jack?] Yeah, I think they could wheel me in. Interestingly enough, with a character like Captain Jack, you just feel you could continue. The possibilities are endless, limitless. There's any possibility of madness and absurdity that could commence. With this character you feel that you're never really done.", "[on a scene involving a flight through the streets of London] It was horrible. It was gruelling. I've done many things in my life under the influence of - life - but I'd never actually thought of straddling two carriages while they're moving and then of jumping on people's heads and then onto another sort of cart. And then the thing catches fire. And this is how daddy brings home the bacon.", "[on performing with 'Penelope Cruz' (qv)] Having done the film _Blow (2001)_ (qv) together 10 or 11 years ago, something like that - the weird thing when we saw each other again was that we felt like we'd wrapped 'Blow' like the week before. It just clicked instantly, so whatever exists in terms of chemistry was just firing instantly on all cylinders. It felt completely right.", "[on 'Hunter S. Thompson' (qv)] The beauty with Hunter was that there was a very profound element of trust between us. The one side that sticks out to me about [him] is the side that not a lot of people recognized or had the opportunity to see, which was that he was a southern gentleman.", "[on playing Barnabas in _Dark Shadows (2012)_ (qv)] We decided a vampire should look like a vampire. It was our rebellion against vampires who look like underwear models. So, yeah, there was a bit of Nosferatu.", "If you love two people at the same time, choose the second. Because if you really loved the first one, you wouldn't have fallen for the second", "I've always admired actors who can try their hand at anything and, more often than not, succeed at it... people like 'Daniel Day-Lewis' (qv) and 'Gary Oldman' (qv) are just inspiring to watch.", "[on playing Tonto in _The Lone Ranger (2013)_ (qv)] In the history of cinema, the Native Americans have been portrayed as the savage and something less than that. We thought at least we should take a shot at erasing that. We all approached it that way.", "When you add up the amount of dialogue that you say per year and you realize that you've said written words more than you've had a chance to say your own words, you start thinking about that as an insane option for a human being.", "I like that, each time, before I even go in front of the cameras, the studio's reaction will be fear.", "I've always enjoyed hiding behind these characters. I could stand up in front of, it doesn't matter how many people, as a character. But if I had to do it as myself and give a speech, I would be liquid.", "There are those who meet their heroes and go, \"Aw, fuck.\" And I've never had that, luckily. I was never disappointed by the people I've admired.", "I still approach a scene as one would approach a guitar solo. You don't exactly know how you're going to phrase this or that. Which I think is beautiful. That idea of chance.", "I love the idea of changing my look. I think one owes it to the audience, to go out there and give them something different each time, so as not to bore them to death.", "The choices I made when I was in a position where it was do-or-die were made with my heroes in mind. I didn't want to disappoint the people who had busted down doors before.", "[on considering the role of fatherhood] Let's face it: practising for it is fun and it's all wonderful. Man, I'd make a hundred!", "[on 'Wes Craven' (qv) casting him in _A Nightmare on Elm Street (1984)_ (qv)] 'Wes Craven' (qv) was the guy who gave me my start, from my perspective, for almost no reason in particular. I read scenes with his daughter when I auditioned for the part. At the time, I was a musician. I wasn't really acting. It was not anything very near to my brain or my heart, which is how it pretty much remains to this day. But 'Wes Craven' (qv) was brave enough to give me the gig based on his daughter's opinion. I guess she had read with a bunch of actors, and after the casting sessions, she said, \"No, that's the guy.\" I always think of her for putting me in this mess, and certainly 'Wes Craven' (qv) for being brave enough to give me this gig. But he was a good man - so rest in peace, old Wes.", "If 'Donald Trump' (qv) ['Donald Trump' (qv)] is elected President of the United States, in a kind of historical way it's exciting because we will see the actual last President of the United States.", "You don't go through the front door of hotels anymore, you go through the garage. Or you go through the kitchen of a restaurant. Some people want to think that's cool, that's exciting. But it'll definitely make you a little weird if you're constantly being stared at. Part of the process that I've always enjoyed is being the observer. You know, just watching people and learning. At a certain point, the reversal took place. I was no longer the observer - I was being observed. That's obviously very dangerous because part of an actor's job is to observe.", "When was the last time an actor assassinated a President?... It has been a while, and maybe it's time."], "salary history": ["_A Nightmare on Elm Street (1984)_ (qv)::$25,000", "_Platoon (1986)_ (qv)::$40,000", "_21 Jump Street (1987)_ (qv)::$45,000 per episode", "_Edward Scissorhands (1990)_ (qv)::$1,500,000", "_Ed Wood (1994)_ (qv)::$750,000", "_Nick of Time (1995)_ (qv)::$5,000,000", "_Donnie Brasco (1997)_ (qv)::$5,000,000", "_Fear and Loathing in Las Vegas (1998)_ (qv)::$500,000", "_Blow (2001)_ (qv)::$4,000,000", "_Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv)::$10,000,000", "_Pirates of the Caribbean (2003)_ (qv)::$10,000,000", "_Charlie and the Chocolate Factory (2005)_ (qv)::$18,000,000", "_Pirates of the Caribbean: Dead Man's Chest (2006)_ (qv)::$20,000,000", "_Sweeney Todd: The Demon Barber of Fleet Street (2007)_ (qv)::$10,000,000", "_Alice in Wonderland (2010)_ (qv)::$50,000,000", "_The Tourist (2010)_ (qv)::$20,000,000", "_Rango (2011)_ (qv)::$7,500,000", "_Pirates of the Caribbean: On Stranger Tides (2011)_ (qv)::$55,500,000", "_The Rum Diary (2011)_ (qv)::$15,000,000", "_The Lone Ranger (2013)_ (qv)::$20,000,000", "_Transcendence (2014)_ (qv)::$20,000,000", "_Into the Woods (2014)_ (qv)::$15,000,000", "_Mortdecai (2015)_ (qv)::$18,000,000"], "birth date": "1963-06-09", "birth notes": "Owensboro, Kentucky, USA", "_actorID": "12", "_source": "IMDB", "actorID": "0000136", "created_utc_dt": "08/26/2019, 21:53:53"}