{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQwMjAwNzI0M15BMl5BanBnXkFtZTcwOTY1MTMyOQ@@._V1_UY98_CR6,0,67,98_AL_.jpg", "birth name": "James Eugene Carrey", "height": "6' 2\" (1.88 m)", "mini biography": ["'Jim Carrey' (qv), Canadian-born and a U.S. citizen since 2004, is an actor and producer famous for his rubbery body movements and flexible facial expressions. The two-time Golden Globe-winner rose to fame as a cast member of the Fox sketch comedy _In Living Color (1990)_ (qv) but leading roles in _Ace Ventura: Pet Detective (1994)_ (qv), _Dumb and Dumber (1994)_ (qv) and _The Mask (1994)_ (qv) established him as a bankable comedy actor.James Eugene Carrey was born on January 17, 1962 in Newmarket, Ontario, Canada, and is the youngest of four children of Kathleen (Oram), a homemaker, and Percy Carrey, an accountant and jazz musician. The family surname was originally \"Carré\", and he has French-Canadian, Scottish, and Irish ancestry. Carrey was an incurable extrovert from day one. As a child, he performed constantly, for anyone who would watch, and even mailed his résumé to The 'Carol Burnett' (qv) Show (1967) at age 10. In junior high, he was granted a few precious minutes at the end of each school day to do stand-up routines for his classmates (provided, of course, that he kept a lid on it the rest of the day).Carrey's early adolescence took a turn for the tragic, however, when the family was forced to relocate from their cozy town of Newmarket to Scarborough (a Toronto suburb). They all took security and janitorial jobs in the Titan Wheels factory, Jim working 8-hour shifts after school let out (not surprisingly, his grades and morale both suffered). When they finally deserted the factory, the family lived out of a Volkswagen camper van until they could return to Toronto.Carrey made his stand-up debut in Toronto after his parents and siblings got back on their feet. He made his (reportedly awful) professional stand-up debut at Yuk-Yuk's, one of the many local clubs that would serve as his training ground in the years to come. He dropped out of high school, worked on his celebrity impersonations (among them 'Michael Landon' (qv) and 'James Stewart' (qv)), and in 1979 worked up the nerve to move to Los Angeles. He finessed his way into a regular gig at The Comedy Store, where he impressed 'Rodney Dangerfield' (qv) so much that the veteran comic signed him as an opening act for an entire season. During this period Carrey met and married waitress Melissa Womer, with whom he had a daughter (Jane). The couple would later go through a very messy divorce, freeing Carrey up for a brief second marriage to actress 'Lauren Holly' (qv). Wary of falling into the lounge act lifestyle, Carrey began to look around for other performance outlets. He landed a part as a novice cartoonist in the short-lived sitcom _The Duck Factory (1984)_ (qv); while the show fell flat, the experience gave Carrey the confidence to pursue acting more vigorously.Carrey also worked on breaking into film around this time. He scored the male lead in the ill-received 'Lauren Hutton' (qv) vehicle _Once Bitten (1985)_ (qv), and had a supporting role in _Peggy Sue Got Married (1986)_ (qv), before making a modest splash with his appearance as the alien Wiploc in _Earth Girls Are Easy (1988)_ (qv). Impressed with Carrey's lunacy, fellow extraterrestrial 'Damon Wayans' (qv) made a call to his brother, 'Keenen Ivory Wayans' (qv), who was in the process of putting together the sketch comedy show _In Living Color (1990)_ (qv). Carrey joined the cast and quickly made a name for himself with outrageous acts (one of his most popular characters, psychotic Fire Marshall Bill, was attacked by watchdog groups for dispensing ill- advised safety tips).Following his time on _In Living Color (1990)_ (qv), Carrey's transformation from TV goofball to marquee headliner happened within the course of a single year. He opened 1994 with a starring turn in _Ace Ventura: Pet Detective (1994)_ (qv), a film that cashed in on his extremely physical brand of humor (the character's trademark was talking out his derrière). Next up was the manic superhero movie _The Mask (1994)_ (qv), which had audiences wondering just how far Carrey's features could stretch.Finally, in December 1994, he hit theaters as a loveable dolt in the Farrelly brothers' _Dumb and Dumber (1994)_ (qv) (his first multi-million dollar payday). Now a box-office staple, Carrey brought his manic antics onto the set of _Batman Forever (1995)_ (qv), replacing 'Robin Williams' (qv) as The Riddler. He also filmed the follow-up to his breakthrough, _Ace Ventura: When Nature Calls (1995)_ (qv), and inked a deal with Sony to star in _The Cable Guy (1996)_ (qv) (replacing 'Chris Farley' (qv)) for a cool $20 million--at the time, that was the biggest up-front sum that had been offered to any comic actor. The movie turned out to be a disappointment, both critically and financially, but Carrey bounced back the next year with the energetic hit _Liar Liar (1997)_ (qv). Worried that his comic shtick would soon wear thin, Carrey decided to change course.In 1998, he traded in the megabucks and silly grins to star in 'Peter Weir' (qv)'s _The Truman Show (1998)_ (qv) playing a naive salesman who discovers that his entire life is the subject of a TV show, Carrey demonstrated an uncharacteristic sincerity that took moviegoers by surprise. He won a Golden Globe for the performance, and fans anticipated an Oscar nomination as well--when it didn't materialize, Carrey lashed out at Academy members for their narrow-minded selection process. Perhaps inspired by the snub, Carrey threw himself into his next role with abandon. After edging out a handful of other hopefuls (including 'Edward Norton' (qv)) to play eccentric funnyman 'Andy Kaufman' (qv) in _Man on the Moon (1999)_ (qv), Carrey disappeared into the role, living as Kaufman -- and his blustery alter-ego Tony Clifton -- for months (Carrey even owned Kaufman's bongo drums, which he'd used during his audition for director 'Milos Forman' (qv)). His sometimes uncanny impersonation was rewarded with another Golden Globe, but once again the Academy kept quiet.An indignant Carrey next reprised his bankable mania for the Farrelly brothers in _Me, Myself & Irene (2000)_ (qv), playing a state trooper whose Jekyll and Hyde personalities both fall in love with the same woman ('Renée Zellweger' (qv)). Carrey's real-life persona wound up falling for her too--a few months after the film wrapped, the pair announced they were officially a couple. By then, Carrey had already slipped into a furry green suit to play the stingy antihero of 'Ron Howard' (qv)'s _How the Grinch Stole Christmas (2000)_ (qv).Although Carrey maintains a foothold in the comedy world with films such as _Bruce Almighty (2003)_ (qv) and _Mr. Popper's Penguins (2011)_ (qv), he is also capable of turning in nuanced dramatic performances, as demonstrated in films like _Eternal Sunshine of the Spotless Mind (2004)_ (qv) and the drama/comedy _Yes Man (2008)_ (qv). In 2013, he costars with 'Steve Carell' (qv) in _The Incredible Burt Wonderstone (2013)_ (qv).Carrey has one child with his first wife, 'Melissa Carrey' (qv), whom he divorced in 1995. He married actress 'Lauren Holly' (qv) in 1996, but they split less than a year later.::Kage Fuusha and Anonymous"], "spouse": ["'Lauren Holly' (qv)::(23 September 1996 - 29 July 1997) ( divorced)", "'Melissa Carrey' (qv)::(28 March 1987 - 11 December 1995) ( divorced) ( 1 child)"], "trade mark": ["Flexible body movements", "Frequently plays a character who wears green or is green", "Makes weird facial expressions in his more comical roles. A lot of times, the  expression is accompanied by an equally weird voice or laugh.", "In dramatic roles, often plays a character who discovers a bizarre truth about the foundations of his life", "Wild erratic manner of speaking", "His characters often have catchphrases", "Characters lacking in manners or social awareness", "Frequently imitates 'Clint Eastwood' (qv) and 'Elvis Presley' (qv) in his movies (_The Mask (1994)_ (qv), _Man on the Moon (1999)_ (qv), _Bruce Almighty (2003)_ (qv), etc).", "Occasionally performs musical numbers in his movies (_The Mask (1994)_ (qv), The Grinch (2000), _Man on the Moon (1999)_ (qv), _Yes Man (2008)_ (qv), Fun With Dick and Jane (2005), _The Cable Guy (1996)_ (qv))"], "trivia": ["Dropped out of high school at 16.", "(6/24/99) During the filming of _Me, Myself & Irene (2000)_ (qv), he and the production crew attended a private music show 'Phish' (qv) at the guitarist/vocalist house in Careystock, Vermont. There he sang two songs with 'Phish' (qv), \"Hey You\" by 'Bachman-Turner Overdrive' (qv) and \"Come Together\" by 'The Beatles' (qv).", "Ranked #54 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Chosen by \"People\" magazine as one of the 50 Most Beautiful People in the World. [1997]", "At age 10, he sent his resume to 'Carol Burnett' (qv).", "He appeared at the 20th anniversary special for The Comedy Store wearing nothing but a sock on his penis.", "Hosted \"YTV 'Awards' (qv) Show\" in the mid-1980s with 'Laurie Gelman' (qv), from _Fox After Breakfast (1996)_ (qv). YTV is Canada's Youth Television station.", "At one point his family lived out of their car/trailer.", "Performed \"Rocket Man\" on stage with 'Elton John' (qv) at one of John's concerts. [1998]", "At one point he and his family all worked as janitors and security guards at a factory to make a living.", "Relationship with 'Renée Zellweger' (qv) ended while they were already engaged and had marriage plans. [2000]", "Manager is 'Jimmy Miller' (qv), who is the younger brother of actor-comedian 'Dennis Miller' (qv).", "Shares the same birthday with 'Andy Kaufman' (qv), who he played in _Man on the Moon (1999)_ (qv).", "December, 2001: Announces his intention to become a United States citizen.", "As of 2001, his total of nine MTV movie awards is the most won by any person.", "Received U.S. citizenship in October 2004 and maintains a dual citizen of both the United States and his native Canada.", "He, 'Michael J. Fox' (qv) and the late 'Raymond Burr' (qv) head list of top Canadians in U.S. television compiled by Banff Television Festival, June 2002.", "As a child, he used to wear his tap shoes to bed just in case his parents needed cheering up in the middle of the night.", "Performed his first stand-up routine (with disastrous results) in a yellow suit and tails (made by his mother) similar to what he would later wear in _The Mask (1994)_ (qv).", "Insisted the band, 'Cannibal Corpse' (qv), play in the movie _Ace Ventura: Pet Detective (1994)_ (qv).", "(1/30/03) 'Melissa Carrey' (qv) filed court papers in Los Angeles Superior Court requesting more child support, saying that $10,000 a month \"is not sufficient\" to meet the needs of their 15-year-old daughter 'Jane Carrey' (qv), who wants to pursue a career in the entertainment industry. An April 21 hearing is scheduled on the support request.", "Became a father for the 1st time at age 25 when his 1st ex-wife 'Melissa Carrey' (qv) gave birth to their daughter 'Jane Carrey' (qv) on September 6, 1987.", "Ranked #5 in Star TV's Top 10 Box Office Stars of the 1990s (2003).", "Many of his characters are ordinary men whose lives are changed by supernatural or otherwise unseen forces. As in _The Mask (1994)_ (qv) (\" (Ipkiss happens to find the mask), _The Majestic (2001)_ (qv) (Appleton is unlucky and suffers amnesia), _Liar Liar (1997)_ (qv) (His son's birthday wish comes true), _Bruce Almighty (2003)_ (qv) (Divine intervention), _The Truman Show (1998)_ (qv) (He finds his life is a TV show), and so on.", "His characters from _Dumb and Dumber (1994)_ (qv), _The Mask (1994)_ (qv), _Batman Forever (1995)_ (qv), _Bruce Almighty (2003)_ (qv), _How the Grinch Stole Christmas (2000)_ (qv), _Man on the Moon (1999)_ (qv) and _Lemony Snicket's A Series of Unfortunate Events (2004)_ (qv)) are losers who want to be recognized and be famous.", "There is some sort of a bathroom scene and car scene in almost every one of his movies.", "Along with 'Jeff Goldblum' (qv) and 'Damon Wayans' (qv), his voice was dubbed for certain scenes in _Earth Girls Are Easy (1988)_ (qv).", "While filming _Earth Girls Are Easy (1988)_ (qv), it took approximately two and a half hours for him and co-stars 'Jeff Goldblum' (qv) and 'Damon Wayans' (qv) to be suited up as the aliens.", "Many of his characters have a job or interest in TV (_The Mask (1994)_ (qv), _Batman Forever (1995)_ (qv), _The Cable Guy (1996)_ (qv), _The Truman Show (1998)_ (qv), _Man on the Moon (1999)_ (qv), _Bruce Almighty (2003)_ (qv)).", "Has said that his least favorite movie is _The Computer Wore Tennis Shoes (1969)_ (qv).", "Owns his own $25-million plane.", "October 2004 - Became a U.S. citizen.", "He has said that Joel, his painfully shy, lovelorn character in _Eternal Sunshine of the Spotless Mind (2004)_ (qv), is closer to what he's like when he's not \"on,\" and that making the film led him to reflect on his past relationships and why they didn't work out.", "Attended Agincourt Collegiate Institute (High School), in Scarborough.", "Auditioned for the role of Farmer Ted in the film _Sixteen Candles (1984)_ (qv). Eventually, actor 'Anthony Michael Hall' (qv) won the part.", "He donated a signed head-shot to 'Rocky Stone' (qv) to be auctioned off to raise money to buy more toys for less fortunate kids as part of the Toy Mountain Campaign 2004.", "While getting his start in Los Angeles, one of his frequent stops was at the Comedy Store.", "Went through depression in the 1980s while struggling to make ends meet as a comedian.", "Wrote letters to 'Tupac Shakur' (qv) when Tupac was in prison to help him laugh and smile. Tupac said that Carrey was his favorite actor.", "Briefly attended Aldershot High School in Burlington, Ontario.", "Bought a Harley Davidson motorcycle and got a vanity license plate for it which read \"NO TAG\" as a joke. This resulted in Jim receiving numerous traffic tickets in the mail that were meant for other people. As it turns out, when filling out a ticket, police officers write \"no tag\" in the license plate number slot on the ticket when the offending vehicle has no license plate. In some cases, this was interpreted as the actual license plate number, as it was in Jim's case, which caused the tickets to be routed to him.", "He was originally cast as \"Dr. Evil\" in _Austin Powers: International Man of Mystery (1997)_ (qv), but he had to drop out of the role due to a scheduling conflict with _Liar Liar (1997)_ (qv).", "Was considered for the roles of Captain Jack Sparrow in _Pirates of the Caribbean: The Curse of the Black Pearl (2003)_ (qv) and Willy Wonka in _Charlie and the Chocolate Factory (2005)_ (qv), both of which eventually went to 'Johnny Depp' (qv).", "His performance as \"Ace Ventura\" in _Ace Ventura: Pet Detective (1994)_ (qv) is ranked #97 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "Was originally offered the lead role in the movie _The Master of Disguise (2002)_ (qv).", "Was a straight-A student until he dropped out.", "Before 'Martin Scorsese' (qv)'s _The Aviator (2004)_ (qv), he spent years trying to produce and star in a film of 'Howard Hughes' (qv)' life as Hughes himself.", "He has been nominated for 5 Golden Globes, but although more recognised for his comedic performances, the only two Globes he's won were for dramatic performances. (_The Truman Show (1998)_ (qv) and _Man on the Moon (1999)_ (qv)).", "He auditioned to be a castmember on _Saturday Night Live (1975)_ (qv) in its 1980-81 season, but lost out to 'Charles Rocket' (qv) (who he'd later star opposite in _Dumb and Dumber (1994)_ (qv)). He auditioned again for the 1985-1986 season, but Carrey saw a man on the ledge of the 30 Rock building threatening to kill himself and was afraid that working on SNL would drive him to suicide. Both seasons are considered among the worst in the show's history.", "Possibly out of slapstick to his nationality, his \"Dick Harper\" character of _Fun with Dick and Jane (2005)_ (qv) has been compared by fans to Canadian Prime Minister Stephen Harper.", "First actor to reach 20 million dollar salary mark (for _The Cable Guy (1996)_ (qv)) in 1996. The first actress to do so was 'Julia Roberts' (qv), four years later, who was paid the same amount for her role in _Erin Brockovich (2000)_ (qv) in 2000.", "On September 13th, 2006, Carrey fired his agent of 15 years, 'Nick Stevens' (qv).", "Along with his girlfriend 'Jenny McCarthy' (qv), he was among the guests at 'Tom Cruise' (qv) and 'Katie Holmes' (qv)'s wedding.", "Often his protagonist (or antagonist) roles are associated with the color green. _The Mask (1994)_ (qv), _How the Grinch Stole Christmas (2000)_ (qv), \"The Riddler\" in _Batman Forever (1995)_ (qv), the alias 'Mr. Red Green' in _Fun with Dick and Jane (2005)_ (qv). The Red Green reference in Fun With Dick and Jane might have been a nod to a Canadian comedy, _The Red Green Show (1991)_ (qv).", "Turned down the offer to induct 'Jerry Lawler' (qv) into the WWE Hall Of Fame in 2007, for he believed the people in the audience would have come to the ceremony to see him, not the legends being honored that night.", "'Nicole Kidman' (qv) calls him her best male friend.", "Is a huge fan of the cartoons _Johnny Bravo (1997)_ (qv), _SpongeBob SquarePants (1999)_ (qv) and _Dave the Barbarian (2004)_ (qv).", "At one time, Carrey was slated to star as the lead in _Meet the Parents (2000)_ (qv) and even contributed jokes to the screenplay, such as the main character being named \"Focker\".", "With the exception of his \"Ace Ventura\" character, Carrey has a reputation of not repeating the same character twice in a sequel (_Batman & Robin (1997)_ (qv)) or prequel (_Dumb and Dumberer: When Harry Met Lloyd (2003)_ (qv)).", "Studies acting with legendary coach 'Larry Moss' (qv).", "A fan of _Monty Python's Flying Circus (1969)_ (qv).", "Has worked with two actresses from the TV show _Friends (1994)_ (qv): 'Courteney Cox' (qv) in _Ace Ventura: Pet Detective (1994)_ (qv), and 'Jennifer Aniston' (qv) in _Bruce Almighty (2003)_ (qv).", "Played a (fictional) man who is not (yet) aware he is on television on _The Truman Show (1998)_ (qv) and a real-life man who believed he was always on television _Man on the Moon (1999)_ (qv).", "'Jack Nicholson' (qv) has called him the \"'Jack Nicholson' (qv) of the next generation\".", "As of 2009, he is only one of six performers who won a Golden Globe Award as Best Lead Actor/Actress in a Motion Picture Drama without being nominated for an Oscar for that same role (his for _The Truman Show (1998)_ (qv)). The others are 'Spencer Tracy' (qv) in _The Actress (1953)_ (qv), 'Anthony Franciosa' (qv) in _Career (1959)_ (qv), 'Omar Sharif' (qv) in _Doctor Zhivago (1965)_ (qv), 'Shirley MacLaine' (qv) for _Madame Sousatzka (1988)_ (qv) and 'Kate Winslet' (qv) in _Revolutionary Road (2008)_ (qv).", "Was considered for the role of Ted Stroehmann in _There's Something About Mary (1998)_ (qv).", "As a kid, he was a member of the Royal Canadian Sea Cadets.", "The characters played by him in _Ace Ventura: Pet Detective (1994)_ (qv), _The Mask (1994)_ (qv) and _Dumb and Dumber (1994)_ (qv) later all became TV cartoons, whereas his \"Grinch\", \"Horton\" and \"Riddler\" characters were already cartoons.", "Publicist is 'Marleah Leslie' (qv).", "Spoofed the Players' Club TV commercials, made famous by 'Telly Savalas' (qv) in the 1980s, on _In Living Color (1990)_ (qv).", "He had never heard of _Doctor Who (1963)_ (qv) until being offered the role of the Eighth Doctor in _Doctor Who (1996)_ (qv), which was the key factor into turning down the role, as he felt he would cause outrage amongst Doctor Who fans if the role wasn't played by a Doctor Who fan.", "Lives in Los Angeles and Malibu, California.", "Jim and his girlfriend, 'Jenny McCarthy' (qv), have ended their five-year romance [April 6, 2010].", "Became a grandfather for the 1st time at age 48 when his daughter 'Jane Carrey' (qv) gave birth to her son Jackson Riley Santana on February 26, 2010. Child's father is singer Alex Santana.", "According to 'Biography' (qv), Jim wrote himself a check for $10 million dollars in 1983, post-dated 10 years, hoping to be able to cash it by then. The episode also featured a clip from a 1999 interview where Jim stated he put the check in his father's pocket after he passed away on September 13, 1994. [October 13, 2010].", "A lifelong fan of the Pink Panther movie series, especially Inspector Clouseau's house servant Cato (as played by 'Burt Kwouk' (qv)).", "He is of French-Canadian ancestry on his father's side, and has French, Irish, and Scottish ancestry on his mother's side. His family's surname was originally \"Carré\".", "Pictured on one of a set of five nondenominated Canadian commemorative postage stamps honoring Great Canadian Comedians, issued 29 August 2014. In addition to the main portrait, he is shown in his roles as Ace Ventura, Stanley Ipkiss in _The Mask (1994)_ (qv), and Lloyd Christmas in _Dumb and Dumber (1994)_ (qv). Others honored in this set are 'Mike Myers' (qv), 'Catherine O'Hara' (qv), 'Martin Short' (qv), and Oliver Guimond. Price of each stamp on day of issue was 85¢.", "In several films he has played an extraordinary character for whom television plays an vital role. In _Batman Forever (1995)_ (qv) he played The Riddler who devises a master plan to hypnotize and absorb knowledge from the population using television. In _The Cable Guy (1996)_ (qv) he played a cable TV technician with a lifelong unhealthy obsession with television. In _The Truman Show (1998)_ (qv) he played a man who discovers that his entire life was a hugely successful reality TV show. In _Man on the Moon (1999)_ (qv) he played the TV comedy star 'Andy Kaufman' (qv) who pushed the boundaries of his medium. And in _Bruce Almighty (2003)_ (qv) he played a TV reporter who was suddenly granted the powers of God.", "Has played the two most well known fictional characters who hated Christmas, The Grinch and Ebenezer Scrooge.", "Is good friends with 'Steve Oedekerk' (qv).", "Appeared on the final episode of Late Show with 'David Letterman' (qv) _(1993)_ (qv), wearing a personally made shirt saying \"Spank You Kindly 'David Letterman' (qv)\".", "His ex-girlfriend, 'Cathriona White' (qv), died from a suspected drug overdose on September 28, 2015 in Los Angeles.", "His role of Brad Peters in the 1989 CBS television film _Mike Hammer: Murder Takes All (1989)_ (qv) turned out to be the final murder victim. Helen Durant ('Lynda Carter' (qv)) was his off screen murderer. The notable other deaths in that television film were Johnny Roman ('Edward Winter' (qv)), Barbara Leguire ('Kelly Jerles' (qv)), Bundy ('Royce D. Applegate' (qv)), Leora van Treas ('Michelle Phillips' (qv)), Reggie Diaz ('Lyle Alzado' (qv)), John McNiece ('Jessie Lawrence Ferguson' (qv)), and Carl Durant ('John Calvin' (qv)).", "Good friends with 'Jeff Daniels' (qv), 'Ewan McGregor' (qv), 'Steve Carell' (qv), and 'Steven Tyler' (qv).", "He has worked with five directors who have won a Best Director Oscar: 'Francis Ford Coppola' (qv), 'Clint Eastwood' (qv),'Milos Forman' (qv), 'Ron Howard' (qv) and 'Robert Zemeckis' (qv).", "To deal with his depression, Carrey took Prozac, eventually deciding to get off medications. He has stated that he no longer takes medications or stimulants of any kind, not even coffee.", "As of 2017, 'Jim Carrey' (qv) is the only actor (male or female) to date to win a Golden Globe for Best Actor in both the drama and comedy/musical categories without being nominated for an Academy Award.", "Carrey is mentioned in 'Blessid Union of Souls' (qv)'s \"Hey Leonardo (She Likes Me For Me)\".", "Auditioned the same night as budding comedian 'Bill Maher' (qv) for 'Mitzi Shore' (qv) at The Comedy Store in the early 1980s.", "Nominated for the 2019 Golden Globe Award in the Outstanding Directing For A Comedy Series category for his role as Jeff in _Kidding (2018)_ (qv), but lost to 'Michael Douglas' (qv) for _The Kominsky Method (2018)_ (qv)."], "quotes": ["I tend to stay up late, not because I'm partying but because it's the only time of day when I'm alone and I don't have to be on, performing.", "Until _Ace Ventura: Pet Detective (1994)_ (qv), no actor had considered talking through his ass.", "[about his chances of winning at the 1998 Golden Globes 'Awards' (qv)] It's insane . . . I mean, ['Jack Nicholson' (qv)], ['Dustin Hoffman' (qv)], ['Samuel L. Jackson' (qv)], ['Kevin Kline' (qv)]--I don't see how I can lose.", "I've been dubbed the man most responsible for the dumbing of America, so obviously I don't put much stock into thoughts like (the theme of the 'dumbing down' of contemporary comedy). People love to laugh, and most people can find humor in just about anything, which is great. Trying to label or categorize comedy is ridiculous. I mean, if you laugh at a fart joke, does that make you a moron? I don't think so.", "Maybe there is no actual place called hell. Maybe hell is just having to listen to our grandparents breathe through their noses when they're eating sandwiches.", "That's the trouble with being me. At this point, nobody gives a damn what my problem is. I could literally have a tumor on the side of my head and they'd be like, 'Yeah, big deal. I'd eat a tumor every morning for the kinda money you're pulling down.", "I'm charming, but I dip into the Prozac now and then.", "I don't believe in this fairy tale of staying together for ever. Ten years with somebody is enough. In ten years, you can give a lot of love.", "I have no intention of giving up my Canadian heritage, and all those who loved and supported me. My upbringing in Canada made me the person I am. I will always be proud to be a Canadian.", "[after recording a cover of 'The Beatles' (qv)' \"I Am the Walrus\"] There! I did it! I defiled a timeless work of art! For my next trick, I will paint a clown face on the Mona Lisa while using the shroud of Turin as a dropcloth.", "[on being asked what his personal motto is] Always turn your wheel in the direction of the skid.", "The power of the subconscious mind! With the power of the sub-conscious mind I can learn how to do anything...I could...learn how to dance, or, yodel like an Austrian.", "If there'd been Ritalin when I was a kid, I wouldn't be here now.", "The best possible thing you can get out of a relationship is that you're with somebody who encourages you to be the best version of yourself.", "(1996, on choosing projects) Very rarely do I jump up and say on my own, 'I must do this!' I have a lot of people who look at material and give me their opinions. It's like the President-he doesn't make a move without his aides, which is a smart way to be if you trust the opinions of the people on your team.", "(1996, on $20 million paydays) See, the number in the paper is one thing, but then there's 35 percent off the top for commissions, then there's taxes, so the $20 million check becomes $5.5 million. That's amazing money, but it's not $20 million. Believe me, I don't gloat about the money. People have lost fortunes that make mine look microscopic. You can never count on it for sure. People that do that are asking for trouble.", "(1996) Money doesn't faze me at all. It goes into an account and then I basically do what I need to do with it. The money takes a little of your fear away-you know, fear of the future. This country is pretty scary if you don't build some kind of nest egg for yourself. I don't go buy Maseratis, because I've never been impressed with stuff like that at all. I'll probably end up with two houses, someplace to escape to and someplace in the city, I'm pretty basic. I understand the dynamic of people who medicate themselves with things, but it always seemed hollow to me.", "(1996) I'm just a freak like the rest of us. I'd say I've had an even flow of neediness through my whole life, and I got kind of clever about it early. I remember starting out imitating records in the back of the classroom, and when the teacher singled me out and tried to make me feel embarrassed by saying, 'Get up and do that in front of the whole class,' it marked the end of all normal life. I got up, did it in front of the whole class and learned that committing myself to getting a reaction was very addicting. For sure, I have an unnatural need to be noticed or liked. But I don't necessarily gear everything to an audience, going, 'What are they going to want?', I'm not afraid to become a different thing, because I believe talent finds its audience. It's just like 'The Beatles' (qv). They didn't stay put. They changed, made a lot of enemies, lost fans, gained new ones.", "(1996) I dyed my hair black just before I started shooting _The Cable Guy (1996)_ (qv) and immediately got completely in the doldrums. I couldn't lift myself out of it, because every time I looked in the mirror, I didn't like myself. It definitely put me in a weird place.", "Even if I am being over the top or crazy, I want to do something original. There is nothing that makes me happier than when someone says: 'I watched _The Mask (1994)_ (qv) 300 times when I was a kid.' I look forward to when I am 80 and people come up to me going: 'It was you, dude.' That's an amazing feeling.", "It is as if I am starting out every time I make a film. And I swear to you I don't feel any more secure than I used to, or jaded in any way. There was a moment when I thought 'I am not sure I want to be part of this big thing that is Hollywood.' I looked at it cynically for a minute. Then I sat on my couch and realized the value of what I do. We free people from concern. It is what everyone needs in this day and age. There is nothing better and it started out that way.", "I was always trying to make my mother laugh because she was sick or depressed or whatever. Many comics start out by trying to heal their family. That's how you get good. Your drunken grandparents leave and you turn around as a seven-year-old child and imitate them. That is how it began for me, bringing comic relief to my family. It really is comic relief, people don't just want to see it, they need it. I need it more than they do and that is why I am on this side of the camera because I am a really needy person.", "(2001, on his first comedy show) My mother dressed me in a polyester suit, and I got booed off the stage, and I didn't go back for two years. But then when I went back, I was gangbusters.", "My focus is to forget the pain, mock the pain, reduce it.", "[on Ireland] I love the whole culture, obviously. You have the best musicians, the best poets. Great artists come out of Ireland.", "These mass shootings and daily body counts are an invitation for us to become more civilized and to deal with our addiction and entitlement to violence. Not to shut our eyes and ears and scream at those with a different opinion than ours to 'fuck off and go back to Canada'.", "So many of us chose our path out of fear disguised as practicality. My father could have been a great comedian, but he didn't believe that was possible for him. So, he made a conservative choice and instead he got a job as an accountant. When I was 12 years old, he was let go from that safe job. Our family had to do whatever we could to survive. I learned many great lessons from my father, not the least of which is that you can fail at what you don't want, so you might as well take a chance on doing what you love.", "(Why he turned down _Phone Booth (2002)_ (qv)) I just wasn't in the right space to do that movie. I'd just come off _Me, Myself & Irene (2000)_ (qv) and _How the Grinch Stole Christmas (2000)_ (qv). I didn't want to go to a phone both and think about dying.", "[on 'Jerry Lewis' (qv)] People might dismiss Jerry as someone who acted the fool. But the fool is not an idiot.The courage and freedom of the fool liberates us. The fool tells the truth while making fun of our arrogance and our conventional ideas. He shows us up for what we are, and that's what Jerry did. He was a blessing.", "[on the nuclear alert in Hawaii on January 13, 2018] It was a false alarm, but a real psychic warning. If we allow this one-man Gomorrah and his corrupt Republican congress to continue alienating the world, we are all headed for suffering beyond all imagination.", "It's not our World.", "[as a guest on Real Time with 'Bill Maher' (qv): Episode #16.26 (2018)] I grew up in Canada, OK. We have socialized medicine, and I am here to tell you that this bullshit line that you get on all the political shows from people, is that it's a failure; the system is a failure in Canada. It is NOT a failure in Canada. I never waited for anything in my life, I chose my own doctors, my mother never paid for a prescription. It was fantastic. And I just got back from Vancouver, and I keep hearing this, \"Canadians are so nice . . . Canadians are so nice.\" They can be nice because they have health care. Because they have a government that cares about them. It doesn't say, \"Sink or fucking swim pal, or you live in a box.\" There are certain people in our society that need to be taken care of. There are people without as many opportunities that need to be helped toward those opportunities. There are people who are sick. You shouldn't have to lose your home because your mother got sick.", "I feel that we're all lighthouses, and my job is to shine my light as brightly as I can to the darkness.", "Whoever invented marriage was creepy as hell. It says \"I love you so much that I'm going to get the government involved so you can't leave\"."], "salary history": ["_In Living Color (1990)_ (qv)::$25,000 /episode", "_Ace Ventura: Pet Detective (1994)_ (qv)::$350,000", "_The Mask (1994)_ (qv)::$540,000", "_Dumb and Dumber (1994)_ (qv)::$7,000,000", "_Batman Forever (1995)_ (qv)::$7,000,000", "_Ace Ventura: When Nature Calls (1995)_ (qv)::$15,000,000", "_The Cable Guy (1996)_ (qv)::$20,000,000", "_Liar Liar (1997)_ (qv)::$20,000,000", "_The Truman Show (1998)_ (qv)::$12,000,000", "_Man on the Moon (1999)_ (qv)::$12,000,000", "_Me, Myself & Irene (2000)_ (qv)::$20,000,000", "_How the Grinch Stole Christmas (2000)_ (qv)::$20,000,000 + merchandising", "_Bruce Almighty (2003)_ (qv)::$25,000,000", "_Eternal Sunshine of the Spotless Mind (2004)_ (qv)::$10,000,000", "_Yes Man (2008)_ (qv)::36.2% of profit"], "birth date": "1962-01-17", "birth notes": "Newmarket, Ontario, Canada", "_actorID": "31", "_source": "IMDB", "actorID": "0000120", "created_utc_dt": "08/26/2019, 21:54:09"}