{"headshot": "https://m.media-amazon.com/images/M/MV5BMTQ1MzYyMjQ0Nl5BMl5BanBnXkFtZTcwMTA0ODkyMg@@._V1_UX67_CR0,0,67,98_AL_.jpg", "birth name": "Josh J. Brolin", "height": "5' 10½\" (1.79 m)", "mini biography": ["Rugged features and a natural charm have worked for 'Josh Brolin' (qv), the son of actor 'James Brolin' (qv). He has played roles as a policeman, a hunter, and the President of the United States.Brolin was born February 12, 1968 in Santa Monica, California, to Jane Cameron (Agee), a Texas-born wildlife activist, and 'James Brolin' (qv). Josh was not interested at first in the lifestyle of the entertainment business, in light of his parents' divorce, and both of them being actors. However, during junior year in high school, he took an acting class to see what it was like. He played Stanley in \"A Streetcar Named Desire\" and became hooked. His first major screen role was as the older brother in the film _The Goonies (1985)_ (qv), based on a story by 'Steven Spielberg' (qv). He then immediately moved on to work on television, taking roles on such series as _Private Eye: Pilot (1987)_ (qv) and _The Young Riders (1989)_ (qv). \"Private Eye\" was a chance for Brolin to play a detective. \"The Young Riders\" was set just before the Civil War, and was co-directed by Brolin's father, 'James Brolin' (qv).After _The Young Riders (1989)_ (qv), Brolin moved back to the big screen, with mediocre success. He played a supporting role in _The Road Killers (1994)_ (qv), but the film was not a success. He followed up with the crime film _Gang in Blue (1996)_ (qv), the romantic film _Bed of Roses (1996)_ (qv), the thriller film _Nightwatch (1997)_ (qv), and appeared with his father in _My Brother's War (1997)_ (qv). However, nothing truly stuck out, especially not the box office flop _The Mod Squad (1999)_ (qv). The 2000s initially brought no significant change in Brolin's career. He appeared in the independent film _Slow Burn (2000)_ (qv), the sci-if thriller _Hollow Man (2000)_ (qv) and starred on the television series _Mister Sterling (2003)_ (qv). In 2004, he married actress 'Diane Lane' (qv) and are still together.It was not until 2007 that Brolin received much acclaim for his films. He took a supporting role in the 'Quentin Tarantino' (qv)-written _Grindhouse (2007)_ (qv) which was a two-part film accounting two horror stories. He also played two policemen that year: corrupt officer Nick Trupo in the crime epic _American Gangster (2007)_ (qv), and an honest police chief in the emotional drama _In the Valley of Elah (2007)_ (qv) which starred 'Tommy Lee Jones' (qv) and was directed by 'Paul Haggis' (qv). However, it was his involvement in _No Country for Old Men (2007)_ (qv) that truly pushed him into the limelight. The film, directed by the Coen brothers, was about a man (Brolin) who finds a satchel containing two million dollars in cash. He is pursued by an unstoppable assassin ('Javier Bardem' (qv), who won an Oscar for his work) and his friend, a local sheriff ('Tommy Lee Jones' (qv)). The film won four Oscars, including Best Picture and Best Director.Brolin found high-profile work the next year, being cast as Supervisor Dan White in the film _Milk (2008)_ (qv). His performance as the weak and bitter politician earned him an Oscar nomination, and Brolin received more praise for his fascinating portrayal of 'George W. Bush' (qv) in the 'Oliver Stone' (qv) film _W. (2008)_ (qv). Despite the mediocre success of _W. (2008)_ (qv), he was recognized as the best part of the film, and _Milk (2008)_ (qv) was another triumph, critically and commercially.Brolin then acted in the smaller comedy _Women in Trouble (2009)_ (qv) before landing a number of large roles in 2010. The first of these was the film based on the comic book figure _Jonah Hex (2010)_ (qv). The film was a box office flop and critically panned, but Brolin also forged a second collaboration with legendary director 'Oliver Stone' (qv) for _Wall Street: Money Never Sleeps (2010)_ (qv). Brolin played a large role alongside such young stars as 'Carey Mulligan' (qv) and 'Shia LaBeouf' (qv), and older thespians such as 'Michael Douglas' (qv), 'Eli Wallach' (qv), and 'Frank Langella' (qv). Brolin's character was Bretton James, a top banker in the film, and also the film's chief antagonist. Brolin also appeared in 'Woody Allen' (qv)'s London-based film _You Will Meet a Tall Dark Stranger (2010)_ (qv) and a second collaboration with the Coen Brothers, which was a remake of _True Grit (1969)_ (qv).Despite his earlier mediocre success and fame, Brolin has maintained a choosiness in his films and, recently, these choices have paid off profoundly. Hopefully, he continues this streak of good fortune that his talents have finally given him.::Bob Stage"], "spouse": ["'Kathryn Boyd Brolin' (qv)::(24 September 2016 - present)", "'Diane Lane' (qv)::(15 August 2004 - 27 November 2013) ( divorced)", "'Alice Adair' (qv)::(1988 - 1992) ( divorced) ( 2 children)"], "trade mark": ["Has frequently been cast in the role of an enforcer of the law", "Often plays characters with charismatic personalities who show concern for women", "Low-sounding, gruffy voice", "Tall and dark appearance with a stocky build", "Frequently co-stars with 'Marley Shelton' (qv)"], "trivia": ["Lived on a ranch in California with his significant other 'Alice Adair' (qv) and their two children. He spent five years performing in and directing plays at the Reflections Festival at the GeVa Theater in Rochester, New York. Brolin said, \"If I'm any kind of actor now it's because of Rochester.\" [1996].", "Father of 'Eden Brolin' (qv) and 'Trevor Brolin' (qv).", "Son of actor 'James Brolin' (qv) and 'Jane Cameron Agee' (qv) (died 1995).", "He won the 24th Annual Toyota Pro/Celebrity Race in Long Beach, California in April 2000 - 22 years after his father won the tournament. This took him just over 18 minutes to complete the course. He outshone 17 other celebrity and professional drivers including 'George Lucas' (qv), 'John Elway' (qv), and actresses 'Ashley Judd' (qv), 'Melissa Joan Hart' (qv) and 'Alyson Hannigan' (qv).", "Stepson of 'Barbra Streisand' (qv). Ex-stepson of 'Jan Smithers' (qv).", "Announced engagement to his girlfriend, actress 'Minnie Driver' (qv). [April 2001]", "Ended engagement and relationship with actress 'Minnie Driver' (qv). [October 2001]", "Attended the 2003 Golden Globe 'Awards' (qv) with 'Diane Lane' (qv).", "Engaged to actress 'Diane Lane' (qv). [July 2003]", "Ex-stepfather of 'Diane Lane' (qv)'s daughter, 'Eleanor Lambert' (qv), from Lane's first marriage to 'Christopher Lambert' (qv).", "Collects the art of Malcolm Liepke and 'Ernst Neizvestny' (qv).", "His son, 'Trevor Brolin' (qv), sketches all his characters before filming.", "Has written various stories and poems based on his mother 'Jane Cameron Agee' (qv) (died 1995).", "Was named after the character Josh Randall played by 'Steve McQueen' (qv) on the television series _Wanted: Dead or Alive (1958)_ (qv).", "He was co-executive director of Geva Theatre's \"Reflections\" (three American plays in rotating repertory) from 1991 to 1995 with 'Anthony Zerbe' (qv).", "Trained with 'Sandra Seacat' (qv) and 'Stella Adler' (qv).", "Is a huge fan of 'John Cassavetes' (qv), stating that he has watched _A Woman Under the Influence (1974)_ (qv) more than 40 times.", "Once aspired to be a chef.", "Attended the Film Industry Workshops until the filming of _The Goonies (1985)_ (qv), after which he went back for private coaching from 'Pat George' (qv) and 'Tony Miller' (qv). His father, 'James Brolin' (qv), also attended the Film Industry Workshops.", "When he's not working on films, he enjoys racing cars and surfing.", "In May 2006, two days after being cast in the film, _No Country for Old Men (2007)_ (qv), he crashed his motorcycle into a vehicle on Highland Avenue in Los Angeles. Luckily, he only shattered his collarbone and two weeks later, he showed up to start filming.", "Loves playing the stock market and is an avid day trader. He's so serious about playing Wall Street, he's got the trade station with three computer screens going simultaneously in his house in Los Angeles. He also co-created marketprobability.com, a website giving investors historical stock overviews.", "Good friends with 'Javier Bardem' (qv).", "He and father 'James Brolin' (qv) have both played U.S. Presidents. James played 'Ronald Reagan' (qv), and Josh played 'George W. Bush' (qv).", "Is one of 105 people invited to join the Academy of Motion Picture Arts and Sciences (AMPAS) in 2008.", "Older brother of 'Jess Brolin' (qv) (aka 'Jess Brolin' (qv)) and older half-brother of 'Molly Brolin' (qv) (aka Molly Elizabeth Brolin). Stepbrother of actor 'Jason Gould' (qv).", "Hosted the highest viewed _Saturday Night Live (1975)_ (qv) in 14 years on October 18, 2008, when Republican vice presidential candidate 'Sarah Palin' (qv) made a guest appearance.", "He was offered the role of Marcus Wright in _Terminator Salvation (2009)_ (qv), which he turned down. The role went to 'Sam Worthington' (qv).", "Brolin was concerned what reception he would have on location in San Francisco for the production of _Milk (2008)_ (qv) playing Dan White, the murderer of the city's famous gay politician, Harvey Milk. However, Brolin found he was warmly welcomed by the gay community for his participation in a film about their political hero.", "Was the Fox Network's choice to play Officer Tom Hanson on _21 Jump Street (1987)_ (qv), but producer 'Patrick Hasburgh' (qv) preferred 'Johnny Depp' (qv) instead.", "He is of English, Swiss-German, German, Scottish, and Irish descent. His father's original family surname, Bruderlin, originates in Switzerland.", "Auditioned for the role of \"Wild Bill\" Wharton in _The Green Mile (1999)_ (qv), which went to 'Sam Rockwell' (qv).", "He was considered to play Batman in _Batman v Superman: Dawn of Justice (2016)_ (qv), before 'Ben Affleck' (qv) was cast.", "As of 2014, has appeared in three films that were nominated for the Best Picture Oscar: _No Country for Old Men (2007)_ (qv), _Milk (2008)_ (qv) and _True Grit (2010)_ (qv). _No Country for Old Men (2007)_ (qv) won in the category.", "Has a rare distinction of appearing in five different film franchises based on five different comic book publications. He plays the Marvel Comics character Thanos in the expansive Marvel Cinematic Universe (beginning with _Guardians of the Galaxy (2014)_ (qv)), another Marvel Comics character Cable/Nathan Summers (beginning with _Deadpool 2 (2018)_ (qv)) in X-Men franchise , a young Agent K in _Men in Black 3 (2012)_ (qv) in the Malibu/Marvel Comics \"Men in Black\" franchise, the titular character in DC Comics' _Jonah Hex (2010)_ (qv), and Dwight McCarthy in the Dark Horse comics based film _Sin City: A Dame to Kill For (2014)_ (qv).", "He played Eddie Mannix in _Hail, Caesar! (2016)_ (qv) while his ex-wife 'Diane Lane' (qv) played Mannix's wife Toni Mannix in _Hollywoodland (2006)_ (qv).", "Has appeared with 'Benicio Del Toro' (qv) in five films: _Guardians of the Galaxy (2014)_ (qv), _Inherent Vice (2014)_ (qv), _Sicario (2015)_ (qv), _Avengers: Infinity War (2018)_ (qv) and _Sicario: Day of the Soldado (2018)_ (qv).", "Josh and longtime friend 'Benicio Del Toro' (qv) were once told by then Miramax Films executive 'Meryl Poster' (qv), that they were the worst auditioners she'd ever witnessed.", "He was considered for the role of Johnny Rico in _Starship Troopers (1997)_ (qv)."], "quotes": ["(On _Mister Sterling (2003)_ (qv)) I'm so glad that show didn't go, because it was more work then I ever wanna do again, and I love film.", "(On his love of the stock market - 2007) I love the competitive part of stocks. A lot of fear and greed, that's all it is. All I see is green and red.", "(On landing _No Country for Old Men (2007)_ (qv)) The Coen Brothers didn't pitch the project to me, actually. I had read the book first without knowing that there was a movie being made. My agent actually called me and said they were making \"No Country\" and explained the script to me and said, \"No, no. I read the book\". She sent me a couple of scenes and then I said, \"I can't get out of work\". I was working with 'Robert Rodriguez' (qv) on _Grindhouse (2007)_ (qv) and Robert and 'Quentin Tarantino' (qv) helped put me on tape as an audition tape and sent that to the Coens. They were smitten with the lighting and not so much for me. So that was a no. It was only through my agent, Michael Cooper, who is my good friend and a great agent. He's an old time agent; there are few and far between that actually care about their clients. He kept telling 'Ethan Coen' (qv), 'Just meet him. I'm not going to tell you he's the one but I'm going to tell you to just meet him'. I met them on what I found out later was their last casting call and then I got the part.", "On playing 'George W. Bush' (qv): Why me? Why would I want to do this movie? \"Why would I want to do this to my career?", "[on portraying President 'George W. Bush' (qv)] When ['Oliver Stone' (qv)] came to me, I was a little insulted. I had such a visceral reaction against it. But then I read the script and I thought it was amazing. I didn't love the story but as a character - following a guy from 21 to 58 - was an incredible challenge for an actor.", "(On auditioning for _21 Jump Street (1987)_ (qv)) I wanted any job at that point. They had fired the initial guy and auditioned three other guys, and it came down to 'Johnny Depp' (qv) and me. The network wanted me, the producer wanted Johnny. He and I were at his apartment hanging out; our girlfriends were best friends at the time. Johnny had just finished a small part in _Platoon (1986)_ (qv) and was talking about what it meant for him to work for this great director, 'Oliver Stone' (qv). The phone rings, it's Johnny's agent. He listens, hangs up, stuffs his clothes into his \"Platoon\" duffel and just walks out. The next time I saw him, I was doing a guest role on the fourth episode of _21 Jump Street (1987)_ (qv).", "(On his movie _Thrashin' (1986)_ (qv)) I was so terrible in it. That was one of the movie experiences - along with _Hollow Man (2000)_ (qv), a lot of years later - that made me question whether I should be doing something else. I don't want to watch myself in something like that. It's a travesty.", "(On landing _The Goonies (1985)_ (qv)) This agent started sending me out, but I was so bad, I was told I probably shouldn't do this and that just because my dad was an actor didn't mean I was going to make it. It was horrible. On probably the 300th interview, this thing happened with 'Richard Donner' (qv) and 'Steven Spielberg' (qv).", "(2010) I only took a high school acting class because there was no other class I wanted to take. I loved it, but I was always against acting as a profession. I didn't like the monetary fluctuations I saw.", "(On his school years) I got picked on a lot. I was a complete geek in school. I had braces. I didn't have the hot girlfriend. I wasn't ever sought after. I was a stocky, awkward kid who got laughed off the tennis court when I tried that. Football? Forget it. I didn't have that thing inside me where I wanted to smash against somebody and watch them break. I was too sensitive for that and disliked being that sensitive.", "(2010 - on doing romantic comedies) I wouldn't know how to do it. I don't like the genre, and comedies are not fun to do. Everybody on the set gets so serious trying to figure out how to make the timing and jokes right. 'Ryan Reynolds' (qv) is one guy who I think nobody can do that better than, and he doesn't get any fucking credit for it. I went back to see him three times in _The Proposal (2000)_ (qv). I'm so gay.", "I'm a huge 'Donald Trump' (qv) fan. I love who he is, what he's about. He's hated like any other celebrity is-like he's got the comb-over, he's an asshole, he's a capitalist, and capitalism is bad, right? I've met billionaires whose spirit is so dirty, their souls are so soot, shit and muck that it was mind-blowing to be in their presence. But that's not 'Donald Trump' (qv). People think I'm a left, left, left-leaning Democrat, but I'm a very conservative Democrat, more libertarian than anything.", "(2010 - on getting into trading) I was always good with numbers. Around 2005 I had to sell the ranch, which was sad. I had done a little part in a 'Steven Spielberg' (qv) miniseries called _Into the West (2005)_ (qv) and met a real financial expert, Brett Markinson, on a plane trip, and we talked the whole time about stock trading. On his advice, I put some of the profit from the sale of the ranch into secured investments, apartments, and the rest, I traded. I read every book there was to read on the subject. I was willing to ask a million questions. Brett liked that I was willing to listen and that I knew he had something to offer as a great teacher. From 5:30 a.m. every day, I'd be pinging him, saying, \"I'm looking at this graph. What do think about this stock?\" He'd say, \"Why would you pick that stock, you fucking moron?\" and he'd explain things. Finally, something clicked. I realized that a majority of the experts, Brett expected, had no idea what they were doing and only followed the market trends. I found you can hit pretty much every time or you've overlooked something. It taught me absolute, total discipline. You have to be okay with wins and losses. You can't just be looking for the wins and, when the losses happen, you can't buy more and more because you're sure it's going to bounce. We call that revenge trading.", "(2010) I remember saying no when a TV network wanted to give me a holding fee while it came up with another show for me. I got so much shit from my agent, everybody, including my family. Why are you turning this down? Who do you think you are? I'd just go off and hang out with my kids more or go do theater, which I liked but which didn't pay anything. I've heard \"Who do you think you are?\" so many times in my career for the sole reason that I just didn't want to do what somebody else thought I should do.", "(On hosting _Saturday Night Live (1975)_ (qv)) For years, I'd thought about that show - could I actually do it - but then you do it and realize everybody's up all night writing the thing and you're given 60 scripts. You sit around a table trying to be good, but the more you want to be good the worse you are. A great experience but really, really tough.", "(On some film choices prior to _No Country for Old Men (2007)_ (qv)) It was a whole fucking exhausting process to even get the parts I got. I had to fight to get this movie _Into the Blue (2005)_ (qv) so 'Dean Cain' (qv) wouldn't get it. \"I'm 'Josh Brolin' (qv), man\", but the studio was like, \"Goonies was 20 years ago. We want 'Dean Cain' (qv)\". Nothing against Dean, a smart guy who knows a lot of people, but they wanted him instead of me because of what? So I get the movie, but the director didn't appreciate that I ask a lot of questions, that I want to try to tweak things, so it was, \"Whatever, man, do whatever you're going to do. We should have gotten 'Dean Cain' (qv)\".", "(1996, on landing _Flirting with Disaster (1996)_ (qv)) I was living in New York at the time and hanging out with this guy in Los Angeles. I was helping him with his audition (for the part of \"Tony\" in _Flirting with Disaster (1996)_ (qv)) and I ended up falling in love with the script and the character of \"Tony\" as well. To make a long story short - I ended up getting the part I was helping him get. Sorry to say I haven't seen him since.", "(On the armpit licking scene in _Flirting with Disaster (1996)_ (qv)) Okay, so Patricia ('Patricia Arquette' (qv)) and I, we had known each other sort of loosely before. Anyway, we were doing this scene the way the scene was written: We kissed and then 'Ben Stiller' (qv)'s character walks into the room and says, \"What are you doing? How are you doing this?\" But we saw it and it was boring. So I said, \"Well, what if my character had a foot fetish? What if he was sucking on her big toe? He could be talking about her big toe and how beautiful big toes are and how beautiful feet are\". But the director, 'David O. Russell' (qv), was like, \"Uh . . . I don't know\". So then Patricia said, \"What about the armpit?\" And David says, \"Yeah, yeah, that's great\". But I was like, \"I don't know, man\", because I'm thinking, I've got to lick the armpit. And Patricia goes, \"Yeah, you could just lick my armpit\", and she lifted her arm and, I guess because that's how she saw the character, she had grown out all her underarm hair. Then I had, like, a severe reaction. I said, \"No! I don't like that idea. I really like the foot idea. Or maybe we could go with the small of her back. But the underarm thing, I don't think it's proper. It seems a little disgusting to me\". Anyway, they were already on it, that it was working. So we shot it and I had to lick her armpit with the hair. Anyway, we saw the footage, and it was so disgusting that David said, \"We can't have the hair. Patricia has to shave the hair\". So what you see in the film is the third attempt at making that scene playable.", "(2009) I have to tell you, you can't have an ego when you're an actor. A lot of actors have them, but in reality most of those people are just sensitive artists dying for a hug and a compliment.", "(2009) I would fucking wrack my brain like crazy trying to figure out which films I wanted to be in. Is this going to be good? Is this the right filmmaker? What other actors are involved? Where does it shoot? I'd ask myself all these questions rather then follow my instincts. There shouldn't be so many factors. Decisions should be based on two things: great script, great director. Period.", "[on being directed to imitate 'Tommy Lee Jones' (qv) in _Men in Black 3 (2012)_ (qv)] Tommy's voice is like an elusive instrument somebody made up and nobody knows how to play. I never felt I nailed it.", "[on his career, 2012] I like it right now, because I don't feel I've sold out. I feel good about the characters I'm playing and the movies I'm in. I've turned down a lot of 'event' films over the years. Money's neat, money's fun and when somebody's holding out their hands [full of cash], saying 'You want some? You want some?',there's a little bit of withdrawal when you say 'No'.", "[on 'Paul Thomas Anderson' (qv)'s directing style] It's like, Let's go this way, or Let's whisper the lines, and Let's actually take out all the lines and we'll do it like charades once. Or, You know, like hold him - put him on your shoulders and let's do the whole scene like that. He's all over the place. It's just absolute fucking chaos every day, all day. Which is great, 'cause you feel like you've done something.", "[on trying out for a part he didn't get] I did an audition for _The Fly II (1989)_ (qv). I was living in New York at the time, and I went in there, and he's in a cocoon, transforming into a fly. So I walked in and started reading. You do the voice and you're like [choking sounds] you know, doing your thing. And I ended up on the floor, frothing at the mouth. I got back to my apartment and there was already a message on the machine from my agent that said, 'What the fuck did you do in there? You scared them'.", "For twenty years I worked with a lot of people with not a massive amount of talent. And there was always ego, always fights. Working with the Coens - just kicking back a couch and watching them edit - they have two desks that are perpendicular, and Ethan is picking the best takes, and Joel is on the other desk, and when Ethan hits a bell - bing! - Joel looks up and he brings down the take and puts it in. I mean, it's such a simple, amazing process to watch.", "[on being directed by 'Jason Reitman' (qv) in _Labor Day (2013)_ (qv)] For me, with a drama like this that's so laconic in its behavior, I kind of made an ass of myself on the set. A lot of Jason's direction was, 'Please stop moving and fucking around'.", "There's this idea that the more successful you are, the more confidence you have, the more you've arrived. There's something intrinsic in me where I think that's a death. That's the death of an actor, the death of skill, the death of what you've been building toward."], "salary history": ["_No Country for Old Men (2007)_ (qv)::$100,000"], "birth date": "1968-02-12", "birth notes": "Santa Monica, California, USA", "_actorID": "30", "_source": "IMDB", "actorID": "0000982", "created_utc_dt": "08/26/2019, 21:54:08"}