{"headshot": "https://m.media-amazon.com/images/M/MV5BMTM4OTQ4NTU3NV5BMl5BanBnXkFtZTcwNjEwNDU0OQ@@._V1_UX67_CR0,0,67,98_AL_.jpg", "nick names": ["Peenè", "Pinewood", "Piney"], "birth name": "Christopher Whitelaw Pine", "height": "6' (1.83 m)", "mini biography": ["'Chris Pine' (qv) was born in Los Angeles. His parents are actors 'Robert Pine' (qv) and 'Gwynne Gilford' (qv), and his maternal grandparents were 'Max M. Gilford' (qv), a president of the Hollywood Bar Association, and actress 'Anne Gwynne' (qv). His sister, 'Katherine Pine' (qv), has also acted. Chris's ancestry is Russian Jewish (from his maternal grandfather), English, German, Welsh, and French. Pine attended Oakwood School in the San Fernando Valley, and went on to study English at the University of California, Berkeley where he received a bachelor's degree. During this time, he spent one year studying at the University of Leeds in England. Pine also studied acting at the American Conservatory Theater in San Francisco. After embarking on an acting career, Pine won guest roles in many television series, and made his feature film debut opposite 'Anne Hathaway' (qv) in _The Princess Diaries 2: Royal Engagement (2004)_ (qv). Other roles in film and television followed, but he became an international star when he was cast as James T. Kirk in the hugely successful franchise reboot, _Star Trek (2009)_ (qv).He subsequently starred in the films _Unstoppable (2010)_ (qv), _This Means War (2012)_ (qv), _People Like Us (2012)_ (qv), and the sequel _Star Trek Into Darkness (2013)_ (qv). In 2014, Pine co-starred in _Horrible Bosses 2 (2014)_ (qv) and, as Cinderella's Prince, in the musical _Into the Woods (2014)_ (qv), alongside 'Meryl Streep' (qv) and 'Anna Kendrick' (qv). In 2015, he appeared in the thriller _Z for Zachariah (2015)_ (qv), and in 2016, he headlined the sea-set drama _The Finest Hours (2016)_ (qv), the third film in the new Trek universe, _Star Trek Beyond (2016)_ (qv), and the bank robber drama _Hell or High Water (2016)_ (qv). In 2017, Chris played Steve Trevor opposite 'Gal Gadot' (qv) in the title role of _Wonder Woman (2017)_ (qv), a film that became his biggest domestic earner.::Anonymous"], "trade mark": ["Sparkling blue eyes", "Frequently plays mischievous but charming and likable characters"], "trivia": ["Grandson of 'Anne Gwynne' (qv) and 'Max M. Gilford' (qv).", "Son of 'Robert Pine' (qv) and 'Gwynne Gilford' (qv).", "Younger brother of 'Katherine Pine' (qv).", "Cousin of 'Martin Jurow' (qv) and 'William Eliscu' (qv).", "Was ranked #27 on Entertainment Weekly's \"30 Under 30\" the actors list (2008).", "Was seriously considered for the lead role in _TRON: Legacy (2010)_ (qv).", "Beat 'Mike Vogel' (qv) for the role of James T. Kirk in _Star Trek (2009)_ (qv).", "One of Variety magazine's Top Ten Actors to watch (2008).", "Received his Bachelor's degree in English from the University of California, Berkeley.", "Studied acting at the University of Leeds in England and the American Conservatory Theater in San Francisco.", "US Weekly magazine called him \"the new 'Harrison Ford' (qv)\".", "Close friends with his _Star Trek (2009)_ (qv) co-stars 'Zachary Quinto' (qv), 'Karl Urban' (qv), 'Simon Pegg' (qv), 'John Cho' (qv) and 'Anton Yelchin' (qv) (who passed away 06/19/2016).", "Frequents Los Angeles bar The Roger Room along with 'Jason Sarayba' (qv), 'John Mayer' (qv) and 'Samantha Ronson' (qv).", "In 2009, he visited Auschwitz in Poland and the city of Mostar in Bosnia while traveling around Europe.", "Enjoys skeet shooting.", "In April 2009, along with several of the cast and crew, he visited Camp Arijan in Kuwait to show _Star Trek (2009)_ (qv) to a group of US service members.", "After college, he won a place at the prestigious London Academy of Music and Dramatic Art (LAMDA), which has produced luminaries like 'Richard Harris' (qv), 'Jim Broadbent' (qv), 'John Lithgow' (qv), 'Donald Sutherland' (qv), 'Chiwetel Ejiofor' (qv), 'Amy Irving' (qv), 'Stephen Moyer' (qv), etc., but a lack of funds, and the prospect of student loan debts, stopped him from doing this course in London.", "Chris's maternal grandfather, 'Max M. Gilford' (qv) (born Max Goldfarb), was the son of Jewish emigrants from Russia. Chris's other ancestry includes English, French, German and Welsh.", "Auditioned for the role of Jake Sulley in _Avatar (2009)_ (qv) but lost to 'Sam Worthington' (qv). Pine stated that it was the \"worst audition [he's] ever done\".", "At age 27 at the time of filming, was the youngest actor to play the lead in a Star Trek film or series.", "Is the first Star Trek lead to be born after the series began.", "Is very close with his father 'Robert Pine' (qv).", "Has worked with 'Tom Hardy' (qv) in the action comedy _This Means War (2012)_ (qv). Both stars appeared in the very popular Star Trek series. Tom appeared in _Star Trek: Nemesis (2002)_ (qv) and Chris starred in _Star Trek (2009)_ (qv).", "His father acted alongside 'William Shatner' (qv), his predecessor in the role of James T. Kirk, in _Incident on a Dark Street (1973)_ (qv).", "Lives in ultra trendy Los Angeles neighborhood, Los Feliz. 'Giovanni Ribisi' (qv), 'Bo Barrett' (qv), 'Scarlett Johansson' (qv), 'Brad Pitt' (qv), 'Ryan Reynolds' (qv), 'Mark Ruffalo' (qv), 'Kristen Stewart' (qv) and 'Robert Pattinson' (qv) are among the other actors who also call Los Feliz home.", "Pine played Steve Trevor in _Wonder Woman (2017)_ (qv), his look was inspired by Trevor in the Smallville Season 11 comic books.", "Space adventure appears to run in his family. His grandmother, 'Anne Gwynne' (qv), appeared in _Flash Gordon Conquers the Universe (1940)_ (qv). His mother, 'Gwynne Gilford' (qv), appeared in _Masters of the Universe (1987)_ (qv), and he and his father, 'Robert Pine' (qv), have both appeared in the Star Trek franchise.", "He is the first actor to portray Steve Trevor in a live action theatrical film adaptation of _Wonder Woman (2017)_ (qv). Unlike 'Lyle Waggoner' (qv) who performed that same role in the 1970s television series _Wonder Woman (1975)_ (qv), Pine's depiction of Trevor dies at the end of the 2017 film, due to combat.", "His father 'Robert Pine' (qv) appeared on _Star Trek: Voyager (1995)_ (qv) and _Star Trek: Enterprise (2001)_ (qv) before Chris' audition for Captain James T. Kirk in the _Star Trek (2009)_ (qv) remake. 'Robert Pine' (qv) also co-starred with 'Michael Dorn' (qv) on the television series _CHiPs (1977)_ (qv). Dorn is most notable as the Klingon officer Worf on _Star Trek: The Next Generation (1987)_ (qv), _Star Trek: Deep Space Nine (1993)_ (qv) and four Star Trek feature films.", "He was awarded the 2011 Los Angeles Drama Critics Circle Award for Lead Performance for \"The Lieutenant of Inishmore\" at the Mark Taper Forum Theatre in Los Angeles, California.", "He was rumor to played Hal Jordan/Green Lantern in _Green Lantern Corps_ (qv).", "Chris's huge fans are affectionately known as \"Pine Nuts\".", "Born on the same date as 'Macaulay Culkin' (qv).", "It is a common joke among fans of the Marvel Cinematic Universe that they had already cast 'Chris Evans' (qv), 'Chris Hemsworth' (qv), and 'Chris Pratt' (qv), all popular actors born within a span of four years, and that 'Chris Pine' (qv) would join the universe in some capacity soon. Pine has gone against their expectations by starring in _Wonder Woman (2017)_ (qv) in the DC Extended Universe, which is the main rival to Marvel."], "quotes": ["[on fame] If the worst thing that happens in your life is that you're asked the same question repeatedly for a month, and people look very interested while they're talking to you and wanting to know about you, think about every day you worked at that restaurant and every day you worked as a delivery man for Domino's, every day you were a host, every day you were a bartender and worked until 4 a.m. And then just be very grateful.", "[2009] I've seen what can happen to an actor when he's just working for the sake of working. All of a sudden it's ten years later, your career's happened, and you haven't had any control. I still assume that, any day, I'm going to be exposed as a fraud. That, like I once heard 'Gene Hackman' (qv) say, the acting police are going to burst in and take away my card.", "My mom was an actress for many years, and my father has been an actor since he came out here [Hollywood] from New York in 1964 and was under contract at Universal for many years. My grandmother was a B-movie actress at Universal, and my sister was an actress for a while, but then she did a bunch of other stuff... so I've been around it all my life. Growing up in a family of actors, what's great about it is that they're very supportive and they understand what it's like to be an actor - the rejections, the highs and lows... and having a common language with them is great because you have shorthand speech.", "[2006] I believe in luck and fate and I believe in karma, that the energy you put out in the world comes back to meet you. So if you have positive good energy, hopefully good things will come to you from the universe... I definitely have a spiritual outlook. I don't usually read self-help books, but I read a great book by a guy called Wayne Dyer, \"The Power of Intention\", which I loved. I am not a religious guy, I am probably agnostic but I thought what this writer had to say was really powerful. The more you are positive and say I want to have a good life, the more you build that reality for yourself; by creating the life that you want. It is not always the case that things will fall into your lap or that life will be great, but it is all about perspective and having a positive outlook. If something goes wrong, you say, \"That happened for a reason, what can I learn from that and how can I grow?\".", "[2006] I took part in a theater festival in Massachusetts two summers after I graduated from college. Then I was in Los Angeles thinking I am going to go to New York. I had decided that I would not have a chance of a film career, so I was about to make the move. I bought a plane ticket and found a place to live in New York, packed my bags and of course the universe told me that I was not meant to go. Suddenly a week before I was supposed to leave, I had three job offers and one of them was my first movie. I think that when you let go and throw it all away and stop getting attached and say whatever happens, happens, you don't invest too much in anything particular, and things work out. As an actor, it is easy to be so self-critical, saying to yourself, Am I good enough? Am I good looking enough? Am I smart enough? Yet here I am, so I am lucky.", "[2006, on working with 'Lindsay Lohan' (qv)] When I got the job I thought about her a lot. Not only was I getting a great job in a really good movie, but it was with 'Lindsay Lohan' (qv). She is so famous and I don't have any of that. I have never experienced that kind of intense scrutiny that she is under, so of course I wondered what it would be like acting opposite her. I can tell you that it is like being with the Beatles. You cannot fathom the kind of attention she gets. It is mind boggling. We were filming in New Orleans and decided to go to Tulane to a party. But you cannot just \"show up\" to a party with Lindsay, it becomes an event unto itself. You hear the whispers, then the whispers become gaggles of people, then the gaggles of people becomes masses of people and the masses of people bring the paparazzi and then everything becomes exaggerated. If she was drinking water, people would say \"Why is she drinking water?\". So it was a learning experience for me to be around and to see what that was like and to separate fact from fiction. When I was 18 I was an emotional wreck and I couldn't imagine having to deal with that kind of fame, so I would say she dealt with it well and has a lot of grace. I think: good for her. She has met with such a lot of criticism and so I'm glad she is outspoken and opinionated and says what she thinks.", "[on his biggest quirks] I talk to myself, especially in the car. I do it to work through ideas, or if I'm pissed off. I use the interior of the car like it's a [therapist's office].", "[on pre-acting jobs] I worked in a restaurant and in a bakery, and I once worked for my landlord as a construction guy who would repair things in the house. But I was not very good because I do not know a hammer from a screwdriver, so that did not last long.", "[2006] I performed and sang at school but as a child it was never anything I was interested in doing professionally. But it all struck home when I was at college, Berkeley in San Francisco. I was still very shy and I decided to go to the theater to audition and I started doing plays and loved it. So it's all gone on from there. I studied English and actually went to England for a year, to Leeds in the north of the country to study. It was a year abroad and that was wonderful. I had the time of my life. Everybody always talks about a dying passion for acting, but it never really happened for me that way, it happened so organically. Right now I cannot see myself doing anything else because it is so fascinating and a lot of it is really about human psychology. But I do have other interests like writing and playing music.", "[on watching his own films] I am critical of myself like everyone else. You go to a movie theater and you are forty feet high. I had bad skin as a teenager and I am a shy person, but I think I am in the perfect business to fight my insecurities. You have to learn to love yourself and say \"I am pretty cool\" instead of being so critical. You can easily fall into the trap of doing that.", "[on kissing 'Lindsay Lohan' (qv) during the masquerade ball scene in _Just My Luck (2006)_ (qv)] Well at the time I was really sick with a fever. In fact, my sister came to stay, to take care of me. So I wasn't feeling well, and we were shooting amongst a huge crowd of extras. It is supposed to be an intimate scene, we are dancing, but of course it was not like that at all. There was no music and I was being yelled at, \"To the left! I need to see the left side of your face.\" It could not be more artificial, but she was great and we laughed about it. It did feel awkward but we got into the rhythm of it. She was a great kisser, she has great big lips and she is gorgeous.", "There have been, like, three auditions in my life where I feel like I'm in a _Saturday Night Live (1975)_ (qv) skit. One was for _Avatar (2009)_ (qv), which was probably the worst audition I ever gave. Another was for _10,000 BC (2008)_ (qv), where I was just, like, on my haunches pretending to be in a loincloth in Burbank. Then the other one was _Star Trek (2009)_ (qv). It was all this jargon talk of torpedoes and photons.", "[on portraying Captain James T. Kirk in _Star Trek Into Darkness (2013)_ (qv)] At this point, he isn't really the captain of the Enterprise. So the journey of this film is to see the non-captain in a position of nominal power, but psychologically and emotionally going through some sort of age existential crisis, where he's riddled with self-doubt and confusion and fears that he may not be the best man for the job. That was really exciting and kind of took the majority of my thought and time space.", "[on filming _Just My Luck (2006)_ (qv) with 'Lindsay Lohan' (qv)] It was a real cyclone of insanity, like being around The Beatles. It was fascinating to watch, and in hindsight it's really a distinct moment in someone's life when you see what's really wonderful about what we get to do and what's really dangerous about it.", "Hollywood is like living in a weird bubble. A bunch of people take care of you and get you stuff, and you're the center of that little microcosmic world. You start believing that it is real and... you deserve it."], "salary history": ["_Unstoppable (2010)_ (qv)::$3,000,000", "_This Means War (2012)_ (qv)::$5,000,000 w/ $1,000,000 bonus if profitable", "_People Like Us (2012)_ (qv)::$4,250,000 w/ $750,000 bonus if profitable", "_Star Trek Into Darkness (2013)_ (qv)::$1,500,000 w/ $500,000 bonus if profitable", "_Jack Ryan: Shadow Recruit (2014)_ (qv)::$4,000,000", "_Star Trek Beyond (2016)_ (qv)::$6,000,000"], "birth date": "1980-08-26", "birth notes": "Los Angeles, California, USA", "_actorID": "96", "_source": "IMDB", "actorID": "1517976", "created_utc_dt": "08/26/2019, 21:54:52"}