{"_movieID": "274167", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:52:55", "summary": "Daddy's Home is a 2015 American comedy film directed by Sean Anders and written by Anders, Brian Burns, and John Morris. The film is about a mild-mannered step-father (Will Ferrell) who vies for the attention of his wife's (Linda Cardellini) children when their biological father (Mark Wahlberg) returns.\nThe second collaboration between Ferrell and Wahlberg following the 2010 film The Other Guys, principal photography began on November 17, 2014 in New Orleans, Louisiana. The film was released on December 25, 2015, by Paramount Pictures and grossed $242 million worldwide, becoming Ferrell's highest-grossing live-action film. A sequel, Daddy's Home 2, was released on November 10, 2017.", "plot": "Mild-mannered radio executive Brad Whitaker struggles to be a good stepfather to his wife Sara's two children, Megan and Dylan, and is seemingly sterile after an accident to his testicles some years ago. The children begin to grow closer to Brad, with Dylan confiding in him that he is being picked on at school and Megan asking him to take her to a father/daughter dance at her school. One night, the kids' biological father, Sara's ex-husband Dusty Mayron, calls and discovers Sara's marriage with Brad. He suddenly announces he will be visiting the next day. Sara hesitates to let her ex-husband into their home, but Brad convinces her that it is important for the kids that their father and stepfather establish a respectful relationship.\nWhen Dusty arrives, Brad is immediately intimidated by his tough and muscular appearance and his charm with Megan and Dylan. Dusty repeatedly talks Brad into letting him stay, despite Sara warning about Dusty's true nature. Brad soon wises up when it becomes clear that Dusty intends to drive Brad out of his kids' lives and reconcile with Sara. After Dusty shows Brad up again and again - getting the kids a dog, finishing a treehouse that Brad wanted to build with Dylan, making Brad appear to be racist - Dusty tries to drive a wedge between Brad and Sara by taking them to a fertility doctor, hoping that Brad's inability to give Sara a baby will send her into Dusty's arms. Still, the two men appear to reach an understanding after working together to teach Dylan how to defend himself. Additionally, Brad and Sara are overjoyed to learn that Brad's sperm count has increased significantly (implied to be a result of Dusty \"invading his territory\"), giving them hope of having a child together.\nHowever, Brad is stunned when Dusty reveals that he still intends to drive Brad out of the family. Desperate, Brad spends tens of thousands of dollars on early Christmas gifts, including a pony and $18,000 basketball tickets. At the game, Dusty once again shows Brad up by revealing himself to be friends with the coach of Dylan's favorite team, and an enraged Brad begins drinking heavily. During half-time, Brad is chosen to try to shoot a basketball to win a prize. Drunk, Brad goes on a rant about Dusty before accidentally pelting a cheerleader and a disabled child in a wheelchair in the face with basketballs. Humiliated, Brad moves out of the house; however, when Dusty tries to comfort Sara, she rejects him, and forces him to step up as a dad to help his kids with their busy schedules.\nFour days later, Brad is living in his office at work, depressed. Dusty, meanwhile, is overwhelmed by the responsibilities of being a full-time father. When Dusty decides to call it quits and leave on the day of Megan's father-daughter dance, his friend Griff goes to Brad and convinces him to fight for his family. Brad catches Dusty at a bar and tries to get him to come back. Dusty admits that he cannot handle the hard parts about being a father, and admires Brad for putting up with all the things that he has to go through. Brad says that all of the terrible parts about being a dad are worth it, because in the end he is doing it for his kids. This convinces Dusty to go to the dance, and he and Brad arrive together. There, they discover that the classmate who was picking on Dylan at school is a girl named Serendipity, and almost get into a fight with her father when Dylan physically retaliates. However, Dusty finally decides to follow Brad's lead on being a father, and instead quells the fight by starting a dance-off. Brad and Sara reconcile, and Dusty decides to stay and be a good \"co-dad\" to his kids.\nLater, the whole family is happy; Brad and Sara have a new baby boy named after Griff, and Megan and Dylan have finally accepted Brad as their stepfather. Dusty, who now has a job as a Panda DJ and becomes wealthy through his work, has moved in across the street after building a castle there, and he and Brad are now friends. Dusty eventually remarries, to a woman named Karen who has a daughter Adrianna, thus Dusty becomes a stepfather himself. Sara is immediately intimidated by Karen after meeting her; she feels that Karen's looks surpass hers and she is jealous of the latter's professions as a doctor and a novelist. In an ironic twist of fate, Dusty is now in exactly the same position that he put Brad in a year ago – visibly intimidated by his stepdaughter's more muscular father, Roger (John Cena)."}