{"_movieID": "337339", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:48", "summary": "The Fate of the Furious (alternatively known as Fast & Furious 8 and Fast 8, and often stylized as F8) is a 2017 American action film directed by F. Gary Gray and written by Chris Morgan. It is the eighth installment in The Fast and the Furious franchise. The film stars Vin Diesel, Dwayne Johnson, Jason Statham, Michelle Rodriguez, Tyrese Gibson, Chris \"Ludacris\" Bridges, Scott Eastwood, Nathalie Emmanuel, Elsa Pataky, Kurt Russell and Charlize Theron. The Fate of the Furious follows Dominic Toretto (Diesel), who has settled down with his wife Letty Ortiz (Rodriguez), until cyberterrorist Cipher (Theron) coerces him into working for her and turns him against his team, forcing them to find Dom and take down Cipher.\nThe Fate of the Furious marks the first installment in the franchise since The Fast and the Furious: Tokyo Drift (2006) not to feature both Paul Walker, who died on November 30, 2013 in a single-vehicle crash while the filming of Furious 7 (2015) was still in progress, and Jordana Brewster. Script rewrites to the seventh installment after Walker's death were intended to complete the story arcs for both of their characters (Brian O'Conner and Mia Toretto, respectively).\nPlans for an eighth installment were first announced in March 2015 when Diesel appeared on Jimmy Kimmel Live! and announced that the film would be set in New York City. Preparations for the film began immediately after the release of Furious 7, with Diesel, Morgan and producer Neal H. Moritz re-signing. After setting an initial release date in the same month, casting took place between April and June 2015. In October 2015, Gray was announced to direct the film in the place of James Wan, who had directed the previous installment. Principal photography began in March 2016 in locations such as Mývatn, Havana, Atlanta, Cleveland and New York City, continuing the franchise's tradition of filming in exotic locations around the world.The Fate of the Furious premiered in Berlin on April 4, 2017 and was theatrically released in conventional and IMAX theaters in the United States on April 14, 2017 while also playing in 3D, IMAX 3D, and 4DX internationally. The film received mixed reviews from critics, many of whom praised the action sequences and acting performances but criticized the storyline. The film grossed over $1.2 billion worldwide, making it the thirtieth film (and the second in the franchise, after Furious 7) to gross over $1 billion, the third-highest-grossing film of 2017 and the 11th highest-grossing film of all-time. It also grossed $542 million worldwide during its opening weekend, which was the highest of all-time. A sequel is scheduled to be released on May 22, 2020.", "plot": "Dominic \"Dom\" Toretto and Letty Ortiz are on their honeymoon in Havana when Dom's cousin Fernando gets in trouble owing money to local racer Raldo. Sensing Raldo is a loan shark, Dom challenges Raldo to a race, pitting Fernando's reworked car against Raldo's, and wagering his own show car. After narrowly winning the race, Dom allows Raldo to keep his car, earning his respect, and instead leaves his cousin with his show car.\nThe next day, Dom is approached by the elusive cyberterrorist Cipher who coerces him into working for her by showing him an unseen photo. Shortly afterwards, Dom and his team, comprising Letty, Roman Pearce, Tej Parker, and Ramsey, are recruited by Diplomatic Security Service (DSS) agent Luke Hobbs to help him retrieve an EMP device from a military outpost in Berlin. During the getaway, Dom goes rogue, forcing Hobbs off the road and stealing the device for Cipher. Hobbs is arrested and locked up in the same high-security prison in which he helped imprison Deckard Shaw. After Shaw and Hobbs both escape the prison, they are recruited by intelligence operative Mr. Nobody and his protégé to help the team find Dom and capture Cipher. Shaw reveals that Cipher had hired his brother Owen to steal the Nightshade device and Mose Jakande to steal God's Eye, Ramsey's software program. The team tracks Dom and Cipher to their very location just as the latter two attack the base, causing injuries to the team, and stealing God's Eye. When Dom questions Cipher's motives, she reveals that she has been holding hostage Dom's ex-lover and DSS agent Elena Neves—as well as their son, of whose existence Dom was previously unaware. Elena tells Dom that she wanted him to decide the child's first name, having already given him the middle name Marcos.\nIn New York City, Cipher sends Dom to retrieve a nuclear football held by the Russian Minister of Defense. Prior to the theft, Dom briefly evades Cipher—with the help of Raldo—and persuades Shaw's mother, Magdalene Shaw, to help him. Cipher hacks into the electronics systems of a large number of cars, causing them to disable the convoy so that Dom can take the football. The team intercepts Dom, but Dom escapes, shooting and apparently killing Shaw in the process. Letty catches up to Dom, but is ambushed and nearly killed by Cipher's enforcer, Connor Rhodes, before Dom rescues her. In retaliation, Cipher has Rhodes execute Elena in front of Dom.\nDom infiltrates a base in Russia to use the EMP device to disable their security and then to disable a nuclear submarine, enabling Cipher to hijack it and attempt to use its arsenal to trigger a nuclear war. They are once again intercepted by the team, who attempt to shut down the sub, and then drive out toward the gates that would prevent the sub from leaving into open waters. Meanwhile, Shaw, whose death was faked, teams up with Owen, and at Magdalene's behest, infiltrates Cipher's plane to rescue Dom's son. Once Shaw reports that the child is safe, Dom turns on Cipher and kills Rhodes, before rejoining his team. Outraged, Cipher fires an infrared homing missile at Dom, but he breaks away from his team and maneuvers around it, causing the missile to hit the submarine instead. The team quickly forms a vehicular blockade around Dom, shielding him from the ensuing explosion. Shaw reaches the front of the plane and confronts Cipher, who jumps from the plane with a parachute.\nMr. Nobody and his protégé visit Dom and his team in New York City to report that Cipher is still at large in Athens. Hobbs is offered his DSS job back, but he declines in order to spend more time with his daughter. Shaw delivers Dom his son, putting his differences aside with Dom and Hobbs. Dom names his son Brian, after his friend and brother-in-law Brian O'Conner, and celebrates with his friends.", "cast": "Vin Diesel as Dominic Toretto, a former criminal and professional street racer who has retired and settled down with his wife, Letty. He is coerced by Cipher to work against his team.\nDwayne Johnson as Luke Hobbs, a Diplomatic Security Service (DSS) agent who allied with Dom and his team following their outings in Rio de Janeiro and Europe.\nJason Statham as Deckard Shaw, a rogue British Special Forces assassin who was imprisoned by Hobbs and the DSS after his defeat in Los Angeles, who serves as an ally to help Dom's team take down Cipher.\nMichelle Rodriguez as Letty Ortiz, Dom's wife and a former professional street racer.\nTyrese Gibson as Roman Pearce, a former criminal from Barstow and a member of Dom's team.\nChris \"Ludacris\" Bridges as Tej Parker, a mechanic from Miami and a member of Dom's team.\nScott Eastwood as Eric Reisner / Little Nobody, a law enforcement agent working under Mr. Nobody.\nNathalie Emmanuel as Ramsey, a computer hacktivist and a member of Dom's team.\nElsa Pataky as Elena Neves, the mother of Dom's child and a former Rio de Janeiro police officer who moved to the United States to become Hobbs' new partner at the DSS.\nKurt Russell as Mr. Nobody, an intelligence operative and the leader of a covert ops team which previously aided Dom and his team in taking down Deckard in Abu Dhabi.\nCharlize Theron as Cipher, a criminal mastermind and cyberterrorist who coerces Dom into working against his team by holding Elena and their son hostage.Tego Calderón and Don Omar reprise their roles from previous films as Tego Leo and Rico Santos, former members of Dom's team from the Dominican Republic and Rio de Janeiro, respectively. Luke Evans reprises his role from Fast & Furious 6 (2013) as Owen Shaw, Deckard's younger brother and a former Special Air Service (SAS) soldier who formerly opposed Dom's team in Europe, and who helps his brother in rescuing Dom's son. Kristofer Hivju appears as Connor Rhodes, Cipher's enforcer and right-hand man. Patrick St. Esprit appears as DS Allen. Helen Mirren makes an uncredited cameo appearance as Magdalene Shaw, the mother of Deckard and Owen Shaw. Celestino Cornielle portrays Raldo, a street racer whose respect Dom earns."}