{"_movieID": "82992", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:40", "summary": "Fast & Furious 6 (also known as Furious 6 or Fast Six) is a 2013 American action film directed by Justin Lin and written by Chris Morgan. It is the sixth installment in The Fast and the Furious franchise. Fast & Furious 6 follows a professional criminal gang led by Dominic Toretto (Vin Diesel), who are offered amnesty for their crimes by U.S. Diplomatic Security Service (DSS) agent Luke Hobbs (Dwayne Johnson), in exchange for helping him take down a skilled mercenary organization led by Owen Shaw (Luke Evans), one member of which is Toretto's former lover Letty Ortiz (Michelle Rodriguez).\nAfter departing from the street racing theme of previous films in Fast Five (2011) to great commercial and critical success, developers approached Fast & Furious 6 with the aim to transform the franchise further, incorporating elements of spy and adventure film, in the hopes of increasing audience numbers further. \nPre-production begun in April 2011, and principal photography began in London in July 2012, and featured several international filming locations, including the Canary Islands, Glasgow, and Los Angeles.\nFast & Furious 6 first opened in the United Kingdom on May 17, 2013, and was released internationally on May 24, 2013. It achieved financial success, setting box office records as the sixth highest-grossing film released in 2013, the second highest-grossing film in Universal Studios history, and it surpassed Fast Five (2011) to become the highest-grossing film in the franchise. Fast & Furious 6 grossed over $788 million worldwide, ranking it number 85 on the all-time worldwide list of highest-grossing films.\nFast & Furious 6 received mostly positive reviews, with critics highlighting the likable cast, action sequences, Lin's direction, and the film's ability to immerse the audience in the high speed chases and conflict between the two opposing gangs. However, many were critical of the film's dialogue, and scenes of character progression. A sequel, Furious 7, released in April 2015, eventually surpassed Fast & Furious 6 as the highest-grossing film in the franchise, earning over $1.5 billion worldwide.", "plot": "Following their successful heist in Brazil, Dominic \"Dom\" Toretto and his professional criminal crew have fled around the world and are living peacefully: Dom lives with Elena; his sister Mia lives with Brian O'Conner and their son, Jack; Gisele and Han are together; and Roman and Tej live in luxury. Meanwhile, DSS agent Luke Hobbs and Riley Hicks investigate the destruction of a Russian military convoy by a crew led by former British SAS Major and special ops soldier Owen Shaw. Hobbs persuades Dom to help capture Shaw by showing him a photo of his supposedly murdered girlfriend, Letty Ortiz. Dom and his crew accept the mission in exchange for their amnesty and allowing them to return to the United States.\nIn London, Shaw's hideout is found, but this is revealed to be a trap, distracting them and the police while Shaw's crew performs a heist at an Interpol building. Shaw flees by car, detonating his hideout and disabling most of the police, leaving Dom, Brian, Tej, Han, Gisele, Hobbs, and Riley to pursue him. Letty arrives to help Shaw, shooting Dom without hesitation before escaping. Back at their headquarters, Hobbs tells Dom's crew that Shaw is stealing components to create a deadly device, intending to sell it to the highest bidder. Meanwhile, Shaw's investigation into the opposing crew reveals Letty's relationship with Dom, but she is revealed to be suffering from amnesia. Dominic's crew learns that Shaw is connected to a drug lord who was imprisoned by Brian, Arturo Braga. Brian returns to Los Angeles as a prisoner to question Braga, who says Letty survived the explosion that seemingly killed her; Shaw took her in after discovering her amnesia. With FBI help, Brian is released from prison, regrouping with the team in London.\nDom challenges Letty in a street racing competition; afterward, he returns her cross necklace he had kept. After Letty leaves, Shaw offers Dom a chance to walk away, threatening to otherwise hurt his family, but Dom refuses. Tej tracks Shaw's next attack to a Spanish NATO base. Shaw's crew assaults a highway military convoy carrying a computer chip to complete his device. Dom's crew interferes, while Shaw, accompanied by Letty, commandeers a tank, destroying cars en route. Brian and Roman manage to flip the tank before it causes further damage, resulting in Letty being thrown from the vehicle, though Dom saves her. Shaw and his crew are captured, but reveal Mia has been kidnapped by Shaw's henchmen Vegh and Klaus. Hobbs is forced to release Shaw, and Riley, revealed to be Shaw's covert accomplice, leaves with him; Letty chooses to remain with Dom.\nShaw's group board a large moving aircraft on a runway as Dom's crew gives chase. Dom, Letty, and Brian board the craft; Brian rescues Mia, escaping in an onboard car. The plane attempts to take-off but is held down by excess weight as the rest of the team tether the plane to their vehicles. Gisele sacrifices herself to save Han from Shaw's henchman, who Han then kills. Letty kills Riley and escapes to safety, but Dom pursues Shaw and the computer chip. As the plane crashes into the ground, Shaw is thrown from it, seriously injuring him, and Dom drives a car out of the exploding plane. Dom reunites with his crew and gives the chip to Hobbs to secure their pardons. Dom and the others return to his old family home in Los Angeles. Hobbs and Elena, now working together, arrive to confirm the crew's freedom; Elena accepts that Dom loves Letty. As Roman says grace over the crew's meal, Dom asks Letty if the gathering feels familiar; she answers \"no, but it feels like home.\"\nIn a mid-credits scene, in Tokyo, Han is involved in a car chase when he is suddenly broadsided by an oncoming car. The driver walks away from the scene after leaving Letty's cross necklace by the crash, and calls Dom as Han's car fatally explodes, saying, \"You don't know me. You're about to.\"", "cast": "Vin Diesel as Dominic Toretto, a former criminal, and professional street racer who has retired after their successful heist of $100 million with his crew in Brazil and is now staying with Elena.\nPaul Walker as Brian O'Conner, a former FBI agent turned criminal and professional street racer who has retired and settled down with his girlfriend, Mia, and their son, Jack.\nDwayne Johnson as Luke Hobbs, a loyal agent working for the Diplomatic Security Service (DSS) who allies with Dom following his last encounter with Dom and his team in Rio de Janeiro.\nMichelle Rodriguez as Letty Ortiz, Dom's wife who has suffered from amnesia and was presumed dead in Fast & Furious  following an undercover assignment as Brian's informant. She was found by Shaw, and suffers amnesia. She is working alongside his crew, but later chooses to remain with Dom and his team.\nJordana Brewster as Mia Toretto, Dom's sister, a former member of his team, and Brian's girlfriend and mother of his child.\nTyrese Gibson as Roman Pearce, a former criminal from Barstow and Brian's childhood friend, as well as a member of Dom's team.\nChris \"Ludacris\" Bridges as Tej Parker, an ex-street racer and mechanic, as well as Brian and Roman's friend who was introduced in Miami, also a member of Dom's team.\nSung Kang as Han Seoul-Oh, a professional street racer and Dom's former business partner in the Dominican Republic, also a member of his team. He is in a relationship with Gisele.\nGal Gadot as Gisele Yashar, a former Mossad agent who previously worked as a liaison for Braga and aided Dom and Brian in capturing him by revealing his hideout in Mexico. She has since become one of the members on Dom's team. She is also in a relationship with Han and reveals she also saved Letty during the confrontation by one of Braga's henchmen.\nLuke Evans as Owen Shaw, a former British SAS soldier who leads a group of skilled mercenaries to steal high-tech devices worth billions on the black market. He hijacked a military convoy, which brings him into conflict with Dom.\nGina Carano as Riley Hicks, a DSS agent who partners up with Hobbs to take down Shaw's mercenaries. She is later revealed to be Shaw's double agent who secretly helps Shaw and his team escape custody during his chase in Spain.\nJohn Ortiz as Arturo Braga, an ex-drug lord who was imprisoned by Brian, who is revealed to have a connection to Shaw after his last encounter with Brian.\nShea Whigham as Stasiak, a sarcastic FBI agent and Brian's former colleague who was formerly at odds with Brian.\nElsa Pataky as Elena Neves, a former Rio police officer who has moved into the United States, since becoming Dom's love interest and later working alongside Hobbs as his new partner in the DSS.\nDavid Ajala as Ivory, a member of Shaw's team, who is a lethal killer alongside Jah. While attempting to flee on his motorcycle, he is shot dead by Gisele.\nKim Kold as Klaus, a member of Shaw's team who is a body builder and strongman, as well as a hacker at ease.\nThure Lindhardt as Firuz, a member of Shaw's team, who works as a mechanic, providing Shaw's team with flip cars and harpoon guns. He is killed in a shootout while trying to kill Gisele and Riley.\nJoe Taslim as Jah, a member of Shaw's team who is cold-blooded and skilled with martial arts and parkour during his fight with Han and Roman.\nClara Paget as Vegh, Shaw's right-hand woman, and a highly trained female assassin in his team.\nBenjamin Davies as Adolfson, a member of Shaw's team, who acts as a sniper and infiltrator, providing cover for his team while allowing the others to escape.\nRita Ora has an uncredited cameo role in the film.\nJason Statham appears uncredited in a cameo scene amid the end credits."}