{"_movieID": "401561", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:31", "summary": "Mom and Dad (known as  The Family Story in the United Kingdom) is a feature-length 1945 film directed by William Beaudine, and largely produced by the exploitation film maker and presenter Kroger Babb. Mom and Dad is considered the most successful film within its genre of \"sex hygiene\" films. Although it faced numerous legal challenges and was condemned by the National Legion of Decency, it became one of the highest-grossing films of the 1940s.\nThe film is regarded as an exploitation film as it was repackaged controversial content designed to establish an educational value that might circumvent U.S. censorship laws.  Babb's marketing of his film incorporated old-style medicine show techniques, and used unique promotions to build an audience. These formed a template for his later works, which were imitated by his contemporary filmmakers. In 2005, the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\". The Academy Film Archive preserved Mom and Dad in 2010.\n\n", "plot": "Mom and Dad tells the story of Joan Blake (June Carlson), a young girl who falls for the pilot Jack Griffin (Bob Lowell). After being sweet talked by Griffin, she has sex with him. The girl requests \"hygiene books\" from her mother Sarah Blake (Lois Austin); however, the mother refuses because the girl is not yet married.  The girl later learns from her father Dan Blake (George Eldredge) that the pilot has died in a crash. She tears up a letter she had been writing to him, and lowers her head as the film fades into intermission.\nThe film resumes at the point when the girl discovers that her clothes no longer fit, sending her into a state of despair.  She takes advice from her teacher, Carl Blackburn (Hardie Albright), who had previously been fired for teaching sex education. Blackburn blames her mother for the problem, and accuses her of \"neglect[ing] the sacred duty of telling their children the real truth.\"  Only then is the girl able to confront her mother.The film then presents reels and charts that include graphic images of the female anatomy and footage of live births – one natural and one Caesarian.  In some screenings, a second film was shown along with Mom and Dad, and contained images portraying syphilis and venereal disease.  Mom and Dad is believed to have had a number of endings, although most typically concluded with the birth of the girl's child, sometimes stillborn and other times put up for adoption.", "cast": "Hardie Albright – Carl Blackburn, the teacher.\nLois Austin – Sarah Blake, the mother.\nGeorge Eldredge – Dan Blake, the father.\nJune Carlson – Joan Blake, the teen-age girl.\nJimmy Clark – Joan's brother.\nBob Lowell – Jack Griffin, the pilot.\nJane Isbell – Mary Lou, Joan's friend.\nJimmy Zaner – Allen Curtis, Joan's hometown boyfriend.\nRobert Filmer – Superintendent McMann.\nWilla Pearl Curtis – Junella, the Blake family's African-American maid.\nVirginia Van – Virginia, Dave's girlfriend.\nForrest Taylor – Dr. Ashley, the obstetrician.\nJack Roper – The coach.The official credits also acknowledge The Four Liphams as well as the California State Champion dancers of the jitterbug."}