{"_movieID": "340275", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:52:04", "summary": "Chi-Raq () is a 2015 American musical crime comedy-drama film, directed and produced by Spike Lee and co-written by Lee and Kevin Willmott. Set in Chicago, the film focuses on the gang violence prevalent in neighborhoods on the city's south side, particularly the Englewood neighborhood.The story is based on Aristophanes' Lysistrata, a Classical Greek comedy play in which women withhold sex from their husbands as punishment for fighting in the Peloponnesian War. It stars Nick Cannon, Wesley Snipes, Teyonah Parris, Jennifer Hudson, Angela Bassett, John Cusack, and Samuel L. Jackson.\nIt was the first film to be produced by Amazon Studios, released in select theaters on December 4, 2015 and on their video on demand service Amazon Instant Video on December 29.", "plot": "In Chicago's Southside, as the effects are narrated by Dolemedes, a war rages between two rival gangs: the Spartans, led by rapper/gang leader Demetrius Dupree, nicknamed \"Chi-Raq\" and the Trojans, led by gang lord Cyclops. Demetrius's lover, Lysistrata, grows disillusioned after several outbursts of violence near her, including a shootout at Demetrius's concert, an arson attack at their home while the two are having sex and a young girl, Patti, being accidentally killed in a gang shooting, revealed as the daughter of Irene. Lysistrata moves in after the fire with Miss Helen Worthy, a well-read non-violence advocate who suggests she research about Leymah Gbowee, who led a peace movement to stop the Second Liberian Civil War and threatened a sex strike. Inspired by Worthy and Gbowee, Lysistrata organizes a meeting between herself, the Spartans' lovers and the Trojans' lovers, where they agree to withhold sex until the men agree to lay down arms, hence their plea, \"No Peace, No Pussy.\"\nThe strike rapidly spreads across the city, with women of many neighborhoods and occupations joining the boycott. Despite its enormous membership, the Spartans and the Trojans refuse to cease their war. Following a funeral for Irene's young daughter Patti, Lysistrata speaks with the local preacher Fr. Mike Corridan, who argues passionately against the American institutions that profit from the South Side's wars. Deciding that the problem is bigger than the gangs' resentment, Lysistrata and her women seduce their way into a military armory and capture it from its soldiers and their general, General King Kong.\nThe takeover of the armory sparks a national crisis, with the military and the police surrounding the site but are barred from storming it as it was taken by merely 75 unarmed women who are not holding any prisoners. The women's actions also cause their boycott to become famous worldwide, with women from countries all over the world organizing their own sex strikes. Planned by Mayor McCloud and Commissioner Blades, The military tries to lure the women in the armory out by playing seductive music but it fails after the women find the military's earplugs and the men themselves become unbearably sex-starved from the music.\nAfter three months, Cyclops's and Demetrius's gangs begin to grow disillusioned, from the absence of sex and from having plenty of time to think over their fate in a gang. Demetrius remains too stubborn to give up the Spartans but agrees to organize a meeting with Lysistrata after the boycott spreads to Mayor McCloud's wife and to the First Lady of the United States. The city arranges a deal: Demetrius and Lysistrata will meet each other in bed and whoever climaxes first loses and must agree to the other's terms. The deal is cut short by Cyclops arriving to declare he and the Trojans are laying down their guns.\nThe following day, a truce is organized, with Lysistrata, Mayor McCloud, the mayor of Chicago, and Cyclops signing a deal to end gun violence and build new hospitals and trauma centers. Demetrius refuses to sign and walks away but is ultimately moved by Miss Worthy's testimony of the death of her daughter confessed to by Demetrius's father, Jamel Dupree. He admits that he was the one who killed Irene's daughter and gives himself up for arrest."}