{"_movieID": "332411", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:52:30", "summary": "I Am Wrath is a 2016 American action thriller film directed by Chuck Russell and written by Yvan Gauthier and Paul Sloan. The film stars John Travolta, Christopher Meloni, Sam Trammell, Amanda Schull, Rebecca De Mornay, Melissa Bolona and Luis Da Silva. Principal photography on the film began on March 9, 2015, in Columbus, Ohio.\n\n", "plot": "In the midst of an unprecedented crime wave in the city of Columbus, Ohio, Governor John Meserve (Patrick St. Esprit) gives a press conference about his crime reduction efforts. When questioned by protestors about a proposed pipeline, Meserve promises that he has commissioned an independent study of the pipeline. Abbie Hill (Amanda Schull) and her family are watching the press conference, and they are thrilled that the Governor has referenced the work her mother Vivian (Rebecca De Mornay) is doing.\nVivian heads to the airport to pick up her husband Stanley (John Travolta), who has returned from a job interview to manage a factory in California. When they arrive at their car, they notice one of the tires is flat. Before Stanley can fix it, a man approaches and asks them for money. Stanley politely refuses, but another man sneaks up on Stanley and stuns him with a blow to the head. The first man stabs Vivian and takes her wallet. Stanley watches the men flee.\nThe police use Stanley's descriptions to quickly capture the man who killed Vivian. However, they let him go after Stanley positively identifies him. This enrages Stanley (who now goes by the name \"Wrath\"), and now that he knows the man's name is Charley, he starts to stalk him. When he sees a carefree Charley on the street, Wrath goes home and retrieves a case from behind a wall. The case has several passports, foreign currencies, and several weapons. He calls Dennis (Christopher Meloni), his friend from the Special Forces, and asks him for information about Charley and his crew. Dennis runs black operations from beneath a barbershop.\nWrath uses Dennis intelligence to track down one of the men who attacked him at a local bar. As the man lies dying, he hints that Vivian's murder was more than just a robbery. Wrath and Dennis are photographed as they dispose of the body. Local crime lord Lemi K (Sloan) is furious when he sees the photograph, and he orders hits on the men who killed one of his crew.\nWrath tracks down another man who was involved in the attack. He confronts him at a tattoo parlor, after getting the words \"I Am Wrath\" tattooed on his back. After killing the man, Wrath makes off with a bag full of drugs and money. Wrath and Dennis use the bag as bait to lure Charley to the VIP room at a Korean nightclub. Before being killed, Charley tells Wrath that Vivian's murder was ordered by Lemi because she was too nosy.\nLemi has tracked down Abbie and is holding her hostage. Wrath and Dennis arrive and kill Lemi. When two corrupt cops arrive, Wrath realizes the entire plot was organized by Governor Meserve. He infiltrates the Governor's mansion and murders him. When the police arrive, Wrath raises a weapon, prompting them to shoot him in his bulletproof vest. While he recovers in the hospital, one of the corrupt cops tries to assassinate Wrath, but Wrath shoots him with a hidden gun. Dennis spirits Wrath away from the hospital, and the film ends with Abbie reading a postcard from Wrath (who has changed his name back to Stanley) that he sent from Sao Paulo, Brazil.", "cast": "John Travolta as Stanley Hill/Wrath\nChristopher Meloni as Dennis \nAmanda Schull as Abbie Hill\nRebecca De Mornay as Vivian Hill\nSam Trammell as Detective Gilmore\nLuis Da Silva as Charley\nPaul Sloan as Lemi K\nPatrick St. Esprit as Governor  John Meserve\nJames Logan as Lars (Tattoo Artist)\nThomas Newhard as Bar Patron/ Drunk\nMelissa Bolona as Reporter #1"}