{"_movieID": "64688", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:07", "summary": "21 Jump Street is an American police procedural television series that aired on the Fox network and in first run syndication from April 12, 1987, to April 27, 1991, with a total of 103 episodes. The series focuses on a squad of youthful-looking undercover police officers investigating crimes in high schools, colleges, and other teenage venues. It was originally going to be titled Jump Street Chapel, after the deconsecrated church building in which the unit has its headquarters, but was changed at Fox's request so as not to mislead viewers into thinking it was a religious program.\nCreated by Patrick Hasburgh and Stephen J. Cannell, the series was produced by Patrick Hasburgh Productions and Stephen J. Cannell Productions in association with 20th Century Fox Television. Executive Producers included Hasburgh, Cannell, Steve Beers and Bill Nuss. The show was an early hit for the fledgling Fox network, and was created to attract a younger audience. The final season aired in first-run syndication mainly on local Fox affiliates. It was later rerun on the FX cable network from 1996 to 1998. All 5 seasons are currently available for download on Amazon.\nThe series provided a spark to Johnny Depp's nascent acting career, garnering him national recognition as a teen idol. Depp found this status irritating, but he continued on the series under his contract and was paid $45,000 per episode. Eventually he was released from his contract after the fourth season.A spin-off series, Booker, was produced for the character of Dennis Booker (Richard Grieco); it ran one season, from September 1989 to June 1990. \nA film adaptation directed by Phil Lord and Chris Miller was released on March 16, 2012. The film is set in the same continuity as the series, with Johnny Depp, Holly Robinson and Peter DeLuise reprising their characters in cameo appearances. Richard Grieco and Dustin Nguyen also have cameos in the 2014 film sequel 22 Jump Street.", "cast": "The show starred:\n\nJohnny Depp as Officer Tom Hanson (1987–1990)\nHolly Robinson as Sergeant Judith \"Judy\" Hoffs (1987–1991)\nPeter DeLuise as Officer Douglas \"Doug\" Penhall (1987–1990)\nDustin Nguyen as Sergeant Harry Truman Ioki/Vinh Van Tran (H.T. Ioki) (1987–1990)\nFrederic Forrest as Captain Richard Jenko (season 1, first 6 episodes)\nSteven Williams as Captain Adam Fuller (1987–1991)\nSal Jenco as Sal \"Blowfish\" Banducci (1987–1990)\nRichard Grieco as Detective Dennis Booker (1988–1989)\nYvette Nipar as Jackie Garrett (1988-1989)\nDavid Barry Gray as Officer Dean Garrett (1990)\nAlexandra Powers as Officer Kati Rocky (1990)\nMichael DeLuise as Officer Joseph \"Joey\" Penhall (1990–1991)\nMichael Bendetti as Officer Anthony \"Mac\" McCann (1990–1991)Jeff Yagher was originally cast as Officer Tom Hanson in the pilot. He was replaced after the original pilot episode was filmed, and his scenes were reshot with Johnny Depp. Midway through the first season, Frederic Forrest was replaced by Steven Williams. On the show, Forrest's character Richard Jenko is killed by a drunk driver.\nJohnny Depp left the series at the end of the fourth season, but was credited in the first two episodes of the fifth season, despite not having appeared.\nDavid Barry Gray's character was introduced at the end of the fourth season and starred in two episodes of season five with Alexandra Powers. Both episodes were filmed before the fourth season had ended but were not shown until the start of season five. Neither actor was approached in regards to portraying their character in the show's fifth and final season.\nMichael DeLuise joined the cast part way through the fifth season and stayed on until late in the season."}