{"_movieID": "302946", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:58:38", "summary": "The Accountant is a 2016 American crime thriller film directed by Gavin O'Connor, written by Bill Dubuque and starring Ben Affleck, Anna Kendrick, J. K. Simmons, Jon Bernthal, Cynthia Addai-Robinson, Jeffrey Tambor, and John Lithgow. The storyline follows Christian Wolff, a certified public accountant with high-functioning autism who makes his living uncooking the books of criminal  and terrorist organizations around the world that are experiencing internal embezzlement.\nThe Accountant premiered in Los Angeles on October 10, 2016, and was theatrically released in the United States by Warner Bros. Pictures on October 14, 2016. The film received mixed reviews from critics and grossed $155 million worldwide.", "plot": "As a child, Christian Wolff is diagnosed with a high-functioning form of autism at Harbor Neuroscience, where he meets the doctor's daughter, Justine. Chris's father declines the offer for his son to stay at a sensory friendly environment, believing that Chris must overcome the hardships of his condition, but Chris's overwhelmed mother abandons their family. Afraid that others will exploit his son, Chris's father—a US Army PSYOP officer—begins a brutal regimen of stoicism and martial arts training for both him and his brother, Braxton.\nIn the present, Chris works as a forensic accountant from a small strip mall office in Plainfield, Illinois. He unmasks insider financial deceptions, often for criminal and terrorist enterprises. Chris's clients interact with Chris through the Voice, an unidentified woman who calls him \"Dreamboat\". He exposes himself daily to loud music and flashing lights to inure himself to sensory overload.\nDirector of FinCEN Ray King pursues Chris, known as \"the Accountant\". King blackmails Treasury data analyst Marybeth Medina to help him locate the Accountant. Her leads include Chris's cover names, a recording from his killing of nine members of the Gambino crime family, and some photos.\nChris is hired to audit Living Robotics after the company's founder and CEO, Lamar Blackburn and his sister Rita, learn of discrepancies from in-house accountant Dana Cummings. Chris finds that over $61 million has been embezzled from the company. CFO Ed Chilton, who is diabetic, is forced by a hitman to commit suicide from an insulin overdose. Lamar dismisses Chris, claiming Chilton killed himself because of the embezzlement, leaving Chris very distraught because he cannot finish the audit.\nMedina isolates Chris's voice from the recording of the Gambino killing, hearing him repeating the nursery rhyme \"Solomon Grundy\". She learns that his vocal cadence is reminiscent of those with autism, and that Chris's aliases are famed mathematicians, including his current identity, Christian Wolff. Using IRS records, she finds his Illinois office.\nAssassins fail to kill Chris; the last reveals that Dana is the next target. Chris saves her before taking her to his storage unit, containing an Airstream Panamerica with artwork and other valuables, which he uses to quickly flee in when necessary. As they talk, he realizes that the embezzlement at Living Robotics is a scheme like Crazy Eddie's; money stolen from the company is returned to it, boosting profits and increasing the company's valuation as it prepares for an IPO. When Chris goes to confront Rita he finds her dead, exposing Lamar as the embezzler.\nGovernment agents search Chris's heavily secured home. King explains to Medina that Chris was imprisoned at Leavenworth because of a fight at his estranged mother's funeral, where his father was killed protecting Chris. He learned accounting from Francis Silverberg, a Gambino family accountant who became an FBI informant. King was Silverberg's handler, but his inaction led to the informant being brutally killed; King was staking out the Gambinos when Chris came to avenge his mentor. Chris could have killed King, but let him go after asking if he was a good father. King began getting information from the Voice when criminals violated Chris's moral code, and became director of FinCen. King tells Medina someone has to take over when he retires. The phone rings, and the Voice tells Medina about Living Robotics.\nChris goes to Lamar's mansion, where the hitman and his men await. During the battle, the hitman recognizes Chris repeating the nursery rhyme and reveals that he is Chris's brother Braxton; they have not seen each other since Chris's imprisonment. Braxton attacks Chris, blaming him for their father's death. During a pause in their fight Lamar arrogantly interrupts; Chris shoots him, ending the battle. Chris amicably agrees to meet Braxton in a week, saying he will find him.\nAs another set of parents visits Harbor Neuroscience with their child, the boy meets Justine, still a patient there; she is the Voice, and Chris funds the center with his bookkeeping profits. Dana receives a Jackson Pollock painting she saw in the trailer, as Chris drives out of town with the Airstream in tow."}