{"_movieID": "688", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:31", "summary": "The Bridges of Madison County is a 1995 American romantic drama film based on the best-selling novel of the same name by Robert James Waller. It was produced by Amblin Entertainment and Malpaso Productions, and distributed by Warner Bros. Entertainment. The film was produced and directed by Clint Eastwood with Kathleen Kennedy as co-producer and the screenplay was adapted by Richard LaGravenese. The film is about an Italian war bride, Francesca (Meryl Streep), who lives with her husband and two children on a farm in Iowa. In 1965, she meets a National Geographic photographer named Robert (Eastwood) and has a four-day extramarital affair with him that changes both of their lives forever. The film earned $182 million worldwide and was well received by critics. Streep received an Academy Award for Best Actress nomination in 1996 for her performance in the film.", "plot": "In the present, adult siblings Michael and Carolyn arrive at the Iowa farmhouse of Francesca Johnson, their recently deceased, elderly mother, to see about the settlement of their mother's estate. As they go through the contents of her safe deposit box and the will, they are baffled to discover that their mother left very specific instructions that her body be cremated and her ashes thrown off the nearby Roseman Covered Bridge, a plan not in accordance with formal burial arrangements which the children felt constrained to abide with: side-by-side plots in the local cemetery. Michael initially refuses to comply with the cremation, while Carolyn discovers a set of photos of her mother and a letter. She manages to convince Michael to set aside his initial reaction so they can read the documents she has discovered. Once alone, they go through a series of letters from a man named Robert Kincaid to their mother. The siblings find their way to a chest where their mother left a letter, a series of diaries, photographs, old cameras and other mementos.\nThey discovered that in 1965, their mother, an Italian war bride, had a four-day affair with Robert Kincaid, a travelling professional  photographer who had come to Madison County, Iowa, to shoot a photographic essay for National Geographic on the covered bridges in the area. The affair took place while her husband and children were at the state fair in Illinois.\nThe story in the diaries also reveals the impact the affair had on the lives of Francesca and Robert, since they almost ran away together, so she could travel the world with him. However, after a wrenching period of decision-making, she decided to stay at the last minute after considering the bigger picture that includes the consequences leaving would have on the lives of her teenage children and husband, who was a good, loving man. Kincaid is very moved by meeting her. He finds meaning and his true calling as an artist. The story also has deep consequences on the lives of Michael and Carolyn, who are both experiencing marital problems. Their mother’s story helped them to find a sense of direction in their lives. At the end, the Johnson siblings comply with their mother’s request and scatter their mother's ashes at the covered bridge.", "cast": "Clint Eastwood as Robert Kincaid\nMeryl Streep as Francesca Johnson\nAnnie Corley as Carolyn Johnson\nSarah Kathryn Schmitt as young Carolyn\nVictor Slezak as Michael Johnson\nChristopher Kroon as young Michael\nJim Haynie as Richard Johnson\nPhyllis Lyons as Betty\nDebra Monk as Madge\nRichard Lage as Lawyer Peterson\nMichelle Benes as Lucy Redfield"}