{"_movieID": "402446", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:48", "summary": "Edge of Winter is a 2016 Canadian drama film directed by and written by Rob Connolly and Kyle Mann. It stars Joel Kinnaman, Tom Holland, and Percy Hynes White. The film centres on a recently divorced father, Elliot Baker (Kinnaman), whose angry behaviour slowly controls him while he resides with his two sons (Holland and White) at his cabin in the wilderness. The film was produced by Independent Edge Films in association with JoBro Productions & Film Finance. The film was released to mixed reviews.\n\n", "plot": "Divorced Elliot Baker (Joel Kinnaman), who has just lost his job for punching his boss after a workplace accident, jumps at the chance to spend time with his two boys, teenager Bradley (Tom Holland) and younger Caleb (Percy Hynes White). After their mother drops the boys off, they discover Elliot's shotgun in his bedroom. Elliot yells at them, but after seeing them a bit startled, apologises and then decides it'd be a good bonding experience to teach the boys about firearm safety. The trio head out to Elliot's old lumber yard in the wilderness. En route Elliot discovers text messages on Brad's phone expressing Brad's displeasure with spending time with his father. Elliot hides Brad's phone, so he can spend more time with him.\nAt the lumber yard, Elliot begins his lesson and Brad goes first to shoot the gun. Elliot tells Brad to keep the gun close but Brad ignores him and the gun kicks back and knocks Brad to the ground. Brad gets half angry and half embarrassed, and stays in the car. Caleb kills a rabbit, which greatly disturbs him, and the three begin to leave. Brad is concerned about Elliot drinking and driving, so Elliot hands Brad the keys and teaches him how to drive. Caleb and Brad get into a fight, which results in the car sliding off the road and becoming stuck. The three spend the night in the car, where Caleb tells Elliot about his step-father's promotion and their forthcoming move to London, despite Bradley telling him not to. Distraught, Elliot begins to get angry and slams his hands repeatedly into the steering wheel, breaking his cast before falling asleep.\nIn the morning, Elliot suggests the three head to a nearby hunting cabin to gather supplies, as they would freeze or starve attempting to reach the road. After a while, they spot the cabin. On the way to the cabin, Brad falls through some ice. Elliot jumps into the ice and yells for Caleb to get off the ice and start a fire in the cabin. Elliot carries Brad into the cabin and helps Brad take off his clothes as Brad’s fingers are too cold. He covers him with blankets and puts Brad by the fire. After a while in front of the fire, Elliot expresses his anger at losing his family when they move to London. He then proceeds to talk about how he thought he almost lost Bradley. Later in the night, the three are startled when two hunters, Richard and Luc, arrive also seeking shelter. Elliot is suspicious of the men, and demands they disarm before letting them inside.\nElliot begins to slowly lose his mind. He follows Richard to his truck, and attempts to stop him from contacting help. A brief scuffle ensues, and Elliot unintentionally kills Richard. In the cabin, Brad and Caleb hear a gunshot, rush out and see that their father has killed a deer. Luc arrives, and suspects Elliot has killed Richard. Elliot punches Luc and attempts to shoot him, but misses due to Brad and Caleb’s efforts. Elliot then tells them to go to the cabin which they do. Brad then packs up some things and convinces Caleb that they need to leave. They leave and after a while become lost. Elliot finds them missing and goes to search for them. Brad and Caleb run into Elliot. Elliot engages Brad in a fight after Brad makes a comment that Elliot isn't a good dad. Elliot then roughly handles Brad, wanting Brad to agree say that he is a bad father. After a while of trying to get out of his father’s grasp, Brad says it. Caleb pleads for Elliot to let him go. Bradley starts coughing and his father lets him go. Elliot forces the boys to the cabin, locking them inside their room. Caleb rushes to the door and begs his dad to open up. Brad then tries to break down the door but it won’t budge. He kicks the metal bed in frustration, springing a nail loose. Brad uses the nail to pry up a floor board, and Caleb goes under, seeing Richard's corpse under the house. Bradley tries to pry one more board for him to fit through but can’t, and tells Caleb to leave. Caleb leaves reluctantly, finds Luc in his truck, and convinces Luc to take him to safety along with Brad. Brad finally pries up another board and starts a fire in the house in order to escape.\nWhile Brad flees, Elliot chases him through the woods. Eventually, Elliot catches up and grabs Bradley telling them that they can’t leave. Bradley tries to escape his grasp but fails. He tells Elliot that people will find them and come looking for them. Caleb comes out and tells Elliot that if they stay, they could go fishing and hunting. Elliot lets go of Bradley. Luc comes out and attacks Elliot, but is beaten to death by Elliot. Brad and Caleb, after running for a while, make it to the truck and begin to drive off. Elliot catches up with the boys and pleads with them to stay. He uses the rifle to break the window. Brad speeds up, and Elliot grabs on to Caleb. Bradley tells him to stop and that he is hurting Caleb. He then speeds up faster and Caleb kicks him off. The two hold each other, tearing up, as Brad drives off into the night to seek help."}