{"_movieID": "440471", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:40", "summary": "Escape Plan 2: Hades is a 2018 American prison action thriller film directed by Steven C. Miller. It is the sequel to the 2013 film Escape Plan, and the second installment in the Escape Plan film series. It stars Sylvester Stallone and Curtis \"50 Cent\" Jackson reprising their roles from the first film, with Dave Bautista, Huang Xiaoming, Jaime King, Jesse Metcalfe, Titus Welliver, and Wes Chatham joining the cast. The film was released straight-to-DVD in the United States but received theatrical releases in such countries as Russia on June 28, 2018 and in China on June 29, 2018. The film received negative reviews from critics and grossed $16 million against a production budget of $20 million.\nA sequel, Escape Plan: The Extractors, was released in 2019.", "plot": "Ray Breslin continues to operate his security company to some success, with senior members Hush and Abigail and newcomers Shu Ren, Jasper Kimbral and Luke Graves as field operators. During a hostage rescue mission in Chechnya, Kimbral, trusting his computer algorithms, deviates from the mission objectives. This results one of the hostages getting shot, later dying of her wounds, and Breslin fires Kimbral.\nA year later, Shu is contacted by his family to protect his cousin Yusheng Ma. Soon to announce groundbreaking satellite communications technology from his telecommunications company, Yusheng has been targeted by a rival company who wants his technology. After attending a party in Bangkok, Yusheng is confronted by masked men. Shu fights them off, but both are stunned with M-26 military-grade tasers and kidnapped.\nComing to, Shu finds himself imprisoned in an unknown arena, where inmates are forced to fight. Shu is forced to fight another prisoner and wins, and later encounters fellow inmate Kimbral. Kimbral explains that the prison is called Hades, where he has been held for several months. Meanwhile, Luke, Hush, Abigail and Breslin attempt to locate Shu after his and Yusheng's disappearance.\nDrawing on Breslin’s training to formulate an escape plan, Shu meets the warden Gregor Faust, who calls himself the \"Zookeeper\", and learns that Faust wants Yusheng's communications patents in exchange for their release. Yusheng tells Shu that since the technology could be used to hack into and control any nuclear launch system in the world, he buried it for fear of it being used for nefarious purposes. They resolve to escape. \nBreslin determines that Hades is funded by the same mysterious organization who funded the Tomb, and seeks help from an old contact, Trent DeRosa. While following a lead on Shu's disappearance, Luke is caught and transferred to Hades. \nShu befriends the prison cook and learns that the prison layout changes every night. Kimbral reveals that another inmate, a hacker known as Count Zero, knows the layout. Shu earns his trust and Count Zero gives him the information, but in doing so reveals his identity. The following day, Shu, Luke, and Kimbral are brought in for questioning and forced to watch as Count Zero is presumably executed. Kimbral reveals that he actually runs Hades; in the year since being dismissed from Breslin's team, he designed and built Hades to prove his algorithms work and that his prison is inescapable.\nBreslin and DeRosa find clues that reveal Kimbral's connection to Hades. Knowing Kimbral is out for revenge, Breslin allows himself to be captured and sent to Hades. Using a hidden communication device in his tooth, Breslin stays in contact with Hush while attempting to breach the prison's defenses from the inside. Breslin, Shu, and Luke formulate a new plan while enlisting the help of Yusheng, the cook, Count Zero's friends, and other inmates. They manage to disable the prison's security cameras and, with Hush's help, temporarily shut down Galileo, the prison's automated defense system. They break into the medical center and attempt to gain control of the prison's systems and get to the control room. The Zookeeper responds with an armed force, and in the ensuing shootout, several inmates are killed and the group becomes separated. DeRosa, following his own leads, locates the prison from the outside.\nYusheng overrides the prison's power systems, alerting DeRosa to the prison's entrance and allowing him to break in. Searching for an exit, Shu encounters and kills the Zookeeper in a knife fight, as Luke and DeRosa converge on the control room. Breslin faces off with Kimbral in hand-to-hand combat while DeRosa rescues Luke from the prison guards. Breslin defeats Kimbral and together with DeRosa disables Galileo for good. Shu and Yusheng find an exit and are safely extracted by Abigail and Hush. Breslin is contacted by the group behind Hades, and vows to track them down and expose them.", "cast": "Sylvester Stallone  as Ray Breslin\nDave Bautista as Trent DeRosa, former associate of Breslin Security\nHuang Xiaoming as Shu Ren, protege of Breslin\nJesse Metcalfe as Lucas \"Luke\" Graves, Protege of Breslin\nCurtis \"50 Cent\" Jackson as Hush, computer hacker working for Breslin\nWes Chatham as Jaspar Kimbral, Breslin’s former protege turned warden of HADES\nChen Tang as Yusheng Ma, Shu Ren's cousin\nTyron Woodley as Akala, a prisoner of HADES\nTyler Jon Olson as Moe\nTitus Welliver as Gregor Faust, the \"Zookeeper\" of HADES\nShea Buckner as Larry\nJaime King as Abigail Ross, Vice President of Breslin Security\nLydia Hull as Jules, an employee of Breslin Security\nPete Wentz as Bug"}