{"_movieID": "60304", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:50:12", "summary": "Hansel & Gretel: Witch Hunters is a 2013 dark fantasy action comedy horror film written and directed by Tommy Wirkola. It is a continuation to the German folklore fairy tale \"Hansel and Gretel\", in which the titular siblings are now grown up and working as a duo of witch exterminators for hire. The film stars Jeremy Renner and Gemma Arterton in the title roles with Famke Janssen, Peter Stormare, Thomas Mann, Pihla Viitala and Derek Mears as the supporting cast.\nIn 2010, after being approached by Gary Sanchez Productions, Wirkola pitched the film to Paramount Pictures. Renner was cast as Hansel in September 2010 whilst the role of Gretel was planned for Noomi Rapace before Arterton's casting in January 2011. Principal photography began in March 2011, taking place at Babelsberg Studio in Germany. Filming concluded in June that year. Originally scheduled for release in March 2012, the film was delayed for ten months to accommodate Renner's appearances in The Avengers and The Bourne Legacy and to allow additional time to shoot a post-credits scene.\nHansel and Gretel: Witch Hunters was theatrically released in the United States on January 25, 2013, in 2D, 3D, and IMAX 3D, as well in D-Box motion theaters and select international 4DX theaters. The film was panned by mainstream critics, particularly for what they saw as its weak script and gratuitous violence. However, many horror genre critics were more positive, viewing the film as unpretentiously entertaining. The film topped the domestic box office on its opening weekend and was a major hit internationally. Its worldwide theatrical run gross exceeded $226 million for the production cost of $50 million.", "plot": "The film begins with the classic fairy-tale: Abandoned by their father in a forest, young Hansel and Gretel enter a gingerbread house and are captured by a cannibalistic witch. The witch forces Hansel to continuously eat sweets to fatten him up and enslaves Gretel. The siblings outsmart her and incinerate her in the oven. \nIn the fifteen years that follow, Hansel and Gretel become famed witch hunters, slaying hundreds of witches. The pair are somehow immune to spells and curses, but the incident in the gingerbread house has left Hansel changed with a form of diabetes. He needs a shot of insulin every few hours or he will die.Now adults, Hansel and Gretel arrive in the town of Augsburg and prevent Sheriff Berringer from executing a beautiful young woman named Mina for witchcraft. Mayor Englemann has hired the siblings to rescue the town's missing children presumed abducted by witches. Berringer hires trackers for the same mission in the hopes of disgracing the mayor and cementing his power. Hansel and Gretel, along with Deputy Jackson, capture the horned witch and discover that the witches are preparing for the coming Blood Moon, where they plan to sacrifice twelve children to gain immunity to fire, their greatest weakness.\nMuriel attacks the town with her army and abducts the final child. She kills Jackson and attacks Gretel, who is rescued by Ben, a local teenager and avid fan of theirs who plans to become a witch hunter himself. Hansel falls from a witch's broomstick and is lost in the forest. The next morning, Mina finds him and takes him to a nearby spring, where she heals his wounds and has sex with him. Gretel is attacked by Berringer and his posse, who beat her before being stopped by Muriel's troll, Edward. Edward kills Berringer and his men and tells Gretel that he helped her because trolls serve witches. Hansel and Gretel discover an abandoned cabin that they learn is a witch's lair and their childhood home. Muriel tells them the truth of their past. \nHansel and Gretel's mother was a white witch named Adrianna who married a farmer, explaining the siblings' immunity to black magic. On the night of the last Blood Moon, Muriel planned to use the heart of the white witch to complete her potion. She found Adrianna too powerful and decided to use Gretel's heart instead. To get rid of Adrianna, she revealed to the townspeople that Adrianna was a witch. The resulting angry mob burned her alive and hanged Hansel and Gretel's father, who had been trying to protect them by leaving them in the forest. \nThe siblings battle Muriel before she stabs Hansel and abducts Gretel to complete her long-due ceremony. Hansel wakes up with Mina, who reveals herself to be a white witch. She heals him again and uses a grimoire to bless his arsenal of weapons. Hansel, Mina, and Ben disrupt the Blood Moon Sabbath. Mina slaughters the dark witches with a Gatling gun while Hansel frees the children. Edward defies Muriel and releases Gretel before Muriel throws him off the cliff. Hansel, Ben, and Mina follow Muriel's trail to the original gingerbread house. Muriel kills Mina before Hansel shoots her. The siblings engage Muriel in a brutal fight that ends with Gretel decapitating her with a shovel. They burn her body on a pyre and collect their reward for rescuing the children. In the end, they head out on their next witch hunt, now accompanied by Ben and Edward.\nDuring the credits, Hansel and Gretel slay a Desert Witch."}