{"_movieID": "301337", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:50:48", "summary": "Downsizing is a 2017 American science fiction comedy film directed by Alexander Payne, written by Payne and Jim Taylor and starring Matt Damon, Christoph Waltz, Hong Chau, and Kristen Wiig. It tells the story of Paul and Audrey Safranek, a couple who decide to undertake a newly invented procedure to shrink their bodies so they can start a new life in an experimental community. When Audrey refuses the procedure at the last minute, Paul has to reassess his life and choices after befriending an impoverished activist. Principal photography on the film began in Ontario, Canada, on April 1, 2016.\nDownsizing premiered at the 74th Venice International Film Festival on August 30, 2017, and was theatrically released in the United States by Paramount Pictures on December 22, 2017. The film was a box office bomb, grossing only $55 million against a production budget between $68–76 million. It received mixed reviews from critics, who praised its cast and premise, but criticized its execution and failure to deliver on its potentially profound subject matter. Nevertheless, it was chosen by the National Board of Review as one of the top ten films of 2017, while Chau earned a nomination for Best Supporting Actress at the 75th Golden Globe Awards.", "plot": "In the future, searching for a way to solve overpopulation and global warming, Dr. Jørgen Asbjørnsen invents \"downsizing\", a process to shrink people to a height of five inches (12.7 cm); he and his wife Anne-Helene become part of the first human test subjects once the process is proven safe and demonstrate it to the world. Paul and Audrey Safranek, a married couple in Omaha with financial problems, meet Dave and Carol Johnson, who have downsized. While the inventors advocate that downsizing is environmentally friendly through the reduction of waste, Dave argues that its benefits extend far beyond that and improve one's life through the increase in value of their money.\nExploring the possibilities of downsizing, Paul and Audrey agree to undergo the process and move to Leisureland, New Mexico, one of the most popular communities for small individuals. After undergoing downsizing, Paul receives a call from Audrey, saying that she was unable to go through with the procedure and, by opting out at the last minute, will be leaving him.\nOne year later, Paul finalizes the divorce with Audrey, and settles in to his new apartment (a downsizing of its own from the mansion he was to originally share with Audrey). Although Paul had anticipated a life of relative ease, the divorce left him without Audrey's share of their assets. In addition, Paul's share of the asset shrank further still due to divorce settlement negotiations. Paul, whose occupational therapist license had lapsed and faced a re-certification process due to Leisureland being in another state, now works as a customer service representative for Lands' End. While attending a birthday party, Paul has a discussion with Dave and says that he regrets his decision to downsize. Soon after, Paul breaks up with his girlfriend and attends a party hosted by his neighbor Dušan.\nThe next morning, Paul notices that one of Dušan's housecleaners is Ngoc Lan Tran, a Vietnamese political activist who was jailed and downsized against her will. Ngoc Lan was the sole survivor of a human smuggling attempt to the United States in a television box and had her leg amputated upon arrival. Attempting to assist Ngoc Lan with her prosthetic leg, Paul returns to her house in the slums outside of the walls of Leisureland. After assisting Ngoc Lan's dying friend, Paul attempts to repair Ngoc Lan's prosthetic leg only to break it and render her unable to work. In return, Paul works for Ngoc Lan's cleaning service where he also assists in gathering food from around the city that Ngoc Lan distributes throughout the slums. Dušan attempts to release Paul from his obligation by taking him to Norway, the site of the first small community, with his friend Joris Konrad, but Ngoc Lan also wishes to come along. Ngoc Lan had received international attention after her arrival in the United States, including personal correspondence from the inventor of downsizing, Dr. Jørgen Asbjørnsen, who had previously invited her to Norway to express his regret at the abuse of his procedure.\nWhile traveling in a fjord, Paul's boat encounters Dr. Asbjørnsen and his wife, Anne-Helene. Dr. Asbjørnsen announces that humanity is doomed, as the positive feedback of Arctic methane emissions  cannot be stopped, and will result in the eventual extinction of the human race. Arriving in the first colony, Paul is shown that Dr. Asbjørnsen planned for such a contingency with the creation of a large vault inside a mountain to insulate the colony and preserve humanity in the event of an extinction. Paul is excited to enter the vault and asks Ngoc Lan to join him. She rejects his offer, saying that he does not need to enter the vault and can do good in their community by returning. Paul enters the vault, but changes his mind and leaves as the door is closing and subsequently blasted to seal the occupants inside, choosing to return with Ngoc Lan, Dušan, and Konrad.\nHaving returned to Leisureland, Paul assists Ngoc Lan in her duties of providing needed aid and supplies to the people of the slums.", "cast": "Matt Damon as Paul Safranek, an occupational therapist who signs up for the \"downsizing\" program\nChristoph Waltz as Dušan Mirković, an aging Serbian partyboy\nHong Chau as Ngoc Lan Tran, a Vietnamese activist and Paul's new girlfriend who was shrunk against her will by her government\nKristen Wiig as Audrey Safranek, Paul's wife, who divorces him after her decision not to complete the \"downsizing\" procedure\nJason Sudeikis as Dave Johnson, Carol’s husband, who is an old high school friend of Paul and Audrey\nMaribeth Monroe as Carol Johnson, Dave's wife, and an old high school friend of Paul and Audrey\nUdo Kier as Joris Konrad, an aging partyboy and Dušan's companion\nRolf Lassgård as Dr. Jørgen Asbjørnsen, Anne-Helene's husband and inventor of the downsizing procedure\nIngjerd Egeberg as Anne-Helene Asbjørnsen, Jørgen's wife\nSøren Pilmark as Dr. Andreas JacobsenAmong the smaller roles and cameos are Margo Martindale as a miniaturized woman on a shuttle bus, James Van Der Beek as an anesthesiologist, Niecy Nash as a Leisureland Salesperson, Donna Lynne Champlin as a Leisureland Administrator, and Don Lake as Leisureland Guide Matt. Additionally, Neil Patrick Harris and Laura Dern cameo as Jeff and Laura Lonowski, miniaturized sales reps. Brigette Lundy-Paine plays Dušan’s girlfriend and Joaquim de Almeida plays Conference Director Dr. Oswaldo Pereira.  Kerri Kenney-Silver plays Kristen, a single mom that Paul dates after his divorce."}