{"_movieID": "330947", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:54:16", "summary": "Song to Song is a 2017 American experimental romantic drama film written and directed by Terrence Malick and starring an ensemble cast including Ryan Gosling, Rooney Mara, Michael Fassbender, and Natalie Portman.\nAfter a lengthy post-production period of over three years, the film had its world premiere at South by Southwest on March 10, 2017, and was released in the United States on March 17, 2017, by Broad Green Pictures. Critical reception for the film was mixed.", "plot": "In Austin, Texas, Faye is a guitarist looking for success as a musician. She starts an affair with record producer Cook, hoping that he will help her. Then she begins a relationship with BV, who has had slightly more success than she and is also working with Cook. Cook and Faye keep their affair a secret from BV and the three take a trip together to Mexico.\nRhonda is a former kindergarten teacher working as a waitress at a diner, where she is courted by Cook. The two eventually marry and he buys her mother a house. Business gets rough between Cook and BV and their professional relationship and friendship end. \nFaye feels increasingly guilty about her affair with Cook, and finally tells BV, who breaks up with her. Faye then has a relationship with Zoey, a French woman living in the US. Rhonda begins to feel uncomfortable with Cook's wild lifestyle, which includes sex with other women and drugs. BV dates New Yorker Amanda for some time, but eventually they break up too.\nRhonda takes her own life, leaving Cook shocked and saddened. Faye and BV reconnect and start dating again. Later, BV moves back west to his hometown to take care of his sick father and the rest of his family, and pursues a simpler life, taking a job as a worker at a drilling rig. Faye follows him and the two of them declare their eternal love for each other.", "cast": "Florence Welch,  Patti Smith, Iggy Pop, The Black Lips, Alan Palomo, John Lydon, Flea, Spank Rock, Tegan Quin, Sara Quin, Anthony Kiedis, Chad Smith, Josh Klinghoffer, First Aid Kit, Erik Sprague and Big Freedia, all make cameo appearances in the film."}