{"_movieID": "299536", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:54", "summary": "Avengers: Infinity War is a 2018 American superhero film based on the Marvel Comics superhero team the Avengers, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2012's The Avengers and 2015's Avengers: Age of Ultron, and the nineteenth film in the Marvel Cinematic Universe (MCU). It was directed by Anthony and Joe Russo, written by Christopher Markus and Stephen McFeely, and features an ensemble cast including Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Tom Holland, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Danai Gurira, Letitia Wright, Dave Bautista, Zoe Saldana, Josh Brolin, and Chris Pratt. In the film, the Avengers and the Guardians of the Galaxy attempt to prevent Thanos from amassing the all-powerful Infinity Stones in a quest to wipe out half of all life in the universe.\nThe film was announced in October 2014 as Avengers: Infinity War – Part 1. The Russo brothers came on board to direct in April 2015, and a month later Markus and McFeely had signed on to write the script for the film, which draws inspiration from Jim Starlin's 1991 comic book The Infinity Gauntlet and Jonathan Hickman's 2013 comic book Infinity. In 2016, Marvel shortened the title to Avengers: Infinity War. Filming began in January 2017 at Pinewood Atlanta Studios in Fayette County, Georgia, with a large cast consisting mostly of actors reprising their roles from previous MCU films, including Brolin as Thanos. The production lasted until July 2017, shooting back-to-back with a direct sequel, Avengers: Endgame. Additional filming took place in Scotland, England, the Downtown Atlanta area, and New York City. With an estimated budget of $316–400 million, it is one of the most expensive films ever made.\nAvengers: Infinity War held its world premiere on April 23, 2018, in Los Angeles and was released in the United States on April 27, 2018, in IMAX and 3D. The film received praise for Brolin's performance and the emotional weight of the story, as well as the visual effects and action sequences. It was the fourth film and the first superhero film to gross over $2 billion worldwide, breaking numerous box office records. It became the highest-grossing film of 2018 and the fourth-highest-grossing film of all time both worldwide and in the United States and Canada. The film's visual effects were nominated at the 91st Academy Awards, 24th Critics' Choice Awards, and 72nd British Academy Film Awards. The sequel, Avengers: Endgame, was released in April 2019.\n\n", "plot": "Having acquired the Power Stone, one of the six Infinity Stones, from the planet Xandar, Thanos and his lieutenants—Ebony Maw, Cull Obsidian, Proxima Midnight, and Corvus Glaive—intercept the spaceship carrying the survivors of Asgard's recent destruction. As they extract the Space Stone from the Tesseract, Thanos subdues Thor, overpowers Hulk, and kills Loki. Thanos also kills Heimdall after he sends Hulk to Earth using the Bifröst. Thanos and his lieutenants depart, destroying the ship in the process.\nHulk crash-lands at the Sanctum Sanctorum in New York City, reverting to the form of Bruce Banner. He warns Stephen Strange and Wong about Thanos's plan to kill half of all life in the universe, and they recruit Tony Stark. Maw and Obsidian arrive to retrieve the Time Stone from Strange, drawing the attention of Peter Parker. Maw captures Strange, but fails to take the Time Stone due to an enchantment. Stark and Parker sneak aboard Maw's spaceship, Banner contacts Steve Rogers, and Wong stays behind to guard the Sanctum.\nIn Edinburgh, Midnight and Glaive ambush Wanda Maximoff and Vision in order to retrieve the Mind Stone, which is in Vision's forehead. Rogers, Natasha Romanoff, and Sam Wilson rescue them and they take shelter with James Rhodes and Banner at the Avengers Facility. Vision offers to sacrifice himself by having Maximoff destroy the Mind Stone to keep Thanos from retrieving it, but Maximoff refuses. Rogers suggests they travel to Wakanda, which he believes has the resources to remove the Stone without destroying Vision.\nThe Guardians of the Galaxy respond to a distress call from the Asgardian ship and rescue Thor, who surmises that Thanos is currently going after the Reality Stone, which is in the possession of the Collector on Knowhere. Rocket and Groot accompany Thor to Nidavellir, where they and Eitri create Stormbreaker, a battle-axe capable of killing Thanos. On Knowhere, Peter Quill, Gamora, Drax, and Mantis find Thanos with the Reality Stone already in his possession. Thanos kidnaps Gamora, his adopted daughter, who reveals the Soul Stone is on Vormir in order to save her captive adopted sister, Nebula, from torture. On Vormir, the Stone's keeper, Red Skull, tells Thanos that he can only acquire it by sacrificing someone he loves. Thanos kills Gamora, earning the Stone.\nNebula escapes captivity and asks the remaining Guardians to meet her at Thanos's destroyed homeworld, Titan. Stark and Parker kill Maw and rescue Strange. Landing on Titan, they meet Quill, Drax, and Mantis. Strange uses the Time Stone to view millions of possible futures, seeing only one in which Thanos loses. The group forms a plan to subdue Thanos and remove the Infinity Gauntlet, which he uses to house the Stones. Thanos appears and justifies his plans as necessary to ensure the survival of a universe threatened by overpopulation. Nebula arrives soon after, and helps the others subdue Thanos until she deduces that Thanos has killed Gamora. Enraged, Quill attacks Thanos, allowing him to break the group's hold and overpower them. Stark is seriously wounded by Thanos, but is spared after Strange surrenders the Time Stone to Thanos.\nIn Wakanda, Rogers reunites with Bucky Barnes before Thanos's army invades. The Avengers, alongside T'Challa and the Wakandan forces, mount a defense while Shuri works to extract the Mind Stone from Vision. Banner, unable to transform into the Hulk, fights in Stark's Hulkbuster armor. Thor, Rocket, and Groot arrive to reinforce the Avengers; Midnight, Obsidian, and Glaive are killed and their army is routed, but Shuri is unable to complete the extraction of the Mind Stone from Vision. Thanos arrives to retrieve the Mind Stone, but before he can do so Maximoff destroys it. Using the Time Stone, Thanos reverses her actions and rips the repaired Mind Stone from Vision's forehead, killing him. Thor severely wounds Thanos with Stormbreaker, but Thanos activates the completed Gauntlet by snapping his fingers and teleports away.\nHalf of all life across the universe disintegrates, including Barnes, T'Challa, Groot, Maximoff, Wilson, Mantis, Drax, Quill, Strange, and Parker, as well as Maria Hill and Nick Fury, although Fury is able to transmit an emergency signal on a modified pager before turning to dust. Stark and Nebula remain on Titan while Banner, M'Baku, Okoye, Rhodes, Rocket, Rogers, Romanoff, and Thor are left on the Wakandan battlefield. Meanwhile, Thanos watches a sunrise on another planet.", "cast": "Robert Downey Jr. as Tony Stark / Iron Man: The leader and benefactor of the Avengers who is a self-described genius, billionaire, playboy, and philanthropist with electromechanical suits of armor of his own making. Co-director Joe Russo explained that Stark \"senses this greater threat approaching, so he is doing everything in his power to keep the Earth safe\". Downey added that Stark has smaller goals than in previous films.\nChris Hemsworth as Thor: An Avenger and the king of Asgard, based on the Norse mythological deity of the same name. Joe Russo stated that Thor's storyline picks up after the events of Thor: Ragnarok (2017), which finds him in a \"very profound... very interesting place\" with \"real emotional motivation\". At the recommendation of Hemsworth, writers Christopher Markus and Stephen McFeely consulted Thor: Ragnarok director Taika Waititi and screenwriter Eric Pearson to help carry over the comedic and tragic elements of the re-toned Thor from that film. Joe Russo said that Thor has \"the driving hero's arc of the movie which stands in direct opposition to Thanos's argument\" and would have been the main protagonist of the film had Thor killed Thanos.\nMark Ruffalo as Bruce Banner / Hulk: An Avenger and genius scientist who, because of exposure to gamma radiation, typically transforms into a monster when enraged or agitated. Banner spends the film trying to reintegrate with the Avengers and \"impress upon everybody how dangerous Thanos is\". Joe Russo felt the Hulk refusing to appear for much of the film was only partially because he was scared, but also because he realizes that \"Banner only wants Hulk for fighting. I think he's had enough of saving Banner's ass\". Russo added that this was \"really reflective of the journey from Ragnarok... [where] these two characters are constantly in conflict with each other over control\". Banner's appearance in the film continues a story arc for the character that was established in Thor: Ragnarok and concludes in Avengers: Endgame, with the difference between Hulk and Banner \"starting to blur a little bit\". Ruffalo described Hulk in Infinity War as having the mental capacity of a five-year-old.\nChris Evans as Steve Rogers / Captain America: A fugitive superhero and leader of a faction of Avengers. A World War II veteran, he was enhanced to the peak of human physicality by an experimental serum and frozen in suspended animation before waking up in the modern world. Joe Russo said after the events of Captain America: Civil War (2016), Rogers struggles with the conflict between his responsibility to himself and his responsibility to others. The character embodies the \"spirit\" of the comic book identity Nomad in the film, and receives new vibranium gauntlets from Shuri to replace his traditional shield. An early draft of the film had Rogers first appearing at the end of the film to save Vision from Corvus Glaive in Wakanda. Markus and McFeely were called \"insane\" for waiting that long to introduce Rogers into the film and ultimately conceded it was \"not [a] satisfying\" approach.\nScarlett Johansson as Natasha Romanoff / Black Widow: A highly trained spy, member of Rogers's faction of Avengers, and former agent of S.H.I.E.L.D. Johansson said that Romanoff's situation following Captain America: Civil War has been \"a dark time. I wouldn't say that my character has been particularly hopeful, but I think she's hardened even more than she probably was before\".\nBenedict Cumberbatch as Dr. Stephen Strange: A former neurosurgeon who, after a car accident that led to a journey of healing, discovered the hidden world of magic and alternate dimensions and became a Master of the Mystic Arts. Markus and McFeely described Strange as \"[ending] up being the reasonable adult in the room\" with the \"widest perspective available\". Aaron Lazar served as Cumberbatch's stand-in until the latter completed filming on The Current War (2017). At that point, Cumberbatch re-shot scenes where his face needed to be seen. Julian \"JayFunk\" Daniels once again assisted Cumberbatch with his finger-tutting movements.\nDon Cheadle as James \"Rhodey\" Rhodes / War Machine: A colonel in the U.S. Air Force and Avenger who operates the War Machine armor. Following his paralysis during the events of Civil War, Rhodes is given an apparatus by Stark to walk again, although he is reluctant to don his War Machine armor and rejoin the Avengers due to his injury. Cheadle believed that Rhodes is \"negotiating this reunion and his rejoining this team\". He also explained that Rhodes's relationship with Stark \"deepened\" from his accident, saying, \"I think Tony feels somewhat responsible and culpable in a way. But again, he's always had my back in a way that only he could really have\".\nTom Holland as Peter Parker / Spider-Man: A teenager and Stark's protegé who received spider-like abilities after being bitten by a genetically-modified spider. Downey helped coach Holland through his death scene, which was not as drawn out in the script. Anthony Russo said, Downey \"kept driving: put more and more emotion into it, and just went up to Tom and said, 'You don't want to go because you're a child. And you're using your strength as Spider-Man to fight this'. And then that was the performance that came out\".\nChadwick Boseman as T'Challa / Black Panther: The king of the African nation of Wakanda who gained his enhanced strength by ingesting the Heart-Shaped Herb. Boseman, along with the other actors from Black Panther (2018) portraying Wakandans, improvised their war chants on set ahead of the battle in Wakanda. Despite both Black Panther and Infinity War filming at the same time, the Russos were not aware of the chants, as they had not yet seen footage from Black Panther, and felt the moment was \"incredibly cool\".\nPaul Bettany as Vision: An android and Avenger created using the artificial intelligence J.A.R.V.I.S., Ultron, and the Mind Stone. Anthony Russo called Vision \"a living MacGuffin. Obviously, that raises the stakes because Vision's life is in danger, and his life is in conflict with Thanos's goals, so something's got to give\".\nElizabeth Olsen as Wanda Maximoff / Scarlet Witch: A member of Rogers's faction of Avengers who can harness magic and engage in hypnosis and telekinesis.\nAnthony Mackie as Sam Wilson / Falcon: A member of Rogers's faction of Avengers and former pararescueman trained by the military in aerial combat using a specially designed wing pack. Mackie noted that Wilson has a grudge with other heroes like Iron Man and Black Panther after the events of Civil War.\nSebastian Stan as James Buchanan \"Bucky\" Barnes / Winter Soldier:An enhanced soldier and Rogers's ally and best friend who reemerged as a brainwashed assassin after being thought to have been killed in action during World War II. Barnes, who formerly went by Winter Soldier, is given the name White Wolf by the people of Wakanda, who helped remove his Hydra programming.\nTom Hiddleston as Loki: Thor's adopted brother, based on the Norse mythological deity of the same name.\nIdris Elba as Heimdall: The all-seeing, all-hearing Asgardian and former sentry of the Bifröst Bridge, based on the Norse mythological deity of the same name.\nPeter Dinklage as Eitri: King of the Dwarves of Nidavellir, and weaponsmith, based on the Norse mythological dwarf of the same name.\nBenedict Wong as Wong: A Master of the Mystic Arts, tasked with protecting some of Kamar-Taj's most valuable relics and books.\nPom Klementieff as Mantis: A member of the Guardians of the Galaxy with empathic powers.\nKaren Gillan as Nebula: An adopted daughter of Thanos who was raised with Gamora as siblings.\nDave Bautista as Drax the Destroyer: A member of the Guardians and warrior in search of vengeance against Thanos for killing his family. At the end of each day of filming, Bautista would have to sit in a sauna to remove his makeup.\nZoe Saldana as Gamora: A member of the Guardians who is an orphan from an alien world and was subsequently raised by Thanos, and is seeking redemption for her past crimes. Ariana Greenblatt portrays a young Gamora.\nVin Diesel as Groot: A member of the Guardians who is a tree-like humanoid. Executive producer James Gunn explained that Groot is still an adolescent in the film, in the same state of growth seen in one of the post-credit scenes in Guardians of the Galaxy Vol. 2 (2017). Terry Notary provided motion capture for Groot, and said the character is \"coming of age, so you'll see the teenager find a mentor to look up to and to model himself after\".\nBradley Cooper as Rocket: A member of the Guardians who is a genetically-engineered raccoon-based bounty hunter, mercenary, and master of weapons and battle tactics. Sean Gunn was again the stand-in for Rocket during filming, with his acting and expressions serving as motion reference for the character.\nGwyneth Paltrow as Virginia \"Pepper\" Potts: Stark's fiancée and the CEO of Stark Industries. Downey felt that \"Pepper remains the heart of the [Iron Man] story\", which was not a focal point in some of the preceding films with Stark. Downey continued that \"we wanted to get back to that reality. Not just for them, but let's really see how that can add to the something-worth-fighting-for of it all\".\nBenicio del Toro as Taneleer Tivan / The Collector: One of the Elders of the Universe who is an obsessive keeper of the largest collection of interstellar fauna, relics, and species of all manner in the galaxy.\nJosh Brolin as Thanos: An intergalactic warlord from Titan who seeks all six Infinity Stones to impose his will on all life  for the sake of \"re-balanc[ing] the universe\". Producer Kevin Feige added that Thanos believes the universe is becoming over-populated, which led to the destruction of his home moon Titan and is something he vowed not to let happen again, and also said \"you could almost go so far as to say he is the main character of\" the film. McFeely shared this sentiment, describing the film as his \"hero journey\" in addition to being the film's protagonist, stating, \"Part of that is the things that [mean] the most to him. We wanted to show that. It wasn't just power; it wasn't just an ideal; it was people\". Brolin likened Thanos to \"the Quasimodo of this time\" and the novel Perfume, since Thanos was born deformed and considered a \"freak\" on Titan, while Joe Russo would reference The Godfather (1972) for Brolin at times, which Brolin felt helped \"to emotionalize the whole thing\". Brolin further added that he preferred playing Thanos over Cable in Deadpool 2 (2018) because of the amount of work that went into creating the character. Thanos does not wear armor for most of the film, which is symbolic of his growing power as he collects the Infinity Stones. In addition to voicing for the character, Brolin performed motion capture on set.\nChris Pratt as Peter Quill / Star-Lord: The half-human, half-Celestial leader of the Guardians who was abducted from Earth as a child and raised by a group of alien thieves and smugglers called the Ravagers. Pratt described his role in the film as a \"guest star\" appearance and said \"you get to be a little more vibrant; a little more irreverent; a little bit more colorful if you want it to be\".Additionally, several other actors reprise their MCU roles: Danai Gurira as Okoye, the head of the Dora Milaje; Letitia Wright as T'Challa's sister Shuri; William Hurt as Thaddeus Ross, the U.S. Secretary of State; Kerry Condon as the voice of Stark's A.I. F.R.I.D.A.Y.; Winston Duke as M'Baku, the leader of Wakanda's mountain tribe the Jabari; Florence Kasumba as Ayo, a member of the Dora Milaje; Jacob Batalon as Parker's friend Ned; Isabella Amara as Parker's classmate Sally; Tiffany Espensen as Parker's classmate Cindy; and Ethan Dizon as Parker's classmate Tiny. Samuel L. Jackson and Cobie Smulders make uncredited cameos as Nick Fury and Maria Hill, the former director and deputy director of S.H.I.E.L.D, respectively, in the film's post-credits scene.Thanos's henchmen, known collectively in the comics as the Black Order and in the film as the \"Children of Thanos\", include Terry Notary as Cull Obsidian, Tom Vaughan-Lawlor as Ebony Maw, Carrie Coon as Proxima Midnight, and Michael James Shaw as Corvus Glaive. The foursome provided voices and motion-capture performances on set for their characters. As Coon was pregnant during filming, she mainly did facial capture for Proxima Midnight with some motion-capture, with stuntwoman Monique Ganderton standing-in and providing the rest on set. Ebony Maw's look was inspired by the Marvel Comics character Mephisto, who appeared in the Infinity Gauntlet storyline.Ross Marquand voices Johann Schmidt / Red Skull, the \"Stonekeeper\" and former Nazi commander of Hydra during World War II. Marquand replaces Hugo Weaving, who had expressed reluctance to reprise the character from Captain America: The First Avenger (2011). Red Skull was created through CGI and portrayed with stand-ins on set. Avengers co-creator Stan Lee makes a cameo appearance in the film as Parker's school bus driver, while screenwriter Stephen McFeely cameos as Secretary Ross's aide. Kenneth Branagh, the director of Thor (2011), voices an Asgardian distress caller in an uncredited cameo. David Cross was invited to make a cameo appearance as Tobias Fünke, his character from the television sitcom Arrested Development, which the Russo brothers had previously worked on; this was prevented by a scheduling conflict, but Fünke still appears in the film as a specimen in the Collector's collection, played by an uncredited extra. Executive producer Jon Favreau was to reprise his role as Happy Hogan, while co-director Joe Russo had a cameo appearance as a paparazzi photographer, but this scene did not make the theatrical cut of the film."}