{"_movieID": "390043", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:52:16", "summary": "The Hitman's Bodyguard is a 2017 American action comedy thriller film directed by Patrick Hughes and written by Tom O'Connor, whose script was on the 2011 Black List survey. The film stars Ryan Reynolds, Samuel L. Jackson, Gary Oldman, and Salma Hayek.\nThe Hitman's Bodyguard was released in the United States on August 18, 2017, and grossed $176 million worldwide. The film received mixed reviews, with critics praising Reynolds and Jackson's chemistry but criticizing the clichéd plot and execution. A sequel, The Hitman's Wife's Bodyguard, is currently in production.", "plot": "Michael Bryce (Reynolds) lives a stylish life as an elite UK-based private bodyguard, until client Takashi Kurosawa is assassinated on his watch. Two years later, the disgraced Bryce ekes out a living protecting drug-addicted corporate executives in London.\nMeanwhile, Vladislav Dukhovich (Oldman), the ruthless dictator of Belarus is on trial for crimes against humanity at the International Criminal Court. Unable to secure solid evidence or testimony against Dukhovich, the prosecution's last hope is notorious incarcerated hitman Darius Kincaid (Jackson), who agrees to testify against Dukhovich in exchange for the release of his wife Sonia (Hayek) from prison.\nInterpol Assistant Director Jean Foucher assigns Amelia Roussel, an inexperienced agent and Bryce's ex-girlfriend, to lead Kincaid's transfer from Manchester to The Hague. The Interpol convoy of French GIPN and British AFOs from the National Crime Agency is ambushed in Coventry, leaving only Kincaid and Roussel alive. The two retreat to a safehouse; Roussel realizes there must be a mole inside Interpol and turns to Bryce for help. Despite his belief that she is responsible for Kurosawa's death, and past entanglements with Kincaid, Bryce agrees to assist them to restore his reputation. Roussel returns to Interpol to update her superiors but is placed on leave, while Bryce and Kincaid escape an attack by Dukhovich's men.\nFoucher, the mole, goes to Dukhovich and demands his payment; Dukhovich stabs him in the hand and assures him he will only be paid when Kincaid is dead. \nDukhovich's men track Kincaid and Bryce using Kincaid's cell phone data; the pair eliminate the attackers but their vehicle is destroyed. The two hitchhike to a ferry to Amsterdam, where Sonia is being held. Kincaid reveals that he killed Kurosawa, having spotted him by chance while on another job. Enraged, Bryce punches Kincaid and abandons him.\nAs Bryce bemoans his failures at a beer stand, Dukhovich's men attack Kincaid. Bryce has a change of heart and helps Kincaid escape, but is captured. As Dukhovich's men torture him, Kincaid arrives and rescues Bryce. After settling their differences, the two battle their way to The Hague, arriving just in time for Kincaid to testify that Dukhovich tried to hire him to assassinate a political rival, but in the process Kincaid witnessed Dukhovich carry out a mass execution, and uploaded photos of the massacre to a secret FTP site that he provides to the court.\nDukhovich admits guilt, then resorts to his backup plan: bombing the court to escape. Foucher leaves the court before the bombing; Roussel deduces he was the traitor. In the confusion after the bomb went off, Dukhovich seizes a gun to kill Kincaid, but Bryce jumps in the path of the bullet, telling Kincaid to stop Dukhovich. Foucher and Roussel fight. Bryce shoots Foucher to save Roussel; she subdues Foucher. Kincaid pursues Dukhovich to the roof, where he attempts to escape by helicopter. Kincaid destroys the helicopter and kicks Dukhovich off the roof to his death for shooting Bryce. \nBryce recovers and rekindles his relationship with Roussel, and Sonia is released. Kincaid is rearrested for his various crimes, but breaks out of HMP Belmarsh several months later so he and Sonia can celebrate their anniversary in the bar in Honduras where they first met. As a wild bar brawl breaks out around them, the two embrace.", "cast": "Ryan Reynolds as Michael Bryce, a former triple A rated executive protection agent and CIA officer.\nSamuel L. Jackson as Darius Kincaid/Evans, one of the world’s most notorious hitmen and Sonia’s husband.\nGary Oldman as Vladislav Dukhovich, the dictatorial President of Belarus.\nSalma Hayek as Sonia Kincaid, Darius’s wife.\nÉlodie Yung as Amelia Roussel, an Interpol agent and Michael's ex-girlfriend.\nYuri Kolokolnikov as Ivan, leader of the Belarusian mercenaries working for Dukhovich.\nTine Joustra as Renata Casoria, Director of Interpol.\nJoaquim de Almeida as Jean Foucher, the French Assistant Director of Interpol, who is later revealed to be Dukhovich's inside man and second-in-command.\nKirsty Mitchell as Rebecca Harr, Kincaid's lawyer.\nRichard E. Grant as Mr. Seifert, a drug addicted corporate executive and client of Bryce.\nSam Hazeldine as Garrett, a National Crime Agency officer.\nMikhail Gorevoy as Litvin, Dukhovich’s lead defense lawyer.\nBarry Atsma as Moreno, the lead prosecution lawyer.\nGeorgie Glen as ICC Lead Judge\nRod Hallett as Professor Petr Asimov, a critic and victim of the Dukhovich regime."}