{"_movieID": "101299", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:59:34", "summary": "The Hunger Games: Catching Fire is a 2013 American dystopian science fiction adventure film based on Suzanne Collins' dystopian novel Catching Fire (2009), the second installment in The Hunger Games trilogy. The film is the sequel to The Hunger Games (2012) and the second installment in The Hunger Games film series, produced by Nina Jacobson and Jon Kilik, with co-production by Lionsgate Films and distributed by Lionsgate Entertainment. Francis Lawrence directed the film, with a screenplay by Simon Beaufoy and Michael Arndt (credited as Michael deBruyn). Adding to the existing cast, the supporting cast was filled out with Philip Seymour Hoffman, Jeffrey Wright, Sam Claflin, Lynn Cohen, Jena Malone, and Amanda Plummer. Filming began on September 10, 2012, in Atlanta, Georgia, before moving to Hawaii. The plot of Catching Fire takes place a few months after the previous installment; Katniss Everdeen and fellow District 12 tribute Peeta Mellark have returned home safely after winning the 74th Annual Hunger Games. Throughout the story, Katniss senses that a rebellion against the oppressive Capitol is simmering throughout the districts.\nThe Hunger Games: Catching Fire was released on November 15, 2013, in Brazil; November 20 in Finland, Sweden, and Norway; November 21 in the United Kingdom; and November 22 in IMAX, in the United States. The film set records for the biggest November opening weekend and biggest three- and five-day Thanksgiving box-office totals, surpassing the first film's box office grosses. It ranks as the 22nd-highest-grossing film at the domestic box office and the highest-grossing film at the domestic box office of 2013, becoming the first 2-D film since The Dark Knight (2008) to top the yearly box office, as well as having a lead female top the box office since The Exorcist (1973). The film has grossed over $865 million worldwide and is the fifth-highest-grossing film of 2013 and the highest-grossing entry in The Hunger Games series. The film was followed by The Hunger Games: Mockingjay, a two-part sequel and finale of the franchise: Part 1 was released on November 21, 2014, in the United States, and Part 2 on November 20, 2015.\nCatching Fire received positive reviews and is widely considered by critics to be an improvement over its predecessor, with the sentiment being that it's \"a more-confident, more-polished movie\"; praise also goes to Lawrence's performance as Katniss. It's the most critically acclaimed chapter in The Hunger Games series, according to review aggregator Rotten Tomatoes. The film also received numerous nominations, with a nomination for the Broadcast Film Critics Association Award for Best Action Film and a Saturn Award for Best Science Fiction Film. For her performance, Lawrence was nominated a second time for the Empire Award for Best Actress as well as the Saturn Award and Broadcast Film Critics Association Award. The song \"Atlas\" was also nominated for the Grammy Award for Best Song Written for Visual Media and a Golden Globe Award for Best Original Song.", "plot": "After the 74th Hunger Games, Katniss Everdeen and Peeta Mellark return to District 12, where President Snow visits Katniss. Snow explains that her actions in the Games have inspired uprisings. He orders her to use the upcoming Victory Tour to convince people that her actions were out of love for Peeta and not defiance against the Capitol, or District 12 will be destroyed, \"just like District 13\". He makes Katniss promise that the two will not lie to each other.\nAs the tour begins, Haymitch Abernathy warns Katniss and Peeta that the show of their relationship must continue for the rest of their lives. Katniss suggests they announce their engagement, which is approved by Snow, with their wedding to be staged at his mansion in the Capitol.\nPeacekeepers enter District 12 to enforce a curfew and to crack down on contraband and illegal activity. Gale is publicly whipped after attacking the Head Peacekeeper, Romulus Thread. However, Haymitch and Katniss intervene, and use their influence as Hunger Games \"victors\" to save Gale from being executed. This is broadcast on state television, catching the attention of President Snow, who decides that the Hunger Games victors now have too much power and need to be eradicated.\nSnow then announces that the third Quarter Quell of the upcoming Hunger Games will involve tributes selected from previous victors, allowing him to dispose of almost all of them, and also guaranteeing that Katniss will be selected as she is the only living female victor from District 12. Katniss immediately devotes herself to ensuring Peeta's survival, and makes Haymitch promise to help. At the reaping, Effie Trinket draws Katniss's and Haymitch's names, but Peeta immediately volunteers to take Haymitch's place.\nHaymitch reveals that the tributes are angry about being returned to the Games, and all of them will most likely attempt to stop the games. For her pre-Games interview, Katniss wears a wedding dress, as ordered by Snow, but her stylist Cinna sets it to transform into a representation of a mockingjay. Peeta announces on-air that he and Katniss have secretly married and are expecting a child. The irritated audience of Capitol citizens protests and shouts for the Games to be stopped, to no avail. Just before Katniss enters the arena, Cinna is severely beaten by Peacekeepers in front of her, then dragged away.\nIn the Games, Katniss allies with returning District 4 tributes Finnick Odair and the elderly Mags, his mentor. When the arena's force field shocks Peeta, stopping his heart, Finnick revives him. The group flees from a poisonous fog, with Finnick carrying Mags, but when Peeta cannot go on, Mags sacrifices herself so that Finnick can help him. When mandrills attack, Peeta is saved by the unexpected sacrifice of a hiding tribute, the female from District 6. The group escapes to the beach around the central lake, where Finnick greets District 3's Wiress and Beetee and District 7's Johanna Mason. Wiress repeats the phrase \"tick-tock\", leading Katniss to realize that the arena is designed like a clock, with unchanging hazards each hour contained within their respective zones on the clock. As the team waits for the next danger, Wiress is stabbed to death by Gloss, who alongside his sister Cashmere, and District 2 tributes Brutus and Enobaria, comprise the Careers. Gloss is immediately fatally shot by Katniss while Johanna kills Cashmere with her axe. Finnick is injured by Enobaria's knife, and after the Gamemakers spin the clock to disorient the tributes, they quickly leave the beach for the woods.\nBeetee suggests luring the Careers to the wet beach and electrocuting them by running his wire to the lake from a tree that is struck by lightning every 12 hours, having won his games by doing so, killing six tributes at once. The group separates to prepare the trap, Finnick and Peeta protecting Beetee, and Katniss running the wire down to the beach with Johanna, though Peeta didn't want to part with his love. While pulling the coil, an unknown source of tension makes it apparent another tribute is on their tail. When Brutus and Enobaria emerge, Johanna knocks Katniss to the ground, cuts the tracker out of her arm, and flees. Katniss returns to the tree and finds an unconscious Beetee. Unable to recover Peeta, and hearing a cannon (which was Peeta killing Brutus), Katniss almost kills Finnick, thinking he broke the alliance and attacked Peeta, but he reminds her to remember who \"the real enemy\" is, as Haymitch had advised her before the games. Katniss attaches the wire to an arrow and shoots it into the arena's roof just as the lightning hits. The roof of the arena falls to bits and Katniss is thrown to the ground by the force. The lightning strike paralyzes Katniss and incapacitates Finnick, causing a power failure that brings down the dome and disables the security cameras inside the arena, preventing the Capitol from observing the events.\nKatniss awakens in a hovercraft with Beetee, who is still unconscious. She finds Haymitch, Finnick, and Plutarch Heavensbee, the new head Gamemaker, who is revealed to be a rebel against Snow. He tells her they are bound for District 13, headquarters of the rebellion, and that half the tributes (the ones from 3, 4, 6, 7, 8 and 11) were recruited to help Katniss escape, as she is the symbol of the growing rebellion. They were unable to rescue Peeta and Johanna, and they are captives in the Capitol. Katniss is sedated after attacking Haymitch for not keeping his promise to protect Peeta. She later awakens to find Gale by her side. He assures her that her family is safe, but that District 12 has been destroyed after Snow was made aware of the rebels' plot."}