{"_movieID": "434203", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:08:48", "summary": "Newness is a 2017 American drama romance film directed by Drake Doremus from a screenplay by Ben York Jones. It stars Nicholas Hoult, Laia Costa, Courtney Eaton, Danny Huston and Esther Perel.\nIt had its world premiere at the Sundance Film Festival on January 25, 2017. It was released on November 3, 2017, by Lost City.\n\n", "plot": "Martin (Hoult), a pharmacist, and Gabriella (Costa), a physical therapy assistant, live in Los Angeles where they both frequently use an online dating app to hookup with people. After a night of bad dates, the two return to the app where they match with each other and agree to meet at a bar. They spend the rest of the night talking and Martin mentions he used to be married. They then go back to Martin's apartment and have sex. Soon after, the two begin a relationship and Gabriella moves in with Martin.\nOn a visit to Martin's parents, his father reveals to Gabriella that his mother has dementia. She also sees various photos around the house of Martin's ex-wife, Bethany and of an unknown girl. At home, Gabriella gets upset that Martin never mentioned his mother's condition or the girl in his childhood photos. He accuses her of being nosy and angrily reveals he had a sister that died when she was 16. They have a heated argument where Gabriella storms out. The next day, an acquaintance invites Gabriella to a dinner party while Martin goes clubbing with his co-workers. They both end up cheating but confess their infidelity the next morning and decide to seek therapy. Through therapy, they decide to begin an open relationship.\nGabriella's friend, Blake, invites them both to a party where they spend the night flirting with other guests. Martin bonds with Blake while Gabriella grows close to Blake's boss, an older man named Larry. The couple continue their string of hookups with other people until Gabriella suggests a threesome, to which Martin asks for Blake but Gabriella disapproves because they are friends. Gabriella soon starts spending more time with Larry and his daughter. Meanwhile, Martin discovers Bethany recently had a child. Unsettled, he watches old home videos which he secretly kept. Larry gives Gabriella a necklace, which she later hides from Martin, and they have sex. The next morning, Gabriella admits she came during sex with Larry, which angers Martin. Later, he finds the necklace and goes to a bar alone where he runs into Blake. After a night of drinking, he reveals Bethany miscarried when they were together and that he has unresolved feelings for her. The conversation makes Blake uncomfortable and she leaves. Martin returns home immediately to talk to Gabriella but she dismisses him, later finding out from her friend about Martin and Blake's encounter. One day, Martin returns home to find Gabriella crying while watching the old videos and reading an email that Martin wrote for Bethany where he states he constantly thinks about her. They start arguing and Martin brings up the necklace. Gabriella leaves the apartment and moves in with Larry.\nLarry reveals that in two weeks, he will be leaving on a 2-year business trip around Europe which he invites Gabriella to join him. Martin and Bethany meet up after he sent her the email where she states it's neither of their faults that their marriage didn't work because they were both young and naive. She then says she is happy even though her life has become boring and predictable. They part ways amicably. One night, Larry throws a party where Blake is in attendance which Gabriella demands him to kick her out. He refuses and calls her immature. She then leaves to a club where she seduces two men before breaking down. She returns the next day and tries to talk to Larry but he says he doesn't care and belittles her behavior which causes her to leave him. Eventually, she visits Martin who admits he was never really comfortable with an open relationship. The two reconcile and reassure their love for one another."}