{"_movieID": "198184", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:02:38", "summary": "Chappie (stylized as CHAPPiE) is a 2015 American dystopian science fiction action film directed by Neill Blomkamp and written by Blomkamp and Terri Tatchell. It stars Sharlto Copley, Dev Patel, Jose Pablo Cantillo, Sigourney Weaver, Hugh Jackman, and Ninja and Yolandi Visser of the South African zef rap-rave group Die Antwoord as metafictional versions of themselves. The film, set and shot in Johannesburg, is about an artificial general intelligence law enforcement robot captured and taught by gangsters, who nickname it Chappie.\nChappie premiered in New York City on March 4, 2015, and was released in U.S. cinemas on March 6, 2015. The film grossed $102 million worldwide against a $49 million budget.", "plot": "A skyrocketing crime rate leads the city of Johannesburg, South Africa to buy a squadron of scouts—state-of-the-art armour-plated attack robots—from weapons manufacturer Tetravaal. These autonomous androids are developed by British scientist Deon Wilson and largely supplant the overwhelmed human police force. A competing project within the company is the remotely controlled MOOSE, developed by Australian soldier-turned-engineer Vincent Moore. Deon is praised for Tetravaal's success but Vincent grows envious when the police are unwilling to give his heavy weapons platform equal attention.\nAt home, Deon creates a prototype artificial intelligence that mimics a human mind to the point of feeling emotions and having opinions, but Tetravaal CEO Michelle Bradley refuses to let him test the A.I. on a police robot. Undeterred, Deon steals a recently damaged robot before it is destroyed and puts it in his van, along with the \"guard key\" needed to update the robot's software.\nOn his way home, he is kidnapped by three criminals, Ninja, Yolandi, and Amerika, who threaten to kill him unless he reprograms a police robot to help them steal. Deon installs the new software into the damaged robot, which responds with childlike trepidation upon powering up. Deon and Yolandi calm the robot, teaching it words and naming it \"Chappie\". Despite Deon wanting to stay with the robot, Ninja forces him out of their hideout.\nNinja's gang only has a few days to pay a debt of 20 million rand to Hippo, a powerful gangster. Yolandi sees Chappie as a child and wants to mother him, but Ninja grows impatient with his development due to both the impending deadline for the debt and Chappie's irreplaceable battery running out, giving him days to live. Ninja tries to train Chappie to be a gangster by leaving him in a dangerous neighborhood to fend for himself. After being wounded by thugs, he is followed by Vincent, who plans to deactivate all Tetravaal scouts except for MOOSE. Vincent successfully extracts the guard key for his own use, but the traumatized Chappie escapes and returns to the hideout. Yolandi scolds Ninja for this mistreatment, but he manages to earn Chappie's forgiveness by training him in martial arts and weapon handling. Ninja and Amerika trick Chappie into stealing cars for them, and lie about needing the money to replace his dying body.\nAt Tetravaal, Vincent uses the guard key to upload a virus, thus sabotaging and disabling all scouts including Chappie. Johannesburg's criminals immediately run rampant in the streets, and Deon brings Chappie to the Tetravaal factory to fix him. After being restarted, Chappie notices a helmet used to control MOOSE. At the hideout, he re-engineers it to allow him to transfer his consciousness into a computer, so he can change bodies when his current one dies. Ninja's gang uses Chappie to rob an armored car, an act which is caught on the news, prompting Tetravaal to pursue him. When Chappie learns that Ninja's plan to acquire the body was a lie, he prepares to kill Ninja for betrayal. However, Deon arrives to warn them that Michelle Bradley has ordered that Chappie be destroyed. At that moment, the MOOSE robot (controlled remotely by Vincent) is launched to assassinate Deon and Chappie at the hideout, at the same time that Hippo arrives to collect his debt. Amerika and Hippo are killed in the ensuing battle, while Deon is mortally wounded. When Ninja is about to be killed, Yolandi sacrifices herself to save him and Chappie destroys MOOSE by detonating a bomb.\nEnraged by Yolandi's death, Chappie drives Deon to the factory, storms into an office, and fiercely beats Vincent close to death. He then transfers the dying Deon's consciousness into a spare robot through the modified MOOSE helmet. In return, the now-robotic Deon wirelessly transfers Chappie's consciousness into one of the nearby disabled scouts. Deon and Chappie go into hiding as the police discontinue their contract with Tetravaal. While burning memorabilia of Yolandi, the grieving Ninja finds a box containing a doll copy of her and a flash drive marked \"Mommy's Consciousness Test Backup\" which contains a copy of Yolandi's consciousness that Chappie took while testing the device on her. Chappie hacks into Tetravaal's manufacturing facility, builds a robot resembling Yolandi, and uploads the drive's contents.", "cast": "Sharlto Copley as Chappie, a robot. Copley acted out the scenes in front of the camera interacting with the rest of the cast and lent his voice. Contrary to a 2014 story by Entertainment Weekly, Visual Effects Supervisor Chris Harvey explained that the production did not use motion capture, and Copley's performance was used only as a reference by the animators who replaced him with the CGI for Chappie.Copley also makes a cameo at the ending as a police officer.\nDev Patel as Deon Wilson, a programmer at Tetravaal\nNinja as Ninja, a gang member.\nYolandi Visser as Yolandi, a gang member.\nJose Pablo Cantillo as Amerika, a gang member.\nSigourney Weaver as Michelle Bradley, the CEO of Tetravaal.\nHugh Jackman as Vincent Moore, a former soldier turned engineer.\nBrandon Auret as Hippo, a powerful gangster.\nAnderson Cooper as himself"}