{"_movieID": "284053", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:08:28", "summary": "Thor: Ragnarok is a 2017 American superhero film based on the Marvel Comics character Thor, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2011's Thor and 2013's Thor: The Dark World, and the seventeenth film in the Marvel Cinematic Universe (MCU). The film is directed by Taika Waititi from a screenplay by Eric Pearson and the writing team of Craig Kyle and Christopher Yost, and stars Chris Hemsworth as Thor alongside Tom Hiddleston, Cate Blanchett, Idris Elba, Jeff Goldblum, Tessa Thompson, Karl Urban, Mark Ruffalo, and Anthony Hopkins. In Thor: Ragnarok, Thor must escape the alien planet Sakaar in time to save Asgard from Hela and the impending Ragnarök.\nA third Thor film was confirmed in January 2014, with Kyle and Yost beginning work on the screenplay. The involvement of Hemsworth and Hiddleston was announced that October. Waititi joined the film as director a year later, after Thor: The Dark World director Alan Taylor chose not to return. Ruffalo joined the cast reprising the role of Hulk from previous MCU films, which allowed elements of the 2006 comic storyline \"Planet Hulk\" to be adapted for Ragnarok. The rest of the cast, including Blanchett as Hela, was confirmed in May 2016, with Pearson's involvement revealed at the start of filming that July. Principal photography took place in Brisbane and Sydney, Australia, with the film also having exclusive use of Village Roadshow Studios in Oxenford, concluding in October 2016.\nThor: Ragnarok premiered in Los Angeles on October 10, 2017, and was released in the United States on November 3, 2017, in 3D, IMAX, and IMAX 3D. The film was a critical success, receiving praise for its acting and Waititi's direction, as well as the action sequences, humor and musical score, with many critics considering it to be the best installment of the Thor films. It grossed $854 million, becoming the highest-grossing film of the trilogy and the ninth-highest-grossing film of 2017. A sequel, Thor: Love and Thunder, is scheduled for release on November 5, 2021.", "plot": "Two years after the battle of Sokovia, Thor is imprisoned by the fire demon Surtur, who reveals that Thor's father Odin is no longer on Asgard. He explains that the realm will soon be destroyed during the prophesied Ragnarök, once Surtur unites his crown with the Eternal Flame that burns in Odin's vault. Thor frees himself, defeats Surtur and takes his crown, believing he has prevented Ragnarök.\nThor returns to Asgard to find Heimdall gone and his brother Loki posing as Odin. After exposing Loki, Thor forces him to help find their father, and with directions from Stephen Strange on Earth, they locate Odin in Norway. Odin explains that he is dying and Ragnarök is imminent despite Thor's efforts to prevent it. He then reveals his passing will allow his firstborn child, Hela, to escape from a prison she was sealed in long ago. Hela was the leader of Asgard's armies, conquering the Nine Realms with Odin, but Odin imprisoned her and wrote her out of history after he feared that she had become too ambitious and powerful. Odin dies as Thor and Loki watch on, and Hela appears, destroying Thor's hammer Mjolnir. She pursues the two as they attempt to flee through the Bifröst Bridge, forcing them out into space. Arriving in Asgard, she defeats its army and kills the Warriors Three. She then resurrects the ancient dead who once fought with her, including her giant wolf Fenris, and appoints the Asgardian Skurge as her executioner. Hela plans to use the Bifröst to expand Asgard's empire, but Heimdall sneaks in, takes the sword that controls the Bridge and begins hiding other Asgardians.\nThor crash-lands on Sakaar, a garbage planet surrounded by wormholes. A slave trader designated Scrapper 142 subdues him with an obedience disk and sells him as a gladiator to Sakaar's ruler, the Grandmaster, with whom Loki has already ingratiated himself. Thor recognizes 142 as one of the Valkyrior, a legendary force of female warriors who were killed fighting Hela eons ago. Thor is forced to compete in the Grandmaster's Contest of Champions, facing his old friend Hulk. Summoning lightning, Thor gets the upper hand, but the Grandmaster sabotages the fight to ensure Hulk's victory. Still enslaved after the fight, Thor attempts to convince Hulk and 142 to help him save Asgard, but neither is willing. He soon manages to escape the palace and finds the Quinjet that brought Hulk to Sakaar. Hulk follows Thor to the Quinjet, where a recording of Natasha Romanoff causes him to transform back into Bruce Banner for the first time since Sokovia.\nThe Grandmaster orders 142 and Loki to find Thor and Hulk, but the pair come to blows and Loki forces her to relive the deaths of her fellow Valkyrior at the hands of Hela. Deciding to help Thor, she takes Loki captive. Unwilling to be left behind, Loki provides the group with the means to steal one of the Grandmaster's ships. They then liberate the other gladiators who, incited by two aliens named Korg and Miek, stage a revolution. Loki again attempts to betray his brother, but Thor anticipates this and leaves him behind, where Korg, Miek, and the gladiators soon find him. Thor, Banner, and 142 escape through a wormhole to Asgard, where Hela's forces are attacking Heimdall and the remaining Asgardians in pursuit of the sword that controls the Bifröst. Banner transforms into Hulk again, defeating Fenris, while Thor and 142 fight Hela and her warriors. Loki and the gladiators arrive to rescue the citizens, and a repentant Skurge sacrifices himself to enable their escape. Thor, facing Hela, loses his right eye and then has a vision of Odin that helps him realize only Ragnarök can stop her. He sends Loki to retrieve Surtur's crown and place it in the Eternal Flame. Surtur is reborn and destroys Asgard, killing Hela.\nAboard the Grandmaster's spaceship, Thor, now king, decides to take his people to Earth. In a mid-credits scene, they are intercepted by a large spacecraft. In a post-credits scene, the overthrown Grandmaster is confronted by his former subjects.", "cast": "Chris Hemsworth as Thor: The crown prince of Asgard, based on the Norse mythological deity of the same name, who has become a \"lone gunslinger\" searching for the Infinity Stones. Hemsworth had become \"a bit bored\" with the character after portraying Thor four times previously, and wanted to take some risks and experiment: the character has shorter hair in the film, wears a different outfit, his hammer Mjolnir is destroyed, and he loses an eye. Director Taika Waititi added that \"stripping\" the character down like this allowed him to become a refugee at the end of the film. Waititi also wanted to use more of Hemsworth's comedic talents showcased in films like Vacation (2015) and Ghostbusters (2016), and cited Kurt Russell's portrayal of Jack Burton from Big Trouble in Little China (1986) as an influence on the character.\nTom Hiddleston as Loki: Thor's adoptive brother and nemesis, based on the deity of the same name. Hiddleston was interested in how Loki's attitude has changed, saying, \"he is always a trickster. It is trying to find new ways for him to be mischievous\". As the ruler of Asgard since the end of Thor: The Dark World (2013), Hiddleston notes that \"Loki has devoted most of his efforts to narcissistic self-glorification. Not so much on good governance.\" He also added that \"the idea that Thor might be indifferent to Loki is troubling for him... it's an interesting development.\"\nCate Blanchett as Hela: Thor's older sister and the goddess of death, based on the deity Hel, who is inadvertently released from prison following Odin's death. Screenwriter Eric Pearson included the idea of Hela being Thor's sister in one of his drafts at the encouragement of executive producer Brad Winderbaum. The decision to make Hela related to Thor, as opposed to only to Loki as in the comics and Norse mythology, came from needing more impact with Hela and Thor's final confrontation. By making the change, Pearson felt Hela became \"the thing that [represents] what it is to rule Asgard, [Thor's] family, what he's been told, what he hasn't been told.\" Blanchett found it difficult to portray the character in a motion capture suit rather than costume, feeling Hela's headdress is \"such a huge part of\" the power of the character that she would have liked to wear it on set. Hela's design was taken from the comic Thor: God of Thunder by Jason Aaron, while the character Gorr from that comic, who has the ability \"to manifest an infinite number of weapons\", inspired a similar ability for Hela. Blanchett worked with stuntwoman Zoë Bell and Hemsworth's personal trainer Luke Zocchi, and studied capoeira for the role.\nIdris Elba as Heimdall: The all-seeing, all-hearing Asgardian and former sentry of the Bifröst Bridge, based on the deity of the same name, who has gone into self-imposed exile during Loki's reign. After Hela invades Asgard, he helps to hide its vulnerable citizens. Describing Heimdall's character arc in the film, Winderbaum says, \"he's gone from this elder statesmen, the gatekeeper to Asgard, to this badass warrior-wizard character who lives in the hills and kicks a lot of ass throughout the entire film.\"\nJeff Goldblum as Grandmaster: One of the Elders of the Universe who rules the planet Sakaar and enjoys manipulating lesser life-forms. Goldblum described the character as \"a hedonist, a pleasure-seeker, an enjoyer of life and tastes and smells\". He also said that Waititi encouraged improvisation in order for Goldblum to \"make [the character his] own\". Waititi explained that Grandmaster does not have blue skin in the film as the character does in the comics, because Goldblum had already played a blue-colored character in Earth Girls Are Easy (1988), and because Waititi did not want to detract from Goldblum's personality by concealing his appearance. Grandmaster is the brother of Benicio del Toro's Collector from Guardians of the Galaxy (2014), and producer Kevin Feige expressed interest in seeing the two together in a future film.\nTessa Thompson as Scrapper 142 / Valkyrie: A tough, hard-drinking Asgardian slave trader, based on the mythological being Brynhildr, who was once a legendary warrior of the Valkyrior and now works for the Grandmaster under the designation \"Scrapper 142\". Thompson said the various versions of the character from the comics \"left us a lot of leeway\" in creating the film version. Waititi \"wanted to make sure we weren't making a female character that was boring and pretty\", and Feige said Marvel wanted to pair Thor with a love interest more his equal than Jane Foster. Co-screenwriters Craig Kyle and Christopher Yost's original draft of the film had more of a romantic relationship between Thor and Valkyrie. When Pearson started working on the film, he moved away from that storyline, instead focusing more on \"the mutual respect\" between the characters and Valkyrie \"dealing with her PTSD. She's someone who's drowning her sorrows in the bottle, and I just thought that was such a cool thing that you don't often see\". Thompson stated that the character is bisexual, which she based on the character's comic book relationship with Annabelle Riggs, and convinced Waititi to shoot a glimpse of a woman walking out of Valkyrie's bedroom, which was later cut from the film, as Waititi thought that it distracted from the scene's exposition. Thompson was inspired by pictures of Linda Hamilton as Sarah Connor in Terminator 2: Judgment Day (1991) while training for the role, and worked with dialect coach Andrew Jack to create an Asgardian-sounding accent that was different enough to sound like she had been away from there for a long time. Thompson will appear in future MCU films.\nKarl Urban as Skurge: An Asgardian warrior who guards the Bifröst Bridge in Heimdall's absence and chooses to join Hela to survive. Urban shaved his head for the role, and worked out to \"get into the zone and feel\" the part even though his body is hidden under a costume. Urban said Skurge \"makes a deal with the devil\" and becomes Hela's \"henchman. He does the dirty jobs. And that sort of is something he has to—it plays on his conscience.\"\nMark Ruffalo as Bruce Banner / Hulk: A genius scientist who transforms into a monster when enraged or agitated after being exposed to gamma radiation. In the two years since Avengers: Age of Ultron (2015), he has become a successful and popular gladiator on Sakaar and has suppressed the Banner side during those years. He is forming the vocabulary \"of a toddler\", with the level of Hulk's speech being \"a big conversation\" between Waititi and Marvel since it was taking into account future appearances for the character: Ragnarok begins an arc for the character that continues in Avengers: Infinity War (2018) and Avengers: Endgame (2019). Ruffalo felt Hulk had \"a swagger\" in the film, and was \"much more of a character than the green rage machine\" seen in the Avengers films. Waititi provided additional motion capture for the Hulk after Ruffalo had completed his scenes.\nAnthony Hopkins as Odin: The king of Asgard, father of Thor and Hela, and adoptive father of Loki, based on the deity of the same name. The character is in exile on Earth, and was originally intended to be a \"crazy-looking\" hobo on the streets of New York City, but Waititi ultimately felt that this was tragic rather than funny given the character's death during the sequence. The sequence was changed to take place in Norway, to \"honor\" the character's past and be more authentic to his role as a king of Asgard. Waititi was surprised by the improvisational ability of Hopkins after he was told \"to be funny and to really destroy what's come before [with the role] and recreate it.\"Additionally, Tadanobu Asano, Ray Stevenson, and Zachary Levi reprise their roles as Hogun, Volstagg, and Fandral, respectively, members of the Warriors Three. Feige called their appearances \"noble ends\" that served to establish the threat of Hela and the danger she poses to the main characters. Benedict Cumberbatch reprises his role as Dr. Stephen Strange from the film Doctor Strange (2016). Rachel House, who has appeared in several of Waititi's films, plays Topaz, the Grandmaster's bodyguard, while Waititi portrays Korg, a gladiator who befriends Thor. Waititi provided a motion-capture performance for the character, who is made of rocks, and wanted to do something different by having the character be soft-spoken, ultimately basing Korg's voice on that of Polynesian bouncers. Waititi also provided the motion-capture performance for the fire demon Surtur, based on the mythological being Surtr, with Clancy Brown voicing the character. Thor and Hulk co-creator Stan Lee makes a cameo appearance as a man on Sakaar who cuts Thor's hair. There are also several cameos in a sequence where Asgardian actors perform a play based on the events of The Dark World: Sam Neill, with whom Waititi previously worked on Hunt for the Wilderpeople (2016), plays the Odin actor; Luke Hemsworth, brother of Chris, plays the Thor actor; and Matt Damon plays the Loki actor. Scarlett Johansson appears as Natasha Romanoff / Black Widow through archival footage from Avengers: Age of Ultron."}