{"_movieID": "302699", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:51", "summary": "Central Intelligence is a 2016 American action comedy film directed by Rawson Marshall Thurber and written by Thurber, Ike Barinholtz and David Stassen. The film stars Kevin Hart and Dwayne Johnson as two old high school friends who go on the run after one of them joins the CIA in order to save the world from a terrorist who has an intention to sell satellite codes.\nThe film premiered in Los Angeles on June 10, 2016, and was theatrically released in the United States on June 17, 2016. Central Intelligence received positive reviews with praise for Hart and Johnson's performances but criticism of the script. The film grossed $217 million worldwide against its $50 million budget.\n\n", "plot": "In 1996, star athlete Calvin “The Golden Jet” Joyner is being honored at his high school. Halfway through Calvin's speech, a group of bullies led by Trevor Olson throw the nude morbidly obese Robbie Wheirdicht into the hall where the assembly is taking place. Only Joyner and his girlfriend, Maggie Johnson, are sympathetic towards Wheirdicht, Joyner going as far as to quickly cover Wheirdicht in his Varsity Jacket. Wheirdicht thanks Calvin and flees in embarrassment.\nTwenty years later, Joyner is married to Maggie and works as a forensic accountant but is dissatisfied with his career. Maggie suggests they see a therapist to salvage their deteriorating marriage. At work, Joyner receives a friend request on Facebook from a man named Bob Stone, who invites Joyner to meet at a bar. Bob Stone reveals himself to be Robbie Wheirdicht. Joyner is shocked to see that Wheirdicht has transformed into a muscular, confident man with advanced hand-to-hand fighting skills. Stone asks Joyner to review some online transactions, and Joyner discovers a multimillion-dollar auction with bidders from radical countries, with the final bids to conclude the following day. Stone avoids Joyner's questions and spends the night on his couch.\nThe next morning, a team of CIA agents led by Pamela Harris arrive at Joyner's house in search of Stone, who escapes. Harris tells Joyner that Stone is a dangerous rogue agent who intends to sell satellite codes to the highest bidder. Soon after, Stone abducts Joyner and explains that he is trying to stop a criminal known as the Black Badger from selling the codes but needs Joyner's skills to find the coordinates of the deal's location. After an attack by a bounty hunter, Joyner flees and calls Maggie, telling her to meet him at the marriage counselor's office. Harris intercepts him and tells him that Stone murdered his partner Phil Stanton and is the Black Badger himself. She warns him to refrain from telling Maggie and gives him a device to alert them to Stone's location. Joyner then arrives for marriage counseling, where he finds Stone posing as the counselor.\nStone convinces Joyner to help him, and Joyner sets up a meeting with Trevor Olson, who is able to track the offshore account for the auction, so they can get the deal's location. At first, Olson apologizes for his misdeed in high school saying he has found God, only to admit he was lying, laughs in their faces, and bullies Stone again. Harris calls Joyner and threatens to arrest Maggie if he fails to help them detain Stone. Joyner reluctantly betrays Stone, and the CIA arrests him. As Harris tortures Stone to get him to confess, Joyner decides to help Stone escape. Joyner finds that the deal is happening in Boston and helps Stone steal a plane. At an underground parking garage, where the deal is assumed to be taking place, Stone enters alone, while Joyner sees Harris entering a short while later. He mistakenly assumes that she is the Black Badger and runs after her but finds Stone meeting with the buyer and claiming to be the Black Badger. Stone shoots Joyner, grazing his neck, to keep him safe.\nPhil Stanton arrives, revealing  that he is alive, and claims he is the real Black Badger. The buyer attempts to retrieve codes from both Stone and Stanton, but the CIA arrives and a shootout begins, while Joyner grabs both codes and runs outside. He encounters Stone and Stanton, who engage in combat. Unable to decide who is the criminal, Joyner aims blindly and shoots Stone, only for Stanton to confess that he is the Black Badger and that Stone is innocent. Joyner causes a distraction that allows Stone to rip Stanton's throat out, killing him. The two deliver the codes to Harris, who then drops them off at their high school reunion, where Joyner reconciles with Maggie. Stone is announced as the Homecoming King, with Joyner revealing to Maggie that he hacked the voting system to ensure Stone's win. Olson attempts to bully Stone a third time, but Stone knocks him out. As Stone delivers his speech, he relives his most embarrassing high-school moment and takes off all his clothes confidently. He walks off stage to unite with his high-school crush Darla McGuckian.\nBefore the ending credits, Maggie is pregnant and Joyner has joined the CIA. As a gift for his first day on the job, Stone gives Joyner back his varsity jacket from high school, which Stone had kept. The two friends climb into Stone's truck and drive off to begin the work day.", "cast": "Dwayne Johnson as Bob Stone / Robbie Weirdicht: A former bullied, overweight, friendless high school student-turned-big bodied CIA agent.\nSione Kelepi as Young Robbie Wheirdicht\nKevin Hart as Calvin Joyner: A former star athlete that went to Robbie's high school, now working as an accountant.\nAmy Ryan as Agent Pamela Harris: A CIA agent who suspects Bob is a rogue agent.\nAaron Paul as Phil Stanton: Bob's former partner who's believed to be dead after being killed in action.\nDanielle Nicolet as Maggie Joyner: Calvin's high school sweetheart now turned wife.\nTimothy John Smith as Agent Nick Cooper.\nMegan Park as the waitress in the bar.\nThomas Kretschmann as the buyer: A man who wants to buy US satellite codes.\nJason Bateman as Trevor: A former high school student who bullied Robbie in the past.\nDylan Boyack as Young Trevor\nMelissa McCarthy as Darla (uncredited): Robbie's high school crush.\nKumail Nanjiani as Jared: the airport security guard."}