{"_movieID": "109091", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:37", "summary": "The Counselor is a 2013 crime thriller film directed by Ridley Scott and written by Cormac McCarthy. It stars Michael Fassbender as the eponymous Counselor as well as Penélope Cruz, Cameron Diaz, Javier Bardem and Brad Pitt. The film deals with primal human concerns like greed, mortality, love, and trust related to the theme of corruption and profit in a high-stakes criminal environment. Out of greed, the Counselor gets irrevocably in over his head in a drug deal around the troubled Ciudad Juarez, Mexico/Texas border area.\nThe Counselor was chosen as the closing film at the 2013 Morelia Film Festival and also played the Cork Film Festival. The film was theatrically released on October 25, 2013 and is dedicated to Scott's brother, Tony, who died in 2012. It received polarizing reviews and grossed $71 million worldwide against a budget of $25 million.", "plot": "A high-level cartel lawyer with dirty hands who is known only as \"The Counselor\" and his girlfriend Laura are talking in bed. Meanwhile, somewhere in Mexico, cocaine is packaged in barrels and concealed in a sewage truck, driven across the border and stored at a sewage treatment plant. After the Counselor goes to Amsterdam to meet with a diamond dealer to purchase an engagement ring for Laura, he proposes and she accepts. At a party back in Texas thrown by Reiner and girlfriend Malkina, a former call-girl with a greedy lust for money, the Counselor discusses a nightclub he and Reiner intend to run, as well as an upcoming drug deal, which would be his first. Reiner also describes an execution device called \"the bolito\" which gradually strangles and decapitates the victim.\nThe Counselor meets with Westray (Brad Pitt), a business associate of Reiner's. He hears of the deal's 4000-percent return rate, but Westray warns the Counselor about becoming involved, saying that Mexican cartels are merciless. The Counselor remains outwardly confident and unconcerned. Malkina gains knowledge of the deal through her access to Reiner and by conveniently overhearing various intercoms in Reiner's home. Reiner tells the Counselor how disturbed and oddly aroused he was from an incident where he witnessed Malkina masturbate with his Ferrari California's windshield.\nThe Counselor visits a client, a prison inmate named Ruth who is on trial for murder. Ruth's son is a biker and a valued drug cartel member known as \"the Green Hornet\", recently arrested for speeding. The Counselor agrees to bail him out of jail. Malkina senses an opportunity to undermine the Counselor's upcoming deal and to profit for herself. She employs \"the Wireman\" to steal the drugs. He decapitates the biker, Ruth's recently released son, with a wire stretched across an empty desert road. Then the Wireman steals the truck containing the cocaine. Learning of the theft, Westray meets with the Counselor to notify him that the biker is dead and the cocaine stolen, bleakly intoning the Counselor's culpability. Westray says he is leaving town immediately and suggests the Counselor do the same. Westray explains that the cartel's ruthlessness extends to creating \"snuff films\" where murder victims are filmed having necrophilia performed on them on camera. The Counselor makes an urgent call to Laura, arranging to meet her in another state, where he will explain.\nThe cartel has learned that the Counselor bailed out the Green Hornet, which appears as suspicious timing and fully blameworthy for the punitive purposes of the cartel. In Texas, two cartel members pretending to be police officers pull over the Wireman and his accomplice, killing both and also gunning down an innocent driver who comes upon the scene. Reiner is accidentally killed by cartel members while they are attempting to capture him. The cartel then kidnaps Laura. In a last-ditch effort, the Counselor contacts Jefe, a high-ranking cartel member, for suggestions on what to do next. Jefe darkly and mordantly advises the Counselor to resign himself irrevocably to the choices he made long beforehand, speaking philosophically, citing the life and poetry of Antonio Machado to underline his advice. The Counselor goes to Mexico, hoping to find and rescue Laura there. A package is slipped under the door of his hotel room and in it he finds a DVD with \"Hola!\" written on it, breaking down in heavy sobs at the awareness that the disc likely contains a snuff film of Laura sent by the cartel. In an unnamed location, Laura's body is dumped into a landfill.\nMalkina's failed effort to steal the drugs does not deter her. She tracks Westray to London, where she hires a blonde woman to seduce him and steal his bank codes. She then has accomplices steal Westray's laptop, and he is killed with the \"bolito\" device that Reiner had previously described. Malkina then meets her banker at a restaurant, coolly explaining how she wants her profits and accounts to be handled."}