{"_movieID": "209112", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:58:34", "summary": "Batman v Superman: Dawn of Justice is a 2016 American superhero film featuring the DC Comics characters Batman and Superman. It is a follow-up to 2013's Man of Steel and the second installment in the DC Extended Universe (DCEU). The film is directed by Zack Snyder, written by Chris Terrio and David S. Goyer, and features an ensemble cast that includes Ben Affleck, Henry Cavill, Amy Adams, Jesse Eisenberg, Diane Lane, Laurence Fishburne, Jeremy Irons, Holly Hunter, and Gal Gadot. Batman v Superman: Dawn of Justice is the first live-action film to feature Batman and Superman together, as well as the first live-action cinematic portrayal of Wonder Woman. In the film, criminal mastermind Lex Luthor manipulates Batman into a preemptive battle with Superman, whom Luthor is obsessed with.\nThe film was announced at the 2013 San Diego Comic-Con after the release of Man of Steel. Snyder stated that the film would take inspiration from the Batman comic book series The Dark Knight Returns by Frank Miller but clarified that it would follow an original premise. The incarnation of Batman in the film is different from the character's previous portrayal in The Dark Knight Trilogy, serving as a cinematic reboot of the character. The film is also inspired by narrative elements from the \"Death of Superman\". Pre-production began at East Los Angeles College in October 2013, with principal photography starting in May 2014 in Detroit. Additional filming also took place in Illinois and New Mexico, concluding that December.\nBatman v Superman: Dawn of Justice premiered at the Auditorio Nacional in Mexico City on March 19, 2016, and was released in the United States on March 25, 2016, in 2D, Real D 3D, IMAX 3D, IMAX, 4DX, premium large formats, and 70 mm prints by Warner Bros. Pictures. Following a strong debut that set new box office records, the film experienced a historic drop in its second weekend and never recovered. Despite grossing $873 million and turning a profit, the film was deemed a box office disappointment for failing to reach its expected $1 billion gross. It received generally unfavorable reviews from critics for its dark tone and disjointed screenplay and pacing, though some praised its visual style, effects and acting performances (notably Affleck and Gadot). An extended cut dubbed the \"Ultimate Edition\", which features 31 minutes of additional footage, was released digitally on June 28, 2016, and on Blu-ray on July 19, 2016, to an improved critical reception. A sequel, Justice League, was released in November 2017.", "plot": "Eighteen months after the battle between Superman and General Zod in Metropolis, Superman has become a controversial figure. Billionaire Bruce Wayne, who has operated in Gotham City as the vigilante Batman for twenty years, sees Superman as an extraterrestrial threat to humanity. After learning of Batman's form of justice, Clark Kent (Superman's civilian identity) seeks to expose him via Daily Planet articles. Wayne learns that Russian weapon trafficker Anatoli Knyazev has been contacting LexCorp mogul Lex Luthor. Meanwhile, Luthor unsuccessfully tries to persuade Senator June Finch to allow him to import kryptonite retrieved from the Indian Ocean following Zod's terraforming attempt, claiming he wants to maintain it as a deterrent against future Kryptonian and metahuman threats. He instead makes alternative plans with Finch's subordinate and gains access to Zod's body and the Kryptonian scout ship.\nBruce attends a gala at LexCorp to steal encrypted data from the company's mainframe, but has it taken from him by an antiquities dealer named Diana Prince; she eventually returns it to Bruce when she is unable to access the information. While decrypting the drive, Bruce dreams of a post-apocalyptic world where he leads a group of rebels against an evil Superman. He is awakened from his dream by an unidentified person, appearing through a portal, who warns him of Lois Lane's crucial role in the future, and urges him to find \"the others\" before vanishing. Upon fully decrypting the drive, Wayne discovers Luthor's files on several metahuman individuals across the globe. One of them is Prince herself, who is shown in a photo taken during World War I. Wayne admits to Alfred Pennyworth that he plans to steal the kryptonite to weaponize it, should it become necessary to fight Superman.\nAt a Congressional hearing, as Finch questions Superman on the validity of his actions, a bomb smuggled by Luthor goes off and kills everyone present but Superman. Believing he should have detected the bomb, and frustrated by his failure to save them, Superman goes into self-imposed exile. Batman breaks into LexCorp and steals the kryptonite. In preparation to battle Superman, he builds a powered exoskeleton, creates a kryptonite grenade launcher, and a kryptonite-tipped spear. Meanwhile, Luthor enters the Kryptonian ship and accesses a vast technology database accumulated from over 100,000 worlds.\nTo bring Superman out of exile, Luthor kidnaps Lois and Martha Kent, Clark's adoptive mother. Lex throws Lois off the LexCorp building, but Superman quickly saves her and goes on to confront Luthor, who reveals to Superman that he manipulated Superman and Batman against each other by fueling their mutual distrust. Luthor demands that Superman kill Batman in exchange for Martha's life. Superman tries to explain the situation to Batman, but instead Batman attacks Superman and eventually subdues him with the aid of a kryptonite gas. Before Batman can kill Superman with the spear, Superman urges Batman to \"save Martha\", whose name is also shared with Batman's mother, confusing him long enough for Lois to arrive and explain what Superman meant. Realizing how far he has fallen and unwilling to let an innocent die, Batman rescues Martha, while Superman confronts Luthor on the scout ship.\nLuthor executes his backup plan, unleashing a genetically engineered monster with DNA from both Zod's body and his own blood. Diana Prince arrives unexpectedly; revealing her metahuman nature, she joins forces with Batman and Superman to eliminate the creature. When they are all outmatched, Superman realizes its vulnerability to kryptonite, and retrieves the spear to kill it. After impaling it with the spear, in the creature's last moments, it kills Superman, who himself has been weakened by exposure to kryptonite.\nLuthor is arrested and Batman confronts him in prison, warning Luthor that he will always be watching him. Luthor gloats that Superman's death has made the world vulnerable to powerful alien threats. A memorial is held for Superman in Metropolis. Clark is also declared dead, with various friends and family members including Bruce Wayne and Diana Prince attending his funeral in Smallville. Martha gives an envelope to Lois, which contains an engagement ring from Clark. After the funeral, Bruce expresses his regrets to Diana about how he failed Superman. He reveals to her that he plans to form a team of metahumans, starting with those from Luthor's files, to help protect the world in Superman's absence. After they leave, the dirt atop Clark's coffin levitates.", "cast": "Ben Affleck as Bruce Wayne / Batman:A billionaire socialite and owner of Wayne Enterprises who dedicates himself to protecting Gotham City from its criminal underworld as a highly trained, masked vigilante. The Batsuit in this film is made of a form-fitting fabric as opposed to the armored suits in previous portrayals, and a mechanical suit is also featured which Batman uses in his fight against Superman. On Batman's suit, Zack Snyder commented \"I had a really strong idea about what I wanted to do – I really wanted to do sort of a fabric-based Batman; not what's become the more normal, armored Batman. That's how we evolved it.\" Unlike previous versions who spoke in a deeper voice as Batman, this version uses a voice modulator to distort his real voice, with Affleck stating a well known billionaire would likely have his voice recognized. When asked what makes this Batman different from the previous portrayals, Affleck said this Batman \"is a little older, he's a little more world weary. He's been around the block once or twice so he's a little wiser but he's definitely more cynical and a little darker and more jaded\", adding that Batman has gotten \"more exposed to the violence and the criminal element of that world over time.\" The film's Batman was influenced by Frank Miller's The Dark Knight Returns, which shows Batman in his 50s. Snyder said, \"I definitely wanted an older Batman. I wanted a war-weary Batman. That's why, in a lot of ways, Ben was really perfect for me - we kind of aged him a little bit. It worked really great. I'm really excited about the Batman we created.\" On Affleck's casting as Batman, Snyder said, \"Ben provides an interesting counterbalance to Henry's Superman. He has the acting chops to create a layered portrayal of a man who is older and wiser than Clark Kent and bears the scars of a seasoned crime fighter, but retain the charm that the world sees in billionaire Bruce Wayne.\" Affleck praised Snyder for tackling the impact of the destruction caused in Metropolis in the previous installment, saying, \"One of the things I liked was Zack's idea of showing accountability and the consequences of violence and seeing that there are real people in those buildings\", adding, \"And in fact, one of those buildings was Bruce Wayne's building so he knew people who died in that Black Zero event\". Brandon Spink portrays a young Bruce Wayne.Henry Cavill as Clark Kent / Superman:A Metropolis-based Kryptonian survivor and a journalist for the Daily Planet who uses his extraterrestrial abilities to protect humanity. Superman's suit in Batman v Superman is somewhat similar to that in Man of Steel, but with enhanced, high-tech-style surface detail and a shinier, more metallic-looking cape. A quote written in Kryptonian was added into Superman's symbol which says \"Where we had thought to stand alone, we will be with all the world\". As to how Superman has embraced his role as a hero since the previous installment, Cavill said \"He's more used to this gig, doing his best to save as many lives as he can\", further explaining, \"He is no longer frantic. He's no longer a wet-behind-the-ears kind of superhero.\" And as to how Superman views Batman's approach to crime fighting, Cavill said \"He doesn't agree with his form of justice. For this farm boy, who tries to do things the right way, justice at any cost is not something he can come to terms with\" hoping to use his position as a journalist for the Daily Planet to \"show the world what this Batman dude is doing.\" The film addresses the destruction caused by Superman and Zod in Metropolis, a part of Man of Steel that was criticized for being too extensive for Superman, to which Snyder responded \"I was surprised because that's the thesis of Superman for me, that you can't just have superheroes knock around and have there be no consequences\". On what the public perception of Superman is in the film, Cavill said \"In this movie, everyone has split into different directions as to how they feel about this alien\", adding, \"Some people love him, some hate him. Other people fear him. Is he a tyrant?\" When asked how Superman has evolved since Man of Steel, Cavill said \"Superman himself isn't that different. He does, however, have to deal with a new set of problems because he's now been revealed to the world. This film is more about how the world in general – and Batman in particular – sees this alien, and less about the evolution of Superman.\" Cavill described Superman and Batman as being the \"two sides of the same coin. They have the same goal, but use very different methods to achieve it. Understandably, that leads them to clash with one another, and their conflict is a historic moment.\"Amy Adams as Lois Lane:A reporter for the Daily Planet and love interest of Clark Kent. About her role, Adams stated that \"Lois is still sort of like the key to the information. She's the girl going out and getting it and figuring it out and putting it together and all of that, so she's very much involved.\" When asked on her thoughts on portraying Lois Lane in the film, Adams replied \"I love that she's fearless. I'm not that way so it's really fun that she really is not afraid of the consequences.\" On Lois Lane and Clark Kent's relationship in the film, Adams said, \"What's great about this is that, as far as the relationship with Lois and Clark goes, when we meet them you can tell that they've been in a relationship for while,\" further explaining, \"So it was great to get to develop that sort of intimacy and that sort of friendship that I've developed with Henry, to get to bring that to the screen.\" She also described Clark Kent as being Lois Lane's connection to humanity and said, \"She may have some tunnel vision, but she's got a job and moral standards. [When] we met her before, she would do anything to get the story – now Clark has instilled some faith in humanity in her. Her relationship with Clark is the closest thing she has to anything faith-based, you know? Although moving in with Clark brings issues.\"Jesse Eisenberg as Lex Luthor:An eccentric young businessman and hereditary CEO of LexCorp who is obsessed with defeating Superman. Luthor is usually depicted as bald in the comics while the film's version of Luthor depicts him with hair throughout the majority of the film. When speaking about his portrayal of Luthor compared to previous portrayals, Eisenberg said, \"When you're doing a movie like this and playing a character that's already been played, the further away it is from those previous incarnations the better\", adding, \"Because chances are, especially with a guy like Gene Hackman or Kevin Spacey, you're not going to get favorably compared.\" Eisenberg explained his character's background as having \"a core of reality\", saying, \"[Luthor] has a backstory that's tragic and an emotional inner life that's authentic. That's in the movie. It was my interest in playing the character with a real emotional core, and this writer, Chris Terrio's interest in creating a character that seemed viable in reality.\" On Luthor's behavior and attitude towards Superman, Eisenberg said, \"He is a narcissist of the first order but complicated in that way as well in that he is terribly troubled and competitive and vengeful. He looks at Superman not as somebody to destroy but as genuine threat to humanity.\" Eisenberg described his role as Lex Luthor as his most advantageous role yet, saying, \"In a lot of ways Luthor is more of a stretch than any character you would do in an independent movie, which is normally the place you stretch. So in that way it was not at all compromised. If anything it was the best, most advantageous role I've ever been given. The opportunity to do an interesting character on a movie of that scale is incredibly rare.\" Eisenberg describes a theme in the film, saying \"It raises the question of how one man can have so much power. These are the kind of things that we talk about authoritarian states. They're addressing geopolitics in this movie and not in a way that's pretentious or esoteric\".Diane Lane as Martha Kent:Clark's adoptive mother. On her role as Superman's mother, Lane stated, \"I always said if I had a son that would be the ultimate test. Raise a good man — there's something noble about that.\" When asked on her experience working with Zack Snyder on Batman v Superman, Lane said she was impressed by Snyder's imagination and added, \"Who gets offered the opportunity to bring such things to the screen for millions of people? That's tremendous. It's an honor and a burden, and I can't imagine shouldering that load.\" On Martha Kent's support for her son Superman, Lane stated, \"I think that she's reminding him he does have a choice\", further explaining, \"He doesn't have to be yoked to this destiny. He can actually feel the pleasure of making the choice.\"Laurence Fishburne as Perry White:The editor-in-chief of the Daily Planet and Clark and Lois' boss. When asked about reprising his role in the film, Fishburne said, \"I was happy to come back to the character. I got really excited when I read it and I saw what was at the center at the movie, which was this huge fight between these two titans.\" On Perry White's role in the film, Fishburne said, \"He's dealing with the fact that his medium looks like it's going the way of the dinosaurs, so that's a difficult position to be in\", adding, the \"good news is he's got a great reporter like Lois Lane and a new great reporter like Clark Kent who are interested and hungry to do the job.\" Describing Perry White's working relationship with Lois Lane, Fisburne stated, \"She's my favorite child and she's my problem child.\" On his experience filming and his character's interactions, Fishburne said, \"It was really just a couple of days in the beginning with Lois, Clark, and Perry. And the rest was just me with Lois, figuring out how to get her where she needed to go. But the relationships I think were established really well in Man of Steel.\"Jeremy Irons as Alfred Pennyworth:Bruce Wayne's butler, chief of security and trusted confidant. Irons described his take on Alfred Pennyworth as being \"quite a different Alfred than we have seen so far. Zack Snyder had very clear views about what he wanted. I would just say he's more hands-on perhaps than just a butler.\" When asked what makes his Alfred different than from previous portrayals, Irons said, \"Zack Snyder, the director, wanted to create a completely different Alfred. So I felt I didn't have to carry any baggage from previous ones. It's sort of a reincarnation, if you'd like. I had a feeling I was creating my own Alfred, more of a man who can actually do anything if he has to.\" According to Irons, Alfred is \"a bit of a grease monkey, and he's very involved in the decisions Bruce makes.\" On how Alfred would be in the film, Irons stated, \"He has an interesting history. He's a very competent man. He's the sort of man I think anyone would like to be married to. He can sort of do everything: change light bulbs, blow up bridges if he has to.\"Holly Hunter as June Finch:United States Senator from Kentucky who heads the political argument on Superman and his actions. Describing her experience on being in the film, Hunter said, \"It was really fun to be part of a giant, massive piece of machinery, headed up by Zack Snyder, who is thoroughly at home in that uber mega environment. Most people would have a nervous breakdown with that kind of pressure, and he's enthralled.\" When asked how she got involved in the film, Hunter said, \"Zack asked me. He came to me with an offer, and I was like, 'Yeah, that would be fun.' It's fun to mix it up. I have scenes with Superman. He looks phenomenal. And to see Ben [Affleck, who plays Batman] and Henry [Cavill, who plays Superman] together is quite formidable.\" On acting in a superhero film, Hunter stated, \"Being somebody who's like a theater geek that I am, I can just go right back to Aeschylus and Euripides and Sophocles. They were writing about gods and goddesses versus humans, and how gods could distort, pervert or help people get what they want. And so, for me, this didn't feel foreign because that was the translation that it went through for me; that was my filter.\" On her character's views on Superman, Hunter stated, \"What is her problem with Superman? That absolute power corrupts absolutely. When power is acting autonomously, unilaterally with no legislation, with no boundaries, with no law, except for the ones that he deems in his own mind, that can be detrimental.\" Describing her character, Hunter said, \"I thought that, you know, as a senator, she brought her female-ness to the job in how she listened, in her curiosity, in her ability to evaluate\", adding, \"[It] felt very female to me.\"Gal Gadot as Diana Prince:An immortal Amazonian warrior who is the crown princess of Themyscira. Wonder Woman's suit is made out of chrome-painted polyurethane, and she uses her hand wraps and sword harnesses. Gadot described her character as having \"many strengths and powers, but at the end of the day, she's a woman with a lot of emotional intelligence\". Describing Wonder Woman's compassion, Gadot stated, \"It's all her heart—that's her strength. I think women are amazing for being able to show what they feel. I admire women who do.\" On her thoughts on portraying Wonder Woman, Gadot said, \"You know Wonder Woman; she's amazing. I love everything that she represents and everything that she stands for. She's all about love and compassion and truth and justice and equality, and she's a whole lot of woman. For me, it was important that people can relate to her.\" Describing her role in the film, Gadot said, \"In this movie you get a glimpse of who Wonder Woman is — she's being introduced into this DC Comics universe. But we were talking about her strengths, her façade, her attitude. Why is she acting the way she is?\" On Wonder Woman's battle scene with Doomsday, Gadot stated, \"I remember after we did that take, Zack came to me and he said, 'Did you just have a smirk?' I said, 'Yeah.' And he asked, 'Why? I think I like it, but why?' 'Well, if he's gonna mess with her, then she's gonna mess with him. And she knows she's gonna win.' At the end of the day, Wonder Woman is a peace seeker. But when fight arrives, she can fight. She's a warrior and she enjoys the adrenaline of the fight.\" Gadot also stated \"I don't want people to think she is perfect\", further explaining, \"She can be naughty.\" On Gadot's casting as Wonder Woman, Snyder said \"Wonder Woman is arguably one of the most powerful female characters of all time and a fan favorite in the DC Universe. Not only is Gal an amazing actress, but she also has that magical quality that makes her perfect for the role.\" Gadot underwent a diet and training regimen, practiced different martial arts and gained 17 pounds of muscle for the role. Gadot was previously offered the role as Faora Hu-Ul in Man of Steel but declined because she was pregnant at that time; this allowed her to be later cast as Wonder Woman in Batman v Superman: Dawn of Justice.Scoot McNairy as Wallace Keefe:An amputee employee of Wayne Enterprises who is crippled during the destruction of Metropolis and holds Superman responsible. McNairy describes his character as a type of character who he has never played before and stated \"getting into that thing was definitely something I had to wrap my head around emotionally in order to play that character.\" When asked if the character was being kept as a surprise until the film's release, McNairy said \"I don't know if I'd call it necessarily a surprise. I would say it's a character that lends itself to the story being told.\" On his thoughts on being in the film, McNairy stated \"Playing in that world with comic books you've been reading since you were a kid, being someone in that world, it's awesome.\"Callan Mulvey as Anatoli Knyazev:A Russian terrorist who works for Luthor. On casting Mulvey in the film, Zack Snyder stated, \"I just had the good fortune to work with Callan on 300: Rise of an Empire and was very impressed with his incredible talent,\" further adding, \"He's a fantastic actor and I'm looking forward to having the chance to work with him again.\" On working with Snyder again, Mulvey stated \"Zack is such a visionary, so I know it's going to be an amazing project. Talent as a director aside, people really love working for Zack and being on his sets, which says it all really.\"Tao Okamoto as Mercy Graves:Assistant to Luthor. On her role in the film, Okamoto said \"It was so fascinating. I didn't have a big speaking role. I used to act as sassy girls all the time as a model so that wasn't so challenging to me. But I enjoyed it so much, being mean. I tried to be mean.\" On Okamoto's casting, Snyder said \"Tao is a striking presence whose beauty is aptly rivaled by her amazing abilities as an actress. I'm really excited to have her joining us on this adventure.\"Robin Atkin Downes performed the motion capture and voice work for the creature at the film's climax. Although the character is not named directly, it was revealed later to be that of Doomsday. The role was kept under such heavy secrecy that Downes did not know who he was playing until the second trailer was released. On his role, Downes stated that he was proud to be part of the film and expressed his admiration in helping bring Doomsday to life in Batman v Superman: Dawn of Justice. When asked why Doomsday was chosen to be in the film, Zack Snyder stated \"To go up against heroes like Batman and Superman, we wanted to introduce one of the DC Universe's most iconic and powerful villains\", further explaining, \"He is essentially an unstoppable force. He poses a real threat to the world within the film.\" Snyder has confirmed Doomsday will return in the DCEU, stating \"Well, you have Doomsday, right? He doesn't just crawl out of the ground. He has his own mythology, right? So that has to be explored.\" Downes has previously provided voice roles for various DC animated films and shows as well as DC video games.Additionally, Jeffrey Dean Morgan and Lauren Cohan portray Thomas and Martha Wayne, Bruce Wayne's deceased parents, Patrick Wilson portrays the President of the United States in a voice role, and Michael Cassidy portrays Jimmy Olsen, a CIA agent. Reprising their roles from Man of Steel are Harry Lennix as Secretary Calvin Swanwick, Christina Wren as Major Carrie Farris, Kevin Costner as Jonathan Kent, Rebecca Buller as Jenny Jurwich, Chad Krowchuk as Glen Woodburn, and Carla Gugino as the Kryptonian A.I. Kelor. The corpse of General Zod also appears in the film in a crucial role; however, Michael Shannon did not film any scenes for the film and the corpse was created using the physique of fitness model Greg Plitt and a head-shot of Shannon. Mark Edward Taylor portrays Jack O'Dwyer, an executive of Wayne Enterprises.Ezra Miller, Jason Momoa, and Ray Fisher appear as Barry Allen / Flash, Arthur Curry / Aquaman, and Victor Stone / Cyborg respectively in brief appearances, which led to their inclusion in the Justice League film. Joe Morton appears in a role as Silas Stone, Victor's father. U.S. Senator Patrick Leahy makes a cameo appearance as Senator Purrington, whilst U.S. Senator Debbie Stabenow also makes a cameo as the Governor of New Jersey. Neil deGrasse Tyson, Soledad O'Brien, Anderson Cooper, Nancy Grace and Charlie Rose appear as themselves. Jena Malone was cast as S.T.A.R. Labs scientist Jenet Klyburn, but her scenes were cut from the theatrical release, along with Man of Steel characters Coburn Goss as Father Leone and Joseph Cranford as Pete Ross; they were restored for the Ultimate Edition home media release. Talk show host Jon Stewart has a cameo in the extended cut. To further establish the interconnection between the films of the shared universe, Chris Pine appears on Diana Prince's photo as Steve Trevor, which he reprised in Wonder Woman."}