{"_movieID": "49021", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:02:03", "summary": "Killer Elite is a 2011 action thriller film starring Jason Statham, Clive Owen and Robert De Niro. The film is based on the 1991 novel The Feather Men by Sir Ranulph Fiennes and is directed by Gary McKendry.", "plot": "In 1980, mercenaries Danny Bryce (Jason Statham), Hunter (Robert De Niro), Davies (Dominic Purcell), and Meier (Aden Young) are in Mexico to assassinate a man. Danny is shot when he becomes distracted after realizing he has killed the man in front of the target's young child. Affected by this, Danny retires and returns to his native Australia.\nThe following year, Danny is summoned to Oman to meet The Agent (Adewale Akinnuoye-Agbaje). He learns that Hunter failed a $6 million job. If Danny does not complete Hunter's mission, Hunter will be executed. Sheikh Amr, a deposed king of a small region of Oman, wants Danny to kill three former SAS troopers—Steven Harris (Lachy Hulme), Steven Cregg (Grant Bowler), and Simon McCann (Daniel Roberts)—for killing his three eldest sons during the Dhofar Rebellion. Danny must videotape their confessions and make their deaths look like accidents, all before the terminally ill sheikh dies. This will allow the sheikh's fourth son, Bakhait (Firass Dirani), to regain control of his father's desert region. Davies and Meier agree to help Danny for a share of the money.\nDanny and Meier sneak into Harris's house. After Harris confesses on videotape, they take him to the bathroom, intending to make it look like he slipped and hit his head. However, Harris's girlfriend knocks on the door. While Danny and Meier are distracted, Harris attempts to break free, causing Meier to kill him.\nIn England, Davies questions bar patrons about former SAS members. This is reported to the Feather Men, a secret society of former operatives protecting their own. Their head enforcer, Spike Logan (Clive Owen), is sent to investigate.\nDavies discovers Cregg preparing for a long nighttime march in wintry weather on the Brecon Beacons mountain range. Danny infiltrates the base, disguised in uniform, and drugs Cregg's coffee. Danny follows Cregg on the march and makes him confess before the drug sends him into shock to die of hypothermia.\nFor their last target, their plan is to crash a remote-controlled truck into McCann's car. With the help of the inexperienced Jake (Michael Dorman), Meier kills McCann; however, Logan and his men were watching over McCann. A gunfight ensues, and Jake accidentally kills Meier. Danny and Davies part ways. Davies is tracked down by Logan's men, and is hit by a truck and killed while trying to escape.\nDanny returns to Oman and gives the sheikh the last confession, which he has faked. Hunter is released, while Danny heads back to Australia and reunites with Anne (Yvonne Strahovski), a childhood acquaintance. Soon, he is informed by the Agent that there is one last man who participated in the sheikh's sons' murders and that this man, Ranulph Fiennes, is about to release a book about his experiences in the SAS.\nDanny sends Anne to France so Hunter can protect her. The sheikh’s son confirms that Harris was innocent. Logan, meanwhile, traces Danny through the Agent and sends a team to protect the author, but Jake distracts them, allowing Danny to shoot Fiennes. He only wounds the man, however, taking pictures that appear to show him dead. Logan captures Danny, taking him to an abandoned warehouse, but then a government agent arrives and reveals that the British government is behind the events because of the sheikh's valuable oil reserves. A three-way battle ensues, with Danny escaping and Logan shooting the government agent.\nIn Paris, the Agent tries to kidnap Anne for ransom, but Hunter beats the henchman and shoots the Agent in the leg. Hunter seems threatening at first, but spares his life.\nDanny and Hunter head to Oman to give the sheikh the pictures. However, Logan arrives first, tells the sheikh the pictures are fake and then stabs him to death. The sheikh's son does not care; he gives Logan the money. Hunter spots Logan leaving, and they chase after him, along with the sheikh's men.\nAfter stopping the sheikh's men, Danny and Hunter confront Logan on a desert road. Hunter takes some of the money for his expenses and his family. They leave the remainder, telling Logan that he will need it to start a new life after killing the government agent and acting against the wishes of the Feather Men and the British government. Danny says that it is over for him and that Logan must make up his own mind what to do. Danny reunites with Anne."}