{"_movieID": "441829", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:16", "summary": "Team Thor: Part 2 (also known as Team Thor: Part 2, \"Where Are They Now?\") is a 2017 mockumentary style comedy short film directed by Taika Waititi and starring Chris Hemsworth. It is a sequel to the 2016 short film Team Thor, also directed by Waititi. Hemsworth reprises his role as Thor from the Marvel Cinematic Universe and Daley Pearson returns as his roommate Darryl Jacobson from the first Team Thor film. As was the first film, it was met with a positive response from fans, and a third sequel, Team Darryl, was later released in 2018.", "plot": "The mockumentary begins as the last one with showing Thor and his roommate Darryl in an interview about their lives, they discuss their domestic responsibilities, where Thor asserts that Darryl does most of the cleaning, especially of the toilet, which he claims is due to Darryl being the one who makes the biggest mess there. This is intercut with clips of Darryl cleaning the bathroom and finding long strands of blond hair in the sewerage of the bathtub.The interview continues with both of them insisting that they enjoy living together despite their different cultural upbringing, as Thor is used to living in \"huge golden castles\" and Darryl is comfortable in Australian suburbia. Darryl states that Thor is a nice person but very out of touch with time, explaining that the Norse god doesn't seem value many of his earthly belongings, even such that had been in Darryl's family very long, due to them not seeming notable to him since he deals with concepts in centuries not days.The next segment shows Thor and Darryl engaged in an argument about rent, with Darryl bemoaning that none of Thor's monetary contributions can be used to pay rent for their home. Thor ensures him that his Asgardian curency is perfectly fine and worth a lot of money, and that if nothing they should be able to sell them to fans if they advertise them as Thor's belongings. Darryl suggests Thor get a job, to which Thor laughs at him and says that his job is saving the planet. He urges Darryl to get his own job, then makes light of the job he has for lacking physical strain. The conversation ends with Thor deciding to hire a servant without Darryl's consent, which Darryl finds random and unrelated to their discussion. Later Thor does end up hiring a servant, whom he tells to get a job and pay rent for him.Thor again visits the kindergarten from the last film and gets emotional when he recounts the events of Captain America: Civil War since he feels left out because no one of his friends from the Avengers team contacted him to be part of any of it. The film ends with Thor proclaiming that he doesn't need anyone else but Darryl and that he should get Darryl a superhero outfit, preferably with a cape."}