{"_movieID": "392216", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:02", "summary": "Phineas and Ferb: Star Wars (also titled Episode IVa: May the Ferb Be with You) is a 1-hour long crossover episode of the American animated series Phineas and Ferb featuring characters from Star Wars. It aired on July 26, 2014, on Disney Channel and later on Disney XD on August 4, 2014. The story, while non-canonical, is a retelling of the 1977 film Star Wars in the style of Rosencrantz and Guildenstern Are Dead, where the Phineas and Ferb characters interact with the Star Wars characters.", "plot": "Perry the \"Rebelpus\", the Rebel Alliance's best platypus agent, breaks into the Imperial Corporate Offices and stealing a disc containing the plans for the Death Star. After escaping, he rendezvous with Princess Leia's ship. Meanwhile, on the planet Tatooine, Phineas Flynn and Ferb Fletcher are shown living with their parents as contented moisture farmers as neighbors to Luke Skywalker. Darth Vader's Star Destroyer intercepts Leia's ship, forcing her to load the disc into R2-D2. As she does this, she is observed by a trio of Imperial stormtroopers including  Candace Flynn. Candace attempts to report the actions of the Rebels to the empire but is put down by her commanding officer, as she and her two cohorts are tasked with finding socks for Darth Vader. After seeing R2-D2 and C-3PO entering an escape pod, the trio decide to pursue them in a second escape pod and prove their worth by recapturing the lost plans, with Perry secretly hitching a ride with them.\nElsewhere, Darthenshmirtz arrives with his robotic underling Norm-3P0 at the Death Star. He reveals that he has a new invention that is even more evil, but that requires the Force to power it. Candace and her companions are on the trail of the droids until their commander sends them into Mos Eisley. Perry continues trailing the droids as they are seized by Jawas and then sold to Owen Lars, and eventually absconds with R2-D2. They run into Phineas and Ferb on their way to Obi-Wan Kenobi's, whom Phineas and Ferb are acquainted with as he has given them instruction in the Jedi arts. Despite their offer of a ride, R2-D2 continues on his own while Perry remains unseen by the duo, unaware that their collision has resulted in the Death Star disc remaining in the back seat of Phineas and Ferb's speeder.\nUpon discovering the disc, Phineas and Ferb set out to return it to R2-D2, which takes them to Mos Eisley where they encounter Watto's son Blatto. With Blatto's help they discover that the disc contains the Death Star plans, and they are pursued after being spotted by Candace's trio. The brothers just miss Artoo departing with Luke, Obi-Wan, C-3PO, Han Solo, and Chewbacca aboard the Millennium Falcon. Determined to return the disc, the pair travel to the Mos Eisley cantina and are introduced to Isabella Garcia-Shapiro, captain of the Centennial Chihuahua and an rival of Han Solo's. Isabella agrees to transport them; meanwhile, Candace returns to the Death Star. Meanwhile, aboard the Death Star, Darthenshmirtz learns that he can extract Force energy from Darth Vader's trash just before the planet Alderaan is destroyed. The Chihuahua catches up to the Millennium Falcon, but both end up caught in a tractor beam; the Chihuahua is freed after Phineas and Ferb modify the ship so that it can take on the appearance of a doughnut-selling spaceship.\nOnce aboard the Death Star, Phineas and Ferb are surprised and delighted to run into Perry, who was their pet before they discovered him to be a rebel agent, an event that initially upset them but that they have come to terms with. Perry makes his way to Darthenshmirtz's lair, only to end up encased in carbonite and left helpless as Darthenshmirtz unveils his new Sith-inator, a machine that will make him a Sith Lord even more evil than Vader. Ferb, sensing through the Force that Perry is in danger, leaves Phineas and Isabella to go to his aid, unknowingly passing Obi-Wan Kenobi on the way. He then knocks Perry's carbonite slab out of the way of a blast from the Sith-inator only to be hit himself, which begins his transformation into a Sith by giving him yellow irises (identical to Anakin Skywalker's transformation in Star Wars: Episode III – Revenge of the Sith). Elsewhere, Isabella and Phineas run into Candace, who pursues them, only to be saved from a fatal fall by Phineas, which causes her to rethink her stance on the Rebels. Darthenshmirtz is then attacked by a freed Perry, while Phineas gives Isabella the Death Star disc to take to the Rebels while he goes looking for Ferb.\nEntering Darthenshmirtz's lair, Phineas discovers an upgraded Sith-inator and Ferb, who has taken on an appearance similar to that of Darth Maul. Upon learning that his brother intends to create an army of Sith and rule the dark side, Phineas reluctantly confronts him in a lightsaber duel, in which both of them upgrade their lightsabers to possess multiple blades. Isabella travels to Yavin and delivers the Death Star plans, but despite the appeals of the Firestar Girls (Rebel versions of the Fireside Girls) refuses to join the Rebel Alliance. She changes her mind after a tense conversation with Han and Chewbacca, also convincing him to return to the rebels to help Luke; back on the Death Star, Candace and her two comrades likewise decide to join the rebellion. The battles between Perry and Darthenshmirtz and Phineas and Ferb continue and intersect, until Candace comes to Phineas' aid. Together they manage to destroy the Sith-inator, which restores Ferb to normal, and the trio-along with Baljeet and Buford-depart to get to the bus that brought the stormtroopers to the Death Star, but it leaves before they can get on it. Perry also leaves with a carbonite-encased Darthenshmirtz, while the rebels begin their attack on the Death Star.\nLeft stranded on the doomed battle station, Candace learns that Phineas is her baby brother and that their mother remarried, making Ferb their stepbrother. Before Phineas can expound on the subject, the Death Star detonates (a nod to the creator's decision not to touch on the history of who Phineas' father is). Fortunately, Isabella returns in the nick of time and saves the group, while the Fireside Girls rescue all of the civilian personnel from the Death Star. Darthenshmirtz escapes Perry's ship on a small escape pod, while Perry makes his way to Yavin to join the celebration attending the Death Star's destruction. The rebels then enjoy a dance party during which Isabella kisses Phineas."}