{"_movieID": "333339", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:57", "summary": "Ready Player One is a 2011 science fiction novel, and the debut novel of American author Ernest Cline. The story, set in a dystopia in 2044, follows protagonist Wade Watts on his search for an Easter egg in a worldwide virtual reality game, the discovery of which will lead him to inherit the game creator's fortune. Cline sold the rights to publish the novel in June 2010, in a bidding war to the Crown Publishing Group (a division of Random House). The book was published on August 16, 2011. An audiobook was released the same day; it was narrated by Wil Wheaton, who was mentioned briefly in one of the chapters.Ch. 20 In 2012, the book received an Alex Award from the Young Adult Library Services Association division of the American Library Association and won the 2012 Prometheus Award.A film adaptation, screenwritten by Cline and Zak Penn and directed by Steven Spielberg, was released on March 29, 2018.", "plot": "Teenager Wade Watts lives with his aunt in Oklahoma City in the \"stacks\", a poverty-stricken district constructed of trailer homes piled on top of each other. He spends his spare time as a \"gunter\" (\"egg hunter\"), logging on to the OASIS as an avatar under the moniker Parzival, reading Halliday's journal Anorak's Almanac, and researching details of the 1980s pop culture, mainly classic video games and movies, that Halliday loved. One day, he realizes that the first key is located on Ludus, the same virtual world as his own online high school, in a re-creation of the Dungeons & Dragons module Tomb of Horrors. He meets Art3mis, a famous female gunter and blogger who has been exploring the place, and advances further than she does when he defeats the AI Acererak at the video game Joust. He is awarded the Copper Key, and Parzival appears on the \"Scoreboard\", attracting the world's attention.\nParzival completes the Copper Gate's puzzles by teleporting to planet Middletown, playing through the Dungeons of Daggorath video game in a recreation of Halliday's parents' house and then role-playing Matthew Broderick's character in the film WarGames. Art3mis clears the gate shortly afterwards, as does Wade's best friend Aech. Wade’s fame enables him to make a living by endorsing virtual products. It also brings him to the attention of Nolan Sorrento, head of operations at Innovative Online Industries (IOI), a multinational corporation bent on a well-funded effort to find the Easter egg in order to take control of the OASIS and monetize it. When Wade refuses to join IOI, Sorrento attempts to kill him by blowing up the stacks where Wade lives, killing his aunt and disguising the explosion as a meth lab accident.\nWade escapes and moves to Columbus, Ohio (hometown of both GSS and IOI), where he lies low, assuming the pseudonym Bryce Lynch and living in an anonymous apartment designed for hardcore OASIS users. He considers an alliance with Aech, Art3mis, as well as Daito and Shoto, a duo of Japanese gunters who have also earned the Copper Key. Instead, he and Art3mis begin a wary friendship, but when he asks her out, Art3mis declines. IOI operatives, called Sixers because of their six-digit avatar name, always beginning with \"6\", attempt to assassinate Wade and Art3mis's avatars at the birthday party of OASIS co-founder Ogden Morrow. They are stopped by Morrow, who has special privileges and powers within the OASIS. Art3mis abandons Wade due to the competition being more personal for her. Five months pass. Neither Wade nor anyone else has found the next token, the Jade Key.\nWhen Art3mis finally finds the Jade Key, Parzival scrambles to planet Archaide, where he plays a perfect game of Pac-Man, receiving only a quarter as a prize. Aech, who was the second player to find the Jade Key, provides a hint leading him to the planet Frobozz where he solves a recreation of the text adventure game Zork and whistles a 2600-hertz-sound through a Cap'n Crunch Bo'Sun Whistle . Sorrento, who had tracked Art3mis and Aech using a premium locator artifact, establishes a base there to farm Jade Keys for their company's avatars, unlocks the second Gate, and rapidly acquires the Crystal Key as well. Shoto tells Parzival that the Sixers infiltrated Daito's real-life apartment and threw him out off his balcony, killing him and passing it off as a Japanese suicide.\nParzival unlocks the Jade Gate, a Voight-Kampff machine by entering a privately-owned Blade Runner-themed building, and completes the arcade game Black Tiger as a character from the first-person shooter perspective, being given a virtual mecha as the prize and another clue: a red star in a circle. Using his knowledge of Rush, he acquires the Crystal Key on planet Syrinx (the red star being the symbol of the Solar Federation in the song \"2112\"), and after playing \"Discovery\", the third movement of the song, finds a clue regarding the conditions to unlock the final gate. As he messages Art3mis, Aech, and Shoto with his solution, Sorrento ends their covert attempts to clear the third gate, Castle Anorak on planet Chthonia, and places a force field around it.\nWade manipulates his assumed identity in order to be arrested and placed in indentured servitude in IOI's tech support department. While inside IOI, he uses black market passwords and security exploits to hack into IOI's intranet: he acquires a wealth of information, including footage of Daito's murder. The information also includes the attempt on his own life, as well as plans to force Shoto and Art3mis to work for IOI in real life, and kill them at the end of the contest (IOI doesn't know who Aech is due to him using a pseudonym). After escaping the corporation, he shares his information with his friends and publicizes a gathering of avatars to storm the castle. They are interrupted by Ogden Morrow, who offers them a safe haven at his home in Oregon. Wade meets the real-life Aech and Ogden, but not Art3mis and Shoto, who are already hooked into Ogden's immersion pods.\nThe day of the battle, Wade uses his planted hack to bring down the barricade, and a massive fight among avatars ensues. After Parzival uses the mecha Leopardon (accompanied by Art3mis's Minerva X, Aech's Gundam, and Shoto's Raideen) to fight against Sorrento's Mechagodzilla Kiryu, though Shoto's avatar is killed and Leopardon is destroyed during the fight. Parzival then uses an ace up his sleeve: a device that could transform him into Ultraman. With this power, he utterly destroys Sorrento's mech and kills his avatar. Parzival and his friends unlock the gate, at which point the Sixers use an artifact called the Cataclyst to destroy the castle and all avatars over a large area. Parzival survives because having the Pac-Man quarter granted him an extra life. As he enters the Crystal Gate, he announces that if he wins he will share his fortune with his three friends. With Sorrento and his Sixers on his heels, Parzival plays Tempest, role-plays King Arthur and various characters in Monty Python and the Holy Grail, and retrieves the Easter egg in Adventure. His victory grants him control of the OASIS, including the ability to \"kill\" his enemies' avatars, resurrect his friends, and a Big Red Button that can shut down the OASIS forever. Sorrento is arrested for the murder of Daito and for conspiring to kill Wade and the others. Back in Oregon, Wade and Art3mis, whose actual name is Samantha, meet in person and rekindle their relationship with a kiss."}