{"_movieID": "491366", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:58:16", "summary": "The Rocky Horror Show is a musical with music, lyrics and book by Richard O'Brien. A humorous tribute to the science fiction and horror B movies of the 1930s through to the early 1960s, the musical tells the story of a newly engaged couple getting caught in a storm and coming to the home of a mad transvestite scientist, Dr Frank-N-Furter, unveiling his new creation, a sort of Frankenstein-style monster in the form of an artificially made, fully grown, physically perfect muscle man named Rocky Horror, complete \"with blond hair and a tan\".\nThe show was produced and directed by Jim Sharman.  The original London production of the musical premiered at the Royal Court Theatre (Upstairs) on 19 June 1973 (after two previews on 16 and 18 June 1973).  It later moved to several other locations in London and closed on 13 September 1980.  The show ran for a total of 2,960 performances and won the 1973 Evening Standard Theatre Award for Best Musical. Its 1974 debut in the US in Los Angeles had a successful nine-month run, but its 1975 Broadway debut at the Belasco Theatre lasted only three previews and forty-five showings, despite earning one Tony nomination and three Drama Desk nominations. Various international productions have since spanned across six continents as well as West End and Broadway revivals and eight UK tours. Actor Tim Curry, who originated the role of Dr. Frank-N-Furter in the original London production, became particularly associated with the musical.\nThe musical was adapted into the 1975 film The Rocky Horror Picture Show, starring O'Brien as Riff Raff, with Curry also reprising his role; the film has the longest-running release in film history. In 2016, it was adapted into the television film The Rocky Horror Picture Show: Let's Do the Time Warp Again. The musical was ranked eighth in a BBC Radio 2 listener poll of the \"Nation's Number One Essential Musicals\". The Rocky Horror Show was one of eight UK musicals featured on Royal Mail stamps, issued in February 2011.Beyond its cult status, The Rocky Horror Show is also widely hailed to have been an influence on the countercultural and sexual liberation movements that followed on from the 1960s. It was one of the first musicals to depict fluid-sexuality during a time of division between generations and an old-world lack of sexual difference acceptance. At the time of its release, it pushed boundaries and has become a cultural icon which promotes empowerment of self-creation and all sexual orientations. Since the 1970s, societal evolution of sexuality and gender have created cultural and legal change, coming closer to realizing the musical's futuristic vision of an accepting sexual revolution."}