{"_movieID": "419831", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:55", "summary": "I Kill Giants is a 2017 fantasy drama film directed by Anders Walter with a screenplay by Joe Kelly, based on Kelly and Ken Niimura's graphic novel of the same name. The film stars Madison Wolfe, Imogen Poots, Sydney Wade, Rory Jackson and Zoe Saldana.", "plot": "Barbara Thorson is a young, independent teenager who lives with her brother and supportive older sister, Karen. Barbara has created a fantasy world inspired by her love of Dungeons & Dragons and the career of former Phillies pitcher, Harry Coveleski. Believing that giants from other worlds are coming to attack her hometown, she spends her days creating weapons and traps to fend off the creatures.\nOne day, Barbara meets Sophia, who just moved to the area from Leeds, England. Sophia expresses an interest in getting to know Barbara, but Barbara initially remains aloof. \nA confrontation between Barbara and a group of bullies led by Taylor is interrupted by Barbara being called by the school psychologist, Mrs. Mollé. Barbara leaves the ensuing meeting abruptly, declaring that their talk would just distract her from her preparations to battle a giant. Later, Barbara explains the mythology behind the giants to Sophia. She shows Sophia the baits and traps she created to lure and trap giants, and tells her about the magical warhammer, Coveleski, which she keeps in her handbag. She also tells Sophia about Harbingers, ghostly creatures that warn her when there is a nearby giant. \nAfter Barbara is given detention by the principal for insulting a teacher, she takes Sophia with her on her hunt for a giant. Sophia begins to doubt Barbara's claims about the giants.\nWhen Mrs. Mollé learns about Barbara's interest in baseball, she asks about it, causing Barbara to become lost in bad memories and to run home. In a daze, she is startled by Sophia and strikes her, causing Taylor and her friends -who witnessed it- to laugh. Though Barbara tries to apologize, Sophia runs off, upset. Later, Sophia is approached by Taylor who promises to tell her a secret about Barbara if Sophia will show them some of the \"freaky things\" Barbara does. Sophia agrees, leading Taylor and friends to the sanctuary, where they proceed to dismantle many of Barbara's traps. Barbara interrupts and draws Coveleski, which turns out to be a small animal's jawbone tied to a stick. Barbara is shocked at the state of her weapon, and is beaten by Taylor and her friends. \nSophia takes Barbara to her home to recover. When Barbara wakes, she becomes very upset at being brought upstairs, and tells Sophia to slowly move away, before \"it\" sees her. Sophia looks into one of the bedrooms and drops a glass of water in shock before fleeing the house. Barbara visits Mrs. Mollé at her house looking for help, but grows uncomfortable upon being introduced to her family. \nAfter Barbara fails to go to school for several days, Sophia and Mrs. Mollé visit Barbara's house. In the basement, Sophia discovers a recording of Barbara and her mother telling the story of Coveleski's \"Giant Killer\" nickname. Sophia leaves and finds Barbara, telling her that all of the giants are in her head, and asks Barbara why she never told Sophia about her mother, though Barbara shuts out the question and is unable to hear it. Barbara angrily storms off. She is visited by Harbingers who taunt her, telling her that she is too weak to defeat a giant. \nBarbara heads to face the giant at an abandoned train yard. She hides in the trains, but is hunted by the giant. She eventually activates a train control station rigged to nearby electrical poles, which electrocutes it and sets fire to some of the train cars. Sophia arrives just as Barbara is leaving.\nThe next day, Barbara humiliates Taylor by placing a skeleton in her locker. This worries Mrs. Mollé and Karen who proceed to look for Barbara. Barbara heads to her sanctuary upon discovering that she still can't use Coveleski, where she prays for the return of her weapon. \nAs an unexpected storm bears down on the town, Mrs. Mollé confronts Barbara on her way to the sanctuary, telling her that Barbara's mother is desperate to see her. Barbara ignores her. Upon arriving, she witnesses a scene of destruction. Sophia explains that Taylor wrecked the area as revenge for what Barbara did and that she tried to stop her. Suddenly, a giant appears out of the water. Barbara stands against it, and draws forth the restored Coveleski from her handbag, revealing a massive, glowing war hammer. She proceeds to defeat the giant with it, fueled by her wrath that it came for her mother. Lying injured upon the beach, the giant reveals that he came for Barbara, not her mother. Barbara is stunned, and demands that the titan \"finish it\". The giant snatches her up, and draws her close to its head, so she can strike it down with Coveleski. As the giant falls back into the ocean, it brings Barbara with it. Sinking below the waves, she hears the voice of the giant telling her that every living thing must die. It says to run from death is to reject life, and that she must find joy in every moment while she can. Barbara swims back to the beach, where she reunites with Sophia.\nThe next day, Barbara climbs upstairs to see her mother, who lies dying in her bed. They share heartfelt messages and Barbara apologizes for avoiding her. After the summer break, Barbara's mother dies, but Barbara rekindles her relationships with Mrs. Mollé, Karen and Sophia. On the first night of school, she is awoken by the giant, who stands in the ocean, watching her. She says thank you and goes back to sleep.", "cast": "Madison Wolfe as Barbara Thorson\nImogen Poots as Karen Thorson\nSydney Wade as Sophia\nRory Jackson as Taylor\nArt Parkinson as Dave\nZoe Saldana as Mrs. Mollé\nNoel Clarke as Mr. Mollé\nJennifer Ehle as Mrs. Thorson\nCiara O'Callaghan as Theresa Tuzzo\nJohn Boyle as Titan"}