{"_movieID": "20178", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:43", "summary": "World's Greatest Dad is a 2009 American satirical black comedy-drama film written and directed by Bobcat Goldthwait and starring Robin Williams, Daryl Sabara, and Alexie Gilmore. The film was released on July 24, 2009 on video on demand providers before its limited theatrical release on August 21, 2009.\n\n", "plot": "Lance Clayton (Robin Williams)  is a single father and high school English teacher whose biggest fear is that he will one day end up all alone. He dreams of becoming a famous writer, but his previous novels have all been rejected by publishers. His 15-year-old son Kyle (Daryl Sabara) is a pornography-obsessed underachiever who despises and is annoyed by everyone, especially his father. Kyle is a student at the school where Lance teaches an unpopular poetry class. His only friend is Andrew, a fellow student who spends his evenings at the Claytons' house trying to avoid his alcoholic mother. Kyle's consistently poor academic performance and vile behavior gain the attention of the school principal (Geoff Pierson), who advises Lance that Kyle should transfer to a special-needs school. Lance is in a non-committal relationship with a younger teacher named Claire (Alexie Gilmore), who is spending time with a fellow teacher named Mike (Henry Simmons), whose writing class is more successful than Lance's. On nights when Claire cancels their dates and he is alone, Lance bonds with his elderly neighbor Bonnie (Mitzi McCall).\nOne night, after Kyle and Lance spend an evening with Claire, Lance discovers that Kyle has died in an autoerotic asphyxiation accident in his bedroom. To avoid embarrassing his son, he stages Kyle's death as a suicide. He writes a suicide note on Kyle's computer and hangs his son's body in the closet. A classmate later obtains the suicide note from police records and publishes it in the school newspaper. The note strikes a chord with the students and faculty, and suddenly many students claim to have been friends with Kyle and are touched by how deep and intelligent he shows himself to be in his writings.\nEnjoying the attention his writing is finally receiving, Lance decides to write and publish a phony journal that was supposedly written by his son before his death. Kyle becomes something of a postmortem cult phenomenon at the school, and soon Lance begins to receive the adoration that he has always desired. Andrew finds Kyle's suicide note and journals as highly uncharacteristic based on Kyle's personality when he was alive, but Lance brushes him off when Andrew confronts him. The journal soon attracts the attention of book publishers and Lance lands a television appearance on a nationally broadcast talk show. The school principal then decides to rename the school library in Kyle's honor.\nAt the library dedication, Lance starts to feel guilty for exploiting his son's death for his own benefit as well as hatred towards those who pretend to like Kyle when in reality they didn't. While giving a speech, Lance decides he can no longer continue the charade and confesses to everyone that Kyle's death was accidental, and that he wrote the suicide note and journal. Predictably, Lance is denounced by the students and faculty, including Claire; and at the same time finally realizes that it is better to be alone than to end up with people who make you feel all alone. Despite now being despised by everyone, Lance nevertheless feels reborn and dives naked into the school's swimming pool. Outside, Andrew tells Lance that he knew the truth all along, and that he enjoyed Lance's writing and encourages him to keep writing which Lance says he will. The film ends as the two happily watch a zombie movie with Bonnie.", "cast": "Robin Williams as Lance Clayton\nAlexie Gilmore as Claire Reed\nDaryl Sabara as Kyle Clayton\nEvan Martin as Andrew Troutman\nGeoff Pierson as Principal Wyatt Anderson\nHenry Simmons as Mike Lane\nMitzi McCall as Bonnie Troutman\nJermaine Williams as Jason\nLorraine Nicholson as Heather Johnson\nMorgan Murphy as Morgan\nToby Huss as Bert Green\nTom Kenny as Jerry Klein\nJill Talley as Make-Up Woman\nBruce Hornsby as himself\nKrist Novoselic as Newspaper Vendor (cameo)\nBobcat Goldthwait as Limo Driver (uncredited)"}