{"_movieID": "19994", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:23", "summary": "Jennifer's Body is a 2009 American supernatural horror dark comedy film written by Diablo Cody and directed by Karyn Kusama. The film stars Megan Fox, Amanda Seyfried, Johnny Simmons, and Adam Brody. Fox portrays a demonically possessed high school girl who kills her male classmates, with her best friend striving to stop her. The film premiered at the 2009 Toronto International Film Festival and was released in the United States and Canada on September 18, 2009. The title is a reference to the song of the same name by alternative rock band Hole on their album Live Through This. As a tie-in to the film, Boom! Studios produced a Jennifer's Body graphic novel, released in August 2009.\nWorking with Cody again following their collaborative efforts on the film Juno, Jason Reitman stated he and his producers \"want to make unusual films\". Cody said she wanted the film to speak to female empowerment and explore the complex relationships between best friends.The film had a lackluster performance at the North American box office, making $2.8 million its opening day and $6.8 million its opening weekend, and received mixed reviews from critics. Negative reviews criticized the narrative and, specifically, the horror/comic premise for \"fail[ing] to be either funny or scary enough to satisfy,\" while positive reviews praised the film for its dialogue, emotional resonance, and the performances of Megan Fox and the supporting cast. Since 2018, in the wake of the MeToo movement, the film has been appreciated as a feminist horror film and as a cult film.", "plot": "Anita \"Needy\" Lesnicki, once an insecure and studious teenager living near Devil's Kettle, Minnesota, is now a violent mental inmate who narrates the story as a flashback while in solitary confinement. Since childhood, she had been friends with Jennifer Check, a popular cheerleader, despite having little in common. One night, Jennifer takes Needy to a local dive bar to attend a concert by indie rock band Low Shoulder. A suspicious fire engulfs the bar, killing several people. In shock, Jennifer agrees to leave with the band, despite Needy's protests. Later that evening, Jennifer, covered in blood, appears in Needy's kitchen and attempts to eat food from the refrigerator. She immediately vomits a trail of black, spiny fluid and leaves in a hurry.\nThe next morning at school, Jennifer appears fine and dismisses Needy's concerns. While the town is devastated by the deaths caused by the fire, Jennifer seduces the school's football captain in the woods and disembowels him. Meanwhile, the members of Low Shoulder gain popularity due to their falsely-rumored heroism (confirmed by \"the Wikipedia\") during the fire and offer to make a charity appearance at the school's spring formal.\nA month later, Jennifer has become pale. She accepts a date with school goth/emo Colin, whom she brutally kills. While Needy and her boyfriend Chip have sex, Needy senses something dreadful has happened. She leaves in a panic and almost runs over Jennifer, who is drenched in blood. At home, she again encounters Jennifer, who explains that Low Shoulder had taken her into the woods after the bar fire and offered her as a virgin sacrifice to Satan in exchange for fame and fortune. Although the sacrifice and demonic exchange were a success, Jennifer was not actually a virgin, so she became permanently possessed. Leaving the woods, Jennifer had encountered an exchange student leaving the scene of the fire and made him her first victim. Jennifer states that when she has eaten, she can withstand virtually any injury without pain, healing instantly.\nThe following day, Needy goes to the school library's occult section and determines that Jennifer is a succubus who must feed on flesh and can only be killed while she is hungry and weak. Needy tells Chip about her discoveries about Jennifer and warns him not to attend the school dance. He does not believe her, so she breaks up with him in order to protect him. Chip decides to attend the dance anyway but is intercepted by Jennifer, who takes him to an abandoned pool house and begins feeding on him. Needy arrives there and fights Jennifer. Chip impales Jennifer through the stomach with a pool skimmer, but Jennifer removes it and escapes, while Chip dies.\nNeedy goes to Jennifer's home and breaks into her bedroom. She fights Jennifer and stabs her in the heart with a utility knife, killing her and destroying the demon. Jennifer's mother enters and finds Needy on top of her daughter's body. Soon after, Needy is brought to an asylum. In her asylum room, she manifests some of Jennifer's supernatural powers, such as super strength and the ability to levitate, due to a non-fatal bite from Jennifer during the fight between them. She escapes the mental facility, hitchhikes a ride to the hotel where Low Shoulder are staying, and murders them.", "cast": "Megan Fox as Jennifer Check:Fox was in negotiations to star as Jennifer Check since 2007, and was officially cast in October 2007. Fox said the reason she agreed to the role was her love for the script. \"I think what I loved about the movie is it's so unapologetic and how completely inappropriate it is at all times,\" she said. \"That was my favorite part about the script and about the character. It's fun to be able to say the shit that she got to say and get away with it and how people find it charming.\" Asked how acting in a film like this is different from acting in Transformers, Fox said \"there's [no] distractions, like there's no robots to distract you from whatever performance I do give. So, if it's terrible, you're gonna fucking know that it's really terrible\". She said despite this aspect of the business being intimidating, she enjoyed portraying the character. \"I wasn't really sure what I was doing,\" said Fox. \"I was just trying to have fun with it and I felt like I was able to make fun of my own image as to how some people might perceive Megan Fox to be. I was just sort of flying freely and I hope some of it works.\" To prepare for her role as a living-dead teenager, Fox dropped to a near-frail 97 pounds and stayed out of the sun to keep her skin pale. In balancing out the film's horror with humor, she said she relied heavily on Diablo Cody's script and Karyn Kusama's direction to pull it off, stating, \"I have a very specific sense of humor, things that I think are funny aren't going to fly with middle America. It's going to eliminate some of the audience, so you need someone there to tell you you can't do that.\"Amanda Seyfried as Anita \"Needy\" Lesnicki:In February 2008, Seyfried was cast as Anita \"Needy\" Lesnicki, the \"plain Jane\" best friend to Fox's character with whom she shares a somewhat lesbian infatuation. Seyfried said it was a relief to play the nerdy character opposite Fox. \"Being a lead (like Megan), you have that weird pressure of feeling like you have to look attractive,\" she stated. \"In this movie, I didn't worry about any of that [shit]. I eventually was very depressed that I couldn't get the role though, cause Megan is all hot but I am not.\"Johnny Simmons as Chip Dove\nJ. K. Simmons as Mr. Wroblewski\nAmy Sedaris as Toni Lesnicki\nAdam Brody as Nikolai Wolf:Chud.com reported that the filmmakers were looking at actual rock band members Pete Wentz of Fall Out Boy and Joel Madden of Good Charlotte to portray male lead Nikolai Wolf. Chad Michael Murray was also considered for the role. In March 2008, Johnny Simmons was reportedly cast as Nikolai. However, Brody was officially cast in the role of Nikolai, while Simmons was then given the role of Chip Dove. Brody said he did not do his own vocals, adding, \"My singing voice is still going through puberty. They gave me a singing lesson or two, and it's not the worst thing in the world, but it's not anything anyone would choose to hear.\" His vocals were provided by Ryan Levine, who also played another member of the band.Kyle Gallner as Colin Gray\nCynthia Stevenson as Mrs. Dove\nChris Pratt as Officer Roman Duda\nCarrie Genzel as Mrs. Check\nJuan Riedinger as Dirk\nJuno Ruddell as Officer Warzak\nValerie Tian as Chasity\nAman Johal as Ahmet from India\nJosh Emerson as Jonas Kozelle\nLance Henriksen as the driver near the end of film"}