{"_movieID": "169917", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:37", "summary": "A Walk Among the Tombstones is a 2014 American neo-noir action thriller film written and directed by Scott Frank, and based on the  1992 novel of the same name by Lawrence Block. It stars Liam Neeson, Dan Stevens, David Harbour, Brian Bradley, and Boyd Holbrook. The film was released on September 19, 2014. Critical reception was mixed and the film grossed $62 million worldwide.", "plot": "In 1991, Detective Matthew \"Matt\" Scudder (Liam Neeson) is in a car with his partner, who urges him to get help and expresses his concern that Scudder is not a reliable backup. Scudder then enters a bar and buys drinks with a coffee. Two armed men come in and kill the bartender, and Matt fatally shoots one assailant. He pursues and kills the second assailant, as well as their getaway driver.\nEight years later, a drug addict named Peter Kristo (Boyd Holbrook) approaches Matt, now retired, and asks him to help his brother Kenny Kristo (Dan Stevens). Kenny is a drug trafficker whose wife was kidnapped and murdered. Kenny tells Matt that after he delivered the ransom, the kidnappers directed him to a car containing his wife's dismembered body. Matt ultimately agrees to find the kidnappers.\nAt the library, Matt researches similar killings, and finds victims named Marie Gotteskind and Leila Anderssen. He meets a homeless youth named TJ (Brian \"Astro\" Bradley), a sickle cell anemic kid who helps with his search. \nBased on an article, Matt goes to a cemetery and speaks with the groundskeeper, Jonas Loogan (Olafur Darri Olafsson), who is upset that Matt forces him to remember finding bags containing parts of the dismembered Leila in the cemetery pond.\nMatt talks to Leila's fiancé Reuben (Mark Consuelos), who claims to have witnessed two men drag her into a van driven by a third person. Out the window, Matt sees Jonas exiting an apartment building. In a tool shed belonging to Jonas on the building's roof, Matt finds photos of Reuben and Leila having sex. \nJonas admits that he helped kidnap Leila. He had conspired to take Leila away from Reuben, who is a drug dealer, and help her stop using drugs. Instead, however, the other two men tortured and killed Leila. Jonas gives Matt one name, Ray, and jumps off the roof to his death.\nThe two kidnappers, Ray (David Harbour) and Albert (Adam David Thompson), scout the home of Yuri Landau (Sebastian Roché), another drug trafficker. After realizing Landau's wife is bedridden, they prepare to leave for a new target. However, they see his 14-year-old daughter Lucia (Danielle Rose Russell), and Ray decides to kidnap her.\nMatt eventually learns that Marie was a DEA agent and realizes that the people who murdered her also got her files, which they have been using to choose their victims. Meanwhile, Matt grows closer to TJ, and encourages the boy to study to avoid a life of crime. During a conversation with TJ, Matt explains why he retired. During the shootout from the opening scene, one of his stray bullets \"took a bad hop\" and killed a 7-year-old girl. He has been sober ever since.\nKenny brings Matt to Landau's home, where the kidnappers call and arrange a drop. Matt, Kenny, Landau, Peter, and TJ (who earlier brought Matt his old gun) go to the cemetery. After a stand off, Lucia, with a finger hurt down to the bone, is returned to her father. When Albert realizes the ransom money is counterfeit, a shootout ensues. Peter is killed, and Matt wounds Ray. Albert and Ray escape in their van, but with TJ sneaked in the back.\nAfter Albert and Ray arrive at their place, TJ sneaks out of their van, calls Matt, and tells him the address. Albert garrottes the wounded Ray in the basement, and goes back upstairs to find Matt, Kenny, and TJ. Matt overpowers and cuffs Albert. He leaves Albert for Kenny to decide what to do with the former, and calls a cab for TJ. While Kenny goes down in the basement, Albert frees himself. Matt goes back inside the house and finds Kenny's corpse. Albert attacks Matt, and after a brief fight, Matt kills him.\nMatt returns home to find TJ sleeping on the couch and spots a drawing that TJ made of himself as a superhero (a sickle is visible on the hero's chest, a callback to TJ's sickle cell anemia). He sits down and falls asleep."}