{"_movieID": "137094", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:13", "summary": "Jack Ryan: Shadow Recruit is a 2014 American action thriller spy film directed by Kenneth Branagh. Chris Pine, Kevin Costner, Branagh, and Keira Knightley star in leading roles. The film features the fictional character Jack Ryan created by author Tom Clancy. It is the fifth film in the Jack Ryan series but is presented as a reboot that departs from the previous installments. Unlike its predecessors, it is not an adaptation of a particular Clancy novel, but rather an original story. Pine stars in the title role, becoming the fourth actor to play Ryan, following Alec Baldwin, Harrison Ford, and Ben Affleck.\nThe original screenplay was written by Adam Cozand and David Koepp. The film was produced by Mace Neufeld, Lorenzo di Bonaventura, David Barron and Mark Vahradian, with David Ellison, Dana Goldberg, Paul Schwake and Tommy Harper as executive producers.\nThe film score was composed by Patrick Doyle. The film was released on January 17, 2014, and grossed over $130 million in revenue at the box office. Jack Ryan: Shadow Recruit was met with mixed critical reviews. The film is dedicated to Clancy, who died on October 1, 2013.", "plot": "After the 9/11 attacks, Jack Ryan (Pine), studying at the LSE (London School of Economics), becomes a U.S. Marine second lieutenant fighting in Afghanistan, where his spine is severely injured when his helicopter is shot down. During a lengthy recovery back in the United States, he attracts the attention of Cathy Muller (Knightley), a medical student helping him learn to walk again, and Thomas Harper (Costner), a CIA official who recruits him.\nTen years later, Ryan is working on Wall Street covertly for the CIA looking for suspicious financial transactions that would indicate terrorist activity. When the Russian Federation loses a key vote before the United Nations and the markets do not respond in the expected way, Ryan discovers that billions of dollars held by Russian organizations have disappeared. The majority of these funds are controlled by Russian tycoon Viktor Cherevin (Branagh).\nRyan's employer conducts business with Cherevin, so when Ryan finds certain accounts inaccessible to him as an auditor, he has reason to visit Moscow and investigate. After narrowly surviving a murder attempt by an assassin (Anozie) posing as his bodyguard, Ryan sends an SOS and is surprised to learn his backup is Harper. During their debrief at Staraya Square, Ryan explains how Cherevin's shadow investments could make the United States vulnerable to complete financial collapse following a staged terrorist attack, which would also weaken global markets.\nAt his meeting with Cherevin the next day, he is told that the problem company and all of its assets have been sold, thus preventing Ryan's audit. Meanwhile, Muller, now Ryan's fiancée, suspecting him of having an affair, secretly flies to Moscow to meet him. Against protocol for unmarried couples, Ryan reveals his CIA employment, to her great relief. Improvising on the situation, Harper has Muller agree to be included in a plan to infiltrate Cherevin's offices. Ryan and Muller meet Cherevin at an upscale restaurant across the street from Cherevin's office. Over dinner, Ryan causes a scene and purposely insults Muller. Excusing himself, he gains access to Cherevin's office where he downloads critical corruption files.\nRyan and the CIA discover Cherevin has secretly propped up the Chinese and Japanese economies for years, leaving the entire global economy vulnerable, as well as using a falsified death certificate to place his son, Aleksandr (Utgoff), in the US as a sleeper agent. Ryan uses his talent for pattern recognition to locate Aleksandr's hideout and intended target, Wall Street. Returning to New York City, he locates and pursues a fake police response vehicle driven by Aleksandr. After Ryan catches up and engages in a physical confrontation with Aleksandr, he discovers a bomb in the rear of the vehicle. Unable to defuse it, he hijacks the vehicle and crashes it into the East River while jumping out, as the bomb detonates, killing Aleksandr. Cherevin is executed by his co-conspirators in Russia. Ryan and Harper are called to the White House to brief the President."}