{"_movieID": "301355", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:57:24", "summary": "Message from the King is a 2016 revenge-action-thriller film directed by Fabrice Du Welz, and written by Stephen Cornwell and Oliver Butcher. It stars Chadwick Boseman, Luke Evans, Teresa Palmer, and Alfred Molina. The film's plot revolves around a man from Cape Town,  South Africa who travels to Los Angeles in order to find his younger sister and then to avenge her death.\nThe film premiered at the 2016 Toronto International Film Festival on September 8, 2016. Netflix released the film on August 4, 2017.\n\n", "plot": "Jacob King, who lives in Cape Town receives a message from his estranged sister Bianca, who lives in Los Angeles with her husband and stepson, that she is in trouble and has something \"they\" want. King flies to Los Angeles with a return ticket dated seven days later, intent on finding his sister and booking cheap lodging. Upon arriving at his sister's address, he meets a neighbor who held some of Bianca's belongings, given to her shortly before Bianca disappeared. The neighbor also informs King that his sister's husband had disappeared earlier, leaving his son with Bianca. \nJacob finds Bianca's landlady, who says that a local business owner, Zico, suddenly paid Bianca's rent before she left, and that Bianca had been strung out and beat up before departing. King finds Zico with a group of men, and they deny any knowledge of Bianca. A local shopkeeper tips King to look for his sister in the morgue, and King finds her corpse there, tortured and mutilated.\nAmong Bianca's belongings, King finds several photographs of her with various men, including the gang member who had paid her rent but denied knowing her, a dentist's business card, and a pack of cigarettes. King confronts Zico and mutilates his face, telling him to relate to his superior, Duke, that this is \"a message from the King\", and then steals Zico's phone. At a party held by Bianca's neighbor Trish, King learns that Alex had been associated with the gang and a drug dealer, named Frankie. He lures Bianca's dealer Frankie to the party and beats him for information, then steals his phone. \nBack at the motel, King accidentally interrupts a prostitute. The prostitute, glad he did not call the police, allows King to \"rent\" her car.\nKing goes to the dentist under the guise of a referral from his sister and he meets the connected Dr. Wentworth, who says that Bianca was being pimped out to pay her husband's debts and that she often disappeared. After the meeting, it is revealed that she was involved with a politician running for office, Frank Leary, who gives Wentworth the contact details for two hitmen to make the problem disappear. \nKing follows Wentworth to the home of a wealthy Hollywood producer, Mike Preston, whom Wentworth shakes down for $100,000 to cover the cost of the hitmen, and another $750,000 of blackmail money due to his involvement with Bianca's death.  At the house, King notices his sister's stepson, Armand, living at the mansion. Wentworth notices King's car when leaving Preston's house and calls the hitmen.\nLater that day, the hitmen, two LAPD officers, arrest King. King, realizing he is going to be killed, manages to escape, taking a beating in the process. His motel neighbor, Kelly, who is the prostitute who had lent King her car, finds him near the motel and nurses him back to health in her room. \nThe gang realizes that Kelly's car was not stolen. King recovers from his beating and creates a bomb out of materials from a hardware store, then finds an encrypted SD card in Bianca's belongings, hidden in a pack of cigarettes. Realizing this is what her killers wanted, he is only able to listen to snippets of audio but understands that Preston is the target. He sneaks into Preston's home and forces him to decrypt the file, which reveals camera footage of Preston committing acts of pedophilia on Armand during a party.\nPreston reveals that Bianca's husband had fallen into serious debts, and the debtors forced Bianca on drugs and pimped her out, to pay them back. They killed her husband but continued to pimp her out, so she sold her stepson to Preston for money. When she realized that he was raping Armand, she stole the footage and called King for help. \nPreston asked Wentworth to fix the issue, and Wentworth hired the gang members to kill Bianca. King lures Duke, his gang members, and Wentworth to Preston's mansion, kills Preston, and then plants a bomb in a packet of money. Duke and Wentworth open the packet, and both are killed. King takes Armand back to Kelly's motel, intent on rescuing the boy, but the sole surviving member of the gang—the one King maimed a few days earlier—ambushes him in the room. The boy escapes before King is able to win. King gives chase to Armand but ultimately gives up.\nKing drops Kelly and her daughter on the bus to her home town in New Mexico. He hands her a bag which has money he took from Preston's mansion earlier. As he is walking Leary's posters can be seen on the walls of the city of Los Angeles. King returns to South Africa where he is welcomed back and is revealed to be a detective with the local police force.", "cast": "Chadwick Boseman as Jacob King\nLuke Evans as Dr. Paul Wentworth\nTeresa Palmer as Kelly\nNatalie Martinez as Trish\nAlfred Molina as Mike Preston\nTom Felton as Frankie\nDale Dickey as Mrs. Lazlo\nJake Weary as Bill\nDrew Powell as Merrick\nChris Mulkey as Frank Leary\nTom Wright as Waylon\nSibongile Mlambo as Bianca King\nAnna Diop as Becca\nAva Kolker as Boot\nRoman Mitichyan as Vrioni\nLucan Melkonian as Zico\nJames Jordan as Scott\nArthur Darbinyan as Duke\nDiego Josef as Armand\nJonno Roberts as Rice\nWade Williams as Keegan"}