{"_movieID": "155776", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:19", "summary": "\"Heroes and Demons\" is the 12th episode of the first season of the American science fiction television series Star Trek: Voyager. The episode first aired on the UPN network on April 24, 1995. It was directed by Les Landau and written by former Star Trek: The Next Generation story editor Naren Shankar. Set in the 24th century, the series follows the adventures of the Starfleet and Maquis crew of the starship USS Voyager after they were stranded in the Delta Quadrant far from the rest of the Federation. In this episode, after a sample of a protostar is brought on board, crewmen start to vanish from a holodeck simulation of Beowulf. The Doctor (Robert Picardo), a hologram, investigates and finds that a lifeform was transported to the ship alongside the sample. It escaped to the holodeck where it was converting those who entered into energy. The Doctor has the samples brought to the holodeck and released, resulting in the lifeform returning the crewmen to their corporeal states.\nWith this episode, Shankar sought to move the Doctor out of sickbay, and while he was looking generally to involve Vikings on the holodeck, it wasn't until later that he realized he had inadvertently followed the story of the Beowulf poem, and so changed the script to include direct references. Composer Dennis McCarthy sought to increase the tempo of the music used in this episode, and included an unused piece written for The Next Generation episode \"Qpid\"; he was nominated for Outstanding Music Composition at the Emmy Awards for his work on \"Heroes and Demons\". A further nomination at those awards was received by Marvin V. Rush for Individual Achievement in Cinematography for a Series. Picardo's performance was praised by the crew, and the episode was received positively by critics, who compared elements to The Lord of the Rings and computer based roleplaying games. It received Nielsen ratings of 6.4/11 percent.", "plot": "The crew encounters a protostar and Captain Kathryn Janeway (Kate Mulgrew) decides to have samples beamed aboard for use as a potential power source. A problem occurs when beaming the samples to Voyager. Janeway recommends to B'Elanna Torres (Roxann Dawson) that she should have Ensign Harry Kim's (Garrett Wang) assistance, but he is discovered to be missing. The crew finds his holodeck program, based on the epic poem Beowulf, still running. With each person sent into the holodeck also becoming lost, Captain Janeway sends in the Doctor (Robert Picardo) to investigate, under the assumption that as an immaterial hologram, he cannot be dematerialized in the way the missing crew had been. The Doctor shows signs of nervousness when preparing for his first \"away\" mission, so Kes (Jennifer Lien) encourages him to take a name to embolden him with having an identity of his own. He states that he has narrowed his choices to three but does not reveal them.\nOnce in the holodeck, the Doctor meets Freya (Marjorie Monaghan), a shieldmaiden, and introduces himself as \"Schweitzer\". She takes him to the hall, where he is made to prove himself before the others, and after a celebratory meal and everyone has retired to separate rooms, she reappears and suggests that, in the cold of the night when the fire in his hearth has gone out, he ought to join her. Though he dismisses her advances, he relaxes his inhibition in later scenes. Later they are confronted by Unferth (Christopher Neame), who kills Freya. She dies in Schweitzer's arms. With her last words she speaks his name.\nAs the Doctor investigates, he realizes that alien energy lifeforms were beamed onto the ship within the containment field into which the protostar samples were transported. The missing crew members have been converted to energy by the lifeforms from the protostar, presumably as hostages in retaliation for Voyager's actions. The Doctor releases the energy lifeforms on the holodeck; in kind, the missing crew are returned to their original forms. Afterwards, upon reflection, the Doctor decides not to keep the name Schweitzer, as his memories associated with it are too painful."}