{"_movieID": "109424", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:05:15", "summary": "Captain Phillips is a 2013 American biographical drama-thriller film directed by Paul Greengrass and starring Tom Hanks and Barkhad Abdi. The film is inspired by the true story of the 2009 Maersk Alabama hijacking, an incident during which merchant mariner Captain Richard Phillips was taken hostage by pirates in the Guardafui Channel led by Abduwali Muse.\nThe screenplay by Billy Ray is based on the 2010 book A Captain's Duty: Somali Pirates, Navy SEALs, and Dangerous Days at Sea by Richard Phillips with Stephan Talty. Scott Rudin, Dana Brunetti and Michael De Luca served as producers on the project. It premiered at the 2013 New York Film Festival, and was theatrically released on October 11, 2013. The film emerged as a box office success grossing over $218 million against a budget of $55 million. In 2014, Captain Phillips received six Academy Award nominations, including Best Picture, Best Adapted Screenplay and Best Supporting Actor for Abdi.", "plot": "Richard Phillips takes command of MV Maersk Alabama, an unarmed container ship from the Port of Salalah in Oman, with orders to sail through the Guardafui Channel to Mombasa, Kenya. Wary of pirate activity off the coast of the Horn of Africa, he and First Officer Shane Murphy order strict security precautions on the vessel and carry out practice drills. During a drill, the vessel is chased by Somali pirates in two skiffs, and Phillips calls for help. Knowing that the pirates are listening to radio traffic, he pretends to call a warship, requesting immediate air support. One skiff turns around in response, and the other – manned by four heavily armed pirates led by Abduwali Muse – loses engine power trying to steer through Maersk Alabama's wake.\nThe next day, Muse's skiff, now fitted with two outboard engines, returns with the same four pirates aboard. Despite the best efforts of Phillips and his crew, the pirates secure their ladder to the Maersk Alabama. As they board, Phillips tells the crew to hide in the engine room and allows himself to be captured. He offers Muse the $30,000 in the ship's safe, but Muse's  orders are to ransom the ship and crew in exchange for millions of dollars of insurance money from the shipping company. While they search the ship, Murphy sees that the youngest pirate Bilal does not have sandals and tells the crew to line the engine room hallway with broken glass. Chief Engineer Mike Perry cuts power to the ship, plunging the lower decks into darkness. Bilal cuts his feet when they reach the engine room, and Muse continues to search alone. The crew members ambush Muse, holding him at knifepoint, and arrange to release him and the other pirates into a lifeboat. However, Muse's right-hand man Nour Najee refuses to board the lifeboat with Muse unless Phillips goes with them. Once all are on the lifeboat, Najee attacks Phillips, forcing him into the vessel before launching the boat with all five of them on board.\nAs the lifeboat heads for Somalia, tensions flare between the pirates as they run low on the plant-based amphetamine khat and lose contact with their mother ship. Najee becomes agitated and tries to convince the others to kill Phillips. They are later intercepted by the U.S. Navy destroyer USS Bainbridge. Bainbridge's captain Frank Castellano is ordered to prevent the pirates from reaching the Somali coast by any means necessary. Even when additional ships arrive, Muse asserts that he has come too far and will not surrender. The negotiators are unable to change his mind and a DEVGRU SEAL team parachutes in to intervene, while Phillips makes an unsuccessful attempt to escape from the lifeboat before being quickly recaptured and repeatedly beaten by Najee.\nWhile three SEAL marksmen get into positions, Castellano and the SEALs continue to try to find a peaceful solution, eventually taking the lifeboat under tow. Muse agrees to board Bainbridge, where he is told that his clan elders have arrived to negotiate Phillips's ransom. In the lifeboat, Phillips prepares a goodbye letter to his wife in case he is killed, while Najee decides to take full control. Najee spots Phillips writing the letter and beats him further. Phillips retaliates by wrestling Najee until Bilal subdues Phillips by striking him in the back with his AK-47, injuring him. Najee convinces Bilal and Elmi that Phillips must be killed. The pirates tie up and blindfold Phillips, leaving him to say his final goodbyes. As the pirates prepare to shoot Phillips, Bainbridge's crew stops the tow, causing Bilal and Najee to lose balance. This gives the marksmen three clear shots and they simultaneously kill all three pirates. Muse is arrested and taken into custody for piracy. Phillips is rescued from the lifeboat and treated. Although in shock and disoriented, he thanks the rescue team for saving his life.", "cast": "Tom Hanks as Richard \"Rich\" Phillips / \"Irish\", captain of MV Maersk Alabama\nBarkhad Abdi as Abduwali Muse, pirate leader\nBarkhad Abdirahman as Adan Bilal\nFaysal Ahmed as Nour Najee\nMahat M. Ali as Walid Elmi\nCatherine Keener as Andrea Phillips\nMichael Chernus as Shane Murphy, first officer of MV Maersk Alabama\nDavid Warshofsky as Mike Perry, chief engineer, MV Maersk Alabama\nCorey Johnson as Ken Quinn, helmsman, MV Maersk Alabama\nChris Mulkey as John Cronan, senior crew member, MV Maersk Alabama\nMark Holden as William Rios, boatswain, MV Maersk Alabama\nYul Vazquez as Commander Frank Castellano, commanding officer, USS Bainbridge\nMax Martini as U.S. Navy SEAL commander\nOmar Berdouni as Nemo, Somali-language translator working for the U.S. Navy as part of Mission Essential\nMohamed Ali as Assad\nIssak Farah Samatar as HufanUncredited:\n\nHospital Corpsman Second Class Danielle Albert as Chief Hospital Corpsman O'Brien\nFire Control Technician First Class (SW) Nathan Cobler as Hospital Corpsman First Class Cobler"}