{"_movieID": "406761", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:49", "summary": "Hotel Artemis is a 2018  American dystopian thriller film written and directed by Drew Pearce, in his feature film directorial debut. It stars Jodie Foster, Sterling K. Brown, Sofia Boutella, Jeff Goldblum, Charlie Day, Brian Tyree Henry, Jenny Slate, Dave Bautista, and Zachary Quinto. The plot follows Jean Thomas, a nurse who runs a secret hospital for criminals in futuristic Los Angeles. It was released in the United States on June 8, 2018 and grossed $12 million worldwide. It received mixed reviews from critics, who praised its visual style, intriguing screenplay and acting (particularly Foster's) but found the execution poor.", "plot": "On June 21, 2028, a riot breaks out in Los Angeles over the city's water privatization. Taking advantage of the chaos, professional criminal Sherman attempts a bank robbery that leaves his brother Lev and another accomplice critically wounded. They escape to the nearby Hotel Artemis, a secretive hospital that only treats criminals, run by Jean \"the Nurse\" Thomas. Confined inside the Hotel for 22 years by her severe agoraphobia and grief over the death of her son, Thomas adheres to a strict set of rules, including \"No weapons,\" \"No non-members,\" and \"No killing of other guests.\"\nSherman and Lev are admitted while their accomplice is ejected by Thomas' assistant, Everest. Lev, given the codename \"Honolulu,\" undergoes the Hotel's technologically advanced treatment, including robot-assisted surgery and  3D printed transplant organs. Sherman encounters the Hotel's other guests: \"Acapulco,\" an obnoxious arms dealer, and \"Nice,\" an international assassin and old acquaintance. As the riot draws nearer, Thomas receives word that notorious mobster Orian \"The Wolf King\" Franklin is en route. Thomas' preparations are complicated by the arrival of a wounded police officer named Morgan, a childhood friend of Thomas' late son, begging for help. Against Everest's warnings and Thomas' own rules, they admit Morgan.\nThe Wolf King arrives, having survived an attempt on his life, and is admitted, leaving his men and son Crosby in the lobby. Everest sneaks Morgan out of the Hotel. Acapulco learns that Nice has been hired to kill the Wolf King; she incapacitates Acapulco and plants a bomb on the hotel's power generator.\nWhile administering to the Wolf King, Thomas discovers that he is responsible for her son's death; she prepares to kill him, but is diverted when Nice's bomb disrupts the power and Lev's life support. While Thomas struggles to save Lev, Nice kills the Wolf King. Lev dies and Sherman confronts Nice, but the two are attacked by Acapulco; Sherman is shot but manages to kill him.\nAs rioters storm the streets outside, Thomas, Sherman, and Nice make their way out of the Hotel, while Everest stays behind to stave off the Wolf King's men; Nice follows suit, covering Thomas and Sherman's escape. The two are met by Crosby, but kill him and make their way through the riot to Sherman's getaway car. Thomas decides to stay, but tells Sherman of another hotel, the Apache in Las Vegas, before he drives off. \nEverest, the last man standing at the Artemis, turns on the Hotel's sign as Thomas walks back through the city.\nIn a mid-credits scene, a shadowy figure runs across the screen, suggesting Nice may have survived."}