{"_movieID": "245916", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:50:15", "summary": "Kill the Messenger is a 2014 American biographical crime thriller film directed by Michael Cuesta and written by Peter Landesman. It is based on the book of the same name by Nick Schou and the book Dark Alliance by Gary Webb, which focuses on CIA involvement in Contra cocaine trafficking. The film stars Jeremy Renner in his first film as a producer. The film was released on October 10, 2014.\n\n", "plot": "The film opens as San Jose Mercury News reporter Gary Webb interviews drug dealer Ronny Quail, who is outraged that the government used civil asset forfeiture to keep his house even after he was acquitted. Webb's ensuing article about the abuses of forfeiture garners repeated phone calls from a woman named Coral, whom he agrees to meet when she says she has documents that prove the government sponsored cocaine sales in the U.S. Coral gives Webb a transcript of grand jury testimony (normally kept secret) which was accidentally released to her boyfriend, an accused drug dealer, during discovery. After Webb reveals to the prosecutor in the case that he has the transcript, the government drops the charges against Coral's boyfriend in order to protect their main witness: Oscar Danilo Blandón\nWebb researches Blandón and comes across the pending case of \"Freeway\" Rick Ross, who is stunned to learn that Blandón is a paid informant. Armed with this knowledge, Ross' attorney is able to elicit from Blandón under oath the outlines of the conspiracy: With support from the Central Intelligence Agency, Blandón and his partners smuggled cocaine into the U.S. and used the profits to benefit the Nicaraguan Contras. \nWebb travels to a prison in Managua and speaks to Blandón's partner Norwin Meneses, who confirms Oliver North's involvement in the basic \"drugs for guns\" scheme to use profits from cocaine trafficking to fund the Contras. In Washington, D.C., Webb tracks down Fred Weil, a National Security Council employee who was an investigator on the Kerry Committee report, which touched on the same issues. Like many other people that Webb speaks to, Weil warns him that the subject may put him into danger. For good measure, federal agents summon Webb to a meeting where they warn him against publishing what he has learned. \nThe paper publishes Webb's story as a three-part series with the title \"Dark Alliance\"; it is an immediate sensation. Humiliated by being scooped by a regional paper, the Los Angeles Times, Washington Post, and New York Times all dig into Webb's reporting. Webb views their follow-up reporting as being far too deferential to the CIA. Eventually, their reporting turns to Webb himself, including an affair he had while working at the Plain Dealer. \nWebb is banished to the newspaper's Cupertino bureau to cover mundane local news. However, he continues to work on the story. He is awoken in his motel room one night by John Cullen, who is precisely the kind of CIA source with direct knowledge of the scheme that Webb's reporting needs. Webb's exhilaration at finding Cullen is quickly dampened when the paper reveals its plans to write an open letter calling into question aspects of its \"Dark Alliance\" reporting. At a Society of Professional Journalists dinner honoring Webb as \"Journalist of the Year\", he submits his resignation to his editors."}