{"_movieID": "98548", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:12", "summary": "People Like Us (known during production as Welcome to People) is a 2012 American drama film directed by Alex Kurtzman in his directorial debut. The film was written by Kurtzman, Roberto Orci and Jody Lambert, and stars Chris Pine, Elizabeth Banks, Olivia Wilde, Michael Hall D'Addario and Michelle Pfeiffer. A. R. Rahman composed the soundtrack. The film was released by Touchstone Pictures on June 29, 2012.\n\n", "plot": "Sam Harper (Chris Pine), a struggling corporate trader in New York City, may have violated federal law and faces a possible Federal Trade Commission investigation. Sam's boss (Jon Favreau) urges him to bribe federal officials. Returning home, Sam's girlfriend Hannah (Olivia Wilde) informs him that his estranged father, Jerry, has died. Sam and Hannah fly to L.A. where he has a tense reunion with his mother, Lillian (Michelle Pfeiffer).\nJerry's lawyer and friend (Philip Baker Hall), tells Sam he will not inherit any money. The lawyer hands him a shaving kit containing $150,000 in cash and a note stipulating that the money be delivered to \"Josh Davis.\"\nJosh (Michael Hall D'Addario) is a troubled 11-year-old boy whose bartender mother, Frankie Davis (Elizabeth Banks), is a recovering alcoholic. Sam secretly follows Frankie to an Alcoholics Anonymous meeting. He learns she is Jerry's illegitimate daughter, making Frankie Sam's paternal half-sister, and Josh his nephew. When Sam tells Hannah he intends to keep the money, Hannah, disgusted, returns to New York.\nSam introduces himself to Frankie as a visiting fellow alcoholic, and soon becomes involved in their life, gradually growing closer. He learns that Jerry visited Frankie and her mother on Sundays, and that Frankie has never met her father's wife and son. Meanwhile, Sam broods over his deepening legal troubles. Frankie does not want Sam around Josh anymore because she fears he will return to New York, upsetting Josh. Sam decides to leave, but returns to pick up Josh from school. Frankie later calls Sam, telling him Josh has been in a fight.\nSam eventually reveals that he is Jerry's son, resulting in Frankie exploding in anger and ordering him to leave. Later, Lillian is hospitalized following a heart condition. Hannah finds Sam in the waiting room, and they reconcile. Hannah has enrolled into UCLA's law program to remain close to Sam after realizing he wants to be with his family. Meanwhile, Frankie receives Jerry's money through a lawyer. Frankie quits her job, enrolls in school, and move into a suburban neighborhood with Josh. She cuts contact with Sam.\nAfter being discharged from the hospital, Lillian tells Sam that she forced Jerry to choose their family over Frankie and her mother. She was protecting Sam, but Jerry instead rejected his son because he was a reminder of the daughter he abandoned. One day, Josh, who is having difficulty adjusting to Sam absence, tries to find him after obtaining Lillian's address.\nWhen Sam visits Frankie, he asks her forgiveness and wants to be her brother and Josh's uncle and father figure. He shows her an old film reel that Jerry shot of a young Sam at a playground. In the film, a girl joins Sam, and Frankie realizes that Jerry had regularly brought her and Sam to play together and thus loved both his children. At this recognition, Frankie accepts Sam as her brother.", "cast": "Chris Pine as Sam Harper – Jerry's son – Frankie's brother\nElizabeth Banks as Frankie Davis – Josh's mom – Sam's sister\nOlivia Wilde as Hannah – Sam's girlfriend\nMichael Hall D'Addario as Josh Alan Davis – Frankie's son – Sam's nephew\nMichelle Pfeiffer as Lillian Harper – Sam's mom\nMark Duplass as Ted – Neighbor\nPhillip Baker Hall as Ike Rafferty – Estate attorney\nJon Favreau as Richards – Sam's boss\nSara Mornell as Dr. Amanda – Psychiatrist"}