{"_movieID": "222899", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:49:43", "summary": "About Last Night is a 2014 American romantic comedy film starring Kevin Hart, Michael Ealy, Regina Hall and Joy Bryant. The film is directed by Steve Pink and written by Leslye Headland. It is based on the 1974 David Mamet play Sexual Perversity in Chicago and is a remake of the 1986 film of the same name with a black cast. While the original film is set in Chicago, Illinois, the remake is set in Los Angeles, California where filming took place in late 2012.\nThe film premiered at the Pan African Film Festival on February 11, 2014 and was released in theaters on Valentine's Day, February 14, 2014. The film received generally positive reviews, with most critics praising the humor between Hart and Hall. The film grossed $49 million against its production budget of $12.5 million.\n\n", "cast": "The film features the following actors:\nHart was cast in June 2012. In the following July, Ealy and Hall joined the cast. Hart, Hall, and Ealy had previously starred together in the romantic comedy Think Like a Man (2012), which About Last Night's producer Will Packer also produced. Joy Bryant was cast in August to round out the four key roles. In addition to McDonald, Rodríguez, Lo Truglio, and Patton making up the supporting cast, American football player Terrell Owens had a cameo appearance in the film.Hart and Hall played the characters that James Belushi and Elizabeth Perkins played in the original film. While the character Joan was not very likable in the original film, Hall said the writers revised the character to be closer to the one depicted in the play. Hall said, \"Instead of making her just snarky, there are a lot of levels that she goes to.\"Ealy and Bryant played characters portrayed by Rob Lowe and Demi Moore in the previous film. Ealy said he chose not to see the play or the original film to avoid repeating any performances. He said of the roles of Danny and Debbie, \"With Bernie and Joan, they are written funny, they act funny, they are funny pretty much non-stop. [Danny and Debbie] bring a bit more gravitas to the entire story, and reality.\" Ealy, who was 40 years old at the time of release, played a 28-year-old character, so he lost 25 pounds to look more youthful. He also compared About Last Night's depiction of \"adult Black people in a sexy, romantic way\" to the film Love Jones (1997)."}