{"_movieID": "487558", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:03", "summary": "BlacKkKlansman is a 2018 American true crime film directed by Spike Lee and written by Charlie Wachtel, David Rabinowitz, Kevin Willmott, and Lee. The film is based on the 2014 memoir Black Klansman by Ron Stallworth. The film stars John David Washington as Stallworth, along with Adam Driver, Laura Harrier, and Topher Grace. Set in the early-1970s Colorado Springs, the plot follows the first African-American detective in the city's police department as he sets out to infiltrate and expose the local Ku Klux Klan chapter.\nLee produced the film with Raymond Mansfield, Shaun Redick, Sean McKittrick, Jason Blum, and Jordan Peele. Redick purchased the film rights to the book in 2015; Lee signed on as director in September 2017. Much of the cast joined the following month, and filming began in New York State.\nBlacKkKlansman premiered on May 14, 2018 at the Cannes Film Festival, where it won the Grand Prix. It was theatrically released in the United States on August 10, 2018, a day before the first anniversary of the Unite the Right rally. The film received acclaim from critics, who praised the performances (particularly of Washington and Driver) and timely themes, as well as noting it as a return to form for Lee. It received six nominations at the 91st Academy Awards, including Best Picture, Best Director (Lee's first directing nomination), and Best Supporting Actor for Driver, and won for Best Adapted Screenplay, making it Lee's first non-honorary Academy Award. The American Film Institute also selected it as one of the top 10 films of the 2018, and at the 76th Golden Globe Awards it earned four nominations, including Best Motion Picture – Drama.", "plot": "The film starts with footage of wounded Confederate soldiers lying in the streets of Atlanta, Georgia from Gone with the Wind in 1939 which transitions to a black-and-white PSA, where a man (named as Dr. Kennebrew Beauregard) comically fumbles a hate-filled screed decrying minorities. The film then jumps to the central plot.\nIn the early 1970s, Ron Stallworth is hired as the first Black officer in the Colorado Springs Police Department. Assigned to work in the records room, he faces racial slurs from his coworkers. After he requests a transfer to undercover work, he is assigned to infiltrate a local rally where national civil rights leader Kwame Ture (a.k.a. Stokely Carmichael) gives a speech. At the rally, Stallworth meets Patrice Dumas, president of the Black student union at Colorado College. While she takes Ture to his hotel, Patrice is stopped by patrolman Andy Landers, a racist officer in Stallworth's precinct, who threatens Ture and gropes Patrice.\nAfter the rally, Stallworth is reassigned to the intelligence division. After reading about a local division of the Ku Klux Klan in the newspaper, he calls posing as white and speaks with Walter Breachway, the president of the Colorado Springs, Colorado chapter. Stallworth recruits his Jewish coworker, Flip Zimmerman, to act as him to meet the Klan members. Zimmerman meets Walter, the more reckless Felix Kendrickson, and Ivanhoe, who cryptically refers to an upcoming attack.\nCalling Klan headquarters in Louisiana to expedite his membership, Stallworth begins regular phone conversations with Grand Wizard David Duke. Kendrickson suspects Zimmerman of being Jewish and tries to make him take a polygraph test at gunpoint, but Stallworth breaks the Kendricksons' kitchen window to distract them. Stallworth begins dating Patrice, but does not tell her that he is a police officer. After passing information to the Army CID about active duty members, he learns from an FBI agent that two members are personnel stationed at NORAD.\nDuke visits Colorado Springs for Stallworth's induction into the Klan. Over the real Stallworth's protests, he is assigned to a protection detail for Duke. Once Zimmerman is initiated, masquerading as Stallworth, Felix's wife Connie leaves the ceremony to place a bomb at a civil rights rally. Stallworth realizes her intentions and alerts local police officers. When Connie notices a heavy police presence at the rally, she puts Felix's backup plan into action and plants the bomb at Patrice's house, leaving it under her car when it will not fit into the mailbox. Stallworth tackles her as she tries to flee, but uniformed officers detain and beat him despite his protests that he is working undercover.\nThe bombmaker, Walker, recognizes Zimmerman from a prior arrest. He, Felix and Ivanhoe arrive and trigger the bomb while Ron is being detained. Not realizing where Connie hid it, they detonate it while next to Patrice's car and are killed in the explosion. Zimmerman arrives and frees Stallworth, and Connie is arrested. While celebrating the closed case that night, Stallworth wears a hidden microphone and tricks a drunken Landers into bragging about his assault on Patrice. Landers is arrested.\nPolice Chief Bridges congratulates the team for their success, but orders them to end their investigation and destroy the records. Stallworth receives a call from Duke, and he reveals to Duke that he is Black before hanging up. While Patrice and Stallworth discuss their future, they are interrupted by a knock on the door. Through the window, they see a flaming cross on a hillside surrounded by Klan members.\n\nThe film ends with footage from the 2017 far-right Unite the Right rally in Charlottesville, Virginia, the car-ramming attack by James Alex Fields killing Heather Heyer, President Trump's speech positing a moral equivalence between the white supremacist marchers and the counterprotestors, and David Duke’s statement afterwards, followed by a shot of an upside-down American flag fading into black and white."}