{"_movieID": "88005", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:57:30", "summary": "Seeking a Friend for the End of the World is a 2012 American romantic comedy-drama film, written and directed by Lorene Scafaria, in her directorial debut. The film stars Steve Carell and Keira Knightley. The inspiration for the title was a line from Chris Cornell's song \"Preaching the End of the World\", from his 1999 debut solo album Euphoria Morning.Filming began May 2011, in Los Angeles, California. The film was theatrically released on June 22, 2012 in the United States by Focus Features. It received mixed reviews from critics and was a box-office bomb, earning $9.6 million on a $10 million budget. It was released on DVD and Blu-ray Disc and made available for digital streaming in the United States on October 23, 2012.\n\n", "plot": "In New York City, a news report is broadcast informing the world that a mission to stop an incoming 70-mile wide asteroid known as \"Matilda\" has failed and that the asteroid will make impact in three weeks, destroying all life on Earth. Dodge Petersen (Steve Carell) and his wife, Linda (Nancy Carell), listen to the broadcast from the side of the road. When Dodge expresses disinterest, Linda disgustedly leaves the vehicle without a word. At home, Dodge reminisces about his high school sweetheart, Olivia, when he notices his neighbor Penny (Keira Knightley) crying on the fire escape. She has just broken up with her boyfriend Owen (Adam Brody) for making her miss her last opportunity to see her family in England. At her apartment, Penny gives Dodge three years' worth of his mail that was incorrectly delivered to her and, in the process, unwittingly tells him that his wife was having an affair. Dodge storms off into the night, guzzling codeine-laced cough syrup and window cleaner in a suicide attempt. He wakes up in a park, with a dog tethered to his foot and a note on his sweater reading \"Sorry\", which becomes the dog's name. Dodge takes Sorry home, opens the old mail, and is surprised to discover a three-month-old letter from Olivia, which explains that he was \"the love of her life.\" Later, a riot breaks out on his block. Dodge and Penny abandon the self-centered Owen amid the rioters, with Dodge explaining to Penny that he knows someone who could fly her to England if she helps him find Olivia. She agrees, and the two set off with Sorry for Dodge's hometown in Delaware.\nAlong the way, Dodge and Penny run out of gas, share a bizarre experience with suicidal motorist Glenn (William Petersen), witness the eruption of an orgy at a restaurant, have sex in a pick-up truck, and spend a night in jail. They get a ride to Camden, New Jersey, where they meet Penny's ex-boyfriend, Speck (Derek Luke), who is prepared for the apocalypse. Speck has a working satellite phone in his bunker and lets Penny contact her family. Penny and Dodge borrow a car from Speck and eventually make it to Olivia's family home. Dodge and Penny walk up toward the door of the home but find no one home and then spend the day together; they realize a mutual affection. Penny discovers a letter from Olivia to her parents, which reveals Olivia's address. Penny and Dodge drive to Olivia's home, where Dodge leaves a letter to Olivia and expresses his feelings for Penny. Later, they go to the house of the man who Dodge promised could take Penny to England. The man turns out to be Dodge's estranged father, Frank (Martin Sheen). After making amends with Frank, Dodge puts a sleeping Penny into his father's plane, whispering to her that she is the real love of his life. Frank and Penny depart, leaving Dodge behind. Dodge takes refuge in Penny's apartment and awaits his imminent death until Penny unexpectedly returns, upset that Dodge allowed her to leave. The two lie in bed and comfort each other as they feel the tremor of the asteroid's impact. Penny expresses regret at not having met Dodge sooner, while Dodge assures her that their meeting had been opportune. The screen fades to white as the world presumably ends."}