{"_movieID": "268896", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:53:20", "summary": "Pacific Rim: Uprising is a 2018 American science-fiction film directed by Steven S. DeKnight (in his feature-film directorial debut), and written by DeKnight, Emily Carmichael, Kira Snyder and T.S. Nowlin. It is the sequel to the 2013 film Pacific Rim, with Guillermo del Toro, the director of the original, serving as a producer. The sequel stars John Boyega (also making his producer debut), as well as Scott Eastwood, Cailee Spaeny, Jing Tian, Adria Arjona and Zhang Jin, with Rinko Kikuchi, Charlie Day, and Burn Gorman returning from the original film. Set in the year 2035, the plot follows humanity again fighting Kaiju, giant monsters set on destroying the world.\nPrincipal photography began in November 2016 in Australia. The film was released in the United States on March 23, 2018, by Universal Pictures, in 2D, RealD 3D, IMAX 3D, and IMAX, and grossed $290 million worldwide. The film polarized critics and audiences; with some calling the film inferior to del Toro's and criticizing the scope, pacing, story, as well as the absent characters from the previous film and the underdeveloped new characters, while others praised the visual effects and performances of Boyega, Eastwood and Spaeny.", "plot": "It is 2035, ten years after the Battle of the Breach, in which the interdimensional portal created by the Precursors (through which they sent marauding Kaiju) was closed. Former Jaeger pilot Jake Pentecost—son of Battle of the Breach hero Stacker Pentecost—makes a living by stealing and selling Jaeger parts on the black market in the Los Angeles area. After he tracks part of a disabled Jaeger's power core to the secret workshop of fifteen-year-old Jaeger enthusiast Amara Namani, both are arrested by the Pan-Pacific Defense Corps (PPDC) following an altercation between Amara's small, single-pilot Jaeger Scrapper and the Police Jaeger November Ajax. A holographic transmission of Jake's adoptive sister and PPDC Secretary General Mako Mori persuades him to return to PPDC as an instructor, with Amara as his recruit.\nArriving at the China Shatterdome, Jake starts training Jaeger program cadets with his estranged former co-pilot Nate Lambert. Nate and Mako reveal to him that the Jaeger program is threatened by the Shao Corporation's new drone program, which offers to mass-produce Jaeger drones developed by Shao Liwen and Dr. Newton 'Newt' Geiszler. Mako is due to deliver a final assessment to determine the approval of the drones at a PPDC council meeting in Sydney, but is killed by rogue Jaeger Obsidian Fury before she can report. Her death prompts the PPDC council to immediately authorize and deploy the drones. \nMoments before her death, Mako had transmitted the location of a defunct Jaeger production facility in Siberia. Jake and Nate travel there in Gipsy Avenger, but Obsidian Fury destroys the complex and engages them in another battle. Upon destroying its reactor, they find that Obsidian Fury was piloted by a Kaiju's secondary brain, which testing shows was grown on Earth.\nWhen the drones reach their respective locations, their piloting operations are hijacked by cloned Kaiju brains secretly mounted onboard. The Kaiju-Jaeger hybrids simultaneously attack all Pacific Rim Shatterdomes, inflicting heavy casualties on PPDC forces and incapacitating almost all Jaegers. Hermann Gottlieb and Newt try to disable the drones, but Hermann discovers that Newt is behind the attack when he commands the Kaiju-Jaeger hybrids to open multiple breaches across the Pacific Rim. Newt's mind has been taken over by the Precursors—who forged a link when he drifted with Kaiju brains in the previous movie—and orchestrated Mako's assassination to ensure his plan would proceed. Although Shao is able to destroy the drones, closing the breaches, three Kaiju—named Raijin, Hakuja and Shrikethorn—had already emerged and reached Tokyo. The team realizes that the Precursors' true goal is to activate the Ring of Fire by detonating Mount Fuji with the Kaijus' blood, spreading toxic gas into the atmosphere and wiping out all life on Earth while terraforming the planet for Precursor colonization.\nThe cadets are mobilized while Gottlieb and Shao repair the PPDC's four salvageable Jaegers; Jake and Nate's Jaeger Gipsy Avenger is joined by Guardian Bravo (piloted by cadets Suresh and Ilya), Saber Athena (cadets Renata and Ryoichi) and the three-pilot Bracer Phoenix (cadets Amara, Viktoria, and Jinhai). Gottlieb develops Kaiju-blood-powered rockets, which launch the team to Tokyo. Although the Jaegers initially repel the three Kaiju, Newt merges them into a \"Mega-Kaiju\" using robotic parasites from one of Shao's factories. The creature quickly overpowers the Jaegers, injures Nate, and Cadets Ilya, Renata, and Ryoichi and kills Suresh. Three of the four Jaegers are destroyed, leaving Gipsy Avenger as the only operational Jaeger. Jake and Amara pilot it against the Mega-Kaiju, with Shao remote piloting Scrapper and aiding them by locating a rocket and welding it to Gipsy, which sends the Jaeger (with Scrapper holding on) into the atmosphere and free-falling back to Earth, colliding into the Mega-Kaiju and killing it, while Jake and Amara survive by transferring to Scrapper. Angered by the Mega-Kaiju's failure, Newt tries to flee, but is knocked out and captured by Nate.\nIn a mid-credits cutscene, Newt - now in custody - threatens that their victory is meaningless because the Precursors will keep sending attacks, but Jake replies that humanity will soon be the ones attacking the Precursors."}