{"_movieID": "50725", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:22", "summary": "Take Me Home Tonight is a 2011 American retro comedy film directed by Michael Dowse and starring an ensemble cast led by Topher Grace and Anna Faris.  The screenplay was written by Jackie and Jeff Filgo, former writers of the television sitcom That '70s Show, of which Grace was a cast member.\nShooting began on the week starting February 19, 2007, in Phoenix, Arizona. The film received its wide theatrical release on March 4, 2011.\nThe title comes from the 1986 Eddie Money song of the same name, also played in the theatrical trailer and on the menu screen of the Blu-Ray and DVD releases. Despite having the same name, it never actually appears in the movie.", "plot": "Matt Franklin is a recent MIT graduate who works at a Los Angeles Suncoast Video store in 1988 while trying to figure out what he wants to do with his life, something that his police officer father has grown impatient with. When Matt's high school crush, Tori Frederking, walks into the store, he lies that he works at Goldman Sachs. Tori invites Matt to a Labor Day party, hosted by Matt's twin sister Wendy's boyfriend, Kyle.\nWhen Matt, Wendy, and Matt's best friend, Barry Nathan, head to the party,  Barry steals a Mercedes-Benz from the car dealership he got fired from earlier that day, saying Matt needs it to impress Tori. At the party, Matt awkwardly tries to woo Tori. Barry snorts some cocaine he found in the glove box of the stolen car and gets involved in a dance-off, and Kyle proposes to Wendy in front of the whole party. Her acceptance disappoints Matt, who doesn't think that Kyle will support her in her dream to attend graduate school.\nTori takes Matt and Barry to her boss' party in Beverly Hills. Barry has a wild sexual encounter with an older woman while Matt and Tori grow closer, after Matt's successful 'put down' of Tori's boss, a habitual sexual harasser. They go into a neighbor's backyard where they jump on a trampoline, play truth or dare, and end up having sex.\nWendy shares her unopened admissions letter from Cambridge with Kyle, and it is revealed that she was not accepted. Kyle is visibly relieved, while Wendy is visibly upset.\nMatt confesses that he doesn't work at Goldman Sachs. Tori storms off, leaving Matt guilt-ridden. He finds Barry and they leave the party. Barry chastises Matt for not trying to have just one night of enjoyment and offers him a line of cocaine while driving. Matt attempts to snort the cocaine, but ends up driving the convertible into a ditch. A police cruiser arrives, and it turns out to be Matt's dad. Already disappointed with Matt's unwillingness to choose a career path, Mr. Franklin damages the convertible even more as a means of coercing Matt to get a better job in order to pay off the damages. Matt apologizes to his dad for being such a failure, to which his dad replies that he's never acted, so has never reached failure. He encourages Matt to take a shot at anything in life.\nKnowing Tori has left her car at the party, Matt and Barry make their way back there, where bets are being placed on who will \"ride the ball\", a giant, steel sphere that someone enters and rides as it's rolled down a hill. Matt finds Tori and tries to apologize, but she is unwilling to forgive him. Feeling he has nothing to lose, Matt volunteers to \"ride the ball\", hitting several parked cars then flying off an embankment, landing in a backyard swimming pool. Matt almost drowns before escaping the sinking ball.\nBarry rushes to the scene and walks with Matt back toward the party, meeting up with Wendy and Tori, who are elated to find him alive. Matt apologizes to Tori, and she forgives him, then gives him her phone number. The group return to the party as dawn approaches. All who are still there 'whoop' it up at Matt's successful return.\nWendy, realizing Matt was right, breaks up with Kyle, who experiences a crying breakdown. Pondering his future with Ashley, a Goth girl he met at the party, Barry is told by her that maybe he should go to college. Outside, Matt boldly kisses Tori goodbye. Matt's dad, investigating the giant ball in the pool, smirks proudly when he finds his son's name tag. Matt, Barry and Wendy stagger out of the party house, leaving together as the sun is rising."}