{"_movieID": "136795", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:59:50", "summary": "In thermodynamics, heat is energy in transfer to or from a thermodynamic system, by mechanisms other than thermodynamic work or transfer of matter. The mechanisms include conduction, through direct contact of immobile bodies, or through a wall or barrier that is impermeable to matter; or radiation between separated bodies; or isochoric mechanical work done by the surroundings on the system of interest; or Joule heating by an electric current driven through the system of interest by an external system; or a combination of these. When there is a suitable path between two systems with different temperatures, heat transfer occurs necessarily, immediately, and spontaneously from the hotter to the colder system. Thermal conduction occurs by the stochastic (random) motion of microscopic particles (such as atoms or molecules). In contrast, thermodynamic work is defined by mechanisms that act macroscopically and directly on the system's whole-body state variables; for example, change of the system's volume through a piston's motion with externally measurable force; or change of the system's internal electric polarization through an externally measurable change in electric field. The definition of heat transfer does not require that the process be in any sense smooth. For example, a bolt of lightning may transfer heat to a body.\nConvective circulation allows one body to heat another, through an intermediate circulating fluid that carries energy from a boundary of one to a boundary of the other; the actual heat transfer is by conduction and radiation between the fluid and the respective bodies. Natural convection, though spontaneous, does not occur merely because of temperature difference but due to Rayleigh instability caused by combination of gravity and thermal expansion in supplement to sufficient temperature gradient.\nLike thermodynamic  work, heat transfer is a process involving two systems, not a property of any one system. In thermodynamics, energy transferred as heat (a process function) contributes to change in the system's cardinal energy variable of state, for example its internal energy, or for example its enthalpy. This is to be distinguished from the ordinary language conception of heat as a property of the system.  \nAlthough heat flows spontaneously from a hotter body to a cooler one, it is possible to construct a heat pump which expends work to transfer energy from a colder body to a hotter body. In contrast, a heat engine reduces an existing temperature difference to supply work to another system. Another thermodynamic type of heat transfer device is an active heat spreader, which expends work to speed up transfer of energy to colder surroundings from a hotter body, for example a computer component.The amount of heat transferred in any process can be defined as the total amount of transferred energy excluding any macroscopic work that was done and any energy contained in matter transferred. For the precise definition of heat, it is necessary that it occur by a path that does not include transfer of matter. As an amount of energy (being transferred),  the SI unit of heat is the joule (J). The conventional symbol used to represent the amount of heat transferred in a thermodynamic process is Q. Heat is measured by its effect on the states of interacting bodies, for example, by the amount of ice melted or a change in temperature.  The quantification of heat via the temperature change of a body is called calorimetry."}