{"_movieID": "324857", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:21", "summary": "Spider-Man: Into the Spider-Verse is a 2018 American computer-animated superhero film featuring the Marvel Comics character Miles Morales / Spider-Man, produced by Columbia Pictures and Sony Pictures Animation in association with Marvel, and distributed by Sony Pictures Releasing. It is the first animated feature film in the Spider-Man franchise, and is set in a shared multiverse called the \"Spider-Verse\", which has alternate universes. The film was directed by Bob Persichetti, Peter Ramsey, and Rodney Rothman from a screenplay by Phil Lord and Rothman, and a story by Lord. It stars the voices of Shameik Moore, Jake Johnson, Hailee Steinfeld, Mahershala Ali, Brian Tyree Henry, Lily Tomlin, Luna Lauren Velez, John Mulaney, Kimiko Glenn, Nicolas Cage, and Liev Schreiber. In the film, Miles Morales joins other Spider-Men from various dimensions who team up to save New York City from Kingpin.\nPlans for an animated Spider-Man film by Lord and Christopher Miller were leaked in 2014 and announced in April 2015. Persichetti, Ramsey and Rothman joined over the next two years, with Moore and Schreiber cast in April 2017. Lord and Miller wanted the film to have a unique style, combining Sony Pictures Imageworks' computer animation pipeline with traditional hand-drawn comic book techniques inspired by the work of Miles Morales co-creator Sara Pichelli. The film required up to 140 animators, the largest crew used by Sony Pictures Animation. The film was dedicated to the memories of the creators of Spider-Man, Stan Lee and Steve Ditko, who both died in 2018.\nSpider-Man: Into the Spider-Verse had its world premiere at the Regency Village Theater in Los Angeles on December 1, 2018, and was theatrically released in the United States on December 14. It grossed over $375 million worldwide against a $90 million budget. It received praise for its animation, characters, story, voice acting, humor and soundtrack, and won numerous awards, including Best Animated Feature at the 91st Academy Awards, 46th Annie Awards, and 76th Golden Globe Awards. It was the first non-Disney or Pixar film to win the Academy Award for Best Animated Feature since Rango (2011), as well as the first non-Disney/Pixar film since Happy Feet (2006) to win that award when a Disney or Pixar film was also in contention. A sequel and spin-off are in development.", "plot": "Teenager Miles Morales struggles to live up to the expectations of his father, police officer Jefferson Davis, who sees Spider-Man as a menace. Miles transfers to a boarding school, but later sneaks out and goes to his uncle Aaron Davis's house. When he takes Miles to an abandoned subway station to paint graffiti, Miles is bitten by a radioactive spider and gains spider-like abilities.\nMiles returns to the station to search for the spider and discovers a particle accelerator called \"The Super-Collider\" built by Kingpin, who hopes to access parallel universes. Miles notices Spider-Man has arrived and is attempting to disable the collider while fighting Kingpin's enforcers, Green Goblin and Prowler. Spider-Man saves Miles and Green Goblin shoves Spider-Man into the collider and causing an explosion that nearly kills him. Wounded, Spider-Man gives Miles a USB drive that will disable the accelerator and warns that the machine could destroy the city if reactivated. Miles watches in horror as Kingpin kills Spider-Man, before fleeing from Prowler.\nMiles tries out his newfound abilities in a Spider-Man costume, but damages the USB drive after falling off a building. At Spider-Man's grave, Miles meets Peter B. Parker, an older and worn-down version of Spider-Man from another dimension. Upon meeting Peter, Miles inadvertently discovers a power to emit a bio-electric venom blast to disable his victim. Peter reluctantly agrees to train Miles in exchange for help stealing data to create a new drive. In Fisk's research facility, Miles discovers he also has the power to turn invisible. They are confronted by scientist Olivia Octavius, who takes DNA samples from Peter, revealing that he will die due to cellular decay if he stays in their dimension.\nMiles and Peter are rescued by Gwen Stacy, Spider-Woman from another dimension. Meanwhile, Kingpin's motivations for creating the collider are revealed: to find alternate versions of his deceased wife and son, who died in a car crash. The group find Peter's aunt, May Parker, who is sheltering more heroes from other dimensions—Spider-Man Noir, Spider-Ham, and Peni Parker—who are also deteriorating. Miles offers to disable the collider so the others can return home, but the heroes tell him he lacks experience. Miles retreats to Aaron's home, where he discovers that Aaron is the Prowler. He returns to May's house, where Peni has completed the drive; however, he is followed by Kingpin, Prowler, Octavius, Scorpion, and Tombstone, leading to a brawl. Miles flees, but is captured by Aaron and unmasks himself. Unwilling to kill Miles, Aaron is shot by Fisk. Miles flees with Aaron, but he dies of his injuries. Jefferson sees Miles mourning over Aaron and concludes that Spider-Man killed him.\nThe heroes regroup with Miles in his dorm. Peter restrains Miles with his webs to ensure his safety before heading out with the heroes, choosing to sacrifice himself by staying behind and deactivating the collider. Jefferson arrives outside Miles' door and, assuming he does not want to speak to him, apologizes for his mistakes. Miles masters his powers and goes to Aunt May's, where he gains web shooters and repaints Peter's suit. He joins the heroes and helps them defeat Kingpin's enforcers before activating the USB drive and sending them home. Kingpin and Miles fight throughout the collider, attracting Jefferson's attention. As Miles is nearly killed, Jefferson realizes that Spider-Man is not the enemy and encourages him. Miles paralyzes Kingpin with his venom blast and throws him at the kill switch, destroying the collider.\nKingpin and his enforcers are arrested and Jefferson recognizes Spider-Man as a hero. Miles embraces the responsibilities of his new life. Back in their home dimensions, the heroes return to their lives; Peter prepares to fix his relationship with Mary Jane, Spider-Noir finally solves a Rubik's Cube he struggled with in the alternate timeline, Peni repairs her robot, Spider-Ham is enjoying a hot dog, and Gwen finds a way to contact Miles across dimensions. \nIn another dimension, Miguel O'Hara (Spider-Man 2099) travels to a 1967 New York and argues with the Spider-Man there.", "cast": "Shameik Moore as Miles Morales / Spider-Man: An intelligent yet rebellious teenager of African-American and Puerto Rican descent, who is imbued with spider-like abilities after being bitten by a mutated spider and eventually takes up the mantle of a masked vigilante named \"Spider-Man\". Producers Lord and Miller described the character as unique among Spider-Men because of his Brooklyn upbringing, half-Puerto Rican and half-African-American background, and the fact that his family is still alive, with that family dynamic being central to the film's story.\nJake Johnson as Peter B. Parker / Spider-Man: Miles's reluctant mentor, a disheveled, jaded and brown-haired 38-year-old counterpart of the hero from another dimension. He is intended to be an amalgamation of all pop culture Spider-Man adaptations and interpretations, and Lord and Miller envisioned him to be like The Karate Kid's Mr. Miyagi, if \"Mr. Miyagi doesn't know anything\" which they thought was a \"really neat color to put onto Peter that we hadn't seen before\".\nHailee Steinfeld as Gwen Stacy / Spider-Woman: A dimension-displaced counterpart of Gwen Stacy with spider-like abilities, who takes up the alias of \"Gwanda\" while at Miles' school.\nMahershala Ali as Aaron Davis / Prowler: Miles's uncle, who moonlights as an enforcer for Wilson Fisk.\nBrian Tyree Henry as Jefferson Davis: Miles's father, a police officer, who initially views Spider-Man as a menace. At the age of 35, Henry said he was too young to portray a father of a teenager, but agreed to the role after learning that Miles Morales was the only black, Latino Spider-Man.\nLily Tomlin as Aunt May: Peter's aunt, who is dead in Peter B. Parker's universe, and provides refuge for the other Spider-People in Miles' universe.\nLuna Lauren Velez as Rio Morales: Miles's mother, a nurse.\nZoë Kravitz as Mary Jane Watson: Peter Parker's widowed wife in Miles' universe and Peter B. Parker's ex-wife in his universe.\nJohn Mulaney as Peter Porker / Spider-Ham: An alternate funny animal version of Spider-Man from an anthropomorphic universe, who was once a spider, bitten by a radioactive pig.\nKimiko Glenn as Peni Parker / SP//dr: A young Japanese-American girl from an alternative anime-like universe who co-pilots a biomechanical suit with a radioactive spider that she shares a telepathic link with. The filmmakers initially considered using Silk as their Asian-American Spider-Man, but eventually settled on Peni because of her more unique power set compared to the other Spider-People. Peni's designs went through a few iterations as her initial design was particularly \"iffy\" before producer Justin Thompson came up with the idea to portray her in an art style similar to that of Sailor Moon, aside that Phil Lord and Christopher Miller wanted to go full anime in terms of her design.\nNicolas Cage as Peter Parker / Spider-Man Noir: A dark and monochromatic alternate version of Peter Parker from a 1930s universe. Cage based his character on the films of Humphrey Bogart, specifically the voices of actors from that era such as James Cagney and Edward G. Robinson.\nKathryn Hahn as Olivia Octavius / Doctor Octopus: Head scientist and CEO of Alchemax, and scientific adviser to Wilson Fisk.\nLiev Schreiber as Wilson Fisk / Kingpin: A crime lord and the benefactor of Alchemax in Miles's dimension.Additional voices for the film include: Chris Pine as Peter Parker / Spider-Man (the young, blond-haired version from the beginning of the film), Lake Bell as Vanessa Fisk, Jorma Taccone as Norman Osborn / Green Goblin,  Marvin \"Krondon\" Jones III as Tombstone, Joaquín Cosío as Scorpion, and Post Malone (who contributed to the film's soundtrack) as a bystander in Brooklyn. An archival recording of Cliff Robertson from the 2004 film Spider-Man 2 was used for a flashback scene involving the character Ben Parker. Spider-Man co-creator Stan Lee appears in a posthumous cameo, as a character named Stan who sells a Spider-Man costume to Morales. Lord and Miller said it was important to give Lee a bigger moment in the film rather than just a passing cameo, because he was \"so integral to the spirit of this movie\", and the role was \"extra meaningful\" following Lee's death in November 2018. Lee also has several brief \"Easter egg\" cameos throughout the film, such as when he walks over Miles and Peter B. when they are lying on the streets of New York.Cameos during the film's post-credits include: Oscar Isaac as Miguel O'Hara / Spider-Man 2099, an alternative version of Spider-Man from the Marvel 2099 Imprint; Greta Lee as O'Hara's AI assistant Lyla (respectively credited as Interesting Person #1 and Interesting Person #2); and Jorma Taccone as the Peter Parker / Spider-Man from the 1967 TV series (replacing Paul Soles, with the character being credited as Last Dude). Stan Lee also voices Peter Parker's boss J. Jonah Jameson during that same scene (replacing the late Paul Kligman), something that actually accomplishes Lee's wishes to portray that character since the eighties due to Jameson being based on Lee himself, and marking the third and last time Lee played a character he created after his appearance as Willie Lumpkin in the 2005 film Fantastic Four and as Irving Forbush in Marvel Cinematic Universe television series. Donald Glover also appears in a background TV screen as Troy Barnes in Spider-Man pajamas. Miles Morales's best friend and roommate Ganke Lee also appears; however, he is not named and does not speak. His name was confirmed in the promotional magazine Spider-Man: Into the Spider-Verse – The Official Movie Special and in the film's script. The character originally had a bigger role in the movie, but the filmmakers ultimately decided to develop his storyline in future movies about Miles."}