{"_movieID": "227783", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:40", "summary": "The Nut Job is a 2014 3D computer-animated heist-comedy film directed by Peter Lepeniotis, who also wrote the film with Lorne Cameron. It stars the voices of Will Arnett, Brendan Fraser, Gabriel Iglesias, Jeff Dunham, Liam Neeson and Katherine Heigl. Stephen Lang, Maya Rudolph and Sarah Gadon also star in supporting roles. The film is based on Lepeniotis' 2005 short animated film Surly Squirrel. Produced by Gulfstream Pictures, Redrover International and ToonBox Entertainment, it was released in the United States on January 17, 2014, by Open Road Films. With a budget of $43 million, it is the most expensive animated film co-produced in South Korea. The film grossed $64.3 million in North America, for a worldwide total of $120.9 million.\nA sequel titled The Nut Job 2: Nutty by Nature was released on August 11, 2017.", "plot": "In the late 1940s fictional town of Oakton City, a purple squirrel named Surly (Will Arnett) and his mute rat partner Buddy (Rob Tinkler) reside in Liberty Park where their thieving reputation has made them outcasts. A group of urban animals led by Raccoon (Liam Neeson) and his cardinal assistant are running low on food for winter. Compassionate Red squirrel Andie (Katherine Heigl) and glory hogging gray squirrel Grayson (Brendan Fraser) compete with Surly and Buddy to scavenge from a peanut cart manned by Lucky (Scott Yaphe) and Fingers (James Rankin) who are casing a bank. The squirrels' efforts inadvertently end with the cart's propane tank exploding in the park after its cord was bitten by Fingers' pug Precious (Maya Rudolph). The runaway cart ends up destroying and burning the tree, where the animals store their food. Surly is banished and Buddy follows him.\nIn the city, they find Maury's Nut Shop. Adjacent to the bank, it is a criminal hideout used by Lucky, Fingers, their boss Percy \"King\" Dimpleweed (Stephen Lang) and Knuckles, who plan to break through the wall and replace the bank's cash with nuts. King's girlfriend Lana (Sarah Gadon) believes King has gone straight and the nut store is legitimate.\nRaccoon sends Andie and Grayson to the city to find food, but they get separated when a street rat approaches them. Andie recovers Fingers' dog whistle, which Knuckles threw out and Surly had used against Precious, and threatens to dispose of it if Surly does not share the nuts he is going to take. Surly accepts and unwittingly befriends Precious after threatening her with the whistle. Andie informs the park community of the plan. Raccoon reluctantly goes with the plan and assigns Mole (Jeff Dunham) and the Bruisers to go with her. Surly eventually learns from Mole that Raccoon's policy is to control the food supply in order to control the animals, and that Raccoon plans on sabotaging the nut bonanza. When Andie does not believe him, Surly leaves after Grayson reunites with them. While collecting the nuts, Surly is captured by King, but he gets freed by Lana since he doesn't have the whistle anymore.\nAfter fending off street rats who work for Raccoon, Surly and Grayson chase the criminal gang's getaway truck, which carries Raccoon and the other animals. Surly fights off Cardinal, and Mole defects from Raccoon and reveals the truth to the animals, resulting in Raccoon being voted out of the park community. King and Knuckles use the dynamite inside the empty truck to blow up a police barricade at a dam, but the police shoots the tire on the truck that falls from the dam. It explodes after Surly gets himself and Andie off it, and they fall into the river below. Surly makes it to a log, but finds out that Raccoon, King and Knuckles survived the explosion. Raccoon tries to kill Surly, but the nuts' weight begins to break the log. The animals arrive to rescue them, but Surly, deciding to be selfless in order to protect his friends, lets go of the log and falls into the waterfall with Raccoon. The park community now sees the good side of Surly, and mourns him.\nThe nuts make their way to Liberty Park. King and his associates are arrested as Lana breaks up with King. Andie and Buddy are still mourning over Surly, and when Precious learns what happened, she has Buddy come look at an unconscious Surly near the river. Doleful to see Surly lifeless, Buddy says his first two words: \"best friend\". Surly wakes up and hugs Buddy. Afterward, Precious leaves to meet Lana, who plans to run Maury's Nut Shop. Finding Surly alive, Andie embraces him and suggests to tell the other animals of his heroism. However, Surly declines, yet gains a willingness to work with others, and goes into the city with Buddy, allowing Grayson to take credit for the nuts making it to the park.\nDuring the credits, the animals and humans dance with an animated Psy as he performs \"Gangnam Style\". In a mid-credits scene, Raccoon and Cardinal are shown to have survived their ordeal and are sulking on a harbor buoy surrounded by sharks while coming up with another plan. In a post-credits scene, Precious chases Mole to get the bone he is holding that she wants and he drives her away with the dog whistle.", "cast": "Will Arnett as Surly, a purple squirrel.\nBrendan Fraser as Grayson, a glory-hogging squirrel who has a false reputation for being the \"park hero\".\nGabriel Iglesias as Jimmy, a groundhog and the leader of the Bruisers.\nJeff Dunham as Mole, a mole who works for Raccoon and has eyes that are sensitive to light.\nLiam Neeson as Raccoon, a raccoon and the self-proclaimed, power-hungry, deceitful con-artist and leader of the park who banishes Surly from the same park. Raccoon's also known for his thirst for Surly's blood which later in the film terrorizes Andie due to her affections for Surly.\nKatherine Heigl as Andie, a compassionate and beautiful squirrel who eventually becomes Surly's love interest.\nStephen Lang as Percy \"King\" Dimpleweed, a mob boss.\nMaya Rudolph as Precious, a pug that is owned by Lucky and later Lana.\nSarah Gadon as Lana, King's girlfriend later ex-girlfriend.\nJames Rankin as Fingers, King's fellow criminal who helps Lucky run \"Maury's Nut Shop\".\nScott Yaphe as Lucky, the owner of the peanut cart, who is Precious' owner and King's associate.\nJoe Pingue as Johnny, a groundhog and a member of the Bruisers.\nAnnick Obonsawin as Jamie, a small female groundhog and a member of the Bruisers.\nJulie Lemieux as a girl scout that tries to buy nuts from Fingers and Lucky's nut cart.\nRobert Tinkler as Buddy, a rat and Surly's mute and incompetent partner-in-crime who does not talk much\nRobert Tinkler also voices Redline, a blue mouse who idolizes Grayson and whose catchphrase is \"We're all gonna die!\".\nJames Kee voices an armored truck guard\nJames Kee also voices a street rat.\nScott McCord as a police officer who tries to get Fingers and Lucky to show him a permit for their nut vending.\nScott McCord also provides the voices of miscellaneous animals.\nKatie Griffin as a park pigeon"}