{"_movieID": "491418", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:48:29", "summary": "Instant Family is a 2018 American comedy film starring Mark Wahlberg and Rose Byrne as parents who adopt three young children, played by Isabela Moner, Gustavo Escobar (Gustavo Quiroz), and Julianna Gamiz. Also starring Margo Martindale, Julie Hagerty, Tig Notaro, and Octavia Spencer, the film is directed by Sean Anders, who wrote the screenplay with John Morris, based in part on Anders' own experiences.\nInstant Family was released in the United States on November 16, 2018. It grossed over $120 million worldwide, and was called an \"earnest, heartwarming comedy\" by critics, who also praised the performances.", "plot": "Married couple Pete and Ellie Wagner, after being taunted by relatives who think they will never have kids, start considering the option of adopting a child. Initially half-serious, they eventually decide to enroll in a foster parents course. Two social workers, Karen and Sharon, guide the hopeful parents on the steps to getting into becoming adoptive parents. The couples are brought to a fair where they have the chance to go up to kids that they are interested in adopting. Pete and Ellie walk by the teenagers, although Ellie shows hesitance over raising a teen. One of the teens, 15-year-old Lizzy, informs Ellie that they all know no one wants to adopt the teens.\nImpressed with Lizzy's behavior, Pete and Ellie talk to Karen and Sharon over potentially taking her in. The social workers inform the couple that Lizzy's mother is a drug addict who is currently in jail, and she set their home on fire because she left the crack pipe lit. It also turns out that Lizzy has two younger siblings, 10-year-old  Juan and 6-year-old Lita. Although this seems like more of a challenge for Pete and Ellie, they agree to meet the siblings. The first meeting, however, does not seem to result in an immediate \"bond\", and Pete and Ellie reconsider.\nPete and Ellie have Thanksgiving dinner with Ellie's family, where they announce that they intend to walk back on their decision to adopt. Once the rest of the family shows relief, making it clear that nobody really believed that Pete and Ellie could make it, Ellie gets upset and decides that they will go through with the foster care to prove that they can be good parents.\nLizzy, Juan, and Lita begin to live with the Wagners. Although it is initially pleasant, it doesn't take long for things to get hectic. Lita refuses to eat anything but potato chips, and Juan reacts sensitively to every instance of trouble. Lizzy is also frequently bratty toward the Wagners, but especially Ellie, whom she blames for trying to replace her mother. The two parents frequently attend support groups with the other couples for insight on what to do with the kids.\nPete's mother Sandy comes to visit to meet the kids, and instantly wins them over by taking the whole family to an amusement park. While there, Lizzy runs off with two friends from school. She doesn't reappear until later, and Pete grounds her for not informing him or Ellie as to her whereabouts.\nAlthough Lizzy remains bratty, Juan and Lita start to warm up to the Wagners. Lita calls Pete \"daddy\" when he fixes her doll, and Ellie gets a \"Good night, mommy\" from Juan after she comforts him from a nightmare. Realising how much Pete and Ellie care for Juan and Lita, Lizzy starts to go along with the others as they partake in family activities. Pete even invites her to a fixer-upper he is working on so they can wreck things for her to take out her frustrations.\nPete and Ellie later find out that the kids' mother Carla has been out of prison for a few months and she wants to see the kids. They express their feelings about this during the group therapy, but the social workers tell them that their main goal is to keep families together and that the children might be reunited with the biological mother, after all.\nAfter meetings between the kids and their biological mother, the situation in the Wagner family gets worse. The children become more and more unruly and Pete and Ellie feel profoundly demotivated and frustrated. Pete and Ellie seek out the Fernandez family, who had spoken with their adoptive daughter Brenda at the training, for help with Lizzy. They inform the Wagners that Brenda is back in rehab, but Mrs. Fernandez tells them what a process it is to really form a bond and trust with the kids.\nThe couple is horrified when they find Lizzy taking naked selfies to send to a guy at school named Jacob, and he sends her a naked photo of himself. When they take the kids to school the next day, they confront a boy named Charlie since they mistook him for Jacob. Once they find out that Jacob is actually the school's 22-year-old janitor, they chase him into the school and beat him up. Jacob is arrested, but so are Pete and Ellie, leaving Juan and Lita alone in the car, while Lizzy is humiliated. When Pete and Ellie return home, they are told by Sandy that they need to reassure Lizzy that they love her, because she doesn't feel that she is loved.\nThe Wagners and the kids gather for a court hearing to decide whether or not the kids will go back to Carla or stay with Pete and Ellie. The judge reads a statement written by Lizzy detailing the things that Pete and Ellie have done, while defending Carla's claim that she is ready to take care of them again. Although Ellie tries to read a new statement, the judge won't let her. Carla is then given rights to the kids.\nPete and Ellie sadly start to pack things up for the kids. Juan and Lita do not want to go, but Lizzy is ready. However, Karen and Sharon arrive at the house to inform Lizzy that Carla is not coming to get them, as she failed to show up that morning and appears to have started using drugs again. Heartbroken, Lizzy runs away while Pete and Ellie chase her. They catch up and tell her they love her, and eventually the trio reconcile.\nFour months later, the family goes to a new hearing. The judge finalizes Pete and Ellie's adoption of Lizzy, Juan and Lita.", "cast": "Mark Wahlberg as Peter \"Pete\" Wagner\nRose Byrne as Elinore \"Ellie\" Wagner\nIsabela Moner as Lizzy Viara\nGustavo Escobar (Gustavo Quiroz) as Juan Viara\nJulianna Gamiz as Lita Viara\nOctavia Spencer as Karen, one of the social workers, who guide the parents-to-be through the foster care process\nTig Notaro as Sharon, the other social worker, who guide the parents-to-be through the foster care process\nMargo Martindale as Sandy Wagner, Pete's overbearing and goodhearted mother\nJulie Hagerty as Jan, Ellie's mother\nAllyn Rachel as Kim, Ellie's sister\nTom Segura as Russ, Kim's husband\nMichael O'Keefe as Jerry, Ellie's father\nBrittney Rentschler as Linda, Ellie's sister\nJody Thompson as Jim, Linda's husband\nIliza Shlesinger as October, a single woman member of the foster parents support group that wants to adopt an athlete\nGary Weeks and Joy Jacobson as Dirk and Dana, a religious couple that are members of the support group\nHampton Fluker and Randy Havens as Kit and Michael, a couple who are members of the support group\nKenneth Israel and Andrea Anders as David and Jessie, a couple who are members of the support group\nJoan Cusack as Mrs. Howard, the Wagners' lonely neighbor\nValente Rodriguez as Judge Martin T. Rivas, the Adoption Court Judge\nJoselin Reyes as Carla Viara, Lizzy, Juan and Lita's drug-using biological mother\nCarson Holmes as Charlie, one of Lizzy's classmates who has a crush on her\nNicholas Logan as Jacob, the school janitor who has an inappropriate relationship with an underage Lizzy\nEve Harlow as Brenda Fernandez, a young girl with various addictions\nRosemary Dominguez as Mrs. Fernandez, Brenda's adoptive mother\nJavier Ronceros as Mr. Fernandez, Brenda's adoptive father\nCharlie McDermott as Stewart, Pete's co-worker\nErika Bierman as Kylie, one of Lizzy's friends\nLayla Felder as Savannah, one of Lizzy's friends"}