{"_movieID": "201085", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:08:31", "summary": "Crimson Peak is a 2015 American gothic romance horror film directed by Guillermo del Toro and written by del Toro and Matthew Robbins. The film stars Mia Wasikowska, Tom Hiddleston, Jessica Chastain, Charlie Hunnam, and Jim Beaver. The story, set in Victorian era England, follows an aspiring author who travels to a remote Gothic mansion in the English hills with her new husband and his sister. There, she must decipher the mystery behind the ghostly visions that haunt her new home.\nIn 2006, a spec script written by Del Toro and Robbins was sold to Universal Pictures, with Del Toro set to direct. Development was delayed due to scheduling conflicts. The film was described as a \"ghost story and gothic romance\" heavily inspired by other horror films, such as The Haunting, The Innocents and The Shining. Principal photography began at Pinewood Toronto Studios in Toronto, Ontario on February 10, 2014, with additional filming in Hamilton, and ended on May 16 that year. The film was produced by Legendary Pictures and Del Toro's production company, DDY Productions.\nCrimson Peak premiered at Fantastic Fest on September 25, 2015, and was released in the United States on October 16, 2015 in standard and IMAX formats. The film received generally positive reviews from critics, with many praising the production values, performances and direction, but criticized the plot and characters. It grossed $74 million worldwide against its $55 million budget. The film received three nominations at the 21st Empire Awards, including Best Horror. It received nine nominations at the 42nd Saturn Awards, winning three, including Best Horror Film, Best Supporting Actress for Chastain and Best Production Design for Thomas E. Sanders.", "plot": "In Buffalo, New York, 1887, American heiress Edith Cushing, the young daughter of wealthy businessman Carter Cushing, is visited by her deceased mother's black, disfigured ghost who warns her, \"Beware of Crimson Peak.\" In 1901, Edith, a budding author, meets Sir Thomas Sharpe, an English baronet who has come to the United States with his sister, Lucille, to seek investors for his clay-mining invention. Unimpressed with Sharpe's previous failures to raise capital, Cushing rejects Thomas's proposal.\nWhen Thomas and Edith become romantically involved, both Edith's father and her childhood friend, Dr. Alan McMichael, disapprove. Mr. Cushing hires a private detective who uncovers unsavory facts about the Sharpes. Mr. Cushing then bribes the siblings to have Thomas end his relationship with Edith. Thomas, however, sends Edith a note explaining his actions. After Mr. Cushing is brutally murdered, Edith and Thomas marry and return to England. They arrive at Allerdale Hall, the Sharpes' dilapidated mansion in Cumberland, which is steadily sinking into the red clay mine it sits atop. Much to her confusion, Edith finds that Lucille is cold toward her while Thomas is physically distant, their marriage remaining unconsummated.\nGruesome red ghosts begin appearing to Edith throughout the mansion, frightening her. Thomas decides taking her out of the house for fresh air will help her, and has her accompany him to the local post office. There, Edith discovers that Thomas had some connection to an Italian woman. They are snowed in for the night and take the opportunity to finally make love. Lucille angrily lashes out after their return, seemingly upset that Edith and Thomas were together, which disturbs Edith. By the time Thomas mentions that the estate is referred to as \"Crimson Peak\" due to the warm red clay seeping through the snow, Edith is growing weak and coughing up blood.\nEdith explores the mansion and pieces clues together, discovering that Thomas previously married three wealthy women, one of whom was Italian. A ghost lures her to a closet where she discovers wax cylinders on which one of Thomas's previous wives recorded a message, explaining that the Sharpes are poisoning her for her inheritance. Edith realizes she, too, is being poisoned through the tea that Lucille gives her every day and that the siblings have had an incestuous relationship for years. Lucille, the more deranged of the two, also murdered their mother after she had discovered her children's incest, and later the child that had resulted of their relationship. Thomas inherited the family manor that, like many aristocratic estates of the era, is no longer profitable; the Sharpes are virtually penniless. The siblings thus began a \"marriage and murder\" scheme to support themselves and finance Thomas's inventions.\nBack in the United States, Alan learns what Mr. Cushing had uncovered about the Sharpes prior to his death: Thomas's multiple marriages and Lucille's time in a mental institution. He travels to Allerdale Hall to rescue Edith. When Alan arrives, Lucille demands that Thomas kill him. By now, Thomas feels suffocated by Lucille, wants to leave all this behind, and has fallen in love with Edith. Wishing to protect her, he inflicts a non-fatal stab wound to Alan and hides him. Lucille forces Edith to sign a transfer deed granting the Sharpes ownership of her estate and also confesses that she was the one who murdered Edith's father. Edith stabs Lucille and attempts to flee. Thomas burns the transfers and tells his sister that they can leave the house and they can all be together but Lucille realises that he meant Edith will be with them as well. Upset and jealous that Thomas loves Edith (after he promised not to fall in love with any of his wives and only love Lucille) she kills him in a blind rage and then pursues Edith. Aided by Thomas's white ghost, Edith kills Lucille with a shovel, and silently says farewell to her husband's ghost before he vanishes.\nEdith and Alan are rescued by the villagers, whereas Lucille becomes a black ghost, doomed to remain alone in the mansion for all eternity. The beginning of the end credits implies that Edith has written a novel titled Crimson Peak based on her experiences.", "cast": "Mia Wasikowska as Edith Cushing\nSofia Wells as Young Edith Cushing\nJessica Chastain as Lucille Sharpe\nTom Hiddleston as Sir Thomas Sharpe, Bt.\nCharlie Hunnam as Dr. Alan McMichael\nJim Beaver as Carter Cushing\nBurn Gorman as Mr. Holly\nJonathan Hyde as Ogilvie\nLeslie Hope as Mrs. McMichael, Alan's mother\nDoug Jones as the ghosts of Edith's Mother and Lady Beatrice Sharpe\nJavier Botet as the ghosts of Margaret McDermott, Pamela Upton and Enola Sciotti"}