{"_movieID": "39254", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:02:28", "summary": "Real Steel is a 2011 American science fiction sports film starring Hugh Jackman and Dakota Goyo and co-produced and directed by Shawn Levy for DreamWorks Pictures. The film is based on the short story \"Steel\", written by Richard Matheson, which was originally published in the May 1956 edition of The Magazine of Fantasy & Science Fiction, and later adapted into a 1963 Twilight Zone episode. Real Steel was in development for several years before production began on June 24, 2010. Filming took place primarily in the U.S. state of Michigan. Animatronic robots were built for the film, and motion capture technology was used to depict the rodeo brawling of computer-generated robots and animatronics.\nReal Steel was released by Touchstone Pictures in Australia on October 6, 2011, and by Walt Disney Studios Motion Pictures in the United States and Canada on October 7, 2011, grossing nearly $300 million at the box office. It received mixed reviews, with criticism for the formulaic nature of the plot and the fact that elements remained unresolved or were predictable, but also praise for the visual effects, action sequences and acting performances. The film was nominated for the Academy Award for Best Visual Effects at the 84th Academy Awards, but lost to Hugo.", "plot": "In 2020, human boxers are replaced by robots. Charlie Kenton, a former boxer, owns \"Ambush\", but loses it in a fight against a bull belonging to promoter and carnival owner Ricky, who rigged the fight to mess with Charlie as he sees him as a joke, partially because he beat him up the last time they competed for bailing on the bet. Having made a bet that Ambush would win as a result, Charlie now has a debt to Ricky he can't pay—which he runs out on.\nAfter the fight, Charlie learns that his ex-girlfriend died and he must attend a hearing deciding the future of their son, Max Kenton, whom Charlie has had almost zero contact with and complete apathy towards since he was born. There, Max's aunt, Debra, and her wealthy husband, Marvin, request full custody, which Charlie concedes for $100,000, half in advance, on the condition that Charlie retains Max for three months while they are on vacation and the other half when they return. Thereupon, Charlie, Max, and Bailey Tallet, the daughter of Charlie's former boxing coach, acquire the once-famous \"Noisy Boy\", but it is destroyed in a subsequent fight against \"Midas\". As he and Charlie attempt to scavenge parts to make a new robot from a junkyard, Max discovers \"Atom\", an obsolete but intact sparring robot designed to withstand severe damage, and can mirror opponent and handler movements and store them in its memory due to its rare \"shadow function\".\nAt Max's behest, Charlie pits Atom against \"Metro\", whom Atom overcomes. Max programs Noisy Boy's vocal-respond controls in Atom, and convinces Charlie to help him with Atom's fighting move memory, resulting in a series of victories and culminating to being offered a fight in World Robot Boxing against national champion \"Twin Cities\". After reaching the arena, the owner of global champion \"Zeus\" offers to buy Atom, which Max instantly rejects. Charlie disagrees, but eventually takes Max's side. The fight starts with Atom on the attack, but Twin Cities easily takes the offensive and corners Atom. While their opponent has no blind spot, Charlie notices a hitch whenever Twin Cities throws a right jab. Using this, Charlie is able to get Atom out of the corner and eventually win by knockout. Elated by their success, Max challenges Zeus, publicly, with the audience squarely on their side.\nAfter the fight, Ricky and his two henchmen ambush and attacked Charlie for bailing earlier and rob them of their winnings, prompting Charlie to return Max to Debra. This upsets Max, and when Charlie tries convincing him it will be better for Max to live without him, Max says that he always wanted Charlie to fight for him and be there as a father. After Max leaves, Charlie returns to Bailey. While talking with her about the events, the two kiss, revealing their attraction to each other. Persuaded by Bailey, Charlie arranges the challenge offered by Max and convinces Debra to allow Max to witness the fight.\nZeus starts the fight by knocking Atom down with its first punch, but Atom gets up, and Zeus continues its assault, knocking Atom down multiple times. However, each time Atom gets back up, and eventually is able to land its first punch allowing it to survive the first round. Ricky, who had made a bet with a friend of Charlie's of $100,000 that Atom would not last the round, tries to slip away, but is cornered by the fight's bookmakers. The fight continues with Atom landing multiple punches but also getting knocked down many times and recovering each time. Late in the fourth round, Atom's vocal-respond controls are damaged, forcing Charlie to use its visual \"shadow function\" to make it visually mimic his boxing skills. This, and the fact that Zeus starts running out of power from its constant offense, tip the odds in Atom's favor, forcing Zeus' programmer to manually control it, and Max and Bailey both watch Charlie doing what he was meant to do, and are touched by seeing him literally fighting for his son. Zeus gets a sound beating, once even hitting the ground and barely avoiding losing by knockout, but survives the final round and wins the match by the judges' decision. The technologically superior machine remains undefeated, although with the humiliation of being fought to a near-loss, and Atom is hailed as the \"People's Champion\".", "cast": "Hugh Jackman as Charlie Kenton\nDakota Goyo as Max Kenton\nEvangeline Lilly as Bailey Tallet\nAnthony Mackie as Finn\nOlga Fonda as Farra Lemkova\nKarl Yune as Tak Mashido\nKevin Durand as Ricky\nHope Davis as Aunt Debra\nJames Rebhorn as Marvin\nGregory Sims as Bill Panner"}