{"_movieID": "390061", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:51", "summary": "Mark Felt: The Man Who Brought Down the White House is a 2017 American biographical political thriller film directed and written by Peter Landesman, and based on the 2006 autobiography of FBI agent Mark Felt, written with John O'Connor. The film depicts how Felt became the anonymous source nicknamed \"Deep Throat\" for reporters Bob Woodward and Carl Bernstein and helped them in the investigation which led them to the Watergate scandal, which resulted in the resignation of President Richard Nixon.The film stars Liam Neeson, Diane Lane, Tony Goldwyn, and Maika Monroe. It premiered at the Toronto International Film Festival on September 8, and was theatrically released on September 29, 2017, by Sony Pictures Classics. It is also the fourth film on the Watergate scandal following 1989's The Final Days, the 1999 comic retelling Dick including Kirsten Dunst and Michelle Williams sharing the Deep Throat role and the 1976 Academy Award winner All the President's Men including Hal Holbrook as Deep Throat.", "cast": "Liam Neeson as Mark Felt, Audrey's husband and Joan's father, the FBI agent and Deputy Director who became \"Deep Throat\", the anonymous whistleblower who helped expose the Watergate scandal.\nDiane Lane as Audrey Felt, Mark's wife and Joan's mother, a brilliant and troubled wife who shares the burden of Mark's dangerous dilemma about Watergate.\nTony Goldwyn as Ed Miller, Pat's husband, an FBI Intel chief\nMaika Monroe as Joan Felt, Mark and Audrey's daughter\nKate Walsh as Pat Miller, Ed's wife\nJosh Lucas as Charlie Bates, an FBI agent and Felt lieutenant who suspects that Felt is leaking classified information on the Watergate investigation.\nMichael C. Hall as John Dean, the Nixon White House counsel and architect of the Watergate cover-up who was desperate to stop the Washington Post leaks.\nMarton Csokas as Pat Gray, FBI Acting Director\nTom Sizemore as Bill Sullivan, one of Felt's rivals at the FBI\nJulian Morris as Bob Woodward, the Washington Post reporter who teamed with Carl Bernstein to expose the Watergate dealings.\nWendi McLendon-Covey as Carol Tschudy, Felt's secretary\nIke Barinholtz as Angelo Lano, the head of the investigation\nBruce Greenwood as Sandy Smith, Time magazine reporter\nBrian d'Arcy James as Robert Kunkel, an FBI special agent\nNoah Wyle as Stan Pottinger, who prosecuted Felt and other FBI officials for ordering break-ins to search homes of suspected domestic terrorist radicals, without warrants.\nEddie Marsan as Agency Man\nRichard Molina as US Marshal"}