{"_movieID": "138697", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:17", "summary": "Don Jon is a 2013 American romantic comedy-drama film written and directed by Joseph Gordon-Levitt. Produced by Ram Bergman and Nicolas Chartier, the film stars Gordon-Levitt, Scarlett Johansson, and Julianne Moore, with Rob Brown, Glenne Headly, Brie Larson, and Tony Danza in supporting roles. The film premiered under its original title Don Jon's Addiction at the Sundance Film Festival on January 18, 2013, and had its wide release in the United States on September 27, 2013.", "plot": "Jon Martello is a young Italian American and modern-day Don Juan living and working as a bartender in New Jersey, with a short list of things he cares about: \"my body, my pad, my ride, my family, my church, my boys, my girls, my porn.\" Though he has a very active sex life, he is more sexually satisfied by viewing pornography and masturbating, which he claims allows him to \"lose himself.\"\nOn a night out with his two best friends, Bobby and Danny, Jon sees Barbara Sugarman, a young woman from a more affluent background. Although she finds him interesting, she declines his offer for a one-night stand. He tracks her down on Facebook and invites her to lunch. There is mutual attraction, but Barbara insists on a long-term courtship, which proceeds for over a month without sex. She encourages Jon to take night classes to get an office job outside the service industry, and Jon indulges her love for romance movies, which he usually dismisses as unrealistic fantasy. They meet each other's families and Jon's parents love her.\nThe two have sex, but Jon is still dissatisfied. He loves Barbara and considers her body perfect, but still finds pornography more satisfying. While she sleeps, Jon watches pornography. Barbara catches him and is shocked. She prepares to leave Jon, but he denies that he watches pornography and claims it was a joke emailed to him by a friend.\nTheir relationship resumes, with Jon watching pornography primarily outside his apartment, concealing his habit from Barbara. He is caught watching a video on his cell phone before a college class by Esther, a middle-aged woman Jon earlier encountered weeping by herself. Jon politely brushes her off. Barbara continues asserting control, insisting that cleaning his own apartment, a task Jon finds satisfying, is not something she is comfortable with him doing. Barbara checks the browser history on Jon's computer, confronts him with proof that he has continued viewing pornography, then ends their relationship.\nJon tries to return to his old lifestyle, but ends up in a downward spiral. Esther continues reaching out, offering Jon the benefit of her experience. She lends him an erotic video that she believes has a more realistic depiction of sexual relations. He responds by initiating a sexual encounter in her parked car. She persuades Jon to try masturbating without pornography, but he is unable to. She feels the reason he is more satisfied with watching than having sex is that pornography is a one-sided affair. If Jon wants to lose himself, it must be to another person, a mutual experience. Esther reveals that her husband and son died in a car accident. With her, Jon forms an emotional sexual connection.\nJon tells his family about the break-up with Barbara. While they are displeased, his sister Monica states that Barbara was just dating Jon because she knew she could manipulate him. Jon meets with Barbara and apologizes for lying to her about the pornography. Barbara says she asked one thing of him and he failed. Jon replies that she asked many things of him and he could not meet her expectations. As she tells him to never contact her again, he sees how shallow she is and realizes he is better off without her.\nJon begins dating Esther. Even though she is considerably older and neither has any interest in getting married, Jon believes he really understands Esther and that they can get emotionally lost in each other."}