{"_movieID": "438488", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:14", "summary": "Twin Peaks: Fire Walk with Me is a 1992 psychological horror film directed by David Lynch and written by Lynch and Robert Engels. It serves as a prequel to the television series Twin Peaks (1990–1991), created by Mark Frost and Lynch, who were also executive producers. The film revolves around the investigation into the murder of Teresa Banks (Pamela Gidley) and the last seven days in the life of Laura Palmer (Sheryl Lee), a popular high school student in the fictional Washington town of Twin Peaks. The title comes from a poem recited by MIKE and Leland Palmer in the television series:\n Through the darkness of future's past, \n The magician longs to see. \n One chants out between two worlds...\n \"Fire... walk with me.\"\nMost of the television cast reprised their roles for the film; notable exceptions include Lara Flynn Boyle and Sherilyn Fenn, due to scheduling conflicts. Boyle's character Donna Hayward was instead recast with Moira Kelly. Kyle MacLachlan, who starred as Special Agent Dale Cooper in the series, was reluctant to return out of fear of getting typecast, which resulted in a smaller presence in the film than originally planned.\nFire Walk with Me initially received negative reviews in the United States but has been met with a more positive reception in subsequent years, with some critics viewing it as one of Lynch's major works. Although it has long been reported that Fire Walk with Me was greeted at the 1992 Cannes Film Festival with booing and jeers from the audience, co-writer Robert Engels denies that this event ever happened. The film was a box office bomb in the United States, although it fared much better in Japan.", "plot": "FBI Regional Bureau Chief Gordon Cole sends agents Chester Desmond and Sam Stanley to investigate the murder of drifter and teenage prostitute Teresa Banks in the town of Deer Meadow, Washington. The pair are informed about their new assignment through a woman named Lil. On her lapel is a tiny, artificial blue rose, clearly symbolic of something; when Sam asks, Chet simply replies, \"But I can't tell you about that.\" Desmond and Stanley view Teresa's body at the local morgue. They notice that a ring is missing from her finger and a small piece of paper printed with the letter \"T\" has been inserted under one of her fingernails. Later, Desmond discovers Teresa's missing ring under a trailer. As he reaches out to it, he is taken by an unseen force.\nAt FBI headquarters in Philadelphia, Cole and Agent Dale Cooper experience a brief vision of their long-lost colleague Agent Phillip Jeffries. He tells them about a meeting he witnessed involving several mysterious spirits — The Man from Another Place, Killer BOB, Mrs. Chalfont and her grandson. Agent Cooper is sent to Deer Meadow to investigate Desmond's disappearance, but finds no answers.\nOne year later in Twin Peaks, high school homecoming queen Laura Palmer and her best friend Donna Hayward attend school. Laura is addicted to cocaine and is cheating on her boyfriend, the arrogant and ill-tempered jock Bobby Briggs, with the biker James Hurley. Laura realizes that pages are missing from her secret diary, and gives the rest of the diary to her friend, the agoraphobic recluse Harold Smith.\nMrs. Chalfont and her grandson appear to Laura. They warn her that the \"man behind the mask\" is in her bedroom. Laura runs home, where she sees BOB. She rushes outside in terror and is startled to see her father, Leland, emerge from the house. That evening Leland's behavior is erratic and abusive—he accusingly asks her about her romances, then tenderly tells her he loves her.\nLaura has a dream about entering the Black Lodge. Cooper and the Man from Another Place appear in her dream. The Man from Another Place informs Cooper that \"I am the arm\", revealing his identity as MIKE's severed arm, and offers Teresa's ring to Laura, but Cooper tells her not to take it. Laura finds Annie Blackburn next to her in bed, covered in blood. Annie tells Laura to write in her diary that \"the good Dale is in the Lodge and cannot leave\". Laura sees the ring in her hand, but when she wakes up the next morning, it is gone.\nThe next evening, Laura goes to the Roadhouse to meet her drug connections and have sex with strange men. Unexpectedly, Donna shows up. They all go to the Pink Room. Laura discusses Teresa Banks's murder with Ronette Pulaski, and Ronette says that Teresa was trying to blackmail someone. When she sees a topless Donna making out with a stranger, a distraught Laura takes her home and begs Donna not to become like her. The next morning, Philip Gerard, the one-armed man possessed by the repentant demon MIKE, in an attempt to warn Laura about her father and Bob, pulls up alongside Leland's car and shows Teresa's ring to Laura.\nLeland recalls his affair with Teresa. He had asked Teresa to set up a foursome and invite some of her friends, but fled when he discovered Laura was among them. Teresa realized who he was and plotted to blackmail him, and he killed her to prevent his secrets from being revealed. Laura realizes that Mike's ring was the one from her dream, and was also worn by Teresa. The next night, BOB comes through Laura's window and begins to rape her, only to transform into Leland.\nUpset, Laura uses more cocaine and has trouble concentrating at school. When Bobby realizes Laura is only using him to score cocaine, he breaks off their relationship. Laura then breaks up with James and goes to a cabin in the woods for an orgy with Ronette, Jacques and Leo. Leland follows her there and, after attacking Jacques and scaring away Leo, takes Laura and Ronette to an abandoned train car.\nLaura asks Leland if he is going to kill her, but he transforms into BOB, who tells Laura that he intends to possess her. MIKE has tracked the BOB-possessed Leland to the train, but when Ronette tries to let him in, BOB beats her unconscious. Mike manages to throw in Teresa's ring. Laura puts it on, which prevents BOB from possessing her. Enraged, BOB stabs Laura to death. The BOB-possessed Leland places Laura's body in the lake.\nAs her corpse drifts away, the BOB-possessed Leland enters the Red Room, where he encounters MIKE and the Man from Another Place who announce they want their share of \"garmonbozia.\"\nAs Laura's body is found by the Sheriff's department, Agent Cooper comforts her spirit in the Lodge and she sees an angel that had previously disappeared from her bedroom painting."}