{"_movieID": "429351", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:15", "summary": "12 Strong (also known as 12 Strong: The Declassified True Story of the Horse Soldiers) is a 2018 American action war drama film directed by Nicolai Fuglsig and written by Ted Tally and Peter Craig. The film is based on Doug Stanton's non-fiction book Horse Soldiers, which tells the story of U.S. Army Special Forces sent to Afghanistan immediately after the September 11 attacks. The film stars Chris Hemsworth, Michael Shannon, Michael Peña, Navid Negahban, Trevante Rhodes, Geoff Stults, Thad Luckinbill, William Fichtner, and Rob Riggle.\nPrincipal photography began in January 2017 in New Mexico. The film was released in the United States on January 19, 2018 by Warner Bros. Pictures, in standard and IMAX theaters. It received mixed reviews from critics, who praised the cast and action but criticized the by-the-numbers execution and lack of hindsight of the War in Afghanistan.", "plot": "Mitch Nelson, a U.S. Army Captain with Green Berets Operational Detachment Alpha (ODA) 595, is moving into a new home with his wife and daughter on September 11, 2001, after receiving an assignment to staff duty under LTCol. Bowers. As news of the devastating terrorist attacks that day break, Nelson volunteers to lead 595 into Afghanistan. Bowers initially refuses, but veteran soldier CW5 Hal Spencer, previously scheduled to retire, persuades Bowers to give Nelson command of 595 again, as well as volunteering himself for the deployment. After leaving their families, 595 travels to Uzbekistan on October 7, 2001. After being briefed and evaluated by COL Mulholland, Commander of 5th Special Forces Group, Nelson and 595 are picked to fight alongside Northern Alliance leader Abdul Rashid Dostum.\nODA 595 is inserted covertly in Afghanistan aboard an MH-47 Chinook flown by 160th SOAR. They land 40 miles south of Mazar-i Sharif, the country's fourth-largest city and a longtime stronghold of the Taliban, where they meet Dostum. Six of the 12 members, led by Nelson, leave with Dostum to the mountains, while the other six remain in a fortified camp nicknamed \"The Alamo\" under Spencer's command. Dostum is attempting to capture the northern Afghanistan city, while battling Taliban leader Mullah Razzan, who rules local communities brutally under strict Sharia law, and has murdered several people, including Dostum's family. Although the warlord is initially skeptical of Nelson's abilities, Nelson gradually earns Dostum's respect. In one battle, however, Dostum makes a tactical error, costing several casualties. Nelson accuses Dostum of acting carelessly with the lives of his men and of withholding valuable information, while Dostum retorts that he still feels that Nelson, and the U.S., is not willing to pay the potential price of the conflict, and tells Nelson that he needs to use his heart and mind to \"be a warrior\" instead of a soldier. The two eventually reconcile, and, after splitting off a three-man element under SFC Sam Diller to strike a Taliban supply route, and being joined by Spencer's half of ODA 595, continue to work together. They win several victories with Dostum's leadership and manpower and American airpower, making significant progress towards Mazar-i Sharif. Suddenly, however, Spencer informs Nelson that another ODA, 555, has been dispatched to support Atta Muhammad, another Northern Alliance leader, who is Dostum's political rival. When Nelson is forced to tell Dostum, the furious warlord and his men promptly abandon 595.\nFollowing Dostum's departure, Nelson plans to continue operating against the Taliban with his Americans and the few Afghan fighters remaining with them. Encountering a large force of Al-Qaeda and Taliban fighters and armored vehicles, ODA 595, rejoined by Diller and his element, uses air support to eliminate many of the fighters and most of the armor, but are discovered and attacked. Spencer is critically injured by a suicide bomber, and the team is about to be overrun under heavy Taliban and Al-Qaeda pressure when Dostum returns with his forces. Carrying out the US Army’s first cavalry charge of the 21st century, the American and Northern Alliance forces disperse the Taliban and Al-Qaeda, and Dostum tracks down and kills Razzan. After Spencer is medevaced, Nelson and Dostum continue to Mazar-i-Sharif but find Atta Muhammad has beaten them there. Against expectations, Dostum and Muhammad meet peacefully and put aside their differences. Impressed by Nelson and the Americans' efforts, Dostum gives Nelson his prized riding crop and tells him that he will always consider Nelson a brother and fellow fighter but remember that Afghanistan is the graveyard of empires. Spencer ultimately survives, and all 12 soldiers of ODA 595 return home after 23 days of almost continuous fighting in Afghanistan.\nThe film’s penultimate moment shows a photo of the Horse Soldier Statue in New York City, based on the soldiers of ODA 595 and their victory in the early stages of the response to the September 11th attacks, dedicated to all United States Special Forces. The film then ends with a photo of the actual members of ODA 595, in combat fatigues, upon whom 12 Strong was based.", "cast": "Chris Hemsworth as Captain Mitch Nelson, ODA 595’s commander, inspired by Mark Nutsch.\nMichael Shannon as Hal Spencer, a Chief Warrant Officer 5 and ODA 595‘s assistant team leader, inspired by Bob Pennington.\nMichael Peña as Sam Diller, ODA 595’s intelligence Sergeant First Class\nNavid Negahban as General Dostum, a leader of the Northern Alliance and future Vice President of Afghanistan\nTrevante Rhodes as Ben Milo, a Sergeant First Class in ODA 595\nWilliam Fichtner as Colonel Mulholland, Commander of 5th Special Forces Group\nGeoff Stults as Sean Coffers, member of ODA 595\nThad Luckinbill as Vern Michaels, member of ODA 595\nBen O'Toole as Scott Black, member of ODA 595\nKenny Sheard as Bill Bennett, a Sergeant First Class in ODA 595\nAustin Stowell as Fred Falls, a Staff Sergeant in ODA 595\nAustin Hébert as Pat Essex, a Master Sergeant in ODA 595\nJack Kesy as Charles Jones, member of ODA 595\nKenneth Miller as Kevin Jackson, member of ODA 595\nElsa Pataky as Jean Nelson, Mitch's wife (actors Hemsworth and Pataky are married in real life)\nRob Riggle as Lt. Colonel Bowers, Commander of 3rd Battalion, 5th Special Forces Group\nTaylor Sheridan as Brian, a paramilitary field officer with the CIA's Special Activities Division who meets ODA 595 when the SOAR deliver them to Afghanistan\nFahim Fazli as Khaled, a commander in Afghanistan's Northern Alliance\nLaith Nakli as Commander Ahmed Lal\nAli Olomi as Afghan Man"}