{"_movieID": "127585", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:02:36", "summary": "X-Men: Days of Future Past is a 2014 superhero film directed and produced by Bryan Singer and written by Simon Kinberg from a story by Kinberg, Jane Goldman, and Matthew Vaughn. A British-American venture, the film is based on the fictional X-Men characters that appear in Marvel Comics and is the seventh installment of the X-Men film series, the sequel to both X-Men: The Last Stand (2006) and X-Men: First Class (2011), and a follow-up to The Wolverine (2013).  The story, inspired by the 1981 Uncanny X-Men storyline \"Days of Future Past\" by Chris Claremont and John Byrne, focuses on two time periods, with Wolverine traveling back in time to 1973 to change history and prevent an event that results in doom for both humans and mutants. The film features an ensemble cast, including Hugh Jackman, James McAvoy, Michael Fassbender, Jennifer Lawrence, Halle Berry, Anna Paquin, Ellen Page, Peter Dinklage, Ian McKellen, and Patrick Stewart.\nVaughn had directed X-Men: First Class and was set to return in Days of Future Past before leaving for Kingsman: The Secret Service. Thus Singer, who had directed the first two X-Men films, made his return as a director, and brought along most of the crew from those productions. With a budget of $205 million, principal photography began in Montreal, Quebec in April 2013 and concluded in August the same year, with additional filming and pick-ups taking place in November 2013 and February 2014. Twelve companies handled the visual effects.\nX-Men: Days of Future Past premiered in New York City on May 10, 2014, and was theatrically released on May 23 by 20th Century Fox. It is the second-best reviewed film in the X-Men film series following Logan, drawing favorable notices for its story, visual effects, action scenes, acting, thematic elements, and Singer's direction. During its theatrical run, the film earned over $747 million worldwide, making it the sixth highest-grossing film of 2014, as well as the second highest-grossing film in the series behind Deadpool. The film received an Academy Award nomination for Best Visual Effects, making it the first X-Men film to be nominated for an Oscar. A sequel, titled X-Men: Apocalypse, was released on May 27, 2016.", "plot": "In the year 2023 in a dystopian future, Sentinels have been programmed to identify and hunt down mutants and any humans who dared to help them. A small band of X-Men survivors consisting of Kitty Pryde, Iceman, Colossus, Bishop, Blink, Warpath, and Sunspot are hiding out in Moscow, but are soon attacked by Sentinels and slaughtered. During the battle, Kitty Pryde sends Bishop's consciousness back in time a few days before the attack to warn the others in order to ensure their survival.\nThe group later meets with Professor Charles Xavier, Magneto, Wolverine, and Storm at a remote Chinese temple. Xavier explains the history of the Sentinels, which were designed by Bolivar Trask, a military scientist who was assassinated by Mystique in 1973. Alarmed by Trask's death, government forces had captured Mystique and used her DNA to advance Trask's unfinished Sentinel program by giving them the ability to adapt to nearly every mutant power; it was this upgrade that made the Sentinels invincible and resulted in the apocalyptic future. Xavier and Magneto plan to use Pryde's ability to send Xavier's consciousness back to 1973 in order to prevent Trask's assassination and the apocalyptic future, but because Xavier would not survive going back decades, Wolverine volunteers to go in his place because his regenerative powers would allow him to survive the process.\nAfter awakening in his younger body in 1973, Wolverine arrives at the X-Mansion, which he discovers has been closed for years due to many of its staff and students being drafted into the Vietnam War. He also learns that Erik Lensherr was arrested for killing John F. Kennedy and that the young and despairing Xavier had turned to alcoholism, shunning his mutant powers with a specialized serum that suppresses his telepathic abilities in exchange for the ability to walk. Hoping to reunite with Mystique, Xavier agrees to help Wolverine and breaks Lensherr out of his prison cell under the Pentagon, aided by Hank McCoy and the newly-recruited Peter Maximoff.\nLensherr is angry at Xavier for suppressing his powers and not being there for fellow mutants who were sent to Vietnam. Mystique discovers Trask has been experimenting on mutants and in revenge, plots to assassinate him at the Paris Peace Accords. Her attempt fails after Xavier, McCoy, and Wolverine intervene. However, Lensherr attempts to kill her, believing this could prevent the Sentinel takeover from happening. A fight ensues between McCoy and Lensherr, which allows Mystique to escape, but the three expose themselves as mutants to the world. Trask takes advantage of this event and successfully convinces President Richard Nixon to initialize the Sentinel program.\nErik obtains his signature helmet back from the Pentagon to block Xavier's psychic powers and secretly takes control of Trask's Sentinel prototypes. Returning to the X-Mansion, Xavier ultimately abandons the serum, regaining his mutant power, and communicates with his future self, who inspires him to protect the relationship between mutants and baseline humans. After using Cerebro to track Mystique, the young Xavier, McCoy, and Wolverine take flight to Washington, D.C. to put an end to her plot to assassinate Trask.\nAt a ceremony where Nixon unveils the Sentinels, Xavier, McCoy, and Wolverine search for the disguised Mystique. Magneto arrives and uses the Sentinels to barricade the White House with the Robert F. Kennedy Memorial Stadium. During the battle, Magneto throws Wolverine into the Potomac River. Nixon, Trask, and a disguised Mystique retreat to the White House Bunker, but Magneto rips it out of the building, intending to kill the President.\nIn the future, the Sentinels manage to find the X-Men and launch an attack on them. Many perish while attempting to buy more time, including Colossus, Blink, Storm, Bishop, Iceman, and Sunspot, while Magneto and Kitty are heavily injured. In 1973, Xavier persuades Mystique to spare Trask after she saves Nixon from Magneto, altering history and erasing the Sentinels from existence. Magneto and Mystique both leave, one a criminal, the other a hero; while Trask is jailed for attempting to sell U.S. military secrets to Vietnamese officials.\nWolverine wakes up at the X-Mansion in 2023 to find Iceman, Rogue, Colossus, Kitty Pryde, Beast, Storm, Jean Grey, Scott Summers, and Xavier all alive. Wolverine speaks to Xavier, who states that they have a lot to talk about after Wolverine asks Xavier to catch him up on what he has missed. Back in 1973, the younger Wolverine is pulled out of the Potomac River by Mystique, who is disguised as William Stryker.\nIn a post-credits scene, set in Ancient Egypt, an Egyptian crowd is seen chanting to En Sabah Nur, who telekinetically elevates building blocks to build pyramids as four horsemen observe him from afar.", "cast": "Hugh Jackman as Logan / WolverineA mutant with accelerated healing, heightened animal-like senses, and—in 1973—retractable bone claws; in the future, his skeleton and claws are laced with adamantium in his body, making him virtually invulnerable. His healing factor also slows his aging, allowing him to live above the lifespan of an ordinary human.  Jackman noted how Wolverine driving the plot in spite of his gruff personality made for interesting story choices, as \"if you want someone to go back to take someone's head off, fantastic, but he's really got to go back and almost act in parts as inspiration, as mentor, as guide, because he can't do it all on his own, which is always his preferred method\".James McAvoy (younger adult) and Patrick Stewart (adult) as Charles Xavier / Professor XA mutant pacifist and the world's most powerful telepath. He is also a founder of Xavier's School for Gifted Youngsters, and leader of the X-Men. Singer described the younger Xavier as \"a very different beast from First Class's feckless playboy. He's a wounded animal, bearded, long-haired, filled with rage at the way the world has treated him\". Kinberg said the film was intended to be the story of the younger Xavier beginning to \"become the Professor Xavier we know\" as Wolverine mentored him.Michael Fassbender (younger adult) and Ian McKellen (adult) as Erik Lehnsherr / MagnetoA powerful mutant who can manipulate magnetic fields. While he dissents with Xavier due to a wish to prove mutantkind's superiority, they revert to being allies as adult Erik helps the X-Men battle against Sentinels in the future.Jennifer Lawrence as Raven Darkhölme / MystiqueA mutant with the shapeshifting ability, and also Xavier's childhood friend and adopted sister. Singer said Mystique \"is less innocent, evolved, getting closer to where Mystique was in X-Men 2\". Lawrence had suffered skin irritations from the full body make-up used in First Class, and the process was changed so from the neck down it would be a bodysuit,  whose zipper was digitally removed in post-production. As a result, the make-up process was reduced from eight hours to three. The make-up team at Legacy Effects sculpted Mystique's scales digitally, making them shorter in size and placed in a way that they would accentuate Lawrence's face.Halle Berry as Ororo Munroe / StormA mutant who can manipulate weather and one of the most battle-tested and powerful X-Men. Asked if her pregnancy affected her role, Berry replied, \"I wasn't in as much as I was meant to be. My ever-growing belly was posing a constant challenge! What I could do was getting more limited so the role that I play is so different from what it could have been, due to my surprise pregnancy\". According to Kinberg, Berry had another scene in the film that was cut because of Berry's limited schedule.Nicholas Hoult (younger adult) and Kelsey Grammer (adult; uncredited) as Dr. Hank McCoy / BeastA mutant with super-strength, agility, reflexes and enhanced speed. Hoult plays the character in scenes set in 1973 while Grammer makes a cameo appearance as Beast in the future setting. The cameo was added because the writers felt Hoult's Beast was \"such a sweet, young character\" that audiences would want to learn he survived. Once Grammer learned of this opportunity to return as Beast, a character he had enjoyed playing in The Last Stand, he called Singer asking to get involved, and was flown from New York in secret to avoid drawing attention.Anna Paquin as Marie / RogueA mutant who can absorb the life force and mutant abilities of anyone she touches. Kinberg wrote a shorter part for Paquin than initially planned because she did not have much time to be on-set. During post-production, Paquin's role was reduced to a cameo after most of her scenes were cut; these scenes were later restored on an alternate version of the film, which was released to home media. According to Kinberg, Rogue was to be rescued by the future Magneto and Xavier to provide the elder characters a mission, \"something like Unforgiven\". Eventually the producers felt it was a subplot that did \"not service the main story\", and reshot scenes to replace them. However, she was still featured in the film's various promotional materials. Paquin later stated that she still had fun making the film and did not mind that the majority of her scenes had been cut from it.Ellen Page as Kitty PrydeA mutant who can pass through solid objects. As the youngest member of the X-Men, she plays an important role in their fight for survival. Singer described Pryde as the prime facilitator and that Pryde's phasing ability enables time-travel to happen. Kinberg, when asked why Pryde is not the time-traveler in the film adaptation of the comic-book story, said, \"[If] we tried to follow the original and use Kitty, we had a problem because Ellen is 25 years old and she'd be -20 in the First Class era\".Peter Dinklage as Bolivar TraskA military scientist and the head of Trask Industries who creates a range of robots called Sentinels, designed to find and destroy mutants. Dinklage said Trask \"sees what he's doing as a good thing—[his ambition is] definitely blind and he's quite arrogant. He has striven all his life for a certain respect and attention\". He also said Trask is opposed by Richard Nixon. Singer said he is a fan of Dinklage and of the television series Game of Thrones in which Dinklage stars as Tyrion Lannister, which inspired him to cast Dinklage.Shawn Ashmore as Bobby Drake / IcemanA mutant who can create and manipulate ice. Ashmore said about his role, \"In the first X-Men I had to make a rose for Rogue but that was the extent of the character, so it's cool to see over these four movies going from that to X2—where you sort of see him do an ice wall—and in X3 he finally gets to battle, and in Days of Future Past we're soldiers\".Omar Sy as BishopA mutant who can absorb energy and redirect it in kinetic blasts. Singer said Bishop, along with Warpath, Sunspot and Blink, are not fresh recruits. He said, \"they're more refugees that are living day to day in this hideously ruined world. They don't have much hope in the future. They're on the run and they join forces with the remaining X-Men to try to do this one last attempt at fixing the world\".Evan Peters as Peter Maximoff / QuicksilverA mutant who can move, speak and think at supersonic speeds. Peters described Quicksilver as \"very fast, he talks quick, he moves quick. Everything else is very slow compared to him, it's like he's always at the ATM waiting for the bastard in front of him to finish\".Josh Helman as Major William StrykerA military officer who hates mutants. Helman was originally chosen to play a younger version of Juggernaut before that character was removed from the script. Brian Cox, who portrayed adult Stryker in X2, appears in archive footage.Daniel Cudmore as Peter Rasputin / ColossusA mutant who can transform his body into organic steel, which grants him superhuman strength, stamina, and durability while in that form. Cudmore was asked whether he trained for his role, he replied, \"I didn't have a ton of time to get film ready for this. A trainer friend of mine from Vancouver put together a quick little workout program for me. Since the role was for Colossus, I was aiming to bulk up a bit and get stronger. I ended up eating a lot more. Because of how much I was eating, I had to eat every 2-3 hours to keep my calories up\".Fan Bingbing as BlinkA mutant who has the ability to create portals to teleport. Fan said the film was the first of a five X-Men movie contract she signed with 20th Century Fox.Adan Canto as SunspotA mutant with an ability to project solar energy, create flames and possesses solar-powered strength and flight. To prepare for the role, Canto researched Sunspot because when he was cast, he did not know the level of involvement his character has in the film.Booboo Stewart as WarpathA mutant and expert tracker with super agility, reflexes, acute senses and enhanced strength. In preparation for the role, Stewart gained 50 pounds and grew his hair much longer than its usual length.Additionally, Famke Janssen and James Marsden reprise their roles as Jean Grey and Scott Summers / Cyclops respectively in cameo appearances. Lucas Till reprises his role as Alex Summers / Havok. Evan Jonigkeit portrays Toad. Gregg Lowe portrays Ink. X-Men comic-book writers Len Wein and Chris Claremont appear as United States congressmen. Michael Lerner plays Senator Brickman. Mark Camacho portrays U.S. President Richard Nixon. Singer cameos as a man with a small film camera as Magneto walks away after Mystique's escape in Paris. In a post-credits scene, Brendan Pedder portrays the ancient mutant, En Sabah Nur."}