{"_movieID": "49013", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:44:02", "summary": "Cars 2 is a 2011 American 3D computer-animated action-adventure comedy film produced by Pixar Animation Studios for Walt Disney Pictures. It is the sequel to 2006's Cars, and features the voices of Owen Wilson, Larry the Cable Guy, Michael Caine, Emily Mortimer, John Turturro, and Eddie Izzard. In the film, race car Lightning McQueen and tow truck Mater head to Japan and Europe to compete in the World Grand Prix, but Mater becomes sidetracked with international espionage. The film was directed by John Lasseter, written by Ben Queen, and produced by Denise Ream. This was also the final film directed by Lasseter prior to his exit from Disney in 2018.Cars 2 was released in the United States on June 24, 2011. The film was presented in Disney Digital 3D and IMAX 3D, as well as traditional two-dimensional and IMAX formats.\nThe film was first announced in 2008, alongside Up, and Brave, and it is the 12th animated film from the studio. It received mixed reviews from critics (becoming the first Pixar film to receive mixed reviews) and grossed $562 million worldwide. A sequel, Cars 3, was released on June 16, 2017, which was better received than Cars 2.", "plot": "Finn McMissile, a British spy, infiltrates an oil rig owned by a group of lemon cars to rescue a fellow spy. He witnesses the lemons, seemingly led by Professor Zündapp, load an electromagnetic pulse emitter, disguised as a camera onto a shipping crate. After being discovered, he flees and fakes his death.\nLightning McQueen, now a four-time Piston Cup champion, returns to Radiator Springs. However, Italian formula race car, Francesco Bernoulli, challenges McQueen to the newly created World Grand Prix, led by its creator, Sir Miles Axlerod. McQueen and his best friend Mater — along with Luigi, Guido, Fillmore, and Sarge — depart for Tokyo for the first race of the Grand Prix.\nAt a World Grand Prix promotional event, Mater makes a scene after leaking oil and eating a bowl of Wasabi, angering McQueen. While cleaning up, Mater interrupts a fight between American spy Rod \"Torque\" Redline (whom McMissile and his new partner Holley Shiftwell attempt to meet) and lemons Grem and Acer. Redline passes his information to Mater, whom Holley mistakes as a spy. Meanwhile, Redline is captured and killed by Professor Zündapp and the other lemons. Zündapp informs his superior, an unknown mastermind, that Redline passed on his information.\nAt the first race, three cars are ignited by the camera. McQueen places second in the race after Bernoulli, due to Mater accidentally giving him bad racing advice while evading Zündapp's henchmen with help from Holley and Finn. McQueen snaps at Mater, who is abducted by Finn while attempting to return to Radiator Springs. After traveling to Paris to collect more information from Finn's old friend Tomber, they travel to Porto Corsa, Italy, where the next race is being held. During the race, Mater infiltrates the criminals' meeting, just as the camera is used on a few more cars, causing a multi-car pileup, while McQueen finishes first. Due to increased fears over Allinol's safety, Axlerod lifts the requirement to use it for the final race. However, when McQueen decides to continue using it, the criminals plot to kill McQueen in the next race in London. This spooks Mater, causing him to blow his cover and allow him, Finn, and Holley to be captured.\nMater, Finn, and Holley are taken to and tied up inside Big Ben. Mater learns that the camera did not function on McQueen, but the criminals tell him they planted a bomb in his pits as a backup plan, spurring him to break free and escape. Finn and Holley escape soon after, but realize that the bomb is on Mater's air filter. Mater has already arrived at the pits when they tell him this, so he flees down the race course while McQueen chases after him. Finn apprehends Professor Zündapp, while he attempts to escape. The other lemons arrive and outnumber Finn, Holley, Mater, and McQueen, but they are soon rescued by the arrival of the other Radiator Springs residents. Mater then uses evidence he has seen to reveal that Axlerod is the mastermind of the plot who placed the bomb on Mater. Mater forces Axlerod to deactivate the bomb, and he and the other lemons are arrested.\nMater receives an honorary knighthood from the Queen, while Sarge reveals that he changed McQueen's fuel from Allinol (which, it turns out, is only gasoline) to Fillmore's organic biofuel, explaining why the camera did not work on him. Finn and Holley ask if Mater can join them on another mission, but he politely declines, and then participates with the World Grand Prix competitors in a race at Radiator Springs."}