{"_movieID": "364067", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:53:58", "summary": "A Very Murray Christmas is a 2015 American Christmas musical comedy film directed by Sofia Coppola and co-written by Bill Murray, Mitch Glazer, and Coppola. The film features an ensemble cast including Bill Murray, George Clooney, Paul Shaffer, Amy Poehler, Julie White, Dimitri Dimitrov, Michael Cera, Chris Rock, David Johansen, Maya Rudolph, Jason Schwartzman, Jenny Lewis, Rashida Jones, and Miley Cyrus and was released on December 4, 2015, on Netflix.\n\n", "plot": "On Christmas Eve, Bill Murray waits in his suite at the Carlyle Hotel, gradually realizing that a massive snowstorm has caused most of the guests for his live Christmas special to cancel. As time runs out, his two producers, Liz (Amy Poehler), and Bev (Julie White), coerce him into going on with the show, as he is financially on the hook if he cancels. With minimal crew, Murray goes live; but in the middle of singing a song, he begins to weep and then flees the studio. While trying to leave the hotel, he sees Chris Rock, whom he forces into performing \"Do You Hear What I Hear?\" with him. During a power outage, Rock flees, and the producers inform Murray that as the power outage is considered an Act of God, the special can now be cancelled.\nFilled with relief, Murray goes to the Carlyle bar, where he sings a song with an anonymous waitress (Jenny Lewis). After they hear the chefs shouting, they go to investigate, and realize that the French chefs (Phoenix) are overwhelmed, as the fridges have stopped working and the food is about to go bad. Murray encourages them to bring the food to the bar, so that the few patrons can eat it all. On his way back to the bar, he passes a weeping bride (Rashida Jones), who informs him that her wedding was called off due to the cold, and who is also upset because she has fought with her fiancé, Elliot (Jason Schwartzman).\nThe French chefs sing \"Alone on Christmas Day\", followed by the lounge singer (Maya Rudolph) performing \"Christmas (Baby Please Come Home)\". Afterwards, the bride comes out wheeling a cake, and asks Murray about his theory of love. He asks Elliot and the bride to look at one another and think of the exact instant they knew they were in love with each other. The couple sing \"I Saw the Light\", and become re-engaged. At 12:01 am the remaining guests at the hotel wish each other a merry Christmas, and then sing \"Fairytale of New York\" together. At the end of the song, Murray, who had been drinking heavily, passes out.\nWhile unconscious, Murray dreams that he awakens on a beautiful set in the middle of his Christmas special. In his dream, he is joined by George Clooney and Miley Cyrus. As Clooney prepares martinis, Cyrus and Murray sing \"Sleigh Ride\" together. After a few more musical numbers between himself, Cyrus and Clooney, Murray reawakens in his suite at the Carlyle, where he realizes it is still Christmas."}