{"_movieID": "49538", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:02:45", "summary": "X-Men: First Class (stylized on-screen as X: First Class) is a 2011 superhero film based on the X-Men characters appearing in Marvel Comics. The fifth installment in the X-Men film series, it was directed by Matthew Vaughn and produced by Bryan Singer. The film is set primarily in 1962 during the Cuban Missile Crisis, and focuses on the relationship between Professor Charles Xavier (James McAvoy) and Erik Lehnsherr/Magneto (Michael Fassbender), and the origin of their groups—the X-Men and the Brotherhood of Mutants, respectively, as they deal with the Hellfire Club led by Sebastian Shaw (Kevin Bacon), who is bent on world domination. The film co-stars Rose Byrne, January Jones, and Oliver Platt, and also introduces Nicholas Hoult and Jennifer Lawrence, who, like McAvoy and Fassbender, reimagine popular characters from the franchise (Beast and Mystique) already established in the original trilogy.\nProducer Lauren Shuler Donner first thought of a prequel based on the young X-Men during the production of X2; producer Simon Kinberg later suggested to 20th Century Fox an adaptation of the comic series X-Men: First Class, although the film does not follow the comic closely. Singer, who had directed both X-Men and X2, became involved with the project in 2009, but he could only produce and co-write First Class due to his work on other projects. Vaughn, who was previously attached to both X-Men: The Last Stand and Thor, became the director, and also wrote the final script with his writing partner Jane Goldman. First Class replaced a Magneto prequel film that had been in development, but had entered development hell; the Writers Guild of America arbitration gave a story credit to Magneto writer Sheldon Turner. Principal photography began in August 2010 and concluded in December, with additional filming completed in April 2011. Locations included Oxford, the Mojave Desert and Georgia, with soundstage work done in both Pinewood Studios and the 20th Century Fox stages in Los Angeles. The depiction of the 1960s drew inspiration from the James Bond films of the period.\nFirst Class premiered on Ziegfeld Theatre on May 25, 2011, and was released in the United States on June 3, 2011. It was a box office success, becoming the seventh highest-grossing in the film series, and received positive reviews from critics and audiences, who praised its acting, screenplay, direction, action sequences, visual effects, and musical score. The film's success re-popularized the X-Men film franchise with various installments following, including a number of sequels focusing on younger iterations of the X-Men characters, with X-Men: Days of Future Past (2014), X-Men: Apocalypse (2016), and Dark Phoenix (2019).", "plot": "In 1944, in a Nazi death camp, Nazi scientist Klaus Schmidt witnesses young prisoner Erik Lehnsherr bending a metal gate with his mind when he is separated from his parents. In his office, Schmidt orders Lehnsherr to move a coin on his desk, and kills the boy's mother when Lehnsherr fails to do so. In grief and rage, Lehnsherr's magnetic power manifests, killing two guards and destroying the room. Meanwhile, in a mansion in Westchester County, New York, child telepath Charles Xavier meets young shapeshifter Raven, whose natural form is blue-skinned and scaly. Overjoyed to meet someone \"different\", like himself, he invites her to live with his family as his foster sister.\nIn 1962, Lehnsherr is tracking down Schmidt for vengeance, while Xavier graduates from the University of Oxford. In Las Vegas, CIA officer Moira MacTaggert follows U.S. Army Colonel Hendry into the Hellfire Club, where she sees Schmidt—now known as Sebastian Shaw—with mutant telepath Emma Frost, cyclone-producing Riptide, and teleporter Azazel. Threatened by Shaw and teleported by Azazel to the Joint War Room, Hendry advocates deployment of nuclear missiles in Turkey. Shaw, an energy-absorbing mutant whose powers have de-aged him, later kills Hendry.\nMacTaggert, seeking Xavier's advice on mutation, takes him and Raven to the CIA, where they convince Director McCone that mutants exist and Shaw is a threat. Another CIA officer sponsors the mutants and invites them to the secret \"Division X\" facility. MacTaggert and Xavier find Shaw as Lehnsherr is attacking him on his yacht, and rescue Lehnsherr from drowning, while Shaw escapes in a submarine. Xavier brings Lehnsherr to Division X, where they meet young scientist Hank McCoy, a mutant with prehensile feet, who believes Raven's DNA may provide a \"cure\" for their appearance. Xavier uses McCoy's mutant-locating device Cerebro to seek recruits against Shaw. Xavier and Lehnsherr recruit stripper Angel Salvadore, cabbie Armando Muñoz, Army prisoner Alex Summers, and conceited runaway Sean Cassidy.\nWhen Frost meets with a Soviet general in the USSR, and uses her telepathic powers to pretend to have sex with him, Xavier and Lehnsherr capture Frost and discover that Shaw intends to start World War III that will trigger mutant ascendancy and the extinction of the human race. Azazel, Riptide and Shaw attack Division X, killing everyone but the mutants, whom Shaw invites to join him. Salvadore accepts; and when Summers and Muñoz retaliate, Shaw kills Muñoz. In Moscow, Shaw compels the general to have the USSR install missiles in Cuba. Wearing a helmet that blocks telepathy, Shaw follows the Soviet fleet in a submarine to ensure the missiles break a US blockade.\nRaven, thinking McCoy is attracted to her in her natural form, tells him not to use the cure. When she later attempts to seduce Lehnsherr by taking the forms of various women, Lehnsherr tells her she is beautiful as she is, in her natural mutant form which makes her contemplate naturism. McCoy uses the cure on himself but it backfires, giving him blue fur and leonine aspects. With McCoy piloting, the mutants and MacTaggert take a jet to the blockade line, where Xavier uses his telepathy to influence a Soviet sailor to destroy the ship carrying the missiles, and Lehnsherr uses his magnetic power to lift Shaw's submarine from the water and deposit it on land. During the ensuing battle, Lehnsherr seizes Shaw's helmet, allowing Xavier to immobilize Shaw. Lehnsherr tells Shaw he shares Shaw's exclusivist view of mutants but, to avenge his mother, kills Shaw—over Xavier's objections—by forcing the Nazi coin from his childhood through Shaw's brain, causing massive pain to Xavier in the process.\nFearing the mutants, both fleets fire missiles at them, which Lehnsherr turns back in mid-flight. MacTaggert tries to stop Lehnsherr by shooting him but he deflects the bullets, one of which hits Xavier in the spine. Lehnsherr rushes to help Xavier and, distracted, allows the missiles to fall harmlessly into the ocean. Parting with Xavier over their differing views on the relationship between mutants and humans, Lehnsherr leaves with Salvadore, Azazel, Riptide and Mystique. Later, Xavier – now using a wheelchair – and his mutants are at the X-Mansion, where he intends to open a school. MacTaggert promises never to reveal his location and they kiss. When they kiss, Xavier uses his powers and erases their memories from her mind. Elsewhere, Lehnsherr, now wearing Shaw's helmet, frees Frost from confinement alongside Raven and introduces himself as \"Magneto\".", "cast": "James McAvoy as Charles Xavier / Professor X:The telepathic mutant leader and founder of the X-Men. He is a close friend of Erik Lehnsherr until their differing views of mutantkind's place in humanity create a schism between them. McAvoy was Vaughn's top choice for Xavier, and, after being cast, auditioned with every actor considered for Magneto to test the duo's chemistry. McAvoy said he did not read comic books as a child, but added that he was a fan of the X-Men animated series from the age of 10. While he describes the older Charles Xavier as \"a monk ... a selfless, egoless almost sexless force for the betterment of humanity and mortality\", he says that the younger Xavier is a very different person: \"It's quite fun because the complete opposite of that is an ego-fueled, sexed up self-serving dude. And not going too far with it, but he's definitely got an ego and he's definitely got a sex drive as well.\" McAvoy admitted to feeling similarities between Xavier/Magneto and Martin Luther King Jr./Malcolm X, stating that the film was \"sort of like meeting them at a point where they are still finding out who they are and you are still seeing some of the events that shaped them.\" McAvoy avoided doing any callbacks to Patrick Stewart's performance as Xavier as Vaughn told him and Michael Fassbender to only take the allusion to Xavier and Magneto's old friendship in the other movies as inspiration. Vaughn stated that since he considered that Professor X was \"a bit of a pious, sanctimonious boring character, and he's got too much fucking power\", the script would make young Xavier more interesting by \"making him more of a rogue\" who would become more responsible as his mission of finding more mutants went on.Laurence Belcher as young Charles XavierMichael Fassbender as Erik Lehnsherr / Magneto:A mutant capable of manipulating and generating electromagnetic fields. He becomes Xavier's friend and ally until their philosophical differences create a schism between them. Fassbender had auditioned for an earlier Matthew Vaughn project, and the director had remembered him and sent Fassbender the X-Men script. Though Fassbender knew little of the superhero team, he became interested in the part after reading the script and familiarizing himself with Magneto in the comic books. Fassbender, who considered Lehnsherr as a Machiavellian character who is neither good nor evil, watched Sir Ian McKellen's performances to get the flavor of Magneto, but ultimately chose to \"paint a new canvas\" with the character, \"just going my own way and working with whatever is in the comic books and the script.\" Vaughn said Lehnsherr \"is straight up cool; he's Han Solo while Professor X is Obi-Wan Kenobi\".Bill Milner plays young Erik Lehnsherr, although archived footage of Brett Morris, who previously played the same character at the same age, was reused for the beginning.Rose Byrne as Moira MacTaggert:A CIA agent who befriends Xavier and Lehnsherr. Byrne said she was unfamiliar with both the comics and the film series, except for \"what a juggernaut of a film it was\". The actress was cast late into production, which had already begun by the time she was picked for the role. MacTaggert was described by Byrne as \"a woman in a man's world, she's very feisty and ambitious—you know, she's got a toughness about her which I liked\".Jennifer Lawrence as Raven Darkhölme / Mystique:A shape-shifting mutant who is Charles Xavier's childhood friend and adoptive sister who joins Erik's Brotherhood of Mutants and Hank’s love interest. After the dramatic Winter's Bone, Lawrence sought First Class to do \"something a little lighter\". Despite having not seen any of the X-Men films, the actress watched them and became a fan, which led her to accept the role as well, as did the prospect of working with Vaughn, McAvoy and Fassbender. Vaughn said Lawrence was picked because \"she could pull off the challenging dichotomy that Raven faces as she transforms into Mystique; that vulnerability that shields a powerful inner strength.\" Lawrence had some reservations about her performance due to Mystique's previous portrayal by Rebecca Romijn, as she considered Romijn to be \"the most gorgeous person in the world\", and felt their portrayals were very contrasting, feeling hers was \"sweet and naive\" while Romijn was \"sultry and mean\". The actress went on a diet and had to work out for two hours daily to keep in shape, and for Mystique's blue form, Lawrence had to undergo an eight-hour make-up process similar to that of Romijn on the other films. The first day with make-up even caused blisters to appear on Lawrence's upper body.Morgan Lily as young Raven Darkhölme: with the actress wearing a slip-on bodysuit and facial appliances which only took one hour and a half to apply, as subjecting a child actor to the extensive make-up was impractical.\nRebecca Romijn as older Raven Darkhölme: a brief uncredited cameo, which Vaughn added as an in-joke—the script has Raven \"becom[ing] Brigitte Bardot or Marilyn Monroe, like an older sex icon of those times\".January Jones as Emma FrostAn extremely strong mutant telepath who can also change her entire body into hard diamond form which grants her superhuman strength, stamina, psionic immunity, and durability, at the cost of using her telepathic abilities. She is a member of the Hellfire Club. Prior to Jones' casting, Alice Eve was the subject of what Variety called \"widespread Internet reports\" that Eve \"was set to play Emma Frost, although no deal was in place.\" Jones accepted the role to get something different from her job in the TV series Mad Men. While discovering that like the show First Class was set in the 1960s, the actress considered that: \"[Frost]'s so, so far from Betty and from Mad Men, and it takes place in that time but it doesn't feel like a period movie.\" The actress described the revealing costumes of the character as \"insane,\" saying, \"She's got quite the bod, which is very intimidating\". The actress stated that she did only a limited exercise routine to keep in shape, as \"I'm a petite person, so I didn't want to go into a strict workout and eating regime.\"Nicholas Hoult as Hank McCoy / Beast:A genius scientist who has mutant abilities similar to those of the great apes. He attempts to cure himself of what he believes to be physically debilitating aspects of his mutation only to be transformed into a frightening-looking blue-furred apeman with leonine attributes. Despite his new appearance, he is kind and caring at heart. Broadway actor Benjamin Walker was previously cast as Beast, but eventually turned down the role to star in the Broadway musical Bloody Bloody Andrew Jackson. Hoult was chosen for being \"gentle with a capability of being fierce\", and admitted to being both an X-Men fan and enthusiastic on both returning to the action genre after 2010's Clash of the Titans and working with the film's cast. The actor had to use makeup that took four hours to apply when Hank becomes the Beast, which include a mask, contact lenses, a furry muscle suit and fake teeth. As Vaughn wanted Beast to look more feral than the version Kelsey Grammer played in X-Men: The Last Stand, the redesign went through various tests, which tried to make Beast not resemble any particular animal but still look like Hoult, as well as with a furry body, which makeup artist Alec Gillis of Amalgamated Dynamics likened to \"something akin to a wolf's pelt on his face, his arms—everywhere\". The suits employed actual dyed fur from fox pelts.Oliver Platt as Man In Black Suit:A CIA agent and head of Division X, a government agency working with the X-Men. Vaughn had considered his friend Dexter Fletcher for the part, but the studio felt the cast had too many British actors, and Fletcher himself declined, to direct Wild Bill.Jason Flemyng as Azazel:A mutant who has the ability to teleport, and is also a member of the Hellfire Club. Flemyng, who had previously been considered for Beast in The Last Stand, said he did not want more make-up heavy roles after playing Calibos in Clash of the Titans, but made an exception for Azazel as he liked working with Vaughn. Due to the Cold War setting, Flemyng tried to imply that Azazel is Russian to partly explain his pleasure in killing CIA agents. The actor spent eight weeks with fight training, particularly with swords, and had to undergo a four-hour make-up process, which like Mystique was designed by Spectral Motion—but did not include Azazel's tail, which was computer-generated. Shuler Donner considered that the problems with the shade of red on Azazel's skin—\"some looked like the Devil, some like a man wearing red paint\"—was overcome by adding scars that made him more human, eyes brighter than Flemyng's own, and \"a black mane of hair that seemed to tie everything in\".Lucas Till as Alex Summers / Havok:A mutant who has the ability to absorb energy and discharge it as blasts. The producers told Till his audition served for both Havok and Beast, and the actor replied that despite his lifelong dream of playing a superhero, \"I know you'll kill me, but if I get Beast, I'm not in the movie. I'm not going through that makeup everyday [sic].\"Edi Gathegi as Armando Muñoz / Darwin:A mutant with the ability of \"reactive evolution.\" Gathegi became interested in a role in the X-Men films after seeing X2, and had previously auditioned for Agent Zero in X-Men Origins: Wolverine. He read for Banshee while auditioning for First Class, and only learned he was playing Darwin a few days prior to the shoot. Gathegi worked out and entered an eating regime to get in shape, and also researched the comics about his character. All of Darwin's transformations—getting gills, turning his skin into concrete—were done through computer graphics, with a computer-generated version of Gathegi that could seamlessly blend in and out of the human form.Kevin Bacon as Sebastian Shaw:(also known as Dr. Klaus Schmidt) A former mutant Nazi scientist and the leader of the Hellfire Club, a secret society bent on taking over the world. He has the power of absorbing and redirecting kinetic and radiated energy. Producer Lauren Shuler Donner said Bacon was considered for Shaw for being an actor who could convey a villain \"with different shades, that's not always clear that he's the bad guy\". Vaughn added that Bacon \"had that bravado that Shaw needed\", while stating that the actor was his top choice along with Colin Firth. Bacon accepted the role as he was a fan of Vaughn's Kick-Ass, and liked both the character of Shaw and the script, which he described as \"a fresh look at the franchise, but also the comic book movies in general\". The actor considered that Shaw was a sociopath to whom \"the morality of the world did not apply\", with producer Simon Kinberg adding that Bacon portrayed him as \"somebody, who in his mind, is the hero of the movie\". Bacon also said that, \"aside from the kind of evil side, I portrayed him as kind of a Hugh Hefner type\". Vaughn discarded Shaw's look from the comics as he felt he would \"look like an Austin Powers villain\".Caleb Landry Jones as Sean Cassidy / Banshee:A mutant capable of emitting incredibly strong ultrasonic screams, sonic blasts, sonic bursts, and sonic waves used in various ways including as a means of flight. Jones auditioned without knowing what X-Men character he was up for, saying he auditioned because it was a superhero that fit his biotype: \"I've got red hair and freckles, I'm not gonna be Batman, Robin or Spider-Man\". The actor also stated that the script defined the character more than the comics, as Banshee went through various reinventions in print. Given Banshee gets involved with MacTaggert in the comics, Jones also tried to \"look at her just a little bit differently, you know, when I can.\" As Jones suffers from acrophobia, using the rig that was to depict Banshee's flight required much preparation time with the stunt team.Zoë Kravitz as Angel Salvadore:A mutant with dragonfly wings which are tattooed on her body and possesses acidic saliva. The make-up team took four hours to apply Angel's wing tattoo on Kravitz, and the visual effects team had to erase the tattoo in case the scene required Angel with the computer-generated wings. To depict flight, Kravitz stood on elevated platforms and was dangled on wires, at times from a helicopter to allow for varied camera angles.Matt Craven as CIA Director McCone:A director of the CIA.Álex González as Janos Quested / Riptide:A silent mutant member of the Hellfire Club, with the ability to create powerful whirlwinds from his hands and body. First Class marks the first English-language film for González, who auditioned while taking English classes in London. He enjoyed playing a villain as most of his film roles in Spain were for \"good guys\", and compared Riptide's respectable and polite personality, which can suddenly be dropped to perform fierce attacks, to a hurricane; in a translation of a Portuguese-language interview, he is quoted as saying, \"When I see a hurricane from far, it is calm. The only thing I can see is a kind of tube. But from inside, up close, it is really dangerous.\"Rade Šerbedžija as Russian GeneralA high-ranking Soviet military official during the early 1960s.Glenn Morshower as Colonel HendryA US Army officer coerced by the Hellfire Club.Other cast members include Annabelle Wallis as Amy, a young woman with heterochromia; Don Creech as CIA Agent Stryker, father of Major William Stryker (a character who appears in X2, X-Men Origins: Wolverine, X-Men: Days of Future Past, and X-Men: Apocalypse); Michael Ironside; Ray Wise; James Remar; Brendan Fehr; and Aleksander Krupa also portrayed small roles in this film. Hugh Jackman reprises his role as Logan / Wolverine in an uncredited cameo in a bar, dismissing an approach by Xavier and Lehnsherr to join them. Jackman said he accepted the offer to appear because \"it sounded perfect to me\", particularly for Wolverine being the only character with a swear word. X-Men creator Stan Lee, who appeared in the first and third movie and regularly cameos in other  Marvel-based movies, explained that he was unable to participate in First Class because \"they shot it too far away\"."}