{"_movieID": "5332", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:40", "summary": "Dancing at Lughnasa  is a 1990 play by dramatist Brian Friel set in Ireland's County Donegal in August 1936 in the fictional town of Ballybeg. It is a memory play told from the point of view of the adult Michael Evans, the narrator. He recounts the summer in his aunts' cottage when he was seven years old.", "plot": "The five Mundy sisters (Kate, Maggie, Agnes, Rosie, and Christina), all unmarried, live in a cottage outside of Ballybeg. The oldest, Kate, is a school teacher, the only one with a well-paid job. Agnes and Rose knit gloves to be sold in town, thereby earning a little extra money for the household.  They also help Maggie to keep house. Maggie and Christina (Michael's mother) have no income at all. Michael is seven years old and plays in and around the cottage.\nAll the drama takes place in the sisters' cottage or in the yard just outside, with events from town and beyond being reported either as they happen or as reminiscence.\nRecently returned home after 25 years is their brother Jack, a priest who has lived as a missionary in a leper colony in a remote village called Ryanga in Uganda.  He is suffering from malaria and has trouble remembering many things, including the sisters' names and his English vocabulary. It becomes clear that he has \"gone native\" and abandoned much of his Catholicism during his time there. This may be the real reason he has been sent home.\nGerry, Michael's father, is Welsh. He is a charming yet unreliable man, always clowning.  He is a travelling salesman who sells gramophones. He visits rarely and always unannounced. A radio nicknamed \"Marconi\", which works only intermittently, brings 1930s dance and traditional Irish folk music into the home at rather random moments and then, equally randomly, ceases to play. This leads the women into sudden outbursts of wild dancing.\nThe poverty and financial insecurity of the sisters is a constant theme. So are their unfulfilled lives: none of the sisters has married, although it is clear that they have had suitors whom they fondly remember.\nThere is a tension between the strict and proper behaviour demanded by the Catholic Church, voiced most stridently by the upright Kate, and the unbridled emotional paganism of the local people in the \"back hills\" of Donegal and in the tribal people of Uganda.\nThere is a possibility that Gerry is serious this time about his marriage proposal to Christina. On this visit, he says he is going to join the International brigade to fight in the Spanish Civil War, not from any ideological commitment but because he wants adventure. There is a similar tension here between the \"godless\" forces he wants to join and the forces of Franco against which he will be fighting, which are supported by the Catholic Church.\nThe opening of a knitwear factory in the village has killed off the hand-knitted glove cottage industry that has been the livelihood of Agnes and Rose. The village priest has told Kate that there are insufficient pupils at the school for her to continue in her post in the coming school year in September. She suspects that the real reason is her brother Jack, whose heretical views have become known to the Church and have tainted her by association.\nThere is a sense that the close home life the women/girls have known since childhood is about to be torn apart. The narrator, the adult Michael, tells us this is indeed what happens."}