{"_movieID": "117251", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:14", "summary": "White House Down is a 2013 American political action thriller film directed and co-produced by Roland Emmerich, and produced by Bradley J. Fischer, Harald Kloser, James Vanderblit, Larry Franco and by Laeta Kalogridis with screenplay written by Vanderblit. In the film, a divorced US Capitol Police officer named John Cale attempts rescuing both his daughter Emily and the President of the United States James Sawyer when a massively destructive terrorist assault occurs in the White House. The film stars Channing Tatum, Jamie Foxx, Maggie Gyllenhaal, Jason Clarke, Richard Jenkins and James Woods.\nReleased on June 28, 2013 by Sony Pictures, White House Down received mixed reviews from critics toward the screenwriting and the cliched storyline, although the performances and action sequences were praised. The film grossed over $205 million worldwide against budget of $150 million. White House Down was one of two films released in 2013 that dealt with a terrorist attack on the White House; the other was Olympus Has Fallen, released three months earlier.", "plot": "President of the United States James Sawyer (Jamie Foxx) generates significant controversy over a proposed peace treaty between the allied nations to remove military forces from the Middle East. Divorced US Capitol Police officer John Cale (Channing Tatum) is currently assigned to Speaker of the House Eli Raphelson (Richard Jenkins) after saving his nephew's life during a tour in Afghanistan. Cale hopes to impress his politically obsessed daughter Emily (Joey King) by getting a job interview for the Secret Service Presidential Detail, while also getting tickets for the two of them to tour the White House. However, his interviewer, Secret Service Deputy Special Agent-in-Charge Carol Finnerty (Maggie Gyllenhaal), a former college acquaintance of his, believes him to be unqualified due to his disrespect towards authority and a lifetime pattern of leaving things unfinished, such as his college degree or his tour of duty, and subsequently deems him ineligible for the job.\nDisguised as a janitor, a man detonates a bomb at the center of the US Capitol building, causing the White House to be on lockdown. Finnerty is sent to escort the Speaker to an underground command center in the Pentagon, while Vice President of the United States Alvin Hammond (Michael Murphy) is escorted onto Air Force One. At the same time, a paramilitary team of mercenaries led by Emil Stenz (Jason Clarke), having infiltrated the White House by disguising themselves as audio-visual repairmen, quickly overwhelm the Secret Service, take the tour group hostage and seize the building. Cale manages to escape to go find his daughter, who was separated from him during the tour, during a distraction caused by one of the security staff. Retiring Head of the Presidential Detail Secret Service Special Agent-in-Charge Martin Walker (James Woods) escorts Sawyer and his detail to the Presidential Emergency Operations Center. Once they gain access, Walker kills his detail, revealing himself to be the true leader of the attack on the White House. He seeks vengeance against Sawyer after a botched black ops mission resulted in the death of his son. Cale kills a mercenary, hijacks his weapon and radio, and rescues Sawyer when he overhears Walker talking about his plans.\nWalker and Stenz bring in infamous hacker Skip Tyler (Jimmi Simpson) to hack into the defense system, but still require Sawyer to activate the nuclear football. One of the mercenaries, Carl Killick (Kevin Rankin), catches Emily recording a video of the mercenaries on her phone and takes her hostage. Cale and Sawyer contact the command structure, which uses Emily's video to discover the identities of the mercenaries, who used to work for various government agencies. Cale and Sawyer try to escape via a secret tunnel but find the exit gate rigged with explosives. They are forced into the garage and escape in the presidential limo, which is attacked by Stenz and overturns, falling into the White House pool after a chase through the grounds. After Sawyer and Cale are presumed dead in an explosion, the Twenty-fifth Amendment to the United States Constitution is invoked; Hammond is sworn in as the 47th President of the United States. Cale and Sawyer, in fact, survived and learn that Hammond ordered an aerial incursion to re-acquire the White House, but the mercenaries shoot down the choppers with Javelin missile launchers. Having already learned of Emily from the video, Stenz takes her to Walker in the Oval Office. Tyler finishes hacking into NORAD and launches a missile to shoot down Air Force One from Piketon, Ohio, killing President Hammond and everyone else on board. Raphelson is sworn in as the 48th President of the United States and orders an air strike on the White House.\nSawyer surrenders himself to Walker to save Emily. Walker, blaming the Iranian regime for killing his son in combat, attempts to force Sawyer to use the football to launch the nuclear missiles against the various cities in Iran. Sawyer refuses initially, while Cale sets various rooms on fire as a diversion. Down in the tunnels, Tyler inadvertently triggers the explosives and is vaporised in the detonation. After killing most of the remaining mercenaries and freeing the hostages, Cale confronts Stenz and blows him up with a grenade belt during a fight. Sawyer attacks Walker, who uses Sawyer's handprint to activate the football. Walker locks Iran's targets with the football when Cale enters the Oval Office by crashing a reinforced Chevrolet Suburban through the wall. When Walker reaches to launch the missiles, Cale kills him with the car's rotary cannon. Emily waves a presidential flag on the front lawn, convincing the incoming fighter planes to call off the air strike. \nCale realizes that Raphelson was Walker's accomplice in orchestrating the attack, motivated to take the President's Office after killing Sawyer in exchange for giving Walker the nuclear codes. Having been tricked into confessing in the belief that Sawyer is dead and Cale has no proof, Raphelson is arrested for treason. Sawyer names Cale as his new special agent and takes him and Emily on a personal aerial tour of DC. President Sawyer receives word that the nations of Russia, Iran, France, and Israel have agreed to his Peace Deal after learning of that day's events at the White House, calling for an end to all wars."}