{"_movieID": "39451", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:59", "summary": "Little Fockers (known as Meet the Parents 3: Little Fockers in the United Kingdom and Southeast Asia) is a 2010 American comedy film and sequel to Meet the Parents (2000) and Meet the Fockers (2004). It stars Robert De Niro, Ben Stiller, Owen Wilson, Blythe Danner, Teri Polo, Jessica Alba, Dustin Hoffman and Barbra Streisand.\nAfter the commercial success of the first two films in the franchise, both De Niro and Stiller received a remuneration of $20 million for their roles in Little Fockers. \nThe first film in the series not to be directed by Jay Roach; it is instead directed by Paul Weitz with Roach as one of the producers. It is also the first film to be distributed by DreamWorks Pictures in non-US countries, with Paramount Pictures taking over. Likewise, Stephen Trask, a relative newcomer, takes over composing duties from veteran Randy Newman. In addition to the original cast, Little Fockers features Jessica Alba, Laura Dern, Kevin Hart, and Harvey Keitel. Despite universally negative reviews from critics, the film was a box office success, grossing over $310 million worldwide.", "plot": "Five years after the events of the previous film, Gaylord \"Greg\" Focker is preparing to celebrate his twins Samantha and Henry's fifth-birthday party. Things seem to go awry when Greg's father-in-law Jack Byrnes visits. Recently, Jack has been diagnosed with a heart condition and become embittered by his daughter Debbie's divorce from her husband Bob (their marriage was the social event in the first film and how Jack and Greg met), for cheating on her with a nurse. Jack's original plan was to declare Bob his successor as head of the Byrnes family, but he decides to pass the role to Greg, naming him \"The Godfocker\". Despite Greg reluctantly accepting the role, Jack resumes his spying on him and begins to suspect him of infidelity when he sees him with drug representative Andi Garcia, who openly flirts with him, and the presence of Sustengo erection pills in Greg's house prompts Jack to think Greg is no longer sexually attracted to his wife Pam. Furthermore, Jack starts to doubt Greg's ability to provide for his family when he appears reluctant to send his children to a private school.\nDuring a medical conference promoting Sustengo, Greg meets Bob at a bar. Bob tells Greg of Jack's original intention to name him as successor, \"The Bobfather\", and his relief and happiness at leaving Jack's family makes Greg slightly uncomfortable. Meanwhile, Jack speaks to Pam about the possibility of divorcing Greg and renewing her relationship with her ex-fiancé, Kevin Rawley. Eventually, following a row at a clinic, Greg escapes to his and Pam's unfinished new house, where Andi turns up. She tries to cheer him up with takeout and wine, but she drinks so much wine (also popping many erection pills) that she gets excessively drunk and makes an eccentric, extremely aggressive sexual pass on Greg. Jack, under the guise of looking for Greg so he can apologize to him and bring him home, pulls up to the house and sees through the window what looks like Greg and Andi having sex, although Greg is actually trying to rebuff Andi's advances. Disgusted, Jack leaves, and tells Dina and Pam that he couldn't find Greg.\nGreg's parents Bernie and Roz rejoin the family at the twins' birthday party the next day. Enraged at Greg's apparent infidelity, Jack engages him in a physical fight, despite Greg claiming that Andi was drunk and he was rebuffing her. The fight culminates with Jack having a heart attack and collapsing, and Greg quickly taking charge of the situation and looking after Jack. As paramedics take him away, Jack quietly admits that he believes Greg after feeling his carotid artery, which remained stable while Greg was claiming his innocence. Impressed with Greg for his integrity and quick thinking, Jack approves Greg to be \"The Gregfocker.\"\nFour months later, on Christmas Day, Greg and Pam's parents come to spend Christmas with them in their new house. Greg's parents (who are Jewish) give Jack a kippah as his present, informing him that while they were nursing him back to health they traced his family roots and discovered that he is part Jewish (which doesn't impress Jack). Bernie informs Greg and Pam that he and Roz have sold their Miami Island home and are moving to Chicago, only two houses down from their house. Jack and Dina decide they will move too, because they also want to be close to their grandchildren. The film ends with Greg and Pam trying to wean their parents off the idea.\nDuring the credits, Jack is back in his home on Long Island. He has grown fond of the search engine Google (having used it to do research on Andi earlier in the film). With Mr. Jinx, the family's cat, Jack watches a video of Greg on YouTube in which Greg mocks him at the Sustengo conference. Jack then discovers a remixed version of the video using puns of several of the words in the video, and is slightly amused.", "cast": "Robert De Niro as Jack Byrnes\nBen Stiller as Gaylord \"Greg\" Focker, Bernie & Roz’s son and Pam’s husband\nOwen Wilson as Kevin Rawley\nBlythe Danner as Dina Byrnes, Jack’s wife\nTeri Polo as Pam Focker, Jack & Dina’s daughter\nJessica Alba as Andrea \"Andi\" Garcia\nDustin Hoffman as Bernard \"Bernie\" Focker\nBarbra Streisand as Rozalin \"Roz\" Focker\nLaura Dern as Prudence Simmons\nHarvey Keitel as Randall \"Randy\" Weir\nOlga Fonda as Svetlana\nThomas McCarthy as Dr. Robert \"Bob\" Banks, Debbie’s husband\nKevin Hart as Nurse Louis\nDaisy Tahan as Samantha \"Sam\" Focker, Greg & Pam’s daughter and Henry’s twin sister\nColin Baiocchi as Henry Focker, Greg & Pam’s son and Samantha’s twin brother\nJohn DiMaggio as EMT\nJordan Peele as EMT\nYul Vazquez as Junior\nNick Kroll as Young Doctor\nRob Huebel as Sleazy Doctor"}