{"_movieID": "137106", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:15", "summary": "The Lego Movie is a 2014 computer-animated comedy film written and directed by Phil Lord and Christopher Miller from a story by Lord, Miller, and Dan and Kevin Hageman. Based on the Lego line of construction toys, its story focuses on an ordinary Lego minifigure who finds himself helping a resistance stop a tyrannical businessman from gluing everything in the Lego world into his vision of perfection. Chris Pratt, Will Ferrell, Elizabeth Banks, Will Arnett, Nick Offerman, Alison Brie, Charlie Day, Liam Neeson, and Morgan Freeman provide their voices for the film's main characters. The film was dedicated to Kathleen Fleming, the former director of entertainment development of the Lego company, following her death in Cancún, Mexico, in April 2013.The first film produced by the Warner Animation Group, The Lego Movie was released on February 7, 2014, by Warner Bros. Pictures. It became a critical and commercial success, grossing $469 million worldwide against its $60 million budget, and received praise for its visual style, humor, voice acting, and heartwarming message. The film won the BAFTA Award for Best Animated Film, the Critics' Choice Movie Award for Best Animated Feature, and the Saturn Award for Best Animated Film; it was also nominated for the Golden Globe Award for Best Animated Feature Film and received an Academy Award nomination for Best Original Song for \"Everything Is Awesome\".\nThe film has since expanded into a major franchise which ties into the Lego brand, with the sequel The Lego Movie 2: The Second Part released in 2019. The spin-off films The Lego Batman Movie and The Lego Ninjago Movie were both released in 2017, with another titled The Billion Brick Race in development. A 4D film based on the film itself, entitled The Lego Movie: 4D – A New Adventure, was released to Legoland parks across the world after its premiere at Legoland Florida in 2016.", "plot": "In the Lego universe, populated by anthropomorphic minifigures, the evil Lord Business steals a super-weapon called the \"Kragle\". A wizard named Vitruvius attempts to stop him, but is blinded by Business's robots, and prophesizes that \"The Special\", an unknown hero, will find the \"Piece of Resistance\" capable of stopping the Kragle.\nEight-and-a-half years later, in the city of Bricksburg, ordinary construction worker Emmet Brickowski notices a mysterious woman at his construction site. Emmet falls into a hole and finds the Piece of Resistance. Compelled to touch it, Emmet experiences vivid visions and passes out. He awakens with the Piece of Resistance attached to his back, in the custody of Good Cop/Bad Cop, Lord Business's lieutenant.\nThe mysterious woman, Wyldstyle, rescues Emmet, believing him to be the Special, and takes him to Vitruvius in the Old West. Emmet learns Wyldstyle and Vitruvius are \"Master Builders\" capable of building anything from their imagination without instructions. Wyldstyle explains that Business wants to use the Kragle (a tube of Krazy Glue with a weathered label) to freeze the world into orderly perfection. Though disappointed to find Emmet is not a Master Builder, Wyldstyle and Vitruvius are convinced of his potential when he recalls visions of a seemingly human deity referred to as \"The Man Upstairs\".\nEmmet, Wyldstyle and Vitruvius evade Bad Cop's forces with the aid of Batman, Wyldstyle's boyfriend. They visit the hidden realm of Cloud Cuckoo Land, which is ruled by Unikitty, to attend a council of Master Builders, all of whom are unimpressed with Emmet and refuse to fight Business. Bad Cop's forces invade Cloud Cuckoo Land, having placed a tracking device on Emmet, and capture everyone. Only Emmet, Wyldstyle, Batman, Vitruvius, and a small group of Master Builders escape, as Cloud Cuckoo Land is destroyed. Emmet devises a plan to infiltrate Business's office tower and disarm the Kragle with help from the Cloud Cuckoo Land’s ruler, Princess Unikitty, the spaceman Benny, and the pirate MetalBeard. The plan nearly succeeds, but the group is captured and imprisoned in the Think Tank, where the Master Builders are forced to make instructions. Vitruvius resists but is decapitated by Business, who sets a self-destruct protocol and leaves everyone to die, including Bad Cop.\nA dying Vitruvius reveals he made up the prophecy. He soon reappears to Emmet as a ghost and reveals that self-belief is what makes one the Special. Strapped to the self-destruct mechanism's battery, Emmet jumps into the abyss outside the tower and severs the connection, saving his friends. Inspired by Emmet's sacrifice, Wyldstyle (now Lucy, since that was her real name) rallies the Lego people across the universe to build weapons and vehicles to fight Lord Business's army of Micro Managers. Bad Cop allies himself with the Master Builders.\nEmmet finds himself in the human world as a Lego mini-figure, unable to move; he soon discovers that the events of the story are being played out by a boy named Finn on his father's expansive Lego collection in their basement. His father, \"The Man Upstairs\", comes home from work and is horrified to find his son \"ruining\" his organized creations by combining different playsets and ignoring the instructions. He proceeds to undo Finn's changes and Krazy Glues the pieces together. Realizing the danger his friends are in, Emmet wills himself to move and gains Finn's attention.\nFinn returns Emmet to the set, where he now possesses the powers of a Master Builder and angrily confronts Business in Bricksburg. Meanwhile, Finn's father realizes Finn has based the villainous Lord Business on him and his perfectionism. Through a speech Emmet gives Business, Finn's father comes to his senses and remorsefully apologizes to his son, and the two unglue the constructions with mineral spirits; in the Lego world, Business is freed from his evil side, and happily combines the Kragle with the Piece of Resistance (the Krazy Glue cap), frees his victims, and tearfully thanks Emmet, who is then hailed as a hero and begins a romantic relationship with Lucy with Batman's blessing.\nFinn's father invites Finn's younger sister, Bianca, to join their play, resulting in aliens from the planet Duplo beaming down to the Lego world and announcing their plans to destroy everyone.", "cast": "Chris Pratt as Emmet Brickowski, an everyman and construction worker from Bricksburg who is initially mistaken for the Special.\nWill Ferrell as Lord Business, an evil businessman and tyrant of Bricksburg and the Lego Universe who is the company president of the Octan Corporation under the name President Business.Ferrell also plays \"The Man Upstairs\", a Lego collector and Finn's father in the live-action part of the film.\nElizabeth Banks as Lucy / Wyldstyle, a \"tough as nails\" and tech-savvy fighter who is one of the Master Builders.\nWill Arnett as Bruce Wayne / Batman, a DC Comics superhero who is a Master Builder.\nNick Offerman as Metal Beard, a pirate and Master Builder seeking revenge on Lord Business for taking his body parts following an earlier encounter and causing him to remake his body from bricks.\nAlison Brie as Princess Unikitty, a unicorn-horned kitten and Master Builder that lives in Cloud Cuckoo Land.\nCharlie Day as Benny, a \"1980-something space guy\" who is one of the Master Builders and is obsessed with building spaceships.\nLiam Neeson as Bad Cop / Good Cop, a police officer with a two-sided head and a split personality who serves Lord Business as a member of the Super Secret Police. The character's name and personality are both based on the good cop/bad cop interrogation method which is briefly shown in the film.\nNeeson also voices Pa Cop, a police officer who is Bad Cop/Good Cop's father and Ma Cop's husband.\nMorgan Freeman as Vitruvius, a blind old wizard who is one of the Master Builders.\nChanning Tatum as Superman, a DC Comics superhero who is one of the Master Builders\nJonah Hill as Green Lantern, a DC Comics superhero who is one of the Master Builders\nCobie Smulders as Wonder Woman, a DC Comics superhero who is one of the Master Builders.\nJadon Sand as Finn, an eight-and-a-half-year-old boy who is the son of \"The Man Upstairs\" in the live-action part of the film.In addition, Anthony Daniels and Billy Dee Williams reprise their Star Wars roles as C-3PO and Lando Calrissian respectively, with Keith Ferguson voicing Han Solo (whom he previously voiced in Robot Chicken and Mad). Shaquille O'Neal portrays a Lego version of himself who is a Master Builder alongside two generic members of the 2002 NBA All-Stars.\nDirector Christopher Miller voices as a TV announcer for the Octan comedy show Where Are My Pants?."}