{"_movieID": "107846", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:46:22", "summary": "Escape Plan is a 2013 American prison action thriller film starring Sylvester Stallone and Arnold Schwarzenegger, and co-starring Jim Caviezel, 50 Cent, Vinnie Jones, Vincent D'Onofrio and Amy Ryan. Directed by Swedish filmmaker Mikael Håfström, and written by Miles Chapman and Jason Keller (under the anagram pen-name 'Arnell Jesko'). The first film to pair up action film icons Stallone and Schwarzenegger as co-leads, it follows Stallone's character Ray Breslin, a structural engineer who is incarcerated in the world's most secret and secure prison, aided in his escape by fellow inmate Emil Rottmayer (Schwarzenegger). The film is the first installment of the Escape Plan film series.\nThe film was released in the United States on October 18, 2013, received mixed reviews and grossed $137 million worldwide against a $54 million budget.", "plot": "Former prosecutor Ray Breslin co-owns Breslin-Clark, a security firm specializing in testing supermax prisons. Posing as an ‘inmate’ to study facilities from within and exploit weaknesses to escape, Breslin is driven by the murders of his wife and child by an escaped convict he had successfully prosecuted.\nBreslin and business partner Lester Clark receive a multimillion-dollar deal from CIA operative Jessica Mayer to test a top secret prison for disappeared persons, but Breslin’s team are not given the prison’s location, to minimize the chance of outside help. Against his own rules, Breslin agrees, allowing himself to be captured in the guise of a Spanish terrorist named \"Anthony Portos.\" The plan goes awry when his captors remove a tracking microchip from his arm and drug him, preventing his colleagues from knowing where he has been taken.\nBreslin wakes up in a complex of glass cells and realizes that the warden, Hobbes, is not the man he was supposed to meet. He befriends inmate Emil Rottmayer, who works for modern-day Robin Hood Victor Mannheim. The duo stage a fight that allows Breslin to study the solitary confinement cell, which disorients and dehydrates prisoners with high-powered halogen lights. Noticing the cell floors have rivets of steel instead of moisture-resistant aluminium, Breslin has Rottmayer acquire a metal plate from Hobbes's office floor, before they and Muslim inmate Javed are again thrown into solitary.\nUsing the metal plate, Breslin focuses the reflection from the lights to heat the steel around the rivets, shearing them when the steel expands. Finding a passageway below the floor, he discovers the prison is inside a massive cargo ship in the middle of the ocean. Breslin and Rottmayer continue to study the complex and learn the guards' routines. However, Hobbes reveals to Breslin that he is aware of his identity and, with chief security officer Drake watching over him, will ensure Breslin spends the rest of his life in the prison. Breslin offers Hobbes information on Mannheim from Rottmayer in exchange for being released; Hobbes agrees.\nWhile Breslin feeds Hobbes false information about Mannheim, Breslin’s colleagues Abigail Ross and Hush grow suspicious of Clark when Breslin's paycheck for the job is frozen. They discover from hacked documents that the prison, codenamed \"The Tomb,\" is owned by a for-profit organization linked to a private security contractor. Clark is revealed to be in contact with Hobbes about Breslin’s imprisonment. Rottmayer has Javed convince Hobbes that he is double-crossing them, and Javed is allowed above deck for his nightly prayer, where he uses a makeshift sextant to determine the ship's latitude, and Breslin and Rottmayer deduce they are in the Atlantic Ocean near Morocco.\nBreslin convinces prison physician Dr. Kyrie to help him and Rottmayer escape by sending an email to Mannheim, and transmits a false tap code message from his cell, convincing Hobbes that a riot will occur in cell block C. With security misdirected, Javed instigates a riot at cell block A, allowing him, Breslin, and Rottmayer to run toward the deck while a lockdown is initiated. Breslin kills Drake, but Javed is killed by Hobbes and his men. Breslin goes to the engine room to shut down the electrical systems, giving Rottmayer time to open the deck hatch before the backup generators come online, while a helicopter sent by Mannheim engages in a gunfight with the ship's crew. Rottmayer boards the helicopter while Breslin is flushed to the bottom of the ship by the automated water system after Hobbes reboots the main electrical system. Reaching the helicopter as Hobbes fires at him, Breslin shoots and blows up some oil barrels, killing Hobbes.\nThe helicopter lands on a Moroccan beach, where Rottmayer reveals he is actually Mannheim, Mayer is his daughter, “Portos” was a codeword to alert Mannheim that Breslin was an ally, and Hobbes was originally unaware that Breslin's cover story was fake. Later, Ross informs Breslin that they discovered Clark was offered a $5 million annual salary to become CEO of the Tomb’s security company, should Breslin's imprisonment prove the ship was escape-proof. Hush tracked Clark to Miami and locked him in a shipping container bound for an unknown destination."}