{"_movieID": "392044", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:50:04", "summary": "Murder on the Orient Express is a detective novel by British writer Agatha Christie featuring the Belgian detective Hercule Poirot. It was first published in the United Kingdom by the Collins Crime Club on 1 January 1934. In the United States, it was published on 28 February 1934, under the title of Murder in the Calais Coach, by Dodd, Mead and Company. The UK edition retailed at seven shillings and sixpence (7/6) and the U.S. edition at $2.00.The elegant train of the 1930s, the Orient Express, is stopped by heavy snowfall, with many passengers. A murder is discovered, and Poirot's trip home to London from the Middle East is interrupted to solve the murder.\nThe US title of Murder in the Calais Coach was used to avoid confusion with the 1932 Graham Greene novel Stamboul Train which had been published in the United States as Orient Express.", "plot": "After taking the Taurus Express from Aleppo in Syria to Istanbul, private detective Hercule Poirot arrives at the Tokatlian Hotel. There he receives a telegram prompting him to return to London. He instructs the concierge to book a first-class compartment on the Simplon-route Orient Express service, leaving that night. Although the train is fully booked, Poirot obtains a second-class berth, but only with the intervention of a friend and fellow Belgian who is also boarding the train, Monsieur Bouc, a director of the railway, Compagnie Internationale des Wagons-Lits. Aboard the train, a malevolent, elderly American, Samuel Ratchett, attempts to hire Poirot because he believes his life is threatened, but Poirot refuses out of distaste for the man.\nIn Belgrade, on the second night of the journey, two extra coaches are added to the train and Bouc gives up his first-class compartment to Poirot and moves to a different coach himself. That compartment adjoins Ratchett's. The train is stopped by a snowdrift near Vincovci (sic). Among the several events that disturb Poirot's sleep is a cry from Ratchett's compartment. The next morning, Bouc informs him that Ratchett has been murdered and asks Poirot to investigate.\nWhen Poirot and Dr Constantine examine Ratchett's compartment, Poirot finds a trace of a burned note with the words \"–member little Daisy Armstrong\" on it, which leads him to doubt Ratchett's identity. A few years before, three-year-old Daisy Armstrong was kidnapped by a man named Cassetti, who collected a ransom but killed the child anyway. Cassetti was caught but fled the country after he was acquitted on a technicality. Poirot concludes that Ratchett and Cassetti are one and the same.\nPoirot proposes two possible solutions: Either a stranger boarded the train and murdered Cassetti, or every one of the passengers, all of whom were discovered to have had a connection to the Armstrong case, had all conspired to kill Cassetti together. Mrs. Hubbard – in fact Daisy Armstrong's grandmother – the famous actress Linda Arden, confesses the truth of the second solution, yet Monsieur Bouc and Dr. Constantine choose to present the first of the two to the Yugoslav police."}