{"_movieID": "205596", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:02", "summary": "The Imitation Game is a 2014 British historical drama film directed by Morten Tyldum and written by Graham Moore, based on the biography Alan Turing: The Enigma by Andrew Hodges. It stars Benedict Cumberbatch as British cryptanalyst Alan Turing, who decrypted German intelligence messages for the British government during the Second World War. Keira Knightley, Matthew Goode, Rory Kinnear, Charles Dance, and Mark Strong also star.\nThe screenplay topped the annual Black List for best unproduced Hollywood scripts in 2011. The Weinstein Company acquired the film for $7 million in February 2014, the highest amount ever paid for U.S. distribution rights at the European Film Market. It was released theatrically in the United States on 28 November 2014.\nThe Imitation Game grossed over $233 million worldwide on a $14 million production budget, making it the highest-grossing independent film of 2014. It received eight nominations at the 87th Academy Awards, winning for Best Adapted Screenplay, five nominations in the 72nd Golden Globe Awards, and three nominations at the 21st Screen Actors Guild Awards. It also received nine BAFTA nominations and won the People's Choice Award at the 39th Toronto International Film Festival.\nThe film was criticised by some for its inaccurate portrayal of historical events and for downplaying Turing's homosexuality. However, the LGBT civil rights advocacy organisation the Human Rights Campaign honoured it for bringing Turing's legacy to a wider audience.", "plot": "In 1951, two policemen, Nock and Staehl, investigate the mathematician Alan Turing after an apparent break-in at his home. During his interrogation by Nock, Turing tells of his time working at Bletchley Park during the Second World War.\nIn 1928, the young Turing is unhappy and bullied at boarding school. He develops a friendship with Christopher Morcom, who sparks his interest in cryptography. Turing develops romantic feelings for him, but Christopher soon dies from tuberculosis.\nWhen Britain declares war on Germany in 1939, Turing travels to Bletchley Park. Under the direction of Commander Alastair Denniston, he joins the cryptography team of Hugh Alexander, John Cairncross, Peter Hilton, Keith Furman and Charles Richards. The team are trying to analyze the Enigma machine, which the Nazis use to send coded messages.\nTuring is difficult to work with, and considers his colleagues inferior; he works alone to design a machine to decipher Enigma messages. After Denniston refuses to fund construction of the machine, Turing writes to Prime Minister Winston Churchill, who puts Turing in charge of the team and funds the machine. Turing fires Furman and Richards and places a difficult crossword in newspapers to find replacements. Joan Clarke, a Cambridge graduate, passes Turing’s test but her parents will not allow her to work with the male cryptographers. Turing arranges for her to live and work with the female clerks who intercept the messages, and shares his plans with her.  With Clarke's help, Turing warms to the other colleagues, who begin to respect him.\nTuring’s machine, which he names Christopher, is constructed, but cannot determine the Enigma encryption settings quickly enough; the Germans reset them each day. Denniston orders it to be destroyed and Turing fired, but the other cryptographers threaten to leave if Turing goes. After Clarke plans to leave on the wishes of her parents, Turing proposes marriage, which she accepts. During their reception, Turing confirms his homosexuality to Cairncross, who warns him to keep it secret. After overhearing a conversation with a female clerk about messages she receives, Turing has an epiphany, realising he can program the machine to decode words he already knows exist in certain messages. After he recalibrates the machine, it quickly decodes a message and the cryptographers celebrate. Turing realises they cannot act on every decoded message or the Germans will realise Enigma has been broken.\nTuring discovers that Cairncross is a Soviet spy. When Turing confronts him, Cairncross argues that the Soviets are allies working for the same goals, and threatens to retaliate by disclosing Turing’s sexuality. When the MI6 agent Stewart Menzies appears to threaten Clarke, Turing reveals that Cairncross is a spy. Menzies reveals he knew this already and planted Cairncross to leak messages to the Soviets for British benefit. Fearing for her safety, Turing tells Clarke to leave Bletchley Park, revealing that he is gay. Clarke states she always suspected but insists they would have been happy together anyway. Turing then tells her he never cared for her, and only used her for her cryptography skills.  Heartbroken, she decides to stay anyway, deeming this the single most important task she'll undertake, and she now refuses to cow to what Turing or her parents want her to do, or think of her decisions.  After the war, Menzies tells the cryptographers to destroy their work and that they can never see one another again or share what they have done.\nIn the 1950s, Turing is convicted of gross indecency and, in lieu of a jail sentence, undergoes chemical castration so he can continue his work. Clarke visits him in his home and witnesses his physical and mental deterioration. She comforts him by saying that his work saved millions of lives.\nThe final scene shows an on screen message saying, \"After a year of government-mandated hormonal therapy, Turing committed suicide on June 7th, 1954. He was 41 years old. Between 1885 and 1967, approximately 49,000 homosexual men were convicted of gross indecency under British law. In 2013 Queen Elizabeth II granted Turing a posthumous Royal Pardon, honouring his unprecedented achievements.\" The credits end saying historians estimate Turing's machine is estimated to have cut World War II short by two years, saving over 14 million lives."}