{"_movieID": "166426", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:32", "summary": "Pirates of the Caribbean: Dead Men Tell No Tales (released in some countries as Pirates of the Caribbean: Salazar's Revenge) is a 2017 American swashbuckler fantasy film, the fifth installment in the Pirates of the Caribbean film series and the sequel to On Stranger Tides (2011). The film is directed by Joachim Rønning and Espen Sandberg from a script by Jeff Nathanson, with Jerry Bruckheimer serving again as producer. Johnny Depp, Kevin McNally and Geoffrey Rush reprise their roles as Jack Sparrow, Joshamee Gibbs and Hector Barbossa, respectively, and are joined in the cast by Javier Bardem, Brenton Thwaites and Kaya Scodelario. In the film, Captain Jack Sparrow searches for the Trident of Poseidon while being pursued by an undead sea captain and his crew.\nThe filmmakers cited the series' first installment, The Curse of the Black Pearl (2003), as inspiration for the script and tone of the film. Pre-production for the film started shortly before On Stranger Tides was released in early 2011, with Terry Rossio writing the initial script. In early 2013, Jeff Nathanson was hired to write a new script for the film, with Depp being involved in Nathanson's writing process. Initially planned for a 2015 release, the film was delayed to 2016 and then to 2017, after 6 years of development hell, due to script and budget issues. Principal photography started in Australia in February 2015, after the Australian government offered Disney $20 million in tax incentives, and ended in July 2015.\nDead Men Tell No Tales was released in the United States in conventional, 3D and IMAX formats on May 26, 2017. The film received generally unfavorable reviews, with critics praising its visual effects and sense of fun but criticizing it for its bloated narrative, predictability and plot holes with previous films. It grossed $794 million worldwide against a production budget between $230–320 million, making it one of the highest-grossing films of 2017 but the lowest total of the series since Curse of the Black Pearl.", "plot": "Thirteen years after the events of At World's End, twelve-year-old Henry Turner boards the Flying Dutchman and informs his father, Will Turner, that the curse which binds Will to the Dutchman and only permits him to step on land once a decade can be broken by the Trident of Poseidon. Henry intends to recruit Captain Jack Sparrow to help find it, but Will believes this is impossible and orders Henry to leave. Will and the Dutchman then disappear into the sea, but Henry vows to find Jack and the Trident.\nNine years later, Henry is a sailor in the British Royal Navy. The ship sails into the supernatural Devil's Triangle and stumbles upon the wreck of the Silent Mary, whose ghostly crew led by Spanish pirate-hunter Captain Salazar attack. Salazar spares Henry's life to deliver a message to Jack: Salazar is coming for him.\nIn Saint Martin, a young astronomer and horologist named Carina Smyth is sentenced to death for witchcraft but escapes and briefly crosses paths with Jack as he and his crew spectacularly blunder a bank robbery. Having suffered years of such bad luck, Jack's crew lose faith and abandon him. Depressed, Jack trades his magical compass for a drink. However, this betrayal of the compass frees Salazar and his crew from the Devil's Triangle. Carina learns Henry is looking for the Trident's location and offers to help him using her unknown father's diary. Carina and Jack are captured and face execution, but are saved by Henry and Jack's crew, setting sail on the Dying Gull. Carina deciphers clues that the stars will lead to an island where the Trident is hidden.\nMeanwhile, Captain Barbossa hears from his pirate crew that the revived Captain Salazar has killed several pirates at sea, and learns that the Trident could lead him to a new \"treasure\". Barbossa sets off to find the Trident until Salazar and his crew appear and destroy Barbossa's fleet. Barbossa manages to talk his way out of being killed by offering to help find Jack. Salazar agrees, wanting revenge on the pirate that caused his demise. Salazar pursues the Dying Gull, forcing Jack, Henry, and Carina to flee to an island, discovering that Salazar's crew cannot go on land. After saving Jack from a forced marriage, Barbossa allies himself with Jack, returning his compass and restoring the miniaturized Black Pearl, trapped in a bottle by Blackbeard, to its original size. They all continue their journey to the Trident's island, with Barbossa taking command of the Pearl once more. During the voyage, Jack and Barbossa realize Carina is the latter's long-lost daughter. Barbossa tells Jack that he had left her at an orphanage with his diary so she could live a better life, and refuses to tell her the truth so she will continue to believe her father was an astronomer.\nApproaching the Trident's island, the Pearl evades a British Navy warship, which is destroyed by the Silent Mary before the Pearl runs aground on the island. Jack, Barbossa, and Carina use the island's magic to part the ocean and open a path to the Trident's location on the ocean floor. Salazar captures Henry and possesses him in order to walk on the ocean floor and seize the Trident. Once he does so, Henry is given his body back, and Jack distracts Salazar, allowing Henry to destroy the Trident, breaking all curses upon the sea and restoring Salazar's crew to life. However, the divided sea begins to collapse in on itself. The Pearl lowers its anchor to lift them to safety, but Salazar pursues them, still hell-bent on killing Jack. Carina realizes that Barbossa is her father when she spots a tattoo on his arm identical to the diary's cover. Barbossa sacrifices himself to kill Salazar, allowing the others to escape alive.\nSometime later, Henry and Carina reach Port Royal, where Will appears, free from the Dutchman. His wife, Elizabeth, appears moments later and the Turner family reunites. Henry and Carina begin a relationship as well. Jack watches from the Pearl in faux-disgust before sailing away into the horizon, having been accepted by his crew as their captain once again, while also adopting Captain Barbossa’s now-homeless monkey.\nIn a post-credits scene, Will and Elizabeth sleep in their bed together, when their room is intruded by Davy Jones. Just as Jones raises his claw to attack them, Will awakens and finds that the room is empty. Assuming Jones' appearance to be a nightmare, Will goes back to sleep, oblivious to the presence of a trace of wet barnacles on the floor.", "cast": "Johnny Depp as Captain Jack Sparrow: The former Captain of the Black Pearl who travels with Henry and Carina in search of the Trident of Poseidon. Rønning wanted to focus on relatable characters, as in the first film, \"where Jack is not the [lead ... but] comes in and crashes the party every now and then,\" and to make use of Depp's \"comedic genius\". The film examines Jack's backstory, with the young Jack portrayed by Anthony De La Torre, whose face was replaced by a CGI replica of Depp as he looked in 21 Jump Street and What's Eating Gilbert Grape. Rønning felt de-aging Depp was tricky against the canon of the franchise.\nJavier Bardem as Captain Armando Salazar: The undead Captain of the Silent Mary who seeks revenge on Jack Sparrow and attempts to steal the Trident of Poseidon to kill every pirate at sea. Bardem set out to imbue the character with \"a rage based on dented pride,\" owing to his spectacular fall, from a high-ranking commander of a Spanish fleet to being betrayed and trapped in hell by Jack. With Salazar's body language, he tried to convey a bull in an arena, \"full of rage and need of vengeance, but also wounded.\" It took three hours a day to apply the make-up, which Bardem referred to as having \"cold chicken breasts\" glued to his face.\nGeoffrey Rush as Captain Hector Barbossa: Sparrow's rival and the Captain of the Queen Anne's Revenge, who is secretly Carina's biological father. Barbossa has become extremely wealthy since the previous film, with Rush referring to him as a \"corporate pirate,\" having amassed a fleet of ships under his command and encrusted his peg-leg with jewels.\nBrenton Thwaites as Henry Turner: The son of Will Turner and Elizabeth Swann who vows to break his father's curse by searching for the Trident. The directors were keen to draft a new protagonist relationship with Henry and Carina, stating that \"in the middle of a big action scene, you need to be able to lean on the characters and find the heart of that story, and channel the characters' vulnerability.\" Rønning noted that identity is a major theme in the film, and to Henry and Carina's story arc: \"they are on a similar quest and find common ground in looking for who they are.\" Lewis McGowan portrays a young Henry.\nKaya Scodelario as Carina Smyth: A headstrong, altruistic astronomer who was wrongly accused of being a witch. Scodelario explained the character's motivation and role, saying, \"she is an academic, she's fighting for the right to study at university because women couldn't at that time.\" For the directors, it was important to \"modernise it with Henry and Carina, Kaya, especially brought that with her. She's a modern woman.\" Scodelario worked with scriptwriter Jeff Nathanson to ensure the character was unique to the series and not a copy of Elizabeth Swann. She said that female characters often \"fall into two camps; they are either pretty and perfectly put together or completely insane. Carina has definitely got a little bit of both.\"\nKevin McNally as Joshamee Gibbs: Captain Jack's loyal friend and first mate.\nDavid Wenham as Lieutenant John Scarfield: The second antagonist of the film and a British Royal Navy officer, who commands HMS Essex.\nGolshifteh Farahani as Shansa: A sea-witch and ally of Captain Barbossa.\nStephen Graham as Scrum: A member of Jack Sparrow's crew and former member of Blackbeard's crew.\nMartin Klebba as Marty: A member of Jack Sparrow's crew.\nGiles New and Angus Barnett as Murtogg and Mullroy: Former Royal Marines turned pirates, who serve Barbossa's crew on board the Queen Anne's Revenge.\nOrlando Bloom as Will Turner: A blacksmith-turned-pirate who was transformed into the Captain of the Flying Dutchman at the end of Pirates of the Caribbean: At World's End. Speaking in late 2014 about his possible return to the franchise, Bloom stated that he would like to portray a character outside of his usual role types as a good-looking hero, alluding to the make-up requirements for Davy Jones.Additionally, Keira Knightley briefly appears at the end in a non-speaking role as Elizabeth Swann, Will's wife and Henry's mother. Adam Brown, Danny Kirrane, and Delroy Atkinson appear as members of Jack's crew, and in the prison scene, Paul McCartney briefly appears as Jack's paternal uncle, Uncle Jack. Alexander Scheer plays a young Captain Edward Teague in a flashback sequence. A silhouette of Davy Jones, one of the series' former villains, is seen in the post-credits scene, but actor Bill Nighy had stated that he was not informed about the character's appearance. Pablo and Chiquita reprised their role as Jack the Monkey."}