{"_movieID": "228203", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:54:32", "summary": "McFarland, USA (also known as McFarland) is a 2015 American sports drama film directed by Niki Caro, produced by Mark Ciardi and Gordon Gray, written by Christopher Cleveland, Bettina Gilois and Grant Thompson with music composed by Antônio Pinto. The film was co-produced by Walt Disney Pictures and Mayhem Pictures. Based on the true story of a 1987 cross country team from a mainly Latino high school in McFarland, California, the film stars Kevin Costner as Jim White, the school's coach, who leads the team to win a state championship. The film also stars Maria Bello and Morgan Saylor.\nMcFarland, USA was released on February 20, 2015, received positive reviews from critics, and grossed over $45 million. The film was released on DVD and Blu-ray on June 2, 2015 by Walt Disney Studios Home Entertainment.", "plot": "In 1987 football coach, Jim White, loses his job after he loses his temper and accidentally injures a team player in the locker room. He and his family relocate for his new job at McFarland High School in McFarland, California, which is predominantly Latino. The rest of his family has trouble adjusting to the Hispanic neighborhood and lament being unable to move to Bakersfield. \nWhite is first put as assistant football coach, but ultimately loses his football coaching status when he pulls a player out, fearing he would be badly injured on the field. \nDiscovering that some of his students are strong runners, he has the school's principal authorize cross-country as a sport and organises an all-boys team. Its seven members have little hope for their future, specifically Tomas Vallez, due to hardships with his father. White's devotion to the team leads to his own hardships with his family, including forgetting to pick up his daughter Julie's Birthday cake. \nAfter a few regional competitions, the team wins its first race. Shortly after, the Diaz brothers are taken off the team by their father, who wants them to work for his team of field pickers instead. In response, White convinces them to come to meets and races at earlier and later times of the day, to which they finally address him as \"coach\". White's wife Cheryl organizes a tamale and car wash sale with the rest of the neighborhood to raise money for new uniforms, where the family and the neighborhood become better acquainted. \nEventually, the McFarland team competes in and wins their first State race, and White takes them to the beach to celebrate. White also makes amends with Julie by throwing her a quinceañera with help from the neighbors, though it goes wrong when Julie is taken out on \"parade\" and the group is attacked by street punks. \nJim is offered a full-time position at Palo Alto, upsetting Tomas who wanted to commit suicide. Cheryl implores him to continue to be there for the McFarland team and their friends in the neighborhood. The day of the state championships comes, and thanks to White's rigorous training and encouragement, McFarland come in first, while White also turns down the Palo Alto position in favor of McFarland.\nUnder White's guidance, the team becomes outstandingly successful, winning nine state titles over the years.  All the members of the first team become the first in their families to go to college or into military careers. Almost all members continue to attend the practices that Jim White held for successive school cross country teams even after graduation from college. White continues teaching and coaching in McFarland.", "cast": "Kevin Costner as Jim White\nMaria Bello as Cheryl White\nMorgan Saylor as Julie White\nCarlos Pratts as Thomas Valles\nElsie Fisher as Jamie White\nJohnny Ortiz as Jose Cardenas\nHector Duran as Johnny Sameniego\nSergio Avelar as Victor Puentes\nMichael Aguero as Damacio Diaz\nRafael Martinez as David Diaz\nRamiro Rodriguez as Danny Diaz\nDiana-Maria Riva as Señora Diaz\nVanessa Martínez as Maria Marsol\nMartha Higareda as Lupe\nValente Rodriguez as Principal Camillo\nChris Ellis as Coach Jenks\nEloy Casados as Dale Padilla\nNatalia Cordova-Buckley as Señora Valles"}