{"_movieID": "59296", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:07", "summary": "Love, Wedding, Marriage is a 2011 American romantic comedy film directed by Dermot Mulroney and starring Mandy Moore, Kellan Lutz, James Brolin, Jane Seymour and Christopher Lloyd.\n\n", "plot": "Ava (Mandy Moore) and Charlie (Kellan Lutz) are newlyweds that have been inspired by the 30-year marriage of Ava's parents, Bradley (James Brolin) and Betty (Jane Seymour) when Ava decides to throw them a surprise anniversary party. But when Betty finds out about an affair Bradley had 25 years ago, she refuses to live with him, which then forces Ava into moving her father into her house, without consulting Charlie. She promises her new husband that it will only be for a short while. Being a marriage counselor, Ava tries and starts to obsess over fixing her parents' marriage so much that it starts to affect her relationship with Charlie. Their marriage starts to deteriorate when they stop having sex and becomes worse when their friend Gerber and new Polish wife, Kasia, whom he had met the night before, show up and he tells Ava about Charlie’s first marriage 10 years ago, that she never knew about. When she hears about it, she becomes upset and Charlie tries to explain that it was a long time ago and he was under the influence of alcohol when it happened.\nWhen Ava decides to send her parents to another therapist, the therapist suggests doing a rock climbing exercise to help build trust. One partner climbs while the other holds the rope for support. During the exercise, Ava's parents get into an argument and her father leaves the rope, leaving Betty suspended in air calling for help. Ava leaves her own rope to help her mother, leaving Charlie suspended without any support, which results in him falling and injuring his back and neck. When Ava tries to apologize, Charlie warns her that her distracted behavior is causing an increasing gulf between them.\nAva is still planning the anniversary party in secret when her mother tells her she’s leaving on a trip to Asia in 10 days for 6 months. Ava comes up with a plan to bring her parents together and enlists Charlie’s help to take her father out for a guys night. When Charlie and Bradley meet up with Gerber at a bar, the trio winds up at a strip club and spend the night becoming incredibly intoxicated. When they get home to find Ava with her mother, Bradley tells Betty that she can leave because he’s going to marry a hot, young girl from Europe, something he had heard Gerber say. Ava scolds Charlie for his behavior and ruining her plan which then leads to him complaining about their sex life.\nWhen Ava’s sister Shelby (Jessica Szohr) takes Betty speed dating, Bradley is back at home with Ava when he takes a few sleeping pills and falls asleep. Ava flushes the rest of the pills down the toilet and calls 9-1-1 to make it look like a suicide. During that time, Betty has the realization that no man could ever replace Bradley and even more so when she finds out that he’s in the hospital. Charlie asks Ava about the number of pills Bradley had taken, and she admits that she had created the whole incident in an attempt to bring her parents together. Charlie yells at Ava for her manipulative behavior, and storms out of the hospital. When Ava gets home that night, she discovers that Charlie has left, leaving a note saying that he’s at Gerber’s. The next day, Ava goes to Charlie’s office to apologize, and asks him to come back home. He replies that “he can't answer that right now”. She invites him to her parents' 30th anniversary party, which is now back on, but he declines, saying that he isn't in the mood for celebrating. Upon hearing this, Ava becomes enraged and accuses Charlie of having an affair with his secretary, Adriana. He denies that there is an affair, questions her motives for marrying him, suggesting that perhaps she had only done so to boost her career and lend credibility to her marriage counseling business. Ava is stunned, and leaves.\nThe next day, Gerber kicks Charlie out because Kasia’s family comes to visit. When Charlie hears Gerber talk to his wife in Polish, and asks him about it, Gerber says that if you love someone and want to live a successful married life, you have to accept and respect their family as well. Charlie goes to find Ava who is at her parent’s party. They meet after Ava has the realization that it’s her own fault for the way their marriage is and wanted to apologize. Charlie redoes his marriage vows and Ava responds, \"I do.\" Charlie suggests going back to the party, but Ava suggests they consummate their marriage instead.", "cast": "Mandy Moore as Ava\nKellan Lutz as Charlie\nJane Seymour as Betty Gold\nJames Brolin as Bradley Gold\nJessica Szohr as Shelby Gold\nMichael Weston as Gerber\nMarta Żmuda Trzebiatowska as Kasia\nRichard Reid as Ian\nChristopher Lloyd as Dr. George\nAlexis Denisof as Lloyd\nAlyson Hannigan as Courtney\nColleen Camp as Ethel\nAndrew Keegan as Jeramiah Stevens\nGabrielle Shuff as Adrianna\nJoe Chrest as John\nKim Vu as Amy\nAutumn Federici as Jessica\nSarah Lieving as Rachel\nBilly Slaughter as Actor (voice)\nJulia Roberts as Ava's Therapist (voice)"}