{"_movieID": "316029", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:02:39", "summary": "The Greatest Showman is a 2017 American musical biographical drama film directed by Michael Gracey in his directorial debut, written by Jenny Bicks and Bill Condon and starring Hugh Jackman, Zac Efron, Michelle Williams, Rebecca Ferguson, and Zendaya. Featuring 9 original songs from Benj Pasek and Justin Paul, the film is inspired by the story of P. T. Barnum's creation of the Barnum & Bailey Circus and the lives of its star attractions.\nPrincipal photography began in New York City in November 2016. The film premiered on December 8, 2017, aboard the RMS Queen Mary 2. It was released in the United States on December 20, 2017, by 20th Century Fox, seven months after Ringling Bros. and Barnum & Bailey Circus ceased to exist, and grossed over $434 million worldwide, making it the fifth-highest grossing live-action musical of all time.\nThe Greatest Showman received mixed reviews from critics, with praise for the performances, music, and production value, but criticism for its artistic license, with some reviewers calling it \"faux-inspiring and shallow\". At the 75th Golden Globe Awards, the film received nominations for Best Motion Picture – Musical or Comedy and Best Actor – Musical or Comedy for Jackman. For the song \"This Is Me\", the film won the Golden Globe Award for Best Original Song and was nominated for Best Original Song at the 90th Academy Awards and won the Best Compilation Soundtrack for Visual Media at the 61st Annual Grammy Awards.", "plot": "In the mid-19th century, P. T. Barnum and his troupe perform a show at the circus (\"The Greatest Show (Part 1)\").\nAs a child, Barnum and his tailor father Philo work for the Hallett family. He becomes infatuated with their daughter Charity and they fall in love. Though Charity is being sent to finishing school, Barnum reassures her that they will not be separated. The two keep in touch through letters until they meet again in adulthood (\"A Million Dreams\"), eventually marrying and raising two daughters, Caroline and Helen, in New York City. They live a humble life; though Charity is happy, Barnum craves more.\nBarnum loses his job as a clerk at a shipping company after the company goes bankrupt, and returns home for Caroline's birthday (\"A Million Dreams (Reprise)\"). In a daring risk, he takes out a large loan from a bank, deceiving them into accepting his former employer's lost ships as collateral. He uses this loan to set up Barnum's American Museum in downtown Manhattan, an attraction showcasing various wax models. Initially, sales are slow. On the suggestion of his children to showcase something \"alive\", Barnum searches for \"freaks\" to serve as performers for his museum (\"Come Alive\"). He gathers a large group of them including Lettie Lutz. This attracts a large audience despite protests and poor reviews from James Gordon Bennett, prompting Barnum to rename his venture \"Barnum's Circus\".\nSearching for ways to further his reputation amongst the upper class, Barnum meets playwright Phillip Carlyle and convinces him to join his venture (\"The Other Side\"). Carlyle is mesmerized by the African American trapeze artist Anne Wheeler, but he hides his feelings. During a trip, Carlyle arranges for Barnum and his troupe to meet Queen Victoria. Afterwards, Barnum meets famed Swedish singer Jenny Lind, whom he convinces to perform in America with him serving as her manager. Lind's first American performance is a rousing success (\"Never Enough\"); during the song, Carlyle and Wheeler are spotted by Carlyle's parents as they are holding hands. As Barnum gains favor with the aristocratic patrons, he begins to distance himself from his troupe as he advises them to work on that night's show. Dejected, they decide to stand against their local harassers (\"This Is Me\").\nCarlyle and Wheeler attend the theatre together one night only to run into Carlyle's parents, who chastise Carlyle for \"parading around with the help\". Wheeler runs off, and Carlyle angrily berates them, then chases Wheeler and tries to convince her that they can be together, but she rejects him despite her feelings for him (\"Rewrite the Stars\"). As Barnum takes Lind on a US tour, Charity feels isolated from her husband as she stays home with their daughters (\"Tightrope\"). While on tour, Lind begins falling in love with Barnum. When he refuses her advances, she threatens to quit and orchestrates a kiss with him at the end of her last show, which is photographed by the press (\"Never Enough (Reprise)\").\nBarnum returns home to find his circus on fire, caused by a fight between the protesters and the troupe. Carlyle runs into the burning building, believing that Wheeler is still inside, and suffers serious injuries before being rescued by Barnum. Barnum gets word from a sympathetic Bennett that the culprits have been caught and that Lind has canceled her tour after her and Barnum's \"scandal\". Barnum's mansion is foreclosed upon and Charity takes their daughters to her parents' home.\nDevastated by his selfishness, Barnum retreats to a local bar where his troupe find him and explain that despite their disappointments, they still consider themselves a family that needs him. An inspired Barnum resolves to start a new show and not let ambition overtake his loved ones anymore (\"From Now On\"). Carlyle wakes in a hospital with Wheeler by his side. Barnum finds Charity and they mend their relationship.\nBarnum is faced with the financial difficulty of rebuilding the circus, but the recovering Carlyle steps in, offering to use his share of the circus's profits to rebuild it under condition of becoming a full partner, which Barnum happily accepts. To save money, Barnum transforms the enterprise into an open-air tent circus by the docks.\nThe revamped circus is a huge success (\"The Greatest Show (Part 2)\"). Barnum gives full control of the show to Carlyle to spend more time with his family.", "cast": "Pointe Ballerinas portrayed by Emerson Tate Alexander, Victoria Llodra, Louise Hindsbo, Laci Justice, GiaNina Paolantonio, Rachel Quiner, Madison Smith, and Brando Speach"}