{"_movieID": "92182", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:05:52", "summary": "Silent House is a 2012 American independent psychological horror film directed by Chris Kentis and Laura Lau, and starring Elizabeth Olsen. The plot focuses on a young woman who is terrorized in her family vacation home while cleaning the property with her father and uncle. The film is a remake of the 2010 Uruguayan film, La casa muda (lit. English:The Silent House), which was allegedly based on an actual incident that occurred in a village in Uruguay in the 1940s. It is notable for its use of \"real time\" footage and the manufactured appearance of a single continuous shot, similar to Alfred Hitchcock's Rope (1948).\nThe film premiered at the Sundance Film Festival in January 2011 and was subsequently purchased by Open Road Films and Universal Pictures for distribution. Silent House premiered in United States theaters on March 9, 2012. It opened at number 5 at the U.S. box office, earning $6.6 million during its opening weekend; it would go on to gross a total of $12.8 million domestically.", "plot": "A young woman named Sarah is staying at her family's dilapidated Victorian house in the countryside with her father John and her Uncle Peter, helping them fix it to be put up for sale. After a petty argument between John and Peter, Peter leaves and drives into town for extra tools. Sarah meets a young woman named Sophia at the front door. Sophia claims to be one of Sarah's childhood friends, though Sarah does not remember her.\nSoon after, Sarah panics when she hears her father falling down the stairs. She tries to leave the house but all exits are blocked, and she hides from an unknown perpetrator. She finds John unconscious with a head wound and runs to the basement in search of the cellar door that leads outside. She finds a bed and other evidence that someone else has been living there, possibly squatters. She sees a figure searching for her and escapes out the cellar door.\nOutside, she meets her uncle, who has returned, and sees a young girl on the road who disappears. Peter and Sarah discover her father's body missing in the house. The power goes off and the only source comes from a Polaroid camera's flash. Through a series of camera flashes, Sarah sees the young girl and a man in the room. The power returns to reveal Peter missing. Sarah hides while two men take pictures, presumably pedophilic in nature, of an unseen girl. Sarah unsuccessfully attempts to shoot one of the men with Peter's gun. She then hides in her room and begins to exhibit signs of paranoia and psychosis. She has hallucinations that depict traumatic childhood events, including a bloodstain on the bed and a young girl in the bathtub with beer bottles and bloody water.\nFrightened, Sarah flees and runs into Sophia. Her now-conscious father is wrapped in plastic, sitting in the living room. Sophia gives Sarah a key to a box containing pedophilic pictures of Sarah as a little girl, implying that her father sexually abused her. It is suggested that her recent interactions and hallucinations with the little girl and mystery attacker have been a traumatic repressed memory. Events at the house have caused this memory to reappear, and Sarah is now exacting her revenge. She has been confusing the difference between the events in her subconscious and her childhood and what she is actually doing now: likely a result of dissociative identity disorder. She assaults her father and uncle in her \"intruder\" mode while simultaneously wandering the house as a victim trying to escape.\nThe \"intruder\" drags Peter into the living room before it is revealed that it's actually Sarah herself. Sophia also turns out to be a figment of her imagination. Her father convinces Sarah to untie him, then whips her with his belt. Peter tries to stop him but her father mocks his brother's pleas. As his back is turned, Sarah bludgeons his head with a sledgehammer, killing him. Her uncle begs for mercy and tells her he should have stopped the rape and abuse from the hands of her father. Sarah leaves him and walks out silently.", "cast": "Elizabeth Olsen as Sarah\nAdam Trese as John\nEric Sheffer Stevens as Peter\nJulia Taylor Ross as Sophia\nAdam Barnett as Stalking Man\nHaley Murphy as Little Girl"}