{"_movieID": "57165", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:34", "summary": "Wrath of the Titans is a 2012 3D epic action adventure fantasy film that is a sequel to the 2010 film Clash of the Titans. The film stars Sam Worthington, Rosamund Pike, Bill Nighy, Édgar Ramírez, Toby Kebbell, Danny Huston, Ralph Fiennes, and Liam Neeson, with Jonathan Liebesman directing a screenplay by Dan Mazeau and David Leslie Johnson. Wrath of the Titans takes place a decade after the events of the preceding film as the gods lose control over the imprisoned Titans (thanks to humanity's lack of prayers which also is draining their immortality) and Perseus is called, this time to rescue his father Zeus, overthrow the Titans, and save mankind.\nTalk of a sequel began with the release of Clash of the Titans in March 2010. Scribes Dan Mazeau and David Leslie Johnson were hired in June 2010 and director Jonathan Liebesman was brought on board in August 2010. The majority of the casting took place between January and February 2011. Principal photography began in London in March 2011. Like its predecessor, the film was converted to 3D in post-production. Wrath of the Titans was released in 2D and 3D on March 30, 2012 in the United States. The film received widespread negative reception from critics and grossed $305 million worldwide. A sequel entitled Revenge of the Titans was planned for a 2013 release, but was cancelled due to the two films' critical failures and too few ideas for the script.", "plot": "Perseus (Sam Worthington), a son of Zeus (Liam Neeson), lives as a fisherman after the death of his wife, Io (portrayed by Gemma Arterton in the previous film), with his young son, Helius (John Bell). Zeus visits Perseus and asks for his help, saying that humans are not praying to the gods and as a result the gods are losing their power and becoming mortal. They can no longer sustain the walls of Tartarus which are crumbling, and the imprisoned Titan Kronos will soon be free. Perseus, valuing his family's safety, refuses to get involved.\nZeus meets his brothers Hades (Ralph Fiennes) and Poseidon (Danny Huston), and his son Ares (Édgar Ramírez) in Tartarus. He asks Hades's help in rebuilding Tartarus's walls, but Hades rejects the offer and attacks Zeus. Ares betrays Zeus, imprisoning him and stealing his thunderbolt. Hades and Ares plan to make a deal with Kronos: in exchange for remaining immortal, they will drain Zeus's divine power to revive Kronos. The walls of Tartarus break, unleashing monsters onto the world.\nAfter killing a Chimera that attacked his village, Perseus travels to meet his father. He instead finds a dying Poseidon who informs him of the circumstances and tells him to find his Demigod son Agenor (Toby Kebbell) who will lead him to Hephaestus, who knows the way into Tartarus. Poseidon then gives Perseus his trident and succumbs to the injuries he sustained when meeting Hades. Perseus, Andromeda (Rosamund Pike), and Agenor set out to find Hephaestus on a hidden island. Agenor explains that Hephaestus created three weapons which Zeus, Hades, and Poseidon wield: Zeus's thunderbolt, Hades's pitchfork, and Poseidon's trident, and that these weapons can jointly form the Spear of Trium, the only weapon that can defeat Kronos. After an encounter with Cyclopes, the travelers eventually meet the now mortal Hephaestus (Bill Nighy) and reach the entrance of a labyrinth leading to Tartarus. Hephaestus sacrifices himself during an attack by Ares to enable Perseus, Andromeda, and Agenor to enter the labyrinth. Once inside the labyrinth they encounter a Minotaur that attacks the group, but Perseus manages to kill it.\nThe group eventually enters Tartarus. Meanwhile, Zeus has been almost entirely drained of power as Kronos awakens. Zeus apologizes to Hades for banishing him to the underworld and asks his forgiveness, as he has forgiven Hades for his actions. Hades decides to help Zeus and stop Kronos in contrast to Ares, who still wants to proceed to the former's revival. Perseus arrives and frees Zeus. Ares wounds Zeus with Hades' pitchfork, allowing Perseus to obtain it before he and the others escape Tartarus with Zeus.\nAiming to retrieve Zeus' thunderbolt from Ares in order to defeat Kronos, Perseus challenges him to a duel. Ares accepts. Meanwhile, Andromeda's army is overwhelmed by the Makhai. Hades revives Zeus and together they defeat the creatures. Kronos appears and begins to attack Andromeda's army. Zeus and Hades hold off Kronos while Perseus duels Ares eventually killing him with the thunderbolt. Combining the gods' weapons into the Spear of Trium, Perseus destroys Kronos by traveling to its heart and throwing the spear into it.\nZeus reconciles with Perseus and then dies of his wounds. Hades tells Perseus that now he is powerless and leaves. Perseus kisses Andromeda, and Helius tells his father that he wants to return to his life as a fisherman, but Perseus tells him they can't. Perseus encourages Helius to be proud of himself, as his son and the grandson of Zeus. The film ends with Perseus giving his sword to Helius.", "cast": "Sam Worthington as Perseus, the demigod son of Zeus, who defeated the Kraken and saved humanity; Zeus enlists Perseus' help in order to defeat the Titan Kronos.\nLiam Neeson as Zeus, the god of the sky and ruler of Mount Olympus, Perseus' father.\nRalph Fiennes as Hades, the god of the underworld, who makes a deal with Kronos.\nRosamund Pike as Andromeda, who was saved by Perseus when she was a princess; now crowned Queen of Argos, she joins Perseus in his quest to defeat Kronos. Pike replaced Alexa Davalos in the role, due to a schedule conflict.\nBill Nighy as Hephaestus, the fallen god, forger of the gods' weapons.\nÉdgar Ramírez as Ares, the god of war, who betrays his father Zeus to join Hades.\nDanny Huston as Poseidon, the god of the sea, Agenor's father.\nToby Kebbell as Agenor, the demigod son of Poseidon; he joins Perseus in his quest to defeat Kronos.\nJohn Bell as Helius, the young son of Perseus.\nLily James as Korrina, a female soldier from Argos.\nSinead Cusack as Clea, Helius' teacher and guardian in Perseus' absence.\nMartin Bayfield as the Cyclops Elder, who leads Perseus and his group to Hephaestus.\nSpencer Wilding as Minotaur, the ferocious creature who guards the labyrinth."}