{"_movieID": "446021", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:18", "summary": "Bad Times at the El Royale is a 2018 neo-noir thriller film written, produced and directed by Drew Goddard. The film stars Jeff Bridges, Cynthia Erivo, Dakota Johnson, Jon Hamm, Cailee Spaeny, Lewis Pullman and Chris Hemsworth. Set in 1969, the plot follows seven strangers each hiding dark secrets, who come to a head one night in a shady hotel on the California-Nevada border.Bad Times at the El Royale premiered at Fantastic Fest on September 27, 2018, and was theatrically released in the United States on October 12, 2018. Although a box office failure, grossing $31 million worldwide against its $32 million budget, it received generally positive reviews from critics, with praise for its acting and Goddard's screenplay and direction, although some reviewers criticized the runtime and pacing.\n\n", "plot": "In 1959, in the aftermath of an armored car robbery, a nervous crook hides a bag of money under the floorboards of a hotel room. After resetting the furniture, an accomplice arrives at the hotel and betrays the crook, shooting him in the back.\nTen years later, four strangers coincidentally and simultaneously check in to the El Royale hotel, a bi-state establishment built along the California-Nevada border and once popular among high-profile celebrities and political figures.  The four strangers are Catholic priest Daniel Flynn (Bridges), singer Darlene Sweet (Erivo), vacuum salesman Laramie Sullivan (Hamm), and rebellious teen Emily Summerspring (Johnson).  They are assisted by the hotel's sole employee, Miles Miller (Pullman).  Sullivan demands to stay in the hotel's honeymoon suite, while Flynn requests Room 4.  Darlene and Emily are given rooms 5 and 7, respectively.\nOnce checked in, Sullivan calls his wife and daughter from the room's rotary phone, which he dismantles to remove a wire tap.  Unexpectedly, however, he discovers a second bug in the phone.  He then spends the afternoon removing from the room both what appear to be his own bugs as well as a second set of taps, about twenty in all.\nSuspicious of the mirror in his room, Sullivan then sneaks into the hotel's lobby and discovers a system of corridors which allow an observer to spy on several rooms through their respective two-way mirrors.  During his snoop, he watches Flynn unsuccessfully tear apart his floorboards, Darlene practice her singing, and Emily tie an apparent kidnapping victim to a chair.  Sullivan immediately uses the hotel's payphone to call the FBI, revealing himself to be an agent.  He is instructed to only concern himself with removing the hotel's wiretaps and to ignore the kidnapping in Room 7.  He does not obey, however, and attempts to rescue the hostage.\nMeanwhile, a defeated Flynn invites Darlene to join him for dinner in the hotel's lobby. She reluctantly accepts, and the two share an enjoyable conversation over slices of pie.  Flynn tells Darlene that he struggles with onset dementia.  He apologizes for any lapses in focus or memory that may have or might occur.  Collecting himself, he offers to make her a drink, which he drugs in an attempt to knock her out.  She witnesses the attempt and breaks a bottle of champagne over his head before fleeing the lobby.\nOnce outside, Darlene witnesses Sullivan sabotaging the cars in the parking lot, preventing anyone from leaving per the FBI's orders.  She further tails Sullivan and watches his aforementioned rescue attempt which ends with Emily shooting him with a shotgun, both killing him and accidentally revealing the nature of the mirror/ corridor.\nBack in the lobby, Miles discovers the unconscious and bloodied Flynn in a pile of broken glass and revives him.  Overcome with apparent guilt, Miles attempts to confess his life's many sins to the priest and inadvertently reveals to him the hotel's corridors.  While the two stand behind Emily's mirror in Room 7, he shamefully admits that his superiors instruct him to spy on politicians and film them for the sake of blackmail and extortion.  Flynn asks Miles if he ever kept any of the films for himself, and Miles recounts that he refused to expose one man who showed kindness to him.  As Flynn leaves to retrieve the particular film in question, leaving Miles alone in the hallway, Sullivan's rescue occurs and Miles is struck in the face with collateral buckshot.\nThe scene again resets, this time from the perspective of Room 7.  It is revealed that the hostage is actually Emily's younger sister, Rosie (Spaeny), whom she stole away from Billy Lee (Hemsworth), a dangerous yet charismatic hippie cult leader.  For reasons yet unknown, Emily does not trust Rosie to be untied.  She is freed, however, during Sullivan's attempted rescue.  While Emily crawls through the mirror to tend to Miles who was caught in the shotgun blast, Rosie calls Billy Lee from the room's rotary phone and tells him where they are.  She then follows Emily through the mirror and into the corridor.\nImmediately following the attack, Darlene, who watched it unfold from the parking lot, sneaks into Room 7 and lifts from Sullivan's corpse the cable he ripped from her engine, as well as his pistol.  Her car still does not start, and Flynn knocks on her window having himself just escaped the secret corridor where he left Miles.  He apologizes for spiking her drink and reveals that he is in fact not a priest, but the brother and accomplice of the crook who was murdered in 1959.\nFlynn continues that upon completing a ten-year prison sentence for the armed car robbery, he has returned to collect the money his brother buried.  He believes that while the money was not in Room 4, it may be in Room 5 and that he mixed up numbers as a result of his memory failures.  He spiked her cocktail in an attempt to break into her room to retrieve the money.  They reluctantly agree to dig up the floor together and split the money 50/50.\nBack in the lobby, Emily and Rosie tie Miles to a chair while he begs for his life.  Emily then steps away for a moment to search for Flynn and Darlene as they might potentially be witnesses to Sullivan's murder.  In the corridor, she watches Darlene practice her singing in Room 5.  In actuality, Darlene is acting as a diversion for Flynn, who is digging up the floor behind the bed.  Emily is moved by Darlene's performance and decides that she is yet innocent.  When she returns to the lobby, Billy Lee arrives at the hotel with an entourage of armed followers.  Darlene and Flynn are discovered and the four (Emily, Flynn, Miles, Darlene) are tied to chairs in front of a roulette table on which Flynn's money is dumped.  Along with the money is the incriminating film which Miles withheld and forfeited to Flynn.\nIn a sadistic game of psychological torture, Billy shoots and kills Emily before an unremorseful Rosie.  Miles attempts to finish confessing his sins before Billy accurately shouts that Flynn is not a priest.  Billy then tries to solicit information about the nature of the money and the apparent man in the film.  Frustrated with Flynn's refusal to cooperate, he threatens Darlene with a fatal game of roulette unless she would sing for him.\nShe obliges.  Insulted, Flynn attacks Billy.  Chaos ensues and both Darlene and Miles are thrown to the ground next to a dropped pistol.  Her hands tied, Darlene pleads with Miles to retrieve the gun and shoot their assailants.  Miles finally admits that his greatest sins are the 123 deaths he was responsible for as a soldier in the Vietnam war.  Darlene accepts both his guilt and their collective fates.  Encouraged by her compassion, Miles gathers himself and expertly kills Billy and his crew, saving Darlene and Flynn.  He attempts to console Rosie, who has returned to mourn Billy, but she turns and cuts his stomach open with a concealed knife.\nFlynn shoots Rosie and he and Darlene comfort Miles while he bleeds out on the lobby floor.  Though he cannot give medical aid, at Darlene's request he performs absolution for Miles' sins, once again pretending to be a Catholic priest.  Miles dies in peace, believing that he is finally forgiven for his grievous sins.  Flynn and Darlene collect the money and flee.\nThe next night, Flynn attends Darlene's jazz performance in Reno as her only apparent friend."}