{"_movieID": "536176", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:18", "summary": "Brexit: The Uncivil War (simply Brexit in the US) is a 2019 British television drama film written by James Graham and directed by Toby Haynes. It depicts the lead-up to the 2016 referendum through the activities of the strategists behind the Vote Leave campaign, that prompted the United Kingdom to exit the European Union, known as Brexit. It aired on Channel 4 in the United Kingdom on 7 January, and aired on HBO in the United States on 19 January. Benedict Cumberbatch stars as Dominic Cummings, the Campaign Director of the official designated  Brexit-supporting group, Vote Leave.", "plot": "Before the opening credits, a frustrated Dominic Cummings is shown at a future fictional public inquiry trying to explain that they have no understanding of the way in which technology is going to reshape politics, and therefore society, in the United Kingdom. After the opening credits, Cummings rejects an offer in 2015 by UKIP MP Douglas Carswell and political strategist Matthew Elliott to lead the Vote Leave campaign due to his contempt for \"Westminister politics\", but accepts when Carswell promises Cummings full control.  The next sequences show Cummings outlining the core strategy on a whiteboard of narrow disciplined messaging delivered via algorithmic database-driven micro-targeting tools. Cummings rejects an approach by Nigel Farage and Arron Banks of Leave.EU to merge their campaigns, as his data shows Farage is an obstacle to winning an overall majority.  Cummings' database-driven approach causes friction with Vote Leave MPs and donors, such as John Mills, who expect to conduct a traditional campaign using posters and phone-calls/leaflets delivered by local MPs.  Mills, who chairs the Vote Leave campaign, tries to have Cummings fired to merge with Leave.EU, however, he instead finds himself getting fired.\nThe film shows Cummings, and his Remain counterpart Craig Oliver, laying out their strategies and opinion of each other.  Both identify the third of UK voters who are still undecided as the key.  Oliver identifies \"Jobs and the Economy\" as their key message, which his focus-groups have highlighted.  Cummings, through his own informal research in pubs and meeting places, has identified \"Loss of Control\" as a common concern, and the possible accession of Turkey to the EU as a common fear.  Cummings invokes Sun Tzu's The Art of War philosophy (he quotes \"the 9th battlefield\" from the Art of War, Chapter XI '孙子兵法：九地'), not to contest the key messages of Remain, but to focus on their own messages.  In a eureka moment, Cummings refines the core message to \"Take Back Control\", thus positioning Vote Leave as the historical status quo, and Remain as the \"change\" option.  Cummings meets and hires Canadian Zack Massingham, co-founder of AggregateIQ, who offers to build a database using social media tools of voters who are not on the UK electoral register but are inclined to vote to leave.  In a separate sequence, Arron Banks meets Robert Mercer, who discusses the potential of social media database tools.\nThe film contrasts the progress of the two campaigns.  Cummings, using the AggregateIQ database, brings MP Douglas Carswell to Jaywick, a part of his constituency he did not know existed, where a couple articulate the destitution of their position.  Oliver, using the traditional focus-groups, and in a memorable scene, realises that his campaign has failed to understand the concerns of all UK voters, as a focus-group descends into a mass quarrel and a member breaks down crying \"I’m sick of feeling like nothing, like I have nothing! Like I know nothing. Like I am nothing. I’m sick of it!\".In the final stages, high-profile senior Tory MPs Michael Gove and Boris Johnson join the Vote Leave campaign emphasising the need to \"Take Back Control\", while Penny Mordaunt is shown on BBC raising concerns over the accession of Turkey. Gove and Johnson are shown as having some reticence over specific Vote Leave claims (e.g. £350 million for NHS, and 70 million potential Turkish emigrants) but are seen to overcome them.  Craig Oliver conducts an emergency Tory-Labour Remain conference call with David Cameron and Peter Mandelson, while feeding his children in his kitchen, to express his concerns, however, each side blames the other.  The murder of MP Jo Cox is announced, and in a fictionalised chance encounter, Cummings and Oliver share a drink and discuss events, with Cummings saying: \"The train coming down the tracks isn’t the one that you expected. It’s not the one that’s advertised on the board. Well, tough. It isn’t even the one that I imagined. But I accept it. And you can’t stop it\", and Oliver replying: \"Be careful what you wish for. You won’t be able to control it either\".The film then jumps to the referendum polling day on 23 June 2016, the announcement of the result and after a victory speech, Cummings quietly leaving the Vote Leave campaign office.  The closing sequence returns to the pre-opening credits fictional future public inquiry, and Cummings outlining his disappointment at how the political system reacted post the Vote Leave victory, eventually walking out in disgust.", "cast": "Benedict Cumberbatch as Dominic Cummings, main political strategist for Vote Leave\nRory Kinnear as Craig Oliver, main political strategist for Britain Stronger in Europe\nLee Boardman as Arron Banks, businessman and co-founder of Leave.EU\nRichard Goulding as Boris Johnson, Conservative MP and former Mayor of London who campaigned for Vote Leave\nJohn Heffernan as Matthew Elliott, political strategist for Vote Leave\nOliver Maltman as Michael Gove, Conservative MP who campaigned for Vote Leave\nSimon Paisley Day as Douglas Carswell, UKIP MP who campaigned for Vote Leave\nLucy Russell as Elizabeth Denham, the Information Commissioner\nPaul Ryan as Nigel Farage, UKIP MEP and prominent Leave campaigner\nKyle Soller as Zack Massingham, co-founder of AggregateIQ\nLiz White as Mary Wakefield, wife of Dominic Cummings\nKate O'Flynn as Victoria Woodcock, operations director for Vote Leave\nNicholas Day as John Mills, businessman and chairman of the board for Vote Leave\nTim McMullan as Bernard Jenkin, Conservative MP and board member of Vote Leave\nRichard Durden as Bill Cash, Conservative MP and board member of Vote Leave\nGavin Spokes as Andrew Cooper, political strategist and polling expert for Britain Stronger in Europe\nAden Gillett as Robert Mercer, US businessman and donor to Leave.EU\nMark Dexter as the voice of David Cameron, the Prime Minister\nMark Gatiss as the voice of Peter Mandelson, Labour peer and board member of Britain Stronger in Europe\nAnnabelle Dowler as the focus group facilitator\nGabriel Akuwudike as Robin, the \"ardent internationalist\" focus group participant\nJohn Arthur as Roger, the \"EU hostile\" focus group participant\nRakie Ayola as Camilla, the \"comfortable Europhile\" focus group participant\nJay Simpson as Steve, the \"strong skeptic\" focus group participant\nHeather Coombs as Sandra, the \"hearts vs heads\" focus group participant\nKiran Sonia Sawar as Shamara the \"disengaged middle\" focus group participant"}