{"_movieID": "83770", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:49", "summary": "On the Road is a novel by American writer Jack Kerouac, based on the travels of Kerouac and his friends across the United States. It is considered a defining work of the postwar Beat and Counterculture generations, with its protagonists living life against a backdrop of jazz, poetry, and drug use.  The novel, published in 1957, is a roman à clef, with many key figures of the Beat movement, such as William S. Burroughs (Old Bull Lee), Allen Ginsberg (Carlo Marx) and Neal Cassady (Dean Moriarty) represented by characters in the book, including Kerouac himself as the narrator Sal Paradise.\nThe idea for On the Road, Kerouac's second novel, was formed during the late 1940s in a series of notebooks, and then typed out on a continuous reel of paper during three weeks in April 1951. It was first published by Viking Press in 1957.\nWhen the book was originally released, The New York Times hailed it as \"the most beautifully executed, the clearest and the most important utterance yet made by the generation Kerouac himself named years ago as 'beat,' and whose principal avatar he is.\" In 1998, the Modern Library ranked On the Road 55th on its list of the 100 best English-language novels of the 20th century.  The novel was chosen by Time magazine as one of the 100 best English-language novels from 1923 to 2005.", "plot": "The two main characters of the book are the narrator, Sal Paradise, and his friend Dean Moriarty, much admired for his carefree attitude and sense of adventure, a free-spirited maverick eager to explore all kicks and an inspiration and catalyst for Sal's travels. The novel contains five parts, three of them describing road trips with Moriarty. The narrative takes place in the years 1947 to 1950, is full of Americana, and marks a specific era in jazz history, \"somewhere between its Charlie Parker Ornithology period and another period that began with Miles Davis.\"  The novel is largely autobiographical, Sal being the alter ego of the author and Dean standing for Neal Cassady."}