{"_movieID": "297725", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:00:56", "summary": "The Man Who Killed Don Quixote is a 2018 adventure-comedy film directed by Terry Gilliam and written by Gilliam and Tony Grisoni, loosely based on the novel Don Quixote by Miguel de Cervantes. Gilliam unsuccessfully attempted to make the film many times over the span of 29 years, which made it an infamous example of development hell.\nGilliam started working on the film in 1989, but was unable to secure funding until 1998 when it entered full pre-production with a budget of $32.1 million without American financing, with Jean Rochefort as Quixote, Johnny Depp as Toby Grisoni, a 21st-century marketing executive thrown back through time, and Vanessa Paradis as the female lead. Shooting began in 2000 in Navarre, but a significant number of difficulties such as sets and equipment destroyed by flooding, the departure of Rochefort due to illness, problems obtaining insurance for the production, and other financial difficulties led to a sudden suspension of the production and its subsequent cancellation. The original production was the subject of the documentary film Lost in La Mancha, which was intended to be a making-of but was released on its own in 2002.\nGilliam made repeated attempts to relaunch production between 2003 and 2016, which included Depp, Ewan McGregor and Jack O'Connell as Toby Grisoni and Robert Duvall, Michael Palin, and John Hurt as Quixote. However, all ended up being cancelled for various reasons, such as failing to secure funds, Depp's busy schedule and eventual loss of interest in the project, and Hurt being diagnosed with the cancer that would eventually result in his death. After yet another failed attempt, it was unexpectedly reported in March 2017 that filming had finally started, with Adam Driver, who was confirmed as Grisoni in 2016 and helped secure funding, and Jonathan Pryce as Quixote. On 4 June 2017, Gilliam announced that the shooting of the film was complete, 17 years after it originally started.\nThe Man Who Killed Don Quixote premiered on 19 May 2018, simultaneously acting as the closing film at the 2018 Cannes Film Festival and being released in French theaters. Gilliam faced difficulties in the process of releasing the film worldwide, partially due to a lengthy legal dispute with former producer Paulo Branco. Subsequently, the film was only released in a few other countries, including Belgium, Spain and Portugal; it was released in the United States and Canada on April 10, 2019.", "plot": "Toby Grisoni (Adam Driver), an advertising director, is struggling with the production of a commercial featuring Don Quixote and Sancho Panza in rural Spain. While in a restaurant after an unsuccessful day of shooting, Toby's superior, the Boss (Stellan Skarsgård), recommends he find inspiration and brings over a Romani man (Óscar Jaenada) who sells him an old DVD of The Man Who Killed Don Quixote, an amateur black-and-white film that Toby coincidentally wrote and directed ten years before as a student. Nostalgic, Toby watches the film while in an embrace with the Boss's wife Jacqui (Olga Kurylenko). When the Boss returns to the hotel room, Toby frantically escapes, taking the DVD while managing to disguise himself.\nA flashback shows Toby's production of his student film, casting elderly cobbler Javier (Jonathan Pryce) as the self-proclaimed knight. Javier initially falters in his impersonation of Quixote but notices a chance to rush to a woman's defence when a member of Toby's crew plays a prank on teenage waitress Angelica (Joana Ribeiro). Back in the present day, Toby finds that the shooting location of The Man Who Killed Don Quixote is not far from where he is currently filming. Taking a motorbike to Los Sueños, he learns that Angelica has moved away from her father Raul (Hovik Keuchkerian). While exploring, Toby meets Javier working as a tourist attraction. He discovers that the elderly cobbler has become convinced that he is the real Don Quixote, and that Toby is his squire, Sancho Panza. Through a series of accidents, Don Quixote causes a fire that spreads to the town as Toby escapes on the motorbike.\nAfter Toby returns to the set, the Boss urges him to blame the Romani man from the previous night for breaking into Jacqui's hotel room. Toby complies but the police officers soon notice that Toby's bike was the same one that was spotted in Los Sueños and take him in for questioning. En route, they encounter Don Quixote on his horse Rocinante, who sees Toby and demands that the officers release him. When they try to move him along, Quixote attacks them, culminating in one of the officers being shot and the Romani man stealing the police car. Toby runs off to a nearby garbage heap, where Quixote finds him. Supplying him with a donkey and clothes from the set, Quixote guides Toby to find adventures.\nStopping by the road to educate Toby on his adventures, Quixote notices a windmill and believes it is a giant attacking a woman. Receiving a head wound after being knocked by one of the windmill's blades, Quixote and Toby are led by the woman to a decrepit ruin occupied by impoverished people. The leader, Barbero (Sergi López), welcomes them warmly but locks them in an attic. That night, Toby comes to suspect that they are secretly terrorists that will hold them as hostages, but soon finds that the ruin has transformed into a 17th-century village. Hiding from guards that are looking for him, Toby manages to evade them when the Gypsy reappears. Toby awakens the next morning, the night's events having seemingly been a dream, and learns that the residents are not terrorists but undocumented immigrants in hiding.\nMoving on with Quixote, Toby stumbles upon a bag of old Spanish gold and attempts to hide it, but accidentally falls down a ravine into a cave behind a waterfall. There he encounters Angelica, who tells him that she works as a model and escort, and is the \"property\" of Alexei Miiskin, a Russian vodka company owner entering a business deal with the Boss. Angelica leaves when one of Miiskin's subordinates takes pictures of her and Toby. Quixote starts to lead Toby on a quest to find Angelica but soon enters a jousting match with the \"Knight of Mirrors\" who is really Raul. He and several other Los Sueños townspeople had been disguising themselves in an attempt to get Javier to come home. After Quixote rides off, Raul punches Toby for indirectly causing his daughter to become an escort.\nWaking up, Toby finds Quixote whipping himself with thorns to prove his love to Dulcinea del Toboso. Healing his wounds by a river, Toby is found by Jacqui on horseback, dressed extravagantly for a costume party by Miiskin. Upon entering Miiskin's castle, Toby sees the owner behave cruelly towards Angelica and later Javier. Toby tries to convince both of them to leave but Quixote refuses while Angelica is captured. When Toby thinks he has rescued Angelica, he finds Jacqui wearing a mask who reveals that the real Angelica is being burned alive by Miiskin as part of his entertainment. The Boss rushes to fight Toby but the man who comes through the door is in fact Quixote, who Toby accidentally knocks out of the window. Dying on the ground, Quixote gives Toby his sword, telling him that he never truly saw him as lowly. Angelica's burning is shown to be a special effect and Quixote dies while Toby recalls Quixote's claim of immortality.\nThe next morning, Toby attacks three windmills believing them to be giants. Angelica, who was helping him pay respects to Javier, tries to remind him of who she is. Eventually, the two agree to call her Sancho Panza and ride into the sunset.", "cast": "Adam Driver as Toby Grisoni, an advertising executive who comes back to the village where he filmed his student film ten years ago, and whom Quixote mistakes for his trusted squire Sancho Panza. Robin Williams, Johnny Depp, Ewan McGregor, and Jack O'Connell were all previously cast in the role.\nJonathan Pryce as \"Don Quixote\", an old Spanish shoemaker named Javier who played the part of Quixote in Grisoni's old student film, but has since become convinced he is actually the famous literary character. John Cleese, Jean Rochefort, Michael Palin, Robert Duvall, and John Hurt were all previously cast in the role; Pryce was also a part of the original 2000 production, in a different role.\nStellan Skarsgård as The Boss, Toby's superior.\nOlga Kurylenko as Jacqui, the Boss' wife.\nJoana Ribeiro as Angelica, a young woman who played a minor role in Grisoni's film ten years ago.\nÓscar Jaenada as the Gypsy, a mysterious character who keeps crossing paths with Grisoni.\nJason Watkins as Rupert, Toby's ambitious agent.\nSergi López as the Farmer.\nRossy de Palma as The Farmer's Wife.\nHovik Keuchkerian as Raul, Angelica's father.\nJordi Mollà as Alexei Miiskin, a cruel oligarch."}