{"_movieID": "281957", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:25", "summary": "The Revenant is a 2015 American semi-biographical epic Western film directed by Alejandro González Iñárritu. The screenplay by Mark L. Smith and Iñárritu is based in part on Michael Punke's 2002 novel of the same name, describing frontiersman Hugh Glass's experiences in 1823. That novel is in turn based on the 1915 poem The Song of Hugh Glass. The film stars Leonardo DiCaprio, Tom Hardy, Domhnall Gleeson, and Will Poulter.\nDevelopment began in August 2001 when producer Akiva Goldsman purchased Punke's manuscript. Iñárritu signed on to direct in August 2011 and in April 2014, after several delays due to other projects, Iñárritu confirmed that he was beginning work on The Revenant and that DiCaprio would play the lead role. Principal photography began in October 2014. Location and crew concerns delayed the film from May to August 2015.\nThe Revenant premiered at the TCL Chinese Theatre on December 16, 2015, and had a limited release on December 25, expanding on January 8, 2016. The film received largely positive reviews, and praise for its performances (particularly from DiCaprio and Hardy), direction, and cinematography. It won three Golden Globe Awards and five BAFTA Awards. At the 88th Academy Awards, the film received 12 nominations, including Best Picture and Best Supporting Actor (Hardy), winning Best Director (Iñárritu), Best Actor (DiCaprio), and Best Cinematography (Emmanuel Lubezki). DiCaprio also won the Golden Globe, Screen Actors Guild Award, BAFTA, and Critics' Choice Award for Best Actor.", "plot": "In late 1823, Hugh Glass guides Captain Andrew Henry's trappers through unorganized territory. While he and his half-Pawnee son, Hawk, are hunting, the company's camp is attacked by an Arikara war party seeking to recover their Chief's abducted daughter, Powaqa. Many of the trappers are killed during the fight, while the rest escape onto a boat. Guided by Glass, the survivors travel on foot to Fort Kiowa, as he believes traveling downriver will make them vulnerable. After docking, the crew stashes the pelts near the shore.\nWhile scouting game, Glass is attacked by a grizzly bear and left near death. Trapper John Fitzgerald, fearful of another Arikara attack, argues that the group must mercy-kill Glass and keep moving. Henry agrees, but is unable to pull the trigger; instead, he offers money for someone to stay with Glass and bury him after his death. When the only volunteers are Hawk and the young Jim Bridger, Fitzgerald agrees to stay for money, to recoup his losses from the abandoned pelts.\nAfter the others leave, Fitzgerald attempts to smother Glass but is discovered by Hawk. Fitzgerald, concerned that Hawk's loud reaction to him attempting to kill Glass could alert the Arikara, stabs Hawk to death as Glass watches helplessly. The next morning, Fitzgerald convinces Bridger, who is unaware of Hawk's murder, that the Arikara are approaching and they must abandon Glass. Bridger protests at first, but ultimately follows Fitzgerald after the latter leaves Glass half-buried alive in a makeshift grave. After they depart, Fitzgerald admits he lied about the Arikara approaching. When Fitzgerald and Bridger later meet Henry at the fort, Fitzgerald tells him that Glass died and Hawk vanished. Bridger is complicit in the lie about Glass's death, even though he knew nothing of Hawk's.\nGlass begins an arduous journey through the wilderness. He performs crude self-surgery and eludes the pursuing Arikara who are looking for Powaqa. Glass encounters Pawnee refugee Hikuc, who says that \"revenge is in the Creator's hands.\" The men share bison meat and travel together. After a hallucinogenic experience, Glass discovers Hikuc hanged by French hunters. He infiltrates their camp and sees the leader raping Powaqa. He frees her, kills several hunters, and recovers Hikuc's horse as Powaqa removes her rapist's genitals, leaving his own canteen behind. The next morning, Glass is ambushed by the Arikara and driven over a cliff on his horse. He survives the stormy night by eviscerating the horse and sheltering inside its carcass.\nA frightened French survivor staggers into Fort Kiowa and Bridger recognizes his canteen as Glass's. Believing it stolen, Henry organizes a search party. Fitzgerald, realizing Glass is alive, empties the outpost's safe and flees. The search party finds the exhausted Glass. Furious, Henry orders Bridger arrested, but Glass vouches that Bridger wasn't present when Fitzgerald murdered Hawk, and was later deceived by the higher-ranking Fitzgerald. Glass and Henry set out in pursuit of Fitzgerald.\nAfter the two split up, Fitzgerald ambushes, kills and scalps Henry. Glass uses Henry's corpse on his horse as a decoy and shoots Fitzgerald in the arm. He pursues Fitzgerald to a riverbank where they engage in a brutal fight. Glass is about to kill Fitzgerald, but spots a band of Arikara downstream. He remembers Hikuc's words and pushes Fitzgerald downstream into the hands of the Arikara. Elk Dog kills and scalps Fitzgerald and the Arikara (having found Powaqa) spare Glass. Heavily wounded and near death himself, Glass retreats into the mountains where he is visited by the spirit of his wife."}