{"_movieID": "309886", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:59:00", "summary": "Blood Father is a 2016 English-language French action crime thriller film directed by Jean-François Richet, written by Peter Craig based on his novel of the same name, and starring Mel Gibson, Erin Moriarty, Diego Luna, Michael Parks, and William H. Macy. The film had its world premiere at the 2016 Cannes Film Festival on 21 May 2016 and was released on 12 August 2016, by Lionsgate Premiere.", "plot": "Lydia buys bullets at a megastore for her boyfriend Jonah Pincerna and his gang. After loading up, the gang goes to kill a tenant family who apparently stole money the gang had stashed in the walls of their rented house. After killing a tenant, Jonah ties up another and presses Lydia to kill her. However, Lydia accidentally shoots Jonah in the neck, apparently killing him, and escapes the crime scene. She contacts her estranged father, John Link, an ex-convict and recovering alcoholic out on parole after serving seven years in prison. He picks up Lydia, takes her back to his trailer house, and learns that she is both a drug addict and an alcoholic. Some days pass by uneventfully, although Lydia receives death threat text messages from the gang members.\nOne night, members of Jonah's gang come to John's house. After failing to force themselves in, they open fire on the house and ram it with their SUV. John's neighbor and sponsor, Kirby, and other armed residents rush to intervene, and the gang retreats.\nReasoning that giving Lydia up to the police will put her in danger, John flees with her. Lydia tells John about her life after running away from home and about Jonah, who turns out to be a well-connected member of a Mexican drug cartel.\nThe father and daughter rest at a motel, where Lydia learns they have been linked to the tenants' deaths. They narrowly escape the police and a sicario (hitman) sent by the cartel.\nJohn attempts to request a favor from his former mentor and friend, Preacher, who makes a living by collecting and selling war memorabilia. Preacher agrees to help but changes his mind after learning of the reward for turning in Lydia. John overpowers Preacher and his wife, and escapes with Lydia on a 1997 Harley Softail motorcycle. They are pursued by two of Preacher's men, who are both killed in the chase.\nJohn travels to a prison where he meets Arturo, his former cellmate, to ask about Jonah's connections. He learns that Jonah himself stole the money from his cartel, blamed the tenants, and then murdered them to cover his tracks.\nAt the motel alone, Lydia receives a call from Kirby, who says she is in danger and advises her to head to a crowded public place, like a theater. At the cinema, Lydia is confronted by Jonah, who had survived his injury and who, with help from his gang, abducts her.\nAfter leaving the prison, John calls Kirby, but Jonah answers the phone, reveals that he has captured Kirby, and kills him. John warns Jonah against harming Lydia, citing his knowledge of Jonah's connections and bad standing with his family. John offers up his life for his daughter, and Jonah arranges to meet at a secluded spot in the desert.\nJohn goes back to Preacher's place, and picks up a landmine and some grenades and kills Preacher. He arrives at the meeting spot, and improvises a booby trap with his bike and the landmine. Jonah's men tie John up and put him in a car. As they prepare to leave, two of Jonah's men are killed by the trap. John kills the gang member inside the vehicle, but Jonah escapes. The sicario, having taken position at a vantage point, wounds John. Taking cover behind a car, John forces the sicario to get closer, and the two fatally shoot each other.\nJohn dies after telling his daughter she is a good girl. Jonah is arrested and incarcerated. While sitting down at a table, he's met by a visibly hostile gang led by Arturo, who smiles knowingly, implying that Jonah will be killed.\nOne year later, in a support group, Lydia reveals that she has been sober for a year and expresses gratitude for her father.", "cast": "Mel Gibson as John Link, Lydia's father, and an American war veteran and ex-con\nErin Moriarty as Lydia Link, Link's daughter\nWilliam H. Macy as Kirby, Link's AA sponsor\nDiego Luna as Jonah Pincerna, Lydia's boyfriend\nThomas Mann as Jason\nDale Dickey as Cherise\nMichael Parks as Tom \"Preacher\" Harris\nDaniel Moncada as Choop, the leader of the drug dealers\nRaoul Trujillo as The Cleaner\nRichard Cabral as Joker\nMiguel Sandoval as Arturo Rios"}