{"_movieID": "419472", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:08:15", "summary": "The Polka King is an American biographical comedy film directed by Maya Forbes and written by Forbes and Wallace Wolodarsky. The film is about real-life Polish-American polka band leader Jan Lewan, who was imprisoned in 2004 for running a Ponzi scheme. The film stars Jack Black as Lewan, as well as Jenny Slate, Jason Schwartzman, and Jacki Weaver. It premiered at the 2017 Sundance Film Festival on January 22, 2017. It was released on Netflix on January 12, 2018.The Polka King is based on a 2009 documentary about Lewan, The Man Who Would Be Polka King, directed by Joshua Brown and John Mikulak.\n\n", "plot": "The film opens at a performance of Jan Lewan's (Black) polka band in Pennsylvania. Near the close of the show, he brings his wife Marla (Slate) onstage. A former beauty queen, Marla is modeling some jewelry that Lewan sells at his souvenir store. After the concert, Jan recounts to a happy concertgoer how he and Marla met, and how he has worked every terrible job imaginable, from dishwasher to janitor, in order to achieve the American dream.\nThe clarinetist in his band, Mickey (Schwartzman), visits Jan at his gift shop in order to quit the band. Jan takes him to a pizza restaurant nearby, and urges him to stay, promising him more money. Mickey feels that Jan has enlarged the band to an unsustainable size, and he reveals that other members are thinking of quitting, especially after a rumor that Jan had hired a dancing bear to accompany the shows. Jan admits that the bear is now part of their act, but he insists that better times are ahead. He then picks up a pizza, and heads out to deliver it.\nAn elderly couple visits Jan and asks about investing in his band. He explains that they are guaranteed a 12% annual return on their investment. The state Securities and Exchange Commission office gets wind of the fact that Jan is taking on investors and sends investigator Ron Edwards (Smoove) to meet with him. Edwards informs Jan that he has not registered properly, making it illegal for him to accept investments. He gives Jan three days to return his investors' money and close down the operation.\nWith hundreds of thousands of dollars already invested, Jan has no way to meet the SEC deadline. He buys lottery tickets and asks to do more work at the pizza joint. When the elderly couple returns, asking to invest more money with him, Jan changes the corporate name on his forms and takes their money. He tells Edwards that he has officially closed down his first investment scheme, omitting the fact that he has started another.\nThe film follows Jan as he continues to expand his enterprises. Jan comes up with an idea to start a travel company offering European tours. He sells a package that climaxes at a private audience with the Pope. In Rome, he begs Mickey to help him bribe Vatican officials in order to secure the Papal audience. Realizing he lied to all the tour goers, Mickey threatens to expose Jan, but Jan explains that his philosophy is to simply say his goals out loud until they become true. He encourages Mickey to do the same, and Mickey explains that he has dreamt of creating a stage name for himself. Jan kneels with him in the hotel lobby and dubs him \"Mickey Pizzazz\".\nThinking that business will increase if Marla wins another beauty pageant, Jan bribes the judges in order to crown her Mrs. Pennsylvania. The ensuing controversy in the press causes some investors to want to withdraw their money or complain to the SEC. A second investigation reveals that Jan's Ponzi scheme has expanded into the millions of dollars. As he is arrested, Jan is exhilarated that God has finally let the truth be known.\nJan is sentenced to five years in prison. His cellmate slashes his throat, and Jan is glad, because he is treated better by everyone after surviving the attack. He is released from prison and returns to leading his polka band.", "cast": "Jack Black as Jan Lewan, Marla's husband and David’s father\nJenny Slate as Marla Lewan, Jan's wife and David's mother\nJason Schwartzman as Mickey Pizzazz, Jan’s best friend\nJacki Weaver as Barb, Jan's mother-in-law\nVanessa Bayer as Bitsy Bear\nJ. B. Smoove as Ron Edwards, an SEC officer\nWillie Garson as Lonny\nRobert Capron as David Lewan, Jan and Marla's son"}