{"_movieID": "454227", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:19", "summary": "Outlaw King is a 2018 historical action drama film about Robert the Bruce, the 14th-century Scottish King who launched a guerilla war against the larger English army. The film largely takes place during the 3-year historical period from 1304, when Bruce decides to rebel against the rule of Edward I over Scotland, thus becoming an \"outlaw\", up to the 1307 Battle of Loudoun Hill. Outlaw King was co-written, produced, and directed by David Mackenzie. It stars Chris Pine, Aaron Taylor-Johnson, Florence Pugh, Billy Howle, Sam Spruell, Tony Curran, Callan Mulvey, James Cosmo, and Stephen Dillane.\nIt premiered at the Toronto International Film Festival on September 6, 2018, and was released on November 9, 2018, by Netflix.", "plot": "In the year 1304, outside the besieged Stirling Castle, John Comyn, Robert Bruce, and other Scottish nobility surrender to Edward I of England. King Edward promises to return lands to the nobility in exchange for their homage. After the formalities have ended, Bruce spars with Edward's heir, the Prince of Wales, and the King weds Bruce to his goddaughter, Elizabeth de Burgh. James Douglas arrives to ask for the restoration of his ancestral lands but is dismissed by Edward, on the basis of the previous Lord Douglas's treason. The King and the Prince depart from Scotland, leaving its management to Comyn and Bruce, under the supervision of the Earl of Pembroke, Aymer de Valence. Elizabeth arrives to marry Bruce. On the wedding night, he respects his reluctant wife's wishes and delays the consummation. Bruce witnesses Englishmen conscripting his servants to the King's army. Not long after, his father, the Lord of Annandale, passes away, lamenting the loss of his friendship with the King of England, while admitting it may have been a mistake to trust Edward.\nTwo years later, after collecting taxes, Bruce notes how unpopular the English are. There is rioting after the public display of the quartered body of William Wallace, which spurs Bruce to plan another revolt. He discusses the issue with his family, who agree with him. Bruce tries to persuade John Comyn to join him, but the latter refuses and threatens to inform Edward about the plan. In a panic, Bruce stabs Comyn to death. The incident compels the clergy of Scotland to offer a pardon to Bruce, bargaining that he supports the Catholic Church in Scotland and he accepts the Crown of Scotland. Bruce accepts the deal, but King Edward soon hears of it. He declares Bruce an outlaw and, at his son's request, sends the Prince of Wales to crush the uprising, under the dragon banner, symbolizing the abandonment of chivalry and representing King Edward's order that no quarter to be shown to any supporter of Bruce.\nBruce calls a council of the nobles, where most refuse to break their oaths to Edward. Despite the lack of expected support, Bruce heads to Scone, where he is to be crowned. On the road, he encounters Douglas, who pledges his allegiance if Robert will help Douglas reclaim his birthright. In Scone, Bruce is crowned king of Scots. The ambitious de Valence decides to move against Bruce before the Prince arrives. Bruce wishes to avoid bloodshed and challenges de Valence to single combat. De Valence accepts but insists on delaying the duel a day, as it is Sunday. During the night, at Methven, Bruce finally consummates his marriage, but the English launch a surprise attack. Bruce sends his wife and Marjorie Bruce, to safety with his brother Nigel, and stays to fight a losing battle, during which most of the Scottish army is killed. Bruce escapes with fifty men. The group takes Angus' advice and flees to Islay. While traveling there, John MacDougall parleys with them. He is bitter about the murder of his cousin Comyn but allows the army to pass but later attacks Bruce's entourage as they're trying to cross Loch Ryan. Some of them get away in boats, but they cannot prevent the death of Robert the Bruce's brother Alexander.\nPrince Edward arrives in Scotland and searches for Bruce at Kildrummy Castle, only to find Bruce's wife, daughter, and brother. The sadistic prince has his brother hanged and drawn, and has Bruce's daughter and wife taken to England. Bruce's company meets up with Lord Mackinnon, who refuses to lend them any men. The band presses on with their voyage to Islay anyway; there, they learn of the fall of Kildrummy Castle. Bruce decides to take back the castle through stealth. The successful operation inspires Bruce to begin guerilla warfare. Shortly thereafter, Bruce is reunited with his other brother, Thomas. In England, Marjorie is separated from her stepmother Elizabeth to be given religious instruction by nuns. After Edward hears that Douglas Castle has been re-taken, he goes after Bruce himself. He offers Elizabeth a pardon if she will annul her marriage to Robert, but she refuses and is placed in a hanging cage.\nThe following year, King Edward dies shortly after arriving in Scotland, and the Prince of Wales takes control of his father's forces. In defiance of his father's dying wishes, he orders his late father's burial in Scotland. Bruce decides to fight the new king in a pitched battle at Loudoun Hill, despite being outnumbered six to one. Clan Mackinnon arrives to aid Bruce. Edward's army is composed almost entirely of cavalry, so Robert overcomes this army's size disadvantage by ensuring that during the battle,  the English cavalry charge into a spear wall hidden by a ditch, and thus incur heavy losses. Many horsemen attempt to attack the flanks but become bogged down in the mud, just as the Scots anticipated. As the English knights fall from their horses, many are slain, and the battle becomes an open brawl, wherein the ferocious Scots prevail over the disoriented English soldiers. Realising the battle is hopeless, de Valence orders a retreat. However, determined to kill his nemesis, Edward does not join the retreat. Instead, he engages in a duel with Bruce as the Scots look on. Although Bruce prevails, he allows Edward to leave unharmed. The epilogue reveals that Elizabeth was released as a part of a hostage exchange. The Prince of Wales was crowned King Edward II, only to be killed by his own lords. Three hundred years later, Robert's descendant unified the crowns of England and Scotland.", "cast": "Chris Pine as Robert the Bruce\nAaron Taylor-Johnson as James Douglas, Lord of Douglas\nFlorence Pugh as Elizabeth de Burgh\nBilly Howle as Edward, Prince of Wales\nTony Curran as Angus MacDonald\nLorne MacFadyen as Neil Bruce\nAlastair Mackenzie as Lord Atholl\nJames Cosmo as Robert de Brus, 6th Lord of Annandale\nCallan Mulvey as John Comyn III, Lord of Badenoch\nStephen McMillan as Drew Forfar, Squire\nPaul Blair as Bishop Lamberton\nStephen Dillane as King Edward I of England\nSteven Cree as Christopher Seton\nKim Allan as Isabella MacDuff, Countess of Buchan\nSam Spruell as Aymer de Valence, 2nd Earl of Pembroke\nRebecca Robin as Margaret of France, Queen of England\nJamie Maclachlan as Roger De Mowbray\nBenny Young as Sir Simon Fraser\nClive Russell as Lord MacKinnon of Skye\nJosie O'Brien as Marjorie Bruce"}