{"_movieID": "246860", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:41", "summary": "Clouds of Sils Maria (known simply as Sils Maria in some territories) is a 2014 drama film written and directed by Olivier Assayas, and starring Juliette Binoche, Kristen Stewart, and Chloë Grace Moretz. The film is a French-German-Swiss co-production. Principal photography took place from August to October 2013, with most of the filming taking place in Sils Maria, Switzerland. The film follows an established middle-aged actress (Binoche) who is cast as the older lover in a romantic lesbian drama opposite an upstart young starlet (Moretz). She is overcome with personal insecurities and professional jealousies—all while sexual tension simmers between her and her personal assistant (Stewart). The screenplay was written with Binoche in mind and incorporates elements from her life into the plot.Clouds of Sils Maria was selected to compete for the Palme d'Or in the main competition section at the 2014 Cannes Film Festival on 23 May 2014, and also screened at the Toronto International Film Festival and New York Film Festival. The film received positive reviews, with critics lauding the work as psychologically complex and praising the lead actresses' performances. It won the Louis Delluc Prize for Best Film in December 2014, and received six Cesar Award nominations. Stewart received the César Award for Best Supporting Actress in February 2015.\n\n", "plot": "Maria Enders (Juliette Binoche) is an international film star and stage actress. She travels with a loyal young American assistant, Valentine (Kristen Stewart). Twenty years earlier, Maria got her big break when she was cast and successfully performed as a young girl \"Sigrid\" in both the play and film versions of Maloja Snake by Wilhelm Melchior, a Swiss playwright who is now elderly. The play centres on the tempestuous relationship between Sigrid and \"Helena,\" a vulnerable older woman. Helena commits suicide after Sigrid takes advantage of her, and dumps her.\nWhile travelling to Zurich to accept an award on behalf of Wilhelm, and planning to visit him at home the following day at his house in Sils Maria – a remote settlement in the Alps – Maria learns of his death. His widow Rosa later confides that Wilhelm had ended his life and had been terminally ill. During the awards ceremony, Maria is approached by Klaus Diesterweg, a popular theatre director. He wants to persuade her to appear on stage in Maloja Snake again, but this time in the role of Helena, the older woman.\nMaria is torn and reluctantly accepts. To prepare for the role, she accepts Rosa's offer to stay at the Melchiors' house in Sils Maria. Rosa is leaving to escape her memories of Wilhelm. Maria's discussions with Valentine and their read-throughs of the play's scenes evoke uncertainty about the nature of their relationship. A young American actress, 19-year-old Jo-Ann Ellis (Chloë Grace Moretz), has been chosen to interpret the role of Sigrid. Researching her on Google and the internet, Valentine tells Maria, who is out of touch with social media, that Ellis has been involved in numerous scandals.\nQuestions soon multiply regarding aging, time, culture and the blurring line between the Sigrid/Helena and the Valentine/Maria relationships. Maria and Jo-Ann finally meet, but their relationship is complicated. Jo-Ann appears to be implicated in the attempted suicide of the wife of her new (and married) boyfriend.\nDuring their time at Sils Maria, Maria and Valentine spend much of their days hiking in the Alps. On one such final outing, they hike to the Maloja Pass – to observe a fascinating early morning cloud phenomenon that appears low in the pass (the \"Maloja Snake\" of the play's title, but also the \"Clouds of Sils Maria\" in the film's title). Valentine suggests that Helena may not commit suicide but simply walk away to start a new life. Maria protests that Helena walks into the mountains never to return and must therefore be dead. After suggesting that their approaches to the play are too different for her (Valentine) to be a useful assistant, a disconsolate Valentine disappears without explanation, never to reappear.\nA few weeks later, a young filmmaker who has previously sent a script to Maria visits her by appointment five minutes before the curtain rises on the opening night of Maloja Snake in London. Maria seems preoccupied, so near to curtain rise, and dismisses his suggested ideas about the proposed film role he is offering her as \"too abstract for me\". When she says the role he has written is too young for her and would suit Jo-Ann better, he suggests that the character is ageless and that he does not relate to the era we are in with its internet scandals and trashy values. Clearly he admires her and her work. Maria does not give him a reply as to whether she will take part in the film. Then she is on stage, smoking and waiting for Sigrid."}