{"_movieID": "43074", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:13", "summary": "Ghostbusters is a 1984 American fantasy comedy film directed by Ivan Reitman and written by Dan Aykroyd and Harold Ramis. It stars Bill Murray, Aykroyd, and Ramis as, respectively, Peter Venkman, Raymond Stantz, and Egon Spengler, a trio of eccentric parapsychologists who start a ghost-catching business in New York City. The film also stars Sigourney Weaver and Rick Moranis, and features Annie Potts, William Atherton, and Ernie Hudson in supporting roles. \nBased on his own fascination with spirituality, Aykroyd conceived Ghostbusters as a project for himself and John Belushi. The protagonists would travel through time and space to combat a host of demonic and supernatural threats. Following Belushi's death, and with Aykroyd's concept deemed financially impractical, he was paired with Ramis to rewrite the script to set it in New York City and make it more realistic. Ghostbusters was the first comedy film to employ expensive special effects. There was concern about the budget it would require, and little faith in its potential for box office success. On an approximate $25–30 million budget, filming took place between October 1983 to January 1984, on location in New York City and Los Angeles, and on sets at Burbank Studios, Los Angeles. Competition for special effects studios among various movies in development at the time meant that part of the budget was used to co-found a new studio under Richard Edlund. He used a combination of practical effects, miniatures, and puppets to deliver the ghoulish visuals.\nGhostbusters was released on June 8, 1984, to critical acclaim and became a cultural phenomenon. It was well-received for its deft blend of comedy, action, and horror, and Murray's performance was repeatedly singled out for praise. The film earned $282.2 million during its initial theatrical run, making it the second highest-grossing film of that year, and the highest-grossing comedy of all time at that point. It was the number one film in theatres for seven consecutive weeks and was one of only four films to gross more than $100 million that year. Further theatrical releases have increased the total gross to approximately $295.2 million, making it the most successful comedy film of the 1980s. In 2015, the Library of Congress selected it for preservation in the National Film Registry, finding it \"culturally, historically, or aesthetically significant\". Its theme song, \"Ghostbusters\" by Ray Parker Jr., was also a number one hit.\nGhostbusters was followed in 1989 by a sequel, Ghostbusters II, which fared less well financially and critically. Repeated attempts to develop a further sequel had ended following Ramis' death in 2014. A 2016 reboot, also called Ghostbusters, was released to mixed reviews and financial failure. A second, direct sequel Ghostbusters 2020 is scheduled for release in 2020. With its impact on popular culture, and a dedicated fan following, the success of Ghostbusters launched a multi-billion dollar multimedia franchise. This includes the popular animated television series The Real Ghostbusters (which itself spawned a media franchise), its sequel series Extreme Ghostbusters, video games, board games, comic books, clothing, music, books, food, toys, collectables, and haunted houses.", "plot": "Peter Venkman, Raymond Stantz, and Egon Spengler are scientists at Columbia University investigating the paranormal. Following their first encounter with a ghost manifesting at the New York Public Library, the dean fires them and dismisses the credibility of their research. In response, they create \"Ghostbusters\", a paranormal investigation and elimination service. They convert a disused firehouse, develop high-tech equipment to capture and contain ghosts, and convert a combination car into the \"Ectomobile\" to support their business.\nSeeing their television ad, a skeptical cellist, Dana Barrett, is initially dismissive but reluctantly calls them after a paranormal encounter in her kitchen. Recounting the event, she describes opening her refrigerator and seeing a creature that utters a single word: \"Zuul\". Venkman reassures her and becomes romantically interested, while Stantz and Spengler research her claims. Business is slow until they are hired to remove a ghost from the Sedgewick Hotel. There, Egon warns the group never to cross the energy streams of their proton pack weapons, as this could cause a catastrophic explosion. They capture their first ghost and deposit it in a special containment unit in the firehouse. \nSoon their business booms as paranormal activity increases across New York City. To cope with demand, they hire a fourth member, Winston Zeddemore. Suspicious of their operation, Walter Peck, an Environmental Protection Agency inspector, asks to evaluate their equipment but leaves after Venkman insults him. Privately, Egon warns the team the increase in supernatural activity is becoming dangerous and their equipment is at risk of failing under the stress.\nVenkman meets with Dana. He shares that Zuul was a demigod worshiped as a servant to \"Gozer the Gozerian\", a shape-shifting god of destruction. He convinces Dana to discuss her case further over dinner. However, when Dana returns home, she is supernaturally assaulted and possessed by Zuul. In a nearby apartment, a nearly identical entity manifests, then chases and possesses her neighbor, Louis Tully. Venkman arrives and finds the possessed Dana/Zuul claiming to be \"the Gatekeeper\". Louis, also possessed, is found by police officers and claims he is \"Vinz Clortho, the Keymaster of Gozer\". The Ghostbusters agree they need to regroup but keep the pair separated.\nPeck returns with law enforcement and city workers to have the Ghostbusters arrested and orders the deactivation of their ghost containment system. Stressed beyond capacity, the shutdown causes an explosion that releases the captured ghosts, and Peck promptly has them arrested. Louis/Vinz manages to escape in the confusion and makes his way to the apartment building where he meets Dana/Zuul. In jail, Stantz and Egon reveal that Dana’s building is the true source of the supernatural increase. The architect was a genius, and cult leader of Gozer-worshippers, who designed it to channel ghosts to bring about the end of the world. Faced with chaos in the city, the Ghostbusters convince the mayor to release them over Peck’s protests. \nOn the apartment building roof, Dana/Zuul and Louis/Vinz open the gate between dimensions and transform into supernatural creatures just as the Ghostbusters arrive. Gozer, in the form of a woman, arrives, and Stantz attempts to reason with her first. When this fails, Gozer attacks, forcing the Ghostbusters to attempt to trap her, but she disappears. Her disembodied voice demands the Ghostbusters \"choose the form of the destructor\". Raymond inadvertently recalls a beloved corporate mascot from his childhood, and Gozer reappears in the form of a giant, \"Stay Puft\" marshmallow man that proceeds to attack the city. Egon tells the team to ignore his earlier advice and cross their proton energy streams at Gozer's portal. The resulting explosion destroys Gozer’s marshmallow man form, banishes it from this dimension, and closes the portal. The Ghostbusters rescue Dana and Louis from the wreckage and are welcomed on the street as heroes.", "cast": "Bill Murray as Peter Venkman\nDan Aykroyd as Raymond Stantz\nSigourney Weaver as Dana Barrett\nHarold Ramis as Egon Spengler\nRick Moranis as Louis Tully\nAnnie Potts as Janine Melnitz\nWilliam Atherton as Walter Peck\nErnie Hudson as Winston ZeddemoreIn addition to the main cast, Ghostbusters features David Margulies as Lenny Clotch, Mayor of New York, Michael Ensign as Manager of the Sedgewick Hotel, and Slavitza Jovan as Gozer (voiced by Paddi Edwards). The film also features astrologist Ruth Hale Oliver as the Library Ghost, Alice Drummond as the Librarian, Jennifer Runyon and Steven Tash as Venkman's psychological test subjects, Playboy Playmate Kymberly Herrin as a Dream Ghost, Timothy Carhart as a violinist, and Reginald VelJohnson as a police officer. Roger Grimsby, Larry King, Joe Franklin, and Casey Kasem cameo as themselves, the latter in a voice-only role. Kasem's wife Jean appears in the film as the tall guest at Louis' party. The film also features appearances by pornstar Ron Jeremy, and a young Debbie Gibson. Director Ivan Reitman provided miscellaneous ghost voices, including that of Slimer."}