{"_movieID": "461556", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:45:49", "summary": "Now You See Me is a 2013 American heist thriller film directed by Louis Leterrier and written by Ed Solomon, Boaz Yakin, and Edward Ricourt. The film features an ensemble cast of Jesse Eisenberg, Mark Ruffalo, Woody Harrelson, Isla Fisher, Dave Franco, Mélanie Laurent, Michael Caine, and Morgan Freeman. The plot follows an FBI agent and an Interpol detective who track a team of illusionists who pull off bank heists during their performances and reward their audiences with the money, attempting to bring them to justice. This is the first installment of a series.\nThe film premiered in New York City on May 21, 2013 before its official release in the United States on May 31, 2013 by Summit Entertainment. The film received mixed reviews from critics but became a box office success, grossing $351.7 million worldwide against a budget of $75 million. The film won the Favorite Thriller Movie at the People's Choice Awards in 2014 and also received nominations for the Empire Award for Best Thriller and the Saturn Award for Best Thriller Film and Best Music. A sequel was released on June 10, 2016.", "plot": "Four stage magicians, J. Daniel \"Danny\" Atlas (Jesse Eisenberg), Merritt McKinney (Woody Harrelson), Henley Reeves (Isla Fisher), and Jack Wilder (Dave Franco), are each given a tarot card that leads them to the same empty New York City apartment where they find information from an unknown benefactor.\nA year later, the four have their first major performance as the Four Horsemen in an elaborate Las Vegas show funded by insurance magnate Arthur Tressler (Michael Caine). Their final trick appears to transport one of the audience members to the vault of his bank, the Crédit Républicain in Paris, where stacks of new euro bills are stored. At the magicians' command, the fans in the vault activate, drawing the bills into the vents and then showering the Las Vegas crowd with them. The euros are shown to be real, and the vault in Paris is found to be empty of its recent shipment of euros. FBI agent Dylan Rhodes (Mark Ruffalo), and Interpol agent Alma Dray (Mélanie Laurent), are then partnered to investigate the Horsemen. The two question the magicians but have no evidence to hold them. Dylan and Alma turn to Thaddeus Bradley (Morgan Freeman), a former magician and now a popular video host who makes millions of dollars exposing the tricks behind magic acts. Thaddeus demonstrates how the Horsemen used a mock vault under the Las Vegas stage, and explains that the group must have stolen the money in Paris before it arrived at the bank, and replaced it with flash paper which ignited but left no residue as evidence.\nDylan, Alma, and Thaddeus follow the Horsemen to their next show in New Orleans. There their final trick appears to transfer over 140 million dollars from Tressler's private accounts to those in the audience, made up of people that were denied insurance claims by Tressler's company in the wake of Hurricane Katrina. Dylan and Alma attempt to apprehend the four, but the magicians elude arrest. Tressler hires Thaddeus to expose the Horsemen in revenge for the loss of his money. Alma investigates the Horsemen and determines they are connected to a group called the Eye, a small group of magicians that claim to have access to real magic and only accept the best of the best magicians, who have to be invited and pass tests. She finds out that one of the Eye's members, Lionel Shrike, had previously been exposed by Thaddeus, but died in a locked-safe escape trick he was performing in an attempt to regain his standing. Alma suspects a fifth person is aiding the Horsemen.\nDylan discovers his cellphone has been stolen and bugged by the Horsemen, allowing them to access the FBI servers and remain ahead of the investigation. Tracking the real phone leads the FBI to a New York City apartment. When they raid it, three of the Horsemen escape while Jack recovers numerous documents and then leads the authorities on a high-speed car chase. Jack loses control of his car, causing it to flip and catch fire. Dylan is unable to save Jack, but manages to recover the papers, pointing to the Horsemen's next planned crime, stealing millions of dollars in cash out of a large safe of the Elkhorn company. By the time Dylan, Alma, and Thaddeus find the safe it had just been stolen and loaded into a truck. They quickly apprehend the truck, arrange for it to be delivered to its arranged destination, and Dylan hides inside. But when it arrives, and is opened by Bradley and his assistant, it contains nothing but balloon animals.\nThe Horsemen broadcast that they will perform their final show that night at 5 Pointz, inviting the public to attend. The FBI and police converge on the scene and amid the chaos search for the Horsemen. The remaining Horsemen appear to the crowd, giving their fans a farewell and a message about an ulterior purpose, and then run to jump off a roof; Dylan attempts to shoot them but Alma pushes his arm so he misses. The three Horseman jump, turning into a shower of money over the crowd. The money is counterfeit, but the audience's race to collect it prevents the authorities from tracking the real Horsemen.\nAfter the show, Thaddeus walks to his car, only to find it full of the money stolen from the Elkhorn safe. Assumed to be the fifth Horseman, he is arrested. Dylan speaks to Thaddeus in jail, where Thaddeus slowly comes to realize that Alma's theory was correct, and Dylan was the fifth Horseman. Dylan quietly walks away, leaving Thaddeus shouting \"Why?\" Elsewhere, the Horsemen (including Jack, who had faked his death using a cadaver and a duplicate car) meet at the carousel in Central Park, and use their tarot cards to turn it on. Dylan arrives and welcomes the four to the Eye.\nLater, at the Pont des Arts, Dylan meets with Alma and reveals that he is Shrike's son. He brought the Horsemen together to get retribution for his father's death: the Elkhorn Safe Company for providing a faulty safe that led to the accident; Thaddeus, for humiliating and impoverishing his father and forcing him to try the new trick to regain his standing; and the Crédit Républicain and Tressler's insurance companies for failing to pay out on Shrike's life insurance. Alma, who has come into a romantic relationship with Dylan, easily decides not to turn him in. She takes a lock and a key that Dylan produces, attaches the lock among the other love locks on the railing, and throws the key into the Seine.\nIn a post-credits scene, the Horsemen, driving through a desert, approach a junkyard full of old magician memorabilia, before getting out of their car and slowly beginning to examine the area before coming upon a set of crates covered in the symbol of The Eye, the playing card key of which to open them McKinney has forgotten.", "cast": "Jesse Eisenberg as J. Daniel \"Danny\" Atlas / The Lover: An arrogant illusionist and street magician, and the ostensible leader of the Four Horsemen.\nWoody Harrelson as Merritt McKinney / The Hermit: A hypnotist, mentalist, and a self-proclaimed psychic. Originally more famous in his youth, his manager brother absconded with all his money, leaving McKinney with a long hard trek back to his former glory. Middle-aged, McKinney is the oldest of the Four Horsemen.\nIsla Fisher as Henley Reeves / The High Priestess: An escapist and stage magician. She is also J. Daniel Atlas' former assistant and ex-lover.\nDave Franco as Jack Wilder / Death: A sleight of hand illusionist, street magician, and a talented impressionist of other people's voices. Additionally, he is a pickpocket, and is able to pick locks. In his early twenties, Wilder is the youngest of the Four Horsemen.\nMark Ruffalo as Dylan Rhodes-Shrike, an FBI agent struggling to capture and bring the Four Horsemen to justice for their unique heist agenda. In the end, he is revealed to be an illusionist, a member of the Eye himself, Lionel Shrike's son and the mastermind behind the entire heist mission.\nMélanie Laurent as Alma Dray, a French Interpol agent who is partnered up with Dylan Rhodes to investigate the Four Horsemen.\nMorgan Freeman as Thaddeus Bradley, an ex-magician who, for thirty years, has profited by revealing the secrets behind other magicians' tricks.\nJessica Lindsey as Hermia, Thaddeus Bradley's assistant.\nMichael Caine as Arthur Tressler, an insurance magnate and the Four Horsemen's sponsor.\nDavid Warshofsky as FBI Agent Cowan.\nMichael Kelly as Agent Fuller, an FBI agent who serves as Rhodes' sidekick.\nCommon as Agent Evans, Rhodes's supervisor at the FBI.\nJosé Garcia as Étienne Forcier, the account holder at the Crédit Républicain de Paris.\nCaitriona Balfe as Jasmine Tressler, Arthur Tressler's young wife.\nElias Koteas as Lionel Shrike, a magician who drowned while performing an escape trick thirty years earlier. Dylan is revealed to be his son at the end of the movie.\nConan O'Brien as himself"}