{"_movieID": "316154", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:09:15", "summary": "The Bad Batch is a 2016 American dystopian thriller film directed and written by Ana Lily Amirpour. The film is about a young woman (Suki Waterhouse) exiled to a desert where she is attacked by a group of cannibals (led by Jason Momoa), barely escaping alive to a bizarre settlement run by a charismatic leader (Keanu Reeves). Other actors include Jim Carrey, Giovanni Ribisi, and Diego Luna.\nIt was selected to compete for the Golden Lion at the 73rd Venice International Film Festival. It was released in theaters on June 23, 2017, by Neon.", "plot": "A young woman named Arlen is dropped inside a locked, fenced-in desert where people being deemed undesirable by society (the \"bad batch\") are forced to fend for themselves. A sign declares that the area is considered outside of the U.S., and that American laws and citizenship no longer apply. Arlen is soon kidnapped by two women in a golf cart. When she wakes chained up, a woman cuts off her right arm and leg. Arlen later tricks the woman into unchaining her, kills her, observes cannibalism of human limbs, and escapes crawling on a skateboard. She is rescued in the desert by a mute hermit who takes her to a makeshift settlement named Comfort, which resembles a rave, as there is a DJ and all-night dances.\nFive months later a healed Arlen now has a prosthetic leg and a home in Comfort. She walks out to the desert with a pistol. She sees a golf cart similar to the one used by the cannibals who captured her, and finds a woman and little girl scavenging in a garbage dump. Accusing the woman of being part of the cannibal community, Arlen shoots her in the head. She takes the girl back to Comfort, observed by the hermit. In Comfort, Arlen takes a hallucinogen at a rave held by The Dream, the cult-like leader of Comfort, and loses track of the child, who is taken in by The Dream. Meanwhile, Miami Man, a leader of the cannibals, and the father of the girl, goes looking for her, finding the dead woman. The hermit, in exchange for a hand-sketched portrait, informs Miami Man to \"find Comfort.\" Hallucinating, Arlen wanders out into the desert, where Miami Man finds her. Upon threat of death, he demands that she find his daughter in Comfort.\nArlen and Miami Man grow closer on their journey to Comfort, with Arlen beginning to look longingly at him. He kills another cannibal who is looking to trade gasoline for her flesh, and reveals that he was put into the lawless territory because he was an illegal immigrant from Cuba. However, another man shoots Miami Man in the chest, and rescues a somewhat reluctant Arlen back to Comfort. She searches for the girl, eventually discovering she is living in The Dream's mansion, along with his large harem of pregnant, young women. \nArlen visits The Dream, who explains that Comfort's economy is run on the drugs his concubines make, and that Comfort is free of feces because of the plumbing he provides. Arlen agrees to join his harem, but then uses a pistol she has hidden inside her prosthetic to hold one of the pregnant concubines hostage, managing to extract the girl. They head out of Comfort in a golf cart, and soon reunite with Miami Man, who had been found and healed by the hermit. \nThe child and Miami Man blissfully reunite, and Arlen implies she would rather stay with him in the desert than live in Comfort. Miami Man tries to discourage her, deeming her unable to survive out in the harsh desert; but does not send her away. The daughter asks for spaghetti, as she had started to grow accustomed to good things in the mansion. Instead, Miami Man takes his daughter's pet rabbit, and later the three of them lounge by a fire eating it. Miami Man rubs his teary daughter's back, and then he and Arlen look into each other's eyes, smiling.", "cast": "Suki Waterhouse as Arlen\nJason Momoa as Miami Man\nKeanu Reeves as The Dream, the leader of the Comfort settlement\nJim Carrey as the Hermit\nYolonda Ross as Maria\nGiovanni Ribisi as Bobby\nJayda Fink as Honey\nDiego Luna as Jimmy\nCory Roberts as the Bridgeman\nE.R. Ruiz as Lone Man\nEmily O'Brien as Dream Girl"}