{"_movieID": "260346", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:42", "summary": "Taken 3 (sometimes stylized as Tak3n) is a 2014 English-language French action thriller film directed by Olivier Megaton and written by Luc Besson and Robert Mark Kamen. It is the third and final installment in the Taken trilogy. The film stars Liam Neeson, Forest Whitaker, Maggie Grace and Famke Janssen.\nThe film was released in France on 21 January 2015 and in the United States on 9 January 2015, by 20th Century Fox. It received generally unfavorable reviews from critics and grossed $326 million worldwide.", "plot": "Former covert operative Bryan Mills visits his daughter, Kim, to deliver an early birthday gift. After an awkward visit, he invites his ex-wife, Lenore, to dinner. Although she declines, she shows up at his apartment and tells him about her marital problems. He agrees to let her try to work things out with her current husband Stuart.\nStuart comes to see Bryan and asks him never to see his wife again—despite the fact he is aware they have a daughter together. Without Bryan's knowledge he uses his phone to arrange a meeting with Lenore making out it is Bryan that wants to meet her then promptly deletes the message after it is sent. It is in this location she gets kidnapped.\nThe following day, Bryan receives a text from Lenore asking to meet him for breakfast. After Bryan purchases some bagels for breakfast, he returns to his apartment to discover Lenore's lifeless body. L.A.P.D. units immediately appear and try to arrest him, but he resists and escapes. Meanwhile, L.A.P.D. Inspector Frank Dotzler reads up on Bryan's background and issues an APB for him.\nBryan retreats to a safe house equipped with weapons and surveillance electronics. He retraces Lenore's final movements to a remote gas station and convenience store where he finds surveillance footage of her being abducted by unidentified men with distinctive hand tattoos, but L.A.P.D. detectives arrive and arrest him. While in transit, Bryan frees himself, hijacks the police cruiser, escapes, and downloads phone records from an L.A.P.D. database onto a thumb drive. He contacts Kim at Lenore's funeral via a camera hidden in his friend Sam's suit, instructing her to maintain her \"very predictable schedule.\" She purchases her daily yogurt drink with a \"Drink Me Now\" note which, unknown by her, is drugged by Bryan. During a lecture, she feels nauseated and runs to the bathroom where Bryan is waiting. He surprises her and gives her the antidote to the drug. Bryan removes a surveillance bug that, unknown to her, was planted by Dotzler. He tells her that he is looking for the real murderer and that she should keep safe. Kim tells Bryan that she is pregnant and that Stuart is acting scared and has hired bodyguards; which he has never done before.\nBryan follows Stuart's car but is ambushed by a pursuing SUV that pushes his car over the edge of a cliff. He survives the crash, hijacks a car, follows the attackers to a roadside liquor store and kills them. Bryan then abducts and interrogates Stuart, who confesses that Lenore's murder was caused by his failure to repay a debt to his former business partner and ex-Spetsnaz operative Oleg Malankov and that he exposed Bryan's identity to Malankov out of jealousy.\nWith assistance from his old colleagues and a nervous Stuart, Bryan gains entry to Malankov's heavily secured penthouse. After killing the guards, a furious gun battle, and a brutal fight, a mortally wounded Malankov reveals that all that happened was a setup: Stuart planned Lenore's murder and framed Bryan as part of a business deal to collect on a $12,000,000 insurance policy. Malankov adds that when he failed to kill Bryan, Stuart used Bryan to kill Malankov and keep the insurance money. Meanwhile, Stuart injures Sam, and abducts Kim, intending to flee with the money. Under police pursuit, Bryan arrives at the airport in Malankov's Porsche as Stuart's plane is preparing for take-off. After destroying the landing gear with the car, preventing the plane from taking off, Bryan overpowers Stuart and prepares to kill him but pauses at Kim's pleas. He tells Stuart to expect final punishment if he escapes justice or completes a reduced prison sentence. Dotzler and the LAPD arrive to arrest Stuart. Bryan is cleared of all charges.\nIn the aftermath of Stuart's arrest, Kim, who is pregnant, informs Bryan that she wants to name her baby after her mother if it is a girl."}