{"_movieID": "287689", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:24", "summary": "7 Days in Hell is a mockumentary directed by Jake Szymanski and written by Murray Miller. The film premiered on July 11, 2015 on HBO and July 8 on HBO Now.  The film was inspired by the Isner–Mahut marathon men's singles match at the 2010 Wimbledon Championships.", "plot": "Aaron Williams (Andy Samberg) and Charles Poole (Kit Harington) are professional tennis players who face off in what becomes the longest match in history. The mockumentary explores the backgrounds of the two competitors.\nAaron Williams is considered \"The Bad Boy of Tennis.\" He was found on the streets and adopted by Richard Williams, who raised Aaron with his daughters, Venus and Serena Williams. At the 1996 Wimbledon Finals, his serve hits a line judge, who has an immediate heart attack and dies. Williams falters and loses the championship. At the ceremony following the match, Williams pushes Prince Edward, the Duke of Kent (Howie Mandel), and disappears.\nCharles Poole is a child prodigy forced into a tennis career by his mother (Mary Steenburgen), who threatens to disown him if he loses. He appears on a local show hosted by Caspian Wint (Michael Sheen) as a 15 year old and is on track to become the youngest professional tennis player in history. He tells Wint that he idolizes Aaron Williams.\nWilliams resurfaces in Sweden creating a male underwear line which causes groin chafing. When Williams runs out of funds, he descends into pornography and an addiction to PCP. He is arrested, convicted, and is sent to a Swedish prison.\nTwo weeks before 2001 Wimbledon starts, Poole is asked by a reporter if he is a better player than Williams, he says yes. This comment reaches Williams, who escapes prison and becomes a free man, according to Swedish law.\nWilliams claims he will be playing in Wimbledon. The All-England Chair Committee, led by the Duke of Kent, refuses to let him play. Edward Pudding (Fred Armisen), also a member of the committee, believes that letting Williams play will spike interest for the tournament, and he suggests that Williams play an Englishman who is likely to beat him, which turns out to be Poole.\nThe night before the match, Poole receives a call from Queen Elizabeth (June Squibb), who tells him to \"win.\"\nOn the first day of the match, Poole wins the first set 6-0. Before the second set starts, a thunderstorm suspends play for the rest of the day.\nOn the second day, a revitalized Williams takes the second and third sets. That night, Poole gets another call from the Queen.\nOn the third day, neither Williams and Poole are willing to surrender the match. After eight hours of intense tennis, the match is suspended.\nOn the fourth day, a female streaker (Lyssa Roberts) runs onto the court. Williams tries to subdue her, but ends up having sex with her. After they finish, a male streaker (Chris Romano) runs onto the court, with whom Williams also has sex. The female streaker runs back onto the court, and a threesome takes place until the match is suspended on account of darkness.\nBefore the fifth day, Williams arranges a press conference to announce he has located his birth father, British singer Engelbert Humperdinck. He claims he will dedicate his performance at Wimbledon to all Englishmen. After darkness again suspends the match, Poole is beaten in an elevator by the Queen.\nBefore the sixth day, Williams is hit by a truck, which is implied to be driven by Poole. Williams leaves the hospital and elects to play with one arm. In the 196th game, with Poole serving 98-97 and triple match point, David Copperfield magically appears on Poole's shoulders. Copperfield later claims he was supposed to appear on the Statue of Liberty. Poole, visibly distracted, fails to win the match in the sixth day.\nBefore the seventh day, Poole and Williams meet at a joint press conference. Williams reveals that a sex tape of himself and Poole's ex-girlfriend Lily has been leaked, enraging Poole. Poole attacks Williams and removes his wig, revealing Williams's bald scalp. The two elect to settle their matters on the court. Queen Elizabeth makes an appearance at the match, and the two players challenge each other to fight.\nPoole and Williams charge the net and kill each other after simultaneously hitting each other in the head with their rackets. The documentary ends with video flashbacks of Poole and Williams praising each other.", "cast": "Andy Samberg as Aaron Williams\nKit Harington as Charles Poole\nMary Steenburgen as Louisa Poole, Charles' mother\nKaren Gillan as Lily Allsworth, Charles' supermodel ex-girlfriend\nLena Dunham as Lanny Denver, former president of Jordache\nWill Forte as Sandy Pickard, author of Aaron Williams: The Glorious Jester\nJune Squibb as Queen Elizabeth II\nMichael Sheen as Caspian Wint, a British sports journalist and host of the sports talk show Good Sport\nFred Armisen as Edward Pudding, former president of the All England Club\nHowie Mandel as Prince Edward, Duke of Kent\nJon Hamm as the narrator\nLyssa Roberts as a streaker\nChris Romano as a streakerAlso appearing as themselves are David Copperfield, Chris Evert, Filip Hammar, Jim Lampley, John McEnroe, Soledad O’Brien, and Serena Williams. Archive footage of Dolph Lundgren is also used with different subtitles to relate to the film's subject matter."}