{"_movieID": "170687", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:55", "summary": "The Boxtrolls is a 2014 American stop-motion animated fantasy comedy film directed by Graham Annable and Anthony Stacchi based on the 2005 novel Here Be Monsters! by Alan Snow. It is produced by Laika. The film tells the story of Eggs, a human boy raised by trash-collecting trolls, known as \"Boxtrolls\", as he attempts to save them from Archibald Snatcher, a pest exterminator. The film introduces Isaac Hempstead-Wright as the voice of Eggs and features the voices of Ben Kingsley, Elle Fanning, Dee Bradley Baker, Steve Blum, Toni Collette, Jared Harris, Nick Frost, Richard Ayoade, Tracy Morgan, and Simon Pegg.The film was released on September 26, 2014, by Focus Features, to generally positive reviews from critics. The film earned $109 million on a $60 million budget. It was nominated for an Academy Award for Best Animated Feature.\n\n", "plot": "In the fictional hill-top town of Cheesebridge, Norvenia during the Victorian era, rumors abound that subterranean trolls (known as Boxtrolls for the cardboard boxes they wear) have kidnapped and killed a young child. Pest exterminator Archibald Snatcher strikes a deal with the city's leader Lord Portley-Rind to exterminate every Boxtroll in exchange for membership in the city's cheese-loving council called the White Hats, despite the fact that he is severely allergic to cheese. Snatcher hatches an evil plan and teams up with his three loyal advisors Mr. Trout, Mr. Pickles, and Mr. Gristle to kill the White Hats, exterminate the Boxtrolls, rule Cheesebridge, and rename it \"Snatcher-ville\".\nIn actuality, the Boxtrolls are peaceful and emerge from underground at night to scavenge for discarded items with which to make useful inventions. A human boy named Eggs lives among them, cared for by a Boxtroll named Fish. As Eggs grows up, he becomes dismayed by the disappearing Boxtrolls seized by Snatcher. After Lord Portley-Rind's daughter Winnie sees Eggs with two Boxtrolls, Snatcher captures Fish. Eggs sneaks to the surface to find Fish and emerges in an annual fair to commemorate the disappearance of the \"Trubshaw Baby\" who was allegedly killed by Boxtrolls.\nDisgusted by the town's inaccurate portrayal of the creatures, Eggs follows Winnie. After a brief exchange, he asks her for directions to Snatcher's headquarters, located at an abandoned factory, where Eggs rescues Fish. They are caught in the escape. Snatcher recognizes Eggs as the Trubshaw Baby and reveals that all the captured Boxtrolls are building him a machine. Winnie, who covertly followed Eggs, overhears this exchange. She then helps Eggs and Fish escape from Snatcher and they take shelter in the Boxtrolls' caves, where Fish explains that Eggs' father had given him to them to keep him from Snatcher. Winnie agrees to help Eggs tell Portley-Rind the truth.\nAt a ball held to commemorate the purchase of a giant cheese wheel called the Briehemoth, which was foolishly made using the funds for a children's hospital, Eggs tries to confront Portley-Rind, but is confronted by Snatcher (disguised as a woman named \"Madame Frou-Frou\" who is his imaginary wife). Whilst trying to avoid Snatcher, Eggs inadvertently knocks the cheese wheel into a river. Eggs announces himself to the party as the Trubshaw Baby, but no one believes him including Portley-Rind who is too upset about losing the cheese wheel.\nEggs tries to persuade the remaining Boxtrolls to flee for their own safety, but unknowingly demoralises them. Snatcher digs into the caves and captures them all. Eggs awakens to find his father Herbert Trubshaw a prisoner beside him. He sees the Boxtrolls stacked in a crusher and begs them to leave their boxes and run, but they are apparently killed by the crusher.\nSnatcher drives his machine to Lord Portley-Rind's house, shows him the flattened boxes as proof of the Boxtrolls' extinction, and demands Portley-Rind's white hat in exchange for killing the last Boxtroll, which is actually Eggs disguised. The Boxtrolls, who have escaped from the crusher, and Herbert free Eggs, while Snatcher tries to take Portley-Rind's hat by force. During the fight, Mr. Trout and Mr. Pickles redeem themselves, join Eggs' team and help the group disable the machine which falls on Mr. Gristle. Eggs and Snatcher are thrown clear and land on the recovered Briehemoth, which triggers Snatcher's cheese allergy and causes him to swell to an enormous size. He seizes Winnie and forces Lord Portley-Rind to give up his hat in exchange for her safety, but he explodes into pieces after tasting an aged cheese sample.\nThe townspeople and Boxtrolls begin a peaceful coexistence. Winnie tells the tale of Snatcher's end to a crowd, while Eggs and Fish drive off in one of Herbert's contraptions.\nIn a mid-credits scene, Mr. Trout and Mr. Pickles clean the streets and have a philosophical discussion as a Laika Studios employee animates the scene, breaking the fourth wall."}