{"_movieID": "277834", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:51", "summary": "Moana (also known as Vaiana or Oceania, in some markets) is a 2016 American 3D computer-animated musical adventure film produced by Walt Disney Animation Studios and released by Walt Disney Pictures. It is the 56th Disney animated feature film. Directed by Ron Clements and John Musker, co-directed by Don Hall and Chris Williams, the film introduces Auliʻi Cravalho as Moana and features the voices of Dwayne Johnson, Rachel House, Temuera Morrison, Jemaine Clement, Nicole Scherzinger, and Alan Tudyk. The film features songs written by Lin-Manuel Miranda, Opetaia Foa'i and Mark Mancina, and an orchestral score also composed by Mancina.\nThe film tells the story of Moana, the strong-willed daughter of a chief of a Polynesian village, who is chosen by the ocean itself to reunite a mystical relic with the goddess Te Fiti. When a blight strikes her island, Moana sets sail in search of Maui, a legendary demigod, in the hope of returning the relic to Te Fiti and saving her people.\nMoana was released theatrically in the United States on November 23, 2016 to positive reviews from critics, with particular praise going towards its animation, music, and vocal performances. The film went on to gross over $643 million worldwide. Along with Zootopia, it marked the first time since 2002 that Walt Disney Animation Studios released two feature films in the same year. It received two Academy Award nominations at the 89th Academy Awards: one for Best Animated Feature and another for Best Original Song (\"How Far I'll Go\").", "plot": "On the Polynesian island of Motunui, the inhabitants worship the goddess Te Fiti, who brought life to the ocean, using a pounamu stone as her heart and the source of her power. Maui, the shapeshifting demigod and master of sailing, steals the heart to give humanity the power of creation. However, Te Fiti disintegrates, and Maui is attacked by another who seeks the heart: Te Kā, a volcanic demon. In the fight, Maui is blasted out of the sky, losing both his magical giant fishhook and the heart to the depths of the sea.\nA millennium later, the ocean chooses Moana, daughter of Motunui's chief Tui, to return the heart to Te Fiti. However, Tui arrives and takes Moana away, causing her to lose the heart. Tui and Moana's mother, Sina, try to keep her away from the ocean to prepare her for ascension as the island's chief. Years later, a blight strikes the island, causing coconuts to rot and the fish catch to dwindle. Moana suggests going beyond the island's reef to find more fish and figure out what is happening, but Tui forbids it. Moana tries conquering the reef but is overpowered by the tides and is shipwrecked back on Motunui.\nMoana's grandmother Tala shows her a secret cave where a number of ships are hidden, revealing to Moana that their people used to be voyagers, but they stopped when Maui stole Te Fiti's heart because the ocean was no longer safe without it. Tala explains that Te Kā's darkness is poisoning the island, but it can be cured if Moana finds Maui and makes him restore the heart of Te Fiti, which she gives to Moana. Shortly afterward, Tala falls ill and, while on her death bed, tells Moana that she must begin her journey.\nThat same night, Moana sets sail on a camakau found in the cavern. She is caught in a typhoon and shipwrecked on an island where she finds Maui, who boasts about his achievements. She demands that Maui return the heart; however, he refuses and traps her in a cave. Moana finds a way out and confronts Maui, who reluctantly lets her on the camakau. They are attacked by Kakamora — coconut-armored pirates — who seek the heart, but Moana and Maui outwit them. Moana realizes Maui is no longer a hero and convinces him to redeem himself by returning the heart. Maui first needs to obtain his magical fishhook, which is located in Lalotai, the Realm of Monsters, and is in the possession of Tamatoa, a giant, greedy coconut crab. Maui and Moana go to Lalotai and he retrieves his hook while Moana distracts Tamatoa, but Maui discovers he can no longer control his shapeshifting and loses self-confidence, quickly becoming overpowered by Tamatoa. Moana's quick thinking allows them to escape with the hook. Maui reveals that his first tattoo was earned when his mortal parents rejected him. After reassurance from Moana, Maui teaches her the art of sailing, regains control of his powers and the two grow closer.\nThe two arrive at Te Fiti's island, only to be attacked by Te Kā. However, Moana refuses to turn around, resulting in Maui's hook being badly damaged. Believing that if he goes back to battle with Te Kā, he will lose his hook, and therefore his power, Maui angrily abandons Moana, who tearfully asks the ocean to find someone else to restore the heart. The ocean obliges and takes the heart from Moana. Then Tala's spirit appears, inspiring Moana to find her true calling. She retrieves the heart and with full courage sails back to confront Te Kā. Maui returns, having had a change of heart, and buys Moana time to reach Te Fiti by fighting Te Kā, destroying his hook in the process. Moana discovers Te Fiti is missing, and realizes Te Kā is a corrupted Te Fiti without her heart. Moana tells the ocean to clear a path, allowing her to restore Te Fiti's heart, transforming her back to normal. Te Fiti then heals the ocean and islands of the blight. Maui apologizes to Te Fiti, who restores his hook and gives Moana a new boat before falling into a deep sleep and becoming a mountain.\nMoana bids farewell to Maui, returning home where she reunites with her parents. She takes up her role as chief and wayfinder, leading her people on a voyage.", "cast": "Auliʻi Cravalho as Moana, the curious 16-year-old daughter of village chief Tui and his wife Sina, who is chosen by the ocean to restore the heart of Te Fiti\nCravalho reprised her role in the Hawaiian-language version of the movie.\nLouise Bush as a younger Moana\nDwayne Johnson as Maui, a legendary strong-willed, yet easily annoyed  shapeshifting demigod who sets off with Moana on her journey\nRachel House as Tala, Tui's mother and Moana's paternal grandmother. Like Moana, Tala shares a passion for the ocean and the two have a very deep bond.\nHouse reprised her role in the Māori-language version of the movie.\nTemuera Morrison as Tui, Moana's overprotective father, who is Tala's son, chief of Motunui Island\nMorrison reprised his role in the Māori-language version of the movie.\nChristopher Jackson as Tui's singing voice\nJemaine Clement as Tamatoa, a giant flamboyant treasure-hoarding coconut crab from Lalotai, the Realm of Monsters\nClement reprised his role in the Māori-language version of the movie.\nNicole Scherzinger as Sina, Moana's mother and Tui's wife and the “chieftess” of the village.\nScherzinger also reprised her role in the Hawaiian-language version of the movie.\nAlan Tudyk as Heihei, Moana's pet rooster\nTudyk also voices Villager No. 3, an old man who suggests cooking Heihei\nOscar Kightley as a fisherman\nTroy Polamalu as Villager No. 1\nPuanani Cravalho (Auliʻi's mother) as Villager No. 2"}