{"_movieID": "273248", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:20", "summary": "The Hateful Eight (sometimes marketed as The H8ful Eight) is a 2015 American western thriller film written and directed by Quentin Tarantino. It stars Samuel L. Jackson, Kurt Russell, Jennifer Jason Leigh, Walton Goggins, Demián Bichir, Tim Roth, Michael Madsen, and Bruce Dern as eight strangers who seek refuge from a blizzard in a stagecoach stopover some time after the American Civil War.\nTarantino announced The Hateful Eight in November 2013. He conceived it as a novel and sequel to his previous film Django Unchained (2012) before deciding to make it a standalone film. After the script leaked in January 2014, he cancelled the film and instead directed a live reading at the United Artists Theater in Los Angeles, before reconsidering and resuming progress on the project. Filming began on December 8, 2014, near Telluride, Colorado. The original score was Italian composer Ennio Morricone's first for a Tarantino film, his first complete Western score in 34 years, and his first for a high-profile Hollywood production since Brian De Palma's Mission to Mars in 2000.\nDistributed by The Weinstein Company in the United States, The Hateful Eight was released on December 25, 2015, in a limited roadshow release in 70 mm film, before expanding wide theatrically on December 30, 2015. It opened \"to mixed reviews and box office\" results, an expensive release for The Weinstein Company as Tarantino shot the film in 70mm, but the film's score and Leigh's performance were singled out for praise. For his work on the score, Morricone won his first Academy Award for Best Original Score, as well as the Golden Globe. The film also earned Oscar nominations for Best Supporting Actress (Leigh) and Best Cinematography (Robert Richardson).\nOn April 25, 2019, the film was released as a re-edited four-episode miniseries on Netflix with the subtitle Extended Version. The Hateful Eight is Tarantino's final film to have the involvement of The Weinstein Company, as he ended his relationship with the company following allegations of sexual abuse against Harvey Weinstein in October 2017.", "plot": "In 1877, bounty hunter Major Marquis Warren is transporting three dead bounties to the town of Red Rock, Wyoming. He hitches a ride on a stagecoach driven by O.B. Jackson. Aboard is bounty hunter John Ruth, and handcuffed to him is fugitive Daisy Domergue, whom Ruth is escorting to Red Rock to collect her bounty and watch her hang. Ruth and Warren are previous acquaintances who bonded over Warren's personal letter from Abraham Lincoln. Former Lost-Causer militiaman Chris Mannix, who is traveling to Red Rock as the town's new sheriff, persuades Ruth and Warren to let him on the stagecoach. Warren and Ruth form an alliance to protect each other's bounties.\nThe group seeks refuge from a blizzard at Minnie's Haberdashery, a stagecoach lodge, whose front door happens to have a broken lock. They are greeted by Bob, a Mexican, who says the owner, Minnie, is away visiting her mother. The other lodgers are Oswaldo Mobray, a hangman; Joe Gage, a quiet cowboy traveling home to visit his mother; and Sanford Smithers, a former Confederate general traveling to put his son to rest. Suspicious, Ruth disarms all but Warren. Warren inadvertently kicks a jellybean on the floor between the slats and then notices one of Minnie's jellybean jars is missing from a shelf.\nAs the group eats, Mannix surmises that Warren's Lincoln letter is a forgery. Warren acknowledges this, saying the letter buys him leeway with whites, outraging Ruth. Warren leaves a gun next to Smithers and provokes him into reaching for it by telling Smithers that he tortured, raped, and murdered Smithers' son. When Smithers pulls the gun, Warren shoots him out of revenge for Smithers' executions of black PoWs at the Battle of Baton Rouge.\nWhile everyone is distracted by the confrontation, someone poisons the brewing coffee. Ruth and Jackson drink it, killing Jackson. The dying Ruth attacks Daisy in desperation, but she kills him with his own gun. Warren disarms Daisy, leaving her shackled to Ruth's corpse, and holds the others at gunpoint. He is joined by Mannix, whom Warren trusts because he nearly drank the poisoned coffee. After finding Sweet Dave's chair stained with blood and claiming that Minnie hates Mexicans and would never leave one to care for the lodge, Warren deduces that Bob is an impostor who killed the lodge owners and executes him. When Warren threatens to execute Daisy, Gage admits that he poisoned the coffee. A man hiding in the cellar shoots Warren in the genitals. Mobray draws a concealed gun and shoots Mannix, who returns fire, wounding Mobray.\nHours earlier, Bob, Mobray, Gage, and a fourth man, Daisy's brother Jody, arrive at the lodge. They murder Minnie, and five other bystanders, leaving only Smithers. Jody tells Smithers that they plan to ambush Ruth to rescue Daisy, and that his gang will spare Smithers if he keeps quiet. During the murders, a jar of jellybeans is shattered, and the lock on the front door is destroyed. The bandits dispose of the bodies, hide the evidence, and conceal guns around the lodge. As Ruth's stagecoach arrives, Jody hides in the cellar.\nIn the present, Mannix and Warren, both seriously wounded, hold Daisy, Gage, and the dying Mobray at gunpoint. They force Jody out of the cellar by threatening to kill Daisy. Jody surrenders and Warren executes him. Daisy claims that fifteen of her brother's men are waiting in Red Rock to kill Mannix and ransack the town; if Mannix kills Warren and allows her to escape, the gang will spare him and let him claim the bounties of the deceased except her brother.\nAs Daisy and Mobray taunt Warren, Warren shoots them both, mortally wounding Mobray. Gage draws a hidden revolver, but is shot dead by Mannix and Warren. Warren then tries to shoot Daisy, but he is out of bullets. Mannix calls Daisy's bluff and rejects her offer, but faints from blood loss. Daisy hacks off Ruth's handcuffed arm and frees herself. As she reaches for Gage's gun, Mannix regains consciousness, shooting her. Warren persuades Mannix to hang her from the rafters inside the lodge in honor of Ruth. Afterward, as the two men lie dying, Mannix reads aloud Warren's forged Lincoln letter."}