{"_movieID": "47327", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:12", "summary": "Drive Angry is a 2011 American fantasy action film starring Nicolas Cage and Amber Heard, and directed by Patrick Lussier. It was released on February 25, 2011. Shot in 3-D, the film was met with a mixed reception and made a large loss at the box office.\n\n", "plot": "John Milton (Nicolas Cage) is an undead criminal who has escaped Hell and stolen Satan's gun, labeled the Godkiller, to kill Jonah King (Billy Burke). King is a cult leader who tricked Milton's daughter into joining his followers in the wake of Milton's death ten years prior, only to kill her and her husband and steal their infant daughter (Milton's granddaughter) to be sacrificed in a Satanist ritual; King believes that if he kills the baby, that will unleash Hell over Earth.\nAfter interrogating and murdering some of King's followers, Milton discovers that the ritual will take place in Stillwater, an abandoned prison in Louisiana. On his way there he stops by a diner, where he meets Piper (Amber Heard), a waitress. Milton's car was damaged in the pursuit, so he sabotages Piper's car, a 1969 blue Dodge Charger R/T 440 and follows her to fix it in exchange for a ride on the way to Stillwater to find King.\nEntering her room, Piper walks in on her boyfriend, Frank (Todd Farmer), having sex with another woman. Piper beats the woman and assaults Frank, getting knocked to the ground. Milton, in a phone booth nearby, hears the commotion and comes to Piper's aid, kicking Frank in the face as he is about to continue assaulting Piper, and punching Frank repeatedly. Milton steals his car, taking Piper along with him driving to Stillwater. Meanwhile, a supernatural operative of Satan, The Accountant (William Fichtner), arrives on Earth with the mission to bring Milton back to Hell and take the gun back. After interrogating Frank, he discovers that Milton and Piper are heading to Louisiana, and murders Frank with a bat before tricking a pair of state troopers into helping him by impersonating an FBI agent.\nAt a shady hotel, Milton, while having sex with a female prostitute, is attacked by King and his men, who heard about his return, but he kills most of them. The Accountant appears with the police and chases after Milton and Piper, who are chasing after King's van. Milton uses the Godkiller to shoot the Accountant off a bridge. They then follow King to a church, only to find it filled with King's followers. They are ambushed and captured. Piper is kidnapped and Milton is shot in the eye and left for dead, but he awakens and kills King's men before pursuing the RV once again. Inside, Piper breaks free and fights King before jumping out of the RV and onto Milton's car. King then disables the car by repeatedly shooting its engine.\nMilton and Piper then meet Milton's friend Webster (David Morse), who provides them a new car, a 1971 red Chevrolet Chevelle SS. Piper discovers that Milton is undead and had to abandon his daughter to protect her from his former companions, which is why she was so easily manipulated by King. Webster reveals that Milton died 10 years prior in a shootout, and that Webster personally carried his coffin. She also discovers that the Godkiller was stolen by Milton from Satan and has the power to completely destroy one's soul, preventing it from going to either Heaven or Hell. Meanwhile, one of King's men who survived Milton's attack is found by the Accountant who questions their connection to Milton, and the man tells the Accountant that Milton is chasing them and why.\nAfter arming himself, Milton tells Piper that he cannot guarantee her safety and that she should leave, but she assures him that she has never had a worthy cause to fight for until now, and that she is with him regardless of the consequences. Milton tells Webster to stay behind, not wishing him to die. With the help of the Accountant, they evade the troops of Sheriff Cap (Tom Atkins) and finally arrive at Stillwater. The Accountant captures Piper and forces Milton to give up the Godkiller before he can engage King, but he allows Milton to go into battle against King and his followers to save his granddaughter, noting that Satan is more of a well-educated, calm warden of a very large prison, rather than the face of evil, and that he actually despises the sacrifices of innocent lives in his name.\nWhile Milton slaughters King's men before they can sacrifice the child, Piper escapes The Accountant's clutches with the Godkiller. King eventually gets the upper hand on Milton and savagely beats him. Piper fires the Godkiller at King, but misses and hits one of his few surviving men instead. She is knocked out by the gun's recoil. King orders one of his female servants to murder the child. However, the woman, who had been caring for the baby ever since King stole her, finds herself unable to carry out the deed, making King angry. The Accountant attracts King's attention, allowing Milton to grab the Godkiller and shoot King, destroying his soul. \nThe Accountant retrieves the baby and allows Milton to say goodbye to her. Milton gives her to Piper, who promises to care for and protect her. Webster arrives and looks on as Milton \"dies\". After both Piper and Webster have left, Milton is revealed to still not be fully dead and with the Accountant. \nFollowing this, Milton makes good on his earlier promise to Webster, and nonchalantly drinks a beer out of what is left of King's skull. He agrees to go back to Hell, but warns that if he is punished too severely for his actions, he will escape again. The Accountant claims that he looks forward to it, insinuating that chasing Milton is the most fun he has ever had, before he wiggles his keys and manifests a black 1957 Chevrolet Bel Air. He throws the keys to Milton, who drives off into the gates of Hell.", "cast": "Nicolas Cage as John Milton. He died 10 years prior to the events of the movie, and he returned from Hell to save his granddaughter. He managed to steal Satan's personal gun, the Godkiller, in order to delay the Accountant. He describes Hell as a terrible place; he doesn't mind the pain he is suffering, but rather being forced to watch the video feed of his daughter getting murdered (as the true pain is watching your beloved ones suffer).\nAmber Heard as Piper. She is a waitress at a local bar and has a cheating fiancee whom she abandons to join with Milton to save his granddaughter.\nWilliam Fichtner as the Accountant. He is Satan's slightly arrogant assistant. He was assigned to return Milton back to Hell, and notes that sometimes he needs to return escaped souls. He has a coin, which he uses to either kill or flips it into an FBI badge as an impersonation.\nBilly Burke as Jonah King. He is a ruthless satanist who believes that sacrificing Milton's granddaughter will bring Hell back to Earth and he will be immortal. (The Accountant denies this, saying that Satan himself dislikes satanists.)\nDavid Morse as Webster\nKaty Mixon as Norma Jean\nCharlotte Ross as Candy\nChrista Campbell as Mona Elkins\nPruitt Taylor Vince as Roy\nTodd Farmer as Frank\nTom Atkins as Cap\nJack McGee as Fat Lou"}