{"_movieID": "275601", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:09:41", "summary": "Ricki and the Flash is a 2015 American musical comedy-drama film directed by Jonathan Demme and written by Diablo Cody, about a woman who leaves her family to become a rock star and later gets a chance to make amends. The film stars Meryl Streep, Mamie Gummer, Kevin Kline, Sebastian Stan, Rick Springfield, Audra McDonald, and Ben Platt. The film marks Streep and Kline's third collaboration after Sophie's Choice (1982) and A Prairie Home Companion (2006). It was Demme's final dramatic film before his death in April 2017.\nPrincipal photography began on October 13, 2014, in Rye, New York. TriStar Pictures financed, and released the film on August 7, 2015. The film received mixed reviews from critics who praised the performances of the cast but criticised its screenplay, tone and execution and grossed $41.3 million at the box office against its $30 million budget.", "plot": "Ricki chased her dreams of becoming a famous rock star by abandoning her family. She gets a chance to put things right when her ex-husband Pete asks her to visit Indianapolis and help their estranged daughter Julie through a difficult time.\nRicki has a rock band that plays a regular gig at a small bar, when she is not working as a cashier to make ends meet. Julie recently attempted suicide because her husband cheated on her and is divorcing her. Despite being broke, Ricki comes to Indianapolis to help her daughter, but Julie is hostile. Likewise, her two sons are hostile and unwelcoming. One is gay and the other recently became engaged, though no one told their mother. Still, Ricki gets through to Julie. Unfortunately, her husband's second wife, Maureen, returns unexpectedly, confronting Ricki with some hard truths. She wasn't there for her children when they needed her and Maureen was. Ashamed, Ricki returns to her band in California angry and bitter, insulting her guitarist who is in love with her. He makes her realize he cares and they make love. Maureen sends Ricki an invitation to the son's wedding as an olive branch, but Ricki can't afford to go. Her boyfriend sells his best guitar to pay for the tickets. Despite her attempts at reconciliation, she's clearly still an outsider. The wedding guests look askance at Ricki when she gets up to toast the bride and groom. As her gift, having no money, she has her band take over and play for the guests. Her son and his bride start the wedding dance and slowly the guests join in."}