{"_movieID": "419680", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:57", "summary": "Daddy's Home 2 is a 2017 American Christmas comedy film directed by Sean Anders and written by Anders and John Morris. A sequel to Daddy's Home (2015), it stars Will Ferrell, Mark Wahlberg, Linda Cardellini, John Cena, with John Lithgow and Mel Gibson. The plot follows now reformed-fathers Brad and Dusty (Ferrell and Wahlberg), now co-parenting Dusty's kids, who have to deal with their own fathers (Lithgow and Gibson) visiting for the holidays.\nPrincipal photography on the film began in Massachusetts in March 2017 and it was released in the United States by Paramount Pictures on November 10, 2017. Although the film received generally negative reviews from critics, it grossed over $180 million worldwide on a $70 million budget.", "plot": "After finally becoming friends at the end of the first film, Brad Whitaker and Dusty Mayron have a co-dad system where Dusty's two children, Megan and Dylan, take turns at each father's house. Dusty has also remarried, this time to Karen, a writer, and is stepfather to Adrianna, Karen's daughter. Brad and Dusty decide to do away with having two separate Christmases and instead do one \"together Christmas.\" Dusty's tough fighter pilot/astronaut father Kurt and Brad's overbearing and over-cheerful dad, Don arrive for Christmas. Megan and Dylan warmly embrace Don, since he is very present in their lives, while Kurt hasn't seen the children since they were toddlers. Through jealousy of the affection the children show to Don, Kurt rents a large cabin through Airbnb, to house all of them through the holiday week.\nBrad and Dusty's co-dad relationship is put to the test by Kurt's meddling. Brad's wife Sara also tries to bond with Karen but is taken aback by some of Karen's actions, like shoplifting clothes from a store. Dylan develops a crush on a little girl staying in the cabin next door. Brad gives him some “advice,\" and Dusty interjects when he finds out that Brad is having what looks like “the talk” with Dylan, when it had been agreed that Dusty would handle that. Finding the trees too small in a farm, they illegally go on to private property to cut one down. Brad mistakes a cell tower for a tree and is electrocuted. After bowling, the family goes out to take the kids to see Santa. While there, Kurt convinces Dylan to ask Santa for a shotgun, which he agrees to. While out hunting the next day, Megan accidentally shoots Kurt in the shoulder, sending him to the hospital. While Kurt is disabled, she manages to shoot two turkeys, surprising Kurt. Brad confesses to Sara that they love each other more than his dad loves him.\nBrad, Dusty, Don and Kurt go to an improv comedy club, where Dusty sees Kurt picking up a woman at the bar and leaving with her, which annoys Dusty. Brad enters Don into the improv show, and Dusty chooses a topic of a husband confronting his cheating wife as the subject of an improv skit. As the skit progresses, it is revealed that Don has separated from his wife in real life. Sara comforts Don about his divorce in front of an eggnog bowl. When they leave, Megan and Adrianna take cups of alcoholic eggnog to drink. Brad says he knows that is why Dusty chose that particular topic, and to get back at Dusty, Brad has invited Adrianna's father, Roger, to the cabin for Christmas.\nThe entire family takes part in a Christmas manger representation. Brad gets into a fight with Dusty because he wants to play Joseph, which Dusty is currently playing. When Megan begins to swear, and Adrianna falls from being drunk, the crowd breaks up. Instead of Dusty fighting Brad, he almost comes to blows with Roger, and Don is repeatedly hit with ice-balls. On Christmas Day, the families all pack up to leave. On their way out of town, the families are forced back to town on account of a blizzard and are forced to take shelter at a movie theater, seeing Missile Tow, a fictional holiday action comedy film starring Liam Neeson. When the power cuts off during the movie, the families go to the lobby where each man confronts their father about the secrets, lies, and attitudes. After remembering some advice given to him by Kurt, Dylan walks toward the girl he has a crush on, to kiss her, but he doesn't kiss her and instead kisses Adrianna. Dusty tells Roger that loving Adrianna means loving her real father as well since he is also part of the family. Roger almost leaves without Adrianna, but has a change of heart after everyone breaks out into a song of \"Do They Know It's Christmas?\" and decides to stay.\nSometime later, at the airport, Don and Kurt are preparing to leave to head back to their respective homes. Kurt heads with Don up the terminal escalators, where he reveals to Don that he switched out the tickets and they're going to spend New Year's in Las Vegas. As Brad's mom's flight arrives, Dusty and Brad discover that Brad's new stepdad is Chesley \"Sully\" Sullenberger, the pilot of the \"Miracle on the Hudson\" flight. Brad and Dusty remember that they watched the film \"Sully\" together recently, and Brad appears to be welcoming towards him. Brad runs down the terminal and says that Sully will never replace his father, because Sully has only one great personal story, whereas his father has a million stories."}