{"_movieID": "426543", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:21", "summary": "The Nutcracker and the Four Realms is a 2018 American fantasy adventure film directed by Lasse Hallström and Joe Johnston based on a screenplay by Ashleigh Powell and Tom McCarthy. It is a retelling of E. T. A. Hoffmann's short story \"The Nutcracker and the Mouse King\" and Marius Petipa's and Pyotr Ilyich Tchaikovsky's The Nutcracker, about a young girl who is gifted a locked egg from her deceased mother and sets out in a magical land to retrieve the key. The film stars Keira Knightley, Mackenzie Foy, Eugenio Derbez, Matthew Macfadyen, Richard E. Grant, Misty Copeland, with Helen Mirren, and Morgan Freeman. \nThe film was announced in March 2016 with Hallström directing a script by Powell. Much of the cast signed on that summer, and filming began in October at Pinewood Studios, lasting through January 2017. In December 2017, it was announced Joe Johnston would direct a month of reshoots written by Tom McCarthy, with Hallström agreeing to Johnston receiving co-directing credit.\nThe Nutcracker and the Four Realms premiered in Los Angeles on October 29, 2018, and was released by Walt Disney Studios Motion Pictures in the United States on November 2, 2018, in RealD 3D and Dolby Cinema. The film grossed $174 million worldwide, against a production budget of over $120 million, making it a box office bomb. It received generally negative reviews from critics, criticizing the slow pace and lack of dance numbers and also deeming the film as \"soulless\" and \"incoherent\", although the visual effects received some praise.\n\n", "plot": "In Victorian London, on Christmas Eve, Mr. Stahlbaum gives his children the presents his wife Marie had set aside for them before she died. Daughter Clara receives an egg-shaped box which she is unable to unlock, together with a note saying that inside the egg is all she will ever need. The family goes to a Christmas Eve ball, hosted by the children's godfather and skilled engineer Drosselmeyer. Clara asks Drosselmeyer how to unlock her egg. He reveals that he made the egg for Clara's mother when she was younger.\nClara's father scolds her for refusing to dance with him and they call each other selfish. Clara finds her string with her name on it, signifying her gift, and follows it into a forest in a parallel world where she sees a key. Before she can grab it, a mouse snatches it and crosses a frozen river. Captain Philip Hoffman the Nutcracker leads Clara across the bridge into the Fourth Realm and to the palace, where she meets the regents of each land: the Sugar Plum Fairy of the Land of Sweets; Shiver of the Land of Snowflakes, and Hawthorne of the Land of Flowers. They tell Clara they are at war with the Land of Amusements which they refer to as \"the Fourth Realm\".\nThe Sugar Plum Fairy explains that Clara's mother Marie created this world as a young girl, and that she animated everyone with a machine that can turn toys into real people. Sugar Plum says this machine can be used to defend the three realms against Mother Ginger, the Regent of the Fourth Realm, but it needs a key matching the one for Clara's egg. Sneaking into the Fourth Realm, Clara and Philip steal back the key from Mother Ginger, ignoring her warning that Sugar Plum is lying to them, but Clara is disappointed to discover that the egg is only a music box.\nSugar Plum uses the machine to turn toy soldiers into life-size soldiers to attack the Fourth Realm. She then reveals that she lied about Mother Ginger, who had resisted Sugar Plum's plan to take over all four realms in revenge for her perceived abandonment by Marie, and that the machine can turn this world's people back into toys as well. She imprisons Clara, Captain Philip, Shiver, and Hawthorne.\nClara opens her egg-shaped music box again and discovers a mirror, illustrating that all she needed was herself. She and the other prisoners escape. One of Mother Ginger's mice shows Clara into the machine room, and Captain Philip convinces Mother Ginger to help overthrow Sugar Plum. Clara shuts down the machine while fighting off soldiers with Mother Ginger's aid. Sugar Plum attempts to turn Mother Ginger back into a toy but Clara tinkers with the machine so it aims back at Sugar Plum, turning her into a porcelain doll for high treason to the Realms.\nThanked for restoring peace, Clara promises to visit the Realms in the future and returns to London, where time has hardly passed since she left. She apologizes to her father and asks him to dance. He accepts, and Clara opens her music box. Clara's father reveals that the music box's song was the first song that he and Clara's mother had ever danced to. They dance throughout the night.", "cast": "Mackenzie Foy as Clara Stahlbaum, a young girl who travels into the Four Realms, searching for a key of a gift from her late mother Marie.\nJayden Fowora-Knight as Captain Philip Hoffman, a nutcracker who helps Clara on her journey. He was named after the late Philip Seymour Hoffman.\nKeira Knightley as The Sugar Plum Fairy, the regent of the Land of Sweets.\nHelen Mirren as Mother Ginger, regent of the Land of Amusements (also known as The Fourth Realm).\nMorgan Freeman as Drosselmeyer, Clara's godfather, a skilled engineer, who gives her a magical gift that once belonged to her mother.\nEugenio Derbez as Hawthorne, regent of the Land of Flowers.\nRichard E. Grant as Shiver, regent of the Land of Snowflakes.\nMisty Copeland as The Ballerina Princess, a gifted dancer in the mysterious Four Realms.\nMatthew Macfadyen as Benjamin Stahlbaum, Clara's father and a widower following the death of his wife Marie.\nAnna Madeley as Marie Stahlbaum, Clara's late mother who created and ruled over the Four Realms as a child.\nSergei Polunin as The Sweets Cavalier, a dancer who performs alongside the Ballerina Princess.\nEllie Bamber as Louise Stahlbaum, Clara's older sister.\nTom Sweet as Fritz Stahlbaum, Clara's younger brother.\nJack Whitehall as Harlequin, a guard at The Palace of the Four Realms.\nOmid Djalili as Cavalier, another guard at The Palace of the Four Realms and Harlequin's cohort.\nMeera Syal as The Stahlbaum's Cook, a member of staff in the Stahlbaum household.\nCharles \"Lil Buck\" Riley as The Mouse King, ruler of the legion of mice. Riley also provided the choreography and motion capture performance for the character.Although it was originally announced that Miranda Hart had been cast in the role of The Dew Drop Fairy, she did not appear in the final cut of the theatrical release for the film. Maestro Gustavo Dudamel has a brief cameo conducting an orchestra in a shot modeled after the Toccata and Fugue in D minor segment of Fantasia."}