{"_movieID": "40962", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:31:12", "summary": "Ironweed is a 1987 American drama film directed by Héctor Babenco. It is based on the Pulitzer Prize-winning novel of the same name by William Kennedy, who also wrote the screenplay. It stars Jack Nicholson and Meryl Streep, with Carroll Baker, Michael O'Keefe, Diane Venora, Fred Gwynne, Nathan Lane and Tom Waits in supporting roles. The story concerns the relationship of a homeless couple: Francis, an alcoholic, and Helen, a terminally ill woman during the years following the Great Depression. Major portions of the film were shot on location in Albany, New York, including Jay Street at Lark Street, Albany Rural Cemetery and the Miss Albany Diner on North Broadway.\nThe film was nominated for two Academy Awards, including for Best Actor in a Leading Role (Nicholson) and Best Actress in a Leading Role (Streep).", "plot": "Francis Phelan (Jack Nicholson) is a washed-up baseball player who deserted his family back in the 1910s when he accidentally dropped his son and killed him. It is assumed in the film that he was drunk at the time until he later claims he was just tired and doesn't understand why no one will believe in his story. Since then, Phelan has been a bum, punishing himself. Wandering into his hometown of Albany on Halloween in 1938, Phelan seeks out his lover and drinking companion, Helen Archer (Meryl Streep). The two meet up in a mission managed by Reverend Chester (James Gammon), and later in Oscar Reo's (Fred Gwynne) gin mill.\nOver the next few days, Phelan takes a few minor jobs to support Helen, while haunted by visions of his past. Francis comes back to his old family house and tries to make peace with his wife Annie Phelan (Carroll Baker), his son Billy (Michael O'Keefe) and daughter Peg (Diane Venora). Meanwhile, a group of local vigilantes take it upon themselves to drive the homeless out of Albany. During the course of the day, a series of events change Francis' life forever."}