{"_movieID": "18823", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:30", "summary": "Clash of the Titans is a 2010 American-Australian action adventure fantasy film and remake of the 1981 film of the same name produced by MGM (the rights to which had been acquired by Warner Bros. in 1996). The story is very loosely based on the Greek myth of Perseus. Directed by Louis Leterrier and starring Sam Worthington, Liam Neeson, and Ralph Fiennes, the film was originally set for standard release on March 26, 2010. However, it was later announced that the film would be converted to 3D and was released on April 2, 2010.Clash of the Titans grossed $493 million worldwide, though it received generally negative reviews from critics and received two Golden Raspberry Awards nominations. The film's success led to a sequel, Wrath of the Titans, released in March 2012. A third film titled Revenge of the Titans was in development but later cancelled due to Wrath of the Titans' disappointing box office performance.", "plot": "In ancient times, after defeating their predecessors, the Titans, the gods had divided the world among themselves. Zeus took the skies, Poseidon the seas, and Hades was left with the Underworld after being tricked by Zeus. The gods created the mortals, whose faith and prayers maintained the gods' immortality. Over time, however, mortals have begun to question and resist their creators.  King Acrisius leads an assault on Olympus itself,  angering the Olympians. Many Olympians want to eliminate Man altogether, but Zeus has other plans. Zeus disguises himself as King Acrisius and sleeps with the queen, Danae, who conceives and bears Perseus. Angry at Zeus, Acrisius murders his wife, and throws her and the child into the ocean. Zeus punishes Acrisius by striking him with lightning and turning him into the deformed creature Calibos.\nA fisherman named Spyros finds a coffin adrift in the sea, with the baby Perseus and his mother's body inside it. Spyros and his wife, Marmara, raise Perseus as their own son, alongside their daughter, Tekla. One day, an adult Perseus and his family watch as soldiers from the city of Argos destroy the statue of Zeus. Infuriated, the Gods unleash the Furies against the soldiers. Hades then appears and destroys the family's fishing vessel, and Perseus' family drowns. Only Perseus survives, and he is found by a group of soldiers.\nPerseus is brought before King Cepheus and Queen Cassiopeia, who are celebrating their campaign against the gods. Queen Cassiopeia compares her daughter Andromeda to the gods and boasts that she is more beautiful than Aphrodite. The revelry is cut short by the arrival of Hades, to whom Zeus has given leave to punish the mortals for their defiance. Hades threatens to unleash his monster, the Kraken, against Argos, unless Andromeda is offered as a sacrifice. Before leaving, he also reveals that Perseus is a demigod and the son of Zeus. Perseus meets Io, who confirms his origin.\nPerseus leads the King's Guard to the Stygian Witches (the film's name for the three Graeae of Greek mythology) looking for a way to kill the Kraken. Seeking to help his newly discovered son, Zeus gives Perseus a sword forged on Mount Olympus and a winged horse named Pegasus. Perseus refuses the sword, but the captain of the King's guard, Draco, keeps the sword for when Perseus needs it. Perseus likes Pegasus. Soon after, they are attacked by Calibos, who kills several of the Kings Guard. Draco severs Calibos's hand and forces him to flee. The band gives chase but they are attacked by giant scorpions called Scorpiochs that spring from spilled drops of Calibos's blood. They are saved by a band of Djinn, non-human desert sorcerers led by Sheik Suleiman, who tame the remaining Scorpions. Also wishing for the gods' defeat, the Djinn lend their aid to Perseus and his band. As they continue to travel, Io aids and teaches Perseus and they begin to fall in love.\nThe group arrives at the lair of the Stygian Witches and learn that to kill the Kraken, they must obtain and use the head of Medusa, a gorgon who resides in a temple in the Underworld. Any living creature that looks on Medusa's eyes will turn into stone. Perseus, Io, Solon, Draco, and their remaining men travel to the entrance into the Underworld. The men enter Medusa's temple lair while Io, being a woman and forbidden from entering, remains outside. Medusa kills most of the band, but Perseus finally manages to behead her by using his reflective shield to see her with his back turned. As he leaves the temple, Calibos appears behind Io and fatally stabs her. As Perseus and Calibos fight, Perseus accepts that he is a son of Zeus, picks up the Olympian sword, and stabs Calibos through the chest, which has restored him to his human form. With his last breath, Calibos urges Perseus not to become a god. As Io lies dying, she urges Perseus to leave her and save Andromeda and Argos. Perseus lovingly stays with her until her last breath instead of leaving immediately. Pegasus soon takes Perseus back to the city of Argos as the Kraken is released. The people of Argos seize and bind Andromeda to sacrifice her to the Kraken. Meanwhile, Hades reveals he does not require the faith or worship of mortals as Zeus does, as he has learned to survive on their fear. Hades then subdues the weakened Zeus.\nPerseus arrives at Argos and exposes Medusa's head to the Kraken, which makes eye contact just before it is able to reach Andromeda. The Kraken gradually petrifies and crumbles. Prokopion, the insane leader of the Cult of Hades, attempts to kill Perseus, but Cepheus stops him and is stabbed, before both are killed when the Kraken's petrified claw falls on them. Hades appears, intending to kill Perseus, but Perseus, invoking Zeus, throws his sword at Hades, forcing him back to the Underworld. Perseus rescues Andromeda, who will soon be crowned as Queen of Argos. She asks Perseus to stay by her side as the King, but he declines. Perseus also refuses another offer of godhood from Zeus, who then proclaims that if Perseus is to live as a human, he should not be alone, and subsequently revives Io, reuniting Perseus with his love.", "cast": "Sam Worthington as Perseus\nLiam Neeson as Zeus\nRalph Fiennes as Hades\nGemma Arterton as Io\nJason Flemyng as King Acrisius/Calibos\nTine Stapelfeldt as Danae\nAlexa Davalos as Princess Andromeda\nMads Mikkelsen as Draco\nNicholas Hoult as Eusebios\nLiam Cunningham as Solon\nHans Matheson as Ixas\nRory McCann as Belo\nLuke Evans as Apollo\nDanny Huston as Poseidon\nAlexander Siddig as Hermes\nAgyness Deyn as Aphrodite\nPete Postlethwaite as Spyros\nElizabeth McGovern as Marmara\nLuke Treadaway as Prokopion\nPolly Walker as Queen Cassiopeia\nVincent Regan as King Cepheus\nKaya Scodelario as Peshet\nWilliam Houston as Ammon\nIan Whyte as Sheikh Sulieman\nNatalia Vodianova as Medusa"}