{"_movieID": "18239", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:48", "summary": "The Twilight Saga: New Moon (commonly referred to as New Moon) is a 2009 American romantic fantasy film based on Stephenie Meyer's 2006 novel New Moon. It is the second film in The Twilight Saga film series and is the sequel to 2008's Twilight. Summit Entertainment greenlit the sequel in late November 2008, following the early success of Twilight. Directed by Chris Weitz, the film stars Kristen Stewart, Robert Pattinson, and Taylor Lautner, reprising their roles as Bella Swan, Edward Cullen, and Jacob Black, respectively. Melissa Rosenberg, who handed in a draft of the film script during the opening weekend of Twilight, returned as screenwriter for New Moon as well.Filming began in Vancouver in late March 2009, and in Montepulciano, Italy in late May 2009. The film was released on November 20, 2009 in most countries, and set domestic box office records as the biggest midnight screening, grossing $26.3 million, which was superseded by its sequel, Eclipse. This led to the highest single-day, domestic gross on an opening day, with $72.7 million, until it was beaten in 2011 by Harry Potter and the Deathly Hallows – Part 2, which made $91.1 million, by nearly $20 million. Furthermore, New Moon opened with the third-highest domestic opening weekend since 2002 grossing a total of $142,839,137. The film also became the highest-grossing film released by Summit Entertainment, and was the widest independent release, playing in over 4,100 theaters in its theatrical run, until it was surpassed by The Twilight Saga: Eclipse.New Moon was released on DVD and Blu-ray Disc on March 20, 2010 through midnight release parties. As of July 2012, the film has grossed $184,916,451 in North American DVD sales, selling more than 8,835,501 units, 4 million of which were sold within its first weekend, beating Twilight's 3.8 million units sold in its first two days. The film was well received by fans, but received generally negative reviews from critics.", "plot": "On her eighteenth birthday, Bella Swan wakes up from a dream, in which she sees herself as an old woman. She expresses her distaste about growing older than her boyfriend, Edward Cullen, a vampire, whose condition caused him to stop aging physically at seventeen. Despite her lack of enthusiasm, Edward's family host Bella a birthday party. While unwrapping a gift, Bella receives a paper cut. Edward's brother, Jasper, becomes overwhelmed by the scent of Bella's blood, and attempts to attack her, but is restrained and taken outside. During the incident, Edward pushes Bella to protect her, but she instead gets a big cut on her arm. Carlisle stitches Bella's cut on her arm. Believing that he and his family put Bella's life in danger, Edward ends their relationship, and the Cullens leave Forks.\nEdward's departure leaves Bella depressed and isolated for months. Unable to understand her erratic and despondent actions, her father, Charlie, wants to send Bella to live with her mother in Jacksonville, Florida, thinking it would be best for her, but Bella refuses and decides to spend more time with her school friends. After seeing a movie with Jessica, Bella sees a group of men on motorcycles. This reminds her of when Edward rescued her from a previous assault, and she sees his image. Bella discovers that any thrill-seeking activities she engages in will evoke Edward's preserved image. She is also comforted by Jacob Black, a cheerful Quileute friend who helps to ease her pain over losing Edward. When Jacob suddenly begins avoiding her after getting angry at a movie theater and a rising body temperature, Bella visits him a few days later, and sees that he cut off his long hair and got the Quileute tattoo on his upper right arm. Bella eventually discovers that he, and others of his tribe, are shapeshifters who phase into wolves, and that they are an age-old enemy of vampires, particularly the Cullen family. Jacob's pack members are currently on alert for Victoria, a vampire seeking to avenge the death of her mate, James, who was killed by Edward after James kidnapped and tried to kill Bella. They rescue Bella from Laurent when he tries to kill her. With Jacob busy coming to terms with his new shape-shifting powers, Bella again finds herself alone, and she returns to seeking thrill-inducing activities.\nThrough a series of miscommunications, Edward believes that Bella has killed herself by jumping off a cliff into the ocean. Distraught, Edward travels to Italy and asks the Volturi (powerful coven who act as vampiric overlords) to kill him, since he is incapable of ending his own life, but they refuse.  He then plans to force their hand by exposing himself as a vampire to humans. Alice, Edward's sister, is shocked that Bella is alive, and she also thought she saw Bella's funeral, which was really the funeral of Harry Clearwater after he died from a heart attack. Alice and Bella travel to Italy to save Edward, and arrive just in time to stop him. Alice looks on as Bella jumps into the sunlight, and into Edward, preventing him from being exposed as a vampire. Edward is relieved that Bella's alive and explains to her that he always loved her, and only left to protect her. He also promises never to leave Bella's side ever again. Impressed by Bella's willingness to sacrifice her life for Edward, the Volturi determine that Bella, a human who knows that vampires exist, must either be killed or transformed into a vampire herself. Alice stops them from killing her by sharing her vision, in which Bella and Edward are both vampires with Aro, a Volturi elder who is able to read thoughts through touch. Soon after, the Cullens return to Forks. Bella asks the Cullens to vote on her becoming a vampire, and only Edward and Rosalie say no. Later, Jacob reminds Edward of the treaty the Cullens and Quileutes made years before that the Quileutes will not attack if they don't bite humans, but Bella tells Jacob it's her choice. Jacob and Edward fight, and Jacob phases. Bella stops their fight and Jacob leaves. The movie concludes with Edward telling Bella that he will change her into a vampire if Bella marries him."}