{"_movieID": "83666", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:54:50", "summary": "Moonrise Kingdom is a 2012 American coming-of-age film directed by Wes Anderson, written by Anderson and Roman Coppola. It features an ensemble cast including Bruce Willis, Edward Norton, Bill Murray, Frances McDormand, Tilda Swinton, Jason Schwartzman, Bob Balaban, and newcomers Jared Gilman and Kara Hayward. Largely set on the fictional New England island of New Penzance, it tells the story of a orphan boy (Gilman) who escapes from a scouting camp to unite with his pen pal and love interest, a girl with aggressive tendencies (Hayward). Feeling alienated from their guardians and shunned by their peers, the lovers abscond to an isolated beach. Meanwhile, the island's police captain (Willis) organizes a search party of scouts and family members to locate the runaways.\nIn crafting their screenplay, Anderson and Coppola drew from personal experiences and memories of childhood fantasies as well as films including Melody (1971) and The 400 Blows (1959). Auditions for child actors took eight months, and filming took place in Rhode Island over three months in 2011. \nMoonrise Kingdom premiered at the 2012 Cannes Film Festival and received critical acclaim, with its themes of young love, child sexuality, juvenile mental health, and the Genesis flood narrative being praised. Critics cited the film's color palette and use of visual symmetry as well as the use of original composition by Alexandre Desplat to supplement existing music by Benjamin Britten. It was nominated for the Academy Award for Best Original Screenplay and the Golden Globe for Best Musical or Comedy. In 2016, the BBC included the film in its list of greatest films of the twenty-first century.\n\n", "plot": "On the New England island of New Penzance, 12-year-old orphan Sam Shakusky is attending Camp Ivanhoe, a Khaki Scout summer camp led by Scout Master Randy Ward. Suzy Bishop, also 12, lives on the island with her parents Walt and Laura, both attorneys, and her three younger brothers in a house called Summer's End. Sam and Suzy, both introverted, intelligent and mature for their age, meet in the summer of 1964 during a church performance of Noye's Fludde and became pen pals. The relationship becomes romantic over the course of their correspondence and they make a secret pact to reunite and run away together. In September 1965, they execute their plan. Sam escapes from Camp Ivanhoe while Suzy runs away from Summer's End. The pair meet at their rendezvous, hike, camp, and fish in the wilderness with the goal of reaching a secluded cove on the island. \nMeanwhile, the Khaki Scouts have become aware of Sam's absence, finding a letter he left behind stating he has resigned his position as a Khaki Scout. Scout Master Ward tells the Khaki Scouts to use their skills to set up a search party and find Sam. Eventually, a group of Khaki Scouts confronts Sam and Suzy and tries to capture them. During the resulting altercation, Suzy injures the Scouts' de facto leader, Redford, with a pair of lefty scissors, and a stray arrow fired by one of the Scouts kills Camp Ivanhoe's dog Snoopy. The Scouts flee, and Sam and Suzy hike to the cove, which they name \"Moonrise Kingdom\". They set up camp, and as the romantic tension between them grows, they dance on the beach and share each other's first kiss.\nSuzy's parents, Scout Master Ward, the Scouts from Camp Ivanhoe, and Island Police Captain Duffy Sharp finally find Sam and Suzy in their tent. Suzy's parents take her home. Ward gives Sam a letter from the Billingsleys stating that they no longer wish to house Sam. He stays with Sharp while they await the arrival of \"Social Services,\" an otherwise nameless woman who plans to place Sam in a \"juvenile refuge\" and explore the possibility of treating him with electroshock therapy.\nWhile contemplating in their treehouse, the Camp Ivanhoe Scouts have a change of heart and decide to help Suzy and Sam. Together, they paddle to a neighboring St. Jack Wood Island to seek out the help of Cousin Ben, an older relative of one of the Scouts. Ben works at Fort Lebanon, a larger Khaki Scout summer camp on St. Jack Wood Island run by Ward's superior Commander Pierce. Ben decides to try to take Sam and Suzy to a crabbing boat anchored off the island so that Sam can work as a crewman and avoid Social Services. Ben performs a \"wedding\" ceremony, which he admits is not legally binding before they leave. Sam and Suzy never make it onto the crabbing boat, and Suzy's parents, Captain Sharp, Social Services, and the scouts of Fort Lebanon under the command of Scout Master Ward, pursue them instead.\nA violent hurricane and flash flood strike, and Sharp apprehends Sam and Suzy on the steeple of the church in which they first met. Lightning destroys the steeple, but Sharp saves them. During the storm, Sharp decides to become Sam's legal guardian, allowing him to stay on New Penzance Island and maintain contact with Suzy.\nAt Summer's End, Sam is upstairs painting a landscape of Moonrise Kingdom. Suzy and her brothers are called to dinner, while Sam slips out of the window to join Sharp in his patrol car and tells Suzy that he will see her the following day."}