{"_movieID": "259695", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:50", "summary": "Live by Night is a 2016 American crime drama film written, directed, produced by and starring Ben Affleck. Based on the 2012 novel of the same name by Dennis Lehane, the film follows an Ybor City bootlegger (Affleck) who becomes a notorious gangster. The film also stars Elle Fanning, Brendan Gleeson, Chris Messina, Sienna Miller, Zoe Saldana and Chris Cooper.\nProduced by Warner Bros., the film premiered in New York City on December 13, 2016. It began a limited release in the United States on December 25, 2016, before going wide on January 13, 2017. It received mixed reviews and was a box office bomb, grossing $22 million against its net budget of $65 million. The film lost around $75 million, according to insiders and rival studio executives.", "plot": "In 1926, Joe Coughlin, a World War I veteran of Irish descent and the prodigal son of Boston police captain Thomas Coughlin, falls in love with Emma Gould, the mistress of notorious gangster Albert White, the boss of the Irish Gang of Boston. Thomas objects to the relationship and advises Joe against his criminal activities, warning him that his wrongdoing will catch up with him eventually.\nWhite's rival, Italian Mafia boss Maso Pescatore, finds out about their affair and blackmails Joe to kill White. Joe refuses but he and Emma decide to flee to California. To fund the trip, Joe commits a bank heist with his partner Dion Bartolo, during which three police officers are killed in an ensuing chase. When Joe tries to leave with Emma anyway, she lures him into a trap set by White. Joe is brutally beaten by White and his men and nearly killed before the police arrive and arrest Joe for the policemen's murders.\nThomas tells Joe that Emma drowned while being pursued by police. He also blackmails Chief Inspector Calvin Bondurant to ensure that Joe is sent to prison on a relatively minor charge rather than murder. Two weeks before Joe's release, Thomas dies of a heart attack. Wanting revenge against White, Joe volunteers his services to Pescatore and is recruited as an enforcer for Pescatore's rum empire in Ybor City in Tampa, Florida, which is under attack by White. Joe reconnects with Dion and together they protect Pescatore's business in the area and receive orders to bring gambling and drugs into Tampa. Joe also develops a relationship with Graciela Corrales, the sister of a local Cuban businessman, and they are soon married.\nJoe befriends Sheriff Irving Figgis. Irving's daughter Loretta heads to Hollywood to become an actress but instead becomes a heroin-addicted prostitute. Irving's brother-in-law, R. D. Pruitt, a member of the local chapter of the Ku Klux Klan, starts bombing Joe's clubs and killing his men. Joe promises Irving to help get Loretta off drugs and back to York City in exchange for his betrayal of Pruitt. Joe kills Pruitt and, in the ensuing mob war with the Klan, he and his men beat or kill enough Klansmen to weaken the group's standing in Florida.\nRecognizing that Prohibition will eventually come to an end and unwilling to follow Pescatore's orders to invest in narcotics, Joe focuses on building a casino near Sarasota. He intends to persuade the government to legalize gambling, but Loretta, who has become a devout Christian under her father's strict and punishing discipline, begins preaching that alcohol and gambling are against God's word. Her ministry is popular enough that the government decides not to legalize gambling. Joe recognizes that Pescatore will be enraged, particularly since Joe still refuses to invest in narcotics.\nDuring a private meeting in a restaurant, Loretta confides to Joe that she does not truly believe in God and her sins cannot be forgiven. The next day, Joe is despondent to learn that Loretta committed suicide. While visiting his brother-in-law, an amateur photographer, Joe finds a recent picture of Emma, whom he believed to be dead. He decides to pursue her in Miami, but only after informing Graciela first, much to Dion's dismay.\nPescatore forms an alliance with White and lures Joe into a meeting at a hotel, intending to have him killed and replaced by White in retaliation for Joe's recent failures. Anticipating Pescatore's betrayal, Joe distracts White by showing him Emma's picture, as White also believed her to be dead. Dion and his men ambush Pescatore's men through a series of underground tunnels that Joe used to move rum. Joe kills White, Pescatore and Pescatore's son, Digger. Joe names Dion as his successor before locating Emma at a brothel in Florida. She relates how she faked her death to escape from White and enjoys her newfound freedom, and claims she never reciprocated Joe's love for her.\nJoe and Graciela move to Miami, where they have a son and spend their days building houses for the impoverished. Driven insane by Loretta's death, Figgis tracks them down and shoots up their house, killing Graciela before being fatally shot by Joe. Joe arranges for Graciela to be buried in her homeland in Cuba and spends the rest of his days dedicated to charity and to raising Tommy, who soon voices his desire to become a police officer."}