{"_movieID": "140607", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:08:55", "summary": "Star Wars: The Force Awakens (also known as Star Wars: Episode VII – The Force Awakens) is a 2015 American epic space-opera film produced, co-written and directed by J. J. Abrams. It is the first installment in the Star Wars sequel trilogy, following Return of the Jedi (1983). It was produced by Lucasfilm Ltd., Abrams's production company Bad Robot Productions, and distributed by Walt Disney Studios Motion Pictures. The film's ensemble cast includes Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Lupita Nyong'o, Andy Serkis, Domhnall Gleeson, Anthony Daniels, Peter Mayhew, and Max von Sydow. It is the seventh part of the Star Wars \"Skywalker saga\", following the original and prequel trilogies.\nSet 30 years after Return of the Jedi, The Force Awakens follows Rey, Finn, and Poe Dameron's search for Luke Skywalker and their fight in the Resistance, led by General Leia Organa and veterans of the Rebel Alliance, against Kylo Ren and the First Order, a successor to the Galactic Empire. The film was announced after The Walt Disney Company's acquisition of Lucasfilm in October 2012, and was the first Star Wars film to not extensively involve franchise creator George Lucas, who only served as a creative consultant in the early stages. The film was produced by Abrams, his longtime collaborator Bryan Burk, and Lucasfilm president Kathleen Kennedy. Abrams and Lawrence Kasdan, co-writer of the original trilogy films The Empire Strikes Back (1980) and Return of the Jedi (1983), rewrote an initial script by Michael Arndt. John Williams, the composer for the previous six films, returned to compose the film's score. Filming began in April 2014 in Abu Dhabi and Iceland, with principal photography also taking place in Ireland and at Pinewood Studios in England, and wrapped in November 2014.\nThe Force Awakens was widely anticipated, and Disney backed the film with extensive marketing campaigns. It premiered in Los Angeles on December 14, 2015, before its wide release in the United States on December 18. The film received praise for its screenplay, direction, acting, musical score, visual effects, and action sequences, although some critics found it derivative of the original trilogy. The film broke various box office records and became, unadjusted for inflation, the highest-grossing installment in the franchise, the highest-grossing film in North America, the highest-grossing film of 2015, and the fourth-highest-grossing film of all time, with a worldwide gross of over $2 billion and a net profit of over $780 million. It received five nominations at the 88th Academy Awards and four nominations at the 69th British Academy Film Awards, where it won the award for Best Special Visual Effects. It was followed by The Last Jedi in December 2017, and will be followed by The Rise of Skywalker, which is scheduled for release in December 2019.", "plot": "Thirty years after the Galactic Civil War, the First Order has risen from the fallen Galactic Empire and seeks to eliminate the New Republic. The Resistance, backed by the Republic and led by General Leia Organa, opposes them while Leia searches for her brother, Luke Skywalker.\nOn the desert planet Jakku, Resistance pilot Poe Dameron receives a map to Luke's location from Lor San Tekka. Stormtroopers commanded by Kylo Ren raid the village and capture Poe, while Kylo kills San Tekka. Poe's droid, BB-8, escapes with the map and encounters a scavenger named Rey near a junkyard settlement. Kylo tortures Poe using the Force and learns of BB-8. Stormtrooper FN-2187, disillusioned by the First Order, frees Poe, and they escape in a stolen TIE fighter; Poe gives FN-2187 the nickname \"Finn\". As they head to Jakku to retrieve BB-8, they are shot down by a First Order Star Destroyer and crash-land. Finn survives and assumes that Poe died in the crash. He encounters Rey and BB-8, but the First Order tracks them and launches an airstrike. Finn, Rey, and BB-8 flee the planet in the Millennium Falcon, which they steal from the junkyard.\nThe Falcon is captured by a larger ship piloted by Han Solo and Chewbacca, looking to reclaim their former vessel. The group is attacked by gangs seeking to settle debts with Han, and flees in the Falcon. At the First Order's Starkiller Base, a planet converted into a star-powered superweapon, Supreme Leader Snoke allows General Hux to use the weapon for the first time. Snoke questions Kylo's ability to deal with emotions relating to his father, Han Solo, who Kylo says means nothing to him.\nThe Falcon crew determines that BB-8's map is incomplete. Han explains that Luke attempted to rebuild the Jedi Order but exiled himself when an apprentice turned to the dark side, destroyed the temple, and slaughtered the other apprentices. The crew travels to the planet Takodana and meets with cantina owner Maz Kanata, who offers assistance getting BB-8 to the Resistance. Rey is drawn by the Force to a secluded vault, where she finds the lightsaber that once belonged to Luke and his father, Anakin Skywalker. She experiences disturbing visions and flees into the woods. Maz gives Finn the lightsaber for safekeeping.\nStarkiller Base destroys a planetary system which is home to the New Republic's capitol and senate, and a portion of its fleet. The First Order attacks Takodana in search of BB-8. Han, Chewbacca, and Finn are saved by Resistance X-wing fighters led by Poe, who is revealed to have survived the crash on Jakku. Leia arrives at Takodana with C-3PO and reunites with Han and Chewbacca. Meanwhile, Kylo captures Rey and takes her to Starkiller Base, but she resists his mind-reading attempts. Discovering she can use the Force, Rey escapes by using a Jedi mind trick on a nearby guard.\nAt the Resistance base on D'Qar, BB-8 finds R2-D2, who has been inactive for some time. As Starkiller Base prepares to fire once more, the Resistance devises a plan to destroy it by attacking the main facility. Using the Falcon, Han, Chewbacca, and Finn infiltrate the facility, find Rey, and plant explosives. Han confronts Kylo, calling him by his birth name, Ben, and implores him to abandon the dark side. Kylo refuses and kills Han, enraging Chewbacca, who shoots Kylo and sets off the explosives. This allows the Resistance to attack the base's thermal oscillator, which begins a fatal chain reaction from the planet's core.\nThe injured Kylo pursues Finn and Rey into the woods at dark. Kylo defeats Finn in a lightsaber duel, seemingly killing him. Rey takes the lightsaber and uses the Force to defeat Kylo, before they are separated by a fissure as the planet begins to crack apart. Snoke orders Hux to evacuate and bring Kylo to him to complete his training. Rey and Chewbacca escape with the unconscious Finn in the Falcon. As the Resistance forces flee, Starkiller Base implodes, forming a star. On D'Qar, Leia and Rey mourn Han's death. R2-D2 awakens and reveals the rest of the map, which Rey uses to find the oceanic planet Ahch-To. There, she finds Luke and presents him with the lightsaber.", "cast": "Harrison Ford as Han Solo: A rogue and a smuggler, formerly a key player in the Rebel Alliance. Ford said, \"Han does not aspire to the position of Obi-Wan, nor do I aspire to be some New Age Alec Guinness. His development is consistent with the character, and there are emotional elements which have occasioned his growth… There's a lot of the rogue still left in Solo. Some things don't change…\"\nMark Hamill as Luke Skywalker: The last Jedi, who has gone into hiding. Regarding Luke, Han, and Leia, Abrams stated: \"They'd be as old and as mythic as the tale of King Arthur. They would be characters who [the new characters] may have heard of, but maybe not. They'd be characters who they might believe existed, or just sounded like a fairy tale…\" Hamill was initially skeptical of Luke only appearing at the end of the film and called his limited screentime \"a great surprise\". Abrams added that the film's ending was intended to be \"this great long drumroll up to seeing this guy\".\nCarrie Fisher as General Leia Organa: The former princess of the destroyed planet Alderaan, now General of the Resistance, and Luke's twin sister. After the events of Return of the Jedi, she is described as \"a little more battle weary, a little more broken hearted\". Fisher described Leia as \"Solitary. Under a lot of pressure. Committed as ever to her cause, but I would imagine feeling somewhat defeated, tired, and pissed.\" Abrams said: \"The stakes are pretty high in the story for her, so there's not much goofing around where Leia's concerned.\"\nAdam Driver as Kylo Ren: A dark warrior who is strong with the Force, the leader of the Knights of Ren, and a high-ranking member of the First Order. He is the son of Han and Leia and the grandson of the deceased Darth Vader. Driver said the team tried \"not to think of him as being bad, or evil, or a villain. Something that was more three-dimensional. He's more dangerous and unpredictable, and morally justified in doing what he thinks is right.\"\nDaisy Ridley as Rey: A highly Force-sensitive scavenger who was abandoned as a child on the desert planet Jakku and awaits her family's return. Ridley said: \"She's completely self-sufficient and does everything for herself, until she meets [Finn] and an adventure begins.\"Cailey Fleming as Young Rey.\nJohn Boyega as Finn: A reformed First Order stormtrooper. Boyega said that he learned he obtained the part \"over a nice breakfast in Mayfair\" during which Abrams told him, \"John, you're the new star of Star Wars.\" Boyega said: \"When we find Finn, he's in incredible danger. And the way he reacts to this danger changes his life, and launches him into the Star Wars universe in a very unique way.\" He said in another interview: \"He's been taught about [Luke], he knows about his history. For him it's like joining the army and then learning about one of the great enemies of your country.\"\nOscar Isaac as Poe Dameron: A Resistance X-wing fighter pilot. Isaac said: \"He's the best freaking pilot in the galaxy… He's been sent on a mission by a certain princess, and he ends up coming up across [Finn], and their fates are forever intertwined.\"\nLupita Nyong'o as Maz Kanata: A wise and perceptive figure operating a somewhat shady cantina on the peaceful forest planet Takodana. Abrams said Kanata has \"lived over a thousand years. She's had this watering hole … and it's like another bar that you'd find in a corner of the Star Wars universe.\" According to Abrams, the character was based on his former high school English teacher, Rose Gilbert, who lectured at the Palisades Charter High School from 1961 to 2013. Abrams said the team \"really wanted the story to feel authentic, despite being a wild fantasy. I mentioned Rose in an early story meeting as a sort of timeless, wise figure that I'd actually known in my life.\"\nAndy Serkis as Supreme Leader Snoke: The political leader of the First Order. He is Kylo Ren's master and is very powerful in the dark side of the Force. Serkis described Snoke as \"quite an enigmatic character, and strangely vulnerable at the same time as being quite powerful… He is large. He appears tall. And also just the facial design—you couldn't have gotten there with prosthetics… Without giving too much away at this point, he has a very distinctive, idiosyncratic bone and facial structure.\"\nDomhnall Gleeson as General Hux: The commander of the First Order's Starkiller Base. Gleeson described him as \"pretty ruthless. A strong disciplinarian would be a mild way of putting it… He's kind of opposite Kylo Ren. They have their own relationship, which is individual and unusual. One of them is strong in different ways than the other. They're both vying for power.\"\nAnthony Daniels as C-3PO: A humanoid protocol droid in Organa's service. Daniels said the actors were allowed to experiment with their performances, and that Abrams \"made a field, a playpen where you were allowed to take your time and suggest things\".\nPeter Mayhew as Chewbacca: A Wookiee and Solo's longtime companion. Mayhew's double Joonas Suotamo portrays the character in several action scenes, and Ian Whyte performed stunts, as the 71-year-old Mayhew suffered from knee problems. This film marked the final time Mayhew physically portrayed the character before relinquishing the role to Suotamo in subsequent films.\nMax von Sydow as Lor San Tekka: A retired adventurer on Jakku, aiding the Resistance in finding Skywalker.Tim Rose and Mike Quinn reprise their respective roles as Admiral Ackbar and Nien Nunb from Return of the Jedi. Kipsang Rotich returns as the voice of Nien Nunb and Erik Bauersfeld returns to voice Ackbar. This was Bauersfeld's final film role before his death in April 2016. Kenny Baker, originally announced as part of the cast, was credited as \"consultant\" for R2-D2, with Jimmy Vee performing some of the work for R2-D2. Ewan McGregor has an uncredited vocal cameo as Obi-Wan Kenobi in Rey's vision sequence, while archival audio of Frank Oz and Alec Guinness as Yoda and Kenobi, respectively, are also used in the same scene; Oz recorded new dialogue for the film, but it was replaced with preexisting audio from The Empire Strikes Back.Gwendoline Christie portrays Captain Phasma, the commander of the First Order's legions of stormtroopers.Dave Chapman and Brian Herring served as puppeteers for BB-8, with Bill Hader and Ben Schwartz credited as \"Vocal Consultants\". Ken Leung appears as Statura, an admiral in the Resistance. Simon Pegg appears as Unkar Plutt, the Junkyard dealer on Jakku. Greg Grunberg plays Temmin \"Snap\" Wexley, an X-wing pilot. Kiran Shah plays Teedo, a scavenger on Jakku who rides a semi-mechanical Luggabeast. Jessica Henwick appears as Jess \"Testor\" Pava or Jess Testor, an X-wing pilot. Brian Vernel appears as Bala-Tik, the leader of the Guavian Death Gang. Yayan Ruhian, Iko Uwais, and Cecep Arif Rahman appear as Tasu Leech, Razoo Qin-Fee, and Crokind Shand, members of the Kanjiklub Gang, a criminal organization. Warwick Davis appears as Wollivan, a tavern-dweller in Maz Kanata's castle. Anna Brewster appears as Bazine Netal, a First Order spy, also at Maz Kanata's castle. Thomas Brodie-Sangster and Kate Fleetwood play First Order Petty Officers, Thanisson and Unamo, respectively. Billie Lourd, daughter of Carrie Fisher, appears as \nConnix, a lieutenant in the Resistance. Members of the Resistance include Emun Elliott as Brance and Maisie Richardson-Sellers as Korr Sella while Harriet Walter appears as Kalonia, the doctor who tends to Chewbacca. Mark Stanley appears as a Knight of Ren. Sebastian Armesto portrays Lieutenant Mitaka and Pip Torrens portrays Colonel Caplan, both serving the First Order.Daniel Craig, Michael Giacchino and Nigel Godrich cameo as stormtroopers. Abrams's assistant, Morgan Dameron, appears as a Resistance officer, while his father, Gerald W. Abrams, appears as Captain Cypress. The film's dialect coach, Andrew Jack, appears as Major Ematt of the Resistance. Additionally, Crystal Clarke, Pip Andersen, Christina Chong, Miltos Yerolemou, Amybeth Hargreaves, Leanne Best, Judah Friedlander, and Kevin Smith were cast in minor roles. Abrams has a vocal cameo, singing with Lin-Manuel Miranda on two songs, \"Jabba Flow\" and \"Dobra Doompa\", performed by Shag Kava, consisting of Abrams, Miranda and musicians. Star Wars: The Clone Wars and Star Wars Rebels cast and crew members Dee Bradley Baker, Matt Lanter, Tom Kane, Catherine Taber, Matthew Wood, Sam Witwer, Meredith Salenger, James Arnold Taylor, Dave Filoni, Michael Donovan, Devon Libran, Elle Newlands, Terri Douglas, Robert Stambler, Verona Blue, TJ Falls, Michelle Rejwan, Eugene Byrd, Fred Tatasciore, David Collins, Amanda Foreman, Christopher Scarabosio, Patrick Correll, Karen Huie, Orly Schuchmacher, Emily Towers, Jonathan Dixon, Kat Sheridan, Salacious Crumb, Mark Dodson, Gavyn Sykes and Christian Simpson provided the additional voices in the film. Riot control stormtrooper FN-2199, who calls Finn a traitor during the battle on Takodana, was portrayed by stunt performer Liang Yang and voiced by sound editor David Acord."}