{"_movieID": "333348", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:45:09", "summary": "Love the Coopers (titled Christmas with the Coopers in the UK and Ireland) is a 2015 American Christmas comedy-drama film directed by Jessie Nelson and written by Steven Rogers. The film stars an ensemble cast, including Alan Arkin, John Goodman, Ed Helms, Diane Keaton, Jake Lacy, Anthony Mackie, Amanda Seyfried, June Squibb, Marisa Tomei, Olivia Wilde and features the voice of Steve Martin, and follows a dysfunctional family that reunites for the holidays.\nThe film was released by CBS Films (via Lionsgate) on November 13, 2015, received generally negative reviews and grossed $42 million.\n\n", "plot": "Sam and Charlotte are divorcing after forty years of marriage. Charlotte convinces Sam to wait until after their grown children (Hank and Eleanor), grandchildren (Hank's kids Charlie, Bo and Madison), Charlotte's father and sister (Bucky and Emma) and Sam's aunt (Fishy) have enjoyed one last \"perfect Christmas\" before announcing the planned divorce. As scenes shift back and forth across the Cooper family members, their memories also briefly appear on screen as younger versions of themselves.\nHank, already struggling through his recent divorce from Angie, loses his job as a family holiday photographer when replaced by a machine. Eleanor has flown in but stays in an airport bar rather than going straight to her parents’ house.  She meets Joe, a soldier snowed in for at least another day at the airport. Talking about their different points of views and stances on relationships, Eleanor reveals that she is secretly dating a commitment-free married man.  She hates how her parents judge her for not being in a relationship, so she convinces Joe to pretend to be her boyfriend at the family dinner.\nBucky is a regular at a local diner, where he has befriended Ruby, a 20ish waitress who is unsettled.  They get into a serious argument when he learns that she is leaving town to a random spot on the map, made worse by telling others but being \"too cowardly\" to tell him.  He then apologizes and asks her to join the family dinner. High schooler Charlie drops in on his crush, Lauren, at the holiday store she works—finally making a move and sharing a kiss with her. Emma is arrested by police officer Percy Williams after she attempts to steal a piece of jewelry as a gift for Charlotte. In his car, Emma engages him in conversation, and he relents and lets her go, with advice that she buy Charlotte the most expensive thing she can afford.\nSam and Charlotte continue arguing while preparing dinner.  The four generations of Coopers are arriving at the house, along with Joe, Ruby, and Hank's ex-wife, Angie. During the dinner, chaos unleashes when Hank and Angie argue about their divorce, which leads to Bo screaming at them to \"just stop fighting\". There is a momentary power outage, and when it comes back Eleanor is kissing Joe, Emma is drinking everyone's wine, and Ruby screams when she sees that Bucky has collapsed.\nAt the hospital, Hank and Ruby walk beside Bucky's gurney as he is being taken for tests. Ruby kisses Bucky on the lips – confusing but deeply touching Hank. In the waiting room, Charlotte argues with Eleanor when she figures out that she is sleeping with Bucky's physician, Dr. Morrisey, so Eleanor crushes her further by admitting that Joe is just a prop from the airport bar. Alone with a sleeping Bucky in his room, Charlotte and Emma argue about their broken relationship as sisters. Joe leaves after also realizing Eleanor's affair is with Dr. Morrisey, but she chases after him, and the two share another kiss. Charlie is surprised when Lauren appears in the waiting room, responding to the text he sent her (actually, Bo sent it to \"help\" him). Hank comforts Ruby as part of their budding relationship. Sam and Charlotte reconcile. Emma, following Officer Percy's advice, buys Charlotte the most expensive thing she can – a shower stool from the hospital's small gift shop. Everyone is happily sharing a \"Christmas meal\" in the hospital cafeteria, when fortuitous muzak leads the whole Cooper clan to joyfully dance around the cafeteria.\nThe film is narrated by the family's St. Bernard, Rags."}