{"_movieID": "433501", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:48:54", "summary": "City of Lies is a 2018 American crime film directed by Brad Furman and written by Christian Contreras. It is based on the book LAbyrinth by Randall Sullivan, about the murder investigations of Tupac Shakur and The Notorious B.I.G. The film stars Johnny Depp as retired detective LAPD Russell Poole and Forest Whitaker as a journalist Jackson, with Rockmond Dunbar and Neil Brown Jr. also starring. \nOriginally set to be released on September 7, 2018 by Global Road Entertainment, it was pulled off the schedule in August 2018; no new date has been announced, but it was screened out of competition at the Noir in Festival on December 8, 2018 and later get a limited release in Italy on January 10, 2019.", "plot": "The film tells the story of former LAPD detective, Russell Poole (Johnny Depp), who in 1997 is working the murder cases of rappers Tupac Shakur and The Notorious B.I.G. A reporter (based on journalist Randall Sullivan's collaboration with Russell Poole), \"Jack\" Jackson, teams up with Poole after nearly two decades to find out the truth.", "cast": "Johnny Depp as Russell Poole, Megan's husband and a retired LAPD detective.\nForest Whitaker as Jackson (\"Jack\"), a journalist who teams with the cop to find the truth.\nRockmond Dunbar as Dreadlocks\nNeil Brown Jr. as Rafael Pérez, a corrupt LAPD officer\nXander Berkeley as Edwards\nShea Whigham as Detective Frank Lyga\nWynn Everett as Megan Poole, Russell's wife.\nToby Huss as Detective Fred Miller, Poole's partner\nLouis Herthum as City Attorney Stone, a city attorney who defends Poole on trial.\nShamier Anderson as David \"D. Mack\" Mack, a corrupt LAPD officer.\nAmin Joseph as Kevin Gaines, a corrupt LAPD officer\nLaurence Mason as Dunton, an FBI Agent\nJoseph Ferrante as Detective Snow\nDayton Callie as Lieutenant O'Shea\nKeith Szarabajka as Sgt. Reese\nPeter Greene as Commander Fasulo\nMarisol Sacramento as Errolyn Romero\nMichael Paré as Varney\nGlenn Plummer as Psycho Mike\nKevin Chapman as Sgt. Leeds\nObba Babatundé as Chief of Police\nRobert Henley Starr as EMT Robert McGinnis\nRian Bishop as Officer Simpyak\nRey Borge as Cashier\nVoletta Wallace as Herself"}