{"_movieID": "227156", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:09:37", "summary": "The Giver is a 1993 American young adult dystopian novel by Lois Lowry. It is set in a society which at first appears to be utopian but is revealed to be dystopian as the story progresses. The novel follows a 12-year-old boy named Jonas. The society has taken away pain and strife by converting to \"Sameness\", a plan that has also eradicated emotional depth from their lives. Jonas is selected to inherit the position of Receiver of Memory, the person who stores all the past memories of the time before Sameness, as there may be times where one must draw upon the wisdom gained from history to aid the community's decision making. Jonas struggles with concepts of all the new emotions and things introduced to him: whether they are inherently good, evil, or in between, and whether it is even possible to have one without the other. The Community lacks any color, memory, climate, or terrain, all in an effort to preserve structure, order, and a true sense of equality beyond personal individuality.The Giver won the 1994 Newbery Medal and has sold more than 10 million copies worldwide as of 2014. In Australia, Canada, and the United States, it is on many middle school reading lists, but it is also frequently challenged and it ranked number 11 on the American Library Association list of the most challenged books of the 1990s. A 2012 survey based in the U.S. designated it the fourth-best children's novel of all time.In 2014, a film adaptation was released, starring Jeff Bridges, Meryl Streep and Brenton Thwaites. The novel forms a loose quartet with three other books set in the same future era, known as The Giver Quartet: Gathering Blue (2000), Messenger (2004), and Son (2012).\n\n", "plot": "Jonas, a 12-year-old boy, lives in a Community isolated from all except a few similar towns, where everyone from small infants to the Chief Elder has an assigned role. With the annual Ceremony of Twelve upcoming, he is nervous, for there he will be assigned his life's work. He seeks reassurance from his father, a Nurturer (who cares for the new babies, who are genetically engineered; thus, Jonas's parents are not biologically related to him), and his mother, an official in the Department of Justice. He is told that the Elders, who assign the children their careers, are always right.\nThe day finally arrives, and Jonas is assembled with his classmates in order of birth. All of the Community is present, and the Chief Elder presides. Jonas is stunned when his turn is passed by, and he is increasingly conspicuous and agonized until he is alone. The Chief Elder then explains that Jonas has not been given a normal assignment, but instead has been selected as the next Receiver of Memory, to be trained by the current one, who sits among the Elders, staring at Jonas, and who shares with the boy unusual pale eyes. The position of Receiver has high status and responsibility, and Jonas quickly finds himself growing distant from his classmates, including his close friends Asher and Fiona. The rules Jonas receives further separate him, as they allow him no time to play with his friends, and require him to keep his training secret. They also allow him to lie and withhold his feelings from his family, things generally not allowed in the regimented Community.\nOnce he begins it, Jonas's training makes clear his uniqueness, for the Receiver of Memory is just that—a person who bears the burden of the memories from all of history, and who is the only one allowed access to books beyond schoolbooks, and the rulebook issued to every household. The current Receiver, who asks Jonas to call him the Giver, begins the process of transferring those memories to Jonas, for the ordinary person in the Community knows nothing of the past. These memories, and his being the only Community member allowed access to books about the past, give the Receiver perspective to advise the Council of Elders. The first memory is of sliding down a snow-covered hill on a sled, pleasantness made shocking by the fact that Jonas has never seen a sled, or snow, or a hill—for the memories of even these things has been given up to assure security and conformity (called Sameness). Even color has been surrendered, and the Giver shows Jonas a rainbow. Less pleasantly, he gives Jonas memories of hunger and war, things alien to the boy. Hanging over Jonas's training is the fact that the Giver once before had an apprentice, named Rosemary, but the boy finds his parents and the Giver reluctant to discuss what happened to her.\nJonas's father is concerned about an infant at the Nurturing Center who is failing to thrive, and has received special permission to bring him home at night. The baby's name will be Gabriel if he grows strong enough to be assigned to a family. He has pale eyes, like Jonas and the Giver, and Jonas becomes attached to him, especially when Jonas finds that he is capable of being given memories. If Gabriel does not increase in strength, he will be \"released from the Community\"—in common speech, taken Elsewhere. This has happened to an off-course air pilot, to chronic rule breakers, to elderly people, and to the apprentice Rosemary. After Jonas casually speculates as to life in Elsewhere, the Giver educates him by showing the boy hidden-camera video of Jonas's father doing his job: as two identical community members cannot be allowed, Jonas's father releases the smaller of identical twin newborns by injecting the baby with poison before putting its dead body in a trash chute. There is no Elsewhere for those not wanted by the Community—those said to have been \"released\" have been killed.\nSince he considers his father a murderer, Jonas initially refuses to return home, but the Giver convinces him that without the memories, the people of the Community cannot know that what they have been trained to do is wrong. Rosemary was unable to endure the darker memories of the past and instead killed herself with the poison. Together, Jonas and the Giver come to the understanding that the time for change is now—that the Community has lost its way and must have its memories returned. The only way to make this happen is for Jonas to leave the Community, at which time the memories he has been given will flood back into the people, as did the relatively few memories Rosemary had been given. Jonas wants the Giver to escape with him, but the Giver insists that he will be needed to help the people manage the memories, or they will destroy themselves. Once the Community is re-established along new lines, the Giver plans to join Rosemary in death.\nThe Giver devises a plot in which Jonas will escape beyond the boundaries of the Communities. The Giver will make it appear as if Jonas drowned in the river so that the search for him will be limited. The plan is scuttled when Jonas learns that Gabriel will be \"released\" the following morning, and he feels he has no choice but to escape with the infant. Their escape is fraught with danger, and the two are near death from cold and starvation when they reach the border of what Jonas believes must be Elsewhere. Using his ability to \"see beyond\", a gift that he does not quite understand, he finds a sled waiting for him at the top of a snowy hill. He and Gabriel ride the sled down towards a house filled with colored lights and warmth and love and a Christmas tree, and for the first time he hears something he believes must be music. The ending is ambiguous, with Jonas depicted as experiencing symptoms of hypothermia. This leaves his and Gabriel's future unresolved. However, their fate is revealed in Gathering Blue and in Messenger, companion novels written much later.In 2009, at the National Book Festival, the author Lois Lowry joked during a Q&A, \"Jonas is alive, by the way. You don't need to ask that question.\""}