{"_movieID": "389053", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:11", "summary": "The Do-Over is a 2016 American buddy action comedy film directed by Steven Brill, and written by Kevin Barnett and Chris Pappas. It stars Adam Sandler and David Spade. The film is the second in a four-film deal between Sandler and Netflix. The film was released worldwide on Netflix on May 27, 2016.The film follows Charlie (David Spade) and Max (Adam Sandler) after the latter fakes their deaths in order to start their lives anew. Things go awry, however, when they discover that the dead men whose identities they have adopted were entangled in criminal activities.\n\n", "plot": "Charlie McMillan (David Spade) is an unhappily married bank manager in a supermarket who reunites with his old high school buddy and FBI agent Max Kessler (Adam Sandler) at a high school reunion. They spend a weekend on a yacht Max rented, which makes Charlie feel young again.\nHowever, Max blows up the yacht and fakes their deaths. When Charlie regains consciousness, Max explains that they can now both start new, better lives. He confesses that he was not FBI, but a coroner. This allowed him to use two unclaimed cadavers in place of them when he blew up the yacht. Although initially appalled, Charlie has no reason to return to his old life. He is given the new identity of Dr. Ronald P. Fishman and Max takes on the new name Butch Ryder. Max tells Charlie he found a key in Butch's rectum and Charlie being a bank manager finds out it belongs to a safe deposit box in Puerto Rico.\nThey relocate to Puerto Rico and access the late Butch's safe deposit box. The box contains money and the keys to a secret mansion hideaway. The duo learn that the late Ronald was married after seeing a picture of his wife on Butch's tablet. Max and Charlie are then attacked by a group of assassins led by a hitman called  \"The Gymnast\" (Torsten Voges). They manage to escape and Max reveals he lied about being a coroner, he's a guidance counselor. He wanted to be a police officer, but was unsuccessful due to failing his psychological exam.\nThey return to the continental U.S. and find Ronald's widow, Heather (Paula Patton). Max and Charlie explain to her that Ronald was murdered and infer that Butch got Ronald entangled in criminal activity. Heather informs them that Ronald's study was broken into recently.\nThe trio head to a biker bar where Ronald and Butch used to meet up. At the bar, they learn that Butch had stage 4 cancer. Ronald had developed a \"magic bullet\" cancer treatment and they began conducting secret, non-FDA approved clinical trials. When Ronald's partner Arthur \"Shecky\" Sheck withdrew funding, Butch started robbing banks. But they also learn that Ronald and Butch were having a love affair.\nThe group heads to Shecky's (Matt Walsh) home where he reveals that his laptop and cell phone were stolen. The trio leave and determine that the men who tried to kill them wanted the cancer treatment formula and broke into Heather's and Shecky's homes to try to find it.\nCharlie says they should hand over the formula when they find it, which Max protests. Charlie then discovers that Max was actually one of Ronald's cancer patients. He also learns that Max has a young son with his wife, Becca (Kathryn Hahn), and realizes Max has been trying to recover the cure to save his own life all along.\nMax returns to Shecky's house, thinking that he is withholding the cure. Shecky has been mortally wounded by a gunshot, but reveals that the assassins were hired by Trojgaard, the world's largest chemotherapy company, to steal the cure so they could bury it. Shecky then dies and the Gymnast shows up to take Max hostage.\nMeanwhile, Charlie figures out that Ronald's cure has been disguised as a Jenga app on Butch's tablet. He attempts to call Max, but the Gymnast destroys Max's cell phone. Heather then arrives at Shecky's house and reveals to Max that she not only accepted a fortune from Trojgaard to bury the drug, but she was the one who killed Ronald and Butch.\nCharlie calls Heather and she claims Max killed Shecky. Charlie sees through her lie and comes to rescue Max. Heather manages to pull a gun on Charlie, but Max escapes from the Gymnast and knocks her out. Heather recovers, but Becca shows up and beats her unconscious. The police arrive, resulting in the tablet being accidentally thrown into water.\nThe tablet suffers irreparable damage, but Charlie backed up the formula on a USB flash drive. The duo are pardoned for their crimes when they offer the cancer treatment as a bargaining chip.\nCharlie, Max, Max's wife Becca, son and mother return to the house in Puerto Rico after Max is cured. The movie ends with Max and Charlie jumping off a cliff into the ocean, a feat which Charlie previously thought he would never be brave enough to do.", "cast": "Adam Sandler as Max Kessler\nDavid Spade as Charlie McMillan\nPaula Patton as Heather Fishman\nCatherine Bell as Dawn DeFazio\nNick Swardson as Bob\nMatt Walsh as Arthur \"Shecky\" Sheck\nLuis Guzmán as Jorge\nKathryn Hahn as Becca\nNatasha Leggero as Nikki\nMichael Chiklis as Carmine\nRenee Taylor as Mrs. Kessler\nSean Astin as Ted-O\nJackie Sandler as Joan\nDan Patrick as Lou\nTorsten Voges as The Gymnast\nXander Paradise as Twin #1\nZakk Paradise as Twin #2\nSheila Cochran as Hospital Screamer"}