{"_movieID": "426563", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:52:56", "summary": "Holmes & Watson is a 2018 American mystery buddy comedy film written and directed by Etan Cohen. The film stars Will Ferrell and John C. Reilly as the eponymous characters Sherlock Holmes and Dr. Watson, with Rebecca Hall, Rob Brydon, Steve Coogan, and Ralph Fiennes in supporting roles. The plot follows the famed detective duo as they set out to find the culprit behind a threat at Buckingham Palace. \nFirst announced in 2008 with Sacha Baron Cohen as Holmes and Ferrell as Watson, Holmes & Watson languished in development hell for several years before Ferrell and Reilly were confirmed for their eventual roles in July 2016, and Etan Cohen was announced as director. Filming took place around London from late 2016 to early 2017. It is the fourth collaboration between Ferrell and Reilly after Talladega Nights: The Ballad of Ricky Bobby (2006), Step Brothers (2008) and Anchorman 2: The Legend Continues (2013), though the first not to be directed by Adam McKay (who produced here).\nHolmes & Watson was released in the United States on December 25, 2018 by Sony Pictures Releasing, through its Columbia Pictures label. The film fell short at the box office, grossing $41.9 million worldwide on a $42 million budget and was panned by critics, who lamented its poor script, dated and unfunny jokes and its squandering of the cast and source material. Some critics labelled it the worst film of 2018.  The press reported numerous instances of people walking out early during screenings.  The film was nominated for six Razzies, and won four of them, including Worst Picture.", "plot": "In 1867 England, Sherlock Holmes suffered constant bullying from his classmates as a child; as a result, he sealed his emotions and dedicated his efforts strictly to knowledge, getting his classmates expelled for breaking rules. He befriends the caretaker's child John Watson, who is impressed with his brilliance. Years later, Holmes is viewed as a legendary detective. Both he and Watson are to view the trial of Professor James Moriarty, but are temporarily waylaid by a package sent by Moriarty and brought to them by their housekeeper, Mrs. Hudson. At the trial, Holmes reveals the man accused of Moriarty's crimes is an imposter named Jacob Musgrave, who is incapable of committing the murders due to tremors in his hand caused by excessive masturbation. Despite attempts by Inspector Lestrade to convince Holmes that his deduction is incorrect, Holmes is convinced that Moriarty is currently traveling to the United States. \nAfter the trial, the duo travel to Buckingham Palace to attend a surprise birthday party for Holmes, where they discover a corpse inside of a birthday cake along with a message from Moriarty, stating that Queen Victoria will die in 4 days' time. During the autopsy, Holmes and Watson meet Dr. Grace Hart and the feral Millie. Watson and Holmes become enamored with Grace and Millie, respectively. By the end of the autopsy, Watson declares that the corpse's cause of death is indeterminable, while Holmes believes that the person was poisoned. Furthermore, he believes that the poison came from Gustav Klinger. The pair eventually locate Klinger, who is indeed in league with Moriarty. Before Klinger can reveal anything, he is murdered. \nHolmes decides that he must seek help from his brother Mycroft, who tells him that the murderer is someone close to him. Holmes mistakenly believes Watson to be the murderer and has him arrested. He comes to regret this decision, causing his emotions to return. Holmes goes to Watson's cell, only to find it empty save for a plate filled with red velvet cake crumbs. Deducing that his housekeeper made the cake and that Watson left the crumbs to send him a message, he tracks Watson and Mrs. Hudson, who is revealed to be Moriarty's daughter, to the Titanic, where the murder of the Queen is to take place. After apologizing to and freeing Watson, they rush to the main room where they discover a bomb, which Watson throws out a window. The bomb lands in Mrs. Hudson's boat, killing her and her accomplices. \nThe pair are congratulated by the Queen, only for Holmes to defer the credit to Watson. The pair reconnect with Grace and Millie, the latter of whom reveals that her feral personality was an act to manipulate men. Each pair shares a kiss before Grace and Millie head out on the Titanic. After returning home, Holmes proudly displays a plaque on their building showing that Watson is a co-detective, finally giving him the recognition he desires (though it is still smaller than Holmes' own plaque). Later, Holmes and Watson confront Moriarty in a bar in the United States.", "cast": "Will Ferrell as Sherlock Holmes\nJohn C. Reilly as Dr. John Watson\nRebecca Hall as Dr. Grace Hart\nRalph Fiennes as Professor Moriarty\nRob Brydon as Inspector Lestrade\nKelly Macdonald as Rose Hudson\nSteve Coogan as Gustav Klinger\nLauren Lapkus as Millie\nPam Ferris as Queen Victoria\nHugh Laurie as Mycroft Holmes\nBella Ramsey as Flotsam\nScarlet Grace as Pickle\nNoah Jupe as Doxy\nBraun Strowman as Brawn\nBilly Zane as Billy Zane, in a homage to his role in Titanic\nBruce Buffer as Himself\nMichael Buffer as Himself"}