{"_movieID": "75900", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:53:24", "summary": "My Week with Marilyn is a 2011 drama film directed by Simon Curtis and written by Adrian Hodges. It stars Michelle Williams, Kenneth Branagh, Eddie Redmayne, Dominic Cooper, Julia Ormond, Emma Watson, and Judi Dench. Based on two books by Colin Clark, it depicts the making of the 1957 film The Prince and the Showgirl, which starred Marilyn Monroe (Williams) and Laurence Olivier (Branagh). The film focuses on the week during the shooting of the 1957 film when Monroe was escorted around London by Clark (Redmayne), after her husband Arthur Miller (Dougray Scott) had returned to the United States.\nPrincipal photography began on 4 October 2010, at Pinewood Studios. Filming took place at Saltwood Castle, White Waltham Airfield, and on locations in and around London. Curtis also used the same studio in which Monroe had shot The Prince and the Showgirl in 1956. My Week with Marilyn had its world premiere at the New York Film Festival on 9 October 2011, and was shown at the Mill Valley Film Festival two days later. The film was released on 23 November 2011, in the United States, and on 25 November in the United Kingdom.\nFor her portrayal of Monroe, Williams was awarded the Golden Globe for Best Actress in a Motion Picture – Comedy or Musical, and earned Best Actress nominations from the Academy Awards and British Academy Film Awards.\n\n", "plot": "Following his graduation from university in 1956, aspiring filmmaker Colin Clark travels to London to get a job on Laurence Olivier's next production. Production manager Hugh Perceval tells Colin that there are no jobs available, but he decides to wait for Olivier, whom he once met at a party. Olivier and his wife, Vivien Leigh, eventually show up and Vivien encourages Olivier to give Colin a job on his upcoming film The Prince and the Showgirl, starring Marilyn Monroe. Colin's first task is to find a suitable place for Marilyn and her husband, Arthur Miller, the famous playwright, to stay at while they are in England. The press discover the house, but Colin reveals he secured a second house just in case, impressing Olivier and Marilyn's publicist, Arthur P. Jacobs.\nThe paparazzi find out about Marilyn's arrival at Heathrow and they gather around the aircraft when it lands. Marilyn brings Arthur, her business partner, Milton H. Greene, and her acting coach, Paula Strasberg, with her. Marilyn is initially uncomfortable around the many photographers but relaxes at the press conference. Olivier becomes frustrated when Marilyn is late to the read-through. She insists Paula sit with her, and when she has trouble with her lines, Paula reads them for her. The crew and the other actors, including Sybil Thorndike, are in awe of Marilyn. Colin meets Lucy, a wardrobe assistant to whom he is attracted, and they go on a date. Marilyn starts arriving later to the set and often forgets her lines, angering Olivier. However, Sybil praises Marilyn and defends her when Olivier tries to get her to apologise for delaying the shoot.\nMarilyn struggles to understand her character and leaves the set when Olivier insults her. Colin asks Olivier to be more sympathetic towards Marilyn before he goes to Parkside House to check on her. He hears an argument and finds a tearful Marilyn sitting on the stairs with Arthur's notebook, which contains the plot of a new play in which Arthur seems to mock her. Arthur later returns to the United States. Vivien comes to the set and watches some of Marilyn's scenes, then argues with her husband. She breaks down, saying that Marilyn lights up the screen and that she wishes Olivier could see himself when he watches her. Olivier tries unsuccessfully to reassure his wife. Marilyn does not show up to the set following Arthur's departure and she asks Colin to come to Parkside, where they have a talk. The crew becomes captivated by Marilyn when she dances for a scene, during which Milton pulls Colin aside to tell him that Marilyn breaks hearts and that she will break his too. Lucy also notices Colin's growing infatuation with Marilyn and breaks up with him.\nColin and Marilyn spend the day together and are given a tour of the library of Windsor Castle by Owen Morshead. Colin also shows Marilyn around Eton College, and they go skinny dipping in the River Thames. Marilyn kisses Colin and they are found by Roger Smith, Marilyn's bodyguard. Colin is called to Parkside one night as Marilyn has locked herself in her room. Colin enters her room and Marilyn invites him to lie next to her on the bed. The following night, Marilyn wakes up in pain and claims she is having a miscarriage. A doctor tends to her. Marilyn tells Colin that Arthur is coming back and that she wants to try being a good wife to him, so she and Colin should forget everything that happened between them. She later returns to the set to complete the film. Olivier praises Marilyn but reveals she has killed his desire to direct again. Lucy asks Colin if Marilyn broke his heart and he replies that she did \"a little\", to which she replies that he needed it. Marilyn comes to a local pub, where Colin is staying, and thanks him for helping her. She kisses him goodbye and Roger drives her to the airport."}