{"_movieID": "493092", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:36:13", "summary": "\"Bad Reputation\" is the seventeenth episode of the American television series, Glee. The episode premiered on the Fox network on May 4, 2010. It was directed by Elodie Keene, and written by series creator Ian Brennan. In \"Bad Reputation\", cheerleading coach Sue Sylvester (Jane Lynch) is publicly ridiculed when a video of her dancing to Olivia Newton-John's \"Physical\" is posted on YouTube. A salacious list about members of the glee club circulates the school, leading certain members to try to earn themselves a bad reputation. Newton-John guest-stars as herself in the episode, and Molly Shannon makes her first appearance in a recurring role. Following their romance in the episode \"Mash-Up\", club members Rachel (Lea Michele) and Puck (Mark Salling) are reunited, a decision made by the producers due to the unexpected popularity of the pairing.\nThe episode features cover versions of five songs, all of which were released as singles, available for digital download, and two of which are included on the soundtrack album Glee: The Music, Volume 3 – Showstoppers. \"Bad Reputation\" was watched by 11.62 million American viewers and received mixed reviews from critics. Darren Franich of Entertainment Weekly and Bobby Hankinson of the Houston Chronicle both considered it a return to form following disappointing episodes. Franich also praised the episode's cover version of \"Ice Ice Baby\" by Vanilla Ice, which in contrast was criticized by Raymund Flandez of The Wall Street Journal and Gerrick D. Kennedy of the Los Angeles Times, with Kennedy deeming the performance his least favorite moment of the entire series thus far.", "plot": "When Kurt (Chris Colfer) steals a video of cheerleading coach Sue Sylvester (Jane Lynch) performing Olivia Newton-John's \"Physical\" to a Jazzercise routine, the glee club members decide to post it on YouTube as a prank. The video becomes a viral hit and Sue is mortified. In retaliation, she gives Principal Figgins (Iqbal Theba) a list she has found, called a \"glist\", which ranks the students in the glee club based on a scale of sexual promiscuity. The list goes: Quinn, Santana, Puck, Brittany, Jesse, Finn, Mike, Matt and Rachel, from most to least. Figgins tells club director Will Schuester (Matthew Morrison) that he must either find the creator of the list, or he will be forced to disband the glee club and suspend all of its members. Will reprimands the club members, and for their weekly club assignment, he has the students find songs with bad reputations and rehabilitate them, performing Vanilla Ice's \"Ice Ice Baby\" as an example.\nSue is laughed at by her co-workers, who have seen the video, and is mocked by new alcoholic astronomy teacher and badminton coach Brenda Castle (Molly Shannon). Sue is reminded by her sister, Jean (Robin Trocki), who has Down Syndrome, that when they were hurt as children they would volunteer at an animal shelter as a reminder there was always someone less fortunate than themselves. In light of her sister's advice, Sue decides to act as a therapist to guidance counselor Emma Pillsbury (Jayma Mays), informing her that Will has been unfaithful to her. Emma confronts Will in the teachers' lounge, publicly shaming him.\nKurt, Mercedes (Amber Riley), Artie (Kevin McHale), and Tina (Jenna Ushkowitz) are upset over not being included on the list, while Brittany (Heather Morris) is puzzled at not being listed among the top three, given that she has made out with everyone in the school: boys, girls, and the janitor. They perform a rendition of \"U Can't Touch This\" in the school library to cause a disruption in the hope of earning a bad reputation, but their plan backfires when the librarian asks them to perform it at her church's Sunday service. Next, Kurt confesses to Sue that he is the one who stole her video, expecting to be punished and also gain a more dangerous reputation. Instead, she thanks him, having recently been contacted by Olivia Newton-John, who had seen Sue's video and requested her help remaking the \"Physical\" video. The song's re-release gains Sue a position in the top 700 recording artists, which ends the ridicule of her colleagues. She donates her share of the profits to her sister's residential care facility.\nAfter apologizing to Emma and presenting her with flowers, Will sees a depressed-looking Quinn (Dianna Agron) in the hallway and realizes that she is responsible for the list. He confronts Quinn, who confesses. To prevent her from being suspended, Will lies to Figgins that no culprit has been found, but convinces him that as no new lists have been posted, the matter should be dropped.\nRachel (Lea Michele) asks Puck (Mark Salling) to assist her in the glee club assignment, creating a video for David Geddes' \"Run Joey Run\". But she secretly also recruits her ex-boyfriend Finn (Cory Monteith) and her current boyfriend Jesse St. James (Jonathan Groff), triple-casting them in the role of her film boyfriend, Joey, in a bid to improve her glist rating. When Rachel plays the video in class, all three are surprised, offended and angered by her deception. Jesse breaks up with Rachel as a result, and she sings Bonnie Tyler's \"Total Eclipse of the Heart\" as the club members walk out of the classroom, leaving her behind."}