{"_movieID": "10192", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:29", "summary": "Shrek Forever After (previously promoted as Shrek: The Final Chapter) is a 2010 American computer-animated comedy film produced by DreamWorks Animation and distributed by Paramount Pictures. It is the fourth installment in the Shrek film franchise and the sequel to Shrek the Third (2007). The film was directed by Mike Mitchell from a screenplay by Josh Klausner and Darren Lemke, and stars Mike Myers, Eddie Murphy, Cameron Diaz, Antonio Banderas, Julie Andrews, and John Cleese reprising their previous roles, with Walt Dohrn introduced in the role of Rumpelstiltskin. The plot follows Shrek struggling as a family man with no privacy, who yearns for the days when he was once feared. He is tricked by Rumpelstiltskin into signing a contract that leads to disastrous consequences.\nThe film premiered at the Tribeca Film Festival on April 21, 2010, and was theatrically released in the United States on May 21, 2010 in 3D and IMAX 3D formats. The film debuted as the top-grossing film at the box office, a position it held for three consecutive weeks in the United States and Canada. Like its predecessor, it received mixed reviews from critics, but grossed a worldwide total of $752 million and becoming the fifth-highest-grossing film of 2010. In addition, Shrek Forever After became DreamWorks Animation's second-highest-grossing film at the foreign box office. Although originally marketed as the final installment in the film franchise, a fifth Shrek film has unofficially been reported to be in production in the years since Forever After was released.", "plot": "In a flashback, King Harold and Queen Lillian are about to sign the kingdom of Far Far Away over to Rumpelstiltskin,  in exchange for lifting their daughter's curse. The deal is canceled at the last second when a knight informs the King and Queen that Princess Fiona has been rescued by Shrek. An angry Rumpelstiltskin laments his loss and wishes Shrek was never born.\nIn the present time, Shrek has grown steadily weary of being a family man and celebrity among the local villagers, leading him to wish for when he felt like a \"real ogre\" again. When he takes his family to Far Far Away to celebrate his children's first birthday, a series of mishaps further injure his ego, causing him to lose his temper and walk out in anger.\nShrek encounters  Rumpelstiltskin, who seizes his chance, having observed Shrek's angry outburst. He follows Shrek and arranges for him to appear to save his life. He gives Shrek a day to live like a real ogre, in exchange for a day from his childhood that he would not remember being erased to \"thank\" him.\nShrek signs the contract and appears in an alternate reality where the events starting from Fiona's rescue never happened. Now feared by the villagers, he takes the opportunity to cause some lighthearted mischief until he finds \"WANTED\" posters for Fiona and his home deserted and desolate. He is kidnapped by witches and taken to Rumpel, now the King of Far Far Away, which has become derelict.\nRumpel reveals that he erased the day that Shrek was born. Therefore, Shrek does not exist, and consequently the King and Queen signed their kingdom over to Rumpel, making them disappear. When the day ends, Shrek will disappear as well. Shrek escapes Rumpel's castle with Donkey. Initially terrified of Shrek, Donkey decides to trust him after seeing Shrek cry over his erased history, something he had never seen an ogre do before. Donkey helps him find a hidden exit clause: the contract can be nullified by \"true love's kiss\".\nThey soon encounter an army of ogres who are resisting Rumpel, led by a still-cursed Fiona, who keeps Puss in Boots as a lazy, overweight pet. Shrek does everything he can to gain Fiona's love, but she is cynical and disillusioned about the power of true love and is too busy preparing an ambush on Rumpel. While sparring with her, Fiona begins to take a liking to Shrek but stops short of kissing him. Puss encourages him to continue pursuing Fiona.\nDuring the ambush, the ogres are captured by the Pied Piper, though Shrek and Fiona escape with the intervention of Puss and Donkey. Shrek insists Fiona kiss him, saying it will fix everything, but it does not work because Fiona does not truly love him. When he hears that Rumpel is offering a wish to the one who brings him Shrek, Shrek turns himself in and uses the wish to free the other ogres, who storm the castle, battle the witches, and capture Rumpel.\nAs the sun rises, Shrek begins to fade from existence, but Fiona, having fallen in love with him, kisses Shrek just before he disappears, restoring Shrek to his world just before he lashed out at the party. Shrek embraces his friends and family with a newfound appreciation for everything he has."}