{"_movieID": "76758", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:53:02", "summary": "The Flowers of War (simplified Chinese: 金陵十三钗; traditional Chinese: 金陵十三釵; pinyin: Jīnlíng Shísān Chāi) is a 2011 historical drama war film directed by Zhang Yimou, starring Christian Bale, Ni Ni, Zhang Xinyi, Tong Dawei, Atsuro Watabe, Shigeo Kobayashi and Cao Kefan. The film is based on a novella by Geling Yan, 13 Flowers of Nanjing, inspired by the diary of Minnie Vautrin. The story is set in Nanking, China, during the 1937 Nanking Massacre in the Second Sino-Japanese War. A group of escapees, finding sanctuary in a church compound, try to survive the plight and persecution brought on by the violent invasion of the city.It was selected as the Chinese entry for Best Foreign Language Film at the 84th Academy Awards, but did not make the final shortlist. It also received a nomination for the 69th Golden Globe Awards. The 6th Asian Film Awards presented The Flowers of War with several individual nominations, including Best Film.The film's North American distribution rights were acquired by Wrekin Hill Entertainment, in association with Row 1 Productions, leading to an Oscar-qualifying limited release in New York, Los Angeles and San Francisco in late December 2011, with general release in January 2012.\n\n", "plot": "In 1937, Japan invades China, beginning the Second Sino-Japanese War. The Japanese Imperial Army overruns China's capital city, Nanking, in December and carries out the systematic and brutal Nanking massacre.\nAs the invading Japanese overpower the Chinese army, desperate schoolgirls flee to the nominally protective walls of their convent at a Western-run Roman Catholic cathedral. Here, John Miller (Bale), an American mortician on a task to bury the head priest, joins the group of innocent schoolgirls.  He finds a boy there, George, an orphan who was raised by the dead priest, and taught English. The boy is the same age as the schoolgirls. Soon a group of flamboyant prostitutes arrive at the cathedral, seeking refuge by hiding in the cellar. Pretending to be a priest, Miller tries to keep everyone safe while trying to repair the convent's truck to use for an escape.\nAfter an incident when rogue Japanese forces assault the cathedral (who are then killed by the dying effort of a lone Chinese Major (Tong)), Japanese Colonel Hasegawa promises to protect the convent by placing guards outside the gate, and requests that the schoolgirls sing a chorale for him. Several days later, he hands Miller an official invitation for the schoolgirls to sing at the Japanese Army's victory celebration. Fearing for the safety of the virginal schoolgirls, Miller declines. Hasegawa informs him that it is an order and that the girls are going to be picked up the next day. Before they leave, the Japanese soldiers count the schoolgirls and erroneously include one of the prostitutes (who has strayed from the cellar), totalling 13.\nWhen the de facto leader of the schoolgirls, Shu Juan (Xinyi), convinces them that they are better off committing suicide by jumping off the cathedral tower, they are saved at the last moment when the de facto leader of the prostitutes, Yu Mo (Ni), convinces her group to protect the schoolgirls by taking their place at the Japanese party. As there are only 12 prostitutes, George, the dead priest's adoptive son, volunteers as well. Miller initially opposes their self-sacrificing decision, but ultimately assists in disguising them, using his skills as a mortician to adjust their makeup and cut their hair to appear like schoolgirls. The prostitutes also create knives out of broken windows and hide them in their cloaks.\nThe next day, the \"13 Flowers of Nanking\" are led away by the unsuspecting Japanese soldiers. After they depart, Miller hides the schoolgirls on the truck he repaired and, using a single-person permit provided by the father of a schoolgirl, drives out of Nanking. In the last scene, the truck is seen driving on a deserted highway heading west, away from the advancing Japanese army. The fate of the 13 Flowers remains unknown, apparently martyring themselves for the students' freedom.", "cast": "Christian Bale as John Miller\nNi Ni as Yu Mo\nZhang Xinyi as Shu\nTong Dawei as Major Li\nAtsuro Watabe as Colonel Hasegawa\nShigeo Kobayashi as Lieutenant Kato\nCao Kefan as Mr. Meng\nHuang Tianyuan as George Chen\nHan Xiting as Yi\nZhang Doudou as Ling\nYuan Yangchunzi as Mosquito\nSun Jia as Hua\nLi Yuemin as Dou\nBai Xue as Lan\nTakashi Yamanaka as Lieutenant Asakura\nPaul Schneider as Terry"}