{"_movieID": "97367", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:43:35", "summary": "The Place Beyond the Pines is a 2012 American crime tragedy drama film directed by Derek Cianfrance with a screenplay by Cianfrance, Ben Coccio, and Darius Marder from a story by Cianfrance and Coccio. It stars Ryan Gosling, Bradley Cooper, Eva Mendes, Emory Cohen and Dane DeHaan, with Ben Mendelsohn, Rose Byrne, Mahershala Ali, Bruce Greenwood, Harris Yulin, and Ray Liotta in supporting roles. The film reunites Cianfrance and Gosling, who worked together on the 2010 film Blue Valentine. The film was scored by Mike Patton and also featured previously written music by Estonian composer Arvo Pärt. The title is the English meaning of the city of Schenectady, New York, which is derived loosely from a Mohawk word for \"place beyond the pine plains.\"\n\n", "plot": "In 1997, Luke Glanton (Gosling) is a motorcycle stuntman. In Schenectady, New York, Luke reunites with his ex-lover Romina Gutierrez (Mendes), who is dating another man named Kofi Kancam (Ali). Luke discovers that Romina has a baby son named Jason that he fathered which she never revealed to him, so Luke quits his job to stay with Romina and their son.\nLuke begins working part-time for auto mechanic Robin Van Der Hook (Mendelsohn). He asks Robin for more work and Robin, who can’t offer it legitimately, reveals his past as a successful bank robber and offers to partner up for a few robberies. Skeptical at first, Luke decides to take Robin up on his offer after planning and setting up their first job. They successfully pull off a few heists by having Luke rob the bank at gunpoint, use his bike as a getaway vehicle and ride it into a box truck driven by Robin. \nLuke uses his share of the money to get closer to Romina, and visits her and Jason more often. As he takes them out for ice cream, the three ask a passerby to take a photo to capture the moment. However, Luke is arrested after striking Kofi with a wrench during a fight. When Robin bails him out of jail, Luke states that he wants to give his money to Romina for Jason when he's older. Luke insists on resuming their robberies, but Robin objects, and the two have a falling out that results in Robin dismantling Luke’s motorcycle. Luke robs Robin and uses the money to buy a new bike.\nLuke attempts to rob a bank alone but fails to properly plan for the job and is pursued by police. He is cornered in the top floor of a house by rookie police officer Avery Cross (Cooper) and calls Romina, asking her not to tell Jason who he was. Avery enters the room and shoots Luke in the stomach. Luke fires back, hitting Avery in the leg, but falls three stories out of the window to his death.\nAvery is hailed as a hero after taking down Glanton, but feels remorse about the shooting. Avery and his fellow officers illegally seize the stolen money from Romina's home, but Avery tries to return it to Romina, who rejects it. Avery then tries to turn the money in to the chief of police, who rebuffs him. Discouraged, Avery records other illegal practices in the police department, and uses the recording to get a position as an assistant district attorney.\nFifteen years later, Avery is running for Attorney General of New York. He has his troubled teenage son A.J., who had been living with Avery’s ex-wife, move in with him and transfer to Schenectady High School. There, A.J. befriends Jason (DeHaan), but neither know the history between their fathers. The two are later arrested for felony drug possession, but when Avery is called in to pick up his son, he recognizes Jason's name. He gets Jason's charge dropped to a misdemeanor and orders A.J. to stay away from him.\nKofi finally tells Jason his father's name, allowing Jason to discover Luke's past on the Internet. Jason visits Robin, who tells him more about Luke and their robberies. Back in school, A.J. pressures Jason to steal Oxycontin, which Jason does, narrowly escaping the owner after failing to sneak back out undiscovered.\nJason eventually realizes that A.J.'s father is the man who killed his own father. After a fight with A.J., which leaves Jason hospitalized, Jason buys a gun, breaks into the Cross family home, beats A.J., and takes Avery hostage. Jason forces Avery to drive into the woods, where Avery breaks down and tearfully apologizes for killing Jason's father. Instead of killing him, Jason steals Avery's wallet and leaves him unharmed. In the wallet, Jason finds the photo of him and his parents eating ice cream, which Avery had stolen from the evidence locker.\nSome time later, Avery wins his bid for New York Attorney General, with A.J. at his side. Romina receives an envelope addressed to \"Mom\", with the old photograph inside. Jason purchases a motorcycle, starts the bike, and rides away from his old life.", "cast": "Ryan Gosling as Luke Glanton\nBradley Cooper as Avery Cross\nEva Mendes as Romina Gutierrez\nDane DeHaan as Jason Glanton\nEmory Cohen as A. J. Cross\nBen Mendelsohn as Robin Van Der Hook\nRose Byrne as Jennifer Cross\nMahershala Ali as Kofi Kancam\nBruce Greenwood as Bill Killcullen\nRay Liotta as Peter Deluca\nHarris Yulin as Albert Cross\nRobert Clohessy as Chief Weirzbowski\nOlga Merediz as Malena Gutierrez"}