{"_movieID": "57800", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:00", "summary": "Ice Age: Continental Drift is a 2012 American computer-animated adventure comedy film produced by Blue Sky Studios and distributed by 20th Century Fox. It is the sequel to Ice Age: Dawn of the Dinosaurs and the fourth film in the Ice Age series. The film was directed by Steve Martino and Michael Thurmeier from a screenplay by Michael Berg and Jason Fuchs, and stars the voices of Ray Romano, John Leguizamo, Denis Leary, Queen Latifah, Seann William Scott, Josh Peck, and Chris Wedge reprise their previous roles alongside Keke Palmer, Nicki Minaj, Drake, Jennifer Lopez, Josh Gad, and Peter Dinklage voicing new characters. The plot focuses on Scrat sending Manny, Sid, and Diego adrift on an iceberg with Sid's Granny and causing them to face a gang of pirates led by Captain Gutt.\nIce Age: Continental Drift was released in the United States on July 13, 2012. This was the first Ice Age film to be presented in the 2.39:1 aspect ratio. The film grossed $877 million worldwide, marking it the fifth highest-grossing film of 2012 and the highest-grossing animated film of 2012.", "plot": "While Scrat inadvertently causes the break up of Pangaea, Manny and Ellie are forced to deal with the trials and tribulations of their teenage daughter Peaches, who has trouble fitting in with her peers. Ellie tries to support her daughter, but Manny becomes exceedingly overprotective. Meanwhile, Sid's family returns, but only to drop off the elderly Granny before abandoning them both. Shortly after, a sudden continental break-up separates Manny from The Herd. Trapped on a moving chunk of ice with Sid, Granny, and Diego, Manny has no choice but to ride out the current. Meanwhile, a giant land shift encroaches on Ellie, Peaches, and those remaining on land, causing them to make their way towards a land bridge.\nMeanwhile, Scrat, in a subplot, finds an acorn that has a treasure map on it that directs him towards an island. After violent weather pushes them further away from land, Manny's group is captured by a band of pirates sailing on a floating iceberg led by a Gigantopithecus, Captain Gutt, who attempts to press them into his crew. When they refuse, Gutt tries to execute them, leading to their escape, which inadvertently cause the ship and food supplies to sink. Gutt's first mate, a female sabretooth named Shira, joins them after she is left for dead.\nThe Herd washes ashore on Switchback Cove, which gives a current back to their home. Manny coordinates a plan using a group of hyrax to steal a new iceberg ship that Gutt is planning to use, and they are able to escape using the ship. Just before that, Diego, who has fallen in love with Shira, tries to convince her to leave the pirates and join The Herd so she can have a better life, but Shira, while initially accepting, instead stays behind and slows Gutt down so The Herd can escape. Gutt then forms another ship and plans to seek revenge on Manny.\nAfter narrowly escaping a pack of sirens, Manny, Sid, Diego, and Granny return home only to find the land bridge destroyed and that Gutt has beaten them and taken Ellie, Peaches, and the rest of The Herd hostage. A fight ensues, as Granny's pet whale, Precious, arrives and fends off Gutt's crew. Manny defeats Gutt in a final duel on an ice floe and reunites with his family and friends. Gutt subsequently encounters a siren that assumes the shape of a female Gigantopithecus, and is trapped inside. With their home destroyed by the land shift, Precious takes the entire Herd (including Shira, who becomes a couple with Diego) to a lush island where the hyraxes from earlier have already started rebuilding their civilization.\nIn the film's epilogue, Scrat discovers the island on the map, known as Scratlantis (a parody of Atlantis), but his uncontrollable urge to hunt acorns in the acorn-rich city inadvertently causes the entire island to sink when he unplugs an acorn drain holder; Scrat is then ejected into a newly created desert landscape, through which he screams."}