{"_movieID": "4515", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:38", "summary": "Lions for Lambs is a 2007 American war drama film directed by Robert Redford about the connection between a platoon of United States soldiers in Afghanistan, a U.S. senator, a reporter, and a California college professor. It stars Redford, Tom Cruise, and Meryl Streep. It was the first Cruise/Wagner Productions film since the company joined with United Artists subsequent to Cruise's falling out with Paramount Pictures in 2006.With a title that alludes to incompetent leaders sending brave soldiers into the slaughter of battle, the film takes aim at the U.S. government's prosecution of the wars in the Middle East, showing three different simultaneous stories: a senator who launches a new military strategy and details it to a journalist, two soldiers involved in said operation, and their college professor trying to re-engage a promising student by telling him their story. The film was written by Matthew Michael Carnahan, and directed by Robert Redford. It was released in North America on November 9, 2007, to negative reviews and disappointing box office receipts.", "plot": "Two students at a West Coast university, Arian and Ernest, at the urging of their idealistic professor, Dr. Malley, attempt to do something important with their lives. They make the bold decision to enlist in the army to fight in Afghanistan after graduating from college.\nDr. Malley also attempts to reach talented and privileged, but disaffected, student Todd Hayes, who is not at all like Arian and Ernest. He is naturally bright, comes from a privileged background, but has apparently slipped into apathy upon being disillusioned at the present state of affairs. Now, he devotes most of his time to extra-curricular activities like his role as president of his fraternity. Malley tests him by offering a choice between a respectable grade of 'B' in the class with no additional work required or a final opportunity to re-engage with the material of the class and \"do something.\" Before Todd makes his choice, he must listen to Dr. Malley's story of his former students Arian and Ernest and why they are in Afghanistan.\nMeanwhile, in Washington, D.C., a charismatic Republican presidential hopeful, Senator Jasper Irving, has invited liberal TV journalist Janine Roth to his office to announce a new war strategy in Afghanistan: the use of small units to seize strategic positions in the mountains before the Taliban can occupy them. The senator hopes that Roth's positive coverage will help convince the public that the plan is sound.\nRoth has her doubts and fears she is being asked to become an instrument of government propaganda. She informs her commercially-minded boss of her plans to call out the senator's new strategy for what she feels is a ploy, but is shot down. Ultimately, Irving's version of the story is run without the critical interaction. Whether Roth gave in and toed the company line or quit her job is not clear.\nIn Afghanistan, a helicopter carrying Arian and Ernest is hit by Taliban insurgents. Ernest falls out, and Arian jumps after him. Ernest's leg is badly wounded, and he suffers a compound fracture, rendering him immobile as the Taliban arrive. After a drawn-out gunfight, the U.S. soldiers run out of ammunition. Rather than getting captured, Arian helps Ernest stand up, facing the enemies and turning their empty weapons against them, an action which prompts the Taliban to kill them. The unit commanders attempt a rescue of the downed soldiers, sending A-10 Warthogs, but the weather, time, and distance interfere.\nHayes is watching television with a friend. A reporter is discussing a singer's private life, while below runs a strip announcing Senator Irving's new military plan for Afghanistan. Hayes suddenly falls quiet, contemplating the choices with which his professor had left him.", "cast": "Robert Redford as Professor Stephen Malley\nMeryl Streep as Janine Roth\nTom Cruise as Senator Jasper Irving (R-IL)\nMichael Peña as Ernest Rodriguez\nAndrew Garfield as Todd Hayes\nDerek Luke as Arian Finch\nPeter Berg as Lt. Col. Falco\nKevin Dunn as ANX Editor"}