{"_movieID": "384680", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:53:11", "summary": "Hostiles is a 2017 American Western film written and directed by Scott Cooper, based on a story by Donald E. Stewart. It stars Christian Bale, Rosamund Pike, Wes Studi, Ben Foster, Stephen Lang, Jesse Plemons, Rory Cochrane, Adam Beach,\nQ'orianka Kilcher, Timothée Chalamet and Scott Wilson in his final film role. It follows a U.S. Army cavalry officer who must escort a Cheyenne war chief and his family back to their home in Montana in 1892.\nThe film had its world premiere at the Telluride Film Festival on September 2, 2017, and had a limited release in the United States by Entertainment Studios starting December 22, 2017, before going wide on January 26, 2018. It received generally positive reviews from critics and grossed $35 million worldwide.", "plot": "In 1892, settler Rosalee Quaid and her family are attacked by a Comanche war group who kill and scalp her husband and also shoot and kill her three children. Only Rosalee manages to escape the attack by hiding in a small rock outcrop in the forest.\nIn Fort Berringer, New Mexico, Captain Joseph Blocker rounds up an escaping Apache family and brings them back to the fort. He is then called to the office of Colonel Abraham Biggs, who informs him of his final orders before retirement. On a directive from President Harrison, he is to escort dying Cheyenne war chief, Yellow Hawk, and four members of his family back to their tribal lands in Montana. Under threat of a court-martial and loss of his pension, Blocker reluctantly accepts, despite his own gory history with the chief, who was responsible for the death of several of his friends and comrades. Blocker chooses the detail that will accompany him: his trusty old friend, First Sergeant Thomas Metz, long-time aide Corporal Woodson, and promising newcomer Lieutenant Kidder, fresh from West Point. Biggs also assigns to the detail a young French-speaking recruit, Private Desjardins.\nThey begin their journey but Blocker orders a stop and has the two native men put in chains. The group comes across the charred Quaid house and dead settler. Inside the house, they find Rosalee and her three \"sleeping\" children. Rosalee is initially hostile towards the Cheyenne family because of the attack on her family but agrees to sleep in their camp after some coaxing from Blocker. She is convinced to bury her family and join Blocker's detail until their next stop-over. They are soon ambushed by the Comanche party, resulting in Desjardins's death and Woodson being seriously wounded. After this attack, Yellow Hawk convinces Blocker that it is in everyone's best interest to unchain him and his family. The next day, the bodies of the surviving Comanche party, who had managed to flee during their previous encounter, are discovered dead. Blocker deduces that Yellow Hawk and his son, Black Hawk, killed them thanks to Metz allowing them to leave the camp during the night.\nAfter a brief stop at Fort Winslow in Colorado to drop off the wounded Woodson and widow Rosalee, Blocker is asked to take disgraced Sergeant Charles Wills, who killed a family with an ax, to be court-martialed and hanged at his original post along the way to Montana. Joining Blocker’s company to oversee Wills are Corporal Tommy Thomas and Sergeant Malloy. Meanwhile, Rosalee decides to continue on with Blocker, despite being offered sanctuary at Fort Winslow until the next supply train at Christmas. One night, the women are abducted by three fur traders as they wash dishes in the stream by their camp. The company, assisted by Yellow Hawk and Black Hawk, track down the fur traders, slaughter them and rescue the women; however, Sergeant Malloy is killed. During a downpour, Wills fools Kidder into sympathetically undoing his chains, then kills him and escapes, but not before Blocker wounds him.  Metz tracks down and kills Wills, then takes his own life, succumbing to decades of post-traumatic stress and guilt. Blocker subsequently makes peace with Yellow Hawk for all of the harms they have inflicted upon each other.\nThey arrive at the chief's tribal lands in Montana where he succumbs to his illness and is buried. A man and his three sons ride up, state that they own the land, and order Blocker and the rest of the group to leave with the chief's body. Blocker informs them of his presidential authority but a brutal gun battle ensues leaving only three survivors: Blocker, Rosalee, and Yellow Hawk's young grandson, Little Bear. In the final scene, Rosalee and Little Bear reluctantly depart on a train from Montana to Chicago, without Blocker, but, at the last second, Blocker steps onto the back of the train and into the carriage.", "cast": "Christian Bale as Captain Joseph J. Blocker, a veteran of the Indian Wars, with a reputation as a ruthless killer.\nRosamund Pike as Rosalee Quaid, a suicidal widow who joins Blocker's detail after the murder of her family by Comanches.\nWes Studi as Cheyenne Chief Yellow Hawk, an imprisoned and sickly war chief being taken home to die, and the father of Black Hawk and Living Woman.\nJesse Plemons as Lieutenant Rudy Kidder, a fresh West Point graduate, part of the detail to escort Yellow Hawk home.\nAdam Beach as Black Hawk, Yellow Hawk's son and Elk Woman's husband.\nRory Cochrane as First Sergeant Thomas Metz, a war-weary veteran who is among Blocker's oldest friends, part of the detail to escort Yellow Hawk Home.\nPeter Mullan as Lieutenant Colonel Ross McCowan, commander of Fort Winslow, Colorado.\nScott Wilson as Cyrus Lounde, the owner of Yellow Hawk's ancestral land. Wilson's final film appearance before his death in 2018.\nPaul Anderson as Corporal Tommy Thomas, a soldier from Fort Winslow escorting Wills to his hanging.\nTimothée Chalamet as Private Philippe Desjardins, the youngest member of the detail to escort Yellow Hawk Home.\nBen Foster as Sergeant Charles Wills, a criminal soldier whom Blocker is charged of escorting to his hanging.\nJonathan Majors as Corporal Henry Woodson, a soldier who served under Blocker for many years, part of the detail to escort Yellow Hawk home.\nJohn Benjamin Hickey as Captain Royce Tolan, a soldier stationed at Fort Berringer alongside Blocker.\nQ'orianka Kilcher as Elk Woman, Black Hawk's wife.\nTanaya Beatty as Living Woman, Black Hawk's sister.\nStephen Lang as Colonel Abraham Biggs, Blocker's commanding officer\nBill Camp as Jeremiah Wilks, frontier correspondent for Harper's Weekly.\nScott Shepherd as Wesley Quaid, Rosalee's slaughtered husband.\nRyan Bingham as Sergeant Malloy, a soldier from Fort Winslow escorting Wills to his hanging.\nRobyn Malcolm as Minnie McCowan, Colonel McCowan's wife.\nXavier Horsechief as Little Bear, the young son of Black Hawk and Elk Woman."}