{"_movieID": "32845", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:32", "summary": "Wrong Side of Town is a 2010 American action film written, produced and directed by David DeFalco, scored by Jim Kaufman, and starring Rob Van Dam and Dave Bautista. The film was released on direct-to-DVD in the United States on February 23, 2010.\n\n", "plot": "Bobby Kalinowski (Rob Van Dam), is a former Navy Seal enjoys a peaceful life as a landscape architect in Louisiana with his family. After receiving an invitation from new neighbors Clay Freeman (Edrick Browne) and Elise Freeman (Ava Santana), they go out for a night on the town to a famous club. The evening soon takes a turn for the worse when Bobby gets into a conflict with one of the club owners, named Ethan Bordas (Ross Britz). In the middle of the conflict, Ethan accidentally falls and is stabbed by his own knife, while fighting with Bobby, who was defending his wife.\nSeeking revenge, Ethan's father Seth Bordas (Jerry Katz), previously thought to be his older brother, puts a $100,000 bounty on Bobby's head. Also making matters difficult, Bobby is unable to receive help from the law, for Seth has Clay Freeman, and a corrupt police sergeant, working for him. Now Bobby must survive and escape Louisiana while being hunted by criminals, corrupt law, and many others in the city. To protect his family and neighbors, Bobby decides to separate himself from them and goes to his Navy Seal colleague Big Ronnie (David Bautista) (or known as B.R.) for help. B.R. initially refuses, deciding to take the bounty, but later changes his mind and helps Bobby. Seth targets Bobby’s family and kidnaps his 16-year-old daughter Brianna (Brooke Frost). However, Bobby ends up fighting and killing Seth and his henchmen with B.R.'s help, and rescues his daughter.", "cast": "Rob Van Dam as Bobby Kalinowski\nDave Bautista as Big Ronnie (B.R.)\nLara Grice as Dawn Kalinowski\nEdrick Browne as Clay Freeman\nAva Santana  as Elise Freeman\nStormy Daniels as Stormy\nRandal Reeder as Trouble\nJerry Katz as Seth Bordas\nLouis Herthum as Briggs\nBrooke Frost as Brianna Kalinowski\nJa Rule a.k.a. Jeffrey Atkins as Razor\nNelson Frazier, Jr. as Animal\nDamon Lipari as Nicky\nScott Schwartz as Deacon\nDavid DeFalco as Demon\nMarrese Crump as Markus\nOmarion a.k.a. Omari Grandberry as Stash\nQuess a.k.a. Brian Wakefield as Dawg\nRoss Britz as Ethan Bordas\n\"Big Dog\" Ramar Jenkins as Big Dog\nCarsten H.W. Lorenz as Cab Driver\nAnthony M. Frederick as Detective Hernandez\nGabriela Ostos as Abusive Woman\nJ. Omar Castro as Cop"}