{"_movieID": "8373", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:09:52", "summary": "Transformers: Revenge of the Fallen is a 2009 American science fiction action film directed by Michael Bay and based on the Transformers toy line. It is the sequel to 2007's Transformers, as well as the second installment in the live-action Transformers film series. Taking place two years after the first film, the story revolves around Sam Witwicky, who is caught in the war between the Autobots, led by Optimus Prime and the Decepticons, led by Megatron. Sam begins having strange visions of Cybertronian symbols, and is being hunted by the Decepticons under the orders of an ancient Decepticon named The Fallen, who seeks to get revenge on Earth by finding and activating a machine that would provide the Decepticons with an energon source, destroying the Sun and all life on Earth in the process. Returning Transformers include Optimus Prime, Bumblebee, Ironhide, Ratchet, Megatron, Starscream, and Scorponok.\nWith deadlines jeopardized by possible strikes by the Directors Guild of America and the Screen Actors Guild, Bay managed to finish the production on time with the help of previsualization and a scriptment by his writers Roberto Orci, Alex Kurtzman, and series newcomer Ehren Kruger. Shooting took place from May to September 2008, with locations in Egypt, Jordan, Pennsylvania, New Jersey, and California, as well as air bases in New Mexico and Arizona. It is the last film in the series to star Megan Fox, and is also the last film in the series to be co-produced by DreamWorks Pictures, leaving Paramount Pictures as the sole distributor of its future sequels, starting with Dark of the Moon.\nRevenge of the Fallen premiered on June 8, 2009 in Tokyo and was released on June 24, 2009 in the United States. Critical reception was overwhelmingly negative, with critics considering it to be inferior to the first film. Critics panned the film's script, rude humor, characters, performances, and runtime, while praising the visual effects, action scenes, score, and the performances of Peter Cullen and Hugo Weaving. The film won three Golden Raspberry Awards at the 30th Golden Raspberry Awards ceremony and became the highest-grossing film to win the Worst Picture award. The film surpassed its predecessor at the box office, grossing a total of $402.1 million in the US and Canada and $434.2 million in other territories, for a total of $836.3 million worldwide, making it the 33rd highest-grossing domestic film and fourth-highest of the year worldwide. With over 11 million home media sales in 2009, it was also the top-selling film of the year in the United States. It was followed by Dark of the Moon in 2011, Age of Extinction in 2014, and The Last Knight in 2017 and a prequel, Bumblebee in 2018.", "plot": "In 17,000 B.C., the Seven Primes travel across the universe to create Energon with star-absorbing machines called Sun Harvesters, which destroy stars in order to collect their raw material. One of them defies the rule to never to destroy a planet with life by establishing a Sun Harvester on Earth, earning him the name \"The Fallen\". The Fallen is confronted by the other Primes, who imprison him before he can harvest the Sun using the Matrix of Leadership. The rest of the Primes then sacrifice themselves to hide the Matrix in an unknown location.\nIn the present, two years after the Battle of Mission City, the Autobots and the U.S. military have formed the Non-biological Extraterrestrial Species Treaty (NEST), a classified international task force in order to eliminate the surviving Decepticons. In Shanghai, the Autobots intercept two Decepticons, Demolisher and Sideways. Sideways is killed by the Autobot Sideswipe, while Optimus Prime kills Demolisher, but not before he warns them of the Fallen's return. At NEST's secure headquarters in Diego Garcia, National Security Adviser Theodore Galloway concludes that since Megatron's corpse is at the bottom of the Laurentian Abyss and the last-known AllSpark shard is secured in the base, the Decepticons must still be on Earth solely to hunt the Autobots. The Decepticon Soundwave hacks into a military satellite, overhears this information, and sends Ravage to retrieve the shard.\nMeanwhile, Sam Witwicky is preparing to attend college, leaving his girlfriend Mikaela Banes and guardian Bumblebee behind. He finds a smaller AllSpark shard and picks it up, causing him to see Cybertronian symbols. As a side effect, the shard's energy brings various kitchen appliances to life, who then attack Sam and his family. After Bumblebee kills the living appliances, Sam gives the shard to Mikaela, who later captures the Decepticon Wheelie when he attempts to steal it. At the Laurentian Abyss, the Constructicons, using the stolen shard and parts ripped off from one of their own allies, resurrect Megatron. Megatron then travels to one of Saturn's moons, where he reunites with his second in command, Starscream, and his master, the Fallen, who orders him to capture Sam alive and kill Optimus, as he is the only Transformer who can defeat the Fallen.\nIn college, Sam is stalked by Alice, a Decepticon Pretender disguised as a college student, along with Mikaela and Leo, his roommate. Mikeala then kills Alice, and the trio are then captured by the Decepticon Grindor and taken to an abandoned factory. There, Megatron reveals that the symbols in Sam's mind will lead the Decepticons to a new Energon source before Optimus and Bumblebee arrive to rescue them. Optimus engages Megatron, Starscream, and Grindor, killing the latter in the process, before being killed by Megatron. The other Autobots arrive and repel the Decepticons, forcing Megatron and Starscream to retreat. The Decepticons then launch devastating, simultaneous attacks around the world, while The Fallen hijacks Earth's telecommunications systems, demanding that Sam be handed over to him.\nSam, Mikaela, and Leo enlist the help of former Sector Seven agent, Seymour Simmons, who reveals the Transformers visited Earth eons ago and the most ancient, known as Seekers, remained hidden on Earth. With help from Wheelie, they track down a Decepticon Seeker named Jetfire at the Smithsonian Air and Space Museum. They use their shard to revive Jetfire, who teleports the group to Egypt and explains the story of the Fallen. Following Jetfire's example, Wheelie sides with the Autobots, and Jetfire sends them to locate the Matrix, which could be used to revive Optimus. The group find the Matrix in Petra, but it disintegrates into dust. Nevertheless, Sam stuffs its remains into one of his socks. \nMeanwhile, NEST forces and the Autobots land near the Giza pyramid complex and are attacked by a large force of Decepticons. During the battle, the Constructicons combine to form Devastator, who destroys one of the pyramids to reveal the Sun Harvester hidden inside, before he is killed by a U.S. Navy railgun aboard the USS Kidd. Ravage and the Decepticon Rampage attempt to spring a trap, using Sam's captured parents as bait, in order to force Sam to give them the Matrix, but Bumblebee interferes and kills them both. Major William Lennox and Sergeant Robert Epps call in an airstrike that kills the majority of the Decepticon ground forces. However, Megatron manages to shoot Sam, mortally wounding him. He then retreats after coming under attack by fighter jets. As Sam nears death, the Primes speak to him through a vision, saying that the Matrix must be earned not found, and that he has now earned the right to bear it. They restore Sam's life and the Matrix, which he uses to revive Optimus.\nThe Fallen teleports to their location and steals the Matrix from Optimus. He returns to the pyramid with Megatron and activates the Sun Harvester. Jetfire, who was gravely wounded by Scorponok during the battle, but survived after killing his attacker, sacrifices himself to allow his parts to be transplanted to Optimus. The parts give Optimus immense strength and the ability to fly, allowing him to destroy the Harvester, incapacitate Megatron and kill the Fallen. Megatron retreats with Starscream, vowing vengeance. The victorious Autobots and their allies then go back to the United States, and Sam returns to college.", "cast": "Shia LaBeouf as Sam WitwickyA recent high school graduate who is unwittingly drawn again into the Autobot cause to unravel an ancient mystery implanted into his mind by the now-destroyed Allspark.\nMegan Fox as Mikaela BanesSam's girlfriend whom he trusts as the Allspark fragments begin to unravel.\nJosh Duhamel as William LennoxA U.S. Army Major who establishes NEST to help the Autobots in their battle against the remaining Decepticons.\nTyrese Gibson as Robert EppsA U.S. Air Force sergeant in Lennox's team who leads NEST's SWAT unit.\nJohn Turturro as Seymour SimmonsA former agent of the recently terminated Sector 7 who now runs a meat shop in New York City with his mother, Tova Simmons.\nRamon Rodriguez as Leo SpitzA college roommate of Sam's who runs an online conspiracy blog and is obsessed with the Transformers.\nKevin Dunn as Ron WitwickySam's father.\nJulie White as Judith WitwickySam's mother.\nIsabel Lucas as AliceA female pretender sent to spy on Sam in college.\nJohn Benjamin Hickey as Theodore GallowayA national security adviser who often chastises NEST and the Autobots for their destructive tactics.\nGlenn Morshower as General MorshowerThe supervisor of NEST.\nMatthew Marsden as GrahamA British Army NEST officer.\nRainn Wilson as Professor R.A. ColanSam and Leo's astronomy teacher.\nMarc Evan Jackson as CommanderU.S. Central Command\nKatie Lowes as April"}