{"_movieID": "543343", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:00:35", "summary": "Guava Island is a 2019 American musical film directed by Hiro Murai (his feature directorial debut) with a screenplay by Stephen Glover from a story by Donald Glover, Stephen Glover, Ibra Ake, Jamal Olori and Fam Udeorji. It stars Donald Glover and Rihanna in the lead roles of Deni and Kofi, respectively, and was first exhibited at the Coachella Festival on April 11, 2019. It was then released on April 13, 2019, by Amazon Studios through Amazon Prime Video for anyone to watch without a subscription for 18 hours before being available to Prime subscribers only. In the final hour of the 18 hours, the film was streamed on the Coachella YouTube page and Twitch. Donald Glover was co-headlining at the event as Childish Gambino.", "plot": "An animated folk tale narrated by Kofi Novia introduces the origins of Guava Island and the music played by Deni Maroon, a local celebrity who lives with Kofi. She wakes up to Deni playing a tune on his guitar. He rushes out of their house and is greeted by many passersby on the street on his way to work; Deni is holding a music festival that the whole town is looking forward to. He is mugged by a group of kids he knows and he convinces them not to rob him by promising them seats up front at the festival.\nKofi works in a factory as a seamstress with Yara while Deni works for Red Cargo, a despotic business magnate who employs most of the people on the island. While at work, an employee details what he would do if he were able to emigrate to America, which Deni dismisses as ignorant (\"This Is America\"). Deni is kidnapped and taken to Red Cargo's office. Red bribes Deni into canceling his festival so that it will not interrupt productivity the next day. When Deni questions his power, Red destroys his guitar.\nHe returns to Kofi, who asks him about his injury and his guitar's absence. Deni brushes off her inquiry, instead serenading her with the song he had promised to write since they were children (\"Summertime Magic\"). Deni suddenly has to go. Later at work, Kofi tells Yara that she is reluctant to tell Deni that she is pregnant because of his free-spirited lifestyle.\nInspired by two children, Zoila and Mapi (\"Time\"), Deni performs on the radio again and announces that he will be at the festival (\"Feels Like Summer\"). Kofi is ambushed by Red while both look for Deni; Red asks Kofi to tell him to break a leg. Deni starts the festival late and performs a song dedicated to Zoila and Mapi (\"Saturday\"). Kofi spots a masked gunman just before he opens fire on the stage. Deni escapes into an alleyway, but the gunman finds and assassinates him.\nRed is pleased, but then he discovers that all of his employees have left work to attend a joyous blue-themed memorial for Deni (\"Die with You\"); Kofi tells Red that they all finally \"got their day\". In an epilogue, Kofi starts telling her child a story about how dreams come true.", "cast": "Donald Glover as Deni Maroon, a Cuban musician who \"is determined to throw a festival for his island community\"\nRihanna as Kofi Novia, Deni's girlfriend and musical inspiration\nLetitia Wright as Yara Love\nNonso Anozie as Red Cargo, \"a shady island tycoon\" whose business interests conflict with Deni's festival\nBetiza Bistmark Calderón as Emani Dune\nYansel Alberto Monagas Pérez as Coley\nAyensi Amilgar Jardines Delgado as Dodo\nKarla Talía Pino Piloto as Zoila\nAlain Jonathan Amat Rodriguez as Mapi"}