{"_movieID": "214756", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:14", "summary": "Ted 2 is a 2015 American comedy film directed by Seth MacFarlane and written by MacFarlane, Alec Sulkin and Wellesley Wild, and is a sequel to the 2012 film Ted. The film stars Mark Wahlberg and MacFarlane, and follows the talking teddy bear Ted as he fights for civil rights in order to be recognized as a person. The film also stars Amanda Seyfried (who replaces Mila Kunis as Wahlberg's love interest), with Giovanni Ribisi and Jessica Barth reprising their roles and John Slattery and Morgan Freeman joining the cast.\nPrincipal photography began in Massachusetts in July 2014. Ted 2 was released on June 26, 2015, by Universal Pictures. The film grossed over $216 million and received mixed reviews from critics.", "plot": "John Bennett has been divorced from Lori Collins for six months. Meanwhile, his best friend Ted marries his girlfriend, Tami-Lynn. One year later, following a heated argument, they decide to have a child. As Ted cannot have children, John agrees to help Ted find a sperm donor. They ask Sam J. Jones but he declines due to a low sperm count. Then they unsuccessfully try to break into Tom Brady's house and steal his sperm. Ultimately, John offers to donate his sperm.\nDespite Ted and John's efforts, Tami-Lynn's historical drug use has rendered her infertile (despite having been clean for an extended period of time) and the couple decide to adopt. As background checks are carried out, Ted's legal status as a person is brought into question. The state authorities of Massachusetts declare Ted property rather than a person, resulting in the loss of his job at a grocery store—shortly after reassuring a customer that buying a box of Trix, as an adult, will not bring him to any harm. Furthermore, Ted's credit card and bank accounts are frozen and his marriage to Tami-Lynn is annulled.\nJohn suggests that they take the state to court, and their case is assigned to a novice lawyer pro-bono, Samantha Leslie Jackson. They are initially reluctant, especially due to her lack of knowledge on modern culture, but they take a liking to Samantha after finding out she also uses illegal drugs and disagrees with the War on Drugs. The three bond over their love of marijuana as they prepare to present the case.\nMeanwhile, Donny, Ted's life-long stalker and would-be abductor, is now employed as a janitor at the headquarters of toy company Hasbro, in New York City. He convinces the company CEO to hire an expert attorney to ensure that Ted maintains his status as property, therefore leaving him open to seizure by the firm to create more living teddy bears.\nDespite Samantha's best efforts, the court rules against Ted. Disheartened but desperate, the trio contact Patrick Meighan, a highly respected civil rights attorney, hoping he'll take the case and overturn the court's decision. Driving to Manhattan to meet him, Ted crashes into a hidden marijuana patch, where Samantha and John realize their attraction for each other. The next day, the trio meet Meighan, who is sympathetic to Ted's plight but ultimately refuses the case, as he believes he has not significantly contributed to humanity due to his juvenile slacker lifestyle.\nTed, angry at the injustice and jealous of Samantha and John's new relationship, wanders off. Donny follows him as he wanders into the New York Comic-Con. Once inside, Donny, disguised in a Teenage Mutant Ninja Turtle costume, attempts to kidnap Ted, who flees and contacts John for help. John and Samantha arrive at Comic-Con and search for Ted, arriving as Donny is about to cut him open. As they make their escape, Donny severs the cables holding up a model of the USS Enterprise with a knife and it swings towards Ted. John pushes Ted out of the way, takes the hit, and is knocked unconscious. Ted identifies Donny from a group of Ninja Turtle cosplayers through his need to dance and he is arrested.\nAt the hospital, Samantha, Ted and Tami-Lynn rejoice when John recovers, although he pretends to be dead as payback for Ted previously pretending to be brain dead. Patrick Meighan decides to take the case, telling them he has been inspired by John's selflessness and Ted's emotions over his nearly fallen friend. Meighan gets the ruling overturned by demonstrating that Ted is self-aware, that he feels complex emotions, and is capable of empathy. Outside the court, Ted re-proposes to Tami-Lynn. After they are re-married, Ted and Tami-Lynn, adopting the surname of \"Clubberlang\", adopt a baby boy, whom they name Apollo Creed, while John and Samantha happily pursue their own relationship.\nIn a post-credits scene, the customer who previously purchased a box of Trix wanders back into the grocery store, visibly injured.  He leaves the Trix behind and exits with a look of betrayal.", "cast": "Mark Wahlberg as John Bennett\nSeth MacFarlane as Ted Clubber-Lang (voice and motion capture)\nAmanda Seyfried as Samantha Jackson\nJessica Barth as Tami-Lynn McCafferty\nGiovanni Ribisi as Donny\nMorgan Freeman as Patrick Meighan\nJohn Slattery as Shep Wild\nPatrick Warburton as Guy\nMichael Dorn as Rick\nBill Smitrovich as Frank\nCocoa Brown as Joy\nJohn Carroll Lynch as Tom Jessup\nRon Canada as Judge Matheson\nJessica Szohr as Allison\nJay Patterson as Karl Jackson\nTara Strong as Ted's \"I Love You\" function\nSam J. Jones as himself\nSebastian Arcelus as Dr. Ed Danzer\nTom Brady as himself\nDennis Haysbert as Fertility doctor\nTaran Killam as himself\nJimmy Fallon as himself\nJimmy Kimmel as himself\nJay Leno as himself\nBill Maher as himself\nKate McKinnon as herself\nBobby Moynihan as himself\nDavid Hasselhoff as himself\nLiam Neeson as Customer\nLenny Clarke as Cop\nPatrick Stewart as Himself (Narrator)\nCurtis Stigers as Wedding singer\nNana Visitor as Adoption agent\nRalph Garman as Stormtrooper\nJack Knight as Todd Kidder"}