{"_movieID": "472451", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:58:11", "summary": "Boy Erased is a 2018 American biographical drama film based on Garrard Conley's 2016 memoir of the same name. It is written for the screen and directed by Joel Edgerton, who also produced with Kerry Kohansky Roberts and Steve Golin. The film stars Lucas Hedges, Nicole Kidman, Russell Crowe, and Edgerton, and follows the son of Baptist parents who is forced to take part in a gay conversion therapy program.\nBoy Erased premiered at the Telluride Film Festival on September 1, 2018, and also screened at the Toronto International Film Festival. The film was theatrically released in the United States on November 2, 2018, by Focus Features and grossed over $11 million worldwide. It received generally positive reviews from critics, who mostly praised the performances of the cast, and received various award nominations, including two Golden Globe Award nominations: Best Actor for Hedges and Best Original Song for \"Revelation\". The film won the GLAAD Media Award for Outstanding Film – Limited Release at the 30th GLAAD Media Awards.\n\n", "plot": "Jared Eamons is the son of Marshall Eamons, a successful car dealer and Baptist preacher in Arkansas, and Nancy Eamons, a self-styled hairdresser. He begins his first day at the Love In Action gay conversion therapy assessment program in Memphis, Tennessee. Chief therapist Victor Sykes tells the group that their sexuality is a choice influenced by poor parenting. He instructs them to perform harsh \"moral inventories\" of themselves and their families and requires them not to tell anyone else about what occurs during the sessions. \nWhile performing his moral inventory, Jared thinks of his life prior to entering the program. In high-school, he was well-adjusted and happy, though he breaks up with his girlfriend upon starting college. Once there, he becomes friends with another student, Henry. While staying the night in Jared's dorm room, Henry rapes Jared and tearfully confesses that he has done the same to another young man. Traumatized, Jared returns home to recover. Henry calls the Eamons' home and poses as a school counselor in order to out Jared and ensure his silence. Jared confesses to being attracted to men. After consulting with other pastors, Marshall signs him up for conversion therapy, to which Jared reluctantly agrees.\nNancy rents a nearby motel for her and Jared to stay in until he completes the assessment; however, Jared soon discovers that the therapy has no set end point, and may require him to move into an on-campus home if he fails to convince Sykes that he has become straight.\nWeeks into his therapy, Jared gets to know the other attendees also seeking to become straight. Some, like Jon, are fanatically devoted to conversion to the point where they refuse to even touch other men. Others, like Gary, are merely pretending that the therapy is working until they can be released and return to a normal life. At her insistence, Jared lets Nancy read the program's handbook, which is full of questionable psychology and obvious grammatical errors. \nAfter failing an exercise, attendee Cameron is humiliated by Sykes in front of the group and intimidated with a fake funeral service. Cameron is beaten with bibles by both the therapists and his own family and forcibly dunked in a bathtub in one of the program's prison-like homes. Jared thinks of a brief, romantic, intimate encounter he had with an art student, Xavier, in college.\nJared challenges Sykes when the therapist suggests during an exercise that Jared hates his father. He storms out of the room, successfully retrieves his mobile phone, and calls Nancy to pick him up. Though Sykes, his counselors, and the other attendees corner Jared, Cameron stands up for him and escorts Jared safely to Nancy, who takes him home, horrified and ashamed that she allowed Marshall to enroll him in an unvetted program without researching its practices. Marshall remains adamant about Jared remaining in the program, but Nancy overrules his wishes. Soon after Jared learns that Cameron has committed suicide while still in the program's care. Marshall approaches Jared to console him, but Jared turns away.\nFour years later, Jared has moved to New York City with his boyfriend. He writes an article that exposes the realities of conversion therapy. Jared returns home to convince his father to read the article and take accountability for his actions. The two begin to reconcile when he asks his father to visit him for Christmas."}