{"_movieID": "237756", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:52", "summary": "Kill Me Three Times is a 2014 Australian-American black comedy thriller film directed by Kriv Stenders. It was selected to be screened in the Contemporary World Cinema section at the 2014 Toronto International Film Festival. The film was released in the United States on 10 April 2015, by Magnet Releasing.", "plot": "In Eagles Nest, Western Australia, a wealthy motel proprietor Jack Taylor believes his wife Alice to be having an affair. After a violent argument, Jack hires Charlie Wolfe, a private investigator and contract killer. When Charlie returns with video proof Alice is having sex with Dylan Smith, Jack orders Charlie to kill her.  Alice makes an appointment with dentist Nathan Webb to work on her tooth, which Jack chipped when he hit her. Jack tells Charlie about Alice's dentist appointment. Before she leaves, Alice sneaks into Jack's office and robs his safe.\nCharlie is amused to see Nathan and his receptionist wife Lucy drug Alice, kidnap her, and eventually, after several mishaps, send her over a cliff in a flaming car. Charlie takes incriminating pictures of the acts. Lucy finds Jack's stolen money in Alice's bag and takes it before trying to kill her. Unknown to all involved, Alice wakes up in time to escape the car before it crashes and explodes. Satisfied that Alice is dead, Charlie returns to Jack for payment, not telling him that the hit was carried out by other people. When Jack finds his safe empty, he immediately suspects Alice and Dylan. He reassures Charlie he has more money in the bank, and Charlie says he will return the next day.\nMeanwhile, Nathan and Lucy initiate their insurance fraud scheme by exchanging Lucy's dental records with Alice's, hoping to fool people into believing that Lucy died in the fiery car crash. Bruce Jones, a corrupt cop, immediately recognizes the fraud, and while impressed that Nathan is able to murder to his own wife, demands half the payout to stay quiet. At the same time, Charlie anonymously blackmails Nathan with pictures of Alice's kidnapping and assumed death. Lucy pushes Nathan to pay the blackmailer and be done with it, and he reluctantly sets up a meeting.\nDylan confronts and kills Jack. Charlie leaves to meet Nathan. Because he is the only one who can collect the insurance money, Nathan believes himself safe from harm. When Nathan is uncooperative, Charlie surprises Nathan by shooting him. As he dies, Nathan reveals the location of the money Alice stole from Jack, which he recovered during Alice's kidnapping. Charlie returns to collect his money from Jack, only to find Jack dead. At the same time, Bruce stumbles upon Charlie at the crime scene. Charlie kills Bruce. Charlie sneaks into Lucy's house, but, instead of killing her, reveals they are working together.\nLucy is upset that Charlie has killed Nathan, as she can no longer collect the insurance money on her own faked death. Charlie says he will not split the remaining money with her and leaves, though he tells her that she will now inherit Jack's hotel business, as he was her brother. When Dylan arrives, both Lucy and Charlie claim the other murdered Alice. Dylan shoots at Charlie, but Charlie deflects his aim so that the bullet strikes and kills Lucy.  As Charlie prepares to kill Dylan, Alice sneaks up behind him and knocks him off the deck. Alice and Dylan leave with the money as Charlie weakly answers his phone to assure a client that he will make an appointment.", "cast": "Simon Pegg as Charlie Wolfe\nAlice Braga as Alice Taylor\nSullivan Stapleton as Nathan Webb, a dental surgeon with a gambling debt\nTeresa Palmer as Lucy Webb, Nathan's wife and receptionist\nLuke Hemsworth as Dylan Smith\nCallan Mulvey as Jack Taylor\nBryan Brown as Bruce Jones, a corrupt cop"}