{"_movieID": "446894", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:24", "summary": "Smallfoot is a 2018 American  computer-animated musical comedy film produced by the Warner Animation Group and distributed by Warner Bros. Pictures. Based on the unpublished children's book Yeti Tracks by Sergio Pablos, the film was co-written and directed by Karey Kirkpatrick, and stars the voices of Channing Tatum, James Corden, Zendaya, Common, LeBron James, Gina Rodriguez, Danny DeVito, Yara Shahidi, Ely Henry, and Jimmy Tatro. The plot follows a group of Yeti who come across a human, with each species thinking the other was just a myth.\nSmallfoot was theatrically released in the United States on September 28, 2018. It received a moderately positive reception from critics and grossed over $214 million worldwide.", "plot": "A village of Yetis lives in isolation on the top of a mountain in the Himalayas, above the clouds and hidden away from sight. Migo is a yeti who abides by the law of the ancient stones held by the Stonekeeper, the yetis' leader. Migo's father, Dorgle, projects himself through the air each morning to hit a gong with his head, as the yetis believe this allows the sun to rise. While learning how to ring the gong, Migo is distracted by the Stonekeeper's daughter, Meechee, whom he has a crush on, and misses the gong, landing outside the village. There, Migo witnesses a plane crash and finds a \"smallfoot\" (human), whom the yetis believe is mythical. Migo runs back to inform the villagers, but because he lacks proof, Stonekeeper claims he is lying and banishes him from the village.\nMigo is suddenly visited by rejected yetis Gwangi, Kolka, and Fleem who bring him to the Smallfoot Evidentiary Society, which is led by Meechee. She convinces Migo travel below the clouds despite the stones telling them that there is nothing underneath. After some hesitation, Migo agrees to go, but his rope snaps and Migo falls, where he discovers land.\nAt a lodge called the Yak Shack, Percy Patterson is a British human filmmaker of wildlife documentaries who has lost most of his viewership. He meets the pilot who saw Migo, and in an attempt to regain his fame, tries unsuccessfully to convince his assistant, Brenda, to dress up as a yeti for filming. Migo arrives and unknowingly scares Percy when trying to communicate with him. Migo takes Percy with him and they stop in a cave to wait out a blizzard. Percy films and uploads a video of Migo narrating that the Yeti plans to eat him, before attempting to escape. While chasing Percy, Migo's toe becomes caught in a bear trap and Percy takes pity on him by removing the trap and bandaging Migo's wound. Percy agrees to go with Migo and they head back up the mountain, where they reunite with the S.E.S.\nThe villagers are confused by Percy's appearance, but happily accept him and learn about his culture, much to Stonekeeper's dismay. Afterwards, Stonekeeper takes Migo inside the palace and reveals the truth: yetis used to live below the clouds, but were forced away by the humans who attacked them. To keep them safe, they created the stones, and the clouds are actually steam made by the yetis' daily tasks to keep them hidden. In order to protect the village, Migo agrees to continue the lie by telling the yetis that Percy, who is experiencing high altitude sickness, is just a hairless wild yak. Stonekeeper takes Percy and locks him in a box, so Percy will be unable to alert other humans of the yetis' whereabouts. Migo later discovers that Meechee took Percy away to return him home, and jumps down the mountain with Gwangi and Kolka following suit.\nPercy recovers and discovers that his video of Migo has generated public excitement, but then notices that Meechee has become distracted by the wonders in Kathmandu and accidentally causes a disruption. Meechee is attacked by the police, but is rescued by Gwangi, Kolka and Migo. The yetis try to make it back to the mountain, but are chased by a SWAT helicopter that Stonekeeper takes down using his stones. Migo attempts to divert the police away from the other yetis, when Percy arrives on his snowmobile and shoots Migo with a tranquilizer gun to save him. The police chase and capture Percy in his yeti suit, and arrest him for public disturbance and fraud.\nBack at the village, inside the palace, Migo and Stonekeeper explain the truth to the yetis while Migo apologizes for lying to them. Migo tells the others that even though humans may still be scared of the yetis, they should try to communicate with them. The yetis leave the village, and when Percy and Brenda notice them, they emerge from the crowd and stand up for the yetis. The rest of the humans slowly welcome the yetis and accept them into their lives."}