{"_movieID": "318846", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:21", "summary": "The Big Short is a 2015 American biographical comedy-drama film directed by Adam McKay. Written by McKay and Charles Randolph, it is based on the 2010 book The Big Short: Inside the Doomsday Machine by Michael Lewis showing how the financial crisis of 2007–2008 was triggered by the United States housing bubble. The film stars Christian Bale, Steve Carell, Ryan Gosling, Brad Pitt, Melissa Leo, Hamish Linklater, John Magaro, Rafe Spall, Jeremy Strong, Finn Wittrock, and Marisa Tomei.\nThe film is noted for the unconventional techniques it employs to explain financial instruments. Among others, it features cameo appearances by actress Margot Robbie, chef Anthony Bourdain, singer-songwriter Selena Gomez, and economist Richard Thaler, who break the fourth wall to explain concepts such as subprime mortgages and collateralized debt obligations as a meta-reference. Several of the film's characters directly address the audience, most frequently Gosling's, who serves as the narrator.\nThe film began a limited release in the United States on December 11, 2015, followed by a wide release on December 23 by Paramount Pictures. The film was a commercial success, grossing $133 million against a $50 million budget. The film was also highly praised by critics, with many highlighting the cast's performances (particularly Christian Bale, Steve Carell and Ryan Gosling), McKay's direction and the screenplay. The film won the Academy Award for Best Adapted Screenplay in addition to nominations for Best Picture, Best Director, Best Supporting Actor (Bale), and Best Film Editing.", "plot": "The film consists of three separate but concurrent stories, loosely connected by their actions in the years leading up to the 2007 housing market crash.\nMichael Burry\nIn 2005, eccentric hedge fund manager Michael Burry discovers that the United States housing market, based on high-risk subprime loans, is extremely unstable. Anticipating the market's collapse in the second quarter of 2007, as interest rates would rise from adjustable-rate mortgages, he proposes to create a credit default swap market, allowing him to bet against market-based mortgage-backed securities, for profit.\nHis long-term bet, exceeding $1 billion, is accepted by major investment and commercial banks, but as it requires paying substantial monthly premiums, it sparks his clients' vocal unhappiness, believing he is \"wasting\" capital. Many demand that he reverse and sell, but Burry refuses. Under pressure, he eventually restricts withdrawals, angering investors. Eventually, the market collapses and his fund's value increases by 489% with an overall profit of over $2.69 billion.\nFrontPoint Partners and Jared Vennett\nDeutsche Bank salesman Jared Vennett, (based on Greg Lippmann) the executive in charge of global asset-back security trading at Deutsche Bank, is one of the first to understand Burry's analysis, learning from one of the bankers who sold Burry an early credit default swap. Using his quant to verify that Burry is likely correct, he decides to enter the market, earning a fee on selling the swaps to firms who will profit when the underlying bonds fail. A misplaced phone call alerts FrontPoint hedge fund manager Mark Baum (based on Steve Eisman), who is motivated to buy swaps from Vennett due to his low regard for banks' ethics and business models. Vennett explains that the packaging of subprime loans into collateralized debt obligations (CDOs) rated at AAA ratings will guarantee their eventual collapse.\nConducting a field investigation in South Florida, the FrontPoint team discovers that mortgage brokers are profiting by selling their mortgage deals to Wall Street banks, who pay higher margins for the riskier mortgages, creating the bubble, prompting them to buy swaps from Vennett. In early 2007, as these loans begin to default, CDO prices somehow rise and ratings agencies refuse to downgrade the bond ratings. Baum discovers conflicts of interest and dishonesty amongst the credit rating agencies from an acquaintance at Standard & Poor's. Baum's employees question Vennett's motives, yet he maintains his position and invites Baum and company to the American Securitization Forum in Las Vegas. Interviewed by Baum, CDO manager Wing Chau, on behalf of an investment bank, describes how synthetic CDOs create chains of increasingly large bets on faulty loans – up to 20 times as much money as the loans themselves. A horrified Baum realizes that the fraud will completely collapse the global economy. He purchases as much as possible, profiting at the banks' expense and waits until the last minute to sell. Baum's fund makes a profit of $1 billion, and he laments that the banks won't accept blame for the crisis and that people will scapegoat immigrants and the poor.Brownfield Capital\nYoung investors Charlie Geller and Jamie Shipley accidentally discover a prospectus by Vennett, convincing them to invest in swaps, as it fits their strategy of buying cheap insurance with big potential payouts. Below the capital threshold for an ISDA Master Agreement required to enter into trades like Burry's and Baum's, they enlist the aid of retired securities trader Ben Rickert. When the bond values and CDOs rise despite defaults, Geller suspects the banks of committing fraud. The trio also visit the Forum, learning that the U.S. Securities and Exchange Commission has no regulations to monitor mortgage-backed security activity. They successfully make even more profit than other hedge funds by shorting the higher-rated AA mortgage securities, as they were considered highly stable and carried a much higher payout ratio.\nGeller and Shipley are initially ecstatic, but Rickert is disgusted, citing the impending collapse and its effects; when unemployment goes up 1%, 40,000 people will die. Furthermore, they realize the banks and the ratings agency are maintaining the value of their CDOs in order to sell and short them before the inevitable crash. Horrified, they try to tip off the press and their families about the upcoming disaster and the rampant fraud but nobody believes them. As the market starts collapsing, Ben, on vacation in England, sells their swaps. Ultimately, they make a profit of $80 million, with their faith in the system broken.\nEpilogue\nJared Vennett makes $47 million in commissions selling off the swaps. Mark Baum becomes more gracious from the financial fallout, and his staff continues to operate their fund. Charlie Geller and Jamie Shipley go their separate ways after unsuccessfully trying to sue the ratings agencies, with Charlie moving to Charlotte to start a family, and Jamie still running the fund. Ben Rickert returns to his peaceful retirement. Michael Burry closes his fund after public backlash and multiple IRS audits, now only investing in water securities. The banks responsible for the crisis escape any consequences for their actions. It is noted that as of 2015, banks are selling CDOs again under a new label: \"Bespoke Tranche Opportunity\"."}