{"_movieID": "100042", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:00:24", "summary": "Dumb and Dumber To is a 2014 American comedy film co-written and directed by Bobby and Peter Farrelly. It is the third and final film in the Dumb and Dumber film series and a sequel to the 1994 film Dumb and Dumber. It stars Jim Carrey and Jeff Daniels reprising their roles 20 years after the events of the first film, and also features Rob Riggle, Laurie Holden, Rachel Melvin, and Kathleen Turner. The film tells the story of Lloyd Christmas and Harry Dunne (played by Carrey and Daniels, respectively), two dimwitted but good-natured adults who set out on a cross-country road trip to locate Harry's daughter who has been adopted.\nFirst announced in October 2011, Dumb and Dumber To underwent a turbulent pre-production phase which included, at one point, Carrey withdrawing from the project, and Warner Bros. refusing to distribute the film. The project was eventually taken on in 2013 by Red Granite Pictures and the film was shot later that year. Released on November 14, 2014, by Universal Pictures, Dumb and Dumber To grossed $36.1 million on its opening weekend and over $169 million worldwide.On June 15, 2017, the United States Department of Justice charged that money used to produce the film was stolen from a Malaysian government investment fund. Red Granite Pictures denied knowingly accepting stolen money. Prosecutors also filed a Forfeiture Complaint in federal court to seize the rights of ownership to Dumb and Dumber To as well as the rights to the 2015 film Daddy's Home. Red Granite later reached a $60 million settlement.", "plot": "Twenty years after the events of the first film, Lloyd Christmas has all this time been committed at Baldy View Sanitarium, a mental institution, ever since his doomed romance with Mary Swanson. During a recent visit, Harry Dunne discovers that Lloyd pranked him into thinking he was traumatized the entire time. They head to their apartment, where Lloyd meets Butthole, a street cat who Harry adopted a few years before, as well as rock candy cook Ice Pick, who filled in as Harry's roommate to pay Lloyd's share of the rent during Lloyd's commission at the hospital, and Harry reveals he needs a kidney transplant.\nThey go to Harry's old home, but Harry cannot get a kidney from his parents because they are his foster parents, and his birth parents are dead. Before they leave, Harry's dad gives him his mail that has been piling up since he moved out. It includes a postcard from a former girlfriend, Fraida Felcher, dating back to 1991, which says she is pregnant and needs Harry to call. After Lloyd and Harry locate her, Fraida admits that she had a daughter named Fanny that she gave up for adoption. About two years ago, she wrote Fanny a letter, but it was returned with a request not to contact her again.\nHoping Fanny can provide a kidney, Lloyd and Harry drive a hearse that Fraida gave them to Oxford, Maryland, where she now lives. Dr. Bernard Pinchelow and his wife Adele are Fanny's adoptive parents. Fanny, who has taken the name Penny, is going to a KEN Convention in El Paso to give a speech on her father's life work; Bernard cannot go himself due to being sick at the time. Penny is given a package to be given to one of the convention heads, but being somewhat dim-witted herself, ends up forgetting both the package and her phone.\nAdele is secretly trying to poison Bernard and Penny to gain Bernard's fortune, with the help of her secret lover, Travis Lippincott, who also happens to be the family's housekeeper. Harry and Lloyd arrive to inform the Pinchelows of their situation. Bernard realizes Penny left the package, which he says is an invention worth billions, and Adele suggests that Harry and Lloyd deliver the package to Penny. So that he and Adele can get the contents of the box, Travis accompanies Harry and Lloyd. Annoyed with the duo's antics, Travis attempts to kill them but dies in a train collision before he can do so. Adele hears of the death from Travis's twin brother Captain Lippincott, a former military man, who agrees to help her kill Harry and Lloyd.\nWhile walking to El Paso, the duo comes across Harry's old Mutt Cutts van, which Lloyd traded for a minibike in the first film, and decide to steal it back to drive the rest of the way, only for it to break down and fall apart when they attempt to make it jump a hill as it did in the first film, due to it now being 30 years old. Upon arriving in El Paso on a stolen Zamboni ice resurfacer, the duo infiltrates the convention and Harry impersonates Bernard, so he and Lloyd are invited to a seminar. They get into an argument, however, when Harry discovers that Lloyd has developed a romantic attraction to Penny. After being escorted out of the convention due to not being on the attendance list, Lloyd gets a call from Penny. After informing Penny that he is in town with her dad, they arrange a meeting during which Lloyd mistakenly deduces that he, not Harry, is Penny's father.\nAdele arrives at the convention with Lippincott and exposes Harry as a fraud, telling the convention heads that he stole the package. Fraida also arrives and tampers with the fire alarm to create a diversion after she and Penny are denied entry. As the building is evacuated, Harry runs into Fraida and Penny, only to have Lippincott and Adele corner them with guns in a bathroom. At this moment, Lloyd returns, having been to Mexico to have one of his own kidneys removed for Harry. Adele and Lippincott take the package and open it, only to find that it only contains a few cupcakes, two of which Lloyd ate. Just then, three FBI agents bust in with a cured Bernard, who reveals that he has known since the beginning that Adele was trying to poison him, and that she was cheating on him with Travis. He also reveals that the cupcakes were a thank-you gift to the convention head for cancelling his original planned visit, and that he has figured out just from Harry and Lloyd showing him Fraida's letter that it was Adele, not Penny, who wrote \"do not contact again\" on the letter. In retaliation, Adele attempts to shoot Penny, but Harry jumps in front of the bullet and is injured. Adele (who is beaten up by Fraida) and Lippincott are then arrested.\nHarry is rushed to the hospital, where he reveals that he was pranking Lloyd about needing a kidney and both laugh. Fraida also reveals that Penny's biological father is neither Harry nor Lloyd, but a deceased high school friend of theirs named Peter \"Pee-Stain\" Stainer. As the duo leave El Paso, they spot two women walking in their direction and shove them into a bush as a joke. Harry and Lloyd run off and high-five each other.\nIn a post-credits scene, Harry and Lloyd throw their milkshakes (as they had each other's wanted flavours) onto the windscreen of a truck. The driver happens to be Sea Bass from the first film.", "cast": "Jim Carrey as Lloyd Christmas\nJeff Daniels as Harry Dunne\nDalton E. Gray as Young Harry\nRob Riggle as Travis and Captain Lippincott\nLaurie Holden as Adele Pinchelow\nDon Lake as Doctor Roy Baker\nKathleen Turner as Fraida Felcher\nSteve Tom as Dr. Bernard Pinchelow\nRachel Melvin as Penny Pinchelow/Fanny Felcher, Dr. Pinchelow's adopted daughter and Fraida's biological daughter\nTembi Locke as Dr. Walcott\nPaul Blackthorne as Emergency Room Doctor\nBrady Bluhm as Billy in 4C\nSwizz Beatz as Ninja Leader in Lloyd's Fantasy Sequence\nBill Murray as Ice Pick, the Meth cook\nDerek Holland as patient in the asylum\nMama June as fantasy wife of Harry\nCam Neely as Sea Bass\nSean Gildea as Sea Bass' friend"}