{"_movieID": "442062", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:08:18", "summary": "Goosebumps 2: Haunted Halloween (or simply Goosebumps 2 as marketed on home release) is a 2018 American horror comedy film directed by Ari Sandel and written by Rob Lieber from a story by Lieber and Darren Lemke. A stand-alone sequel to 2015's Goosebumps, it is based on the children's horror book series of the same name by R. L. Stine. With the exception of Jack Black, none of the cast from the previous film returns here. The new cast consists of Wendi McLendon-Covey, Madison Iseman, Jeremy Ray Taylor, Caleel Harris, Chris Parnell and Ken Jeong.\nThe plot follows two young boys accidentally releasing monsters, demons and creatures from the Goosebumps franchise in their town after opening an unpublished Goosebumps manuscript titled Haunted Halloween, causing a wave of destruction on Halloween night. Unlike the previous installment, Village Roadshow Pictures was not involved with the film.\nGoosebumps 2: Haunted Halloween was released in the United States on October 12, 2018 by Sony Pictures Releasing under its Columbia Pictures label. The film received mixed reviews from critics and grossed $93 million worldwide against its $35 million budget.", "plot": "Teenager Sarah Quinn (Madison Iseman) lives with her mother Kathy (Wendi McLendon-Covey) and younger brother Sonny (Jeremy Ray Taylor) in Wardenclyffe, New York. Sarah is attempting to get into Columbia University by writing an essay about fear. Kathy agrees to watch Sonny’s friend Sam Carter (Caleel Harris) while his father (Kendrick Cross) goes out of town.\nSonny and Sam are attempting to start a garbage cleanup business, and are called after school to clean up an abandoned house. Inside, they find a locked manuscript and open it, causing Slappy the Dummy to appear. They unknowingly bring Slappy (Mick Wingert) to life by speaking magic words found in his pocket. The manuscript is later stolen by a bully named Tommy Madigan (Payton Wich).\nAt home, Sonny is working on his science project, a miniature version of Nikola Tesla’s Wardenclyffe Tower. Slappy then reveals he's alive to Sonny and Sam, and gets their trust by using his magic to do the boy's chores and homework. Meanwhile, Sarah goes to a party to meet her boyfriend Tyler Mitchell (Bryce Cass), but sees him kissing a girl named Jess (Courtney Lauren Cummings). Slappy later overhears Sarah talking about Tyler and then sabotages Sonny's science project. The following day on Halloween, Slappy uses his powers to attack Tyler, and Sonny accidentally damages the school science lab with his sabotaged project.\nSarah questions Sonny and Sam about Slappy. The group realizes that Slappy is at fault for everything. The kids capture Slappy and try to dispose of him in a lake, but he escapes. That night, they find an article online about the events that happened in Madison, Delaware and try to contact R. L. Stine (Jack Black) after realizing the book they found was an unpublished Goosebumps manuscript called Haunted Halloween. Stine, now living in a cabin in the woods, hears their message and departs for Wardenclyffe.\nSlappy goes to a local drug store and uses his magic to bring Goosebumps costumes and Halloween decorations to life. He also uses a mask to transform an employee named Walter (Chris Parnell), whom Kathy has a crush on, into a hunchbacked ogre. Slappy travels to the Tesla tower, and uses it to amplify his magic. Sarah, Sonny and Sam retrieve the book from Tommy’s house while all the town’s Halloween decorations come to life, and discover that the book can trap the monsters inside. However, the book is stolen and Kathy is kidnapped by the monsters.\nThe kids’ neighbor Mr. Chu (Ken Jeong), a Goosebumps fan who is thrilled to be trapped in a living Goosebumps story, helps them craft monster disguises to safely navigate the town. The kids head for the Wardenclyffe Tower while Stine arrives in town.\nAt the tower, the kids encounter Slappy and Walter and discover that Slappy has turned Kathy into a living dummy, so that she can be his \"mommy.\" Sonny and Sam overload the reactor while Sarah fights Slappy. She defeats Slappy by kicking him into the electrified coil atop the tower, which blasts him into the sky. Sarah opens the book and combines it with the reactor's energy to suck all the other monsters into the Haunted Halloween manuscript, while also causing Kathy and Walter to return to normal. Stine arrives, congratulates the kids for defeating the monsters, and gives Sarah advice for writing her essay.\nSometime later, Kathy and Walter start dating, Sonny wins the science fair and Sarah gets an email saying she got into Columbia University.\nBack in Stine's cabin, Slappy appears. He reveals that he has survived and has written a book of his own where Stine is the main character. He then opens his manuscript, sucking Stine inside.", "cast": "Jeremy Ray Taylor as Sonny Quinn\nMadison Iseman as Sarah Quinn, Sonny's sister.\nCaleel Harris as Sam Carter, Sonny's best friend.\nWendi McLendon-Covey as Kathy Quinn, Sonny and Sarah's mother.\nChris Parnell as Walter, the manager of the local pharmacy, who has a crush on Kathy and is turned into a hunchbacked ogre by a Haunted Mask.\nKen Jeong as Mr. Chu, the Quinns' neighbor.\nJack Black as R.L. Stine, the writer of the Goosebumps books.R .L. Stine appears as Principal Harrison, the principal of the school that Sonny and Sam attend.\nMick Wingert as the voice of Slappy the Dummy, a living ventriloquist dummy from the Night of the Living Dummy books. Jack Black previously voiced Slappy in the first film.\nAvery Lee Jones provides the puppeteer work for Slappy.\nBryce Cass as Tyler Mitchell, Sarah's ex-boyfriend.\nPeyton Wich as Tommy Madigan, a bully who picks on Sonny and Sam.\nKendrick Cross as Mr. Carter, Sam's father.\nShari Headley as Mrs. Carter, Sam's mother.\nCourtney Lauren Cummings as Jess, a girl with whom Tyler cheats on Sarah.\nJessi Goei as Maya, Jess' friend.\nKatharine C. Lumpkin as Monster Bride\nKent Wagner as Undead Pirate\nMarsha Shackelford as Female Cyborg\nBarry W. Jerald Jr. as Gray alien\nSherri Millican as Banshee\nScott Millican as Red-Haired Ghoul\nJoseph N. Hardin as Vampire\nAlex T. Hill as Scarecrow\nBenjamin Bladon as Royal MummyCalaca ladies portrayed by Iyani Gwendolyn, Cheniqua Litchmore, and Hali J. Ross. Goblins portrayed by Cody Jenkins and Joe Marri. Mummies portrayed by Mary Tricia Froedge, Robert Hunt, Martin Skyler, Grace Toso, Calvin Wickham, and Taylor Williams.\nA scene briefly shows Ryu and Ken from the video game Street Fighter using voice clips from Street Fighter games."}