{"_movieID": "59859", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:00:23", "summary": "Kick-Ass 2 is a 2013 superhero black comedy film based on the comic book of the same name and Hit-Girl, both by Mark Millar and John Romita, Jr., and is the sequel to the 2010 film Kick-Ass. The film was written and directed in Toronto, Ontario, Canada by Jeff Wadlow and co-produced by Matthew Vaughn, who directed the first film. Aaron Taylor-Johnson, Christopher Mintz-Plasse and Chloë Grace Moretz reprise their roles from the first film as Dave Lizewski, Chris D'Amico, and Mindy Macready, respectively. Other returning actors include Clark Duke, Yancy Butler, Garrett M. Brown, Lyndsy Fonseca and Sophie Wu.\nThe film was shot in Canada and England in the second semester of 2012 and released on August 14, 2013, in the United Kingdom and Ireland and on August 16 in the United States. Matthew Vaughn's production company Marv Films produced the film alongside Plan B Entertainment, Dentsu and Universal Pictures. Kick-Ass 2 earned $60.7 million on a $28 million budget. On Rotten Tomatoes, critics deemed it far inferior to its predecessor and was critically panned.", "plot": "Dave Lizewski, bored after having retired from fighting crime as Kick-Ass, begins training with Hit-Girl (Mindy Macready) to become a real hero. Following the death of his father, Chris D'Amico accidentally kills his own mother, who is in denial over the circumstances of her husband's death, by short-circuiting her tanning bed. Now in control of his father's criminal empire, Chris decides to become a supervillain named The Motherfucker, and assembles a gang of supervillains called the Toxic Mega Cunts with his aide Javier and has gained a cult following on Twitter, swearing vengeance on Kick-Ass. The other leading members of the Toxic Mega Cunts include African-American UFC fighter Black Death, midget mob enforcer The Tumor, ex-Triad gang member Genghis Carnage, and the only woman on the team, former Russian bodyguard Mother Russia.\nMindy's guardian, Marcus, discovers she is still fighting crime and makes her promise to give it up. Dave resumes his life as Kick-Ass, joining the superhero team Justice Forever (which Dave had inspired), led by ex-mafia member and born again Christian Colonel Stars and Stripes. Kick-Ass begins a sexual relationship with Night Bitch, one of the members, after breaking up with his girlfriend Katie Deauxma. He and Marty, who is also on the team as Battle Guy, alienate their friend Todd from participating in their heroics because Todd's superhero persona \"Ass-Kicker\" is an obvious knockoff of Kick-Ass. Mindy, attempting to lead a normal life, tries out for the dance team at school, and promptly asks a boy to take her on a date after declining to join Justice Forever. The date ends up as a cruel prank planned by bullies in her school, but Mindy gets her revenge the next day, resulting in her suspension from school.\nDave's father discovers Dave is Kick-Ass after finding his superhero costume, and they have an argument which leads Dave to leave home. After his imprisoned uncle has Javier killed, a deranged Chris kills Colonel Stars and Stripes, and attempts to rape Night Bitch the following day. Chris's henchwoman Mother Russia kills the arriving authorities, resulting in a police clampdown on both costumed villains and vigilantes. When the police track Dave through his IP address, Dave's father surrenders, claiming that he is Kick-Ass, in Dave's place. Chris, tipped off by Todd, who has joined the Toxic Mega Cunts unaware that they're psychopaths, has Mr. Lizewski murdered in police custody, revealing his true identity.\nThe Toxic Mega Cunts sabotage Mr. Lizewski's funeral and kidnap Dave, but Mindy rescues him. Afterwards, Dave, Mindy and the remaining members of Justice Forever, joined by a resurgence of masked do-gooders battle and defeat the outnumbered Toxic Mega Cunts. Mindy, as Hit-Girl, defeats Mother Russia in battle, while Dave and Chris fight on a rooftop. Chris crashes through a skylight, landing in a water tank, and subsequently is mauled by a shark.\nJustice Forever decides to take a break from its superhero duties, helping people in their ordinary lives instead. Mindy tells Dave that she is leaving New York due to being wanted for murder, but that the citizens need Kick-Ass. Police officers raid Marcus's home to investigate Mindy's whereabouts and Marcus feels very disappointed, while Dave accepts the responsibility and begins training and upgrading his equipment, looking more physically fit and ripped. In the last shot, we see a chrome version of Kick-Ass's mask.\nIn a post-credits scene, Chris, who has survived the shark attack, and whose limbs and genitals were bitten off by the shark, complains for attention over an out of reach cup of water.", "cast": "Additionally, comic book creators Mark Millar and John Romita, Jr., former UFC  Light Heavyweight Champion Chuck Liddell, and Aaron Taylor-Johnson's stepdaughter Angelica Jopling make cameo appearances in the film."}