{"_movieID": "27581", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:36", "summary": "The Other Guys is a 2010 American buddy cop action comedy film directed by Adam McKay, who co-wrote it with Chris Henchy. It stars Will Ferrell, Mark Wahlberg, Michael Keaton, Eva Mendes, Steve Coogan, Ray Stevenson, Samuel L. Jackson, and Dwayne Johnson.This film is the fourth of five collaborations between Ferrell and McKay, following Anchorman: The Legend of Ron Burgundy (2004), Talladega Nights: The Ballad of Ricky Bobby (2006), and Step Brothers (2008), and followed by Anchorman 2: The Legend Continues (2013). The Other Guys is the only one not to be co-written by Ferrell. It is also the first of three collaborations between Ferrell and Wahlberg, who later reunited in Daddy's Home (2015) and Daddy's Home 2 (2017). \nThe film was released on August 6, 2010. It has a 78% approval rating at Rotten Tomatoes and grossed over $170 million.\n\n", "plot": "Allen Gamble and Terry \"Yankee Clipper\" Hoitz are both detectives of the New York City Police Department (NYPD). Allen is a mild-mannered forensic accountant while Terry is a hot-tempered detective who has been partnered with Allen ever since he mistakenly shot Derek Jeter during the World Series. They receive no respect from the other officers, particularly detectives Martin and Fosse. All but Terry idolize cocky detectives Chris Danson and P. K. Highsmith, who are considered New York City's best policemen even though they frequently cause millions of dollars in property damage catching petty criminals. During a pursuit, Danson and Highsmith leap to their deaths after attempting to \"aim for the bushes\", which causes the precinct to wonder why they did it and who will take their place.\nAllen and Terry investigate a scaffolding permit violation by multi-billionaire Sir David Ershon but wind up uncovering a much bigger plot by Ershon to cover the losses incurred by his client Lendl Global. Lendl CEO Pamela Boardman has hired a team of mercenaries led by Roger Wesley to make sure Ershon pays her back.\nDuring their investigation, Allen confides in Terry about how he ran a college dating service in his past, though he denies that he was ever a pimp. When they both get to Allen's house, Terry develops a slight crush on Allen's wife Sheila, while not believing she is truly with Allen because of her beauty. When they visit Allen's ex-girlfriend, Christinith, to gain their police evidence, she and her husband wants him to have sex with her. When Sheila tells Allen that she is pregnant, he reverts back to his dark personality, which has her kick him out of their house. Meanwhile, Terry unsuccessfully attempts to reconnect with his ex-fiancée Francine, who had walked out on him due to his furious attitude.\nTheir investigation comes to a halt when Ershon's attorney, Don Beaman, learns of Ershon's plan to cover his losses, leading Wesley to kill him and make it look like a suicide. Angered at their lack of progress, Capt. Gene Mauch splits up Allen and Terry, sending Terry to traffic duty and Allen to beat patrol. Despite Terry's anger, Allen still works the case on his own.  After Allen learns that Danson and Highsmith died investigating a staged theft during which Wesley broke into an accounting firm next door, he finds credible evidence and earns his gun back from Mauch. Allen then convinces Terry to rejoin him. They meet Capt. Mauch at Bed Bath & Beyond, his second job, where the police captain admits he has been holding off on the case because Ershon has high-profile connections that could ruin him, and he allows them to finish the case off-the-books.\nThey go to an investment meeting Ershon is having and realize that the $32 billion Ershon seeks is really coming from the NYPD pension fund. They escape with Ershon to his private apartment, and Ershon tells them that the money for the pension fund is already in his account, ready to be transferred. Later that night, Allen and Terry finally reconcile with their loved ones. Allen apologizes to Sheila with her mother as a secret communication system and so she welcomes her husband back in. Terry also apologizes to Francine for letting his anger rule his life.\nThe next morning, they drive to the bank to stop the transfer, evading Wesley's team, groups of Chechen and Nigerian investors to whom Ershon owes money, and police officers who are told Allen and Terry have gone rogue. They reach the bank and halt the transfer. Wesley arrives, and as a delaying tactic, shoots both officers and Ershon in their arms. Mauch finally arrives with police backup, rescuing the two and arresting Ershon for his embezzlement, and Wesley for multiple counts of murder. Ershon's arrest leads to a stock market crash and the subsequent federal bailout of Lendl Global. Terry marries Francine, and Allen reunites with his wife. The narrator finishes off by stating that the true heroes are the everyday people who work to make a difference, not the ones who appear in the newspaper or on TV.", "cast": "Cameos"}