{"_movieID": "451915", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:57:42", "summary": "Beautiful Boy is a 2018 American biographical drama film directed by Felix van Groeningen, in his English-language feature debut. The screenplay, written by Luke Davies and van Groeningen, is based on the memoirs Beautiful Boy: A Father's Journey Through His Son's Addiction by David Sheff and Tweak: Growing Up on Methamphetamines by Nic Sheff. The film stars Steve Carell, Timothée Chalamet, Maura Tierney, and Amy Ryan, and deals with a father-son relationship increasingly strained by the latter's drug addiction.\nBeautiful Boy had its world premiere at the Toronto International Film Festival on September 7, 2018, and was theatrically released in the United States on October 12, 2018, by Amazon Studios. The film grossed $16 million on a $25 million budget and received generally positive reviews from critics, who praised the performances of Carell and Chalamet. For his work, Chalamet earned nominations at the Golden Globes, Screen Actor Guild, BAFTA Awards and Critics’ Choice Awards, among others.", "plot": "New York Times writer David Sheff’s teenage son Nicholas goes missing, reappearing in their home two days later. Seeing obvious signs of drug use, David takes Nic to a rehab clinic. Progress is made, and Nic transfers to a halfway house, with the agreement of Nic's doctors. Days later, Nic disappears, and David finds him in the streets.\nBack at the rehab facility, Nic reveals that he has been taking numerous drugs, including crystal meth. Nic eventually completes his rehab program, and seeing his improvements, combined with wishful thinking, David allows him go away to college on his own, to become a writer. Nic's newfound freedom and sobriety start well, as he becomes a good student, and starts a relationship with his attractive classmate. During a happy family dinner at his girlfriend's parents' house, Nic finds a bottle of pills in their medicine cabinet and swallows one. After this incident, he slowly relapses, causing his girlfriend to break up with him, and his substance use to escalate, until he eventually purchases heroin. Around this time, beginning to become suspicious at his slowly changing behavior, David decides to read Nic's diary. To his horror, Nic has filled half the pages by colorfully describing his growing addictions through worrying words and disturbing cartoons. On one of the last pages, Nic writes of his difficulty obtaining meth in college, but that he managed to score some heroin.\nReturning home, David senses that Nic is using again, and Nic leaves of his own accord, feeling claustrophobic from his dad's suspicions about his drug use. David and Nic finally meet up, and Nic asks his dad for money, so he can go to New York. Knowing the money will almost certainly go towards drugs, David declines, and Nic angrily leaves. David later gets a call from a New York hospital saying Nic has overdosed. David flies there to retrieve him, and after talking to his ex-wife and Nic's mother Vicki, he decides Nic should be sent to live with her in Los Angeles. \nNic has a fresh start in Los Angeles. He attends 12 step meetings, spends time with his sponsor Spencer, and even works at a drug clinic to help newer patients overcome their addiction. Fourteen months sober, Nic drives to visit David and his family. Seeing Nic back to his old self, interacting happily with his two younger half-siblings, David is proud of his son's newfound sobriety, as is his wife Karen. As he departs from their home however, Nic has a sudden surge of depression, resents his sobriety, and fears relapsing. Spencer gives Nic moral support over the phone, but to little avail. Later that night, Nic drives into San Francisco, where he runs into Lauren, a fellow drug addict from his past, and confesses his desire to \"party,\" despite having been clean for quite some time. The two buy various drugs in the streets, which they proceed to inject together at Lauren's place, where they have sex.\nWhen he learns Nic has gone missing again, David prepares to look for him, but Karen protests that he has done everything he can for Nic, and he cannot do anything to fix his addiction, which David heartbrokenly accepts. One day Nic and Lauren break into the home while David and his family are not there, and retrieve some valuable items. The family come home, and the two quickly depart. At first they go undetected, but David's other son Jasper notices Nic, and both David and Karen go to find them. Karen chases them in their car but stops and lets them drive off. \nLauren overdoses, but is revived by Nic and is sent to the hospital. Nic tearfully calls David and asks for permission to come home, which his father declines. Nic continues to plead, but David hangs up and breaks down in tears. Despairing, Nic overdoses, but he survives. David and Vicki visit him in the hospital, and David and Nic tearfully embrace.\nClosing titles reveal Nic has been sober for eight years, and it would not have been possible without the love and support of his family and friends."}