{"_movieID": "129790", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:46", "summary": "The Death and Return of Superman is a side-scrolling beat 'em up video game released by Sunsoft for the Super NES and Genesis in 1994. It is based on \"The Death of Superman\" comic book storyline by DC Comics and features many characters from the comics, including Superman himself, Superboy, Steel, Cyborg Superman, the Eradicator, and Doomsday. All of the five Supermen are playable characters at some point.\n\n", "plot": "The game starts when Clawster and his army and Underworlders initiate a power failure in the city of Metropolis in an attempt to take over the city. Superman intervenes and defeats the horde of Underdwellers, Clawster included. Not long after the power is restored, a news report bulletin states a monster of unknown origin (Doomsday) is leading a path of destruction towards Metropolis, and the Justice League were unable to stop the creature. The titanic struggle between Superman and Doomsday reached a conclusion when the two delivered each other the killing blow. Superman succumbs to his injuries as he dies, as well as Doomsday.\nThree months later, four Supermen emerge in an effort to replace the original Superman, whilst the other claiming he is indeed the original Superman. The game shifts to Cyborg Superman (the \"Man of Tomorrow\") as he attacks a Project Cadmus base to locate a comatose Doomsday. Fearing he would be a threat once again if he wakes up, the Cyborg exiles Doomsday in deep space. Next, the player controls the Eradicator (the \"Last Son of Krypton\") as he patrols the streets of Metropolis. However, he is forced into battle with another Superman, Steel, as the armored hero fights to prevent the Last Son of Krypton from killing enemies. After the two Supermen fought to a standstill, the Eradicator reconsiders his brutal approach to fighting crime after Steel tells him it takes humanity and compassion to be considered a Superman.\nHowever, a bigger threat comes, as a mysterious spacecraft arrives and obliterates Coast City (the hometown of Hal Jordan). The Eradicator investigates the situation, only to run in with the mastermind, the Cyborg. The Eradicator is critically injured at the Cyborg's hands, and rushes to the Fortress of Solitude. The game shifts its focus on Superboy (the \"Metropolis Kid\") as he attempts to handle the current situation in Metropolis. After successfully doing so, Superboy flies off to Coast City, doing battle with the Cyborg as he arrives. The Cyborg knocks out and imprisons Superboy in the spacecraft. There, the rogue Superman reveals his plan: to destroy the world and reconstruct it in his image, starting with Coast City and Metropolis. While this is going on, a being flies among the skies above the Fortress of Solitude, albeit weakly. Back in Coast City, Superboy escapes imprisonment to go back to Metropolis, where he and Steel encounter the real Superman. Not wanting to wait, Superboy convinces the two to go with him to Coast City to stop the Cyborg once and for all.\nThe player now controls Steel (the \"Man of Steel\") as he, Superman, and Superboy launch an assault on Engine City. However, the Cyborg launches a missile set to destroy Metropolis. Superboy elects to stop the missile, and, with player controlling Superboy, he successfully destroys the missile. At Engine City, the player shifts back to Steel, as he enters the Engine's core to shut it down. Meanwhile, a regenerated Eradicator bursts out of the Fortress and arrives at Engine City to help a weakened Superman, who is at the Cyborg's mercy. The Cyborg shoots Kryptonite fuel at Superman but the Eradicator arrives and shields Superman from the blast. The BMI of the Eradicator alters the deadly effects of the Kryptonite fuel and restores Superman to full strength as the Eradicator dies. Now controlling Superman, the player defeats and destroys the Cyborg Superman. The game ends with Steel and Superboy congratulating Superman for his success and accepting him as the real Superman."}