{"_movieID": "340676", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:46", "summary": "Personal Shopper is a 2016 supernatural psychological thriller film written and directed by Olivier Assayas. The film stars Kristen Stewart as a young American woman in Paris who works as a personal shopper for a celebrity and tries to communicate with her deceased twin brother.\nAn international co-production between Belgium, Czech Republic, France and Germany, the film was selected to compete for the Palme d'Or at the 2016 Cannes Film Festival. At Cannes, Assayas shared the Best Director Award with Cristian Mungiu, who directed Graduation. The film was released on 14 December 2016 in France and 10 March 2017 in the United States. The film received positive reviews from critics, with particular praise for Stewart's performance.", "plot": "Maureen is a personal shopper in Paris for Kyra, a demanding supermodel. Her twin brother Lewis recently died from a heart condition, a condition shared by Maureen. They were both interested in spiritualism and felt they were mediums.\nMaureen stays overnight at her late brother's home, hoping for a sign from him, and has a brief encounter with a spiritual presence. His girlfriend Lara wants to sell the mansion to a couple who knew and loved her brother, but they want Maureen to find out if the mansion has spirits, benevolent or malevolent. Maureen and her brother had promised each other that who ever died first would give the other a sign after death. During her discussion with the potential buyers, Maureen discovers the artist Hilma af Klint, whose paintings were inspired by messages from the spirit world. Maureen video chats with her boyfriend Gary, who is on a contract job in Oman, and encourages her to get away from Paris and Kyra and to come visit. He tells her there is nothing after death.\nAt Kyra's apartment, Maureen meets and talks with Kyra's lover Ingo, who tells her Kyra is planning to break up with him because she is afraid her husband will discover their relationship. Maureen spends another night at Lewis' home and the faucets turn on. She asks Lewis to talk with her, and discovers that her artwork has been scratched out. She is terrified by an aggressive, angry specter of a woman. Maureen flees the house.\nOn her way to London to pick up clothing for Kyra, Maureen receives a series of text messages from an unknown number, which she suspects is her late brother Lewis. The sender toys with Maureen, and encourages her to try on Kyra's clothes, which she has been forbidden to do. She spends the night in Kyra's bed, in a dress collected from London. The sender also leaves her a room key for a hotel. When she visits the room in one of Kyra's dresses, no one is there, but when she checks at the front desk, she discovers the room is booked in her name and has been pre-paid in cash.\nAfter picking up expensive jewelry for Kyra, Maureen returns to Kyra's apartment, where she discovers Kyra's bloody corpse, and sees fleeting images. She is questioned by the police, who ask about the location of the jewelry. Later, Maureen discovers the jewelry is in her apartment. The unknown texter demands she return to the hotel room, which she does, with the jewelry.\nDoors in the hotel open and close, although no one is seen going through them. Ingo leaves the hotel, and is apprehended by two men. He shoots one and attempts to escape. However, he is arrested and confesses to murdering Kyra.\nMaureen meets Lara's new boyfriend Erwin, who was friends with Lewis before his death. They speak about the possibility that Lewis's soul is still present. As Maureen sits in the garden, a wind stirs, and a glass behind her levitates and falls to the floor.\nMaureen flies to Oman to visit Gary in the mountains. Arriving at his room, she hears a noise and finds a glass floating in the air; it falls and shatters. She asks questions, accepting single thumps as yes, two for no. When she eventually asks her twice-repeated question, \"Lewis, is it you,\" there is silence. She then asks, \"Or is it just me?\" A single thump for yes.", "cast": "Kristen Stewart as Maureen Cartwright\nLars Eidinger as Ingo\nNora Waldstätten as Kyra Gellman\nAnders Danielsen Lie as Erwin\nSigrid Bouaziz as Lara\nTy Olwin as Gary\nAudrey Bonnet as Cassandre\nPascal Rambert as Jerome\nHammou Graia as Police Officer\nBenjamin Biolay as Victor Hugo"}