{"_movieID": "264999", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:19", "summary": "Magic Mike XXL is a 2015 American comedy-drama film directed by Gregory Jacobs, written by Reid Carolin and starring Channing Tatum, Matt Bomer, Kevin Nash and Joe Manganiello. A sequel to 2012's Magic Mike, the film premiered in Hollywood on June 26, 2015 with subsequent European premiere in London on June 30, 2015. The film was released on July 1, 2015, received generally positive reviews from critics and grossed $122 million.\n\n", "plot": "Three years after abandoning his life as a stripper, Mike is running his own furniture business. He receives a call from Tarzan who informs Mike that Dallas is \"gone\". Believing that his former boss has died, Mike drives to a hotel only to find that his friends, the remaining Kings of Tampa, are enjoying themselves at a pool party. After revealing that Dallas has bailed on them to start a new show in Macau and only took \"The Kid\" (referencing Adam from Magic Mike) with him, the Kings let Mike in on their plan: to end their careers on a high note by traveling to Myrtle Beach for a stripping convention. Later, while trying to work, Mike overhears a song he used to strip to and dances. Reinvigorated, Mike decides to join them on their trip.\nDriving in a fro-yo van owned by Tito and Tobias, they decide to make their first stop at Mad Mary's. To prove to Richie that he's willing to commit to the trip, Mike participates in an amateur drag queen contest. The others join him soon after. They then head down to a beach where Mike attempts to resolve his issues with Ken through violence. The two later reconcile. Mike also meets a photographer named Zoe who tells him that she's headed for New York. They flirt but mutually agree that they should not have sex.\nBack on the road, Mike suggests that they change their routine after the group (excepting Tarzan) take MDMA. They stop at a gas station where he coerces Richie into trying to make the cashier smile with an improvised striptease which he successfully does. This inspires the others to abandon their old routines. Soon afterward, Tobias, under the influence of MDMA, passes out while driving and crashes the van. Everyone is left unscathed aside from Tobias who gets a concussion. In the hospital, the group begins to lose morale, and contemplate packing up and heading home. Mike then reveals that his furniture business isn't going that well and that he's no longer dating Brooke after she rejected his marriage proposal. The group decides to continue on.\nIn search of a new emcee, Mike brings the group to a Savannah strip club owned by Rome, a woman that Mike has a history with. Despite proving to her that his skills haven't deteriorated, he's unsuccessful in getting her to help them. However, she does give them a ride to their next stop by having Andre, a rapper/singer who works at the club, drive them there.\nThe group arrives at a mansion. Tito tells them that he knows the girl who lives there and that she's expecting them. They walk in through the door but are greeted by the girl's mother, Nancy, along with Nancy's friends who are all middle-aged women. Nancy's teasing of the group initially makes them feel awkward but as the night goes on, the mood lightens. During this time, Mike meets Zoe again. Zoe confesses that she was hired by another photographer as his assistant solely so he could try to start an affair with her, despite being married. Mike urges her to come to the convention to regain her smile.\nAfter sleeping with Richie, Nancy allows the group to drive her ex-husband's car to Myrtle Beach. When they arrive, they are surprised to see Rome. Rome, after having a change of heart, agrees to be their emcee. She also brings along Andre and Malik to help. With their preparations complete, they head to the convention where they manage to squeeze in a spot thanks to Rome and her seemingly romantic history with the organizer of the event, Paris. The group's performance is a success. During Mike and Malik's performance, Mike brings Zoe on stage. The film ends in celebration, Tobias returning with the fro-yo van and everyone watching the 4th of July fireworks."}