{"_movieID": "353070", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:17", "summary": "Going in Style is a 2017 American heist comedy film directed by Zach Braff and written by Theodore Melfi. A remake of the 1979 film Going in Style, it stars Morgan Freeman, Michael Caine, Alan Arkin, Joey King, Matt Dillon, Christopher Lloyd, Ann-Margret, John Ortiz and Siobhan Fallon Hogan. It follows a trio of retirees who plan to rob a bank after their pensions are cancelled.\nThe film premiered at the SVA Theatre on March 30, 2017 and was released in the United States on April 7, 2017. It received mixed reviews from critics and grossed $84 million worldwide against its $25 million budget.", "plot": "Joe, Willie, and Albert are senior citizens and lifelong friends living in New York. During an unpleasant appointment at the bank, Joe is one of the victims to witness a robbery in progress carried out by three individuals wearing black masks. During the robbery, he notices the leader bearing a Mongol warrior tattoo on his neck as the only lead that could help the police identify the culprit. However, the leader sympathizes with Joe when he finds out about his current financial situation brought up by the bank. Then, the robbers manage to escape with over $1.6 million.\nWhen the company they worked for is bought out, their pensions become a casualty of the restructuring. Joe is hit particularly hard and finds out that he, his daughter, Rachel, and granddaughter, Brooklyn, will be homeless in less than thirty days. Willie finds out he's gravely ill from kidney failure and needs a transplant and is even more frustrated because his financial situation forces him into a long-distance relationship with his daughter and granddaughter. Desperate, the three friends decide to rob the bank that is going to restructure their pension funds and take back what is rightfully theirs.\nInspired by his experience of the robbery, Joe originates the idea; at first Albert and Willie are appalled, but eventually agree when they later learn that their bank intends to steal their pensions. Trying to shoplift some items from a grocery store, where Al's love interest, Annie, works, results in a comic disaster, so the trio turn to Joe's former son-in-law, Murphy, and a professional criminal and pet store owner named Jesus to teach them the ropes. They plan an alibi using their lodge's carnival as a cover.\nJoe, Willie, and Albert disguise themselves as \"The Rat Pack\" (Frank Sinatra, Dean Martin, and Sammy Davis, Jr.) and use guns with blanks so that no one gets hurt. The robbery almost goes awry when Willie collapses briefly and a child witness partially pulls off his mask to allow him to breathe better; she sees the wrist watch he wears with a picture of his granddaughter on it as he engages in a friendly conversation so as not to let her feel intimidated; however, the three manage to get away with over $2.3 million. They are soon arrested on suspicion by FBI Agent Hamer after the manager from the grocery store recognizes Al's walk from the video surveillance cameras, but they all stick to their alibis.\nHamer puts them along with other senior suspects into a police lineup, using the child witness who partially took off Willie's mask. She refuses to identify Willie, leaving Hamer with no case. Willie suffers total renal failure and is near death until Al agrees to donate a kidney. While part of the money is used to help the three friends with their financial situations, the rest is given to their families, friends, co-workers, and fellow members at the lodge. Joe finally gets his granddaughter a puppy he promised her if she got As in every subject at school; courtesy of Jesus, who is later revealed to be the leader of the robbers from the robbery Joe witnessed and has laundered the money that they stole. The tattoo on his neck is also revealed to be a fake made of henna, intended to throw the FBI and the police off the scent. The movie ends at Al and Annie's wedding as the three friends celebrate their good fortune.", "cast": "Michael Caine as Joe Harding, Brooklyn's grandfather, Rachel's father and Murphy's father-in-law, one of the three protagonists.\nMorgan Freeman as Willie Davis, Kanika's grandfather and Maya's father, one of the three protagonists.\nAlan Arkin as Albert Garner, one of the three protagonists.\nMatt Dillon as Special Agent Hamer, an FBI agent who investigates bank robberies.\nAnn-Margret as Annie Santori, Albert's love interest, Ezra's grandmother, and an employee at Value Town.\nChristopher Lloyd as Milton Kupchak, the guys' senile lodge buddy.\nJoey King as Brooklyn Harding, Joe's granddaughter and Murphy and Rachel's daughter.\nJohn Ortiz as Jesus Garcia, a man of unspecified credentials who agrees to show the guys the ropes, a pet store owner in Queens, and the leader of robbers at the beginning of the film.\nPeter Serafinowicz as Murphy Harding, Joe's former son-in-law, Rachel's former husband, and Brooklyn's estranged father.\nJosh Pais as Chuck Lofton, the bank manager of Williamsburg Savings Bank who intends to take Joe's house in a month.\nMaria Dizzia as Rachel Harding, Joe's daughter, Murphy's ex-wife and Brooklyn's mother.\nKenan Thompson as Keith Schonfield, a grocery store manager of Value Town.\nAshley Aufderheide as Kanika Davis, Willie's granddaughter and Maya’s daughter.\nGillian Glasco as Maya Davis, Willie's daughter and Kanika's mother.\nSiobhan Fallon Hogan as Mitzi, a waitress at Nat's Diner.\nAnnabelle Chow as Lucy, Mandy's daughter and the child witness.\nNancy Sun as Mandy, Lucy's mother.\nJeremy Schinder as Ezra Bronkowski, Annie's grandson.\nAnthony Chisholm as Paul, the Knights Grandmaster."}