{"_movieID": "12201", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:58:55", "summary": "Edge of Darkness is a British television drama serial produced by BBC Television in association with Lionheart Television International and originally broadcast in six fifty-five-minute episodes in late 1985. A mixture of crime drama and political thriller, it revolves around the efforts of policeman Ronald Craven (played by Bob Peck) to unravel the truth behind the murder of his daughter Emma (played by Joanne Whalley). Craven's investigations soon lead him into a murky world of government and corporate cover-ups and nuclear espionage, pitting him against dark forces that threaten the future of life on Earth.\nWriter Troy Kennedy Martin was greatly influenced by the political climate of the time, dominated by the Thatcher government, and the aura of secrecy surrounding the nuclear industry – and by the implications of the Gaia hypothesis of environmentalist James Lovelock; these combined to his crafting a thriller that mingled real world concerns with mythic and mystical elements. Kennedy Martin's original ending was more fantastic than that eventually used in the finished serial: he had proposed that Craven would turn into a tree but this was vetoed by members of the cast and crew.\nFirst broadcast on BBC2, Edge of Darkness was met with such widespread critical acclaim that within days it had earned a repeat on BBC1. Winner of several prestigious awards, it remains highly regarded, often cited as one of the best and most influential pieces of British television drama. The series' director, Martin Campbell, filmed a remake, released in January 2010, starring Mel Gibson and set in the United States.", "cast": "Ronald Craven was played by Bob Peck, an actor who was well known in theatre but, at the time he was cast as Craven, had appeared in only minor roles on television. In creating the role of Craven, Peck drew upon his experience gained from the two years he played the title role in Macbeth for the Royal Shakespeare Company. Notable roles after Edge of Darkness included On the Black Hill (1987), Slipstream (1989), Natural Lies (1992) and Jurassic Park (1993). He died in 1999.\nJoanne Whalley, who played Emma Craven, began acting during childhood, appearing in the long-running soap opera Coronation Street (1960–present) in 1976 at the age of 10. She had also appeared in supporting roles in several series including Juliet Bravo (1980–1985), Bergerac (1981–1991) and Reilly, Ace of Spies (1983). Following Edge of Darkness, Whalley was cast in the equally well regarded BBC television serial The Singing Detective (1986), written by Dennis Potter. Moving to Hollywood, she appeared in such films as Willow (1988), Scandal (1989) and Shattered (1991) as well as television mini-series such as Scarlett (1994) and Jackie Bouvier Kennedy Onassis (2000). During her eight-year marriage to the actor Val Kilmer, between 1988 and 1996, she was often credited as Joanne Whalley-Kilmer.\nCast as Darius Jedburgh was Joe Don Baker, who had been acting since the 1960s and was known for his roles in Westerns such as Gunsmoke (1955–1975) and as the lead in the detective series Eischied (1979–1980).  He also starred as Sherriff Buford Pusser in the original 1972 film Walking Tall. The script of Edge of Darkness so impressed him that he agreed to take the part at lower than his usual fee. He was later cast, by Edge of Darkness director Martin Campbell, as CIA agent Jack Wade in the James Bond film GoldenEye (1995), a role he reprised in Tomorrow Never Dies (1997).\nCharles Kay, who played Pendleton, was a well established character actor who had appeared in Fall of Eagles (1974), I, Claudius (1976) and The Devil's Crown (1978). He has since acted in many television productions such as Fortunes of War (1989), The Darling Buds of May (1991–1993), Jonathan Creek (1997–2004) and Midsomer Murders (1997–present).\nEdge of Darkness was an early role for Ian McNeice, who played Harcourt. He went on to act in a wide variety of film and television parts including The Englishman Who Went Up a Hill But Came Down a Mountain (1995), Ace Ventura: When Nature Calls (1995) and Frank Herbert's Dune (2000), as well as regular roles in Doc Martin (2004–present), Rome (2005–2007) and regular appearances as Winston Churchill in the BBC's revived Doctor Who.Several other faces familiar to British viewers appeared during the course of the episodes, including John Woodvine (as Craven's superior DCS Ross), Tim McInnerny (as Emma's boyfriend Terry Shields), Hugh Fraser (as IIF chief executive Robert Bennett), Zoë Wanamaker (as intelligence agent Clementine) and Blake's 7 cast members David Jackson (as Colonel Lawson) and Brian Croucher (as Northmoor security chief Connors). Playing themselves were television reporters Sue Cook and Kenneth Kendall, weatherman Bill Giles and Labour MP Michael Meacher. Long-standing BBC visual effects designer Mat Irvine, who contributed visual effects to the series, received a brief cameo as a police diver in \"Breakthrough\"."}