{"_movieID": "97630", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:25", "summary": "Zero Dark Thirty is a 2012 American thriller film directed by Kathryn Bigelow and written by Mark Boal. The film dramatizes the nearly decade-long international manhunt for Al-Qaeda leader Osama bin Laden after the September 11 attacks. This search leads to the discovery of his compound in Pakistan and the military raid that resulted in bin Laden's death on May 2, 2011.\nJessica Chastain stars as Maya, a fictional CIA intelligence analyst, with Jason Clarke, Joel Edgerton, Mark Strong, James Gandolfini, Kyle Chandler, Stephen Dillane, Chris Pratt, Édgar Ramírez, Fares Fares, Jennifer Ehle, John Barrowman, Mark Duplass, and Frank Grillo in supporting roles. It was produced by Boal, Bigelow, and Megan Ellison, and independently financed by Ellison's Annapurna Pictures. The film premiered in Los Angeles on December 19, 2012 and had its wide release on January 11, 2013.Zero Dark Thirty received acclaim and appeared on 95 critics' top ten lists of 2012. It was nominated in five categories at the 85th Academy Awards, including Best Picture, Best Actress for Chastain, Best Original Screenplay, and Best Film Editing, and won the award for Best Sound Editing, shared with Skyfall. It also earned Golden Globe Award nominations for Best Motion Picture – Drama, Best Director, and Best Screenplay, with Chastain winning the award for Best Actress in a Motion Picture – Drama.\nThe depiction of so-called enhanced interrogation generated controversy, with some critics describing it as pro-torture propaganda, as the interrogations are shown producing reliably useful and accurate information. Acting CIA director Michael Morell felt the film created the false impression that torture was key to finding bin Laden. Others described it as an anti-torture exposure of interrogation practices.Republican Congressman Peter T. King charged that the filmmakers were given improper access to classified materials, which they denied. An unreleased draft IG report published by the Project on Government Oversight, in June 2013, stated that former CIA Director Leon Panetta discussed classified information during an awards ceremony for the SEAL team that carried out the raid on the bin Laden compound. Unbeknownst to Panetta, screenwriter Boal was among the 1,300 present during the ceremony.", "plot": "Maya is a CIA analyst tasked with finding the al-Qaeda leader Osama bin Laden. In 2003 she is stationed at the U.S. embassy in Pakistan. She and officer Dan attend the black site interrogations of Ammar, a detainee with suspected links to several of the hijackers in the September 11 attacks and who is subjected to approved torture interrogation techniques. Ammar provides unreliable information on a suspected attack in Saudi Arabia, but reveals the name of the personal courier for bin Laden, Abu Ahmed al-Kuwaiti. Other detainee intelligence connects courier traffic by Abu Ahmed between Abu Faraj al-Libbi (Yoav Levi) and bin Laden. In 2005, Faraj denies knowing about a courier named Abu Ahmed; Maya interprets this as an attempt by Faraj to conceal the importance of Abu Ahmed.\nIn 2009, during the Camp Chapman attack, Maya's fellow officer and friend Jessica (Jennifer Ehle) is killed. A case manager that liked the Abu Ahmed lead shares with her an interrogation with a Jordanian detainee claiming to have buried Abu Ahmed in 2001. Maya learns what the CIA was told five years earlier: Ibrihim Sayeed travelled under the name of Abu Ahmed al-Kuwaiti. Realizing her lead may be alive, Maya contacts Dan, now a senior officer at the CIA headquarters. She speculates that the CIA's photograph of Ahmed is that of his brother, Habeeb, who was killed in Afghanistan. Maya says that their beards and native clothes make the brothers look alike, explaining Ammar's account of Ahmed's \"death\" in 2001.\nA Kuwaiti prince trades the phone number of Sayeed's mother for a Lamborghini. CIA operatives use electronic methods to pinpoint a caller in a vehicle who exhibits behaviors that delay confirmation of his identity. They track the vehicle to a large urban compound in Abbottabad, Pakistan, near the Pakistan Military Academy. After gunmen attack Maya while she is in her vehicle, she is recalled to Washington, D.C. as her cover is believed blown.\nThe CIA puts the compound under surveillance, but obtains no conclusive identification of bin Laden. The President's National Security Advisor tasks the CIA with creating a plan to capture or kill bin Laden. Before briefing President Barack Obama, the CIA director (James Gandolfini) holds a meeting of his senior officers, who estimate that bin Laden is 60–80% likely to be in the compound. Maya, also in the meeting, places her confidence at 100%.\nOn May 2, 2011, the 160th Special Operations Aviation Regiment flies two stealth helicopters from Afghanistan into Pakistan with members of DEVGRU and the CIA's SAD/SOG to raid the compound. The SEALs gain entry and kill a number of people in the compound, including whom they believe is bin Laden. At a U.S. base in Jalalabad, Afghanistan, Maya confirms the identity of the corpse. She boards a military transport back to the U.S., the sole passenger. She is asked her destination and begins to cry."}