{"_movieID": "456048", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:35", "summary": "The Humanity Bureau is a 2018 Canadian science fiction thriller film directed by Rob W. King and written by Dave Schultz. The film stars Nicolas Cage, Sarah Lind, Hugh Dillon and Jakob Davies. The film was released on April 6, 2018, by Minds Eye Entertainment.\n\n", "plot": "In the future, war, climate and political agendas have robbed America of its resources. An agency called \"the Humanity Bureau\" ensures citizens are efficient. Inefficient citizens are deported to a city called New Eden. Noah Kross is an agent of the Humanity Bureau who manages the deportation of Chester Hill, a former governor of Colorado, who now lives in misery. When asked why he wishes to stay in squalor rather than be relocated to New Eden, he says he knows \"the truth\". Kross kills him in self-defense.\nKross evaluates a single mother, Rachel Weller, and her son, Lucas. Though apparently struggling, they wish to stay rather than go to New Eden. He delays sending in his report so the boy can perform at a musical recital the following day; Kross fondly remembers fishing in Canada as a boy and wants Lucas to have a positive memory of his recital. This act of minor insubordination upsets the Bureau and catches the attention of Kross’s supervisor Adam, who places him under investigation.  Rachel's resistance to relocation and the \"truth\" purported by Chester motivate Kross to investigate New Eden.  A defense contractor working for the bureau gives Kross a memory card.\nThe next day, Kross attends Lucas' recital and spends the night with them.  When he wakes up the next morning, he sees the Bureau coming and rushes inside to get Rachel and Lucas.  Rachel is being held hostage by Adam.  Lucas shoots Adam in the eye with a BB gun and they escape.  They drive to a gas station, where the owner assists in their flight by crashing his truck into the Bureau vehicles pursuing Kross.  When asked by the owner if Kross is a family man, he says he is \"trying to be\".\nBack at the Bureau, Adam is admonished for failing to stop Kross.  The Bureau's director opens a package of what looks like dust in front of him and shows Adam a child's tooth, warning him that if he fails again, he will end up in New Eden, revealed to be an extermination camp where unproductive citizens are incinerated.  Kross has learned the truth and seeks to save Lucas and Rachel.\nDuring their flight, Kross trades his Bureau vehicle for an unmarked station wagon and learns of a man who may know a way north.  When they find the man, they learn that the way north to Canada is highly irradiated and that no one who ever goes returns.  When he insists, the man gives Kross a Geiger counter, a device which measures radiation, and iodine tablets which absorb radiation.  Kross gives Lucas a rabbit's foot for good luck during the trip. \nAlong the road, they spot a drone searching for Kross.  After becoming tired and frustrated waiting for it to pass, Kross and Rachel get into an argument where Kross reveals that he knows the real Rachel Weller, and this woman is not her.  Years ago on a Bureau investigation, Kross and the real Rachel conceived a child, who is Lucas.  When the famine struck, Rachel tried to sell Lucas as food to her neighbor, Amanda, who fought and killed her and took Lucas as her own.\nThe three continue to evade the Bureau and eventually make it to a nuclear power plant, which the man warned them was highly irradiated.  Their Geiger counter reveals that there is not any radiation; it was a scare tactic to try to keep people from fleeing north.  Finally at the border the Bureau catches up with Kross, and they demand his memory card.  When Adam reads the card and finds it blank, he kills Kross and Rachel and tells Lucas to run off on his own.  Canadian troopers shoot the Bureau members and take in Lucas.  They find that the real memory card was in the rabbit's foot and disseminate the footage revealing New Eden as a death camp, sparking a revolution against the Bureau.  Lucas finally gets to visit the lake Kross used to fish in.", "cast": "Nicolas Cage as Noah Kross\nSarah Lind as Rachel Weller\nHugh Dillon as Adam Westinghouse\nJakob Davies as Lucas Weller\nVicellous Shannon as Agent Porter\nMel Tuck as Chester Hills\nKurt Max Runte as Adolf Schroder\nLorne Cardinal as Border Ranger\nDestee Klyne as Schroder's Daughter\nNikolas Filipovic as Spiky Hair\nJett Klyne as Little Noah\nDavid Lovgren as Irving Ravetch"}