{"_movieID": "381284", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:54:38", "summary": "Hidden Figures is a 2016 American biographical drama film directed by Theodore Melfi and written by Melfi and Allison Schroeder. It is loosely based on the non-fiction book of the same name by Margot Lee Shetterly about black female mathematicians who worked at the National Aeronautics and Space Administration (NASA) during the Space Race. The film stars Taraji P. Henson as Katherine Johnson, a mathematician who calculated flight trajectories for Project Mercury and other missions. The film also features Octavia Spencer as NASA supervisor and mathematician Dorothy Vaughan and Janelle Monáe as NASA engineer Mary Jackson, with Kevin Costner, Kirsten Dunst, Jim Parsons, Glen Powell, and Mahershala Ali in supporting roles.\nPrincipal photography began in March 2016 in Atlanta and was wrapped up in May 2016. Hidden Figures had a limited release on December 25, 2016, by 20th Century Fox, before going wide in the United States on\nJanuary 6, 2017. The film received positive reviews from critics and grossed $236 million worldwide. It was chosen by National Board of Review as one of the top ten films of 2016 and was nominated for numerous awards, including three Oscar nominations (Best Picture, Best Adapted Screenplay and Best Supporting Actress for Spencer), and two Golden Globes (Best Supporting Actress for Spencer and Best Original Score). It also won the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture.", "plot": "In 1961, mathematician Katherine Goble works as a human computer in the West Area Computers division of the Langley Research Center in Hampton, Virginia, alongside her colleagues, aspiring engineer Mary Jackson and their unofficial acting-supervisor Dorothy Vaughan. They are all African American women: the unit is segregated by race and sex.\nFollowing the successful Soviet launch of Yuri Gagarin, pressure to send American astronauts into space increases. Supervisor Vivian Mitchell assigns Katherine to assist Al Harrison's Space Task Group, given her skills in analytic geometry. She becomes the first black woman on the team. \nKatherine's new colleagues are initially dismissive and demeaning, especially head engineer Paul Stafford.\nMary is assigned to the space capsule heat shield team where she immediately identifies a design flaw. Meanwhile, Mitchell informs Dorothy that she will not be promoted, as there are no plans to assign a \"permanent supervisor for the colored group\".\nMary receives encouragement from her team leader, a Polish-Jewish Holocaust survivor, to apply for an official NASA engineer position.  When she submits her application she is told by Mitchell that despite her mathematics and physical science degree she will never be an engineer at NASA. She would need additional certification courses but these are offered only at the all-white nearby Hampton High School. Despite her husband's opposition Mary decides to file a petition for permission to attend class at Hampton High School.\nKatherine meets National Guard Lt. Col. Jim Johnson at a barbecue, but she is disappointed when he voices skepticism about women's mathematical abilities. He later apologizes, and begins spending time with Katherine and her three daughters.\nWhen Harrison invites his subordinates to solve a complex mathematical equation, Katherine develops the solution, leaving him impressed. The Mercury 7 astronauts visit Langley and astronaut John Glenn is cordial to the West Area Computers.\nHarrison is enraged when he finds out that Katherine is forced to walk a half-mile (800 meters) to another building to use the colored people's bathroom. Harrison abolishes bathroom segregation, knocking down the \"Colored Bathroom\" sign. Harrison allows Katherine to be included in their meetings, in which she creates an equation within that meeting to guide the space capsule during re-entry. Despite this, Katherine is forced to remove her name from the reports, which are credited solely to Stafford. Stafford said that computers cannot author such things. Meanwhile, Mary pleads her case in court and wins over the local judge by appealing to his sense of history and being on the right side of it. She is granted legal authorization to attend the segregated all white school to obtain her engineering degree, although only the night classes.\nDorothy learns of the impending installation of an IBM 7090 electronic computer that could replace human computers. She visits the computer room to learn about it, and successfully starts the machine. Later, she visits a public library, where the librarian scolds her for visiting the whites-only section, to borrow a book about Fortran. She steals the book and begins studying on her own. After teaching herself programming and training her West Area co-workers, she is officially promoted to supervise the Programming Department, bringing 30 of her co-workers with her. Mitchell eventually addresses Dorothy as \"Mrs. Vaughan,\" indicating her new-found respect.\nAs the final arrangements for John Glenn's launch are made, Katherine is reassigned back to West Area Computers. Harrison told her that they no longer need computers in their department and it's beyond his decision. As a wedding and farewell gift from her colleagues (Katherine is now married to Jim Johnson), Katherine is given a pearl necklace, the only jewelry allowed under the dress code.\nThe day of the launch, discrepancies arise in the IBM 7090 calculations for the capsule's landing coordinates, and Astronaut Glenn requests that Katherine be called in to check them. She quickly does so, only to have the door slammed in her face after delivering the results to the control room. However, Harrison gives her a security pass so they can relay the results to Glenn together. \nAfter a successful launch and orbit, the space capsule has a heat shield problem. Mission control decides to land it after three orbits instead of seven. Katherine suggests that they leave the retro-rocket attached to the heat shield for reentry. The instructions prove correct, and Friendship 7 successfully lands.\nFollowing the mission, the mathematicians are laid off and ultimately replaced by electronic computers. Katherine is reassigned to the Analysis and Computation Division, Dorothy continues to supervise the Programming Department, and Mary obtains her engineering degree and gains employment at NASA as an engineer. At the end of the film, we see Stafford, showing a change of heart, bringing Katherine a cup of coffee and accepting that her name is included on the report.\nAn epilogue reveals that Katherine calculated the trajectories for the Apollo 11 and Space Shuttle missions. In 2015 she was awarded the Presidential Medal of Freedom. The following year, NASA dedicated the Langley Research Center's Katherine G. Johnson Computational Building in her honor."}