{"_movieID": "280217", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:25", "summary": "The Lego Movie 2: The Second Part is a 2019 computer-animated adventure comedy film produced by Warner Animation Group and distributed by Warner Bros. Pictures. Directed by Mike Mitchell, it is a direct sequel to The Lego Movie (2014) and the fourth film in the franchise following the releases of 2017's The Lego Batman Movie and The Lego Ninjago Movie. The film stars Chris Pratt, Elizabeth Banks, Will Arnett, Charlie Day, Alison Brie, Nick Offerman, and Will Ferrell reprising their roles from the previous film, whilst new cast members include Tiffany Haddish, Stephanie Beatriz, and Maya Rudolph (replacing Amanda Farinos). In the film, Emmet Brickowski attempts to rescue his friends from the Systar System, while dealing with a coming cataclysm known as \"Armamageddon\".\nPlans for a sequel began in 2014 and was announced to be in the works on February 3, 2014, a few days before the release of the first film. It was announced a few months later that the film was being directed by Chris McKay while Phil Lord and Christopher Miller remained as producers. The film since underwent many changes, such as rewrites, directors, and release dates.\nThe Lego Movie 2: The Second Part was released in the United States and United Kingdom on February 8, 2019, in 2D, 3D, RealD 3D, Dolby Cinema, IMAX, and IMAX 3D formats. It received generally positive reviews from critics, who commended its humor, animation, soundtrack, and voice acting, although some said it was not as \"fresh\" as the first film. The film grossed over $191 million worldwide against a budget of $99 million, a box office disappointment compared to previous films in the series.", "plot": "Following the events of the first film, Finn's younger sister Bianca has been allowed to play with their father's Lego collection; in the LEGO universe, this is represented by the arrival of Duplo aliens. Emmet Brickowski builds the aliens a heart as a token of friendship, but one eats it and demands more. Lucy and the Master Builders interpret this as an attack and retaliate, and the ensuing battle ravages Bricksburg. President Business/Finn's father unhelpfully suggests that everyone should \"get along\" before he leaves to go golfing. Emmet tries to assure Lucy that \"Everything can still be awesome.\"\nFive years later, the now-teenaged Finn has rebuilt Bricksburg into a post-apocalyptic wasteland known as \"Apocalypseburg\", explained in the LEGO universe as the result of repeated Duplo invasions. While this new life has hardened most of the citizens, Emmet remains upbeat, building a dream home for himself and Lucy, who fears the home will invite another attack, and tells Emmet he needs to adapt to their harsh new world. Emmet has a vision of an impending cataclysm dubbed \"Armamageddon\", which he initially dismisses. A mini-doll named General Sweet Mayhem arrives looking for Apocalypseburg's leader, and captures Batman, Lucy, Benny, MetalBeard, and Unikitty and flown to the \"Systar System\" (in the real world, Bianca takes them to her room over Finn's protests). There, Queen Watevera Wa'Nabi tempts the group into supporting her; although Batman is initially tricked into agreeing to marry Wa'Nabi, the two eventually fall in love.\nMeanwhile, Emmet tries to convince the Master Builders that they need to rescue the captured characters, but they refuse to help, so he converts his house into a spaceship and travels through \"the Stairgate\" (out of the basement) where he is saved from an asteroid field by rugged adventurer Rex Dangervest. Emmet begins to toughen up by mimicking Rex, hoping to impress Lucy. Lucy and her friends are taken to a spa, but believing that the others are being brainwashed with music, Lucy escapes to find Emmet. Meanwhile, Rex and Emmet arrive in the Systar System, encountering and evading its inhabitants before finding Lucy. Concluding that the wedding is a front for Armamageddon, Emmet devises a rescue plan: Lucy will switch off the music defending the Space Temple where the wedding will take place, and Emmet will destroy the reception cake, encased in the temple, to stop the wedding. However, Mayhem explains to Lucy that the Systar System never meant to antagonize Apocalypseburg; the wedding was a way to unite their two worlds to forestall Armamageddon, as reflected by Bianca's desire to have Finn play with her. At the ceremony, Wa'Nabi reveals her original form, the heart Emmet gave the aliens, and Lucy learns that her friends were not brainwashed, but simply having fun. Realizing Rex has sinister motives, Lucy tries to stop Emmet, but, facilitated by Rex, he destroys the temple.\nEmmet realizes his mistake but is seized by Rex, knocking Lucy into the real world, where Emmet's destruction is paralleled by Finn angrily destroying Bianca's LEGO temple wedding cake. Aboard his ship, Rex reveals that he is an embittered version of Emmet from the future; abandoned for years underneath a clothes dryer after crashing in the asteroid field, he became Rex (\"Radical Emmet Xtreme\") and to save his past self, constructed a time machine. Out of bitterness over being neglected, Rex has tricked his past self into bringing about Armamageddon, which he explains what is happening in the real world right now: Bianca and Finn's mother has become fed up with their bickering and forces them to put away their LEGO sets (\"Our mama gets in\", Lucy realizes). When Emmet refuses to give up on his friends, Rex throws him under the dryer. Everything in the LEGO universe begins to crumble and fall into the dark hole of the \"Bin of Storajj\", as Finn and Bianca dismantle their creations and place them in storage bins. Discouraged, everyone sings \"Everything's Not Awesome\", but Lucy convinces them not to give up hope; Finn rebuilds the heart for Bianca, reviving Wa-Nabi and in turn restoring the LEGO universe, allowing the others to escape from the storage bin in various spacecraft to save Emmet and stop Rex. Emmet and Lucy overpower Rex and destroy his flux capacitor, preventing him from escaping. Emmet's self-acceptance causes Rex to fade from existence, and Emmet and Lucy reconcile.\nIn the real world, Finn and Bianca's mom has a change of heart upon seeing them playing together, and allows them to rebuild their LEGO creations. The LEGO universe is recreated as a mishmash of Apocalypseburg and the Systar System, dubbed \"Syspocalypstar\". President Business briefly returns and attempts to praise the inhabitants for settling their differences, but is accidentally blown out of the LEGO universe. Emmet's dream house is rebuilt, and Lucy gifts him an original album of \"Everything Is Awesome\", revealing that she co-originated the song.", "cast": "Chris Pratt as:\nEmmet Brickowski, an everyman, construction worker and inexperienced Master Builder from Bricksburg.\nRex Dangervest, a self-declared \"galaxy-defender, archaeologist, cowboy and raptor trainer.\" The character is a spoof of the action roles played by Pratt, including Star-Lord from the Marvel Cinematic Universe (with a reference to Andy Dwyer from Parks and Recreation in the actor's exercise from the latter character's body to the former's), Owen Grady from Jurassic World, and Joshua Faraday from the 2016 remake of The Magnificent Seven, and also a reference to rumors that Pratt would play Indiana Jones. He is later revealed to be Emmet's future self, having assembled a time machine from LEGO sets based on Back to the Future, Bill and Ted's Excellent Adventure, H.G. Wells’ The Time Machine, Doctor Who, The Terminator and Hot Tub Time Machine.\nElizabeth Banks as Lucy / Wyldstyle, a Master Builder.\nWill Arnett as Bruce Wayne / Batman, a DC Comics superhero who is a Master Builder.\nTiffany Haddish as Queen Watevra Wa'Nabi, the shape-shifting alien queen of the Systar System.\nStephanie Beatriz as General Sweet Mayhem, an intergalactic mini-doll who is general and law enforcer of the Systar System-Army and works under the orders of Queen Watevra Wa'Nabi.\nCharlie Day as Benny, a Master Builder who is a spaceship-obsessed 1980's spaceman. In this film, he has a metallic arm.\nAlison Brie as Unikitty, a Master Builder who is a unicorn-horned cat. In this film, instead of turning red when angry, she is red altogether. Over the years since the first film, she has developed the ability to become a giant version of herself called \"Ultrakatty\" when a battle is about to occur.\nNick Offerman as MetalBeard, a Master Builder who is a large bionic pirate with a severed head after he lost his original body in an earlier encounter with Lord Business' forces.\nJadon Sand as Finn, a young teenager in the real world, whose imagination drives the events happening in the LEGO universe.Graham Miller portrays a younger Finn\nBrooklynn Prince as Bianca, Finn's younger sister, who is the reason why the aliens from the planet Duplo attacked Bricksburg.\nMaya Rudolph as Mom, the unnamed mother of Finn and Bianca in the real world. In the LEGO universe, she's the bringer of \"Armamageddon\". She was previously voiced by Amanda Farinos in the first film.\nWill Ferrell as:\nPresident Business, the former President of the Octan corporation and the LEGO World, who served as the main antagonist of the first film.\nThe Man Upstairs, Finn & Bianca's father. Outside of re-used footage from the first film, Ferrell does not appear on-screen in this role, performing only an off-screen voiceover.\nRichard Ayoade as a talking ice cream cone who is a citizen of the Systar System and Queen Watevra Wa'Nabi's right-hand character.\nChanning Tatum as Superman, a DC Comics superhero who is one of the Master Builders.\nJonah Hill as Green Lantern, a DC Comics superhero who is one of the Master Builders.\nCobie Smulders as Wonder Woman, a DC Comics superhero who is an ambassador of the Amazon people as well as a Master Builder.\nJason Momoa as Aquaman, a DC Comics superhero who is the king of Atlantis and is also a Master Builder. Momoa reprises his role from the DC Extended Universe.\nMargot Rubin as:\nHarley Quinn, a Gotham City criminal and Master Builder. She was previously voiced by Jenny Slate in The Lego Batman Movie.\nSusan, a mini-doll who is one of Queen Watevra Wa-Nabi's servants.\nMermaid\nWonder Woman mini-doll, an inhabitant of Harmony Town.\nPanda\nIke Barinholtz as Lex Luthor, a DC Comics villain, Master Builder and the archenemy of Superman.\nRalph Fiennes as Alfred Pennyworth, a DC Comics character and Master Builder who is Batman's loyal butler. Fiennes reprises his role from The Lego Batman Movie.\nWill Forte as Abraham Lincoln, the 16th President of the United States and a Master Builder.\nBruce Willis as himself, a Lego caricature of the actor who appears in several scenes, including a running joke alluding to his character John McClane from Die Hard.\nBen Schwartz as Banarnar, a sentient banana peel who is a citizen and jester of the Systar System.\nJimmy O. Yang as Zebe, a lavender and black zebra who is a citizen and the bus driver of the Systar System.\nNoel Fielding as Balthazar, a sparkly-faced teenage vampire describing himself as an \"attractive and non-threatening teen vampire\" who is a citizen and the spa expert/DJ of the Systar System. He is a nod to Edward Cullen from The Twilight Saga.\nJorma Taccone as Larry Poppins, a male counterpart of Mary Poppins. Taccone previously voiced William Shakespeare in the first film.\nGary Payton as himself, a Lego caricature of the basketball player who Emmet encounters in Apocalypseburg.\nSheryl Swoopes as herself, a Lego caricature of the basketball player who Emmet encounters in Apocalypseburg.\nTodd Hansen as:\nGandalf, a wizard from Middle-earth and a Master Builder.\nThe Swamp Creature, a gill-man from Lego Monster Fighters and a Master Builder.\nDoug Nicholas as Chainsaw Dave / Purgatory Dave, formerly known as Surfer Dave, who is a citizen of Apocalypseburg, formerly known as Bricksburg.\nMike Mitchell as:\nSherry Scratchen-Post, a cat lady who is a citizen of Apocalypseburg, formerly known as Bricksburg.\nA royal guard that works for Queen Watevra Wa'Nabi.\nEight, an octopus who does massages and works at the spa in the Palace of Infinite Reflection.\nA Harmony Town citizen\nAn announcer\nAn Apocalypseburg warrior.\nChristopher Miller as:\nChad, a citizen of the Systar System who is the DJ of the Pop-Up Party Bus under the stage name Tempo.\nA horse\nA talking chocolate bar that resides in the Systar System.\nPlantimals, plant-like creatures in the Systar System that live in the jungles near Harmony Town.\nPaper Boy, a resident of Harmony Town.\nEmily Nordwind as Cleopatra, an Egyptian queen and Master Builder.\nChris McKay as Larry, a barista that works in Bricksburg.\nTrisha Gum as Velma Dinkley, a character from the Scooby-Doo franchise that Emmet encounters in Apocalypseburg.\nRalph Halprin as Dolphin Clock"}