{"_movieID": "351286", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:32", "summary": "Jurassic World: Fallen Kingdom is a 2018 American science fiction adventure film and the sequel to Jurassic World (2015). Directed by J. A. Bayona, it is the second installment of the planned Jurassic World trilogy, and the fifth overall installment of the Jurassic Park film series. Derek Connolly and Jurassic World director Colin Trevorrow returned as writers, with Trevorrow and the original Jurassic Park director Steven Spielberg as executive producers.\nSet on the fictional Central American island of Isla Nublar, off the Pacific coast of Costa Rica, it follows Owen Grady and Claire Dearing as they rescue the remaining dinosaurs before a volcanic eruption destroys it. Chris Pratt, Bryce Dallas Howard, B. D. Wong, and Jeff Goldblum reprise their roles from previous films in the series, with Rafe Spall, Justice Smith, Daniella Pineda, James Cromwell, Toby Jones, Ted Levine, Isabella Sermon, and Geraldine Chaplin joining the cast.\nFilming took place from February to July 2017 in the United Kingdom and in Hawaii. Produced and distributed by Universal Pictures, Fallen Kingdom premiered in Madrid on May 21, 2018, and was released internationally in early June 2018 and in the United States on June 22, 2018. The film grossed over $1.3 billion worldwide, making it the third Jurassic film to pass the billion-dollar mark, and was the third-highest-grossing film of 2018 and the 14th highest-grossing film of all-time. It received mixed reviews from critics, who praised Pratt and Howard's performances, Bayona's direction, Michael Giacchino's musical score, the visuals and the \"surprisingly dark moments\", while others suggested the series had run its course, criticizing the screenplay and predictability. An untitled sequel is set to be released on June 11, 2021, with Trevorrow returning to direct.", "plot": "A small mercenary team arrives on the abandoned Isla Nublar to collect DNA from the Indominus rex remains lying on the bottom of the park's lagoon. After collecting a bone, the team's survivors barely escape the island following attacks by the Mosasaurus and the Tyrannosaurus rex. Three years after the destruction of Jurassic World, the island's long dormant volcano, Mount Sibo, becomes active and poses a great threat to the remaining dinosaurs.A U.S. Senate hearing in Washington, D.C. debates whether Isla Nublar's dinosaurs should be saved from an impending volcanic eruption. Mathematician Dr. Ian Malcolm testifies that the dinosaurs should be allowed to perish to correct John Hammond wrongfully cloning them. Meanwhile, Jurassic World's former operations manager, Claire Dearing, has established the Dinosaur Protection Group to save the animals. After the Senate rules against rescuing the animals, Hammond's former partner, Benjamin Lockwood, summons Claire to his Northern California estate. Lockwood and his aide, Eli Mills, reveal a plan to relocate the dinosaurs to a new island sanctuary. Claire is needed to reactivate the park's dinosaur tracking system to locate the animals, particularly Blue, the last surviving Velociraptor. Though they are now estranged, Claire recruits Owen Grady, Jurassic World's former Velociraptor trainer, to help capture her.\nOn Isla Nublar, Claire and former park technician Franklin Webb reactivate the online tracking system. Owen, paleo-veterinarian Zia Rodriguez, and a mercenary team led by Ken Wheatley, track and find Blue. The encounter escalates, resulting in Blue being shot and Wheatley tranquilizing Owen. Wheatley then abandons Owen, Claire, and Franklin on the island while forcibly taking Zia hostage to treat Blue. The mercenary ship, loaded with captured dinosaurs, departs for the U.S. mainland as the remaining animals are left behind to die in the eruption. Claire, Franklin, and Owen sneak aboard the ship and help Zia transfuse Blue with Tyrannosaurus blood. The group realize that the captured dinosaurs are being transported to an unidentified location for an unknown purpose.\nAt the estate, Lockwood's orphaned pre-teen granddaughter Maisie overhears Mills and auctioneer Gunnar Eversol secretly planning to auction the captured dinosaurs on the black market. They will also unveil the Indoraptor, a new genetically-modified dinosaur created by geneticist Dr. Henry Wu using Indominus rex and Velociraptor DNA. Wu needs Blue's DNA to create an enhanced Indoraptor that is obedient to commands, unaware that Blue's blood has been contaminated. After Maisie informs Lockwood about the auction, he confronts Mills, who murders him. Maisie is later revealed to have been cloned from Lockwood's deceased daughter and to be the reason John Hammond, who opposed human cloning, ended their association.\nThe dinosaurs are transported to Lockwood's estate. Zia and Franklin narrowly evade capture, but Owen and Claire are apprehended. Owen incites a Stygimoloch into breaking open their cell. The two encounter Maisie, who leads them to the auction where the Indoraptor is being sold despite Wu's protests that it is a prototype. Owen disrupts the proceedings by luring the Stygimoloch into the room. In the ensuing chaos, Wheatley tranquilizes the Indoraptor to extract a tooth as a trophy. The hybrid feigned being sedated before killing Wheatley, Eversol, and others as it escapes. The Indoraptor then hunts Owen, Claire, and Maisie throughout the mansion until Zia releases Blue, who attacks and fights the Indoraptor. Atop a high glass roof, both animals crash through it, killing the Indoraptor and leaving Blue unharmed.\nWhen a hydrogen cyanide gas leak threatens the caged dinosaurs, Maisie frees them, despite Owen's objections. Mills attempts to flee with the Indominus rex bone but the T. rex, devours him then tramples the bone, destroying it. Owen, Claire, Maisie, Zia, and Franklin escape, while Blue and the other released dinosaurs flee the estate grounds.\nIn a new U.S. Senate hearing, Dr. Malcolm declares the beginning of a Neo-Jurassic Age, where humans and dinosaurs must coexist. The closing scenes depict the freed dinosaurs roaming wilderness and outer urban areas.", "cast": "Chris Pratt as Owen Grady: A Navy veteran and ethologist, and former Velociraptor handler for Jurassic World.\nBryce Dallas Howard as Claire Dearing: Jurassic World's former operations manager, now a dinosaur-rights activist, who has founded the Dinosaur Protection Group to save Isla Nublar's surviving dinosaurs.\nRafe Spall as Eli Mills: Lockwood's ambitious assistant who recruits Owen and Claire to rescue the dinosaurs. Speaking of his character's actions over the course of the film, Spall noted that, \"Ambition is such a powerful emotion, you can get wrapped up in it and end up doing things in order to succeed. This character believes he is doing right. He has been entrusted with pushing Lockwood's fortune into the future and making it survive after he dies. Mills feels he is simply doing what he was asked to do.\"\nJustice Smith as Franklin Webb: A former IT technician for Jurassic World who is now the Dinosaur Protection Group's systems analyst and hacker.\nDaniella Pineda as Zia Rodriguez: A former Marine who is now the Dinosaur Protection Group's paleoveterinarian.\nJames Cromwell as Sir Benjamin Lockwood: John Hammond's former partner in developing the technology to clone dinosaurs.\nToby Jones as Gunnar Eversol: An auctioneer host at Lockwood Estate who sells the Isla Nublar dinosaurs for profit. In an interview, Jones likened his character to that of \"a rogue arms dealer; he sees profits in selling these creatures as weapons. He is totally morally neutral about whatever he is selling. He is only interested in whether or not it will make him a profit.\"\nTed Levine as Ken Wheatley: A seasoned mercenary who commands the rescue operation on Isla Nublar.\nB. D. Wong as Henry Wu: The former head geneticist of both Jurassic World and the original Jurassic Park. Speaking of his character's actions, Wong stated: \"I do think he's motivated by his love for science and his own ego, which is well supported by his massive achievements ... I think he turns a blind eye to the human suffering that comes as a result because he thinks he's looking at some bigger picture.\"\nIsabella Sermon as Maisie Lockwood: Lockwood's pre-teen granddaughter and legal ward following her parents' deaths.\nGeraldine Chaplin as Iris: The Lockwood Estate housekeeper, Maisie's nanny, and protector of the Lockwood family secrets.\nJeff Goldblum as Ian Malcolm: An expert in chaos theory who once consulted for InGen's Jurassic Park. In a podcast interview, Goldblum spoke of his role \"It's small... who knows, they may cut me out entirely! But if I stay in, I'll be a sprig of parsley or a little garnish, hopefully with some impact!\" Director Bayona confirmed that Goldblum's role is simply a cameo, stating, \"He doesn't have a major role in the action but it's definitely a very meaningful one in terms of the story.\""}