{"_movieID": "133694", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:50:43", "summary": "The Promised Land (Hebrew: הארץ המובטחת‎, translit.: ha'aretz hamuvtakhat; Arabic: أرض الميعاد‎, translit.: ard al-mi'ad; also known as \"The Land of Milk and Honey\") is the land which, according to the Tanakh (the Hebrew Bible), was promised and subsequently given by God to Abraham and his descendants, and in modern contexts an image and idea related both to the restored Homeland for the Jewish people and to salvation and liberation is more generally understood.\nThe promise was first made to Abraham (Genesis 15:18-21), then confirmed to his son Isaac (Genesis 26:3), and then to Isaac's son Jacob (Genesis 28:13). The Promised Land was described in terms of the territory from the River of Egypt to the Euphrates river (Exodus 23:31). A smaller area of former Canaanite land and land east of the Jordan River was conquered and occupied by their descendants, the Israelites, after Moses led the Exodus out of Egypt (Numbers 34:1-12), and this occupation was interpreted as God's fulfilment of the promise (Deuteronomy 1:8). Moses anticipated that God might subsequently give the Israelites land reflecting the boundaries of God's original promise, if they were obedient to the covenant (Deuteronomy 19:8-9).\nThe concept of the Promised Land is the central tenet of Zionism, whose discourse suggests that modern Jews descend from the Israelites and Maccabees through whom they inherit the right to re-establish their \"national homeland\". Palestinians also claim partial descent from the Israelites and Maccabees, as well as all the other peoples who have lived in the region.The imagery of the \"Promised Land\" was invoked in African-American spirituals as heaven or paradise and as an escape from slavery, which can often only be reached by death. The imagery and term have also been used in popular culture (see Promised Land (disambiguation)), sermons and in speeches, such as the \"I've Been to the Mountaintop\" (1968) speech by Martin Luther King Jr.:\n\n\"I just want to do God's will. And He's allowed me to go up to the mountain. And I've looked over. And I've seen the Promised Land. I may not get there with you. But I want you to know tonight, that we, as a people, will get to the Promised Land. So I'm happy, tonight. I'm not worried about anything. I'm not fearing any man. Mine eyes have seen the glory of the coming of the Lord.\""}