{"_movieID": "86829", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:00:47", "summary": "Inside Llewyn Davis () is a 2013 French-American musical comedy-drama film written, directed, produced, and edited by Joel and Ethan Coen. Set in 1961, the film follows one week in the life of Llewyn Davis, played by Oscar Isaac in his breakthrough role, a folk singer struggling to achieve musical success while keeping his life in order. The supporting cast stars Carey Mulligan, John Goodman, Garrett Hedlund, F. Murray Abraham, and Justin Timberlake.\nAlthough Davis is a fictional character, the story was partly inspired by the autobiography of folk singer Dave Van Ronk. Most of the folk songs performed in the film are sung in full and recorded live. T Bone Burnett was the executive music producer. Principal photography took place in early 2012, primarily in New York City. The film was financed by StudioCanal before it would receive an American distributor.\nInside Llewyn Davis premiered at the 2013 Cannes Film Festival on May 19, 2013, where it won the Grand Prix. The film was theatrically released in France on November 6, 2013 by StudioCanal. It was given a limited release by CBS Films in the United States on December 6, 2013 before opening in a wide release on January 10, 2014. The film received critical acclaim and was nominated for two Academy Awards (Best Cinematography and Best Sound Mixing) and three Golden Globe Awards for Best Motion Picture – Comedy or Musical, Best Actor – Motion Picture Musical or Comedy (Isaac), and Best Original Song. Inside Llewyn Davis has been highly acclaimed, and was voted the eleventh best film released since 2000 by film critics in a 2016 BBC Culture poll. It was also chosen the eleventh \"Best Film of the 21st Century So Far\" in 2017 by The New York Times.", "plot": "In February 1961, Llewyn Davis is a struggling folk singer in New York City's Greenwich Village. His recent solo album Inside Llewyn Davis is not selling; he has no money and is sleeping on the couches of friends and acquaintances. After playing the Gaslight Cafe one night he is punched out in the alley behind the cafe, apparently for having cruelly heckled one of the previous evening's performers to one customer's dissatisfaction in particular--a shadowy man in hat and suit, with a discernible southern accent.\nDavis awakens in the apartment of two friends, the Gorfeins. Upon leaving, he manages to allow the to cat escape and to get himself locked out. After managing to chase down the cat, he takes him to the apartment of Jim and Jean Berkey, where Jean reluctantly agrees to allow Davis to stay the night, despite already having promised as much to another aspiring folk singer/songwriter, Troy Nelson, a young military man stationed at nearby Fort Dix. Jean informs Davis that she is pregnant, and that there is a possibility the child is Davis's. The following morning, Davis manages to allow the Gorfeins' cat to escape the Berkey's apartment. Later, Jean asks Davis to pay for an abortion, though she is upset it may be Jim's child she is losing.\nDavis then pays his sister a visit, hoping to borrow money. What she gives him instead is a box of his belongings, which he promptly tells her to leave outside by the curb. She mentions that he could make money by returning to the Merchant Marine. On Jim's invitation, Davis records a space travel-themed novelty song with Jim and Al Cody. Needing money for the abortion, Davis agrees to an immediate $200 rather than royalties. With the proceeds Davis looks to set up the appointment for Jean to have her abortion, only to learn that payment will not be necessary, as he has credit with the gynecologist's office due to already having paid for the identical procedure two years prior on behalf of another woman who elected in the end neither to go to through with the abortion nor to inform Davis of her decision.\nWhile talking to Jean at a café, Davis observes what he believes to be the Gorfeins' cat, captures it, and returns it to them that evening. Asked to perform a song after dinner, he reluctantly plays \"Fare Thee Well\", a song he had recorded with his old partner Mike. When Mrs. Gorfein starts to sing Mike's harmony, Davis becomes angry and yells at her. Mrs. Gorfein leaves the table crying, then returns with the cat, having realized it is the wrong gender and thus obviously not theirs. Davis leaves, taking the cat with him.\nDavis rides with two musicians driving to Chicago: the laconic beat poet Johnny Five and the odious jazz musician Roland Turner. During the trip Davis discloses that his musical partner, Mike Timlin, died by suicide.\nAt a roadside restaurant, Roland collapses from a heroin overdose. The three stop on the side of the highway to rest. When a police officer tells them to move on, he suspects that Johnny is drunk and tells him to get out of the car. Johnny resists and is arrested. Without the keys, Davis abandons the car, leaving the cat and the unconscious Roland behind. In Chicago, Davis auditions for Bud Grossman, who says Davis is not suited as a solo performer but suggests he might incorporate him in a new trio he is forming. Davis rejects the offer and hitchhikes back to New York. Driving, he hits what he fears may be the same cat.\nBack in New York, Davis uses his last $148 for back dues to rejoin the Merchant Marine union, and visits his ailing father. He searches for his seaman's license so he can ship out with the Merchant Marine, but it had been in the box he'd instructed his sister to trash. Davis returns to the Union Hall to replace it, but cannot afford the $85 fee. He visits Jean and she tells him she got him a gig at the Gaslight.\nAt the Gaslight, Davis learns that Pappi, the manager, also had sex with Jean. Enraged, Davis heckles a woman as she performs on stage and is thrown out. He goes to the Gorfeins' apartment, where they graciously welcome him. There, he learns that the novelty song is likely to be a major hit, with massive royalties. He is amazed to see that their actual cat, Ulysses, has found his way home.\nReturning to an expanded version of the film's opening scene, Davis performs at the Gaslight. Pappi teases Davis for his heckling the previous evening's singer and tells him that a friend of his is waiting in the alley. As he leaves, Davis watches a young Bob Dylan perform. Behind the Gaslight, Davis is beaten by the shadowy suited man for having cruelly heckled his wife, the previous night's performer. Davis watches as the man leaves in a taxi, bidding him \"Au revoir\"."}