{"_movieID": "338952", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:48:53", "summary": "Fantastic Beasts: The Crimes of Grindelwald is a 2018 fantasy film directed by David Yates and written by J. K. Rowling. A joint British and American production, it is the sequel to Fantastic Beasts and Where to Find Them (2016). It is the second instalment in the Fantastic Beasts film series, and the tenth overall in the Wizarding World franchise, which began with the Harry Potter film series. The film features an ensemble cast that includes Eddie Redmayne, Katherine Waterston, Dan Fogler, Alison Sudol, Ezra Miller, Zoë Kravitz, Callum Turner, Claudia Kim, William Nadylam, Kevin Guthrie, Jude Law, and Johnny Depp. The plot follows Newt Scamander and Albus Dumbledore as they attempt to take down the dark wizard Gellert Grindelwald, while facing new threats in a more divided wizarding world.\nA second Fantastic Beasts film was announced in October 2014, and in July 2016 Rowling confirmed she had completed the script. Depp was cast in November 2016, causing some controversy due to domestic violence allegations recently made against him, and Law signed on in April 2017. Principal photography began in July 2017, at Warner Bros. Studios, Leavesden in Hertfordshire. Filming also took place in London, Switzerland, and Paris, and wrapped in December 2017.\nFantastic Beasts: The Crimes of Grindelwald premiered in Paris on 8 November 2018 and was released worldwide on 16 November 2018, in Real D 3D, Dolby Cinema, IMAX and ScreenX, by Warner Bros. Pictures. The film grossed $653 million worldwide, becoming the tenth highest-grossing film of 2018 but the lowest-grossing instalment of the Wizarding World franchise. It received mixed reviews from critics, who praised its entertainment value, as well as the direction and performances (particularly from Law and Depp), but criticised the \"needlessly complicated, low-stakes plot\" while feeling that it was \"overburdened\" with details setting up future sequels.Fantastic Beasts: The Crimes of Grindelwald was nominated for two awards at the 72nd British Academy Film Awards in the categories of Best Production Design and Best Special Visual Effects. An untitled third film is scheduled for release in November 2021.", "plot": "In 1927, the Magical Congress of the United States of America (MACUSA) is transferring the powerful dark wizard Gellert Grindelwald to Europe to be tried for his crimes. But Grindelwald escapes with the aid of  MACUSA employee Abernathy.\nThree months later at the Ministry of Magic in London, Newt Scamander, while working to have his travel ban removed, runs into Leta Lestrange, an old Hogwarts classmate and fiancée to his Auror brother, Theseus. The Ministry agree to grant Newt's request on the condition that he aids Theseus in locating Credence Barebone in Paris. Newt declines after learning he is to work with the Auror Grimmson. Later, after being reprimanded by the Ministry for his recent actions, Albus Dumbledore meets with Newt and is revealed to have indirectly sent his former student to America to release Frank the Thunderbird. Dumbledore requests Newt to reach Paris and save Credence from Grindelwald and the Ministry, both believing him to be Leta's long lost brother Corvus Lestrange.\nNewt soon gets an unexpected visit from his American friends Queenie Goldstein and Jacob Kowalski, the latter having retained most of the memories that were erased at the end of the previous film. Queenie reveals that Tina is seeing other people after reading an issue of Spellbound magazine that incorrectly reported that Newt was betrothed to Leta. Newt then deduces that Queenie enchanted Jacob into eloping to circumvent the MACUSA's marriage ban between wizards and non-magical humans. After Newt lifts the charm, Jacob rejects the idea of marrying Queenie out of fear of the consequences she would face, which prompts the upset Queenie to leave to find Tina. Newt and Jacob follow her to Paris after learning Tina is there in search of Credence.\nIn Paris, Tina searches for Credence at the Circus Arcanus. Credence and a female circus freak named Nagini escape after causing a distraction. While searching for Credence's birth mother, he and Nagini locate a half-elf servant called Irma Dugard who placed him for adoption. However Grimmson, who is revealed to be a follower of Grindelwald, arrives and kills Irma. Meanwhile, Tina meets Yusuf Kama, who is also hunting Credence. Newt and Jacob follow Yusuf to Tina, and Yusuf explains that he made an Unbreakable Vow to kill his brother, whom he believes to be Credence. Meanwhile, unable to find Tina, a distraught Queenie is found by one of Grindelwald's followers and brought to him. Grindelwald is aware of Queenie's Legilimens ability, allowing her to leave while manipulating her into joining him in order to marry Jacob.\nNewt and Tina infiltrate the French Ministry of Magic for documents to confirm Credence's identity but Leta and Theseus discover them. Newt and Tina reconcile after he explains he was never engaged to Leta. Their search for information about Credence leads them to the Lestrange family tomb, where they find Yusuf. Yusuf reveals that he is carrying out his father's request to avenge the death of his mother Laurena Kama, who was kidnapped by Corvus's father, who used the Imperius Curse on her, and who died giving birth to Corvus' sister, Leta. But Leta reveals that she unintentionally caused her brother's death by switching him with an infant Credence while en route to America. The group then realize they fell into Grindelwald's trap, finding themselves at his rally, where Queenie is among his followers.\nAt the rally, Grindelwald shows images of an upcoming global war, and rails against the Ministry's laws that prohibit them from preventing such a tragedy from occurring. When Theseus and the Aurors then surround the rally, Grindelwald prompts his followers to disperse across Europe to spread his message. Grindelwald then casts a circle of blue fire that kills his enemies while allowing his most loyal followers, as well as Credence and Queenie, to join him. Leta sacrifices herself to hold off Grindelwald so Newt, Tina, Jacob, Yusuf, Nagini, and Theseus can escape. As Grindelwald leaves, the remaining heroes unite alongside the immortal alchemist Nicolas Flamel to subdue and extinguish the fire. Newt realises that he is now embroiled in a conflict with Grindelwald, and can no longer avoid fighting his enemies.\nAt Hogwarts, Newt gives Dumbledore a vial that his Niffler stole from Grindelwald, revealed to contain a blood pact which Grindelwald and Dumbledore made in their youth that prevents them from dueling each other as Dumbledore believes he can destroy it. At his Nurmengard base in Austria, acting on Queenie's advice to win the youth over, Grindelwald reveals Credence's true identity as Aurelius Dumbledore, Albus' long-lost brother and the only person powerful enough to defeat him.", "cast": "Eddie Redmayne as Newt Scamander:A British Ministry of Magic employee in the Beasts Division of the Department for the Regulation and Control of Magical Creatures, as well as a self-proclaimed magizoologist. He played a part in remedying the events of a violent attack on the City of New York in December 1926 involving dark wizard Gellert Grindelwald. He is a confidant of Albus Dumbledore, despite being an outcast from certain circles of British Wizarding society due to his checkered past. Joshua Shea portrays a young Newt.Katherine Waterston as Tina Goldstein:A promoted MACUSA (Magical Congress of the United States of America) Auror. She played a role in thwarting Gellert Grindelwald during the Obscurus incident of 1926, for which she and Newt were initially blamed.Dan Fogler as Jacob Kowalski:A No-Maj veteran of World War I and current business owner of a bakery, a friend of Newt's, and the primary love interest to Queenie.Alison Sudol as Queenie Goldstein:The pretty and vivacious younger sister of Tina, who worked alongside her in the Federal Wand Permit Bureau after Tina was once demoted. She is a powerful natural Legilimens, and has fallen in love with Jacob Kowalski, despite wizarding laws forbidding relationships with No-Majs.Ezra Miller as Credence Barebone:The disturbed adopted child of Mary-Lou Barebone, severely abused and downtrodden. Enraged by people's treatment of him, during the incident of 1926 he set his Obscurus parasite loose on the City of New York, causing widespread destruction. He survived in a tiny Obscurus fragment, and is now sought by Grindelwald.Zoë Kravitz as Leta Lestrange:An emotionally damaged and confused young woman who still exerts some control over Newt, who was once in love with her, and possibly still is. Ostracized while a fellow Hogwarts student, she was befriended by a young Newt. She is descended from a historically wealthy, pureblood family infamous for embracing the Dark Arts. She is currently engaged to Theseus Scamander, Newt's brother, and is now working at the British Ministry of Magic as the assistant to Torquil Travers, the Head of Magical Law Enforcement. Thea Lamb and Ruby Woolfenden both portray young versions of Leta.Callum Turner as Theseus Scamander:Newt Scamander's older brother who works in the Auror Office of the Department of Magical Law Enforcement, fought in World War I, and is described as a \"war hero\". The two brothers share a tentatively warm relationship, slightly marred by their disparate personalities and beliefs. He spent the previous year hunting Grindelwald with a team of British Aurors. Theseus is currently engaged to Leta Lestrange.Carmen Ejogo as Seraphina Picquery, the President of MACUSA\nClaudia Kim as Nagini:The main attraction of a wizarding circus and freak show called Circus Arcanus and a Maledictus, who carries a blood curse that will eventually transform her into a snake permanently. For as long as she can remember, Skender has exploited her transformative powers. Nagini befriends Credence Barebone, who works as a menial worker at the circus. Nagini will eventually become the infamous companion of Lord Voldemort.William Nadylam as Yusuf Kama:A French-Senegalese wizard who has spent many years obsessively searching for Credence and has finally tracked him down in Paris at Circus Arcanus. Isaac Domingos portrays a young Yusuf.Kevin Guthrie as Abernathy:Tina and Queenie's previous MACUSA supervisor, now a loyal follower of Grindelwald.Jude Law as Albus Dumbledore:An extremely influential and powerful wizard in the British Wizarding Community, known in the British Ministry of Magic and throughout the wider wizarding world for his academic brilliance, currently a professor of Defence Against the Dark Arts at Hogwarts School of Witchcraft and Wizardry. As a teenager, he and Grindelwald had become friends. A strong ally of Newt Scamander's, he is called to resist Grindelwald's reign of terror. Toby Regbo reprises his role from Harry Potter and the Deathly Hallows – Part 1 as a young Dumbledore.Johnny Depp as Gellert Grindelwald:An infamous powerful dark wizard who caused mass violence, terror and chaos around the globe, seeking to lead a new Wizarding World Order based on his strong belief in wizarding superiority. As a teenager, he and Dumbledore had become friends. Escapes from the MACUSA in New York and renews his efforts for Pureblood world domination. It was Depp's idea for the character's heterochromia, saying that he saw Grindelwald as \"more than one... almost as though he was two people.\" Jamie Campbell Bower reprises his role from Harry Potter and the Deathly Hallows – Part 1 as a young Grindelwald.Brontis Jodorowsky portrays Nicolas Flamel, a 14th-century, 600-year-old Parisian scribe and alchemist believed to have discovered the Philosopher's Stone, who is a friend and colleague of Dumbledore. The character was mentioned previously in Harry Potter and the Philosopher's Stone. Fiona Glascott portrays a young Minerva McGonagall. Poppy Corby-Tuech portrays Vinda Rosier, Grindelwald's loyal right-hand follower. Ingvar Eggert Sigurðsson portrays Grimmson, a powerful bounty hunter. Ólafur Darri Ólafsson portrays Skender, the cruel head and ringmaster of Circus Arcanus. David Sakurai appears as Krall, Grindelwald's ambitious and sulky henchman. Victoria Yeates portrays Bunty, Newt Scamander's assistant. Jessica Williams portrays Eulalie \"Lally\" Hicks, a professor of Ilvermorny School of Witchcraft and Wizardry who contacts Flamel. Isaura Barbé-Brown portrays Laurena Kama, Leta Lestrange's mother. Derek Riddell, Wolf Roth and Cornell John portray Torquil Travers, Spielman and Arnold Guzman, respectively."}