{"_movieID": "44833", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:28", "summary": "A battleship is a large armored warship with a main battery consisting of large caliber guns. During the late 19th and early 20th centuries the battleship was the most powerful type of warship, and a fleet of battleships was considered vital for any nation that desired to maintain command of the sea.\nThe term battleship came into formal use in the late 1880s to describe a type of ironclad warship, now referred to by historians as pre-dreadnought battleships. In 1906, the commissioning of HMS Dreadnought into the United Kingdom's Royal Navy heralded a revolution in battleship design. Subsequent battleship designs, influenced by HMS Dreadnought, were referred to as \"dreadnoughts\", though the term eventually became obsolete as they became the only type of battleship in common use.\nBattleships were a symbol of naval dominance and national might, and for decades the battleship was a major factor in both diplomacy and military strategy. A global arms race in battleship construction began in Europe in the 1890s and culminated at the decisive Battle of Tsushima in 1905, the outcome of which significantly influenced the design of HMS Dreadnought. The launch of Dreadnought in 1906 commenced a new naval arms race. Three major fleet actions between steel battleships took place: the long range gunnery duel at the Battle of the Yellow Sea in 1904, the decisive Battle of Tsushima in 1905, both, during the Russo-Japanese War, and the inconclusive Battle of Jutland (1916) during the First World War. Jutland was the largest naval battle and the only full-scale clash of dreadnoughts of the war, it was the last major battle in naval history fought primarily by battleships.The Naval Treaties of the 1920s and 1930s limited the number of battleships, though technical innovation in battleship design continued. Both the Allied and Axis powers built battleships during World War II, though the increasing importance of the aircraft carrier meant that the battleship played a less important role than had been expected.\nThe value of the battleship has been questioned, even during their heyday. There were few of the decisive fleet battles that battleship proponents expected, and used to justify the vast resources spent on building battlefleets. Even in spite of their huge firepower and protection, battleships were increasingly vulnerable to much smaller and relatively inexpensive weapons: initially the torpedo and the naval mine, and later aircraft and the guided missile. The growing range of naval engagements led to the aircraft carrier replacing the battleship as the leading capital ship during World War II, with the last battleship to be launched being HMS Vanguard in 1944. Four battleships were retained by the United States Navy until the end of the Cold War for fire support purposes and were last used in combat during the Gulf War in 1991. The last battleships were stricken from the U.S. Naval Vessel Register in the 2000s."}