{"_movieID": "20352", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:57:27", "summary": "Despicable Me is a 2010 American 3D computer-animated comedy film produced by Illumination Entertainment as its debut film and project and distributed by Universal Pictures. The film was animated by the French animation studio Mac Guff, which was later acquired by Illumination. Directed by Pierre Coffin and Chris Renaud in their directorial debuts with a story by Sergio Pablos, the title references the main character as he refers to himself and is accompanied by a song by Pharrell Williams.\nThe film stars Steve Carell as the voice of Gru, a supervillain who adopts three girls (voiced by Miranda Cosgrove, Dana Gaier, and Elsie Fisher) from an orphanage; and the voice of Jason Segel as Vector, a rival of Gru who steals the Great Pyramid of Giza. When Gru learns of Vector's heist, he plans an even greater heist: to shrink and steal Earth's moon. However, despite Gru's villainous intentions, he grows increasingly touched by the girls' growing love for him and finds himself changing for the better because of it.\nReleased theatrically on July 9, 2010 in the United States, Despicable Me grossed over $546 million worldwide against a budget of $69 million. It launched the Despicable Me franchise series of films, including the sequel Despicable Me 2 in 2013, another sequel, Despicable Me 3 in 2017, and two prequels; Minions, released in 2015, and Minions: The Rise of Gru in 2020, which features Gru's Minions as the main characters.", "plot": "A supervillain named Gru has his pride injured when an unknown rival steals the Great Pyramid of Giza. With the assistance of his sidekick Dr. Nefario and his Minions, Gru resolves to one-up this mysterious rival by shrinking and stealing the Moon. Knowing this is extremely expensive, Gru seeks a loan from the Bank of Evil. Mr. Perkins - the bank president - is impressed by the plan, but he will approve the loan only if Gru can obtain the necessary shrink ray first. Upon learning that an up-and-coming villain known as Vector was responsible for the Pyramid theft, Gru openly displays a rivalry with him.\nGru and the Minions steal the shrink ray from a secret testing base in East Asia, but Vector intercepts them and steals it for himself. Gru attempts to break into Vector's impregnable fortress to recover the shrink ray, only to be defeated by numerous kinds of traps. As nothing seems to work, he notices three orphan girls; Margo, Edith, and Agnes, who are able to easily enter the base as they are selling cookies. Gru disguises himself and adopts the girls, planning to use them to infiltrate Vector's base. However, Gru has trouble nurturing them properly due to their stubbornness, their ballet classes and his own ineptitude as a parent.\nEventually, Gru and the girls arrive at Vector's base, and Gru successfully steals back the shrink ray. The girls then suggest a day at a theme park. Gru agrees, believing he can abandon the girls there; but as he cannot, he begins to bond with them instead. Later, Gru contacts Perkins via video chat, stating that he finally has the shrink ray. Margo, Edith, and Agnes interrupt the meeting, and Perkins announces that he has lost confidence in Gru and will no longer fund his operations. As Gru tells the Minions he can no longer pay them for their services, the girls offer the contents of their piggy bank. With his Minions and himself inspired, Gru sells parts of his lair and the items he stole over the years to construct a spacecraft. Gru plans to steal the Moon when it is nearest to Earth, but this is the same day as the girls' ballet recital. As Gru becomes conflicted, Dr. Nefario arranges for the girls to be returned to the orphanage, thinking the recital may ruin the plan. At the same time, Perkins informs his son – Vector - of Gru's possession of the shrink ray and the adoption of the three girls, encouraging Vector to take action.\nGru successfully shrinks and steals the Moon. He rushes back to Earth to attend the recital, only to find a ransom note from Vector, who has kidnapped the girls. After arriving at Vector's base, Gru surrenders the Moon. However, Vector reneges on the deal and, after failing to stop Gru's advance, flies off with the girls and the Moon. Meanwhile, Dr. Nefario has discovered that the effects of the shrink ray are temporary: the bigger the object is, the faster it recovers its original size. Gru, Dr. Nefario, and the Minions execute a daring mid-air rescue of the girls, just before the Moon destroys Vector's spaceship and launches itself back into orbit, along with Vector on it.\nSometime later, Gru re-adopts the girls, writing them a bedtime storybook based on his own experience. The girls perform their ballet recital for Gru, his mother Marlena, Dr. Nefario, and the Minions, only for one of the Minions to switch the music to something more modern, ending the film in a dance party.", "cast": "Steve Carell as Gru, a mean supervillain-turned-good-natured adoptive father\nJason Segel as Victor \"Vector\" Perkins, Mr. Perkins' son and Gru's archenemy\nRussell Brand as Dr. Nefario, Gru's elderly gadget man and a friendly scientist\nMiranda Cosgrove as Margo, the oldest of the three girls\nDana Gaier as Edith, the middle child of the three girls\nElsie Fisher as Agnes, the youngest of the three girls\nWill Arnett as Mr. Perkins, the President of the Bank of Evil and Vector's father\nKristen Wiig as Miss Hattie, owner of the orphanage Miss Hattie's Home for Girls\nJulie Andrews as Marlena, Gru's mother\nPierre Coffin as Kevin, Tim, Bob, Mark, Phil and Stuart, six of Gru's Minions\nChris Renaud as Dave, one of Gru's Minions\nJemaine Clement as Jerry, one of Gru's Minions\nJack McBrayer as a Carnival Barker\nMcBrayer also voices a Tourist, who is Justin's Father\nDanny McBride as Fred McDade, Gru's neighbor\nMindy Kaling as a Tourist, who is Justin's mother\nRob Huebel as an anchorman\nKen Daurio as an Egyptian guard\nKen Jeong as a talk-show host"}