{"_movieID": "19959", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:54:44", "summary": "Surrogates is a 2009 American science fiction mystery film, based on the 2005–2006 comic book series The Surrogates. Directed by Jonathan Mostow, it stars Bruce Willis as Tom Greer, an FBI agent who ventures out into the real world to investigate the murder of surrogates (humanoid remote controlled robots). It also stars Radha Mitchell, Rosamund Pike, Boris Kodjoe, Ving Rhames, and James Cromwell.\nThe film's main concept centers on the mysterious murder of a college student linked to the man who helped create a high-tech surrogate phenomenon that allows people to purchase remote-controlled humanoid robots through which they interact with society. These fit, attractive, remotely controlled robots ultimately assume their life roles, enabling people to experience life vicariously from the comfort and safety of their own homes. Surrogates was released on September 25, 2009, in the United States and Canada. It received mixed reviews from critics and grossed over $122 million.\n\n", "plot": "In the future, widespread use of remotely controlled androids called \"surrogates\" enables everyone to live in idealized forms from the safety of their homes. Compared to their surrogates, the human operators are depicted as slovenly and homebound. Protected from harm, a surrogate's operator feels no pain when the surrogate is damaged. In Boston, FBI agent Tom Greer has been estranged from his wife Maggie, since their son's death several years before. He never sees her outside of her surrogate and she criticizes his desire to interact via their real bodies.\nTom and his partner, Agent Jennifer Peters, investigate the death of two people who were killed when their surrogates were destroyed at a Fort Point club. Jarid Canter (Shane Dzicek), one of the victims, is the son of Dr. Lionel Canter, the inventor of surrogates and the former head of their manufacturing company, Virtual Self Industries (VSI). The two determine that a human, Miles Strickland, used a new type of weapon to overload the surrogates' systems and kill their operators. After locating Strickland, Tom attempts to bring him into custody. Strickland uses the weapon and injures Tom during the chase; Tom inadvertently crash-lands into an anti-surrogate zone known as the Dread Reservation (one of many throughout the US). A mob of humans destroys Tom's surrogate. The Dread leader known as the Prophet kills Strickland and confiscates the weapon.\nWith his surrogate destroyed, Tom is forced to interact in the world without one. He learns that VSI originally produced the weapon, designed to load a virus that overloads a surrogate's systems, thus disabling it, under a government contract. Unexpectedly, the weapon also disabled the fail-safe protocols protecting operators. The project was promptly scrapped and all prototypes supposedly destroyed. Tom also learns that Andrew Stone, his FBI superior, supplied the weapon to Strickland and ordered Dr. Canter's assassination, upon VSI's request, for his criticism of surrogate use. Jarid, using one of his father's many surrogates, was killed instead. Jennifer is murdered in her own home by an unknown man who hijacks her surrogate, and the Prophet orders the weapon delivered to her. During a military raid on the reservation, the Prophet is shot, revealing his identity as a surrogate, with Canter himself as the operator. Tom steals the weapon's codes from Stone, but \"Jennifer\" escapes with the codes.\nImmediately travelling to Canter's home, Tom discovers that Canter has been controlling not only the Prophet, but Jennifer as well. Using Jennifer's surrogate in FBI Headquarters, Canter uses the weapon to kill Stone and proceeds to upload the virus to all surrogates, which will destroy them and kill their operators. Canter reveals that he only wanted to empower the disabled to live normal lives, but after he was fired from VSI, they capitalized on surrogacy for profit. Convinced his plan is unstoppable, Canter disconnects from Jennifer's surrogate and swallows a cyanide pill. Tom takes control of Jennifer's surrogate and, with the assistance of the network's system administrator, Bobby Saunders, insulates the virus so the operators will survive, but a second step is required to save the surrogates. After a moment of consideration, Tom chooses to let the virus permanently disable surrogates worldwide. With all the surrogates disabled, people emerge from their homes, confused and afraid.\nReturning home, Tom shares an emotional embrace with Maggie in her real form. The film ends with an aerial view of the collapsed surrogates along with overlapping news reports of downed surrogates all over the world and how people are now \"on their own\" again.", "cast": "Bruce Willis as Thomas \"Tom\" Greer, an FBI agent investigating the mysterious murder of a college student linked to the high-tech surrogate phenomenon.\nRadha Mitchell as Jennifer Peters, Tom Greer's FBI partner.\nRosamund Pike as Maggie Greer, Tom Greer's wife.\nJack Noseworthy as Miles Strickland, a man hired to kill Lionel Canter.\nJames Cromwell as Dr. Lionel Canter, the inventor of the surrogates. He's planning on to destroy them after his son was murdered by the assassin.\nVing Rhames as The Prophet, a cult figure who disdains surrogates.\nBoris Kodjoe as Andrew \"Andy\" Stone, Peters' and Greer's supervisor at the FBI. He's the one who sent Strickland to kill Canter, but instead kill his son by mistake.\nJames Francis Ginty as Canter Surrogate, a surrogate that belonged to Lionel Canter's son.\nTrevor Donovan as Surrogate Tom Greer\nMichael Cudlitz as Colonel Brendon, an Army colonel in charge of finding a weapon built by VSI as dangerous to other operators.\nDevin Ratray as Bobby Saunders, the administrator of the FBI computer system that controls the surrogate network.\nHelena Mattsson as JJ, a blonde female surrogate.\nShane Dzicek as Jarod Canter, Dr. Lionel Canter's son. He was murdered by an assassin from VSI.\nDr. Hiroshi Ishiguro as himself (cameo performance)\nDr. Takeo Kanade as himself (cameo performance)"}