{"_movieID": "37834", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:51", "summary": "Knight and Day is a 2010 American action comedy film starring Tom Cruise and Cameron Diaz. The film, directed by James Mangold, was the second on-screen collaboration of Cruise and Diaz, following the 2001 film Vanilla Sky. Diaz plays June Havens, a classic car restorer who unwittingly gets caught up with the eccentric secret agent Roy Miller, played by Cruise, who is on the run from the CIA.\nThe film's investors offset funding costs by paying Cruise a lower advance fee and providing him a share of revenue only after the financiers were repaid their investment in the production. Filming took place in several locations, mainly in several cities located in Massachusetts, while other scenes were filmed in Spain and parts of Austria.\nKnight and Day was released in the United States on June 24, 2010. The film received mixed reviews from film critics. It grossed over $261 million worldwide, recouping its $117 million budget.\nThe film was remade in Bollywood as Bang Bang!, released October 2, 2014, with Hrithik Roshan and Katrina Kaif in the lead roles.", "plot": "Returning home to Boston from buying car parts in Wichita, June Havens (Cameron Diaz) collides with Roy Miller (Tom Cruise) at the airport, twice, and is bumped to a later flight. CIA Agent John Fitzgerald (Peter Sarsgaard), believing June is working with Roy, puts her back on the plane. While June is in the plane’s restroom, Roy subdues the passengers and flight crew, all agents sent by Fitzgerald, and crash-lands the plane in a cornfield. He drugs the shocked June, warning that agents will come after her.\nWaking at home, June prepares for her sister April’s (Maggie Grace) wedding, and learns she wants to sell their father's 1966 Pontiac GTO tri-power, which June had planned to restore as a wedding gift. June is picked up by Fitzgerald and his agents. Roy appears, killing numerous agents in a highway chase and rescuing June. She flees to her ex-boyfriend Rodney (Marc Blucas), a firefighter, before Roy arrives and pretends to take June hostage.\nRoy persuades June that she is safer with him, and reveals that he is in possession of the Zephyr, a perpetual energy battery; he had been assigned to guard its inventor, Simon Feck, until Fitzgerald tried to steal the battery, framing Roy. In Brooklyn, June and Roy discover Feck has gone into hiding but left Roy a clue that he is in the Alps. They are attacked by henchmen sent by Spanish arms dealer Antonio Quintana (Jordi Mollà). Drugged again, June drifts in and out of consciousness as they are captured and then escape to Roy’s off-the-grid island. Accepting a call from her sister, June accidentally leads Quintana's men to the hideaway. Escaping Quintana’s unmanned aerial assault vehicle in a helicopter, Roy knocks June out to circumvent her fear of flying.\nJune wakes up aboard a train in Austria, where Roy has reunited with Simon, and they manage to kill Bernard (Falk Hentschel), an assassin hired by Quintana. After checking into a hotel in Salzburg, June follows Roy to a meeting with Naomi (Gal Gadot), Quintana's henchwoman, where he offers to sell the Zephyr.\nFitzgerald and C.I.A. Director Isabel George (Viola Davis) find June and reveal that Roy used her at the airport to smuggle the Zephyr past security. Heartbroken, June leads the C.I.A. to the hotel. Fleeing across the rooftops, Roy is shot and falls into the river with the Zephyr. Simon is kidnapped from C.I.A. custody by Fitzgerald, the real traitor, to be delivered to Quintana in Spain.\nReturning home, June attends her sister’s wedding, and visits an address Roy had been monitoring, where she meets his parents and learns his real name is Matthew Knight. They believe their son, an Army sergeant and Eagle Scout, was killed in action, and have won various lotteries and sweepstakes they do not remember entering. Leaving a message on her own answering machine declaring that she has the Zephyr, June is taken by Quintana's men to Sevilla. Drugged with a prototype truth serum, June explains that Roy's deal with Quintana was meant to alert the C.I.A. so June would be returned home safely in time for the wedding. Roy, tracking Fitzgerald, rescues June, and leads Quintana and his men on a car chase. Quintana is killed by a bull stampede, and Roy trades Fitzgerald the Zephyr for Simon. Fitzgerald shoots Simon anyway, but Roy takes the bullet instead. Simon reveals that the battery is unstable, and it explodes, killing Fitzgerald.\nRoy is hospitalized in Washington, D.C., where George tells him June has moved on, and welcomes him back to the C.I.A.; however, George’s coded language – as Roy explained to June earlier – reveals that he will be killed. June, disguised as a nurse, drugs Roy and breaks him out of the hospital. Waking up in June’s rebuilt GTO, Roy and June drive toward Cape Horn, and Roy's parents unexpectedly receive their own tickets to Cape Horn."}