{"_movieID": "400650", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:09:44", "summary": "Mary Poppins Returns is a 2018 American musical fantasy film directed by Rob Marshall, with a screenplay written by David Magee and a story by Magee, Marshall, and John DeLuca. Based on the book series Mary Poppins by P. L. Travers, the film is a sequel to the 1964 film Mary Poppins, and stars Emily Blunt as Mary Poppins, with Lin-Manuel Miranda, Ben Whishaw, Emily Mortimer, Julie Walters, Dick Van Dyke, Angela Lansbury, Colin Firth, and Meryl Streep in supporting roles. Set in 1930s London, twenty-five years after the events of the original film, the film sees Mary Poppins, the former nanny of Jane and Michael Banks, returning one year after a family tragedy.\nWalt Disney Pictures announced the film in September 2015. Marshall was hired later that month, and Blunt and Miranda were cast in February 2016. Principal photography lasted from February to July 2017, and took place at Shepperton Studios in Surrey, England. Mary Poppins Returns held its world premiere at the Dolby Theatre in Los Angeles on November 29, 2018, and was released in the United States on December 19, 2018, making it one of the longest intervals between film sequels in cinematic history, at 54 years.The film has grossed over $349 million worldwide and received generally positive reviews from critics, who praised its acting (particularly Blunt), direction, musical score, musical numbers, costume design, production values, visuals, and sense of nostalgia, although some critics found it derivative of its predecessor. It was chosen by both the National Board of Review and American Film Institute as one of the top ten films of 2018 and received numerous award nominations, including four at the 76th Golden Globe Awards (including for Best Motion Picture – Musical or Comedy), nine at the 24th Critics' Choice Awards, three at the 72nd British Academy Film Awards, and a SAG Award nomination for Blunt at the 25th Screen Actors Guild Awards. It also received four Academy Award nominations for Best Original Score, Best Original Song (\"The Place Where Lost Things Go\"), Best Production Design, and Best Costume Design at the 91st Academy Awards.", "plot": "In 1930s London, Michael Banks lives in his childhood home with his three children, Annabel, John, and Georgie, after the death of his wife a year earlier. Michael has taken a loan from his employer, the Fidelity Fiduciary Bank, and is three months behind on payments. Wilkins, the bank's corrupt new chairman, sends associates to warn him that his house will be repossessed if the loan is not repaid in full by Friday. Michael and his sister Jane recall that their father left them shares in the bank that should cover the loan, and they search the house for the share certificate. During the search, Michael finds his childhood kite and disposes of it.\nWhile out in the park with Annabel and John, Georgie finds the kite and flies it. Mary Poppins descends from the sky with the kite in her hand. She takes the children home and announces that she will take charge of them as their nanny. She draws a bath for the three children, which leads to an underwater adventure.\nMichael visits the bank seeking proof of his shares, but Wilkins denies that there are any records before covertly destroying the page from the official ledger. Annabel and John decide to sell their mother's 'priceless' bowl to pay off the debt. Georgie tries to stop them, and the bowl becomes damaged while the three fight over it. Jack, a lamplighter, greets Mary Poppins and joins her and the children on a trip into the scene decorating the bowl. During their visit to the Royal Doulton Music Hall, Georgie is kidnapped by a talking wolf, weasel, and badger who are repossessing their belongings, and Annabel and John set out to rescue him. They do so successfully, then fall off the edge of the bowl and wake in their beds, initially thinking that their experience was a dream but later realizing that it was real.\nThe next day, Mary Poppins and the children visit her cousin Topsy to get the bowl mended, and learn that it has little monetary value. They visit the bank to bring Michael his briefcase, but when the children approach Wilkins's office to ask for help they overhear him planning to repossess their house. Believing that Wilkins and his associates are the same animal gang who kidnapped him, Georgie interrupts the meeting. Michael becomes angry with the children for putting the house and his job at risk. Mary Poppins takes the children home, guided by Jack and his fellow lamplighters, who teach the children their rhyming slang.\nAs midnight on Friday approaches, the Bankses prepare to move out of their house. While examining his old kite, Michael discovers that Georgie used the missing share certificate to mend it. Michael and Jane rush to the bank while Mary Poppins and the children go with Jack and the lamplighters to Big Ben to 'turn back time'. After scaling the clock tower, Jack and Mary Poppins turn the clock back five minutes, giving Michael and Jane just enough time to reach the bank. Wilkins, however, will not accept the certificate as part of it is still missing. Wilkins's elderly uncle, the bank's previous chairman, Mr. Dawes Jr., arrives and sacks Wilkins on the spot for his corrupt business practices. He also reveals that Michael has plenty of assets to cover the loan, namely his judiciously-invested tuppence deposited with the bank many years ago.\nThe next day, the Bankses visit the park where a fair is in full swing. They purchase balloons that carry them into the air, where they are joined by Jack and many others. On their return home, Mary Poppins announces that it is time for her to leave. Michael and Jane thank her as her umbrella carries her back up into the sky and away."}