{"_movieID": "567104", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:14", "summary": "Let's Dance is the 15th studio album by David Bowie. It was originally released in April 1983, almost three years after his previous album, Scary Monsters (and Super Creeps). Co-produced by Chic's Nile Rodgers, the album contains three of his most successful singles: the title track, \"Let's Dance\", which reached No. 1 in the UK, US and various other countries, as well as \"Modern Love\" and \"China Girl\", which both reached No. 2 in the UK. \"China Girl\" was a new version of a song that Bowie had co-written with Iggy Pop for the latter's 1977 album The Idiot. It also contains a re-recorded version of the song \"Cat People (Putting Out Fire)\", which had reached No. 1 in New Zealand, Norway and Sweden a year earlier.\nLet's Dance was nominated for the Album of the Year Grammy Award in 1984 but lost to Michael Jackson's Thriller.  It has sold 10.7 million copies worldwide, making it Bowie's best-selling album. It was Bowie's eighteenth official album release since his debut in 1967, including two live albums, one covers album (Pin Ups, 1973), and a collaboration with the Philadelphia Orchestra (1978). At one point Bowie described the album as \"a rediscovery of white-English-ex-art-school-student-meets-black-American-funk, a refocusing of Young Americans\". Let's Dance was also a stepping stone for the career of the Texas blues guitarist Stevie Ray Vaughan, who played on it. The album was released as a limited edition picture disc in 1983. The album was re-mastered in 2018 and included in the Bowie box set Loving the Alien (1983–1988) (2018).\nCritical reviews for Let's Dance as an album were mixed, although Rolling Stone later described it as \"the conclusion of arguably the greatest 14-year run in rock history\". Bowie felt he had to continue to pander to the new mass audience he acquired with the album, which led to him releasing two further solo albums in 1984 and 1987 which, despite their relative commercial success, did not sell as well as Let's Dance, were poorly received by critics at the time and subsequently dismissed by Bowie himself as his \"Phil Collins years\". Bowie would help form the hard rock and grunge-predecessor band Tin Machine in 1989 in an effort to rejuvenate himself artistically."}