{"_movieID": "127380", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:46:58", "summary": "Finding Dory is a 2016 American 3D computer-animated adventure film produced by Pixar Animation Studios and released by Walt Disney Pictures. Directed by Andrew Stanton with co-direction by Angus MacLane, the screenplay was written by Stanton and Victoria Strouse. The film is a sequel/spinoff to 2003's Finding Nemo and features the returning voices of Ellen DeGeneres and Albert Brooks, with Hayden Rolence (replacing Alexander Gould), Ed O'Neill, Kaitlin Olson, Ty Burrell, Diane Keaton, and Eugene Levy joining the cast. The film focuses on the amnesiac fish Dory, who journeys to be reunited with her parents.The film premiered at the El Capitan Theatre in Los Angeles on June 8, 2016, and was released in the United States on June 17, 2016. Upon release, the film was well-received by critics and grossed over $1 billion worldwide, becoming the second Pixar film to gross $1 billion after 2010's Toy Story 3, the third highest-grossing film of 2016 and the 22nd-highest-grossing of all-time at the time of its theatrical run. The film set numerous box office records, including the biggest opening for an animated film in North America, and the highest-grossing animated film in North America.", "plot": "Dory, a regal blue tang, gets separated from her parents as a child. As she grows up, Dory attempts to search for them, but gradually forgets them due to her short-term memory loss. In a flashback (from Finding Nemo), she joins Marlin – a clownfish looking for his missing son Nemo – after accidentally swimming into him.\nOne year after meeting Marlin and Nemo, Dory is living with them on their reef. One day, Dory has a flashback and remembers her parents. She decides to look for them, but her memory problem is an obstacle. She suddenly remembers that they lived at the \"Jewel of Morro Bay, California\" across the ocean when Nemo mentions the name.\nMarlin and Nemo accompany Dory on her journey. With the help of Crush, their sea turtle friend, they ride the California Current to California. Upon arrival, they explore a shipwreck full of lost cargo, where Dory accidentally awakens a giant Humboldt squid, who pursues them and almost devours Nemo. They manage to trap the squid in a large shipping container, and Marlin berates Dory for endangering them. Her feelings hurt, Dory travels to the surface to seek help where she is captured by staff members from the trio's nearby destination, the Marine Life Institute.\nDory is placed in quarantine and tagged. There she meets a grouchy but well-meaning octopus named Hank. Dory's tag marks her for transfer to an aquarium in Cleveland. Hank, who fears being released back into the ocean, agrees to help Dory find her parents in exchange for her tag. In one exhibit, Dory encounters her childhood friend Destiny, a nearsighted whale shark, who used to communicate with Dory through pipes, and Bailey, a beluga whale, who mistakenly believes he has lost his ability to echolocate. Dory subsequently has flashbacks of life with her parents, and struggles to recall details. She finally remembers how she was separated from her parents: she overheard her mother crying one night, left to retrieve a shell to cheer her up, and was pulled away by an undertow current out into the ocean.\nMarlin and Nemo attempt to rescue Dory. With the help of two lazy California sea lions named Fluke and Rudder and a common loon named Becky, they manage to get into the institute and find her in the pipe system. Other blue tangs tell them that Dory's parents escaped from the institute a long time ago to search for her and never came back, leaving Dory believing that they have died. Hank retrieves Dory from the tank, accidentally leaving Marlin and Nemo behind. He is then apprehended by one of the employees and unintentionally drops Dory into the drain, flushing her out to the ocean. While wandering aimlessly, she comes across a trail of shells; remembering that when she was young, her parents had set out a similar trail to help her find her way back home, she follows it. At the end of the trail, Dory finds an empty brain coral with multiple shell trails leading to it. As she turns to leave, she sees her parents Jenny and Charlie in the distance. They tell her they spent years laying down the trails for her to follow in the hopes that she would eventually find them.\nMarlin, Nemo, and Hank end up in the truck taking various aquatic creatures to Cleveland. Destiny and Bailey escape from their exhibit to help Dory rescue them. Once on board the truck, Dory persuades Hank to return to the sea with her, and together, they hijack the truck and drive it over busy highways, creating havoc, before crashing it into the sea, freeing all the fish. Dory, along with her parents and new friends, return to the reef with Marlin and Nemo.\nIn a post-credits scene, the Tank Gang (from Finding Nemo), still trapped inside their (now algae-covered) plastic bags, reach California one year after floating across the Pacific Ocean, where they are picked up by staff members from the Marine Life Institute."}