{"_movieID": "68718", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:24", "summary": "Django Unchained () is a 2012 American revisionist Western action-adventure film written and directed by Quentin Tarantino, starring Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington, and Samuel L. Jackson, with Walton Goggins, Dennis Christopher, James Remar, Michael Parks, and Don Johnson in supporting roles. Set in the Old West and Antebellum South, it is a highly stylized tribute to Spaghetti Westerns using an obvious revisionist history, in particular the 1966 Italian film Django by Sergio Corbucci, whose star Franco Nero has a cameo appearance.\nDevelopment of Django Unchained began in 2007 when Tarantino was writing a book on Corbucci. By April 2011, Tarantino sent his final draft of the script to The Weinstein Company. Casting began in the summer of 2011, with Michael K. Williams and Will Smith being considered for the role of the title character before Foxx was cast. Principal photography took place from November 2011 to March 2012 in California, Wyoming and Louisiana.\nDjango Unchained premiered at the Ziegfeld Theatre in New York City on December 11, 2012 and was theatrically released on December 25, 2012 in the United States, grossing over $425 million worldwide against its $100 million budget, becoming Tarantino's highest-grossing to-date. The film received numerous awards and nominations, including five nominations at the 85th Academy Awards, including Best Picture. Waltz won several awards for his performance, among them Best Supporting Actor at the Academy Awards, Golden Globes and BAFTAs. For his screenplay, Tarantino won an Academy Award, a Golden Globe, and a BAFTA.", "plot": "In early 1858 Texas, brothers Ace and Dicky Speck drive a group of shackled black slaves on foot. Among them is Django, sold off and separated from his wife Broomhilda von Shaft, a house slave raised in a German household who can understand and speak both German and English. The brothers are stopped by Dr. King Schultz, a German dentist-turned-bounty hunter seeking to buy Django for his knowledge of the Brittle brothers (John \"Big John\" Brittle, Roger \"Lil Raj\" Brittle, and Ellis Brittle), overseers at the plantation of Django's previous owner and a trio of outlaws for whom Schultz is carrying a warrant. When the suspicious Ace levels his gun at him, Schultz kills him and wounds Dicky. Schultz insists on paying Dicky a fair price for Django before leaving Dicky to the newly freed slaves, who kill him and follow the North Star to freedom. While visiting a town to collect on another bounty, Schultz offers Django his freedom and $75 in exchange for help tracking the Brittle brothers down.\nThey track the Brittles to the Tennessee plantation of Spencer \"Big Daddy\" Bennett, where Django and Schultz kill the three brothers. Bennett rounds up a gang to kill them, but Schultz ambushes them with an explosive, killing most of them while Django kills Bennett. Feeling morally obliged to Django, Schultz agrees to help him find and rescue Broomhilda while taking him on as an apprentice and business partner. The pair return to Texas and Django soon collects his first bounty, keeping the handbill as a memento. He and Schultz have a successful winter racking up several bounties.\nIn the spring, Django and Schultz travel to Mississippi, where they learn the identity of Broomhilda's new owner: Calvin J. Candie, the charming but cruel owner of the Candyland plantation, where slaves are forced to fight to the death in brutal wrestling matches called \"Mandingo fights\". Schultz and Django meet Calvin at his gentleman's club in Greenville, and offer $12,000 for one of his best fighters; however, their ulterior motive is to purchase Broomhilda. Intrigued, Calvin invites them to Candyland.\nThe group encounters Calvin's slave trackers en route cornering one of Calvin's disfigured Mandingo fighters, D'Artagnan, who tried to escape to avoid fighting again. Angered, Calvin has his subordinate Stonecipher sic several attack dogs at D'Artagnan, who devour him alive. After finding Broomhilda and telling her of their plan, Schultz offers to buy her as his escort while negotiating the initial deal during dinner, alongside Calvin's bodyguard Butch Pooch and his lawyer Leonide Moguy. Calvin's staunchly loyal house slave Stephen becomes suspicious and accurately deduces their plan, alerting Calvin of this as he alters the deal at gunpoint so that Broomhilda will be sold for $12,000 instead of the Mandingo fighter. Schultz reluctantly agrees, and the papers for her freedom are drawn up and signed. However, Schultz double-crosses Calvin during the finalization of the sale and shoots him dead. Pooch kills Schultz, and Django goes on a rampage, killing Pooch, Moguy and several of Calvin's gunhands, but Stephen forces him to surrender when Broomhilda is taken hostage.\nThe next morning, Django is tortured by Calvin's right-hand man Billy Crash, and is almost castrated, before Stephen arrives. Stephen tells Django that Calvin's sister Lara has taken charge, and that he will be sold to the Australian-owned LeQuint Dickey Mining Company where he will be worked to death. En route, Django proves to his escorts that he is a bounty hunter by showing them his first handbill, tricking them into freeing him by claiming the men on the handbill are back at Candyland and promising them all but $500 of the reward money. Once released, Django kills his escorts before stealing a horse and returning to Candyland with a bag of dynamite.\nHaving recovered Broomhilda's freedom papers from Schultz's corpse, Django vows to avenge both him and D'Artagnan. Django kills Stonecipher and several of Calvin's trackers, and frees Broomhilda from a nearby cabin, just as Calvin's mourners return from his burial. At Calvin's mansion, Django kills Crash, Lara and the remaining henchmen, releases the two remaining house slaves, and kneecaps Stephen before igniting the dynamite that he has planted throughout the mansion. Django and Broomhilda watch from a distance as the mansion explodes, killing Stephen, before riding off together.", "cast": "Other roles include James Russo as Dicky Speck, brother of Ace Speck and erstwhile owner of Django. Tom Wopat, Omar J. Dorsey and Don Stroud play U.S. Marshal Gill Tatum, Chicken Charlie and as Sheriff Bill Sharp respectively. Bruce Dern appears as Old Man Carrucan, the owner of the Carrucan Plantation. M. C. Gainey, Cooper Huckabee and Doc Duhame portray brothers Big John Brittle, Lil Raj Brittle and Ellis Brittle respectively, overseers of both Carrucan and Big Daddy's plantations.\nJonah Hill plays Bag Head #2, member of a Ku Klux Klan-esque group. Additional roles include Lee Horsley as Sheriff Gus, Rex Linn as Tennessee Harry, Misty Upham as Minnie and Danièle Watts as Coco. Russ Tamblyn appears as Son of a Gunfighter and his daughter Amber Tamblyn as Daughter of a Son of a Gunfighter. Zoë Bell, Michael Bowen, Robert Carradine, Jake Garber, Ted Neeley, James Parks, and Tom Savini play Candyland trackers. Michael Parks and John Jarratt, alongside Tarantino himself in a cameo appearance as Frankie, play the LeQuint Dickey Mining Company employees. Tarantino also appears in the film as a masked Bag Head named Robert."}