{"_movieID": "118340", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:48", "summary": "Guardians of the Galaxy (retroactively referred to as Guardians of the Galaxy Vol. 1) is a 2014 American superhero film based on the Marvel Comics superhero team of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the tenth film in the Marvel Cinematic Universe (MCU). The film was directed by James Gunn, who wrote the screenplay with Nicole Perlman, and features an ensemble cast including Chris Pratt, Zoe Saldana, Dave Bautista, Vin Diesel, and Bradley Cooper as the titular Guardians, along with Lee Pace, Michael Rooker, Karen Gillan, Djimon Hounsou, John C. Reilly, Glenn Close, and Benicio del Toro. In Guardians of the Galaxy, Peter Quill forms an uneasy alliance with a group of extraterrestrial criminals who are on the run after stealing a powerful artifact.\nPerlman began working on the screenplay in 2009. Producer Kevin Feige first publicly mentioned Guardians of the Galaxy as a potential film in 2010 and Marvel Studios announced it was in active development at the San Diego Comic-Con International in July 2012. Gunn was hired to write and direct the film that September. In February 2013, Pratt was hired to play Peter Quill / Star-Lord, and the supporting cast members were subsequently confirmed. Principal photography began in July 2013 at Shepperton Studios in England, with filming continuing in London before wrapping up in October 2013. Post-production was finished on July 7, 2014.\nThe film premiered in Hollywood on July 21, 2014, and was released in the United States on August 1, 2014, in 3D and IMAX 3D. The film became a critical and commercial success, grossing $773.3 million worldwide and becoming the highest-grossing superhero film of 2014, as well as the third-highest-grossing film of 2014. The film was praised for its humor, acting, direction, soundtrack, visual effects, and action sequences. At the 87th Academy Awards, the film received nominations for Best Visual Effects and Best Makeup and Hairstyling. A sequel, Guardians of the Galaxy Vol. 2, was released on May 5, 2017. A third film, Guardians of the Galaxy Vol. 3, is in development.", "plot": "In 1988, following his mother's death, a young Peter Quill is abducted from Earth by the Ravagers, a group of alien thieves and smugglers led by Yondu Udonta. Twenty-six years later on the planet Morag, Quill steals a mysterious orb but is attacked by Korath, a subordinate to the fanatical Kree militant, Ronan. Although Quill escapes with the orb, Yondu discovers his theft and issues a bounty for his capture, while Ronan sends the assassin Gamora after the orb.\nWhen Quill attempts to sell the orb on Xandar, capital of the Nova Empire, Gamora ambushes him and steals it. A fight ensues, drawing in a pair of bounty hunters: the genetically and cybernetically modified raccoon Rocket, and the tree-like humanoid Groot. Nova Corps officers capture the four, detaining them in the Kyln prison. A powerful inmate there, Drax, attempts to kill Gamora due to her association with Thanos and Ronan, who killed his family. Quill convinces Drax that Gamora can bring Ronan to him, though Gamora reveals that she has betrayed Ronan, unwilling to let him use the orb's power. Learning that Gamora intends to sell the orb to the Collector Taneleer Tivan, Quill, Rocket, Groot, and Drax work with her to escape the Kyln in Quill's ship, the Milano.\nRonan meets with Gamora's adoptive father, Thanos, to discuss her betrayal. Quill's group flee to Knowhere, a remote lawless outpost in space built in the giant severed head of a Celestial. A drunken Drax summons Ronan while the rest of the group meet Tivan. Tivan opens the orb, revealing the Power Infinity Stone, an item of immeasurable power that destroys all but the most powerful beings who wield it. Tivan's slave Carina grabs the Stone, triggering an explosion that engulfs Tivan's archive. Ronan arrives and easily defeats Drax, while the others flee by ship, pursued by Ronan's followers and Gamora's adoptive sister Nebula. Nebula destroys Gamora's ship, leaving her floating in space, and Ronan's fighters capture the orb.\nQuill contacts Yondu before following Gamora into space, giving her his helmet to survive; Yondu arrives and retrieves the pair. Rocket, Drax, and Groot threaten to attack Yondu's ship to rescue them, but Quill negotiates a truce, promising the orb to Yondu. Quill's group agrees that facing Ronan means certain death, but that they cannot let him use the Infinity Stone to destroy the galaxy. On Ronan's flagship, the Dark Aster, Ronan embeds the Stone in his warhammer, taking its power for himself. He contacts Thanos, threatening to kill him after first destroying Xandar; hateful of her adoptive father, Nebula allies with Ronan.\nThe Ravagers and Quill's group join with the Nova Corps to confront the Dark Aster at Xandar, with Quill's group breaching the Dark Aster with the Milano. Ronan uses his empowered warhammer to destroy the Nova Corps fleet. Drax kills Korath and Gamora defeats Nebula, who escapes, but the group find themselves outmatched by Ronan's power until Rocket crashes a Ravager ship through the Dark Aster. The damaged Dark Aster crash-lands on Xandar, with Groot sacrificing himself to shield the group. Ronan emerges from the wreck and prepares to destroy Xandar, but Quill distracts him, allowing Drax and Rocket to destroy Ronan's warhammer. Quill grabs the freed Stone, and with Gamora, Drax, and Rocket sharing its burden, uses it to vaporize Ronan.\nIn the aftermath, Quill tricks Yondu into taking a container supposedly containing the Stone, and gives the real Stone to the Nova Corps. As the Ravagers leave Xandar, Yondu remarks that it turned out well that they did not deliver Quill to his father per their contract. Quill's group, now known as the Guardians of the Galaxy, have their criminal records expunged, and Quill learns that he is only half-human, his father being part of an ancient, unknown species. Quill finally opens the last present he received from his mother: a cassette tape filled with her favorite songs. The Guardians leave in the rebuilt Milano along with a sapling cut from Groot, which grows into a baby version of him.\nIn a post-credits scene, Tivan sits in his destroyed archive with two of his living exhibits: a canine cosmonaut and an anthropomorphic duck.", "cast": "Chris Pratt as Peter Quill / Star-Lord: The half-human, half-alien leader of the Guardians who was abducted from Missouri as a child in 1988 and raised by a group of alien thieves and smugglers called the Ravagers. About the character, Pratt said, \"He had a hard time as a kid, and now he goes around space, making out with hot alien girls and just being a rogue and a bit of a jerk, and through teaming up with these guys, finds a higher purpose for himself.\" He also added that the character is a mix of Han Solo and Marty McFly. Pratt, who was mostly known for playing supporting characters, including Andy Dwyer on the television series Parks and Recreation, initially turned down the role. Pratt had lost weight to portray fit characters in films such as Moneyball and Zero Dark Thirty, and had given up ambitions to play the lead role in action films after humbling auditions for Star Trek and Avatar. Casting director Sarah Finn suggested Pratt to Gunn, who dismissed the idea despite struggling to cast that role. Despite this, Finn arranged for a meeting between the two, at which point Gunn was immediately convinced that Pratt was perfect for the role. Pratt also won over Feige, despite having gained weight again for Delivery Man. Prior to filming, Pratt underwent a strict diet and training regimen to lose 60 pounds (27 kg) in six months. Pratt signed a multi-film contract with Marvel, and was granted a temporary leave from his work on Parks and Recreation in order to accommodate his participation in the film. Wyatt Oleff portrays a young Quill.\nZoe Saldana as Gamora: An orphan from an alien world who seeks redemption for her past crimes. She was trained by Thanos to be his personal assassin. Saldana said that she became Gamora through make-up rather than computer generated imagery (CGI) or performance capture. On taking the role, Saldana said, \"I was just excited to be asked to join by James Gunn and to also play someone green. I've been blue before [in Avatar].\" Saldana described Gamora as \"... a warrior, she's an assassin and she's very lethal but what saves her is the same thing that can doom her. She has a sense of righteousness. She's a very righteous individual.\"\nDave Bautista as Drax the Destroyer: A warrior who seeks to avenge his family's death at the hands of Ronan. On relating to the character, Bautista said, \"I can just relate to Drax so much it's not even funny. Just the simple things that we have in common. Simple things like the tattoos, the tragedy—because, you know, I had a bit of tragedy in my life as well. So it's really easy for me to pull from that.\" Bautista also said that there was \"a lot of comic relief to Drax\", but the character was not aware of it. Bautista stated that he did not do much preparation for the role, because \"Luckily, for me, I'm a lifelong athlete and I adapted real quick.\" Bautista's makeup took approximately four hours to apply, though it could be removed in just 90 minutes. Drax has various scarring patterns on his body, which replace the simple tattoos from the comics, each having a specific story. Additionally, his skin tone was changed from the bright green in the comics to a muddier grey, to avoid visual similarities to the Hulk.\nVin Diesel as Groot: A tree-like humanoid who is the accomplice of Rocket. Diesel stated that he provided the voice and motion capture for Groot, after originally being in talks to star in a new Phase Three Marvel film. Diesel also provided Groot's voice for several foreign-language releases of the film. Krystian Godlewski portrayed the character on set, though his acting was not used in the final character CGI. On the character, which Gunn based on his dog, Gunn said, \"All the Guardians start out the movie as bastards—except Groot. He's an innocent. He's a hundred percent deadly and a hundred percent sweet. He's caught up in Rocket's life, really.\" Gunn added that the design and movement of Groot took \"the better part of a year\" to create. Gunn added, \"The ways in which Vin Diesel says, 'I am Groot,' I am astounded. All of the 'I am Groots' that were earlier voices didn't sound very good at all ... Vin came in and in one day, laid down all these 'I am Groot' tracks, and he's a perfectionist. He made me explain to him with ever  [sic] 'I am Groot,' exactly what he was saying ... It was amazing when we first put that voice in there how much the character changed and how much he influenced the character.\" Regarding the limited words used by Groot, Diesel said in many ways this was, \"... the most challenging thing to ask an actor to do.\" Diesel found an emotional note in his performance, invoking the death of his friend and Fast and Furious co-star Paul Walker, saying, \"This was in December [2013], and the first time I came back to dealing with human beings after dealing with death, so playing a character who celebrates life in the way Groot does was very nice.\" Groot's form and size-changing abilities are seen, with Gunn stating that he has the ability to grow in the film.\nBradley Cooper as Rocket: A genetically-engineered raccoon-based bounty hunter, mercenary, and master of weapons and battle tactics. Gunn worked with live raccoons to get the correct feel for the character, and to make sure it was \"not a cartoon character\", saying, \"It's not Bugs Bunny in the middle of the Avengers, it's a real, little, somewhat mangled beast that's alone. There's no one else in the universe quite like him, he's been created by these guys to be a mean-ass fighting machine.\" Gunn also based the character on himself. Describing Rocket in relation to the rest of the Guardians, Cooper said, \"I think Rocket is dynamic. He's the sort of Joe Pesci in Goodfellas guy.\" Cooper voiced Rocket, while Sean Gunn (James' younger brother) stood in for the character during filming. James Gunn said that for the role of Rocket, some physical movement from Cooper, including facial expressions and hand movements, was recorded as potential reference for the animators, though much of Sean Gunn's acting is used throughout the film. Sean noted they \"kind of stumbled\" into the process of him performing on set since they \"weren't sure how we were going to create that character\". The same process would continue to be used for all subsequent appearances of Rocket. Before Cooper was cast, James Gunn said that it was a challenge finding a voice for Rocket, that he was looking for someone that could balance \"the fast-talking speech patterns that Rocket has, but also can be funny, because he is really funny. But also has the heart that Rocket has. Because there are actually some pretty dramatic scenes with Rocket.\"\nLee Pace as Ronan the Accuser: A renegade Kree commander and zealot who agrees to retrieve an artifact for Thanos in exchange for the annihilation of his mortal enemies, the Xandarians. Ronan and his Sakaaran army hunt down the Guardians when they interfere with his goals. Describing Ronan, Gunn said, \"He is the primary villain, and he is a really twisted guy, he has a really religious bent in this film. He has a very sick and twisted view of what morality is; strength is virtue and weakness is sin and that is what he lives by, and I think he is very scary because of his beliefs, which are real to him.\" Pace, who originally auditioned for Peter Quill, described Ronan as a \"psycho\" and a \"monster\".\nMichael Rooker as Yondu Udonta: A blue-skinned bandit who is the leader of the Ravagers and a paternal figure to Quill. Yondu helps Quill to steal the orb before Quill betrays him, leaving Yondu and the Ravagers to chase the Guardians. On the character, Rooker said, he has \"some interesting issues—not a good guy, not a bad guy. There's hope and there's a heart inside Yondu.\" Gunn created the film's version of the character specifically with Rooker in mind, while borrowing the character's mohawk and use of a whistle-controlled arrow from the comics. Rooker fully committed to the role once he knew his role on the TV series The Walking Dead would be ending. Rooker's makeup took approximately four hours to apply.\nKaren Gillan as Nebula: An adopted daughter of Thanos who was raised with Gamora as siblings and is a loyal lieutenant in the employ of Ronan and Thanos. About the character, Gillan said, \"She is the female villain of the film ... She is very sadistic and evil, but I like to think for a very valid reason.\" She also added, \"I think she's a really interesting character. What I like to play around with is how jealous she is. She's Gamora's sister, and there's a lot of sibling rivalry. That's the most interesting aspect to me, because jealousy can consume you and turn you bitter, and ugly. And she's a total sadist, so that's fun too.\" Gillan researched the ancient Spartans, shaved off her hair, and trained for two months for the role. The character's makeup took approximately four-and-a-half hours to be applied.\nDjimon Hounsou as Korath: A Kree ally of Ronan who is a feared intergalactic hunter. As to why he took the role Hounsou said, \"I have a four-year old son who loves superheroes from Spider-Man to Iron Man to Batman. He's got all the costumes. One day he looks at me and says 'Dad, I want to be light-skinned so I could be Spider-Man. Spider-Man has light skin.' That was sort of a shock. This is why I am excited to be a part of the Marvel Universe, so I could hopefully provide that diversity in the role of the superhero.\"\nJohn C. Reilly as Rhomann Dey: A corpsman in the Nova Corps, the Nova Empire's military and police force.\nGlenn Close as Irani Rael: The leader of the Nova Corps, known as Nova Prime, whose mission is to protect the citizens of the Nova Empire and keep peace. Close stated that she \"had always wanted to be in a movie like this\", and that it would be \"the most fun to play something like the Judi Dench [as M or] Samuel L. Jackson [as Nick Fury] role\". She said that she took the role because she \"love[s] to do stuff that's different\" and wanted to show that she \"[has] always been up for anything.\" She also stated that her contract has \"several\" films on it, and that she would be open to working on other Marvel Studios films in addition to returning for Guardians sequels.\nBenicio del Toro as Taneleer Tivan / The Collector: An obsessive keeper of the largest collection of interstellar fauna, relics, and species in the galaxy who operates out of a place in space named Knowhere. Describing del Toro's performance, Gunn said, \"He's like an outer-space Liberace. That's what it says in the script, which he's kind of doing.\" On bringing the character to life, del Toro said, \"What James [Gunn] wanted, that I found out little by little as I was doing it, is that he wanted me to explore and just keep pushing the character and keep creating [him] as I was in front of the camera.\"Additionally, Josh Brolin appears, uncredited, as Thanos through voice acting and performance capture. Sean Gunn stood in for Thanos during filming and portrays Kraglin, Yondu's first mate in the Ravagers. Alexis Denisof reprises his role as Thanos's vizier, \"The Other\", from The Avengers. Ophelia Lovibond plays Carina, the Collector's slave; Peter Serafinowicz plays Denarian Garthan Saal, a Nova Corps officer; Gregg Henry plays Quill's grandfather; Laura Haddock plays Quill's mother, Meredith; Melia Kreiling plays Bereet; Christopher Fairbank plays The Broker; Mikaela Hoover plays Nova Prime's assistant; Marama Corlett plays a pit boss at the bar, The Boot; Emmett J. Scanlan plays a Nova riot guard; Alexis Rodney plays Moloka Dar; Tom Proctor plays Horuz, a Ravager; and Spencer Wilding plays a prison guard who confiscates Quill's Walkman. Canine actor Fred appears as Cosmo. Stephen Blackehart had a supporting role. Naomi Ryan also had a supporting role in the film, though it was cut in the final version. Cameos in the film include: James Gunn as a Sakaaran; Stan Lee as a Xandarian Ladies' Man; Lloyd Kaufman as an inmate; Nathan Fillion as the voice of an inmate; Rob Zombie as the voice of the Ravager Navigator; composer Tyler Bates as a Ravager pilot; and Seth Green as the voice of Howard the Duck."}