{"_movieID": "97370", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:59:15", "summary": "Under the Skin is a 2013  science fiction film directed and co-written by Jonathan Glazer, loosely based on the 2000 novel of the same name by Michel Faber. It stars Scarlett Johansson as an otherworldly woman who preys on men in Scotland. The film premiered at Telluride Film Festival on 29 August 2013. It was released in the UK on 14 March 2014 and the United States on 4 April 2014.\nGlazer developed Under the Skin for over a decade; he and co-screenwriter Walter Campbell pared it back from an elaborate, special effects-heavy concept to a sparse story focusing on an alien perspective of the human world. Most characters were played by non-actors, and many scenes were filmed with hidden cameras.\nWith a total worldwide gross of £5.2 million, Under the Skin was a box office failure. Nevertheless, it received positive reviews, particularly for Johansson's performance, Glazer's direction, and Mica Levi's score. It received multiple awards and was named one of 2014's best films by several publications. It ranks 61st on the BBC's 100 Greatest Films of the 21st Century list.", "plot": "In Glasgow, a motorcyclist (Jeremy McWilliams) retrieves an inert young woman (Lynsey Taylor Mackay) from the roadside and places her in the back of a van, where a naked woman (Scarlett Johansson) dons her clothes. After buying clothes and make-up at a shopping centre, the woman drives the van around Scotland, picking up men. She lures a man (Joe Szula) into a dilapidated house. As he undresses, following the woman into a void, he is submerged in a liquid abyss.\nAt a beach, the woman attempts to pick up a swimmer (Kryštof Hádek), but is interrupted by the cries of a drowning couple. The swimmer rescues the husband, but the husband rushes back into the water to save his wife and both drown. As the swimmer lies exhausted on the beach, the woman strikes his head with a rock, drags him to the van, and drives away, ignoring the couple's distraught baby. Later that night, the motorcyclist retrieves the swimmer's belongings, ignoring the baby, who is still on the beach.\nThe woman visits a nightclub and picks up another man (Paul Brannigan). At the house, he follows her into the void and is submerged in the liquid. Suspended beneath the surface, he sees the swimmer floating naked beside him, alive but bloated and almost immobile. When he reaches to touch him, the swimmer's body collapses and a red mass empties through a trough.\nThe next day, the woman receives a rose from a street vendor, purchased from another man in traffic. She then listens to a radio report about the missing family from the beach. The woman then seduces a lonely man with facial disfigurement (Adam Pearson) but lets him leave after examining herself in a mirror. The motorcyclist intercepts the man and bundles him into a car, then sets out in pursuit of the woman with three other motorcyclists.\nIn the Scottish Highlands, the woman abandons the van in the fog. She walks to a restaurant and attempts to eat cake, but retches and spits it out. At a bus stop, she meets a man (Michael Moreland) who offers to help her. At his house, he prepares a meal for her and they watch television. Alone in her room, she examines her body in a mirror. They visit a ruined castle, where the man carries her over a puddle and helps her down some steps. At his house, they kiss and begin to have sex, but the woman stops and examines her genitals.\nWandering in a forest, the woman meets a commercial logger (Dave Acton) and shelters in a bothy. She awakes to find the logger molesting her. She runs into the wilderness but he catches and attempts to rape her; he tears her skin, revealing a black, featureless body. As the woman extricates herself from her skin, the man douses her in fuel and burns her alive. Elsewhere, the motorcyclist stands on a mountaintop, either aware of the woman's death or completely oblivious."}