{"_movieID": "57158", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:57", "summary": "The Hobbit: The Desolation of Smaug is a 2013 epic high fantasy adventure film directed by Peter Jackson and produced by WingNut Films in collaboration with New Line Cinema and Metro-Goldwyn-Mayer. It was distributed by Warner Bros. Pictures and is the second installment in the three-part film series based on the novel The Hobbit by J. R. R. Tolkien. The film was preceded by An Unexpected Journey (2012) and  followed by The Battle of the Five Armies (2014); together they operate as a prequel to Jackson's The Lord of the Rings film trilogy.\nThe film follows the titular character Bilbo Baggins as he accompanies Thorin Oakenshield and his fellow dwarves on a quest to reclaim the Lonely Mountain from the dragon Smaug. The film also features the vengeful pursuit of Azog the Defiler and Bolg, while Gandalf the Grey investigates a growing evil in the ruins of Dol Guldur. The ensemble cast includes Ian McKellen, Martin Freeman, Richard Armitage, Benedict Cumberbatch, Evangeline Lilly, Lee Pace, Luke Evans, Ken Stott, James Nesbitt, and Orlando Bloom.\nFran Walsh, Philippa Boyens, Peter Jackson and Guillermo del Toro wrote the screenplay. The films were shot simultaneously in 3D at a projection rate of 48 frames per second, with principal photography taking place around New Zealand and at Pinewood Studios. Additional filming took place throughout May 2013.The Hobbit: The Desolation of Smaug premiered on 2 December 2013 in Los Angeles and was released internationally on 11 December 2013 in both conventional and IMAX theatres. The film received generally positive reviews and grossed over $958 million at the worldwide box office, surpassing both The Fellowship of the Ring and The Two Towers, making it the fourth highest-grossing film of 2013 and the 48th highest-grossing film of all time. At the 86th Academy Awards, the film received nominations for Best Visual Effects, Best Sound Editing, and Best Sound Mixing.", "plot": "Thorin and his company are being pursued by Azog and his Orc party following the events of the previous film.  They are ushered along by Gandalf to the nearby home of Beorn, a skin-changer who can take the form of the bear. That night, Azog is summoned to Dol Guldur by the Necromancer, who commands him to marshal his forces for war, so Azog delegates the hunt for Thorin to his son Bolg. The following day, Beorn escorts the company to the borders of Mirkwood, where Gandalf discovers Black Speech imprinted on an old ruin. Heeding a promise he made to Galadriel, he warns the company to remain on the path and leaves to investigate the tombs of the Nazgûl. Upon entering the forest, the dwarves lose their way and are ensnared by giant spiders. Bilbo sets about freeing them with the help of his recently acquired invisibility ring. He subsequently drops the ring and first begins to understand its dark influence after he brutally kills a creature to retrieve it.\nThe remaining spiders are fended off by the Wood-elves led by Tauriel and Legolas. They also capture the Dwarves and bring Thorin before their king Thranduil. Thorin confronts Thranduil about his neglect of the Dwarves of Erebor following Smaug's attack 60 years earlier, and is consequently imprisoned with the other Dwarves. Bilbo, having avoided capture, arranges an escape using empty wine barrels that are sent downstream. While being pursued by the Wood-elves, they are ambushed by Bolg and his Orc party, and Kíli is wounded with a Morgul shaft. They engage in a running three-way battle down the river, but ultimately the Dwarves are able to escape both groups of pursuers. Thranduil then seals off his kingdom when an Orc captive reveals an evil entity has returned and is amassing an army in the south, but Tauriel decides to leave and assist the Dwarves, and Legolas goes after her. Meanwhile, Gandalf and Radagast go to investigate the tombs of the Nazgûl, which they find to be empty.\nThe company are smuggled into Esgaroth by a bargeman called Bard, but are discovered raiding the town armory for new weapons. Thorin promises the Master, his councilor Alfrid, and the people of Laketown a share of the mountain's treasure, and it is revealed that Bard is a descendant of the last ruler of Dale, and possesses the last black arrow capable of killing Smaug. Kíli is forced to remain behind, tended to by Fíli, Óin, and Bofur, as the remaining company receive a grand farewell. Meanwhile, Gandalf travels south to the ruins of Dol Guldur, while Radagast leaves to warn Galadriel of their discovery at the tombs of the Nazgûl. Gandalf finds the ruins infested with Orcs and is ambushed by Azog. The Necromancer overpowers Gandalf and reveals himself as Sauron.\nThorin and his remaining company reach the Lonely Mountain, where Bilbo discovers the hidden entrance. He is sent in to retrieve the Arkenstone, and while doing so, he accidentally awakens Smaug. While trying to find Bilbo, Smaug reveals his knowledge of Sauron's return. Back in Laketown, Bard attempts to bring the black arrow to the town's launcher, as he fears what may happen when the Dwarves enter the mountain. However, he is arrested by the Master and Alfrid in the process and leaves his son to hide the arrow. Bolg and his Orc party infiltrate the town and attack the four Dwarves, but are quickly dispatched by Tauriel and Legolas. Tauriel then tends to Kíli, while Legolas leaves in pursuit of Bolg. Meanwhile, Gandalf watches helplessly as Azog and an Orc army march from Dol Guldur towards the Lonely Mountain.\nBack inside the mountain, during a long chase, Bilbo and the Dwarves rekindle the mountain's forge using Smaug's flames to create and melt a large golden statue of Thrór, hoping to bury Smaug alive in the molten gold. They do so, but Smaug emerges from the gold, storms out of the mountain and flies off to destroy Laketown as Bilbo watches in horror.", "cast": "Some characters in the film are not in the novel, but created for the film. Legolas appears in Tolkien's Lord of the Rings trilogy, but not in the novel The Hobbit. \n\nThe following appear only in the Extended Edition\nAntony Sher as Thrain: Thorin's father who is held captive in Sauron's stronghold of Dol Guldur.Additionally, Peter Jackson makes a cameo appearance in the film, reprising his role as the man eating a carrot in Bree, his daughter Katie portrays Barliman Butterbur's wife Betsy, Philippa Boyens's daughter Phoebe and scale double Kiran Shah appear as a waitress and a Hobbit in the Prancing Pony, James Nesbitt's daughters Peggy and Mary portray Tilda and Sigrid, the daughters of Bard, Stephen Colbert and his family along with WingNut Films' assistant Norman Kali and producer Zane Weiner appear as Lake-town spies, and editor Jabez Olssen appears as a fishmonger. Brian Sergent (who portrayed the Hobbit Ted Sandyman in the extended edition of Fellowship of the Ring) and Peter Vere-Jones provide the voices of the spiders in Mirkwood."}