{"_movieID": "328407", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:09:02", "summary": "Metalocalypse: The Doomstar Requiem - A Klok Opera is a rock opera special for the Adult Swim animated series Metalocalypse. It was announced on May 10, 2013, by Adult Swim and was released on October 27, 2013. The special picks up directly after Metalocalypse season 4. It featured all new music from Dethklok, which was released on a soundtrack album on October 29, 2013.", "plot": "The special begins with Ishnifus Meaddle chanting and singing with the monks of the Church of the Black Klok about the Doomstar being born, and that before the \"prophet's night\" is over, one of them must die, as Charles Offdensen looks on and expresses concern for \"the looming Metalocalypse\" (\"The Birth/Fata Sidus Oritur/One of Us Must Die\"). It then cuts to Magnus Hammersmith and the Metal Masked Assassin holding Toki Wartooth and Abigail Remeltindrinc prisoner, keeping them both just barely alive in order to lure the remaining members of Dethklok into their trap (\"Magnus and the Assassin\"). Meanwhile, Dethklok is \"partying around the world\" in an attempt to forget that Toki is missing (\"Partying Around the World\"), while Offdensen is in the control room attempting to locate Toki. The Klokateers' best operative has returned dead, with a USB flash drive found in his remains. It contains a video of Magnus holding Toki and Abigail hostage, saying that his location is at the \"depths of humanity.\"\nIshnifus tries to motivate Dethklok to search for Toki, calling them \"brothers\", but Dethklok denies that they care about Toki (\"Tracking/Ishnifus and the Challenge\"). Dethklok then collectively laments about the weight that is being put on their shoulders, and question their ability to rescue Toki if it comes down to that. Ultimately, they refuse Ishnifus's plea (\"How Can I Be A Hero?\"). At a live show, the band uses a hologram to represent Toki, but it malfunctions, and the fans begin booing Dethklok. Realizing that they have no other choice, Dethklok finally makes the decision to find and rescue Toki (\"The Fans Are Chatting\").\nAbigail comforts Toki in an attempt to ease his fears, urging him to go to his \"happy place\" (\"Abigail's Lullaby\"). This is shown to be the day when Toki first auditioned to be in Dethklok. The band needed a new guitarist after they kicked out Magnus, so Skwisgaar Skwigelf engages in a guitar battle with the hopeful tryouts, defeating them all. Toki arrives late, but Skwisgaar gives him a chance anyway (\"Some Time Ago...\"). They begin a guitar duel, in which Toki is able to perform nearly on-par with Skwisgaar. Eventually Toki makes a mistake at the end of the duel, and while the band says he can't join, Skwisgaar says, \"Nobodys ever made me plays this wells\", and invites Toki to join Dethklok (\"The Duel\"). Toki then thinks of his happiness at the band's subsequent fame and fortune, and at his acceptance in the band (\"I Believe\").\nA meeting of the Tribunal is shown, with Mr. Salacia, Senator Stampingston, General Crozier and Vater Orlaag present. They mention Dethklok's decision to rescue Toki, and discuss that they have a traitor within Dethklok's ranks (\"A Traitor Amongst Them\"). Meanwhile, Edgar Jomfru helps the band prepare for their rescue mission, and both he and Ishnifus have some inspiring words for them (\"Training/Do It All for My Brother\"). Before they leave, Offdensen resigns as their manager, saying he can no longer protect them (\"Before You Go\").\nDethklok realizes that \"Depths of Humanity\" is the name of the club where Toki played his first gig with Dethklok (\"The Answer Is In Your Past\"), and goes there to find him. Instead they encounter their old band manager, Skwisgaar's old guitar teacher, and old groupies. They harass Dethklok about how the band abandoned them. One member pulls Murderface aside to greet him, and \"accidentally\" cuts his wrist. The rest of the band grab Murderface and flee the club. Skwisgaar shows the band an old flyer for the rehearsal space where they auditioned Toki, and they head there to find him (\"The Depths of Humanity\").\nOn their way they encounter a mob of zombie-like musicians and drug addicts. Realizing they cannot fight the army, they instead give them no reason to hate Dethklok - Nathan writes checks to the musicians, while Skwisgaar, Murderface, and Pickles donate their equipment to help them get started in the music industry. The junkies can't be bought off, though, and Pickles has no drugs to sate their addictions. All seems lost, until Dr. Rockso suddenly appears with a giant bag of cocaine so that the band can escape (\"Givin' Back To You\"). Inside the practice space, they are ambushed by the Metal Masked Assassin. However, Ishnifus appears, and sacrifices himself as a distraction, so that Dethklok can proceed to find Toki and Abigail (\"En Antris Et Stella Fatum Cruenti\").\nThe band considers giving up and making a run for it, with Murderface pointing out that if it was he and not Toki, nobody would come after him. Nathan realizes he would risk his life for any member of Dethklok, and the four resolve to complete their mission (\"The Crossroads\"). They succeed in locating Toki and Abigail and free them. They are confronted once more by the Assassin, but they stand by Toki, and their brotherhood activates the power of the Doomstar, ascending them to inhuman heights and finally killing the Metal Masked Assassin. Magnus sees the error of his ways and realises he is the villain. He stabs himself in the heart, taking his own life as recompense for his sins against his former bandmates (\"Morte Lumina\").\nIn the conclusion, Dethklok celebrates their success with a massive concert, Nathan and Abigail become a couple, and Offdensen becomes the new high priest of the Church of the Black Klok (\"Blazing Star\"). At the very end, a sleeping Murderface is shown being slowly overtaken by some sort of dark energy, emanating from the wound on his wrist.", "cast": "Brendon Small as Nathan Explosion, Skwisgaar Skwigelf, Pickles, William Murderface, Young Toki Wartooth, Charles Offdensen, Ishnifus Meaddle, Edgar and Eric Jomfru,  Magnus Hammersmith, Dr. Rockso, Dethklok Minute Host, all Klokateers, Church of the Black Klok monks, old guitar teacher, strange man from Depths of Humanity, fans\nMike Keneally as Toki Wartooth\nMalcolm McDowell as Vater Orlaag\nGeorge \"Corpsegrinder\" Fisher as Metal Masked Assassin\nRaya Yarbrough as Abigail Remeltindrinc, old groupie\nMark Hamill as Mr. Salacia, Senator Stampingston\nVictor Brandt as General Crozier\nJack Black as Dethklok's original manager, Fat Fan\nUlrich Wild (uncredited) as Bald Fan"}