{"_movieID": "410554", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:54:59", "summary": "First Kill is a 2017 American action film directed by Steven C. Miller and written by Nick Gordon. The film stars Hayden Christensen and Bruce Willis.", "plot": "Wall Street broker Will Beeman (Hayden Christensen) has been struggling with being present for his wife Laura (Megan Leonard) and son Danny (Ty Shelton). Shortly after hearing of Danny being bullied at school, Will decides to take his family to his hometown, Granville, Ohio in order to bond with Danny. Upon entering Granville, Will is reacquainted with Police Chief Marvin Howell (Bruce Willis), a family friend who at one point dated his aunt, Dottie (Deb G. Girdler). Howell advises Will on taking precaution after informing him of a recent bank robbery. While teaching Danny how to hunt with a rifle, Will and Danny witness a heated exchange between two men, one of them holding the other at gunpoint. The unarmed man (Gethin Anthony) is shot in the shoulder after throwing a key near Will's position at a shooting station, attracting the gunman's attention. The gunman opens fire on Will, prompting Will to shoot him with his hunting rifle in self-defense. Upon inspecting the gunman, discovers that the gunman was a police officer who failed to identify himself. Distraught, Will brings the wounded man to the family cabin in order for Laura, a surgeon to provide first aid.\nShortly after being treated, the man takes Danny hostage at knife-point, demanding that Will help him retrieve the discarded key in exchange for Danny's freedom. While attempting to retrieve the key at a shooting shack, a uniformed officer, Richie Stechel (William DeMeo), opens fire on Will and the gunman. The gunman tells Will to meet him at a bulletin board after retrieving the key. After a failed attempt at pursuing his son, Will learns of the gunman's name from Howell as Levi Barrett, and that the deceased officer was Richie's brother, Charlie (Shea Buckner). Will waits until nightfall to retrieve the key, only to be confronted by Richie. Will successfully subdues Richie, and heads to the bulletin board for further instructions. Meanwhile, Danny bonds with Levi and learns the reasons behind robbing the bank. Howell and the Stechel brothers engineered the heist and intended to use Levi as the fall guy. Levi agreed to the heist in order to financially support Mabel Fantion (Christine Dye), Adele's (Magi Avila) cancer-ridden mother. Levi was supposed to drop off the stolen money at a drop-site, but did not arrive due to fear of the site being compromised with a potential assassin. Howell also deduces Levi's predicament after a uniformed officer investigates Barrett's apartment.\nHowell and Will converge on Mabel's hospital bed, with Howell questioning Will. While Howell is distracted with a radio call by an officer, Will receives a map from Mabel revealing the location of the post office where the stolen money was stashed and the location of an underground bunker at which to make the exchange. The key is used to unlock the mailbox containing the stolen cash. Will briefly eludes Howell, and is caught again after retrieving the money. Seemingly sympathetic to Will's situation, Howell provides Will transport to the bunker in order to apprehend Levi. Will gives the money to Levi and is reunited with Danny. During this reunion, Richie kidnaps Laura from the family cabin and drives her to Howell's location for leverage. \nWhile attempting to flee, Adele is murdered by Howell. Left with nothing to lose, Levi attacks Howell and Richie only to be wounded. Will takes Danny to a hunter's watchtower, where the latter pushes a pursuing Richie off a ladder to knock him out. Howell holds Laura at gunpoint, threatening to shoot her. Danny retrieves a pistol from the unconscious Richie and attempts to shoot Howell, only for Will to stop him. In an attempt to taunt Will, Howell reveals himself as the person that murdered Will's father years earlier. Levi distracts Howell, while Laura ducks providing Will the opportunity to shoot Howell in the head. \nDuring the aftermath, Levi dies of his injuries, Richie is questioned by the rest of the police department, and Mabel is found dead on the hospital bed, murdered by Howell by removing her life support system. The Beeman family returns home to deal with their daily lives.", "cast": "Hayden Christensen as William \"Will' Beeman\nBruce Willis as Police Chief Marvin Howell\nTy Shelton as Danny Beeman\nGethin Anthony as Levi Barrett\nMegan Leonard as Laura Beeman\nTyler Jon Olson as Officer Tom Davies\nJesse Pruett as Officer Lewis\nShea Buckner as Charlie Stechel\nWilliam DeMeo as Richie Stechel\nMagi Avila as Adele Fantion\nChris R Moss as Officer Cox\nChelsea Mee as Tammy\nDeb G. Girdler as Aunt Dottie\nChristine Dye as Mabel Fantion"}