{"_movieID": "134411", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:27:00", "summary": "Snitch is a 2013 American action film directed by Ric Roman Waugh and starring Dwayne Johnson. The film was released in the United States on February 22, 2013. The film also stars Barry Pepper, Susan Sarandon, Jon Bernthal, Benjamin Bratt, and Michael Kenneth Williams.", "plot": "College student Jason Collins is video-chatting with his childhood best friend Craig Johnson. Craig discusses a box of drugs that he is attempting to move and attempts to persuade Jason to let Craig ship the drugs to his house, offering him a share of the profit. Despite Jason's reluctance, Craig texts him the tracking number for the package. A courier delivers Craig's package to the Collins's house. Jason signs for the package and brings it to his room, discovering that it contains a large amount of pills in a bag, as well as a tracking device. DEA officers arrive and break into the house; Jason flees but is chased down by Agent Cooper.\nWhile at a barbecue, John Matthews, Jason's estranged father and owner of a construction company, is called by his ex-wife Sylvie about Jason being arrested. John and Sylvie meet and have a tense discussion while waiting to speak to Jason. An investigator speaks with them, saying that Craig set Jason up in a sting operation to reduce his own sentence after being caught. Jason's charges carry a minimum of 10 years in prison and Jason is denied bail. He is put in an interview room with John, Sylvie, and the investigator, who pressures Jason to inform on one of his own friends for trafficking in order to reduce his own sentence, as Craig had done.\nUsing his connections, John arranges to meet with local US Attorney Joanne Keeghan, who is running a very aggressive anti-drug campaign. Keeghan agrees to reduce Jason's sentence if John will inform on a drug dealer, but states that he'll receive little help from her and that the risk will be all his. John visits Jason in prison, observing from facial wounds that Jason has been abused by other prisoners.\nAgent Cooper leads a task force which will monitor any dealings John arranges to use as evidence for an arrest. John searches through his employee records and finds that Daniel James, a new employee, has two prior distribution convictions. Daniel is currently leading a clean life to avoid a third strike. John offers twenty thousand dollars if Daniel will simply introduce him to a dealer; Daniel agrees, though he is unaware that John is acting as an informant. Daniel introduces John to Malik, an extremely dangerous, high-ranking local drug dealer, who also has two strikes. Explaining that his construction business cannot stay afloat in the current economy without a supplement to its revenues, John offers to run nearly limitless amounts of drugs at almost zero risk in his freight trucks. Malik agrees under the condition that John and Daniel drive the initial run themselves.\nJohn and Agent Cooper arrange for several wire taps. John drives to the pick-up point near the Mexican border when a rival gang ambushes the pick-up, but John manages a daring escape, impressing cartel kingpin Juan Carlos \"El Topo\" Pintera, whose men fight off the hijackers. John then makes the deal, delivering the drugs to Malik while under surveillance by Agent Cooper. Malik mentions a meeting with cartel members higher than himself; Cooper, hoping to catch the higher priority targets, does not move to arrest Malik as agreed. Keeghan claims Cooper did the right thing and reneges on her promise to reduce Jason's sentence, unless John cooperates in the second meeting. John, outraged, demands in turn that Jason be released when the job is completed. Daniel learns of John's arrangement with the DEA and is furious, saying that the cartel will kill John, Daniel, and their families if the truth comes out. John and Daniel send their families into hiding.\nJohn meets with Pintera, who wants him to run nearly $100 million in drug profits into Mexico and offers to make John a member of the cartel's inner circle if he succeeds. Keeghan relishes the prospect of arresting such a high-profile dealer, but Cooper has a change of heart and tries to talk John out of doing the run, suspecting the cartel will kill him afterward. John devises a plan to free himself and Daniel from both the government and the cartel. During the run, John is able to escape Cooper's surveillance. At the same time, Daniel raids Malik's house, killing his guards and mortally wounding him. Before dying, Malik reveals Pintera's cell phone number to Daniel. John calls Cooper and has him track both his new cell phone and Pintera's phone, effectively giving Cooper both the money and the kingpin at once. The cartel realize John is an informant and he leads them on a highway chase and shoot-out before escaping. Cartel members and the money are seized by Cooper's men. Pintera is surrounded by federal agents and surrenders without engaging in a gun battle because his young son is with him. Jason is released the next day. John and his family go into the witness protection program and he leaves Daniel the large Federal reward check that John received for the capture of Pintera.", "cast": "Dwayne Johnson as John Matthews\nBarry Pepper as Agent Cooper\nBenjamin Bratt as Juan Carlos 'El Topo' Pintera\nSusan Sarandon as Joanne Keeghan\nJon Bernthal as Daniel James\nMichael Kenneth Williams as Malik\nMelina Kanakaredes as Sylvie Collins\nNadine Velazquez as Analisa Matthews\nRafi Gavron as Jason Collins\nDavid Harbour as Jay Price\nJ. D. Pardo as Palacio\nKym Jackson as Agent Sims\nAshlynn Ross as Amanda\nIan Woo as Dry Snitch"}