{"_movieID": "49517", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:57", "summary": "Tinker Tailor Soldier Spy is a 2011 Cold War spy thriller film directed by Tomas Alfredson. The screenplay was written by Bridget O'Connor and Peter Straughan, based on John le Carré's 1974 novel of the same name. The film, starring Gary Oldman as George Smiley, along with Colin Firth, Tom Hardy, John Hurt, Toby Jones, Mark Strong, Benedict Cumberbatch, and Ciarán Hinds, and featuring David Dencik, is set in London in the early 1970s and follows the hunt for a Soviet double agent at the top of the British secret service.\nThe film was produced through the British company Working Title Films and financed by France's StudioCanal. It premiered in competition at the 68th Venice International Film Festival. A critical and commercial success, it was the highest-grossing film at the British box office for three consecutive weeks. It won the BAFTA Award for Best British Film. The film also received three Academy Awards nominations: Best Adapted Screenplay, Best Original Score, and for Oldman, Best Actor.\nThe novel had previously been adapted into the award-winning BBC TV miniseries Tinker Tailor Soldier Spy (1979) with Alec Guinness playing the lead role of Smiley.", "plot": "In October 1973, \"Control\", head of British intelligence (referred to as \"The Circus\"), sends agent Jim Prideaux to Budapest to meet a Hungarian general wishing to defect. The meeting is a trap, and Prideaux is shot by Russian-employed agents attempting to capture him. Amidst the international incident that follows, Control and his right-hand man George Smiley are forced into retirement and Control dies of illness shortly afterward. Smiley's wife, Ann, is having an affair with his colleague Bill Haydon and has moved out.\nPercy Alleline becomes the new Chief, Haydon his deputy, and Roy Bland and Toby Esterhase his lieutenants. Despite Control and Smiley's misgivings, their successors had already begun a secret operation—\"Witchcraft\"—to obtain highly sensitive information from the Soviet Union, which is in turn being traded with the CIA for American intelligence. Smiley is enlisted by Cabinet Office civil servant Oliver Lacon to investigate a claim by Ricki Tarr, a British spy, that for years there has been a mole in a senior role in the Circus, a suspicion that Control had also held but had not shared with Smiley. Smiley chooses a trustworthy agent, Peter Guillam, and retired Special Branch officer Mendel to help him. He interviews former Circus analyst Connie Sachs, who was sacked by Alleline after she deduced that Alexei Polyakov, a Soviet cultural attaché in London, was a spy.\nTarr tells Smiley that on an assignment in Istanbul, he had an affair with Irina, a Soviet agent. She wanted to reveal the name of a mole in the top ranks of the Circus but when Tarr reported this to London, they ignored him and ordered him straight home, while the Soviets promptly kidnapped Irina. Concluding that the mole had intercepted his message, Tarr went into hiding and was suspected of defecting and murdering the British station chief. Smiley sends Guillam to steal the Circus logbook for the night Tarr had called and finds the pages for that night have been cut out, supporting Tarr's story. Smiley discovers that Prideaux is alive, having been exchanged with the Soviets after a period of brutal interrogation, and is living a life of solitude as a school teacher. Smiley interviews Prideaux, who reveals that the true purpose of the mission to Hungary was to get the name of the mole. Control had codenamed the suspects \"Tinker\" (Alleline), \"Tailor\" (Haydon), \"Soldier\" (Bland), \"Poorman\" (Esterhase), and \"Beggarman\" (Smiley).\nSmiley learns that Alleline, Haydon, Bland, and Esterhase have been meeting Polyakov—the \"Witchcraft\" source—at a safe house somewhere in London, where Polyakov gives them supposedly high-grade Soviet intelligence, in exchange for low-grade British material to help him maintain his cover with the Soviets. However, the mole is actually passing substantive material, including American intelligence, to Polyakov, his handler, whilst Polyakov's material has just enough substance to persuade the CIA to share information with the British. Smiley blackmails Esterhase with a threat of deportation to get the safe house's location. Smiley then has Tarr appear at the Paris office, implying he knows who the mole is. The mole is revealed to be Haydon when he meets Polyakov at the safe house and is captured by Smiley. The Circus plans to exchange Haydon with the Soviets but he is killed by Prideaux. Smiley comes home to find Ann has returned to him, and returns to the Circus as its new chief."}