{"_movieID": "138103", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:58:59", "summary": "The Expendables 3 is a 2014 American ensemble action thriller film directed by Patrick Hughes and written by Creighton Rothenberger, Katrin Benedikt and Sylvester Stallone. It is the third installment in The Expendables film series and the sequel to The Expendables (2010) and The Expendables 2 (2012). The film features an ensemble cast of stars including Stallone, Jason Statham, Antonio Banderas, Jet Li, Wesley Snipes, Dolph Lundgren, Kelsey Grammer, Randy Couture, Terry Crews, Kellan Lutz, Ronda Rousey, Glen Powell, Victor Ortiz, Robert Davi, Mel Gibson, Harrison Ford and Arnold Schwarzenegger.\nThe story follows the mercenary group known as \"The Expendables\" as they come into conflict with ruthless arms dealer Conrad Stonebanks, the Expendables' co-founder, who is determined to destroy the team. The film premiered in London on August 4, 2014 and was released theatrically on August 15, 2014 by Lionsgate. Unlike the first two films in the franchise, The Expendables 3 received a PG-13 rating instead of an R rating, which upset many fans of the franchise.  The film grossed $214 million worldwide on estimated $90–100 million budget. A sequel is currently in production.", "plot": "The Expendables—led by Barney Ross and formed by Lee Christmas, Gunner Jensen, and Toll Road—extract former member Doctor Death, a knives specialist and team medic, from a military prison during his transfer on a train. They recruit Doc to assist them in intercepting a shipment of bombs meant to be delivered to a warlord in Somalia. Arriving there, they reunite with Hale Caesar, who directs them to the drop point, where Ross is surprised to find out that the arms trader providing the bombs is Conrad Stonebanks, a former co-founder of the Expendables who went rogue and was presumed dead. In the ensuing firefight, The Expendables kill all but Stonebanks, who shoots Caesar. They are forced to retreat due to Stonebanks' advanced weaponry, and Caesar is severely injured.\nBack at the United States, CIA operative Max Drummer, the Expendables' new missions manager, gives Ross a mission to capture Stonebanks to bring him to the International Criminal Court to be tried for war crimes. Blaming himself for Caesar's injuries, Ross disbands the Expendables and leaves for Las Vegas, where he enlists retired mercenary-turned-recruiter Bonaparte to help him find a new team of younger mercenaries. The recruits include former U.S. Marine John Smilee, nightclub bouncer Luna, computer expert Thorn, and weapons expert Mars. Skilled sharpshooter Galgo asks to be included in the team, but Ross turns him down.\nThe new team members rendezvous with Ross's rival Trench Mauser, returning a favor for Ross. Drummer has traced Stonebanks to Romania, where he is set to make an arms deal. Ross and the new recruits infiltrate an office building Stonebanks is using and, having to kill a few men in the process including arms buyer Goran Vata, capture Stonebanks. In transit, Stonebanks taunts Ross and explains why he betrayed The Expendables.  Ross nearly kills him to shut him up but, despite Stonebanks egging him on, he stands down. Stonebanks' men catch up to them, with the aid of his GPS Tracker, and fire a missile at the team's van. Ross is thrown into a river, while Smilee, Luna, Thorn and Mars are captured by Stonebanks' crew. Ross kills Stonebanks' retrieval team and escapes.\nStonebanks sends Ross a video, challenging Ross to come after him and giving him his location in Azmenistan. While preparing to leave and mount a rescue alone, Ross is found by Galgo, who offers his services again. Ross accepts, later accompanied by the veteran Expendables. They rescue the young mercenaries, only to learn from Stonebanks that he has rigged the place with explosives. As both the young and veteran Expendables fight one another, Ross convinces them to work together to take down Stonebanks. As the final battle begins, Thorn uses a jammer device to delay the countdown, giving them just under half an hour before detonation. Stonebanks orders the armed forces of Azmenistan to attack the building with full force, including tanks and attack helicopters. Drummer and Trench arrive in a helicopter to help, alongside returning Expendables member Yin Yang.\nThe new and veteran members of the Expendables work together to kill Stonebanks' men. When a second wave moves in, Drummer lands on the building to evacuate the team. As everyone makes it to Drummer's chopper, Stonebanks personally attacks Ross after shooting him down. Having been forced to remove the armor and his weapon, Ross and Stonebanks engage in hand-to-hand combat. Both are evenly matched, but Ross knocks down Stonebanks before they both reach for their guns. Stonebanks shoots, but Ross gets the better of him. At his mercy, Stonebanks questions Ross about delivering him to the International Criminal Court. Ross coldly shoots Stonebanks in response. Seconds after Stonebanks' death, the batteries of Thorn's device run out, causing the building to explode and collapse. The team makes it to Drummer's helicopter and flies away to safety, as Ross clings to it from the outside. In the aftermath, Caesar recovers from his wounds, and Ross officially accepts Galgo, Smilee, Luna, Thorn, and Mars into the team. They all celebrate at a bar together.", "cast": "Sylvester Stallone as Barney Ross  The leader of the Expendables.\nMel Gibson as Conrad Stonebanks  A ruthless arms dealer who was formerly the co-founder of the Expendables before going rogue.\nJason Statham as Lee Christmas  The team's knife expert, hand-to-hand fighter, and Second-In-Command.\nHarrison Ford as Max Drummer  A CIA field operations officer and pilot who manages the Expendables.\nAntonio Banderas as Galgo  A former member of the Spanish Legion in the Spanish Armed Forces, Croatian war veteran, and an expert sharpshooter.\nWesley Snipes as Doctor Death  A former medic, knife expert, and one of the original Expendables.\nDolph Lundgren as Gunner Jensen  The volatile member of the team.\nRandy Couture as Toll Road  The team's demolitions expert.\nTerry Crews as Hale Caesar  The team's barrel-weapons specialist.\nArnold Schwarzenegger as Trent \"Trench\" Mauser  Barney's former teammate and on and off again friend.\nJet Li as Yin Yang  The team's hand-to-hand combat expert, now working for Trench. \nKelsey Grammer as Bonaparte  A retired mercenary and ally of the Expendables.\nRonda Rousey as Luna  An athletic nightclub bouncer recruited by Bonaparte.\nKellan Lutz as John Smilee  A former U.S. Marine, expert motorcycle rider, recruited to the Expendables.\nGlen Powell as Thorn  A highly skilled hacker, climber and drone pilot.\nVictor Ortiz as Mars  A sharpshooter and lethal soldier, used to work at DARPA, who is afraid of heights.\nRobert Davi as Goran Vata  The head of the Albanian mafia.\nSarai Givaty as Camilla\nNatalie Burn as Conrad's wife"}