{"_movieID": "71254", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:51:46", "summary": "An arena is an enclosed area, often circular or oval-shaped, designed to showcase theatre, musical performances, or sporting events. It is composed of a large open space surrounded on most or all sides by tiered seating for spectators, and may be covered by a roof. The key feature of an arena is that the event space is the lowest point, allowing maximum visibility. Arenas are usually designed to accommodate a multitude of spectators.\nThe word derives from Latin harena, a particularly fine-grained sand that covered the floor of ancient arenas such as the Colosseum in Rome, Italy, to absorb blood.The term arena is sometimes used as a synonym for a very large venue such as Pasadena's Rose Bowl, but such a facility is typically called a stadium, especially if it does not have a roof. The use of one term over the other has mostly to do with the type of event. Football (be it association, rugby, or gridiron) is typically played in a stadium, while basketball and ice hockey are typically played in an arena, although many of the larger arenas hold more spectators than do the stadiums of smaller colleges or high schools. There are exceptions. The home of the Duke University men's and women's basketball teams would qualify as an arena, but the facility is called Cameron Indoor Stadium. Domed stadiums, which, like arenas, are enclosed but have the larger playing surfaces and seating capacities found in stadiums, are generally not referred to as arenas in North America. There is also the sport of indoor American football (one variant of which is explicitly known as arena football), a variant of the outdoor game that is designed for the usual smaller playing surface of most arenas; variants of other traditionally outdoor sports, including box lacrosse and futsal and indoor soccer, also exist.\nThe term \"arena\" is also used loosely to refer to any event or type of event which either literally or metaphorically takes place in such a location, often with the specific intent of comparing an idea to a sporting event. Such examples of these would be terms such as \"the arena of war\" or \"the arena of love\" or \"the political arena\". In many fighting games, the stage that opponents are fought in is also called an arena.\nAn arena is often named after a name sponsor. It is common that the name changes with 4–8 years intervals."}