{"_movieID": "10024", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:28", "summary": "My Sister's Keeper is a 2009 American drama film directed by Nick Cassavetes and starring Cameron Diaz, Abigail Breslin, Sofia Vassilieva, Jason Patric, and Alec Baldwin. Based on Jodi Picoult's 2004 novel of the same name, on June 26, 2009 the film was released to cinemas in the United States, Canada, Ireland, Mexico, and the United Kingdom.", "plot": "The story takes place in the fictional town of Upper Darby, Rhode Island in 2004. Anna Fitzgerald's older sister, Kate, suffers from acute promyelocytic leukemia, a blood and bone marrow cancer. Anna was born as a savior sister specifically so she could save Kate's life. At first it is successful, but the cancer continues to relapse throughout Kate's life.\nAnna is usually willing to donate whatever Kate needs, but when she turns 11, she is told that she will have to donate one of her kidneys due to Kate's kidney failure. The surgery required for both Kate and Anna would be major; it is not guaranteed to work, as the stress of the operation may kill Kate anyway, and the loss of a kidney could have a serious impact on Anna's life. Anna petitions for medical emancipation with the help of lawyer Campbell Alexander, so she will be able to make her own decisions regarding her medical treatment and the donation of her kidney.\nThis is done on the advice of Julia Romano, the court-appointed guardian ad litem whose job it is to decide what would be best for Anna. Julia was once romantically involved with Campbell when they went to high school together, but Campbell broke her heart when he left her. Unbeknownst to Julia, Campbell left her because he discovered he had epilepsy and thought she deserved better.\nMeanwhile, Anna's older brother, Jesse, who has spent most of his life being ignored in favor of ill Kate or donor Anna, spends most of his time setting fire to abandoned buildings with homemade explosives and using illegal drugs. He is a self-confessed juvenile delinquent, which leads to their father Brian eventually confronting Jesse for his behavior.\nDuring the trial, it is revealed that Kate originally asked Anna to sue for emancipation because Kate did not want Anna to have to donate her kidney now that Kate has been ready to die, but their mom Sara cannot seem to understand that (she later comes to terms when Anna tells her), and because Kate believes she will die anyway. As Anna stands up to testify, Campbell Alexander has an epileptic seizure, and when he gets back, Anna testifies again. it is revealed that Kate did not want to live anymore, so she asked Anna to sue for medical emancipation. When Anna is asked how Kate reacts to the trial, Anna tells the court that Kate said thanks. The judge rules in Anna's favor, and grants Campbell a medical power of attorney. However, as Campbell drives her home after the trial, their car is hit by a pick-up. The on-call firefighter (who also happens to be Brian, Anna's father) who arrives at the scene, retrieves an unconscious and severely injured Anna from the wreckage of the crushed car.\nShe goes into cardiac arrest and is revived. Both she and Campbell are rushed to the hospital. At the hospital, the doctor informs Sara and Brian that Anna is brain-dead and asks them if they have considered organ donation. An injured Campbell steps in and declares that he has the power of attorney and that \"there is a girl upstairs who needs that kidney.\" Kate is prepared for surgery, and Anna's kidney is successfully transplanted. Anna's life-support machines are then shut off by her family. Kate survives the surgery and remains in remission. Jesse has reformed and graduates from the police academy, and is awarded by the mayor for his work in uncovering drugs, despite his criminal record. Campbell Alexander and Julia Romano marry, but the couple don't often meet up with the Fitzgerald family, as the pain of Anna's death is too fresh, and her name lingers in the spaces between conversations.- sorry ('-')", "cast": "Abigail Breslin as Anna Fitzgerald\nAlexandra Casteele as Young Anna Fitzgerald\nCameron Diaz as Sara Fitzgerald\nSofia Vassilieva as Kate Fitzgerald\nOlivia Hancock as young Kate Fitzgerald\nJason Patric as Brian Fitzgerald\nChris Kinkade as Dr. Nguyen\nDavid Thornton as Dr. Chance\nEvan Ellingson as Jesse Fitzgerald\nBrennan Bailey as young Jesse Fitzgerald\nPaul Christopher Butler as three-year-old Jesse\nAlec Baldwin as Campbell Alexander\nE.G. Daily as Nurse Susan\nLin Shaye as Nurse Adele\nJoan Cusack as Judge De Salvo\nHeather Wahlquist as Kelly\nThomas Dekker as Taylor Ambrose\nEmily Deschanel as Dr. Farquad"}