{"_movieID": "218778", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:57:44", "summary": "Alexander and the Terrible, Horrible, No Good, Very Bad Day is a 2014 American family fantasy comedy film directed by Miguel Arteta from a screenplay written by Rob Lieber. The film stars Steve Carell, Jennifer Garner and Ed Oxenbould, and is loosely based on Judith Viorst’s 1972 children's book of the same name. Co-produced by Shawn Levy and Lisa Henson for Walt Disney Pictures through their respective production companies, 21 Laps Entertainment and The Jim Henson Company, the film was released in North America on October 10, 2014. The film received mixed reviews from critics but was a success at the box office, grossing $101.4 million worldwide against a $28 million budget.", "plot": "The movie follows the exploits of 11-year-old Alexander Cooper (Ed Oxenbould) on a \"terrible, horrible, no-good, very bad day.\" Living in suburban Los Angeles, Alexander often feels left-out by his family: baby brother Trevor (Elise/Zoey Vargas); elder siblings Anthony (Dylan Minnette) and Emily (Kerris Dorsey); their parents, Kelly (Jennifer Garner) and Ben (Steve Carell).\nAnthony is trying to earn his driver's license so he can drive his demanding and sharp-tongued girlfriend, Celia, to the junior prom; Emily is rehearsing for the title role in her Peter Pan school play; Kelly works for a publication company on a new children's book which will get her promoted to vice-president of said company; Ben, who has been unemployed for seven months, has landed an interview for a job as a video game designer.\nThat morning, Alexander experiences a series of mishaps at school: he accidentally sets fire to his crush Becky Gibson's notebook; he finds out that his friends - including Becky, and even his best friend Paul - will all be attending Philip Parker (Lincoln Melcher)'s birthday party, instead of Alexander's, due to Philip's expensive party entertainment and popularity. That night, Alexander puts a candle on a homemade birthday sundae. He wishes that everyone in his family could relate to what he is going through.\nThe next morning, Alexander wakes up to find the rest of his family in chaotic disarray: his parents have overslept; Emily has a cold from rehearsing in the car; Celia has broken up with Anthony, due to her overhearing and misinterpreting a conversation between the Cooper brothers last night. Kelly's car is dead, due to Emily's having left the light on last night and draining the battery. Ben has to take Trevor with him to the interview, after dropping Kelly off at work. At school, Alexander learns that Philip's birthday party has been canceled because Philip has chickenpox; Becky and Paul, along with all the other kids who had originally planned to attend Philip's party, will attend Alexander's party instead. Delighted, Alexander asks his father to plan a party for him. Meanwhile, Kelly is informed of an embarrassing typo in the book they are publicizing (\"dump\" instead of \"jump\"); she attempts to prevent Dick Van Dyke from reading it at a public event they have scheduled. Ben takes Trevor along to his interview; his prospective boss, Greg (Donald Glover), seems impressed by Ben's credentials. However, they decide to hold another meeting, after Trevor ingests a non-toxic highlighter. Back at school, Anthony patches things up with Celia. In his excitement, however, he accidentally smashes a couple of trophy cases; this gets him suspended.\nKelly arrives at Dick Van Dyke's reading too late to warn him about the book's typo. He then reads the inappropriate material, humiliating himself, shocking the audience, and almost getting Kelly arrested. Meanwhile, Ben purchases cough syrup for his ill daughter en route to the Department of Motor Vehicles; there Anthony's driving examiner, Ms. Suggs, cruelly tricks him into taking his eyes off the road by using sarcasm to persuade him to answer his cell phone. This causes Anthony to destroy several parking meters, damage the family minivan, and miserably fail his driving exam. As the entire Cooper family bemoans their collective lot, Alexander cuts in and admits his birthday wish to them. He apologizes for making everyone suffer the nightmarish day they've had. Ben disagrees: the day is not ruined yet, because it isn't over yet. Right then and there, the whole family resolves to stay as positive as they can.\nAfter renting a tuxedo for Anthony, the Coopers go to Emily's play, of which she makes a spectacular farce with her abnormally rambunctious behavior, after overdosing on extra-strength cough syrup and going out inebriated. The game-design firm calls and invites Ben to Nagamaki, a Japanese hibachi restaurant, for another meeting. The family, joined by Celia, head to the restaurant in their badly-damaged minivan. There Ben accidentally sets his shirt-sleeves on fire at the grill, embarrassing himself in front of the employers. Ben's wife and kids console him, vowing that they will overcome whatever else the day has in store for them. Alexander also points out that \"you gotta have bad days, so you can enjoy your good days even more\". Inspired by this, Anthony changes his mind about going to the prom with Celia; he states that his family is more important than she has given them credit for. Celia dumps him for good.\nThe family returns home, where an animal-rental service (hired by Ben) has recreated an Australian petting zoo for Alexander's 12th birthday party. A crocodile and kangaroo, however, have escaped from their pens. The crocodile gets into the entry hall, where he startles the family when they walk in the door. The kangaroo hops out of the yard, and Ben gives chase for several blocks, until he is kicked in the face. Both animals are returned to their pens. The Coopers decide to salvage the day by pitching in to host the party. Greg welcomes Ben as a new game-designer. Kelly discovers that the disastrous celebrity reading went viral, thus creating publicity for the book. As Ben brings out Alexander's birthday cake, Alexander wishes for more days like the one he and his family just shared."}