{"_movieID": "193756", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:48:14", "summary": "Lone Survivor is a 2013 American biographical war drama film based on the eponymous 2007 non-fiction book by Marcus Luttrell with Patrick Robinson. Set during the war in Afghanistan, it dramatizes the unsuccessful United States Navy SEALs counter-insurgent mission Operation Red Wings, during which a four-man SEAL reconnaissance and surveillance team was tasked to track down the Taliban leader Ahmad Shah. Written and directed by Peter Berg, the film stars Mark Wahlberg, Taylor Kitsch, Emile Hirsch, Ben Foster, and Eric Bana.\nUpon first learning of the book in 2007, Berg arranged several meetings with Luttrell to discuss adapting the book to film. Universal Pictures acquired the film rights in August 2007, after bidding against other major studios. In re-enacting events, Berg drew much of his screenplay from Luttrell's eyewitness accounts in the book, as well as autopsy and incident reports related to the mission. After directing Battleship (2012) for Universal, Berg resumed working on Lone Survivor. Principal photography began in October 2012 and concluded in November, after 42 days. Filming took place on location in New Mexico, using digital cinematography. Luttrell and several other Navy SEAL veterans acted as technical advisors, while multiple branches of the United States Armed Forces aided the production. Two companies, Industrial Light & Magic and Image Engine, created the visual effects.\nLone Survivor opened in limited release in the United States on December 25, 2013, before opening across North America on January 10, 2014. It received generally positive reviews; some critics praised Berg's direction, as well as the acting, story, visuals and battle sequences, while others derided the film for focusing more on its action scenes than on characterization. Lone Survivor grossed over $154 million, of which $125 million was from North America. It was chosen by National Board of Review as one of the top ten films of 2013, and received two Academy Award nominations for Best Sound Editing and Best Sound Mixing.", "plot": "In 2005, Afghanistan, Taliban leader Ahmad Shah is responsible for killing over twenty United States Marines, as well as villagers and refugees who were aiding American forces. In response to these killings, a United States Navy SEALs unit is ordered to execute a counter-insurgent mission to capture Shah. As part of the mission, a four-man SEAL reconnaissance and surveillance team is tasked with locating Shah. The four SEALs include team leader Michael Murphy; Marksmen Marcus Luttrell and Matthew Axelson and communications specialist Danny Dietz.\nThe team is inserted into the Hindu Kush region of Afghanistan, where they make a trek through the mountains where they begin to encounter communications problems. Arriving at their designated location, the SEALs are accidentally discovered by local goat herders, whom the SEALs detain. Knowing that if they release them, the herders will likely alert the Taliban to their presence, the team is split about whether to kill the herders or not. After a brief debate, the team chooses to release them and abort the mission, but before they can escape, they are attacked by Taliban forces. Although the SEALs kill several Taliban gunmen, they are heavily outnumbered and at a disadvantage, and the men take on various wounds during the firefight, worsened when they jump off the edge of a ridge and into a large ravine.\nDespite their injuries, the SEALs make a defensive retreat through the steep woods. Dietz begins to lose consciousness and shouts questions to Luttrell, unwittingly revealing the team's position. Murphy and Axelson jump off another ridge to lead the escape while Luttrell tries to carry Dietz down the mountain, but Dietz is shot again; the impact forces Luttrell to lose his grip and fall off the cliff. A dying Dietz remains at the top of the cliff and is killed. Murphy attempts to climb back up the cliff to get a phone signal in order to call for support via satellite phone with Axelson and Luttrell providing cover fire. When he finally reaches higher ground, Murphy is able to alert his unit of his team's predicament and request assistance before he is killed himself.\nIn response to Murphy's distress call, a quick reaction force made up of fellow SEALs boards Chinook helicopters and heads toward the location without gunship escort. When they arrive, the Taliban shoot down one of the helicopters, killing all eight Navy SEALs and eight Special Operations aviators aboard, including Commander Kristensen, while the second helicopter is forced back. Luttrell and Axelson are left to fend for themselves again. Axelson attempts to find cover but is killed when he leaves his hiding spot to attack several approaching insurgents. When Luttrell is discovered by the Taliban, one of the insurgents fires a rocket-propelled grenade, and its impact throws him to the bottom of a rock crevice where he is able to hide from the Taliban and eventually escape.\nLuttrell stumbles upon a small body of water where a local Pashtun villager, Mohammad Gulab, discovers him. Gulab takes Luttrell into his care, returning to his village, where he attempts to hide Luttrell in his home. Gulab then sends a mountain man to the nearest American base to alert them to Luttrell's location. Taliban fighters arrive at the village to take Luttrell, but Gulab and the villagers intervene, threatening to kill the fighters if they harm Luttrell. The fighters leave, but later return to punish the villagers for protecting Luttrell. Gulab and his villagers are initially able to fend off the attackers but are nearly overrun and Luttrell is badly wounded before American forces arrive and defeat the advancing Taliban. After thanking the villagers who had saved him, Luttrell is evacuated. He almost succumbs to his injuries but is revived in time.\nImages of the real Luttrell, Gulab and the fallen service members killed during the mission are shown during a four-minute montage, and an epilogue reveals that the Pashtun villagers agreed to help Luttrell as part of a traditional code of honor known as the Pashtunwali.", "cast": "Mark Wahlberg as Marcus Luttrell:The hospital corpsman and sniper of a four-man reconnaissance and surveillance team, SEAL Team 10. Wahlberg was the first actor to sign on as a star of the film during its early stages of development. He agreed to portray Luttrell after reading Peter Berg's script. Wahlberg chose not to read Luttrell's book Lone Survivor during production to avoid arguments with Berg over events and details that were left out in the book. \"The problem when adapting a piece of material like that is that you always feel like something is missing\", he explained. \"I wanted to come at it from this perspective.\" Of Wahlberg's portrayal, Luttrell stated, \"Wahlberg is a consummate professional, and he's a great actor. It was a little strange watching somebody trying to play me, but we talked about it and I knew it would turn out great. I was more worried about the other guys because they're not around to speak for themselves.\" Wahlberg has since cited Lone Survivor as his favorite film role as an actor and producer: \"This is the best working experience I've ever had, under the toughest conditions. I remember early on as an actor, you worked a long, hard day, but you did something you felt was special, and that car ride home you couldn't stop thinking about it. I had that feeling every day on this movie.\"Taylor Kitsch as Michael P. \"Murph\" Murphy:A lieutenant who serves as the team leader and spotter of SEAL Team 10. Lone Survivor is Kitsch's second feature film collaboration with Berg after Battleship (2012).  Kitsch said, \"Murph's actions speak louder than anything he's ever said, and they should. I think he was that type of leader who just loved his guys, and getting the nod to play this guy was something special.\" Prior to production of the film, Kitsch prepared for the role by performing high-intensity workouts with body armor and long runs with a 40-lb weighted vest.Emile Hirsch as Danny Dietz:SEAL Team 10's communications specialist and spotter. Hirsch was approached by Berg in 2009, and physically prepared for the role by attending a 90-minute weight program for nearly four months. \"I wanted a challenge, so I started to train and work out on my own\", he said. \"I genuinely didn't know what was going to happen. Months went by and it was to the point where I was passing on other movies, but I didn't have this job. I was willing to do anything. I ended up training six days a week, four to five hours a day.\"Ben Foster as Matthew \"Axe\" Axelson:SEAL Team 10's sniper. Wahlberg recommended Foster to Berg, as they had previously collaborated on Contraband (2012). Prior to filming, Foster met with the fallen serviceman's family and friends to understand the person he would be portraying. \"It was such a rich opportunity to listen to the Axelsons talk about their son. Their generosity and inclusiveness with me was so touching and open. They love to talk about their boy because they love him; so we, in turn, love him. We can't bring him back, but what we can do is aim, every day, to do the best that we can to honor him.\"Eric Bana as Erik S. Kristensen:SEAL Team 10's quick-reaction force (QRF) lieutenant commander. Bana had read the book Lone Survivor prior to production, and was willing to appear in the film, regardless of which role was offered to him. Upon being cast as Kristensen, Bana researched the fallen serviceman and his family. On joining the production of Lone Survivor, Bana stated, \"There are two factors that make this story special, and they are the reasons why I jumped on board. One is the story itself, and two is who chooses to direct a project like this. I knew how involved [Berg] would be and that he would know how to portray SEAL teammates. That was what I wanted to be a part of. The greatest way to honor these guys is to make a great film and have it stand the test of time.\" Bana did not physically prepare for the role. \"My responsibility was really to understand the role of the mission commander and the relevant information with respect with the chain of command and what it means to go in the QRF and the processes involved\", he explained. \"It was far more important to be the person that was responsible for that part of the story and understand that completely. There's no purpose in me going out and firing an M4 in this case.\"Ali Suliman, who previously collaborated with Berg on the 2007 film The Kingdom, plays Mohammad Gulab, an Afghan villager; Alexander Ludwig plays Navy SEAL Machinist's Mate Shane Patton. Marcus Luttrell appears in the film in an uncredited role. He first appears as a SEAL teammate who lightheartedly hazes Patton, then during a briefing scene where he is seen shaking his head when the Rules of Engagement are being explained, and later as one of the servicemen who perishes when a CH-47 Chinook is shot down. Luttrell said of the latter scene, \"I was on the other side of the mountain when those guys came to help me, so getting to die on the helicopter in the movie was a very powerful moment for me.\"The cast is rounded out by Yousuf Azami as Ahmad Shah, a Taliban leader; Sammy Sheik as Taraq, a field commander of the Taliban group; Rich Ting as SO2 James Suh; Dan Bilzerian as Senior Chief Special Operator (SOCS) Daniel Healy; Jerry Ferrara as United States Marine Corps Sgt Hasslert; Scott Elrod as Peter Musselman; Rohan Chand as Gulab's son; and Corey Large as US Navy SEAL Captain Kenney. Zarin Mohammad Rahimi, who acted as a technical advisor during production, appears as an elderly shepherd who discovers the four-man SEAL team during the mission; Nicholas Patel and Daniel Arroyo play the goat herders who assist the shepherd."}