{"_movieID": "120467", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:53:53", "summary": "The Grand Budapest Hotel is a 2014 comedy-drama film written and directed by Wes Anderson, from a story by Anderson and Hugo Guinness, inspired by the writings of Stefan Zweig, to whom Anderson wrote the film as a tribute. The film stars an ensemble cast consisting of Ralph Fiennes, F. Murray Abraham, Mathieu Amalric, Adrien Brody, Willem Dafoe, Jeff Goldblum, Harvey Keitel, Jude Law, Bill Murray, Edward Norton, Saoirse Ronan, Jason Schwartzman, Léa Seydoux, Tilda Swinton, Tom Wilkinson, Owen Wilson, and Tony Revolori.\nSet in the fictional war-torn European country Zubrowka in the 1930s, The Grand Budapest Hotel tells the story and friendship of two people: a concierge and the lobby boy as they team up for several misadventures while trying to prove Gustave's innocence after he was framed for murder.\nThe film is an American-German co-production that was financed by German financial companies and film-funding organizations and filmed in Germany. The Grand Budapest Hotel released to widespread critical acclaim and was financially successful, grossing about $175 million worldwide on a $25 million budget, and was included in several critics' year-end top-10 lists.The film won the Golden Globe Award for Best Motion Picture – Musical or Comedy and garnered three more Golden Globe Award nominations, including Best Director for Anderson. It was nominated for nine Academy Awards, including Best Picture and Best Director for Anderson, and won four Oscars for Best Costume Design, Best Makeup and Hairstyling, Best Production Design and Best Original Score. In a 2016 BBC poll, several critics voted the film the 21st greatest film of the 21st century.", "plot": "A teenage girl approaches a statue of a man labeled simply “Author.” The film then cuts to the Author himself as he begins to share a story about his trip to The Grand Budapest Hotel many years ago before flashing back to a younger version of the Author staying at the hotel during that period. It is here he meets the owner of the establishment, Mr. Zero Moustafa, who tells the author he enjoys his writing and invites him to dinner to share his story of how he came to own the hotel.\nOver their meal, the narrative jumps to 1932 as Zero tells about how he worked as the lobby boy at The Grand Budapest Hotel when it was flourishing. Gustave, the hotel’s meticulous and highly competent concierge, has a habit of sleeping with wealthy older guests of the hotel and is currently carrying on an affair with Madame D., a wealthy dowager countess in her 80s.\nShortly after Madame D.'s visit, Gustave learns that she has died. He and Zero go to Madame D.s home in order to pay their respects. There they find her kids, extended family, and lawyer, Mr. Kovacs, waiting to hear the reading of the countess' will. Kovacs announces only one detail; that Madame has left Gustave a priceless painting: \"Boy With Apple.\" Madame D.’s son, Dmitri, demands that Gustave be arrested. Gustave and Zero quickly leave, but not before they steal the painting off the wall and hide it for safekeeping at the hotel.\nOnce back at the Grand Budapest, Gustave is arrested for the murder of Madame D. While in prison, he becomes friends with inmates and plans an escape. He has Zero place digging tools inside pastries that Zero's girlfriend and baker, Agatha, makes for him. Gustave and the other men are able to dig their way out and part ways. Zero and Gustave make their way back to the Grand Budapest with the help of the Society of the Crossed Keys, a group of concierges that call in favors to assist each other.\nGustave, Zero, and Agatha arrive back at the Grand Budapest to find it has been taken over by the country’s army; war has broken out. Agatha sneaks in to retrieve Boy With Apple, so they can sell it and hide away. Just as she comes out with the painting, however, Dmitri enters the hotel and spots her with the painting. Gustave and Zero go inside to save her as she tries to escape from Dmitri. Dmitri opens fire on them and a gun battle erupts involving all of the soldiers staying in the hotel. Agatha’s attempt to escape leaves her and Zero hanging from the balcony of one of the rooms before they fall into a car full of pastries, which break their fall.\nAgatha discovers a note hidden on the back of the painting that states that if Madame D.’s death was caused by murder, she is leaving everything to Gustave. Gustave becomes one of the wealthiest men in the country, and the owner of The Grand Budapest Hotel, which Madame D. also secretly owned. While journeying by train, he, Zero, and Agatha are stopped by the army’s death troops who tear up Zero’s identification papers (he is a refugee). Gustave begins to fight the men and is shot dead.\nZero is Gustave’s only heir to his fortune, and this is how he inherited his great wealth, but also the reason why he traded all of his commodities for The Grand Budapest, which is now a struggling property as it holds all the memories of his time with Gustave and his relationship to Agatha, who died years earlier of tuberculosis.\nThe Author then turns this story into a book, which the young girl from the beginning of the film happily reads as she sits on a bench beside the statue of the Author."}