{"_movieID": "338766", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:16", "summary": "Hell or High Water is a 2016 American neo-western heist film directed by David Mackenzie and written by Taylor Sheridan. The film follows two brothers (Chris Pine and Ben Foster) who carry out a series of bank robberies to save their family ranch, while being pursued by two Texas Rangers (Jeff Bridges and Gil Birmingham).\nThe film premiered at the Un Certain Regard section of the 2016 Cannes Film Festival on May 16, 2016, and was theatrically released in the United States on August 12, 2016. It received critical acclaim and grossed $37 million. The American Film Institute selected it as one of its ten Movies of the Year, and it was nominated for numerous awards, including four Oscar nominations at the 89th Academy Awards: Best Picture, Best Supporting Actor (Bridges), Best Original Screenplay and Best Film Editing. It also received Golden Globe nominations for Best Picture, Best Supporting Actor for Bridges and Best Screenplay.", "plot": "In West Texas, divorced father Toby Howard (Chris Pine) and his ex-con older brother Tanner (Ben Foster) carry out early morning robberies of two branches of the Texas Midlands Bank. Though the robberies are well-planned, Tanner's wild nature leads him to take unnecessary risks, frustrating Toby.\nTwo Texas Rangers, Marcus Hamilton (Jeff Bridges) and Alberto Parker (Gil Birmingham), are on the case. Hamilton, who is close to retirement, investigates the robberies and quickly determines the brothers' methods and personalities. Meanwhile, Tanner robs another bank while Toby unknowingly waits at a nearby diner, conversing with a waitress. They take the stolen money to an Indian casino in Oklahoma to be laundered. Toby has the casino convert their gambling winnings into a check made out to the Texas Midlands Bank. With untraceable funds and gambling as a cover for how they were acquired, the brothers head back to Texas.\nBack on the ranch, they bury their getaway car in a pit with an excavator. The brothers' mother has died after a long illness, leaving their ranch in debt because of a reverse mortgage provided by the Texas Midlands Bank. If the debt is not paid off in a few days, the ranch will be foreclosed. Oil has been discovered on their land, and Toby is determined to ensure a comfortable life for his estranged sons. They rob Texas Midlands as a form of frontier justice. It is revealed that Tanner shot and killed their abusive father, before graduating to armed robbery.\nHamilton stakes out another branch of the Texas Midlands Bank, to no avail. During that time, Hamilton playfully makes fun of his partner’s half-Mexican and half-Indian heritage. Alberto responds with jokes about Hamilton’s old age. Hamilton figures a pattern to the bank robberies and determines the next target. Hamilton and Parker are en route to the bank when the final robbery occurs. Pressed for time, the brothers proceed with the heist though the bank is crowded. A shoot-out ensues when a security guard and an armed civilian fire at the brothers and Tanner kills both. Toby is shot in the abdomen as they are ambushed by a waiting posse of armed townspeople outside the bank.\nThe brothers race out of town with a larger posse in pursuit. After gaining some distance, Tanner stops and fires an automatic rifle, forcing the posse to retreat. The brothers split; Toby takes the money using another vehicle, while Tanner creates a diversion. He draws the lawmen off the trail to a desert mountain ridge where he takes potshots at the police with a sniper rifle, killing Parker. Hamilton uses a local resident and posse member's knowledge of the area to circle behind Tanner and kill him.\nDuring the standoff, Toby conceals his wound, passes through a police checkpoint without incident, and launders the stolen cash at the casino, where he sees the news report of his brother's death. He takes the casino's check to the bank just in time to avoid the ranch's foreclosure and deeds the ranch into a family trust.\nAfter retirement, Hamilton visits his former office to learn that the Rangers have cleared Toby as a suspect, as his record is clean and he has no motive to steal since the new oil wells earn more in a month than the total stolen in all of the robberies together. The money from the ranch's oil wells is deposited at the Texas Midlands Bank, which refuses to co-operate with the investigation for fear of losing management of the family's trust fund.\nHamilton visits Toby's ranch. Although they stay civil, Hamilton states that he knows Toby masterminded and took part in the robberies, but wishes to know the reason. Toby says he has resolved not to let poverty affect his sons like it affected him and Tanner. Hamilton tells Toby he holds him responsible for the death of his partner, and just as a Mexican standoff starts to occur, they are interrupted when Toby's ex-wife and children arrive. The ranch belongs to the trust and thus to them; Toby is only there to visit and fix up the house. As Hamilton departs, Toby suggests they meet again soon to \"finish the conversation\" and \"bring you some peace\". Hamilton leaves, without giving Toby any absolution."}