{"_movieID": "41733", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:47:10", "summary": "Due Date is a 2010 American black comedy film directed by Todd Phillips and written by Phillips, Alan R. Cohen, Alan Freedland, and Adam Sztykiel. The film follows a man (Robert Downey Jr.) who must get across the country to Los Angeles in time for the birth of his child and is forced to road-trip with an aspiring actor (Zach Galifianakis). Michelle Monaghan, Juliette Lewis, and Jamie Foxx also star.\nShot in Las Cruces, New Mexico, Atlanta, Georgia, and Tuscaloosa, Alabama, the film was released on November 5, 2010. It received mixed reviews from critics and grossed $211 million worldwide.", "plot": "Peter Highman (Robert Downey Jr.), a successful architect, is due to fly home from Atlanta to Los Angeles to be with his wife Sarah (Michelle Monaghan), who is about to give birth. On the way to the airport, he has a chance encounter with Ethan Tremblay (Zach Galifianakis), who is going to LA to be an actor and is planning to scatter his recently deceased father's ashes at the Grand Canyon. When Ethan misuses the words \"terrorist\" and \"bomb\" while talking to Peter, they are both escorted off the plane. This is only the first of a series of misadventures caused by the drastically dysfunctional Ethan. Peter, now on the No Fly List and missing his wallet, agrees to drive with Ethan to Los Angeles.\nEthan stops to buy marijuana, and Peter discovers that they are nearly out of money. Since Peter has no I.D., he gets his wife to wire the money to Ethan, but discovers Ethan had the money wired to his stage name instead of his legal name. When the Western Union employee (Danny McBride) refuses to accept Ethan's \"Stage name I.D.\" it leads to a violent altercation.\nAfter a night at a rest stop, Peter decides to drive off and abandon Ethan, but realizes that he has forgotten to unload the ashes of Ethan's father when he left. This causes him to wrestle with his conscience, before deciding to return. Ethan takes over driver duty so Peter can get some rest after a sleepless night, but he falls asleep at the wheel and crashes the car. Peter calls his friend, Darryl (Jamie Foxx), for assistance and decides to part with Ethan, but Darryl persuades Peter otherwise. They arrive at Darryl's house for rest. During their conversation, Ethan discovers hints that Sarah may have been unfaithful, triggering Peter to question Sarah's timely pregnancy. Darryl throws both of them out after mistakenly drinking some of Ethan's father's ashes, which were stored in a coffee tin.\nWhen Darryl lets them use his Range Rover to make the rest of the trip, Ethan mistakenly drives to the Mexico–United States border. Despite assuring Peter that he'll handle the situation, Ethan flees, and Peter is arrested for possession of marijuana. The Mexican Federal Police lock Peter up, but Ethan steals a truck and breaks him out, causing several car crashes in the process.\nPeter decides to stop at the Grand Canyon for Ethan, who finally scatters his father's ashes. Peter then confesses that he tried to leave Ethan at the rest area. Ethan makes a confession of his own: he has had Peter's wallet and I.D the entire time. Peter seemingly forgives him but then attacks Ethan in a rage, but is interrupted by a call from Sarah, who has just gone into labor. Peter and Ethan leave for California. Ethan finds a gun in the truck and he accidentally shoots Peter. Arriving at the hospital where Sarah is in labor, Peter passes out from loss of blood.\nSarah delivers the baby safely, and Peter expresses his discomfort at his new daughter being named Rosie Highman. Ethan leaves while telling Peter to call him. At the end, Ethan guest stars on an episode of his favorite television program, Two and a Half Men with Peter and Sarah watching it in bed with their daughter.", "cast": "Angus T. Jones was in the Two and a Half Men scene as Jake Harper, but the scene was cut short, and his cameo was not shown in the original run. Alan Arkin filmed scenes as Peter's long lost father, but they were not left in the final cut of the film."}