{"_movieID": "407436", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:10", "summary": "Mowgli: Legend of the Jungle (also known and stylized on screen simply as Mowgli) is a 2018 adventure drama film directed by Andy Serkis with a screenplay by Callie Kloves, based on stories collected in All the Mowgli Stories by Rudyard Kipling. The film stars Rohan Chand, Matthew Rhys, and Freida Pinto, along with voice and motion capture performances from Christian Bale, Cate Blanchett, Benedict Cumberbatch, Naomie Harris, and Serkis.\nTalks of a new Jungle Book film from Warner Bros. Pictures began in 2012 and various directors, including Steve Kloves, Ron Howard, and Alejandro González Iñárritu, were approached before Serkis was confirmed in March 2014. Much of the cast signed on that August and principal photography began in March 2015. Filming took place in South Africa and at Warner Bros. Studios in Leavesden, England.\nOriginally scheduled to be released in October 2016 by Warner Bros. Pictures, the film was delayed numerous times to work on the visual effects and to create space between itself and the April 2016 release of Walt Disney Pictures' own Jungle Book adaptation. In July 2018, Warner Bros. Pictures sold the rights for the film to Netflix. The film was released in select theaters on November 29, 2018, followed by its subsequent digital Netflix release on December 7, 2018. It received mixed reviews from critics, who praised the cast, visual effects, and Serkis' direction, but many compared it unfavorably to the Disney film and criticized the uneven tone, calling it a \"messy—if ambitious—misfire\".", "plot": "In the jungle, Kaa, an Indian python seer, watches as Shere Khan, a crippled Bengal tiger, breaks jungle-law by hunting down a family of humans, with only a child escaping. Bagheera, a panther drawn to the scene, rescues the man-cub, Mowgli, and takes him to a family of Indian wolves being raised by Nisha and Vihaan, only for Tabaqui, Shere Khan's hyena lieutenant, to find the boy before he is chased off. They take the infant Mowgli before the wolf council and Akela, the leader of the pack, to decide his destiny with Bagheera buying his life with a kill and Baloo strong-armed into agreeing. Shere Khan arrives to kill Mowgli, but Akela stops him, saying the boy is now under the protection of the pack and forces Shere Khan to leave. Shere Khan swears he would return when Akela misses his prey.\nFor many years after, Mowgli lives amongst the wolf pack. One day, Mowgli goes swimming alone and encounters Shere Khan. He manages to escape the tiger, but then falls into a pit. He is saved by an Indian elephant missing a tusk. Bagheera finds Mowgli and takes him home. Though Bagheera reveals to Mowgli that he is a human and he will be safe if he goes to the Man-Village, Mowgli declares that he wishes to be a wolf. He further declares that he will only go if he fails the pack's trial, which would determine if he can become a full member of the pack.\nDuring the trial, Bagheera, acting as a predator to chase the young wolves and test their strength, continually chases Mowgli and causes him to fail when he would have come in first. As Baloo scolds Bagheera for being too aggressive, Mowgli is kidnapped by the Bandar-log on Tabaqui's orders for Shere Khan. Shere Khan attempts to kill Mowgli while he is unconscious but is stopped by Baloo and Bagheera. During their battle with Shere Khan's monkey minions, they are overwhelmed, only for Kaa herself to appear and save Mowgli.\nMowgli learns that Kaa has been watching him the whole time and that she believes that he has the power to change the jungle. She then directs him to face Shere Khan, who is again challenging Akela for Mowgli when he finally missed his prey. Mowgli stops the tiger and Akela's challengers with fire taken from the Man-Village but shames himself in Akela's eyes and is forced to leave the pack. At the Man-Village, Mowgli is captured by the villagers when British colonial hunter John Lockwood knocks him out. Bagheera visits him and sadly tells him to stay, encouraging the boy to gain their trust, as Bagheera once did to escape captivity when he was young. Mowgli slowly comes to enjoy human and village life, being raised by the kindly Messua and learning hunting skills from Lockwood.\nHowever, Mowgli's attitude towards Lockwood changes when he sees that Lockwood hunts for sport and has killed Bhoot, an albinoid wolf-cub friend of Mowgli. He also learns that Shere Khan has driven the wolves loyal to Akela to the edge of the jungle after being informed by Gray Brother. Mowgli meets with Baloo, Bagheera, and the wolf pack, declaring that Shere Khan must die. The animals feel obligated to remain out of the conflict as it would break jungle-law to fight Shere Khan.\nRegardless, Mowgli proceeds with his plan and lures Shere Khan to the edge of the village, where with the help of the elephants, he mortally wounds the tiger while Tabaqui flees. However, Lockwood accidentally injures Mowgli with a bullet while trying to kill the tiger, and shoots Akela when the wolf saves Mowgli from Shere Khan. Lockwood is killed by the broken-tusked elephant before he can do more harm, and the other animals rally to Mowgli upon seeing his resolve. Akela gives Mowgli his blessing to lead the jungle's creatures and the wolf-pack before he dies peacefully. Mowgli decides to leave the village behind and returns to the jungle, where he stabs the wounded Shere Khan, finally killing the tiger and ending his reign of terror. Mowgli is re-accepted as a member of the jungle.\nKaa goes on to say that with Shere Khan and Lockwood gone, Mowgli gave the jungle a voice. As long as Mowgli lived and watched over it, there was peace in the jungle.", "cast": "Rohan Chand as Mowgli, a feral boy who is raised by wolves.\nMatthew Rhys as John Lockwood, a colonial hunter who hunts for trophies and comes to hunt Shere Khan.\nFreida Pinto as Messua, a woman who takes in Mowgli."}