{"_movieID": "644", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:29", "summary": "A.I. Artificial Intelligence, also known as A.I., is a 2001 American science fiction drama film directed by Steven Spielberg. The screenplay by Spielberg and screen story by Ian Watson were loosely based on the 1969 short story \"Supertoys Last All Summer Long\" by Brian Aldiss. The film was produced by Kathleen Kennedy, Spielberg and Bonnie Curtis. It stars Haley Joel Osment, Jude Law, Frances O'Connor, Brendan Gleeson and William Hurt. Set in a futuristic post-climate change society, A.I. tells the story of David (Osment), a child-like android uniquely programmed with the ability to love.\nDevelopment of A.I. originally began with producer-director Stanley Kubrick, after he acquired the rights to Aldiss' story in the early 1970s. Kubrick hired a series of writers until the mid-1990s, including Brian Aldiss, Bob Shaw, Ian Watson, and Sara Maitland. The film languished in protracted development for years, partly because Kubrick felt computer-generated imagery was not advanced enough to create the David character, whom he believed no child actor would convincingly portray. In 1995, Kubrick handed A.I. to Spielberg, but the film did not gain momentum until Kubrick's death in 1999. Spielberg remained close to Watson's film treatment for the screenplay.\nThe film received positive reviews, and grossed approximately $235 million. The film was nominated for two Academy Awards at the 74th Academy Awards, for Best Visual Effects and Best Original Score (by John Williams).\nIn a 2016 BBC poll of 177 critics around the world, Steven Spielberg's A.I. Artificial Intelligence was voted the eighty-third-greatest film since 2000. A.I. is dedicated to Stanley Kubrick.", "plot": "In the 22nd century, rising sea levels from global warming have wiped out coastal cities, reducing the world's population. Mecha, humanoid robots seemingly capable of complex thought but lacking in emotions, have been created. In Madison, David, a prototype Mecha child capable of experiencing love, is given to Henry Swinton and his wife Monica, whose son Martin contracted a rare disease and has been placed in suspended animation. Monica feels uneasy with David, but eventually warms to him and activates his imprinting protocol, causing him to have an enduring childlike love for her. David seeks to have Monica express the same love towards him. David is befriended by Teddy, a robotic teddy bear that belonged to Martin. Martin is unexpectedly cured of his disease and brought home. Martin becomes jealous of David, and taunts him to perform worrisome acts, such as cutting off locks of Monica's hair while she is sleeping. At a pool party, one of Martin's friends pokes David with a knife, triggering his self-protection programming. David grabs onto Martin, and they both fall into the pool. Martin is saved before he drowns, and Henry convinces Monica to return David to his creators to be destroyed. On the way there, Monica has a change of heart and spares David from destruction by leaving him in the woods. With Teddy as his only accompaniment, David recalls The Adventures of Pinocchio and decides to find the Blue Fairy so that she may turn him into a real boy, which he believes will win back Monica's love.\nDavid and Teddy are captured by a Flesh Fair, where obsolete Mecha are destroyed before jubilant crowds. David is nearly destroyed himself and pleads for his life. The audience, deceived by David's realistic nature, revolts and allows David to escape alongside Gigolo Joe, a male prostitute Mecha on the run from authorities after being charged with murder. David, Teddy and Joe go to the decadent resort town of Rouge City, where \"Dr. Know\", a holographic answer engine, directs them to the top of Rockefeller Center in the flooded ruins of Manhattan. There, David meets Professor Hobby, his creator, who tells him that their meeting demonstrates David's ability to love and desire. David finds several copies of him, including a female variant Darlene, boxed and ready to be shipped. Disheartened by his lost sense of individuality, David attempts suicide by falling from a skyscraper into the ocean. While underwater, David catches sight of a figure resembling the Blue Fairy before Joe rescues him in an amphibious aircraft. Before David can explain, Joe is captured via electromagnet by authorities. David and Teddy take control of the aircraft to see the Fairy, which turns out to be a statue from an attraction on Coney Island. The two become trapped when the Wonder Wheel falls on their vehicle. Believing the Blue Fairy to be real, David asks the statue to turn him into a real boy, and repeats this request until his internal power source is depleted.\nTwo thousand years later, humans are extinct and Manhattan is buried under glacial ice. The Mecha have evolved into an advanced form called Specialists, and have become interested in learning about humanity. They find and revive David and Teddy. David walks to the frozen Blue Fairy statue, which collapses when he touches it. The Specialists reconstruct the Swinton family home from David's memories and explain to him, via an interactive image of the Blue Fairy, that it is impossible to make David a real boy. However, at David's insistence, they recreate Monica through genetic material from the strand of hair that Teddy kept. This Monica can only live for one day, and the process cannot be repeated. David spends his happiest day with Monica, and as she falls asleep in the evening, she tells David that she has always loved him: \"the everlasting moment he had been waiting for\", the narrator says. David falls asleep as well.", "cast": "Haley Joel Osment as David. Osment was Spielberg's first and only choice for the role. To portray the character, Osment avoided blinking his eyes and \"programmed\" himself with good posture.\nJude Law as Gigolo Joe. To prepare for the role, Law studied the acting of Fred Astaire and Gene Kelly, whose movements Joe emulates.\nFrances O'Connor as Monica Swinton\nSam Robards as Henry Swinton\nJake Thomas as Martin Swinton\nWilliam Hurt as Professor Allen Hobby\nBrendan Gleeson as Flesh Fair impresario Lord Johnson-Johnson\nJack Angel as Teddy (voice)\nRobin Williams as Dr. Know (voice)\nBen Kingsley as Specialist (voice)\nMeryl Streep as the Blue Fairy (voice)\nChris Rock as Comedian Robot (voice)\nMinistry as flesh fair band"}