{"_movieID": "308504", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:12", "summary": "Last Knights is a 2015 action drama film directed by Kazuaki Kiriya and written by Michael Konyves and Dove Sussman, based on the legend of the forty-seven rōnin. The film, a joint production between the UK, Czech Republic and South Korea, stars Clive Owen and Morgan Freeman in the lead roles. It centres on a band of warriors who seek to avenge the loss of their master at the hands of a corrupt minister. The film had its limited release on 3 April 2015, by Lionsgate and was released to video on demand on 30 June 2015. The film was dedicated to the memory of actor Dave Legeno, who died in 2014.", "plot": "Bartok, an aging nobleman, watches over his estate—a vassal kingdom to a great empire. Protecting the Bartok clan is Commander Raiden and his elite soldiers, who also serve Bartok. Raiden is surprised when Bartok tells him he is to be his heir, and gives him a sword. The empire has become corrupt and the evil minister, Geza Mott, humiliates Bartok by beating him with a stick for failing to provide an adequate bribe, until Bartok retaliates—which is treason against the crown. Bartok is put to trial where he speaks openly of his disdain for what honour has become in the empire. He is sentenced to death and Raiden is ordered to execute his own master. Bartok's estate is divided and the Bartok clan is disbanded. Geza Mott suspects Raiden will demand vengeance, and has his trusted warrior, Ito, watch Raiden to ensure there is no possibility of revenge.\nA year passes and Raiden is now a drunk. Geza is still highly fearful of Raiden's wrath and demands half his father-in-law Auguste's, troops to safeguard him while he completes construction of his newly fortified estate, with more soldiers than the emperor's own security detail. Geza is eventually promoted to First Council to the Emperor who chides Geza for his behavior and obsession with Raiden. Raiden's wife, Naomi, couldn't bear to be with him as he had fallen so low, with Raiden even selling his sword for more drink and is hated by his own men for killing Bartok. When Bartok's virgin daughter is offered to Raiden in a whorehouse, he shows no concern for her but leaves the premises. Geza finally lets his guard down and stops watching Raiden. It is now revealed that Raiden and the Bartok clan soldiers sacrificed everything for the illusion of a complete defeat, and have been waiting for the right time to group and together regain the clan's honour by avenging their master's death.\nRaiden's men have been working in secret, building up contacts and connections, and gathering intelligence about Geza's estate—even secretly altering his estate to help them in their cause. As Raiden's men infiltrate the estate, Auguste, who is a trusted old friend of Bartok's, has secretly made a pact with Raiden to help him, in exchange for Raiden's help to free his daughter from her marriage to Geza Mott. Geza has always mistreated Auguste's daughter which, along with Bartok's execution, causes Auguste to see that his vicious son-in-law has no honour. As part of their plan, Auguste helps smuggle Raiden's youngest man, Gabriel, into the estate ahead of time. Raiden and his men successfully infiltrate Geza's estate, are discovered, and need to face a large number of soldiers.\nRaiden's men fall one by one as they enter deep into Geza's estate. Ito takes responsibility for his complacency and duels with Raiden. Ito's sword fails and Raiden kills him. Ito's remaining men surrender out of respect for Raiden's victory. Raiden breaks into Geza's bedroom and decapitates him as Geza make a failed attack of his own. With Geza dead, Raiden's surviving group rescues Bartok's daughter and tells her that Bartok's honour is restored. When word reaches the Emperor, he discusses with his council on how to deal with Bartok's soldiers, who caution him against the risk of turning the people against the crown. They realise that the public view Geza's death as a righteous one, and widely support the Bartok clan. The council advises that any judgement should restore their honour, rather than make them martyrs. Raiden asks that he be the only one executed for Geza's death, an idea that Auguste relays on his behalf.\nThe crown publicly admits the righteousness of the Bartok clan, but also reminds the crowd that killing a high council member is still the same as an attack on the emperor and Raiden is next to be executed for his defiance. Before his execution, Raiden charges Lieutenant Cortez to take control of the surviving Bartok clan. In a flashback, he sees Naomi one last time to apologise for her suffering before making peace with his own life, Naomi having left him as a willing part of the plan. Raiden lowers his head with his eyes closed, and as the executioner draws his sword back, Raiden's eyes suddenly open wide and the screen goes to black so two ends are possible: Raiden lives or dies.", "cast": "Clive Owen as Raiden\nMorgan Freeman as Bartok\nCliff Curtis as Lieutenant Cortez\nAksel Hennie as Geza Mott\nDave Legeno as Olaf\nAyelet Zurer as Naomi\nShohreh Aghdashloo as Maria\nAhn Sung-ki as Auguste\nTsuyoshi Ihara as Ito\nPark Si-yeon as Hannah\nGiorgio Caputo as Slim Tully\nJames Babson as Fat Jim\nPeyman Moaadi as Emperor\nNoah Silver as Gabriel"}