{"_movieID": "37495", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:03:54", "summary": "Four Lions is a 2010 British satirical dark comedy film, directed by Chris Morris in his directorial debut, and written by Morris, Sam Bain and Jesse Armstrong. The film, a jihad satire following a group of homegrown terrorist jihadis from Sheffield, South Yorkshire, England, stars Riz Ahmed, Kayvan Novak, Nigel Lindsay, Arsher Ali and Adeel Akhtar.", "plot": "A group of radicalised young British Muslim men aspire to be suicide bombers. They are Omar (Riz Ahmed), who is deeply critical of Western society and imperialism; his dim-witted cousin Waj (Kayvan Novak); Barry (Nigel Lindsay), a bad-tempered and extremely rash white convert to Islam; and the naive Faisal (Adeel Akhtar), who tries to train crows to be used as bombers. While Omar and Waj travel to an al Qaeda-affiliated training camp in Pakistan, Barry recruits a reluctant fifth member, Hassan (Arsher Ali). The training trip ends in disaster when Omar attempts to shoot down an American drone and accidentally destroys part of the camp; the pair are forced to flee. However, Omar uses the experience to assert authority on his return to Britain. Omar and Waj don't trust Hassan when they first meet him at the airport, but Omar decides to keep him in the plan because if he kicked Hassan out of the plan he'd have to murder him to stop him from telling the police.\nThe group begins acquiring materials used to make the explosive TATP but disagree about what to target. Barry wants to bomb a local mosque as a false flag operation to \"radicalise the moderates\", but Omar considers this idiotic. Faisal suggests blowing up a branch of the pharmacy chain Boots because it sells contraceptives and tampons, but Omar states it is a not a worthwhile target. Omar's brother visits him and tries to talk him out of doing anything violent; however, Omar and his wife mock him for keeping his wife in a small room and squirt him with water pistols, making him flee. Barry, Faisal and Waj blow up Omar's microwave while fireworks are going off and leave Hassan to guard their safe house. Omar berates Barry for doing this because he was supposed to see it and because he wanted Barry to guard the safe house because he thinks that Barry is being watched by the police. He and Barry get into an argument but are interrupted when the others find Hassan dancing with an oblivious neighbour (Julia Davis). The group suspect they have been compromised and transport their volatile explosives to a new location in grocery bags. Faisal trips up while crossing a field and is killed in the explosion. This angers Omar, who berates the others and leaves. Faisal's head is found and Omar visits the others to tell them. They reconcile, and Omar decides to target the upcoming London Marathon due to having access to mascot costumes, which they use to conceal the explosives.\nThey drive to London in their costumes and prepare to attack. Waj expresses doubts about the morality of their plot, but Omar convinces him. A police officer approaches the group and they talk to the officer. As he is walking away, Hassan loses his nerve and tries to alert him, but is killed when Barry detonates his bomb remotely. The remaining three panic and run away, and the police start searching for them.\nOmar has a change of heart, feeling guilt about manipulating the easily led Waj into dying for a cause he doesn't understand, and attempts to prevent the attack. Police snipers receive Omar's description and shoot at him as he attempts to blend in with the runners, but mistakenly kill a bystander in a similar costume instead. Waj is cornered by police in a kebab shop and takes the staff hostage and Omar contacts Waj from his mobile phone and convinces him to let most of the hostages go except for one. Barry finds Omar and attacks him and swallows the phone's SIM card. However, Barry begins to choke on it, provoking a passer-by to carry out the Heimlich manoeuvre and in the process detonate his bomb, killing them both as Omar flees.\nOmar attempts to buy a phone at a phone shop to talk to Waj but is frustrated that he can't just buy a phone and leaves. Omar spots a coworker (Craig Parkinson) and borrows his phone. He attempts to talk Waj down, but his call is interrupted when the police charge in and kill a hostage whom they mistake for Waj. Confused, Waj detonates his bomb, killing himself and the officers. Distraught, Omar walks into a pharmacy and blows himself up. In an epilogue, it is revealed that the police later arrested Omar's innocent brother as a terrorist; that they deflect responsibility for shooting the bystander; and that Omar unknowingly killed Osama Bin Laden when misfiring his rocket in Pakistan.", "cast": "Riz Ahmed as Omar, a security guard and the only slightly competent jihadi in his terrorist cell.\nKayvan Novak as Waj, the cousin of Omar; although stupid, he has enough sense to consult Omar or Barry before making decisions.\nNigel Lindsay as Barry / Azzam Al-Britani, a rash convert with an explosive temper and the founder of the \"Islamic State of Tinsley\".\nAdeel Akhtar as Faisal, a complete idiot who always trusts Barry. Has a father who may have dementia as he sees \"creatures\" that are not there.\nArsher Ali as Hassan Malik, a rapper who joins the cell after Barry witnesses him pretending to blow himself up at a conference.\nCraig Parkinson as Matt, a security guard and Omar's coworker.\nPreeya Kalidas as Sofia, Omar's wife and a nurse in a local hospital.\nJulia Davis as Alice\nBenedict Cumberbatch as Ed, a Special Branch Negotiator\nAlex MacQueen as Malcolm Storge MP, a member of the Counter Terrorism Strategy Unit\nKevin Eldon as Sniper\nDarren Boyd as Sniper\nMohammad Aqil as Mahmood, Omar's young son.\nWazim Takir as Ahmed, Omar's devoutly conservative but pacifist brother.\nWilliam El-Gardi as Khalid"}