{"_movieID": "297596", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:21", "summary": "Dying of the Light is American author George R. R. Martin's first novel, published in 1977 by Simon & Schuster. Martin's original title for this science fiction novel was After the Festival; its title was changed before its first hardcover publication. The novel was nominated for both the Hugo Award for Best Novel in 1978, and the British Fantasy Award in 1979.Dying of the Light is set in the same fictional \"Thousand Worlds\" universe as several of Martin's other works, including Sandkings, Nightflyers, A Song for Lya, \"The Way of Cross and Dragon\" and the stories collected in Tuf Voyaging.", "plot": "The novel takes place on the planet of Worlorn, a world which is dying. It is a rogue planet whose erratic course is taking it irreversibly away from its neighboring stars into a region of cold and dark space where no life will survive. Worlorn's 14 cities, built during a brief window when the world passed close enough to a red giant star to permit life to thrive, are dying, too. Constructed to celebrate the diverse cultures of 14 planetary systems, they have largely been abandoned, allowing their systems and maintenance to fail.\nThe cast is a group of characters who are also flirting with death. Dirk t'Larien, the protagonist, finds life empty and of little attraction after his girlfriend Gwen Delvano leaves him. Most poignant of all, the Kavalar race, into which she has \"married,\" is dying culturally. Their home planet has survived numerous attacks in a planetary war, and in response they have evolved social institutions and human relationship patterns to cope with the depredation of the war. Yet now that the war is long past, they find themselves trapped between those who would recognize that the old ways need to be reviewed for the current day and those who believe that any dilution of the old ways spells the end of Kavalar culture.\nThe battles, then, of all these varying actors are played out beneath the dying light falling on Worlorn. By the novel's end, many of the characters have died, though some endings are deliberately left ambiguous. Nonetheless, they have all faced their fears of death and of life."}