{"_movieID": "116745", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:25", "summary": "\"The Secret Life of Walter Mitty\" (1939) is a short story by James Thurber. The most famous of Thurber's stories, it first appeared in The New Yorker on March 18, 1939, and was first collected in his book My World and Welcome to It (Harcourt, Brace and Company, 1942). It has since been reprinted in James Thurber: Writings and Drawings (The Library of America, 1996, ISBN 1-883011-22-1), is available on-line on the New Yorker website, and is one of the most anthologized short stories in American literature. The story is considered one of Thurber's \"acknowledged masterpieces\". It was made into a 1947 movie of the same name, with Danny Kaye in the title role, though the movie is very different from the original story. It was also adapted into a 2013 film, which is again very different from the original.\nThe name Walter Mitty and the derivative word \"Mittyesque\" have entered the English language, denoting an ineffectual person who spends more time in heroic daydreams than paying attention to the real world, or more seriously, one who intentionally attempts to mislead or convince others that he is something that he is not.\nWarner Brothers studio head Jack L. Warner in his autobiography My First Hundred Years in Hollywood, described the actor Errol Flynn in the following way: \"To the Walter Mittys of the world he was all the heroes in one magnificent, sexy, animal package\".", "plot": "The short story deals with a vague and mild-mannered man who drives into Waterbury, Connecticut, with his wife for their regular weekly shopping and his wife's visit to the beauty parlor. During this time he has five heroic daydream episodes. The first is as a pilot of a U.S. Navy flying boat in a storm, then he is a magnificent surgeon performing a one-of-a-kind surgery, then as a deadly assassin testifying in a courtroom, and then as a Royal Air Force pilot volunteering for a daring, secret suicide mission to bomb an ammunition dump. As the story ends, Mitty imagines himself facing a firing squad, \"inscrutable to the last.\"\nEach of the fantasies is inspired by some detail of Mitty's mundane surroundings:\n\nThe powering up of the \"Navy hydroplane\" in the opening scene is followed by Mrs. Mitty's complaint that Mitty is \"driving too fast\".\nMitty's turn as a brilliant surgeon immediately follows his taking off and putting on his gloves as a surgeon dons surgical gloves, and driving past a hospital.\nThe courtroom drama cliché \"Perhaps this will refresh your memory,\" which begins the third fantasy, follows Mitty's attempt to remember what his wife told him to buy, when he hears a newsboy shouting about \"the Waterbury Trial\"\nMitty's fourth daydream comes as he waits for his wife and picks up an old copy of Liberty, reading \"Can Germany Conquer the World Through the Air?\", and envisions himself fighting Germany while volunteering to pilot a plane normally piloted by two people.\nThe closing firing-squad scene comes when Mitty is standing against a wall, smoking."}