{"_movieID": "351044", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:57:36", "summary": "Welcome to Marwen is a 2018 American drama film directed by Robert Zemeckis, who co-wrote the script with Caroline Thompson. It is inspired by Jeff Malmberg's 2010 documentary Marwencol. The film stars Steve Carell, Leslie Mann, Diane Kruger, Merritt Wever, Janelle Monáe, Eiza González, Gwendoline Christie, Leslie Zemeckis, Siobhan Williams and Neil Jackson, and follows the true story of Mark Hogancamp, a man struggling with PTSD who, after being physically assaulted, creates a fictional village to ease his trauma. \nThe film was released in the United States by Universal Pictures on December 21, 2018. Critics lamented the inconsistent tone and screenplay, although the visuals received some praise. The film was also a box office bomb, with Universal losing $60 million on the film.", "plot": "A World War II warplane piloted by a doll-like figure is hit by enemy fire and forced to ditch. The pilot's shoes are burned in the landing and he finds women's shoes, which he wears instead. The pilot is confronted by doll-like German soldiers, who taunt him for wearing women's shoes. The Germans threaten to emasculate him, but are killed by a group of doll-like women who come to the pilot's rescue and protect him.\nIt is revealed that the scenario is part of an elaborate fantasy created by Mark Hogancamp, using modified fashion dolls in a model village named Marwen. Mark imagines that the dolls are alive and photographs his fantasies to help him cope with acute memory loss and posttraumatic stress disorder from a brutal attack he suffered some time earlier, when he drunkenly told a group of white supremacists about his fetish for wearing women's shoes. The dolls correspond to people that he knows in real life: himself as \"Cap'n Hogie\", the pilot; various female friends as his protectors; and his attackers as German Nazi soldiers. A green-haired doll named Deja Thoris is a Belgian Witch who prevents Cap'n Hogie from becoming too close with any woman.\nMark finally agrees to appear in court to deliver a victim impact statement after much coaxing from his attorney and friends, but upon seeing his attackers, he imagines them as Nazi soldiers shooting at him, and becomes terrified and flees, causing the judge to postpone the hearing.\nMark falls in love with a woman named Nicol who has just moved in across the street, whom he has added to his fantasy. Mark imagines that the doll Nicol is in love with Cap'n Hogie, and that they get married. In real life, Mark proposes marriage to Nicol, who tells him she wishes to remain only friends. Mark is distraught and contemplates suicide. In his fantasies, Nicol is shot by a Nazi, who in turn is killed by Cap'n Hogie but brought back to life, along with other Nazi soldiers, by Deja Thoris. Cap'n Hogie realizes that Deja Thoris is a Nazi spy, and Mark realizes that the pills that he thought were helping him were actually hurting him. Mark pours the pills down the sink and vows to break his addiction to them.\nMark attends the rescheduled sentencing hearing and delivers his statement. That evening Mark attends the exhibition of his work and makes a date with his friend Roberta, who is a sales clerk at the hobby store where he is a frequent customer. The film ends with a photograph of the real Mark Hogancamp, who has a successful career as a photographer.", "cast": "Steve Carell as Mark Hogancamp, an aspiring artist who was beaten up by five men for expressing his fetish for women's shoes, and creates a miniature village called Marwen (later called Marwencol).\nSteve Carell also portrays Cap'n Hogie, a pilot and Hogancamp's heroic counterpart in Marwen.\nLeslie Mann as Nicol, Mark's new neighbor.\nMann also portrays her Marwen counterpart, a new addition to the village who starts a romance with Hogie.\nDiane Kruger as Deja Thoris, the Belgian Witch of the fictional Marwen who curses Hogie and is secretly a Nazi spy.\nMerritt Wever as Roberta, a kind friend of Mark who works at the hobby shop where he buys the models and toy figurines he uses to build Marwen.\nWever also portrays her Marwen counterpart, a member of Hogie's team who uses heavy artillery.\nJanelle Monáe as Julie, a social worker who befriends Mark while in rehab.\nMonáe also portrays her Marwen counterpart G.I. Julie, a veteran in Hogi's team.\nEiza González as Carlala, Mark's friend at the bar where he has a part-time job.\nGonzález also portrays her Marwen counterpart, a member of Hogi's team who drives their jeep.\nGwendoline Christie as Anna, Mark's Russian caretaker.\nChristie also portrays her Marwen counterpart, a Soviet member of Hogi's team.\nLeslie Zemeckis as Suzette, Mark's favorite actress.\nZemeckis also portrays her Marwen counterpart, a French member of Hogi's team.\nSiobhan Williams as Elsa\nNeil Jackson as Kurt, Nicol's rough and poorly mannered ex-boyfriend.\nNeil Jackson also portrays Major Meyer, a member of the Schutzstaffel in Marwen\nFalk Hentschel as Hauptsturmführer Ludwig Topf, Deja Thoris's henchman in Marwen and a Nazi commander\nFalk Hentschel also portrays Louis, one of the Neo-Nazis that assaulted Mark\nMatt O'Leary as Lt. Benz, a Nazi soldier in Marwen\nMatt O'Leary also portrays Carl, one of the Neo-Nazis that assaulted Mark\nNikolai Witschl as Rudolph, a Nazi soldier in Marwen\nNikolai Witschl also portrays Rudy, one of the Neo-Nazis that assaulted Mark\nPatrick Roccas as Stefan, a Nazi soldier in Marwen\nPatrick Roccas also portrays Stevie, one of the Neo-Nazis that assaulted Mark\nAlexander Lowe as Werner, a Nazi soldier in Marwen\nAlexander Lowe also portrays Vern, one of the Neo-Nazis that assaulted Mark\nEric Keenleyside as Larry\nEric Keenleyside also portrays a Friar\nStefanie von Pfetten as Wendy\nConrad Coates as Demaryius Johnson\nVeena Sood as Judge Martha J. HarterUlster County Sheriffs portrayed by Fraser Aitcheson, Trevor Jones, Brad Kelly, Jeff Sanca, and Patrick Sabongui."}