{"_movieID": "84305", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:54:47", "summary": "Lay the Favorite (promoted as Lay the Favourite in the UK) is a 2012 American comedy-drama film starring Bruce Willis, Rebecca Hall, Catherine Zeta-Jones and Joshua Jackson. Based on Beth Raymer's memoir of the same title, the film follows a young, free-spirited woman as she journeys through the legal and illegal world of sports gambling. The film was directed by Stephen Frears.\n\n", "plot": "Beth is becoming bored with her life in Florida, doing stripteases and lap dances for private customers. Her dad, Jerry, tells her to follow her dream of moving to Las Vegas, where she seeks honest work as a cocktail waitress.\nA young woman named Holly, who lives at the same Vegas motel, arranges for Beth to meet Dink Heimowitz, a professional gambler who follows the fast-changing odds on sporting events and employs assistants at Dink, Inc., to lay big-money bets for him. Beth is intrigued and it turns out she has a good mind for numbers, easily grasping Dink's system and becoming his protégée and he views her as his lucky charm.  When Beth begins expressing a more personal interest in her much-older mentor, Dink's sharp-tongued wife, Tulip, lets it be known in no uncertain terms that she wants Beth out of her husband's life.  As a result, from pressure from his wife, Dink lets Beth go.\nA young journalist from New York, Jeremy, meets Beth in the casino and they immediately hit it off and she makes plans to move back to New York with him, having nothing left in Las Vegas to keep her there.  She is hooked on the excitement and income that gambling provides and backs out suddenly whenever Dink, facing a heavy losing streak without his lucky charm, asks her to come back to work for him.\nWhenever Dink's losing streak continues even with Beth's return, he has a meltdown and fires everyone in his office.  Having enough, Beth goes to New York to be with Jeremy but accepts a similar job for a rival bookie called Rosie.  Gambling is illegal in New York and Dink worries about Beth.  Rosie then sets up a legal operation based in Curaçao and Beth goes down to help run the betting.  Rosie and his men are more interested in drugs and hookers and Beth wants out.   A New York gambler, Dave Greenberg, is in debt for sixty-thousand dollars and may be working for the Feds.\nDink and his wife Tulip come to New York to help out Beth and Jeremy.  They strong arm Greenberg and he gives them a hot tip on a New Jersey basketball team.  The team wins in the last second by one point and everyone clears their gambling debts.  The movie is a true story based on Beth Raymer's memoir who in real life goes to college and becomes a writer.", "cast": "Bruce Willis as Dink Heimowitz\nRebecca Hall as Beth Raymer\nCatherine Zeta-Jones as Tulip Heimowitz\nJoshua Jackson as Jeremy\nVince Vaughn as Rosie\nLaura Prepon as Holly\nJohn Carroll Lynch as Dave Greenberg\nCorbin Bernsen as Jerry Raymer\nFrank Grillo as Franky"}