{"_movieID": "399361", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:58:40", "summary": "Triple Frontier is a 2019 American action-adventure film directed by J. C. Chandor, with a screenplay by Chandor and Mark Boal, from a story by Boal. The film stars Ben Affleck, Oscar Isaac, Charlie Hunnam, Garrett Hedlund, and Pedro Pascal as a group of former US Army Delta Force soldiers who reunite to plan a heist job of a South American crime lord.\nThe film was released by Netflix in select theaters on March 6, 2019, before its worldwide streaming release on March 13, 2019.\n\n", "plot": "Santiago \"Pope\" Garcia works as a private military adviser in Colombia combating drug crime. During his time there, an informant named Yovanna asks for his help with smuggling her and her brother out of the country in exchange for information on the whereabouts of a drug lord named Lorea.\nYovanna tells Pope that Lorea lives in a safe house in the jungle along with all his cash. Pope travels home to the States to recruit his old Delta Force friends for a job to seize the money under the pretense of working for the Colombian government: Tom \"Redfly\" Davis, a realtor; William \"Ironhead\" Miller, a motivational speaker; his brother Ben Miller, a mixed martial arts fighter; and Francisco \"Catfish\" Morales, a former pilot. With persuasion from Pope, they decide to steal the money for themselves.\nThe group, wanting to minimize casualties, devises a plan to move in on the house while Lorea's family is at church. They quietly subdue the guards, without killing them, but cannot find Lorea or the money. Pope realises that the money is in the walls, and the team begin bagging the money. They realise that there is far more than they expected and rush to get as much as possible before Lorea's family and guards return. Redfly becomes consumed by the money and demands the crew continue loading it past the hard stop that he himself set. This alarms the crew, who finally convince him that they are out of time, and must leave immediately. With the money safely loaded in the truck, they make one last sweep for Lorea.\nAs they search for Lorea, he surprises them and wounds Ironhead, before being killed by Pope. As the crew tends to Ironhead's wounds, and now several minutes past their getaway time, some guards return. The crew take them out, burn down the house, and escape in the van, driving by Lorea's family returning from church. They meet up with Yovanna and her brother with $250 million in the van, and then rendezvous with Ironhead's old friend who provides them a private Mi-8MTV-1 transport helicopter for their voyage to reach their getaway boat that would aide to their escape from South America. From there, they would transfer the money to an account in St. John's, Antigua and Barbuda. Catfish is skeptical that the helicopter can hold the weight of all the money at high altitudes as they have to fly over the Andes Mountains in order to make it to the meeting point. Unwilling to leave behind any of the money, Redfly urges Catfish to proceed. The crew takes off with the money in a net bag attached under the helicopter. They transport Yovanna into Peru with her brother. Redfly aggressively questions her knowledge of them, knowing she could link them to the robbery. Before leaving, Pope leaves Yovanna and her brother with a share of the stolen money and visas to Sydney, Australia, and urges them to leave South America as soon as possible to avoid being caught by the gangsters. As the group takes off, an unsatisfied Redfly claims that Yovanna was lying to him but Pope talks him down. Redfly insinuates that they should have killed her, prompting Ironhead to convince Redfly that doing so would lead to circumstances he would not recover from. Fixated on the money, Redfly becomes more and more willing to break his own rules and do whatever is necessary to escape with the money.\nAs planned, the crew begin flying over the Andes Mountains. However as they are reaching the helicopter's maximum ceiling, one of the helicopter's gearboxes is overwhelmed and damaged due to the cargo load exceeding the maximum weight, causing their helicopter to enter a rapid descent. Unable to recover from their descent, Catfish urges the team to release the money bag via manual override to allow for a safe crash landing. The group survives the crash landing and exit the helicopter wreck with minor injuries and quickly move into action. Redfly and Pope attempt to retrieve the ditched money bag, which landed in a cocaine farm field village, by negotiating with the local farmers and villagers that are seen rummaging through the bag. The wounded Ironhead stands by at the wreckage while Catfish and Ben take position and recon the activity through bushes. Their attempts to peacefully retrieve the money fails due to a heated confrontation arising as the farmers mistake the group as members of the Drug Enforcement Administration and view them as hostile upon noticing the other armed group members in the distance. When one of the angry farmers gets defensive and approaches with a machete, Redfly draws out his pistol and kills him and several others, prompting the other villagers to back away from the money bag. While Catfish, Ironhead, and Ben prepare a group of mules to transport the money, Pope and Redfly compensate the village elder with some of the stolen money. Upon reaching an agreement, they continue their voyage to the meeting point. The crew eventually set the mules free once the terrain becomes too treacherous.\nWhen they reach the top of the mountain and make their way down, a firefight takes place with two villagers seeking to avenge the deaths of their families. Redfly takes one of them out before being killed by a single shot from the second villager’s rifle. Pope takes out the second shooter and the crew mourn Redfly's death. After a brief argument between Ben and Ironhead, Pope urges them on stating that both Redfly's family and they themselves deserve the money at this point. They proceed towards the ocean with the money and Redfly's body.\nBen scouts ahead and reports that their getaway boat is still waiting for them but the village is filled with armed teens waiting for them. While Pope initially argues that they \"go through\" the armed teens, the others vehemently disagree. They have come to realize they have sacrificed everything they believe in for the money, including their integrity. Pope becomes remorseful of his desire to kill the teenagers and takes it back. Knowing they cannot sneak all the money through the town, they toss the money into a ravine, keeping only what they can carry in their own backpacks. They attempt to quietly make their way through the town to the boat carrying Redfly's body, but are discovered. A car chase ensues and Pope hesitates to kill any more people, instead shooting the tires of the pursuers, causing their car to swerve into the sand. The team makes it to safety in the boat with five million dollars and Redfly's body.\nAt the offshore account in St. John's, a lawyer provides paperwork disseminating the funds evenly between the four men and Redfly's family trust. However, the guilt-ridden men each agree in turn to give their shares to Redfly's family. Afterwards, the team go their separate ways with Pope planning to head to Australia to find Yovanna. Before leaving, Ironhead gives Pope a set of coordinates scribbled on a piece of paper, the location of the ravine in Peru where they left the money behind.", "cast": "Ben Affleck as Tom \"Redfly\" Davis\nOscar Isaac as Santiago \"Pope\" Garcia\nCharlie Hunnam as William \"Ironhead\" Miller\nGarrett Hedlund as Ben \"Benny\" Miller\nPedro Pascal as Francisco \"Catfish\" Morales\nAdria Arjona as Yovanna"}