{"_movieID": "384521", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:01", "summary": "The Cloverfield Paradox is a 2018 American science fiction horror film directed by Julius Onah and written by Oren Uziel, from a story by Uziel and Doug Jung, and produced by J. J. Abrams's Bad Robot Productions. It is the third installment in the Cloverfield franchise, following Cloverfield (2008) and 10 Cloverfield Lane (2016). The film stars Daniel Brühl, Elizabeth Debicki, Aksel Hennie, Gugu Mbatha-Raw, Chris O'Dowd, John Ortiz, David Oyelowo and Zhang Ziyi, and follows an international group of astronauts aboard a space station who, after using a particle accelerator to try to solve Earth's energy crisis, must find a way home after accidentally traveling to an alternate dimension.\nThe film was based on God Particle, a spec script from Oren Uziel which had the main plot of the space station crew, but was unconnected to Cloverfield. The script was acquired by Paramount Pictures and Bad Robot in 2012. It had been initially planned as part of Paramount's low-budget InSurge distribution label, but following the folding of that label, its production was expanded as a Paramount-distributed film. Only during production did Abrams decide to link the film to Cloverfield, adapting Uziel's screenplay and adding scenes to establish the connection, after the same approach was used to alter 10 Cloverfield Lane from its original script, The Cellar. Abrams saw the particle accelerator accident as a cinematic means for future events to cause changes in the past, narratively linking the Cloverfield franchise together.\nOnce announced as a yet-to-be-named Cloverfield film in late 2016, the film's release was delayed several times. A surprise trailer aired during Super Bowl LII on February 4, 2018, advertising the film's final title and its release on Netflix, which had purchased rights for the film from Paramount. The release occurred immediately after the game.While the unique marketing tactics were praised, the film itself received generally negative reviews from critics, who disliked the narrative, writing and editing, with many considering it the weakest of the Cloverfield films, although Mbatha-Raw's performance did receive some praise.", "plot": "In 2028, Earth is suffering from a global energy crisis. The space agencies of the world prepare to test the Shepard particle accelerator aboard the orbiting Cloverfield Station, which would provide Earth with infinite energy, while conspiracy theorists fear it will create the \"Cloverfield Paradox\", opening portals to parallel universes allowing their horrors to threaten Earth. Among the crew is Ava Hamilton, a British engineer who frets about leaving her husband Michael potentially for years, as their relationship struggles since the loss of their children to a house fire. The crew is rounded out by American commander Kiel, German physicist Ernst Schmidt, Brazilian medical doctor Monk Acosta, Irish engineer Mundy, Russian engineer Volkov, and Chinese engineer Tam.\nAfter about two years of unsuccessful attempts to activate Shepard, the crew achieves a seemingly stable beam, but it overloads and creates a power surge on the station. After restoring basic power, they find Earth has vanished from view, and the gyroscope that aids in the station's navigation is missing. As the crew works on repairs, strange events begin to occur, including the discovery (and subsequent rescue) of an unfamiliar woman called Mina Jensen fused with wires inside a wall. Volkov's eyeballs begin moving of their own accord; he begins conversing with his own reflection in a mirror and is compelled to craft a gun using an on-board 3D printer. He uses the gun to threaten the crew, but as he does so he convulses and dies, and the station's worm colony bursts out of him. Jensen tells Hamilton not to trust Schmidt, who turns out to be a spy sent by the German government to keep Shepard shut down. Mundy's arm gets pulled into a solid wall and is severed clean off, without bleeding or pain. They find the arm roaming of its own volition. When they recognize it is trying to write something, it instructs them to \"cut Volkov open\". Once they do, they find the missing gyroscope. They finally locate Earth and begin restoring their communications, but transmissions state the station was destroyed and fell to Earth two days prior.\nThe crew determine the particle beam overload has activated the Cloverfield Paradox, and in doing so, moved the station to a parallel universe in which Jensen replaced Tam as the station's engineer, Schmidt is a spy, and Hamilton (though still working on the mission) has remained on Earth, where her children are still alive. Believing the Paradox can be reversed and they can return to their own universe if they reactivate the Shepard, the crew sets out to make repairs.  Tam is trapped in a chamber that floods with water and explodes into space, killing her. Meanwhile, Hamilton decides to return to parallel Earth with Jensen in order to prevent the fire that killed her children. As they prepare, Mundy is killed in an explosion caused by a strange magnetic field, destabilizing part of the Cloverfield and threatening to tear the whole station apart. Kiel sacrifices himself to save the station, leaving Hamilton in charge.\nOn Earth, Michael has woken up to discover a wave of destruction ravaging the planet, witnessing the silhouette of a giant monster in the distance. On his way to offer assistance at the local hospital, he stops to help a young girl named Molly at a dockyard. After learning the hospital was destroyed, he takes her to the underground shelter of a friend and tends to her wounds.\nWith Shepard ready to activate again, Hamilton prepares to leave with Jensen, but Jensen suddenly knocks her out. Jensen kills Monk with Volkov's gun, wounds Schmidt, and insists the station must stay in her universe to keep Shepard there. Regaining consciousness, Hamilton uses the gun to shoot out a window, ejecting Jensen into space. Hamilton decides to return to their universe with Schmidt and makes a recording for her alternate universe self, giving her the plans for Shepard and stressing the importance of her family. Hamilton and Schmidt reverse the universe shift and use Tam's modifications to finally make Shepard work. After reporting in, the two eject themselves in an evacuation capsule towards Earth.\nMichael learns from mission control of the station's reappearance and his wife's return to Earth, but he lambasts them for not warning her not to return to Earth in light of the ongoing situation. As the capsule re-enters the Earth's atmosphere, a giant monster bursts through turbulent clouds.", "cast": "Additionally, Donal Logue cameos as Mark Stambler, a conspiracy theorist discussing the \"Cloverfield Paradox\"; reviewers observed that the character shares the same surname as Howard Stambler, the conspiracy theorist portrayed by John Goodman in 10 Cloverfield Lane; the film's ARG campaign references the characters being brothers. Suzanne Cryer, who appeared as Leslie in 10 Cloverfield Lane, also appears in a brief cameo role as a newscaster who interviews Stambler. Simon Pegg and Greg Grunberg, both of whom have frequently worked with Abrams on other films and television series, provide vocal cameos as Radio Voice and Joe, respectively. Oyelowo and Logue previously portrayed Kiel and Stambler in the film's ARG campaign."}