{"_movieID": "159824", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:04", "summary": "Hotel Transylvania 2 is a 2015 American 3D computer animated comedy film, the second installment in the Hotel Transylvania franchise and the sequel to the 2012 film Hotel Transylvania, with its director, Genndy Tartakovsky, and writer, Robert Smigel, returning for the film. Produced by Sony Pictures Animation, it was animated by Sony Pictures Imageworks, with an additional funding provided by LStar Capital.Hotel Transylvania 2 depicts events taking place seven years after the first film, with the hotel now open to human guests. Mavis and Johnny have a young son named Dennis, whose lack of any vampire abilities worries his grandfather Dracula. When Mavis and Johnny go on a visit to Johnny's parents, Dracula calls his friends to help him make Dennis a vampire. Soon, things turn upside-down when Dracula's old-school human-hating father Vlad unexpectedly visits the hotel.\nOriginal voices from the first film—Adam Sandler, Andy Samberg, Selena Gomez, Kevin James, Steve Buscemi, David Spade, Fran Drescher and Molly Shannon—returned for the sequel, with Keegan-Michael Key replacing CeeLo Green as Murray. New additions to the cast include Mel Brooks, Asher Blinkoff, Nick Offerman, Megan Mullally, Dana Carvey and Rob Riggle. The film was released on September 25, 2015, by Columbia Pictures and was a box office success, grossing $473 million worldwide on an $80 million budget.\nA third film, titled Hotel Transylvania 3: Summer Vacation, was released on July 13, 2018, with a fourth film set for release on December 21, 2021.", "plot": "One year after the first film, Mavis (Selena Gomez) and her new fiancé Johnny (Andy Samberg) are finally married, with the approval of her father Dracula (Adam Sandler), and the world becomes aware of (and unfazed by) the existence of monsters. Mavis later reveals to Drac that she is pregnant and a year later, she gives birth to a baby boy named Dennis (Asher Blinkoff), who later befriends Winnie the Werewolf (Sadie Sandler), who has a crush on Dennis. Nearing his fifth birthday, Dennis has yet to grow his fangs and Drac worries that his grandson might not gain vampire powers. Noticing the dangers of Transylvania, Mavis starts to consider raising Dennis where Johnny grew up, much to Drac's disapproval.\nDrac tells Johnny (who does not want to leave the hotel either) to bring Mavis to California to visit his parents, Mike (Nick Offerman) and Linda (Megan Mullally), but to make sure to keep her distracted so that she will not move, leaving Drac to \"babysit\" Dennis. Drac enlists his friends, Frank (Kevin James), Winnie's father, Wayne the Werewolf (Steve Buscemi), Griffin the Invisible Man (David Spade), Murray the Mummy (Keegan-Michael Key) and Blobby the Blob (Jonny Solomon) to help train Dennis to become a monster, to no avail.\nDrac takes Dennis to his childhood summer camp, Camp Winnepacaca, where he learned to hone his vampire abilities and discovers that the camp is safer than it was when he went there. Drac stubbornly believes Dennis is a \"late fanger\", so he hurls Dennis from a tall, unstable tower to pressure the boy's transformation into a bat. Dennis does not transform, and Dracula has to fly and rescue him at the last second. The stunt is filmed by the campers and uploaded to the Internet, which eventually reaches Mavis and Johnny.\nMavis angrily transforms into a bat to fly her and Johnny back to Transylvania. Drac and his friends reach the hotel a couple of seconds after Mavis. She confronts her father for putting Dennis in grave danger and his inability to accept that he is human. She states she will move out of the hotel after Dennis' fifth birthday the following Wednesday. Drac hangs his head with deep guilt after Mavis tells him that he may have let humans into the hotel, but hasn’t let them into his heart.\nMavis invites Vlad (Mel Brooks), her grandfather and Drac's father, to Dennis' birthday party. As Vlad is much worse than he was when it comes to humans, Drac tells Johnny to have the human party-goers disguise themselves as monsters. Vlad receives the invitation and arrives with his monstrous bat-like servant Bela (Rob Riggle) to meet his great-grandson for the first time. Meeting him, he believes that fear will cause Dennis' fangs to sprout and possesses a stage performer dressed as Dennis's favorite television monster, \"Kakie the Cake Monster\", to scare Dennis, but Drac shields his grandson at the last moment and exposes the deception to Vlad, who is outraged that Drac has accepted humans as guests in his hotel. Drac confronts his father about how humans are different now. Mavis becomes upset with her grandfather's behavior.\nWhile the family argues, Dennis sadly flees the hotel and enters the forest with Winnie in tow, hiding in her treehouse. They are attacked by Bela, who mistakes Dennis for a human. When Bela injures Winnie and threatens to destroy the hotel, Dennis' anger causes him to instantly grow his fangs and his vampire abilities manifest. He begins to fight Bela, who calls his giant-bat minions. Drac, Mavis, Dennis, Johnny, the rest of the monsters and Johnny's family team up to defeat his minions. A livid Bela then attempts to kill Johnny himself with a stake. Having been won over by Drac's claim that humans are harmless now, Vlad shrinks Bela and tells him never to bother his family again. Bela then flees.\nWith Dennis having vampire abilities, Mavis and Johnny continue to raise him in Transylvania, and they resume the party with his friends."}