{"_movieID": "503129", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:51:11", "summary": "Student of the Year 2 is a 2019 Indian Hindi-language teen film written by Arshad Sayed and directed by Punit Malhotra. It was produced by Karan Johar, Hiroo Yash Johar and Apoorva Mehta under the banner Dharma Productions, and was distributed by Fox Star Studios. A sequel to the 2012 film Student of the Year, it stars Tiger Shroff, Tara Sutaria and Ananya Pandey. The film follows Rohan, a college student who switches to a better university to rekindle his relationship with his childhood sweetheart who studies there. When Rohan is rusticated, he returns to his old college and vows to lead his new team to victory in an inter-college cup against his former college, thereby becoming Student of the Year.\nStudent of the Year 2 was announced in November 2017. Initially, Malhotra and Shroff were to collaborate for a different film; when they found the final script unsatisfactory, they tweaked it and planned to make it a sequel. It marks the debut of both Sutaria and Panday, and pursues a plot that is unrelated to its predecessor. Principal photography for the film began in April 2018 at Dehradun, and ended in September 2018. The film's soundtrack was composed by Vishal-Shekhar, with lyrics written by Anvita Dutt Guptan, Kumaar and Vayu, and released under the banner Zee Music Company.\nStudent of the Year 2 was theatrically released in India on 10 May 2019. The film received generally mixed reviews from critics, with the script and unreal situation receiving criticism; Shroff's action sequences were praised. As of 7 June 2019, it has earned ₹97.81 crore worldwide, against a production budget of ₹65–80 crore.", "plot": "Rohan Sachdev, a hardworking student of the Pishorilal Chamandas College in Mussoorie, is in a relationship with Mridula Chawla. They are separated when Mridula transfers to St. Teresa's, a college in Dehradun for the wealthy and privileged. Rohan is unable to afford their fees and is left back. To be together with Mridula, he applies for a scholarship under the sports quota in the college and manages to gain admission. Meanwhile, Mridula has changed her identity and rechristened herself Mia Chawla to fit in with others at her new college. She also has a crush on Manav Singh Randhawa. Upon meeting Rohan, she initially stays away from him, but they soon begin a relationship again, after Rohan starts being recognized as a sportsman by breaking the school 100m sprint record.\nRohan is meanwhile introduced to Manav Singh Randhawa, a rich and affluent student two-time winner of the Student of the Year Cup. The two become quick friends, but Rohan remains at loggerheads with Manav's sister Shreya Randhawa, who appears to be a spoilt brat and detests him. The college announces a dance competition; Rohan and Mia are set up against Manav and Shreya. Mia wishes to win the contest and attain popularity, while Shreya wants to convince her tyrannical father of her ability in dance and enroll in a dance school in London. Manav and Shreya win the contest after Mia falters during a step. When Rohan goes to console Mia, he finds her getting intimate with Manav. Rohan realises that Manav had planted Mia to spoil Rohan's performance as Manav saw him as a threat to his image in the college.\nRohan punches Manav, and is expelled from St. Teresa's. Before leaving the campus, Manav and his gang attack Rohan and beat him vigorously, throwing him out of the campus gate unconscious. Once back on his feet, he challenges Manav saying he, and not Manav, will be winning the Student of the Year trophy in 2019.\nHe goes back to Pishorilal Chamandas College, where is old friends treat him with coldness. Shreya, who has fallen in love with Rohan and his sincere simplicity, convinces his friends to warm up to him. Rohan and his teammates at Pishorilal Chamandas train hard to win the 29th Annual Inter-College Dignity Cup, an inter-college competition, where Pishorilal has been finishing at the bottom of the chart for the past few years. With Rohan's hardwork and motivation and the team's effort, Pishorilal Chamandas College defeats Saint Teresa, the defending champions of the Cup, and Rohan wins the Student of the Year, as well as Shreya's love.", "cast": "Tiger Shroff as Rohan Sachdev\nTara Sutaria as Mridula \"Mia\" Chawla\nAnanya Pandey as Shreya Randhawa\nAditya Seal as Manav Singh Randhawa\nSamir Soni as Principal Gujral\nGul Panag as Coach Kuljeet\nAbhishek Bajaj as Abhishek Sharma\nManoj Pahwa as Coach Mahipal\nAyesha Raza Mishra as Principal Singh\nRajesh Kumar as Chacha\nManasi Joshi Roy as Chachi\nChetan Pandit as Randhawa Ji\nSamreen Kaur as Mia's Mom\nManjot Singh as Commentator Dimpy\nSahil Anand as Commentator Jeet\nDaljeet Singh as Abdullah Wahab\nHarsh Beniwal as Puggi\nAlia Bhatt (special appearance in \"The Hook Up Song\")\nWill Smith (special appearance in \"The Jawaani Song\")"}