{"_movieID": "374461", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:47:07", "summary": "Mr. Church is a 2016 American  drama film directed by Bruce Beresford and written by Susan McMartin. The film stars Eddie Murphy as the title character with Britt Robertson, Xavier Samuel, Lucy Fry, Christian Madsen and Natascha McElhone also starring. The movie is based on the short story \"The Cook Who Came To Live With Us\" written by McMartin. The film centers around a cook who becomes a caretaker and father figure to three generations of women over the years. The film debuted on April 22, 2016, at the Tribeca Film Festival and was released on September 16, 2016, by Cinelou Releasing and Freestyle Releasing.  \nThis was Murphy's first film in four years and his first dramatic role.  \n\n", "plot": "Charlotte \"Charlie\" Brooks (Britt Robertson) lives with her single mother Marie Brooks (Natascha McElhone) in a small apartment in California. She is awakened to the sounds and smells of cooking in the kitchen, to find a stranger preparing breakfast. When she tells her mother about this, she informs Charlotte that the man is Mr. Church (Eddie Murphy) and he will be their new cook. Charlie is initially distrustful of Mr. Church and urges her mother Marie to fire him. It is revealed that Mr. Church was hired by Richard Cannon, a wealthy entrepreneur who had an adulterous affair with Marie. When he died, he left provisions in his will that provided financial support for Marie while she suffered from terminal breast cancer. The provisions were slated to last for six months to match her diagnosed life expectancy. When Mr. Church informs her that he was guaranteed a lifetime salary to care for the family, Marie reneges and decides to keep Mr. Church as their cook. Charlie spends time with her best friend Poppy (Madison Wolfe) and her school boy crush Owen Baxter. She rides the bus to school with Eddie Larson (Christian Madsen), a man whose driver's license has been permanently revoked due to serving four years in prison for vehicular manslaughter. \nSix years later, Marie is still living and Mr. Church has become a fixture in the household and is a renaissance man of sorts, being an avid reader, sketch artist, gardener, gourmet cook, jazz aficionado and pianist. Charlie is a senior in high school and now aware of her mother's cancer. Charlie grows distant from her mother and closer to Mr. Church because of her inability to come to terms with Marie's impending death. Owen (Xavier Samuel), who was always attracted to Charlie, invites her to their senior prom. Charlie is reluctant to go but Marie promises her that if she decides to attend prom, she will stay alive to see it. Mr. Church and Marie help Charlie pick out a dress. On the big night, the three of them take photos as a family and Charlie goes to prom with Owen. Several days later, Mr. Church meets Charlie at the bus stop to deliver the news that her mother has passed.\nMr. Church stays with Charlie after Marie dies. Charlie gets accepted to Boston University but cannot afford to attend. Mr. Church gives her an envelope containing five thousand dollars for tuition–the money he saved from coupons Marie gave him. He also provides her with a used car and she asks Larson to teach her how to drive. Charlie runs into Owen sometime later and he tells her he is going away to college.\nTwo years later a pregnant Charlie shows up on Mr. Church's doorstep, stating that she returned home just to take a break from studies. She eventually ask Mr. Church if she could live with him. He agrees as long she abides by one rule and that is to respect his privacy. Charlie notices that twice a week Mr. Church comes home drunk and violently arguing with no one and has matches from a place called Jelly's. She routinely hides the matches that he brings home out of embarrassment but these events pique her curiosity. One night, a drunk Mr. Church finds her snooping, they argue and he throws her out of his home for breaking his rules. She leaves and the next day runs into her old friend Larson at a store parking lot. A kid on a skate board hits Charlie and knocks her down knocking her unconscious. Larson, who has not driven in over a decade due to his incarceration, nevertheless drives her to the hospital just in time.  Mr. Church comes to the hospital and takes Charlie back with him. Charlie gives birth to a baby girl named Izzy (Mckenna Grace), and she and Izzy live with Mr. Church. Charlie gets a job as a waitress.\nFive years later, Charlie and Mr. Church are raising Izzy as a blended family. The three of them attend Larson's wedding and he reveals to Charlie that he intended to commit suicide the day he saw her in the parking lot. He tells her that rescuing her saved his life. Charlie later reunites with Poppy (Lucy Fry) who has achieved an upper class wealthy lifestyle by marrying rich men. Poppy belittles Charlie for not wanting to find independence and leave her cook's home. Charlie reveals that it was Mr. Church who supported them when her mother exceeded her life expectancy. When Mr. Church becomes sick, Charlie takes him to the doctor and discovers the doctor is Owen. They begin to date and rekindle their relationship. When he becomes too ill to cook, Charlie begins to cook and learns that she has inherited Mr. Church's talent for cooking, based on years of watching and helping him prepare food. Mr. Church grows sicker and eventually dies of an enlarged heart. During the wake, Charlie meets the owner of Jelly's, Frankie Twiggs (Thom Barry), and finds out that Mr. Church played the piano there for nearly 30 years. She feeds Jelly one of Mr. Church's dishes and Frankie states he never knew that Mr. Church could cook. Charlie learns that Mr. Church was even more mysterious than she thought and that he had separate lives that he lived apart from one another. The film ends with Charlie writing the story of her life with Mr. Church."}