{"_movieID": "49521", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:54:27", "summary": "Man of Steel is a 2013 superhero film based on the DC Comics character Superman. It is a British-American venture produced by DC Entertainment, Legendary Pictures and Syncopy, and distributed by Warner Bros. Pictures. It is the first installment in the DC Extended Universe (DCEU). The film is directed by Zack Snyder, written by David S. Goyer, and stars Henry Cavill, Amy Adams, Michael Shannon, Kevin Costner, Diane Lane, Laurence Fishburne, Antje Traue, Ayelet Zurer, Christopher Meloni and Russell Crowe. Man of Steel is a reboot of the Superman film series that portrays the character's origin story. In the film, Clark Kent learns that he is a superpowered alien from the planet Krypton. He assumes the role of mankind's protector as Superman, making the choice to face General Zod and prevent him from destroying humanity.\nDevelopment began in 2008, when Warner Bros. took pitches from comic book writers, screenwriters, and directors, opting to reboot the franchise. In 2009, a court ruling resulted in Jerry Siegel's family recapturing the rights to Superman's origins and Siegel's copyright. The decision stated that Warner Bros. did not owe the families additional royalties from previous films, but if they did not begin production on a Superman film by 2011, then the Shuster and Siegel estates would be able to sue for lost revenue on an unproduced film. Producer Christopher Nolan pitched Goyer's idea after story discussion on The Dark Knight Rises, and Snyder was hired as the film's director in October 2010. Principal photography began in August 2011 in West Chicago, Illinois, before moving to Vancouver and Plano, Illinois.\nMan of Steel was released in theaters on June 14, 2013, in 2D, 3D, and IMAX. Despite receiving mixed reviews, the film became a box office success, grossing more than $668 million worldwide. Critics praised the film's visuals, Shannon and Crowe's performances and Hans Zimmer's score but criticized its pacing and lack of character development. A follow-up entitled Batman v Superman: Dawn of Justice was released on March 25, 2016.", "plot": "With Krypton destabilized from the mining of the planet's core, Jor-El, chief advisor to Krypton's supreme council, recommends that the council give him control of the genetics codex. Before any action can be taken, soldiers led by General Zod, an old friend of El's, launch an uprising and arrest the councilors. Realizing that Krypton is doomed, El steals the genetic codex sought by Zod and infuses them into the DNA of his infant son, Kal-El, the first naturally born Kryptonian child in centuries. Donning his old armor, El sacrifices his life to allow his son to escape on a preprogrammed spacecraft. The council quashes Zod's rebellion, and its members are sentenced to exile in the Phantom Zone after being convicted of treason. Krypton explodes soon after.\nFollowing El's coordinates, the ship crash lands on Earth in Smallville, Kansas. A childless couple, Jonathan and Martha Kent, find Kal-El and raise him as their own, naming him Clark. Clark eventually becomes an isolated young man as a result of developing superhuman powers which he tries to hide from others. He then learns his true origins from Jonathan, who urges him to keep his powers hidden. Several years later, Jonathan dies in a tornado while refusing to let Clark rescue him. Burdened with guilt and looking for a new purpose in his life, Clark leaves to travel the world for an extended period of time under several disguises.\nSeveral months later, Daily Planet reporter Lois Lane receives an assignment to investigate the discovery of a Kryptonian scout ship in the Canadian Arctic. Disguised as a worker, Clark enters the ship and activates its central computer using a key left by Jor-El, which allows him to communicate with an artificial intelligence modeled after his father. The AI explains that Clark was sent to Earth to guide its people, and presents him with a Kryptonian uniform bearing his family's symbol. While following Clark, Lois inadvertently triggers the ship's security system. Clark uses his powers to rescue Lois before wearing the uniform and testing his flying abilities. Unable to convince supervisor Perry White to publish an article on the incident, Lois tracks down Clark in Smallville, with the intent of exposing him. However, after hearing of Jonathan Kent's sacrifice, Lois drops the story, keeping Clark's identity safe, despite Perry's suspicions.\nEscaping the Phantom Zone, Zod and his crew intercept a transmission from the scout vessel and travel to Earth. Deducing that Kal-El is nearby, they broadcast a global address demanding that he surrender or risk war. Clark meets with the United States Air Force and agrees to comply, with Lois joining him as a hostage. Zod reveals that he possesses numerous terraforming devices, the largest called a World Engine, which he salvaged from Kryptonian outposts, which he intends to use to transform Earth into a new Krypton. His science officer, Jax-Ur, extracts Clark's genes to create Kryptonian colonists who will annihilate humanity and build a society based on Zod's ideals of genetic purity.\nUsing the Jor-El AI to take over the ship, Clark and Lois flee and warn the U.S. military after an explosive confrontation between Clark and Zod's troops in Smallville, just as Zod orders an invasion. Zod deploys the World Engine from the Kryptonian ship, which touches down in the Indian Ocean and begins firing a beam through the planet towards the ship, severely damaging Metropolis, and initiating the terraforming strategy. Given the codename \"Superman\", Clark destroys the terraforming platform while the military launches a suicide attack, sending Zod's troops back to the Phantom Zone. With the ship destroyed and Krypton's only hope of revival gone, Zod vows to destroy the Earth and its inhabitants just to spite Superman. The two Kryptonians engage in a lengthy battle across Metropolis, which concludes when Superman is forced to kill Zod as he attacks a cornered family in a train station.\nSuperman persuades the government to let him act independently, so long as he does not turn against humanity. To allow access to dangerous situations without attracting attention, Clark takes a job as a freelance reporter for the Daily Planet.", "cast": "Henry Cavill as Kal-El / Clark Kent:A Kryptonian sent by his parents to Earth as an infant to escape the destruction of his homeworld, Krypton, and raised under the mental guidance of farmers in Smallville, Kansas, until he is inspired by the holographic message from his late father to become Earth's greatest protector (Superman is depicted as being 33 years old, at least from the moment he is found, in the present timeline of the film). Cavill is the first British and non-American actor to play the character. He was previously cast in Superman: Flyby, which was ultimately shelved, and was considered for the role in the 2006 film Superman Returns, but lost to Brandon Routh. Cavill stated, \"There's a very real story behind the Superman character.\" He explained that everyone's goal has been to explore the difficulties his character faces as a result of having multiple identities—including his birth name, Kal-El, and his alter ego, Clark Kent. Cavill also stated that, \"He's alone and there's no one like him,\" referring to Superman's vulnerabilities. \"That must be incredibly scary and lonely, not to know who you are or what you are, and trying to find out what makes sense. Where's your baseline? What do you draw from? Where do you draw a limit with the power you have? In itself, that's an incredible weakness.\" In an interview with Total Film magazine, Cavill stated he had been consuming nearly 5,000 calories a day, training for over two hours daily and plowing protein to pack on the muscle mass. Cooper Timberline was cast as the 9-year-old Clark Kent, and Dylan Sprayberry was cast as the 13-year-old Clark Kent.Amy Adams as Lois Lane:A reporter for the Daily Planet newspaper and the love interest of Clark Kent. Adams was selected from a list of actresses that included Zoe Saldana, Olivia Wilde and Mila Kunis. \"There was a big, giant search for Lois,\" Snyder said. \"For us, it was a big thing and obviously a really important role. We did a lot of auditioning, but we had this meeting with Amy Adams and after that I just felt she was perfect for it.\" Adams auditioned for the role three times: once for the unproduced Superman: Flyby, and the second time for Superman Returns before landing the current role. Adams was confirmed to play Lois Lane in March 2011. While announcing the role, Snyder said in a statement, \"We are excited to announce the casting of Amy Adams, one of the most versatile and respected actresses in films today. Amy has the talent to capture all of the qualities we love about Lois: smart, tough, funny, warm, ambitious and, of course, beautiful.\" On portraying Lois Lane, Adams stated that the film would feature a Lois Lane who is an \"independent, feisty woman ... but set in a more identifiable world.\" Adams said that \"She has become more of a free-ranging journalist, someone who likes to be hands-on. The nature of the newspaper business has changed so much. There is so much more pressure.\"Michael Shannon as General Zod:A Kryptonian general and megalomaniac with the same superpowers as Superman, bent on transforming Earth into a new Krypton under his reign. Viggo Mortensen was considered for the role. Snyder stated, \"Zod is not only one of Superman's most formidable enemies, but one of the most significant because he has insights into Superman that others don't. Michael is a powerful actor who can project both the intelligence and the malice of the character, making him perfect for the role.\" When Goyer was asked about why Zod was chosen as the villain, he stated, \"The way (Christopher) Nolan and I have always approached movies as well is you never say, 'Hey, which villain would be cool for this movie?' You start with the story first. What kind of story? What kind of theme do you want to tell? So we worked that out. Then, usually the villain becomes obvious in terms of who's going to be the appropriate antagonist for that. When you guys see the movie, the only villain we could've used was Zod and the Kryptonians. I mean, when you see what the whole story is, nothing else would have even made sense.\" Shannon also commented on his portrayal in comparison to Terence Stamp's original take on Zod, \"To follow Terence Stamp's iconic performance in the original, it is daunting, but I just focused on one day at a time. It's interesting that when we started with this, we did a lot of training together and I think that kind of helped loosen things up a little bit. It is a very physical movie at the end of the day. That's a good way to find your way 'into it' [as an actor].\"Kevin Costner as Jonathan Kent:Clark's adoptive father. Snyder explained his reason for his casting the on-screen couple is solely for the realism: \"I think the thing you realize when you look at Diane and Kevin, in our decision to cast them so far, you sort of get a sense of how tonally we're looking at the movie, and what you realize is that those guys are serious actors, and we're taking this movie very seriously in terms of the tone of having those guys. You're talking about having a situation where whatever the action is or whatever the drama of the movie is, our first priority is to make sure it's rendered in the most realistic way we can get at.\"Diane Lane as Martha Kent:Clark's adoptive mother. Lane was the first cast member to join the film after Cavill. \"This was a very important piece of casting for me because Martha Kent is the woman whose values helped shape the man we know as Superman,\" Snyder said in the release. \"We are thrilled to have Diane in the role because she can convey the wisdom and the wonder of a woman whose son has powers beyond her imagination.\"Laurence Fishburne as Perry White:Editor-in-chief of the Daily Planet and the boss of Lois Lane. Fishburne is the first African-American to play Perry White in a live-action film. Fishburne stated that he modeled his character after Ed Bradley, stating that \"my inspiration really is the late Ed Bradley, who was a CBS correspondent on 60 Minutes for many years ... [The] legendary Ed Bradley ... was a friend, a mentor, and a role model for me, particularly because he worked in journalism, and he was the kind of guy who walked with kings, but he had the common touch. And so he was my inspiration for Perry.\"Antje Traue as Faora-Ul:General Zod's sub-commander and a commander of the Kryptonian military, who is completely devoted and loyal to Zod. Gal Gadot was offered the role but declined because she was pregnant at that time; this allowed her to be later cast as Wonder Woman in the film's sequel. About the role of Faora, Traue said in an interview: \"What I liked about her was that as a woman, we have certain doubts and we think too much sometimes about ourselves and all these things, they're not there for Faora. She's a bred warrior. So to really focus on that aspect, that fear is a chemical reaction and that it was bred out of her and she doesn't have it, it's liberating when you actually think about it. That you're just a one-track mind, there's no filter, there's no double-meaning. She gets orders and she answers those orders without a question.\"Ayelet Zurer as Lara Lor-Van:The biological mother of Superman and loyal wife to Jor-El. Julia Ormond had previously been announced as cast, but dropped out. Connie Nielsen was in negotiations for the role before Zurer was cast. Nielsen was subsequently cast as Queen Hippolyta in Wonder Woman.Christopher Meloni as Colonel Nathan Hardy:A United States Air Force officer, call sign \"Guardian\", assigned to the United States Northern Command.Russell Crowe as Jor-El:The biological father of Superman. Sean Penn and Clive Owen were also considered for the role. Crowe incorporates how his own fatherhood informed his reading of the script to portray Jor-El, stating that \"... it was one of those things where that's how it was connecting me. That's the question that Jor-El faces, that's the situation that he's in.\" Crowe also comments on his preparation for the film stating that: \"When I signed on ... well, one, I didn't realize that I would be wearing Spandex—'cause you know that's Superman's costume—I didn't realize that I'd have to fit into it as well,\" Crowe said. \"But, I also didn't realize the type of organizer that Zack Snyder is, 'cause this was really old-school prep. This is sort of David Lean-level preparation, and I really appreciated him. And I was on the movie for three-and-a-half or four months before I even got in front of the camera.\"Additionally, Harry Lennix plays Lieutenant General Calvin Swanwick, a United States Army general officer and the deputy commander of United States Northern Command. Christina Wren plays Captain Carrie Ferris, a United States Air Force officer and the assistant to General Swanwick. Richard Schiff plays Dr. Emil Hamilton, a scientist who works with the United States Armed Forces for DARPA. Carla Gugino portrays the voice of Kelor, the Kryptonian A.I. service-robot. Mackenzie Gray plays Jax-Ur, a Kryptonian scientist who is one of General Zod's followers. Michael Kelly plays Steve Lombard, an employee of the Daily Planet, and Rebecca Buller plays Jenny Jurwich, an intern of the Daily Planet. Jack Foley, Jadin Gould and Rowen Kahn, respectively, play Pete Ross, Lana Lang and Kenny Braverman, classmates of Clark Kent in high school, with Joseph Cranford portraying Pete Ross as an adult. Richard Cetrone, Samantha Jo, Revard Dufresne and Apollonia Vanova, respectively, play Tor-An, Car-Vex, Dev-Em II and Nadira, Kryptonian soldiers that follow General Zod."}