{"_movieID": "38050", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:50:36", "summary": "The Adjustment Bureau is a 2011 American science fiction romantic thriller film written and directed by George Nolfi, based on the Philip K. Dick short story \"Adjustment Team\". Starring Matt Damon, Emily Blunt, Anthony Mackie, John Slattery, and Terence Stamp, the film tells the story of a United States congressman who discovers that what appear to be chance events in his life are controlled by a technologically advanced intelligence network. After an event not planned by these controllers occurs – a romantic encounter with a dancer – he struggles against their manipulation despite their promise of a great future for him.\nThe film was released on April 3, 2011. It was premiered at the Ziegfeld Theatre on February 14, 2011, and received positive reviews from critics, who praised Damon's performance and his chemistry with Blunt. It grossed $127 million against a production budget of $50 million.", "plot": "In 2006, Brooklyn Congressman David Norris unsuccessfully runs for the United States Senate. While rehearsing his concession speech, David meets Elise Sellas. They share a passionate kiss, though he does not get her name. Inspired by her, David delivers an unusually candid speech that is well-received, making him a favorite for the 2010 race.\nA month later, David prepares for a new job. At Madison Square Park, near David's home, a man named Harry Mitchell receives an assignment from his superior Richardson. Harry is to spill coffee on David's shirt by 7:05 AM so that David will miss his bus. However, Mitchell falls asleep; David boards the bus, meets Elise and gets her phone number.\nDavid arrives at work early and finds everyone in the building frozen and being examined by unfamiliar men. David attempts to escape, but is incapacitated and taken to a warehouse. Richardson reluctantly reveals to David the existence of the \"Adjustment Bureau.\" As its employees, Richardson and his men ensure people's lives proceed following \"the Plan,\" a complex document Richardson attributes to \"the Chairman.\" The Bureau confiscates and destroys the note that contains Elise's phone number, and David is warned that if he reveals the existence of the Bureau to anyone else, he will be \"reset\"—akin to being lobotomized. He is not meant to meet Elise again.\nThree years later, David again encounters Elise after seeing her from a bus window; he tells her he has spent three years riding that bus to work, hoping to see her. He learns that she dances for Cedar Lake Contemporary Ballet. The Bureau tries to stop them from starting a relationship by altering their schedules and preventing them from meeting. David races across town, fighting the Bureau's abilities to \"control his choices\" to ensure he will meet Elise. During the chase the Bureau uses ordinary doorways to travel instantly to distant locations.\nSenior official Thompson takes over David's adjustment and takes him to the warehouse, where David argues he has the right to choose his own path. Thompson says humanity received free will after the height of the Roman Empire, but then brought the Dark Ages upon itself. The Bureau took control after five centuries of barbarism, and created the Renaissance, the Enlightenment, and the scientific revolution. When free will was granted in 1910, it resulted in World War I, the Great Depression, Fascism, the Holocaust, and the Cuban Missile Crisis, forcing the Bureau to retake control. Thompson strongly implies that without Elise's influence David will become President of the United States, while Elise will become a world-famous dancer and choreographer, and that being together will ruin both of their futures. Thompson causes Elise to sprain her ankle at a performance to demonstrate his power, and David abandons her at the hospital to save them from the fate Thompson described.\nEleven months later, Charlie tells David of Elise's imminent wedding as he campaigns again. Harry contacts David via secret meetings in the rain or near water, which prevents the Bureau from tracking them. Harry reveals that Thompson exaggerated the negative consequences of David and Elise's relationship, and teaches David how to use doors to teleport and evade the Bureau's adjustments. Just before the wedding David reaches Elise, reveals the Bureau's existence to her, and shows her how he travels through doors. The Bureau pursues them across New York City. When they emerge at the Statue of Liberty David decides to find the Chairman to end the chase, and Elise chooses to accompany him. They enter the Bureau's offices with agents in pursuit.\nAfter a chase in the building David and Elise find themselves surrounded on the observation deck of the GE Building. They declare their love and kiss before David can be reset. When they let go of each other, the Bureau members have gone. Thompson appears, but is interrupted by Harry, who shows him, and then David and Elise, their revised Plan from the Chairman: one that is blank starting from the current moment. Harry commends them for their devotion to each other, then says they are free to leave. David and Elise walk down the street as Harry speculates that the Chairman's goal may be to prepare humanity to \"one day\" write its own Plan.", "cast": "Matt Damon as David Norris\nEmily Blunt as Elise Sellas\nAnthony Mackie as Harry Mitchell\nJohn Slattery as Richardson\nMichael Kelly as Charlie Traynor\nTerence Stamp as Thompson, Head of the Bureau group.\nDonnie Keshawarz as Donaldson\nAnthony Ruivivar as McCrady"}