{"_movieID": "405774", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:59:54", "summary": "Bird Box is a 2018 American post-apocalyptic thriller film directed by Susanne Bier from a screenplay written by Eric Heisserer, and based on the 2014 novel of the same name by Josh Malerman. The film follows a woman, played by Sandra Bullock, as she tries to protect herself and two children from malevolent supernatural entities that make people who look at them go insane and commit suicide.\nBird Box had its world premiere at the AFI Fest on November 12, 2018, and began a limited release on December 14, before streaming worldwide on Netflix on December 21, 2018.", "plot": "In a post-apocalyptic world, Malorie Hayes advises two young, unnamed children that they will be going downstream on a river in a rowing boat. She strictly instructs them to not remove their blindfolds, or else they will die. From this point, the film alternates between two stages of Malorie's story, separated by five years, until they conjoin: her attempt to navigate the river and the events that led to it.\nFive years earlier, a pregnant Malorie is visited by her sister, Jessica. A news report is being shown on television about unexplained mass suicides in Romania that are quickly spreading across Europe. Malorie has a routine pregnancy checkup with Jessica accompanying her to the hospital. When leaving the hospital, Malorie sees a woman bashing her head into a glass panel followed by others panicking as chaos quickly erupts throughout the town. Malorie realizes the \"violence\" that was spreading across Europe had already reached North America. Malorie and Jessica attempt to drive away from the violence, but Jessica witnesses the phenomenon affecting the masses and sees the entity, loses control of herself as she drives, and the car ends up overturning. An injured Malorie then witnesses Jessica walk into the path of an oncoming garbage truck, killing herself.\nMalorie attempts to flee on foot through the mass chaos on the streets. A woman, Lydia, invites Malorie over to a house for safety, even though her husband, Douglas, disagrees. However, right before she reaches Malorie, she goes into a trance, begins talking to her dead mother, and casually climbs into a burning car, which subsequently explodes. Malorie is rescued and brought into their house by Tom, a fleeing passerby. While recovering at their base, one of the survivors, Charlie who seems to have somewhat comprehensive knowledge of what could be happening, theorizes that demonic entities have invaded Earth, taking the form of their victims' worst fears and driving them insane before causing them to commit suicide. At the insistence of Tom they cover all windows in the house and blindfold themselves whenever they must venture outside. Later, Greg volunteers to tie himself to a chair while monitoring the surveillance cameras to find the issue of the entity but ends up killing himself by rocking his chair violently and slamming his head into a hearthstone after seeing it.\nAs the supply of food decreases (and with the arrival of a new survivor, Olympia, who is also pregnant), most of the group go to a supermarket close by to restock. Malorie finds pet birds and decides to take them along with their supplies. The group attempts to help a coworker of Charlie who is locked outside the supermarket begging for help, and whom Charlie describes as \"a little crazy.\" As they contemplate the risks of opening the door, the birds that Malorie was saving go into a hysterical fury. The group is attacked by the infected coworker, who was not killed by the entities but is instead used to infect others. Charlie sacrifices himself to save the others, who are able to make it back safely to the house.\nSometime after, Felix (a survivor) and Lucy steal the car and drive away. Soon thereafter, Olympia lets Gary, a stranger and apparent lone survivor of another group, into the house, against Douglas' objections. Douglas gets extremely upset and starts threatening the others with a shotgun and is knocked unconscious by Cheryl (an elderly survivor). Douglas is subsequently imprisoned in the garage. Later, Olympia and Malorie go into labor, and Cheryl helps with the births. Gary starts to take out various drawings of the entity and seems to undergo a trance, indicating that he could have already been partially overtaken by the entity when he arrived. He opens the garage door to kill Douglas. He peeks outside and is completely taken over; he then knocks out Tom and proceeds to remove all the coverings from all the windows. Despite Malorie's warnings, Olympia fails to look away from the windows and jumps out of the window. Gary forces Cheryl to look and as a result, Cheryl repeatedly stabs herself in the neck with a pair of scissors she is carrying. Douglas blindly attempts to kill Gary with a shotgun but fails, which results in Gary being able to kill Douglas with the scissors. While Malorie tries to protect the newborn babies (Malorie's boy and Olympia's girl), Tom recovers consciousness in time to overpower and kill Gary.\nFive years later, Tom and Malorie are living together with the children, whose only names are \"Boy\" and \"Girl.\" They receive a transmission from Rick, a survivor stating that they are well and safe at a community hidden in the forest. The four decide to go to the community, but are ambushed by a group of infected survivors along the way. Without hesitation, Tom runs out to distract the group while Malorie and the children attempt to make an escape. When the group notices Malorie and the children escaping, Tom decides to open his eyes and shoot them dead. He is overtaken by one of the entities, but he manages to shoot the last member of the group before shooting himself.\nMalorie, the children, and their pet birds, which are being carried in a box to provide a warning against the entity, make their way blindfolded down the river on a boat. They fight off an infected survivor, and survive raging rapids.\nThe boat flips in the rapids, but Malorie, Boy, and Girl manage to all find each other. Soon after, all three are separated when Malorie accidentally slides down a hill. The entities attempt to convince Boy and Girl to remove their blindfolds using Malorie's voice. Malorie is able to tell them to fight the urge. Once they are all together again, they are chased by the entity, which was implied by camera movement and wind.\nThe three eventually reach the community, a former school for the blind. Malorie releases the pet birds from the box to the other birds up on the ceiling and finally gives the children names: Tom and Olympia."}