{"_movieID": "157336", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:45:55", "summary": "Interstellar is a 2014 American science fiction film directed and produced by Christopher Nolan. It stars  Matthew McConaughey, Anne Hathaway, Jessica Chastain, Bill Irwin, Ellen Burstyn, and Michael Caine. Set in a dystopian future where humanity is struggling to survive, the film follows a group of astronauts who travel through a wormhole near Saturn in search of a new home for humanity.\nBrothers Christopher and Jonathan Nolan wrote the screenplay, which had its origins in a script Jonathan developed in 2007. Christopher produced Interstellar with his wife, Emma Thomas, through their production company Syncopy, and with Lynda Obst through Lynda Obst Productions. Caltech theoretical physicist Kip Thorne was an executive producer, acted as scientific consultant, and wrote a tie-in book, The Science of Interstellar. Paramount Pictures, Warner Bros., and Legendary Pictures co-financed the film. Cinematographer Hoyte van Hoytema shot it on 35 mm in anamorphic format and IMAX 70 mm. Principal photography began in late 2013 and took place in Alberta (Canada), Iceland and Los Angeles. Interstellar uses extensive practical and miniature effects and the company Double Negative created additional digital effects.\nInterstellar premiered on October 26, 2014, in Los Angeles, California. In the United States, it was first released on film stock, expanding to venues using digital projectors. The film had a worldwide gross of over $677 million, making it the tenth-highest-grossing film of 2014. Interstellar received critical praise for its themes, visual effects, musical score, and acting. At the 87th Academy Awards, the film won the Academy Award for Best Visual Effects, and was nominated for Best Original Score, Best Sound Mixing, Best Sound Editing and Best Production Design.", "plot": "In the mid-21st century, crop blights and dust storms threaten humanity's survival. Corn is the last viable crop. The world has also evolved into a post-truth society where younger generations are taught ideas such as the Apollo moon missions were faked. Widowed engineer and former NASA pilot Joseph Cooper is now a farmer. Living with him are his father-in-law, Donald; his 15-year-old son, Tom; and 10-year-old daughter, Murphy. After a dust storm, strange patterns made from dust inexplicably appear on Murphy's bedroom floor, she attributes the anomaly to a ghost. Cooper eventually deduces the patterns were caused by gravity variations and are a binary code for geographic coordinates. Cooper follows the coordinates to a secret NASA facility headed by Professor John Brand, Cooper's former supervisor. Professor Brand says gravitational anomalies have happened elsewhere. 48 years earlier, unknown beings positioned a wormhole near Saturn, opening a path to a distant galaxy with twelve potentially habitable worlds located near a black hole named Gargantua. Twelve volunteers traveled through the wormhole to individually survey the planets. Astronauts Miller, Edmunds, and Mann reported positive results. Based on their data, Professor Brand conceived two plans to ensure humanity's survival. Plan A involves developing a gravitational propulsion theory to propel a mass exodus, while Plan B involves launching the Endurance spacecraft carrying 5,000 frozen human embryos to colonize a habitable planet.\nCooper is recruited to pilot the Endurance. The crew includes scientists Dr. Amelia Brand (Professor Brand's daughter), Dr. Romilly, Dr. Doyle, and robots TARS and CASE. Before leaving, Cooper gives a distraught Murphy his wristwatch to compare their relative time for when he returns. After traversing the wormhole, Romilly studies the black hole while Cooper, Doyle, and Brand descend in a landing craft to investigate Miller's planet, an ocean world. After finding wreckage from Miller's ship, a gigantic tidal wave kills Doyle and delays the lander's departure. Due to the proximity of the black hole, time is severely dilated. As a result, 23 years have elapsed for Romilly on Endurance by the time Cooper and Brand return.\nEdmunds' planet has slightly better telemetry, while Mann broadcasts positive data. Cooper rules to use their remaining fuel to reach Mann's planet. On Mann's planet, the Endurance crew revive him from cryostasis. Meanwhile, Murphy, now a scientist, has transmitted a message announcing Professor Brand has died. She has learned that Plan A, requiring unattainable data from within a black hole, was never viable. Plan B was always Professor Brand's only option. Murphy accuses Amelia and Cooper of knowing those left on Earth were doomed. Mann's frozen planet is uninhabitable; he sent falsified data in order to be rescued. Mann attempts to murder Cooper, then escapes in a lander and heads for Endurance. Romilly is killed by Mann's booby trap and Amelia and Cooper race to the Endurance in another lander. Mann dies during a failed manual docking operation, severely damaging Endurance. After a difficult docking maneuver, Cooper regains control of Endurance.\n\nWith insufficient fuel to reach Edmunds' planet, they use a slingshot maneuver so close to Gargantua that time dilation adds another 51 years. In the process, Cooper and TARS jettison themselves to shed weight and ensure Endurance reaches Edmunds' planet. Slipping through the event horizon of Gargantua, they eject from their respective craft and find themselves inside a massive tesseract, possibly constructed by future humans. Across different time periods, Cooper can see through the bookcases of Murphy's old room on Earth and weakly interact with its gravity. Cooper realizes he was Murphy's \"ghost\" and manipulates the second hand of the wristwatch he gave her, using Morse Code to transmit the quantum data that TARS collected from inside the event horizon. Cooper and TARS are ejected from the tesseract. Cooper awakens on a space habitat orbiting Saturn, where he reunites with an elderly Murphy. Using the quantum data sent by Cooper, the younger Murphy solved the gravitational propulsion theory for Plan A, enabling humanity's exodus and survival. Nearing death and with her own family, Murphy urges Cooper to return to Amelia. Cooper and TARS take a spacecraft to rejoin Amelia and CASE on Edmunds' habitable planet."}