{"_movieID": "237584", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:48:23", "summary": "The Mojave Desert ( mo-HAH-vee; Mohave: Hayikwiir Mat'aar) is an arid rain-shadow desert and the driest desert in North America. It is in the North American Southwest, primarily within southeastern California and southern Nevada, and it occupies 47,877 sq mi (124,000 km2). Very small areas also extend into Utah and Arizona. Its boundaries are generally noted by the presence of Joshua trees, which are native only to the Mojave Desert and are considered an indicator species, and it is believed to support an additional 1,750 to 2,000 species of plants. The central part of the desert is sparsely populated, while its peripheries support large communities such as Las Vegas, Barstow, Lancaster, Palmdale, Victorville, and St. George.\nThe Mojave Desert is bordered by the Great Basin Desert to its north and the Sonoran Desert to its south and east. Topographical boundaries include the Tehachapi Mountains to the west, and the San Gabriel Mountains and San Bernardino Mountains to the south. The mountain boundaries are distinct because they are outlined by the two largest faults in California – the San Andreas and Garlock faults. The Mojave Desert displays typical basin and range topography. Higher elevations above 2,000 ft (610 m) in the Mojave are commonly referred to as the High Desert; however, Death Valley is the lowest elevation in North America at 280 ft (85 m) below sea level and is one of the Mojave Desert's most notorious places. Large parts of the Mojave Desert are often referred to as the \"high desert\", in contrast to the \"low desert\", the Sonoran Desert to the south. Most of the Mojave Desert is above 2,000 ft (610 m), with only Death Valley and the Colorado River basin in the east (including the neighbouring Las Vegas Valley) being lower. The Mojave Desert, however, is generally lower than the even higher Great Basin Desert to the north. The Mojave Desert occupies less than 50,000 sq mi (130,000 km2), making it the smallest of the North American deserts.The spelling Mojave originates from the Spanish language while the spelling Mohave comes from modern English. Both are used today, although the Mojave Tribal Nation officially uses the spelling Mojave; the word is a shortened form of Hamakhaave, their endonym in their native language, which means 'beside the water'."}