{"_movieID": "132363", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:46", "summary": "The Butler (full title Lee Daniels' The Butler) is a 2013 American historical drama film directed and co-produced by Lee Daniels and with a screenplay by Danny Strong. It is inspired by Wil Haygood's Washington Post article \"A Butler Well Served by This Election\".\nLoosely based on the real life of Eugene Allen, who worked in the White House for decades, the film stars Forest Whitaker as Cecil Gaines, an African-American who is a witness of notable political and social events of the 20th century during his 34-year tenure serving as a White House butler. In addition to Whitaker, the film's all-star cast also features Oprah Winfrey, John Cusack, Jane Fonda, Alex Pettyfer, Cuba Gooding Jr., Terrence Howard, Lenny Kravitz, James Marsden, David Oyelowo, Vanessa Redgrave, Alan Rickman, Liev Schreiber, Robin Williams, Minka Kelly, Mariah Carey, and Clarence Williams III. It was the last film produced by Laura Ziskin, who died in 2011.\nThe film was theatrically released by The Weinstein Company on August 16, 2013, to mostly positive reviews from critics, with many praising the cast but criticized the historical accuracy, particularly the portrayal of President Reagan. The film grossed over $176 million worldwide against a budget of $30 million.", "plot": "In 1926, at the age of seven, Gaines is raised on a cotton plantation in Macon, Georgia. When the farm's owner rapes his mother, Hattie, his father, Earl confronts him and is killed. Cecil is taken in by the estate's caretaker, who trains Cecil as a house servant.\nIn 1937, at the age of eighteen, Cecil leaves the plantation. Desperately hungry, he breaks into a hotel pastry shop. The elderly master servant, Maynard, takes pity on Cecil and gives him a job. Cecil learns advanced serving and interpersonal skills from Maynard, who later recommends Cecil for a position in a Washington, D.C. hotel. While working there, Cecil meets and marries Gloria, and the couple has two sons: Louis and Charlie.\nIn 1957, Cecil is hired by the White House during Dwight D. Eisenhower's administration. White House maître d'hôtel Freddie Fallows introduces Cecil to head butler Carter Wilson and co-worker James Holloway. Cecil witnesses Eisenhower's reluctance to use troops to enforce school desegregation, then his resolve to uphold the law by racially integrating Little Rock Central High School in Arkansas.\nLouis, the elder son, becomes a university student at Fisk University in Nashville, Tennessee, although Cecil feels that the South is too volatile. Louis joins a student program led by Southern Christian Leadership Conference (SCLC) activist James Lawson, which leads to a nonviolent sit-in at a segregated diner, where he is arrested. Gloria, who feels that Cecil puts his job ahead of her, descends into alcoholism.\nIn 1961, after John F. Kennedy's inauguration, Louis and others are attacked by members of the Ku Klux Klan while on a freedom ride to Birmingham, Alabama. Louis participates in the 1963 Birmingham Children's Crusade, where dogs and water cannons are used to stop the marchers, one of the movement's actions which inspires Kennedy to deliver a national address proposing the Civil Rights Act of 1964. After Kennedy is assassinated, his successor, Lyndon B. Johnson, enacts the legislation. As a goodwill gesture, Jackie Kennedy gives Cecil one of the former president's neckties.\nLouis participates in the 1965 Selma Voting Rights Movement, which inspires Johnson to demand that Congress enact the landmark Voting Rights Act of 1965. Johnson also gives Cecil a tie bar.\nIn the late 1960s, after civil rights activist Martin Luther King, Jr.'s assassination, Louis tells his family that he has joined the Black Panthers. Cecil orders Louis and his girlfriend to leave his house. Louis is arrested again. Cecil becomes aware of President Richard Nixon's plans to suppress the Black Panthers.\nCharlie confides to Louis that he plans to join the war in Vietnam. After enlisting, Charlie is killed and buried at Arlington National Cemetery. When the Black Panthers resort to violence, Louis leaves the organization and returns to college, earning his master's degree in political science and eventually running for a seat in Congress, although Cecil continues to hold resentment against him.\nCecil repeatedly confronts his supervisor at the White House over the unequal pay and career advancement provided to the black White House staff. With President Ronald Reagan's support, Cecil prevails, his reputation growing to the point that he and his wife are invited by the Reagans to be guests at a state dinner. Cecil becomes uncomfortable with the class divisions in the White House. After witnessing Reagan's refusal to support economic sanctions against Apartheid South Africa, Cecil resigns.\nGloria encourages Cecil to mend his relationship with Louis. Realizing his son's actions are heroic, Cecil joins Louis at a protest against South African apartheid; they are arrested and jailed together.\nIn 2008, Gloria dies shortly before Barack Obama is elected as the nation's first African-American president. Two months, two weeks and one day later, Cecil prepares to meet the newly inaugurated President, wearing the articles he received from Kennedy and Johnson. Stephen W. Rochon approaches Cecil and tells him the president is ready, preparing to show him the way to the Oval Office. Cecil tells him that he knows the way.\nIn 2009, an elderly Cecil Gaines recounts his life story while waiting at the White House to meet the newly inaugurated president.", "cast": "Forest Whitaker as Cecil Gaines, the film's main character, who dedicates his life to becoming a professional domestic worker. Michael Rainey, Jr. and Aml Ameen portray Cecil at ages 8 and 15.Gaines' private lifeOprah Winfrey as Gloria Gaines, Cecil's wife.\nDavid Oyelowo as Louis Gaines, the Gaines' elder son.\nElijah Kelley as Charlie Gaines, the Gaines' younger son. Isaac White portrays him at age 10.\nAlex Pettyfer as Thomas Westfall, the brutal plantation owner who kills Earl after raping Hattie.\nDavid Banner as Earl Gaines, Cecil's father.\nMariah Carey as Hattie Pearl, Cecil's mother.\nTerrence Howard as Howard, the Gaines' neighbor who romantically pursues Gloria.\nAdriane Lenox as Gina, Howard's wife.\nYaya DaCosta as Carol Hammie, Louis' girlfriend.\nVanessa Redgrave as Annabeth Westfall, matron of the plantation.\nClarence Williams III as Maynard, an elderly man who mentors a young Cecil and introduces him to his profession.White House co-workersCuba Gooding Jr. as Carter Wilson, the fast-talking head butler at the White House, with whom Cecil forms a close friendship.\nLenny Kravitz as James Holloway, a co-worker butler of Cecil's at the White House.\nColman Domingo as Freddie Fallows, the White House maitre d' who hires Cecil.White House historical figuresRobin Williams as Dwight D. Eisenhower, the 34th President of the United States.\nJames DuMont as Sherman Adams, Eisenhower's White House Chief of Staff.\nRobert Aberdeen as Herbert Brownell Jr., Eisenhower's Attorney General.\nJames Marsden as John F. Kennedy, the 35th President of the United States.\nMinka Kelly as First Lady Jackie Kennedy\nLiev Schreiber as Lyndon B. Johnson, the 36th President of the United States.\nJohn Cusack as Richard Nixon, the 37th President of the United States.\nAlex Manette as H. R. Haldeman, Nixon's White House Chief of Staff.\nColin Walker as John Ehrlichman, Nixon's White House Counsel.\nAlan Rickman as Ronald Reagan, the 40th President of the United States.\nJane Fonda as First Lady Nancy Reagan\nStephen Rider as Stephen W. Rochon, Barack Obama's White House Chief Usher.Civil rights historical figuresNelsan Ellis as Martin Luther King, Jr.\nJesse Williams as civil rights activist James Lawson\nDanny Strong, the film's screenwriter, appears as a Freedom Bus journalist.Presidents Gerald Ford, Jimmy Carter, Barack Obama, and civil rights leader Jesse Jackson are depicted in archival footage.Melissa Leo and Orlando Eric Street were cast as First Lady Mamie Eisenhower and Barack Obama, respectively, but did not appear in the finished film."}