{"_movieID": "181808", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:09:00", "summary": "Star Wars: The Last Jedi (also known as Star Wars: Episode VIII – The Last Jedi) is a 2017 American epic space-opera film written and directed by Rian Johnson. It is the second installment of the Star Wars sequel trilogy, following The Force Awakens (2015). It was produced by Lucasfilm and distributed by Walt Disney Studios Motion Pictures. The film's ensemble cast includes Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Andy Serkis, Lupita Nyong'o, Domhnall Gleeson, Anthony Daniels, Gwendoline Christie, and Frank Oz in returning roles, with Kelly Marie Tran, Laura Dern and Benicio del Toro joining the cast. It features the first posthumous film performance by Fisher, who died in December 2016, and the film is dedicated to her memory. It is the eighth part of the Star Wars \"Skywalker saga\", following the original and prequel trilogies.\nThe plot follows Rey as she receives Jedi training from Luke Skywalker, in hopes of turning the tide for the Resistance in the fight against Kylo Ren and the First Order, while General Leia Organa, Finn, and Poe Dameron attempt to escape a First Order attack on the dwindling Resistance fleet.\nThe Last Jedi is part of a new trilogy of films announced after Disney's acquisition of Lucasfilm in October 2012. It was produced by Lucasfilm president Kathleen Kennedy and Ram Bergman, and executive produced by The Force Awakens director J. J. Abrams. John Williams, composer for the previous episodic films, returned to compose the score. A number of scenes were filmed at Skellig Michael in Ireland during pre-production in September 2015, but principal photography began at Pinewood Studios in England in February 2016, and wrapped in July 2016. Post-production was finished in September 2017.\nThe Last Jedi had its world premiere at the Shrine Auditorium in Los Angeles on December 9, 2017, and was released in the United States on December 15, 2017. It grossed over $1.3 billion worldwide, becoming the highest-grossing film of 2017, the seventh-highest-ever grossing film in North America and the ninth-highest-grossing film of all time during its theatrical run. It is also the second-highest-grossing film of the Star Wars franchise, and turned a net profit of over $417 million. The film received positive reviews, with praise for its ensemble cast, musical score, visual effects, action sequences and emotional weight. The film received four nominations at the 90th Academy Awards, including Best Original Score and Best Visual Effects, as well two nominations at the 71st British Academy Film Awards. A sequel, titled The Rise of Skywalker, is scheduled for release on December 20, 2019.", "plot": "Shortly after the destruction of Starkiller Base, General Leia Organa leads the evacuation of Resistance forces from D'Qar, when a First Order fleet arrives. Against Leia's orders, Poe Dameron leads a costly counterattack that destroys a First Order dreadnought. The remaining Resistance escapes into hyperspace, but the First Order uses a device to track them, and attacks again. Kylo Ren hesitates to fire on the lead Resistance ship after sensing his mother Leia's presence, but his wingmen destroy the bridge, killing most of the Resistance's leaders. Leia is dragged into space, but survives by using the Force. While Leia recovers, Vice Admiral Holdo assumes command of the Resistance. Running low on fuel, the remaining fleet is pursued by the First Order.\nRey, having traveled to Ahch-To with Chewbacca and R2-D2 aboard the Millennium Falcon, attempts to recruit Luke Skywalker to the Resistance. Under self-imposed exile, Luke refuses to help and says that the Jedi should end; but, encouraged by R2-D2, he eventually begins to teach Rey about the Force. Rey and Kylo begin communicating through the Force, puzzling them both. After Kylo tells Rey what happened between him and Luke that caused him to choose the dark side, Luke confesses that he momentarily contemplated killing Kylo upon sensing that Snoke was corrupting him; this prompted Kylo to destroy Luke's new Jedi Order. Convinced that Kylo can be redeemed, Rey leaves Ahch-To. Luke prepares to burn the Jedi library, but hesitates. Luke's late teacher Yoda appears as a spirit, destroys the library by summoning a bolt of lightning, and encourages Luke to learn from his failure.\nMeanwhile, Poe entrusts Finn, mechanic Rose Tico, and BB-8 with a secret mission to find someone who can deactivate the First Order's tracking device, whom Maz Kanata says they can find in the casino town of Canto Bight. They meet the hacker DJ, and escape the city with the help of some stablehand children and riding animals they set free. Finn, Rose, and DJ infiltrate Snoke's ship, arriving at the same time as Rey, but are captured by Captain Phasma. Meanwhile, Kylo brings Rey to Snoke, who says that he facilitated the connection between her and Kylo as part of a plan to defeat Luke.\nHoldo plans to evacuate the remaining Resistance members using small transport vessels. Believing her plan to be cowardly and futile, Poe leads a mutiny. Leia recovers and stuns Poe, allowing the evacuation to begin. Holdo remains on the ship to mislead Snoke's fleet as the others flee to an abandoned base on Crait. On the First Order flagship, DJ buys his freedom by revealing the Resistance's plan to General Hux, and the First Order fleet begins firing on the evacuation transports, destroying many of them.\nOrdered to kill Rey, Kylo instead kills Snoke and defeats his guards alongside Rey. Rey hopes that Kylo has abandoned the dark side, but he instead asks her to rule the galaxy with him. Refusing, she and Kylo battle using the Force to obtain Anakin Skywalker's lightsaber, splitting it in two. Holdo sacrifices herself by ramming into Snoke's flagship at lightspeed, crippling it. Meanwhile, Rey escapes while Kylo declares himself Supreme Leader. BB-8 frees Finn and Rose; they defeat Phasma and join the survivors on Crait. When the First Order arrives, Poe, Finn, and Rose attack with old speeders. Rey and Chewbacca draw TIE fighters away in the Falcon, while Rose prevents Finn from sacrificing himself to destroy the enemy siege cannon, which subsequently penetrates the Resistance fortress.\nLuke appears and confronts the First Order to allow the surviving Resistance to escape. Kylo orders the First Order's forces to fire on Luke, who is unharmed. He then engages Luke in a lightsaber duel; upon striking Luke, Kylo realizes that Luke is not physically present but only appearing through a projection of the Force. Rey helps the remaining Resistance escape on the Falcon. Luke, exhausted, dies peacefully on Ahch-To, becoming one with the Force. Rey and Leia sense his death, and Leia tells her that the Resistance can rise again.\nAt Canto Bight, the stablehands recount the story of Luke Skywalker; one of them lifts his broom with the Force and gazes into space.", "cast": "Mark Hamill as Luke Skywalker, a powerful Jedi Master who has been in self-imposed exile on the planet Ahch-ToHamill voices Dobbu Scay, named after the film's editor, Bob Ducsay. On Canto Bight, the character mistakes BB-8 for a slot machine.\nCarrie Fisher as General Leia Organa, twin sister to Luke, former princess of Alderaan, and a leading general in the Resistance\nAdam Driver as Kylo Ren, Supreme Leader Snoke's disciple, who is strong with the Force. He is the son of Han Solo and Leia Organa, Luke's nephew, and the grandson of Darth Vader.\nDaisy Ridley as Rey, a highly Force-sensitive scavenger from the desert planet Jakku who joined the Resistance and goes to find Luke\nJohn Boyega as Finn, a former stormtrooper of the First Order who defected to the Resistance\nOscar Isaac as Poe Dameron, a high-ranking X-wing fighter pilot in the Resistance\nAndy Serkis as Supreme Leader Snoke, the leader of the First Order and Kylo Ren's master\nLupita Nyong'o as Maz Kanata, a pirate and ally of the Resistance\nDomhnall Gleeson as General Hux, the former head of the First Order's Starkiller Base\nAnthony Daniels as C-3PO, a humanoid protocol droid in the service of Leia Organa\nGwendoline Christie as Captain Phasma, the commander of the First Order's stormtroopers\nKelly Marie Tran as Rose Tico, a member of the Resistance who works in maintenance\nLaura Dern as Vice Admiral Amilyn Holdo, an officer in the Resistance\nFrank Oz as Yoda, the deceased former Jedi Master, and Luke's wise mentor, who appears as a Force spirit\nBenicio del Toro as DJ, an underworld codebreakerJoonas Suotamo appears as Chewbacca, taking over the role from Peter Mayhew after previously serving as his body double in The Force Awakens. Mayhew, who was 73 years old and suffering from chronic knee and back pain, is credited as \"Chewbacca consultant\". Billie Lourd, Mike Quinn, and Timothy D. Rose reprise their roles as Lieutenant Connix, Nien Nunb, and Admiral Ackbar respectively. Due to the death of Erik Bauersfeld, Admiral Ackbar is now voiced by Tom Kane. Amanda Lawrence appears as Commander D'Acy, and Mark Lewis Jones and Adrian Edmondson play Captains Canady and Peavey respectively. BB-8 is controlled by puppeteers Dave Chapman and Brian Herring, with initial voice work by Ben Schwartz and final sound effects voiced by Bill Hader modulated through a synthesizer. Jimmy Vee portrays R2-D2, taking over the role from Kenny Baker, who died on August 13, 2016. Veronica Ngo portrays Rose's sister Paige Tico, a Resistance gunner who sacrifices her life to destroy a First Order dreadnought.Justin Theroux plays the master codebreaker. Lily Cole plays his companion. Joseph Gordon-Levitt has a voice cameo as Slowen Lo. Warwick Davis plays Wodibin. Gareth Edwards, director of the Star Wars Anthology film Rogue One, has a cameo appearance as a Resistance Soldier, as does Gary Barlow. Edgar Wright and Joe Cornish also cameo in the film. Hermione Corfield appears as Tallissan \"Tallie\" Lintra, a Resistance A-Wing pilot and squadron leader. Noah Segan and Jamie Christopher appear as Resistance pilots Starck and Tubbs. Hamill's children, Griffin, Nathan, and Chelsea, cameo as Resistance soldiers. Prince William, Duke of Cambridge and Prince Harry filmed cameo appearances as stormtroopers. Tom Hardy also filmed an appearance as a stormtrooper, but his cameo was dropped from the final cut. Hugh Skinner cameos as a Resistance Officer."}