{"_movieID": "435995", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:09:03", "summary": "Bunyan and Babe is a 2017 American computer-animated film directed by Louis Ross, featuring the voices of John Goodman as Paul Bunyan and Jeff Foxworthy as Babe the Blue Ox. The film premiered online on Google Play, where it has been made available to watch for free between January 12, 2017 and February 16, 2017. It was theatrically released in 12 American markets on February 3, 2017.\n\n", "plot": "12 year-old Travis Barclay and his little sister Whitney are sent begrudgingly on a summer trip to visit their grandparents' farm in Delbert County. A greedy land developer, Norm Blandsford, has been buying up the little country town, running the hard working residents off their land. After Travis has a run-in with one of Blandsford's men, he is chased into the forest where he stumbles upon a magic portal to the hidden world where Paul Bunyan lives. Paul has been in self-imposed exile for 100 years, ever since the advent of machines made his role in society obsolete and left him feeling of little value to the new world. Paul, reluctantly, escorts Travis back to the farm. But upon returning, Paul witnesses Blandsford's sinister plan. Suddenly filled by a long-forgotten sense of purpose, Bunyan and Babe, the blue ox, get wrapped up in a brand new adventure and together with the help of their new friends, Travis and Whitney, they save the town. They learn firsthand that you don't have to be big to accomplish big things.", "cast": "Johnny Orlando as Travis\nJohn Goodman as Paul Bunyan\nJeff Foxworthy as Babe the Blue Ox\nKelsey Grammer as Norm Blandsford and The Amazing BlackstoneBarclay\nLola Wayne Villa as Whitney\nMark Hamill as Grandpa\nDorien Davies as Iris Ingram\nKay Cole as Grandma / Mom / Tourist Mom\nPeter Chew as Sheriff Chambers\nJeremy Guskin as Gustav\nDawnn Lewis as Maybelle Mundy\nTom Lowell as County Fair MC\nJohn D. Eraklis as Newscaster / Tourist Dad\nSandy Stone as Gas Station Attendant\nRobin Howard as Tourist Kid #1\nSophia Eraklis as Tourist Kid #2"}