{"_movieID": "4475", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:09:10", "summary": "The Private Lives of Pippa Lee is a 2009 American romantic comedy-drama film written and directed by Rebecca Miller. The screenplay is based on her novel of the same name. It features an ensemble cast including Robin Wright, Alan Arkin, Maria Bello, Monica Bellucci, Blake Lively, Julianne Moore, Keanu Reeves and Winona Ryder.\nThe film premiered on February 9, 2009, at the 59th Berlin International Film Festival and was shown at the Sydney Film Festival and the Edinburgh Film Festival before opening in the United Kingdom on July 10. Following a showing at the Toronto International Film Festival, it received a limited release in the United States on November 27, 2009.\n\n", "plot": "The film chronicles the life of Pippa Lee (Robin Wright), with flashbacks to her tumultuous past. Pippa Sarkissian (Blake Lively) was the youngest child and only girl in her large Christian family. Her mother Suky (Maria Bello) was a neurotic mother with an obsessive fixation on her daughter's looks. By her teen years, Pippa discovers that her mother takes amphetamines to self-medicate vast mood swings. She has a confrontation with her mother by taking drugs and Pippa moves to her aunt and roommate, who are in a lesbian menage. The aunt discovers Pippa participating in erotic photo sessions with the roommate and her friends; Pippa is banished again and goes on to live a bohemian life of drugs and work as an exotic dancer.\nOn a weekend jaunt with like-minded friends, she meets a charismatic publisher named Herb Lee who is 30 years older than her and a romance develops between them. The couple marry, have two children and later move into a retirement home in Connecticut. Through her marriage, Pippa has become the \"perfect wife\", loving, supportive, everything to everyone and no-one to herself.  The couple grow apart; Herb has an affair with one of Pippa's friends and middle-aged Pippa has encounters with a younger man named Chris. After Herb dies from a heart attack, Pippa breaks with her life of subservience and refuses to set up the burial, leaving the details to her children. The film ends with Pippa driving off with Chris.", "cast": "Robin Wright as Pippa Lee\nBlake Lively as Young Pippa\nAlan Arkin as Herb Lee\nKeanu Reeves as Chris Nadeau\nMaria Bello as Suky Sarkissian\nZoe Kazan as Grace Lee\nWinona Ryder as Sandra Dulles\nMike Binder as Sam Shapiro\nMonica Bellucci as Gigi Lee\nRyan McDonald as Ben Lee\nJulianne Moore as Kat\nShirley Knight as Dot\nRobin Weigert as Trish"}