{"_movieID": "396371", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:54:39", "summary": "Molly's Game is a 2017 American biographical crime drama film written and directed by Aaron Sorkin (in his directorial debut), based on the memoir of the same name by Molly Bloom. It stars Jessica Chastain, Idris Elba, Kevin Costner, Michael Cera, Jeremy Strong, Chris O'Dowd, and Bill Camp. The film follows Bloom (Chastain), who becomes the target of an FBI investigation of the underground poker empire she runs for Hollywood celebrities, athletes, business tycoons, and the Russian mob.\nPrincipal photography began in November 2016 in Toronto, Ontario, Canada. The film premiered on September 8, 2017, at the Toronto International Film Festival, and began a limited theatrical release in the United States on December 25, 2017, by STXfilms, before expanding wide on January 5, 2018, and grossed $59 million worldwide. Molly's Game received positive reviews, with particular praise for Sorkin's screenplay, as well as Chastain and Elba's performances, with the former being considered one of the best of her career by some critics. The film earned Chastain a Golden Globe nomination for Best Actress – Drama, while Sorkin earned nominations for his screenplay at the Academy Awards, Golden Globes, Writers Guild of America Awards, and BAFTA Awards.", "plot": "Molly Bloom is a world-class mogul skier with Olympic aspirations, the result of years of enforced training from her overbearing father. In a qualifying event for the 2002 Winter Olympics, she is severely injured, ending her career.\nInstead of following her original plan of attending law school, Molly decides to take a year off and move to Los Angeles. Once she arrives, she becomes a bottle service waitress at a club, where she meets Dean, an ostentatious but unsuccessful real estate developer. She becomes his office manager, and he soon involves her in running his underground poker games. Many famous and wealthy individuals, such as movie stars, investment bankers, and sports players, are involved in Dean's game. Molly earns large sums of money in tips alone.\nMolly is initially uninformed on poker topics but quickly learns how to appeal to the players to gain tips. In particular, she hopes to please the most successful player, Player X, by attracting new players to the game. Dean, upon seeing that Molly is becoming increasingly independent in running the games, attempts to control her, and then he fires her. Molly, having gained contacts through years of running the game, decides to create her own poker games. She rents a penthouse at a hotel and hires a staff to help her run games. Additionally, she contacts employees at clubs and casinos to try and spread word about her poker games. Player X, along with many other players, decides to leave Dean's games to play at Molly's game. Molly becomes increasingly successful, gaining more money while being pressured by Player X to raise the stakes for her games. Harlan Eustice, a skilled, conservative, and successful player, joins Molly's game. One night, after accidentally losing a hand to the notorious worst player in Molly's circle, Harlan becomes increasingly compulsive, suffering heavy losses (later, Molly finds out that Player X, who enjoys ruining people's lives more than the game itself, has been funding Harlan to keep him in the game). After Molly berates him for his unethical actions, Player X decides to change venue for his games, and the other players join him, leaving Molly.\nMolly moves to New York, with the hope of beginning a new underground poker game. After reaching out to many wealthy New Yorkers, Molly finds enough players for several weekly games. Despite continuous success, she fears being unable to cover her losses when players cannot pay. Her dealer convinces her to begin taking a percentage of large pots, allowing her to recoup her potential losses but making her game an illegal gambling operation. One of her Los Angeles players is indicted for running a Ponzi scheme; Molly is investigated and questioned as to who attended her games. At this time, Molly becomes increasingly addicted to drugs, as the games have increasingly taken their toll. Her players also begin to include wealthy individuals from the Russian mafia, among others. She is approached by several Italian mafia members who offer their services to extort money from non-paying players. After she declines, she is attacked in her home, where she is held at gunpoint and her mother's life is threatened. As she is about to return to her poker games, the FBI conducts a raid, a result of Douglas Downey, one of her players, acting as an informant. Molly's assets are seized, and she returns home to live with her mother.\nTwo years later, Molly has moved out and published a book where she names a few individuals that played in her games. She is arrested by the FBI and indicted for involvement in illegal gambling with the mafia. She enlists the help of Charlie Jaffey, a high-profile and expensive lawyer in New York, who agrees to help after he learns that she has been protecting innocent people who were affected by her poker games. While she is in New York awaiting trial, her father, Larry, seeks her out and attempts to reconcile with her. He admits that he was overbearing and that he treated Molly differently than her brothers because she had known about his affairs. Charlie reads Molly's book and becomes interested in helping her case, as he feels she has not committed serious enough wrongdoing to merit a prison term. Charlie negotiates a deal for Molly to receive no sentence and for her money to be returned in exchange for her hard drives and digital records from gambling. Molly declines this deal, fearing that the information about her players would be released, and she pleads guilty. The judge, deciding that she had committed no serious crimes, sentences her to community service, probation, and a $200,000 fine."}