{"_movieID": "343668", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:23", "summary": "Kingsman: The Golden Circle is a 2017 action spy comedy film produced and directed by Matthew Vaughn and written by Vaughn and Jane Goldman. It is a sequel to Kingsman: The Secret Service (2014) which is based on the comic book series Kingsman, created by Dave Gibbons and Mark Millar. The film features Colin Firth, Taron Egerton, Mark Strong, Edward Holcroft, Hanna Alström, and Sophie Cookson reprising their roles from the first film with Julianne Moore, Halle Berry, Pedro Pascal, Elton John, Channing Tatum, and Jeff Bridges joining the cast. The film follows members of Kingsman needing to team up with their American counterpart, Statesman, after the world is held hostage by Poppy Adams and her drug cartel, \"The Golden Circle\".\nKingsman: The Golden Circle premiered in London on 18 September 2017 and was theatrically released in the United Kingdom on 20 September 2017 in 3D and 2D and in the United States on 22 September 2017 in IMAX. It grossed $410 million worldwide against a budget of $104 million and received mixed reviews from critics, with the film's length being targeted for criticism and the film's new characters and stylized action garnering polarized responses.A prequel, The King's Man, is currently scheduled to be released on February 14, 2020.", "plot": "A year after  defeating Richmond Valentine and foiling his plans,  Gary \"Eggsy\" Unwin has officially joined Kingsman, taken his late mentor Harry Hart's title of Galahad as well as Harry's old house, and begun a relationship with Tilde, Crown Princess of Sweden, whom he'd saved in the previous movie. On his way home from the tailor shop, he is ambushed by Charlie Hesketh, a rejected Kingsman applicant and a former trainee who lost his arm and vocal cords (but was inadvertently saved by Eggsy) during the Valentine incident. Eggsy evades Charlie and his henchmen in a car chase across London, but Charlie's cybernetic arm, severed in the skirmish, hacks into the Kingsman servers through the computer in Eggsy's car. With the information gained, Poppy Adams, the leader of the world's largest drug cartel, the Golden Circle, launches missiles that destroy the Kingsman headquarters and kill all of the agents in Britain, including Eggsy's best friend Roxy and his other friend Brandon, who was at Eggsy's house to look after his dog while Eggsy was in Sweden with Tilde.\nEggsy and his only surviving colleague Merlin follow an emergency Doomsday Protocol which leads them to Statesman, the American counterpart of Kingsman posing as a bourbon whiskey business based in Kentucky. There, they discover that Harry survived his shooting by Valentine thanks to Statesman technology, but has amnesia, which can only be cured by reliving a traumatic event. Statesman head Champagne offers the organization's support to bring down the Golden Circle. Statesman Agent Tequila develops a blue rash and shows signs of mania, ultimately being replaced by another agent, Whiskey, as Eggsy's partner. Eggsy plants a tracking device on Charlie's ex-girlfriend Clara Von Gluckfberg during a sexual encounter at Glastonbury Festival, but when he tells Princess Tilde beforehand what he has to do, it puts a strain on their relationship.\nEggsy later manages to cure Harry's amnesia by threatening to shoot a Cairn Terrier puppy that resembles Harry's late dog Mr. Pickle, causing Harry to remember the blank bullet for the Kingsman selection exercise involving shooting the recruit's dog. During their next mission, Poppy broadcasts a message announcing she has added a toxin to all her drugs which causes users to develop symptoms like Tequila's, before succumbing to paralysis and ultimately death. She offers the antidote to the world if the President of the United States will end the war on drugs and grant her cartel immunity from prosecution. The President publicly negotiates, but secretly decides to let everyone affected die, as he is more than happy to get rid of all drug users and put Poppy out of business.\nEggsy, Harry and Whiskey track Clara to a Golden Circle facility in Italy. Eggsy manages to steal a sample of the antidote, but it is accidentally broken by Whiskey during an attack by the Golden Circle's henchmen, leading Harry to suspect him of working against them and breaking the sample on purpose. Harry shoots Whiskey in the head, but Eggsy, believing Harry to be delusional due to an incomplete recovery, saves him with the same technology that Statesman used to save Harry. Charlie kills Clara by destroying the facility to prevent any more samples from being taken and leave no traces behind. Princess Tilde calls Eggsy in a manic state, showing she has symptoms as a result of smoking cannabis in a fit of depression. Eggsy, Harry and Merlin discover the location of Poppy's hideout in Cambodia, \"Poppy Land\", and fly there.\nWhile reconnoitering Poppy Land, Eggsy steps on a land mine, but Merlin sacrifices himself to save him and Harry while taking out a handful of Poppy's guards and singing  his favorite John Denver song at the same time. A vengeful Eggsy and Harry storm through the lair as they kill all the guards they come up against; Eggsy fights and kills Charlie as revenge for his fallen comrades, while Harry destroys Poppy's robotic attack dogs with the help of Elton John, who had been kidnapped by Poppy during Valentine's attack and forced to sing for her. They secure the laptop controlling the drones that are able to deliver the antidote worldwide and inject Poppy with a concentrated dose of her own toxin and heroin to dull her senses and let her guard down. A diluted Poppy gives them the laptop password for the antidote, but she dies from an accidental overdose. Whiskey interrupts them before they can deploy the drones, revealing that his pregnant wife was killed in a robbery committed by two methamphetamine users years ago; because of this, he has a personal vendetta against all drug users, and wants them to die. Eggsy and Harry fight and kill Whiskey, then activate the drones, delivering the antidote worldwide.\nIn the aftermath, the President is impeached and arrested for conspiring to let the victims die and Statesman purchases a distillery in Scotland to help rebuild Kingsman. Statesman tech support specialist Ginger Ale is appointed to be the next Agent Whiskey, Eggsy marries Princess Tilde and a cured Tequila joins Kingsman, which acquires a new tailor shop in London.", "cast": "Flashback footage from The Secret Service includes Samuel L. Jackson and Sofia Boutella as Richmond Valentine and Gazelle, respectively. Tobias Bakare and Theo Barklem-Biggs return as Eggsy's friends Jamal and Ryan, with Thomas Turgoose and Calvin Demba introduced as two of Eggsy's other friends, Liam and Brandon. Furthermore, Samantha Womack makes a brief return appearance as Michelle Unwin, Eggsy's mother. Additionally, Poppy Delevingne portrays Clara Von Gluckfberg, Charlie's ex-girlfriend whom Eggsy meets; Keith Allen and Tom Benedict Knight feature as Charles and Angel, two of Poppy's henchmen, while James Caroll Jordan appears as Guy Clark, one of Poppy's professors at Harvard University. Mark Arnold portrays General McCoy, an advisor to the President of the United States. Björn Granath (in his final film performance) and Lena Endre feature as the King and Queen of Sweden, respectively. Shannon Bream and Bill Hemmer of Fox News appear as themselves."}