{"_movieID": "403431", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:08:58", "summary": "Brigsby Bear is a 2017 American comedy-drama film directed by Dave McCary in his feature directorial debut, and produced by The Lonely Island. The film stars Kyle Mooney, Mark Hamill, Greg Kinnear, Matt Walsh, Michaela Watkins, Jorge Lendeborg Jr., and Ryan Simpkins. In Brigsby Bear, a captive man named James is rescued from an underground bunker where he obsessed over a children's television program titled \"Brigsby Bear Adventures\". When he realizes the show was created by his captor, his fascination leads him to finish the storyline himself.\nMooney and Kevin Costello co-wrote the screenplay with a story by Mooney. The film was inspired by McCary, Mooney, and Costello's middle school experiences making short films together, with a story stemming from Mooney's fascination with 1980s children's shows. Principal photography took place in Utah during Mooney and McCary's break from working on Saturday Night Live.\nThe film premiered at the Sundance Film Festival on January 23, 2017, and was released on July 28, 2017, by Sony Pictures Classics. Brigsby Bear received positive reviews from critics, who praised the script, direction, cast and art design; critics also commended the film's sentimental tone.", "plot": "James (Kyle Mooney) lives in an underground bunker home with his parents Ted and April Mitchum (Mark Hamill and Jane Adams), whom he is forced to stay underground with. Ted tells James that the outside world is dangerous to them, and James often watches him leave the bunker with a gas mask on. James is fascinated with an educational children's show called Brigsby Bear as he owns every episode on VHS Tape and fills his room with memorabilia. One night, he sneaks out only to see several police cars approach the home. The police raid the bunker and James is taken away from Ted and April who are arrested.\nJames is brought to the police station and meets Detective Vogel (Greg Kinnear), an investigator. Vogel tells James that Ted and April are not his real parents, and that he has been held captive since he was a baby. He also informs James that Brigsby Bear is not real and was made by Ted, a former artist and designer who disappeared with his wife in 1987; Vogel explains that they tracked Ted from the studio where the show was made. Vogel introduces James to his real parents, Greg and Louise Pope (Matt Walsh and Michaela Watkins), and their teenage daughter Aubrey (Ryan Simpkins). Though they try introducing James to his new life, he can't stop thinking about Brigsby Bear.\nOne night, Aubrey takes James to a party. He meets Aubrey's friend Spencer (Jorge Lendeborg Jr.) and later starts talking about Brigsby Bear to his new friends. This prompts him to come up with the idea to make a movie based on the character to close the series. He starts production after Detective Vogel, who sympathizes with James through Vogel's own early acting dreams, lends James some props from the show, and Spencer, being a filmmaker, agrees to make the movie with him. Spencer also advertises the movie by uploading episodes of Brigsby Bear to YouTube, where it gains popularity and a new audience. Greg and Louise do not approve of James' activities because they fear it hinders his chances of living a normal life.\nWhile filming in a forest, James uses an explosive he made for a scene that detonates, surprising Spencer. The group is arrested but James takes the blame for it. The police release him, but confiscate the Brigsby Bear props once again. James takes his parents' car out one night to steal the costumes and props. He takes a detour first to his old underground home, now abandoned and cordoned off with yellow tape. James stops by a diner and discovers Whitney (Kate Lyn Sheil), the actress who played both Arielle and Nina Smiles in the show. She tells him that she never knew the true circumstances behind the side acting job, having been told by Ted Mitchum that it was for Canadian public access. As the police arrive outside, James asks Whitney to reprise her role for his film and admits that he had a longtime crush on her through the show.\nJames is placed in a mental institution. Meanwhile, Aubrey shows her parents parts of the movie, where the two realize that making the movie allowed him to spend time with his friends. One night, James breaks out of the institution to grab his belongings, but discovers his family, along with Spencer and Detective Vogel, building a Brigsby Bear set in their garage. They tell him that after they saw how happy he was behind the scenes, they agree to help out as well.\nJames later visits Ted in jail. James tells Ted about the movie and asks him to voice Brigsby in the film, which he does. James finishes the movie, with Detective Vogel playing the character Feldo Mortese and Whitney as the Smiles Sisters. On premiere night, the show is sold out and James is worried no one will like it, so he stays out of the theatre while the movie plays. When James walks into the theater, he is met with a standing ovation. James is happy that the film is a success. He looks over to the stage and sees Brigsby wave goodbye and disappear.", "cast": "Kyle Mooney as James Pope\nMark Hamill as Ted Mitchum\nGreg Kinnear as Detective Vogel\nMatt Walsh as Greg Pope\nMichaela Watkins as Louise Pope\nRyan Simpkins as Aubrey Pope\nJorge Lendeborg Jr. as Spencer\nClaire Danes as Emily\nBeck Bennett as Deputy Bander\nAlexa Demie as Merideth\nChance Crimin as Logan\nAndy Samberg as Eric\nKate Lyn Sheil as Whitney / \"Arielle and Nina Smiles\"\nKiera Milan Hendricks as Young Smiles Sisters\nJane Adams as April Mitchum\nTim Heidecker as Coach Brad\nNick Rutherford as Excited Man"}