{"_movieID": "110415", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:47:30", "summary": "Snowpiercer (Korean: 설국열차; Hanja: 雪國列車; RR: Seolgungnyeolcha) is a 2013 science-fiction action film based on the French graphic novel Le Transperceneige by Jacques Lob, Benjamin Legrand and Jean-Marc Rochette. The film is directed by Bong Joon-ho, and written by Bong and Kelly Masterson. A South Korean-Czech co-production, the film marks Bong's English-language debut; approximately 80% of the film was shot in English.The film stars Chris Evans, Song Kang-ho, Tilda Swinton, Jamie Bell, Octavia Spencer, Go Ah-sung, John Hurt, and Ed Harris. The movie takes place aboard the Snowpiercer train, operating on a globe-spanning track, carrying the last remnants of humanity after an attempt at climate engineering in order to stop global warming has unintentionally created a new Snowball Earth. Evans stars as Curtis Everett, a member of the lower-class tail section passengers as they lead a revolution against the elite of the front of the train. Filming was done on train car sets mounted on gimbals at Barrandov Studios in Prague to simulate the motion of the train.\nSnowpiercer received critical acclaim, and appeared on many film critics' top ten film lists of 2014 following its international release. Praise was primarily directed towards its vision, direction, and performances, particularly Evans's and Swinton's. Initially planned for a limited-screen showing in the United States, the critical response to the film prompted The Weinstein Company to expand the showing to more theaters and through digital streaming services. Produced at a budget of $40 million, it remains the most expensive Korean production ever.", "plot": "In 2014, an attempt to counteract global warming through climate engineering backfires catastrophically, causing another ice age and extinguishing all life. The only survivors are the passengers of the Snowpiercer, a massive train traveling on a circumnavigational track created by the transportation magnate and inventor, Wilford.\nBy 2031, privileged passengers inhabit the extravagant front cars while the \"scum\" inhabit the tail in squalid and brutal conditions. Under watch by Wilford's guards, they are brought only gelatinous \"protein blocks\" to eat. Curtis Everett plans to lead the tail passengers in a revolt that will take them all the way up to the engine, a perpetual motion machine. He strategizes with Gilliam, his mentor and the leader of the tail, and Curtis's second-in-command Edgar.\nA woman named Claude and armed guards come to take two small children, Andy and Timmy; claiming that it is for a mere medical exam. Andy's father, Andrew, attempts to fight back, but is punished by the brutal overseer, Minister Mason; he is forced to put his arm into the extreme cold outside the train, effectively amputating it. Enraged, Curtis initiates their plan the next time they are fed. Curtis realizes that the guards have no ammunition, having apparently used all of it in prior tail rebellions. Curtis and the tail passengers easily rout them and take the security and prison cars, seeing daylight for the first time in over a decade.\nIn the prison car, Curtis releases security expert Namgoong Minsu and his clairvoyant daughter Yona so he can disable the locks between cars, offering them a hallucinogenic drug \"Kronole\" as payment. Gilliam suggests that if they take the water supply car, they will control any negotiations with Wilford. The group continues into the protein block manufacturing section, where Curtis learns that the protein blocks they have been served for nearly two decades are actually paste from ground up cockroaches. In the next car, the group is ambushed by an enormous group of masked guards with hatchets, spears and other melee weapons directed by Mason and Franco. The train then heads into a long tunnel, plunging the car into darkness. The masked men are equipped with night vision goggles, leaving the insurgents at a disadvantage. They are quickly able to fashion some torches, which levels the playing field, and launch a counterattack. In the ensuing bloody combat, Curtis reluctantly allows Edgar to be killed so he can capture Mason. The next day, some of the insurgents continue with her as a hostage while the rest remain behind to tend the injured and guard the prisoners. They travel through many luxurious cars, learning that the train has a fully supported ecosystem and serves delicacies to the upper class passengers such as sushi.\nThe group arrives at a classroom, where the teacher expounds to the children and the rebels on the greatness of Wilford and the \"sacred engine\". The propaganda video for children shows that the train travels 438,000 km a year on a world-wide railway track, 24 hours a day, without stopping. According to this, the train is moving at an average speed of 50 km/h. While distracted by the celebration of the New Year marking one circumnavigation of the globe, the teacher ambushes them with a loaded submachine gun, killing Andrew before Grey kills her. Further back, Franco and Mason's soldiers use the same distraction to kill the rest of the rebel army. Franco executes Gilliam, and Curtis kills Mason in revenge. Curtis's group continues forward, followed by Franco, leading to a violent fight in a sauna car during which Franco kills Grey and mortally wounds Tanya before Curtis and Namgoong seemingly kill him.\nFinally, the only three survivors of the revolution, Curtis, Namgoong and Yona make it to the gate to the engine at the front. Curtis attempts to get Namgoong to open the gate to the engine, but he refuses, revealing that he plans to use the highly flammable Kronole as an explosive to blow a hatch to the outside, as he has observed several signs the world outside is thawing and may be hospitable to life. Curtis confesses to him that shortly after boarding the train, the tail passengers resorted to cannibalism to survive, and he is haunted by his part in it. He was nearly ready to kill the infant Edgar when Gilliam offered his own arm instead. Meanwhile, Franco is revealed to have survived and makes his way toward the engine.\nWilford's assistant Claude emerges from the engine, shoots Namgoong, and invites Curtis inside where he finally meets Wilford. Wilford reveals that Curtis' revolution was actually orchestrated by himself and Gilliam to reduce the population and maintain the balance of the sealed ecosystem. He subsequently orders the elimination of 74% of the remaining tail passengers. He explains the importance of using fear and chaos to maintain order and leadership on the train.\nAfter letting Curtis experience being alone for the first time in eighteen years, Wilford asks Curtis to replace him. Curtis appears ready to accept, when Yona runs in and pulls up a floorboard, showing Curtis that small children from the tail section, including Andy and Timmy, are being used as replacement parts for \"extinct\" machinery; the tail section serves to provide this resource for the engine. Curtis subdues Wilford and sacrifices an arm to save Timmy from this work, though Andy refuses to be saved. Namgoong revives and finally kills Franco as Yona lights the fuse on the Kronole. However, the door to the engine short-circuits and doesn't close, forcing Curtis and Namgoong to tightly embrace Yona and Timmy, protecting them from the blast. The explosion triggers an avalanche that derails the train. Yona and Timmy, apparently the only survivors, emerge from the wreckage and see a polar bear in the distance – proof that life exists outside the train.", "cast": "Chris Evans as Curtis EverettThe leader of the revolution. About the character of Curtis, Evans said, \"I mean, for me, the tail section is, I think that's Curtis. I think that's who he is. The tail section is hard; it's grinding; it's tough; it's real. So that's where I had the most fun. Back there.\" Casting directors suggested Evans to Bong, who initially had misconceptions of Evans before they met due to the \"caricature of the American all muscle\", but quickly departed from that notion and described Evans as \"... he's actually very sensitive and has a quiet and introverted side. He's a very, very smart person, and he's a director.\" Bong was introduced to the films Puncture and Sunshine where he described Evans' performances as showing his \"sensitive acting abilities\". Bong and Evans spent months talking about the dialogue, and Bong received help from the cast and crew including Evans due to it being his first English language film. Bong said that for the role of Curtis, hiding Evans' muscular physique was the most difficult thing about working with the actor. Explaining, \"He's supposed to be in the poor tail section for 17 years, eating only protein blocks, and it was tricky to hide all of that muscle mass with costume and make-up.\" On whether he was surprised by the fan response, Evans said, \"I've been surprised about everything about this movie. Every movie you make, you hope people will enjoy it, but this movie has surpassed all of my expectations across the board.\"Song Kang Ho as Namgoong MinsooThe specialist who designed the security features on the train. On taking the role, Song said, \"This was the third time I worked with director Bong, and working with director Bong is a wonderful experience. ... this time around, working with the wonderful cast members was a tremendous experience.\" Describing Namgoong, Bong said, \"He sets up the ending, because he has a vision about this world that's different from Curtis'. He has a desire to go outside of the train.\" On the name of the character, Bong stated, \"I was looking for a name that would be most difficult for foreigners to pronounce. Namgoong ... it is difficult. There are some name-related jokes in the film.\" Song plays a character who only speaks Korean, and although as difficult as it was, he said, \"... at the same time, it was very refreshing and fun to do.\"Ed Harris as WilfordThe creator and caretaker of the engine. Dustin Hoffman was considered for the role. About the character, Harris said, \"He's so built up, who this guy is, and then there's this big thing open, and he's just this old guy making dinner with his robe on, but director Bong really wanted him to be matter-of-fact and very mundane, and simple, and kind of freaky that way.\" Harris also added that the character is \"probably a coagulation of various folks\". The role of Wilford was the last to be cast, and it was friend and fellow filmmaker Park Chan-Wook who suggested Harris for the role. Bong stated that Wilford needed to be played by someone with \"tremendous presence and performance from the first moment that he appeared in order to convince the audience\", adding that \"[Harris] turned Wilford into a lively and ironic character with added appeal.\" On taking the role of Wilford, Harris mentioned, \"When I was sent this script, I was told director Bong is a Korean director, and that he'd made some other films, but I had never seen any of them ... I thought they were wonderfully accomplished films, which really made me want to work with the guy. I'm a big fan of his.\" Harris praised Bong very highly, especially his tendency of editing the piece whilst shooting. Since the film's release, Bong has revealed background information about the character, such as Wilford being bisexual, \"He slept with Claude, the Egg-Head, Mason, and the pregnant teacher. Yet, his the One is the Engine.\" Tyler John Williams portrays a young Wilford.John Hurt as GilliamThe spiritual leader of the tail section. Bong first saw Hurt in The Elephant Man while at middle-school, which made him curious about the actor; for the part of Gilliam he wanted an older actor, though one with the ability to \"exude the ambience of spirituality.\" On the character of Gilliam, Hurt said, \"He is certainly shadowy, but he is shadowy for a reason. Even though I still am not entirely certain what the reason is,\" adding, \"... as far as Gilliam is concerned, he believes in the status quo, but he also sees himself as a true humanitarian. I mean he has literally given his limbs to these people.\" Hurt stated that the role of Gilliam was physically challenging one at that, because, \"... the fact that I had one leg strapped behind me, trying to stagger around on those not very easy-to-use crutches. ... and having to make it look like as though I'd been doing it for years.\" He too acknowledged Bong's encouragement of collaboration in allowing the cast and crew to \"interpret things as we want, as we see fit\" as well as adding pointers to the act. Hurt said of Bong, \"I just fell in love with him. He was wonderful. I hadn't seen anything. I hadn't seen Mother or anything, which I immediately did when I got home. I went, 'Wow, that's the chap I was talking to.' Thank God instinct has left me completely. I adored him then, I adored him ever since.\" as well as previously adding, \"He is quite different but technically, he is as clever as Hitchcock. That's saying something. ... He is one of the best directors I've worked with. I absolutely adore working with him.\"Tilda Swinton as Minister MasonWilford's right hand, the second in command on the train and the spokesperson for Wilford for the past 17 years. About the character, Swinton said, \"Mason is a pretty monstrous construct so we felt we were dealing with extremes, but the truth was that we didn't have to go that far. Look at Hitler with his dyed black hair and Gaddafi with handmade medals stuck on his jacket.\" Swinton prepared for the role by studying clowning politicians throughout history, and Mason is, in Swinton's words, \"a complete smash cut of all the monstrous, maniacal, political clowns.\" Swinton added that the character is a mix of Margaret Thatcher, Colonel Gaddafi, Adolf Hitler and Silvio Berlusconi. The Yorkshire accent Swinton uses is based on someone from her early life who had the accent and to her, \"was an early example of authority\". Tilda and Bong met at the Cannes Film Festival when We Need to Talk About Kevin played and both wanted to work together. In one original scenario, Mason was a middle-aged man and first mentioned as \"peaceful\", so Bong changed it and offered it to Swinton. Bong added, \"I originally talked to John C. Reilly about playing Mason.\" On Mason's appearance, Bong stated, \"Tilda actually wanted to take the look further and I had to pull her back. She at the time really wanted to transform herself and look different than she ever looked before. I was all for it. Obviously there was something that started the whole look.\" Additionally Swinton stated, \"As we were playing we had these ideas, like fantastic pendulous breasts ... And Jamie Bell loved wearing them of course. We have a picture of him. Our crew picture involves [Bell] wearing Mason's breasts.\" Bong was inspired by a photo Ondřej Nekvasil found of a lady inside the National Museum of Natural History, and he showed the image to Tilda who \"loved it\". The appearance of Mason was based on Roxie Collie Laybourne.Jamie Bell as EdgarCurtis's second-in-command. On taking the role, Bell said, \"The reason why I wanted to be a part of the film was because of what Director Bong had to say about it; it was his vision that he brought to the table and I thought what it stood for was important to me.\" When asked of performances that were interpreted differently onscreen from the screenplay, writer Masterson stated, \"[Bell] is very impish and mischievous as Edgar, which I didn't predict from his character. That might just be Jamie.\" and of his performance, \"I think [Bell]'s performance, a lot of it is improvised, and quite brilliantly.\" On relating to the character, Bell said, \"You know, I come from a very working-class background myself. There was the sense that I had to overcome something and really test myself. So in a way Edgar is very similar, he genuinely doesn't have anything and he's the lowest of the low of these people.\"Octavia Spencer as TanyaA determined mother who is set on getting her son back. Despite not possessing the qualities of a fighter, she nonetheless takes part in the rebellion and speaks for the people of the tail section. The film marks Spencer's first time working in the science-fiction genre. Spencer described Bong as \"an auteur\" and expressed sadness at the studio's proposal to cut the film. On imagery from the history base of references, Bong said, \"When [Spencer]'s character is being beaten by the soldier, it's meant to remind people, somewhat, of the Rodney King incident.\" On the message of the film, Spencer said, \"We are all covered in smoke and dirt from years and years of not washing and particles in the air, and we are all the same color if you look at it.\"Ewen Bremner as AndrewA helpless father whose only wish is to protect his son. On taking the role, Bremner said, \"I watched director Bong's film Mother which I was really knocked out by. He has a much adventurous sense of a character and he's a rare director in his route to cast actors that he really likes.\" Despite the weak and frail imagery of the character of Andrew, Bong needed an actor who was able to convey the raw emotion of the character to the audience directly. Bong became a fan of Bremner's after watching his appearance in Naked. On Bremner, Bong said, \"He would become an actor like Byun Hee-bong one day.\"Go Ah-sung (credited as Ko Asung) as YonaThe 17-year-old daughter of Namgoong Minsoo. On taking the role, Go said, \"It was like going back to where it all started. Director Bong gave instructions and Mr. Song gave me advice or guidance, so it felt like I had returned to being on my first film, The Host ....\" About her character's name, Go said, \"[Bong] couldn't think of any name for Yona; he just left her as \"The Inuit Girl\". I gave him Nastyona's album, and he went \"This is it!\" adding, \"It also matches the Biblical figure Jonah [pronounced Yona in some languages, including Korean] and had a right feel to it.\" She added that she spoke with a mixed accent of the United States, Philippines and India, and spoke to fellow cast member Ewen Bremner for advice on her English pronunciation. Go described Yona as being, \"... someone who was completely indifferent to Minsu's ambition. Even if she knew, she wouldn't have cared.\" Of Yona's background, Bong revealed, \"Yona's mother was the leader of the Frozen Seven's revolution—because she was an Inuit. She was confident that she could endure the coldness. However, she went out too early.\"Alison Pill as TeacherFound teaching a classroom of young students, towards the front of the Snowpiercer.Vlad Ivanov as Franco the ElderA seemingly indestructible henchman working for Minister Mason.Luke Pasqualino as GreyGilliam's bodyguard, a muscular, agile, fast-moving warrior who is handy with knives. On taking the role of Grey, Pasqualino said, \"I got to work with a dream cast and [Bong] who I think is frankly a genius. I feel very lucky and privileged to be given the opportunity ...\" Grey has various tattoos on his body, each seeming having a specific story, including Gilliam's name tattooed on the heart side of his chest. After the film's release Bong revealed background information, \"There are homosexual relationships among the men. Gilliam and Grey seem like a couple with a large age gap. Gilliam is someone whom Grey admires deeply, of course, but one could imagine they sleep together too. And Gilliam sends Grey to Curtis.\"Additionally, Adnan Hasković as Franco the Younger, an executor of the army led by Mason; Clark Middleton as the Painter, who's often seen drawing other passengers or key events visually chronicling underclass life and death; Emma Levie as Claude, Wilford's assistant who may have a relationship with Wilford; Tómas Lemarquis as Egg-head, one of Wilford's agents that aids in the New Year celebration massacre; Steve Park as Fuyu, a regimented assistant to Mason; and Paul Lazar as Paul, one of the rebels in Curtis' army who makes the protein blocks. The creators of the graphic novel, Jean-Marc Rochette and Benjamin Legrand, have cameo appearances in the film."}