{"_movieID": "438674", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:59:02", "summary": "Dragged Across Concrete is a 2018 American neo-noir crime thriller film written and directed by S. Craig Zahler. The film features an ensemble cast including Mel Gibson, Vince Vaughn, Tory Kittles, Michael Jai White, Jennifer Carpenter, Laurie Holden, Fred Melamed, Udo Kier, Thomas Kretschmann, and Don Johnson. It premiered at the 75th Venice International Film Festival on September 3, 2018, and received a limited theatrical and video-on-demand simultaneous release from Summit Entertainment on March 22, 2019.\n\n", "plot": "Brett Ridgeman and Anthony Lurasetti are a pair of police officers working the urban beat in the city of Bulwark. During a drug bust, the older, more volatile Ridgeman becomes unnecessarily rough with a suspect, using his foot to jam the man's face into a fire escape. They also pour cold water on and mock the suspect's partially-deaf girlfriend. The former act is caught on video, and the two men are called before their superior, Lt. Calvert. Although Ridgeman asks that Lurasetti be spared from any sort of reprisal, Calvert is forced to suspend both men without pay in order to appease the media. With Ridgeman's wife unable to work due to illness and Lurasetti preparing to propose to his fiancee, the men resolve to use the criminal connections they have developed through their time in law enforcement to make cash that will sustain them until their suspensions are lifted. Through Friedrich, a wealthy businessman and criminal associate who owes him a favor, Ridgeman gets a lead on a score from Lorentz Vogelmann.\nMeanwhile, recently released ex-con Henry Johns, hoping to finance better opportunities for his drug-addicted, prostitute mother and his bright but wheelchair-bound little brother, joins up with his childhood friend Biscuit for a mysterious but lucrative job. Their employer turns out to be Vogelmann, who uses them as getaway drivers and lookouts for a bank robbery. Ridgeman and Lurasetti tail Vogelmann's crew, quickly identifying the telltale signs of a bank robbery; though Lurasetti considers calling the robbery in, Ridgeman convinces him to allow them to carry out the job before robbing them. \nHolding up the bank for a score of gold bullion, Vogelmann and his cronies sadistically and needlessly execute several employees, including Kelly Summer, a teller on her first day back from maternity leave. The brutality does not sit well with Henry and Biscuit, who realize they are likely expendable to Vogelmann. Lurasetti is also wracked with guilt over his and Ridgeman's inaction as they tail the robbers to a rendezvous point in the countryside.\nAs the bank robbers arrive at their checkpoint, Henry and Biscuit turn on them, leading to a shootout in which Biscuit is killed, one of Vogelmann's henchmen is wounded, and Henry escapes. Ridgeman and Lurasetti arrive, and an extended standoff with the bank robbers ensues. Vogelmann blackmails his hostage by threatening her family before having her crawl to the off-duty cops. He then shoots Lurasetti when his guard is down and Ridgeman kills the hostage after she attacks Lurasetti. A dying Lurasetti listens to a voicemail from his girlfriend in which she refuses his marriage proposal. Ridgeman single-handedly finishes off Vogelmann and his crew, but is then ambushed by Henry, who recorded a video of Ridgeman killing the half naked hostage. After a brief physical altercation, the two call a truce, agreeing to clean up the crime scene together, bury their friends and split the gold. They cooperate, and the job is nearly done when Ridgeman pulls a gun on Henry, demanding he delete the video he recorded despite Henry's insistence that he doesn't intend to blackmail him. Panicked, Henry pulls his own gun and shoots Ridgeman. Henry asks a dying Ridgeman if the story about his daughter being assaulted and his wife being sick are true. He responds that it is and asks for them to receive his 40 percent as well as his partner to be buried so his name isn't sullied. Henry refuses the 40 percent, but promises to take care of them. \nEleven months later, Henry is shown living in a lavish mansion with his mother and brother. Ridgeman's wife and daughter receive a package in the mail they believe is from him (but sent by Henry), consisting of a cigar box containing gold bullion."}