{"_movieID": "23048", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:57:46", "summary": "Hot Tub Time Machine is a 2010 American science fiction comedy film directed by Steve Pink and starring John Cusack, Rob Corddry, Craig Robinson, Clark Duke, Crispin Glover, Lizzy Caplan and Chevy Chase. The film was released on March 26, 2010. A sequel, Hot Tub Time Machine 2, was released on February 20, 2015.", "plot": "Three estranged, depressed friends—Adam Yates, who was dumped by his girlfriend; henpecked husband Nick Webber-Agnew working a dead-end job; and Lou Dorchen, who is a party animal, reconnect when Lou is hospitalized for carbon monoxide poisoning. To cheer him up, Adam and Nick arrange for Lou to join them at Kodiak Valley Ski Resort, where the three enjoyed fun times in their youth; Adam's reclusive nephew Jacob tags along. During a night of heavy drinking in their hotel room's hot tub, the four douse the console with an illegal Russian energy drink called \"Chernobyl\".\nThe next day, the friends go skiing and, after many strange occurrences (1980s fashion, music videos on MTV and Michael Jackson still being black), they realize they have traveled back to 1986. Adam, Lou and Nick have also assumed their younger bodies: they appear normal to each other, but to others (and in their reflections) they look like their younger selves. Jacob's appearance has not changed since he wasn't born yet, though he occasionally flickers.\nA cryptic hot tub repairman appears and warns them not to change anything, as it might affect history. To minimize the butterfly effect, the guys plan to re-enact their experiences. Adam has to break up with his girlfriend Jenny and get stabbed in the eye with a fork; Lou must pick a fight with and get beaten up by Blaine, a ski patrol bully; Nick must have sex with a groupie and give a poor performance with his band at an open mic event. They discover Jacob's alcoholic mother Kelly, Adam's sister, is also at the resort.\nThe guys find their tasks difficult; Lou gets punched to the floor by Blaine and loses his backpack, but realizes he must face him again later at night, so he reluctantly challenges Blaine again. Adam finds his attraction to Jenny reignited, but is distracted when he meets laid-back music journalist April during the resort's Poison concert. Nick worries about cheating on his wife, even though the events occur before he even meets her. Later on, Lou tries to capitalize on his knowledge of football game outcomes; it works until he risks everything on a game-winning touchdown, only to have a squirrel from the resort (which he vomited on earlier) crash the field and ruin the play.\nJenny turns the tables on Adam when she initiates their breakup, but Adam still gets stabbed in the eye with a fork after insulting her. He soon re-encounters April; they break into a nearby home and become intimate. Nick changes his destiny by covering the more upbeat \"Jessie's Girl\", followed by a \"preview version\" of \"Let's Get It Started\". When the repairman informs Jacob that a chemical was the key to their time travel, Jacob realizes it was the Chernobly. The guys prevent Lou, once again beaten up without his friends, from falling off the rooftop. They go to Blaine's cabin to search for the drink, during which Lou finds and seduces Kelly. When Jacob suddenly vanishes, the guys realize that Lou is Jacob's father; after Lou and Kelly make love, Jacob reappears. Leaving Kelly, Lou finally assaults Blaine; the four friends retrieve the Chernobly and return to the hot tub where they create a vortex. Jacob and Nick enter the tub, but Lou decides to stay in 1986, admitting to Adam that his carbon monoxide poisoning was attempted suicide; knowing the future, he wants to make investments and be a good father to Jacob. Adam insists upon staying too, but Lou pushes him into the vortex at the last moment.\nBack at the present, Adam, Nick, and Jacob discover that Lou has changed history by founding the immensely successful Lougle, which affords him a luxurious lifestyle with Kelly. Adam discovers that he is happily married to April, while Nick is a successful music producer married to a happy and caring wife. The guys reunite at Lou's mansion with their families, satisfied with their new lives."}