{"_movieID": "21862", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:20", "summary": "Deep in the Valley  (also known as American Hot Babes in the UK) is a 2009 romantic comedy written and directed by Christian Forte, son of 1950s and 1960s teen icon Fabian.\n\n", "plot": "Lester Watts (Chris Pratt) works at a liquor store, happily selling alcohol to minors while spending his spare money on his porno collection.  His best friend since third grade, Carl (Brendan Hines) works a corporate job at his British fiancée's family's company.  He wants to leave the job and work somewhere else, but she angrily tells him he has no choice and that he must stay; it is clear that she is completely in control of the relationship.\nThat night, the two friends have a beer when a delivery comes in the form of a vintage porn viewer machine which plays the films of Diamond Jim (Christopher McDonald).  They step inside and it transports them to a land where everyone acts like they are in a pornographic film.  The police arrest them, led by Rod Cannon (Scott Caan) but they escape and are hidden from the police by Bambi Cummings (Rachel Specter) at her sorority house, Tri-Pi.\nThey elude the police while Bambi and Carl fall in love with each other.  Eventually, they go to Diamond Jim's pool party where Carl decides to get transported home and Lester decides to stay.  It is revealed that Lester is Diamond Jim's son.  Back home, Carl breaks up with his overbearing girlfriend and Bambi is transported to him, reuniting them. Meanwhile, Lester takes over his father's porno empire.  After the closing credits, it was revealed that Rod was transported to Lester's old job at the liquor store.", "cast": "Chris Pratt as Lester Watts\nBrendan Hines as Carl\nScott Caan as Rod Cannon\nRachel Specter  as Bambi Cummings\nKim Kardashian as Summa Eve\nDenise Richards as  Autumn Bliss\nChristopher McDonald as Diamond Jim\nBlanca Soto  as Suzi Diablo\nTracy Morgan as Busta Nut\nCharlotte Salt as  Tracy"}