{"_movieID": "12162", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:50:09", "summary": "The Hurt Locker is a 2008 American war drama film directed by Kathryn Bigelow and written by Mark Boal. It stars Jeremy Renner, Anthony Mackie, Brian Geraghty, Christian Camargo, Ralph Fiennes, David Morse, and Guy Pearce. The film follows an Iraq War Explosive Ordnance Disposal team who are targeted by insurgents, and shows their psychological reactions to the stress of combat, which is intolerable to some and addictive to others. Boal drew on his experience during embedded access to write the screenplay.\nThe Hurt Locker premiered at the 2008 Venice International Film Festival before it was released in the United States on June 26, 2009, by Summit Entertainment. The film earned near universal acclaim from critics, who praised Bigelow's directing, the cast, writing, and action sequences. The film was nominated for nine Academy Awards and won six, including Best Picture, Best Director and Best Original Screenplay, making it the first Best Picture winner by a female director. The film grossed $49.2 million worldwide.", "plot": "In 2004, Sergeant First Class William James arrives as the new team leader of a U.S. Army Explosive Ordnance Disposal (EOD) unit in the Iraq War. He replaces Staff Sergeant Matthew Thompson, who was killed by an improvised explosive device (IED) in Baghdad. His team includes Sergeant J. T. Sanborn and Specialist Owen Eldridge.\nJames is often approached by an Iraqi youth nicknamed \"Beckham\" attempting to sell DVDs. James challenges him to a game of soccer and takes a liking to him.\nSanborn and Eldridge consider James' maverick disposal methods and attitude reckless, raising tensions.  When they are assigned to destroy explosives, James returns to the detonation site to pick up his gloves. Sanborn openly contemplates killing him by \"accidentally\" triggering the explosives, making Eldridge uncomfortable.  Nothing is done and tensions continue to increase.\nReturning to Camp Victory in their Humvee, the team encounters five armed men in traditional Arab garb and casual attire standing near a Ford Excursion, which has a flat tire. James' team has a tense encounter with their leader, who reveals that they are private military contractors and British mercenaries. They have captured two prisoners featured on the most-wanted Iraqi playing cards. The group comes under fire; when the prisoners attempt to escape in the confusion, the leader of the mercenaries shoots them, as they are valuable dead or alive. Enemy snipers kill three of the mercenaries, including their leader. Sanborn and James borrow a gun to dispatch three attackers, while Eldridge kills a fourth.\nDuring a raid on a warehouse, James discovers a body he believes is Beckham, in which a bomb has been surgically implanted. During evacuation, Lieutenant Colonel John Cambridge, the camp's psychiatrist and a friend of Eldridge, is killed in an explosion; Eldridge blames himself for his death. James breaks into the house of an Iraqi professor, seeking revenge for Beckham, but his search reveals nothing.\nCalled to a petrol tanker detonation, James decides to hunt for the insurgents responsible, guessing they are still nearby. Sanborn protests, but when James begins a pursuit, he and Eldridge reluctantly follow. After they split up, insurgents capture Eldridge after shooting him in the leg. James and Sanborn rescue him. The following morning, James is approached by Beckham, who he believed was dead, and walks by silently. Before being airlifted for surgery, Eldridge angrily blames James for his injury.\nJames and Sanborn's unit is called to another mission in their last two days of their rotation. An innocent Iraqi civilian has had a bomb vest strapped to his chest. James tries to cut off the locks to remove the vest, but there are too many of them. He abandons the man, who is killed when the bomb explodes. Sanborn is distraught by the man's death. He confesses to James that he can no longer cope with the pressure, and wants to return home and have a son.\nAfter Bravo Company's rotation ends, James returns to his ex-wife Connie and their infant son, who still lives with him in his house. However, he is bored by routine civilian life. James confesses to his son that there is only one thing that he knows he loves. He starts another tour of duty, serving with Delta Company, a U.S. Army EOD unit on its 365-day rotation.", "cast": "Jeremy Renner as Sergeant First Class William James\nAnthony Mackie as Sergeant J. T. Sanborn\nBrian Geraghty as Specialist Owen Eldridge\nGuy Pearce as Staff Sergeant Matthew Thompson\nChristian Camargo as Lieutenant Colonel John Cambridge\nDavid Morse as Colonel Reed\nRalph Fiennes as the leader of a Private Military Company unit\nEvangeline Lilly as Connie James\nChristopher Sayegh as Beckham\nMalcolm Barrett as Sergeant Foster\nSam Spruell as Contractor Charlie"}