{"_movieID": "8355", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:40", "summary": "Ice Age: Dawn of the Dinosaurs is a 2009 American computer-animated comedy adventure film produced by Blue Sky Studios and distributed by 20th Century Fox. It is the third installment in the Ice Age series and the sequel to Ice Age: The Meltdown (2006). It was directed by Carlos Saldanha and co-directed by Mike Thurmeier. Ray Romano, John Leguizamo, Denis Leary  reprise their roles from the first two films and Queen Latifah, Seann William Scott, and Josh Peck reprise their roles from The Meltdown, with Simon Pegg joining them in the role of a weasel named Buck. The story has Sid the Sloth being taken by a female Tyrannosaurus after stealing her eggs, leading the rest of the herd to rescue him in a tropical lost world inhabited by dinosaurs beneath the ice.\nThe film was released on July 1, 2009, becoming the first Ice Age film and the first 20th Century Fox film to be released in 3D. Despite receiving mixed reviews from critics, it ranked at the time as the second-highest-grossing animated film of all time, and the highest-grossing Ice Age film, and for Blue Sky Studios overall, earning $886.7 million worldwide. A sequel, titled Ice Age: Continental Drift, was released in 2012 and another sequel, titled Ice Age: Collision Course, was released in 2016.", "plot": "Ellie and Manny, the two woolly mammoths, are expecting their first child, and Manny struggles to make life perfect and safe for the family. At the same time, Diego the saber-toothed cat finds himself unable to catch a cocky gazelle he has been stalking and decides to leave The Herd, believing that he is losing his predatory nature as a tiger. Sid the ground sloth begins to wish for a family of his own and takes three apparently abandoned eggs that he finds in an icy underground cavern and calls them Egbert, Shelly, and Yoko. Manny tells him to put them back, but Sid ignores Manny and looks after the eggs, which hatch into baby Tyrannosaurus rex the next morning.\nAlthough Sid tries his best to raise the three dinosaurs, their rambunctious behavior scares away all the younger animals and ruins a playground Manny built for his child. Not long after, a female Tyrannosaurus rex, whose eggs Sid stole, returns and carries both Sid and her young underground, with Diego in pursuit. Manny, Ellie, Crash and Eddie the opossums follow as well and discover that the icy cavern leads to a vast subterranean jungle populated by dinosaurs thought to be extinct. Here, an angry Ankylosaurus threatens The Herd despite Diego's efforts to fend it off; they are saved from a further crowd of angry reptiles by a deranged, quick witted, one-eyed weasel named Buck.\nBuck has been living in this jungle for quite some time and is fighting Rudy, a huge albino Baryonyx, intending to avenge the eye he lost to it when he was young with a knife he carved from one of Rudy's teeth. He agrees to lead The Herd through the jungle's perils to Lava Falls, where the dinosaur has taken Sid and her babies. In the meantime, Sid and the mother T. rex try to outdo each other in feeding the offspring; he loses this contest, but is welcomed into the family regardless. The next day, however, Sid is separated from the family and attacked by Rudy. Sid is knocked onto a loose rock slab that is floating on a river of lava and about to plummet over the falls.\nAs The Herd moves toward Lava Falls, Ellie goes into labor and a Guanlong pack strikes, causing a rock slide that separates her from Manny and Diego. Manny doubles back to protect her and Diego fends off further attacks, while Buck takes Crash and Eddie ahead to rescue Sid. Just as he goes over the falls, the trio swoops in on a commandeered Harpactognathus only to be chased by a flock of Pterodactylus on the way and saves his life. Manny reaches Ellie just in time to hear the cry of a newborn baby girl. Manny initially wants to name the baby “Ellie” after her mother but Ellie suggests the name Peaches after the fruit and the code name her and Manny agreed to use to signal when the baby is coming. Sid is saddened at the fact that he never had a chance to say goodbye to \"his\" children as he returns to The Herd and learns of Peaches' birth.\nBefore they can leave the jungle, they are ambushed by Rudy, who begins to attack them at full force; working together Manny, Sid, Diego, and Buck manage to trap Rudy by ensnaring him in vines. However, he quickly breaks free and resumes his onslaught. The Herd is saved by the timely arrival of the mother T. rex, who charges at Rudy and knocks him off a cliff. As she and her children wish Sid well, Buck, now without a purpose in life since Rudy is gone, decides to join The Herd and live on the surface. However, a distant roar tells him that Rudy is still alive; he changes his mind and sends The Herd home, blocking off the path to the underground jungle at the same time. Manny and Ellie welcome Peaches into their frozen world and admit that Sid did a good job looking after Momma's children. Diego decides to remain with The Herd, while Buck stays underground, happily battling it out with Rudy.", "cast": "Ray Romano as Manny, a woolly mammoth and the leader of The Herd. He is also Ellie’s husband and Peaches’s father.\nJohn Leguizamo as Sid, a giant ground sloth and the founder of The Herd. He is also the adoptive father of the three baby dinos.\nDenis Leary as Diego, a Smilodon and a member of The Herd.\nSeann William Scott as Crash, an opossum, Eddie's biological brother and Ellie's adoptive brother.\nJosh Peck as Eddie, an opossum, Crash's biological brother and Ellie's adoptive brother.\nQueen Latifah as Ellie, a female woolly mammoth, Manny's wife, Peaches’s mother and Crash and Eddie's adoptive sister.\nSimon Pegg as Buck, a one-eyed weasel and a dinosaur hunter who joins The Herd.\nChris Wedge as Scrat, a saber-toothed squirrel.\nKaren Disher as Scratte, a female saber-toothed squirrel and Scrat's love interest.\nBill Hader as Gazelle\nJoey King as Beaver Girl\nJane Lynch as Diatryma Mom\nKristen Wiig as Pudgy Beaver Mom\nCarlos Saldanha as Dinosaur Babies / Flightless Bird\nEunice Cho as Madison (Diatryma Girl)\nMaile Flanagan as Aardvark Mom\nClea Lewis as Start Mom\nDevika Parikh (additional voices)"}