{"_movieID": "57718", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:52:49", "summary": "Megamind: The Button of Doom is a 2011 computer animated short film released on DVD/Blu-ray with Megamind on February 25, 2011, starring Will Ferrell and David Cross.\n\n", "plot": "For their first day on the job as the new protectors of Metro City after the events of the first film, Megamind (Will Ferrell) and Minion (David Cross) are selling off their gadgets from their evil lair to the citizens for good purposes. All of their items get sold (except for the Death Ray which Megamind used to \"kill\" Metro Man in the original film). As for the De-Gun, Megamind's weapon of choice used for a number of different destructive functions, it gets sold to a boy named Damien, who accidentally uses it, in its dehydration mode, on his mother and turns her into a cube. After the auction is over, Megamind reveals a suit he created that copies all of Metro Man's powers, which he will wear to protect Metro City. \nMinion finds a seemingly harmless button that had also not been sold. Not knowing what the button does, Megamind pushes it, revealing an AI of his former evil personality that eventually transfers itself into a giant robot called the Mega-Megamind. The robot thinks that Megamind is Metro Man, and starts attacking him. Megamind fights Mega-Megamind with his new powers, but is defeated. He and Minion hide in the Invisible Car. Megamind decides that they should live in the car from then on, because he programmed Mega-Megamind to not stop until the hero (and his assistant) is destroyed. Minion reveals that he still kept the Spiderbot, a robot that Megamind wanted to throw away, suggesting that Megamind should try to be a hero his way rather than try to do the job the way Metro Man did it. Megamind plans to lure the Mega-Megamind to a spot where the Death Ray shoots: the abandoned observatory to which the real Metro Man was lured. However, Minion realizes that he cannot activate the Death Ray because the controls were smashed by Megamind's suit when he landed. He then tries to find the Death Ray remote control, but Megamind does not remember what the remote looks like, so Minion tries all the remotes. As the robot finds Megamind, Minion finally finds the correct remote and activates the Death Ray. Megamind and the Spiderbot get off Mega-Megamind, using the robot's wrist-mounted shooter just before it explodes. \nThe duo then recover their gadgets to use for good purposes, including the De-Gun from Damien, who not only has refused to re-hydrate his mother but also used it on the parents of several other children, who are all now having a party to celebrate no longer having to do as they are told. Megamind then starting with Damien's mother re-hydrates the parents with a glass of water to ensure that they will face punishment, much to the children's dismay. The short ends with Megamind and Minion seeing a signal in the sky (an obvious spoof of the Bat-Signal) and riding off in the Invisible Car as they are called to action.", "cast": "Will Ferrell - Megamind and Mega-Megamind\nDavid Cross - Minion, Megamind's assistant\nMichelle Belforte Hauser - Concerned Mother\nJordan Alexander Hauser - Damien\nKevin N. Bailey - Kevin\nDante James Hauser - Nigel\nDeclan James Swift - Peter\nFintan Thomas Swift - Barney"}