{"_movieID": "38055", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:58:43", "summary": "Megamind is a 2010 American computer-animated superhero comedy film  directed by Tom McGrath, produced by DreamWorks Animation, and distributed by Paramount Pictures. The film premiered on October 28, 2010, in Russia, while it was released in the United States in Digital 3D, IMAX 3D and 2D on November 5, 2010. It features the voices of Will Ferrell, Tina Fey, Jonah Hill, David Cross, and Brad Pitt.The film tells the story of a super-intelligent alien supervillain, Megamind, who after a long-lasting battle one day actually destroys his foe, the much-loved superhero Metro Man. Having Metro City for himself, Megamind finds out that his villainy has no purpose and thus creates a new superhero to serve as his nemesis. His plan backfires, as he ends up creating instead a new supervillain. With Metro City spiraling out of control, Megamind attempts to set things right and discovers his newfound purpose—as a superhero.\nMegamind received generally positive reviews from critics, praising its strong visuals and the cast's performances, but criticizing its unoriginality and humor. With a budget of $130 million, the film grossed over $321 million worldwide, becoming one of DreamWorks Animation's lowest-grossing CG animated films of the 2010s.A short film, titled Megamind: The Button of Doom, was released on February 25, 2011, on the Megamind DVD and Blu-ray.", "plot": "Ever since arriving on Earth as infants, supervillain Megamind has fought superhero Metro Man for dominance of Metro City. In his latest plan, Megamind and his sidekick Minion kidnap reporter Roxanne Ritchi and hold her hostage in a copper-lined observatory. When Metro Man arrives to save her, he finds the observatory empty and that Megamind lured him into a trap. Metro Man is revealed to be weak to copper and incinerated by Megamind's death ray. Megamind finally takes control of the city and enjoys his celebration with Minion. However, Megamind soon finds his life is meaningless without Metro Man.\nWhile wandering the recently opened Metro Man Museum, Megamind sees Roxanne nearby and uses his holographic disguise watch to take the form of Bernard, the museum's curator. He talks to Roxanne and becomes attracted to her, and is inspired by one of her statements to create a new superhero for him to fight. Megamind returns to his lair and creates a serum containing Metro Man's DNA, which he plans to inject into a proper candidate with his Defuser Gun. However, Roxanne's arrival at his lair with her dimwitted cameraman, Hal Stewart, causes Megamind to inadvertently inject the serum into Hal. Megamind disguises himself as Hal's \"Space Dad\" and convinces him to become the superhero \"Titan\". Hal spends several days training with Megamind before issuing a challenge to fight him.\nOn the day before the fight, Megamind and Minion are driven apart by Megamind's decision to give up villainy for Roxanne, while Hal gets spurned by Roxanne attempting to woo her. Megamind, disguised as Bernard, takes Roxanne on a dinner date. Shortly thereafter, Roxanne unwittingly unmasks Megamind's identity and storms off in denial. Upset, Megamind returns as villain.\nHal does not arrive at the scheduled fight, and Megamind discovers that he has used his abilities for criminal purposes. As \"Space Dad\" and \"Bernard\", Megamind successfully goads an enraged Hal into fighting him. Hal overpowers Megamind and his mech, but decides to kill him instead of arresting him. Megamind manages to escape from the battle and leaving Hal take over the city. Megamind seeks out Roxanne, who offers to take him to Metro Man's secret headquarters, where they are both surprised to find Metro Man alive. Metro Man reveals that he faked his own death and weakness to retire from being a superhero in favor of becoming a music star as \"Music Man\"; He declines to help, but tells Megamind that a hero will always rise up to challenge evil.\nRefusing to become the hero, Megamind allows himself to be imprisoned. Roxanne confronts Hal, who kidnaps her and demands Megamind show himself. Seeing her in danger, Megamind pleads with the prison warden and apologizes for his actions. The warden reveals himself to be Minion in disguise, accepting Megamind's apology and they reconcile.\nAs Hal is about to kill Roxanne, Megamind manages to save her, but gets injured by the broken tower. Metro Man suddenly arrives, having had a change of heart, and chases Hal away from the city. Roxanne discovers that Megamind is actually an injured Minion in disguise and Metro Man is Megamind. Hal returns after recognizing Megamind's distinctive mispronunciations and resumes to fight. Megamind manage to find his invisible car he misplaced in previous night, grabs the Defuser Gun and is able to extract the serum from Hal, restoring him to normal. Hal is arrested for his crimes. Now hailed as heroes, Megamind and Minion appear at the reopening of Metro Man's museum, now dedicated to Megamind instead, while Metro Man, in disguise within the crowd, silently congratulates his former rival.\nDuring the credits, Bernard is knocked out by Minion."}