{"_movieID": "335984", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:46", "summary": "Blade Runner 2049 is a 2017 American neo-noir science fiction film directed by Denis Villeneuve and written by Hampton Fancher and Michael Green. A sequel to the 1982 film Blade Runner, the film stars Ryan Gosling and Harrison Ford, with Ana de Armas, Sylvia Hoeks, Robin Wright, Mackenzie Davis, Carla Juri, Lennie James, Dave Bautista, and Jared Leto in supporting roles. Ford and Edward James Olmos reprise their roles from the original. Set thirty years after the first film, Gosling plays K, a Nexus-9 replicant \"blade runner\" who uncovers a secret that threatens to destabilize society and the course of civilization. Original director Ridley Scott served as an executive producer on the film.\nPrincipal photography took place between July and November 2016, mainly in Budapest, Hungary. Blade Runner 2049 premiered in Los Angeles on October 3, 2017, and was released in the United States in 2D, 3D, and IMAX on October 6, 2017. The film was praised by critics for its performances, direction, cinematography, musical score, production design, visual effects, and faithfulness to the original film, and was considered by many critics to be among the best films of 2017. Despite positive reviews, the film was a box office disappointment, grossing $259 million worldwide against a production budget between $150–185 million.Blade Runner 2049 received five nominations at the 90th Academy Awards, winning Best Cinematography and Best Visual Effects. It also received eight nominations at the 71st British Academy Film Awards, including Best Director, and won Best Cinematography and Best Special Visual Effects.", "plot": "In 2049, replicants (described as \"bioengineered humans\") are slaves. K, a replicant, works for the Los Angeles Police Department (LAPD) as a \"blade runner,\" an officer who hunts and \"retires\" (kills) rogue replicants. At a protein farm, he retires Sapper Morton and finds a box buried under a tree. The box contains the remains of a female replicant who died during a caesarean section, demonstrating that replicants can reproduce biologically, previously thought impossible. K's superior, Lt. Joshi, fears that this could lead to a war between humans and replicants. She orders K to find and retire the replicant child to hide the truth.\nK visits the headquarters of the Wallace Corporation, the successor-in-interest in the manufacturing of replicants to the defunct Tyrell Corporation. Wallace staff members identify the deceased female from DNA archives as Rachael, an experimental replicant designed by Dr. Eldon Tyrell. K learns of Rachael's romantic ties with former blade runner Rick Deckard. Wallace Corporation CEO Niander Wallace wants to discover the secret to replicant reproduction to expand interstellar colonization. He sends his replicant enforcer Luv to steal Rachael's remains from LAPD headquarters and follow K to Rachael's child.\nAt Morton's farm, K sees the date 6-10-21 carved into the tree trunk and recognizes it from a childhood memory of a wooden toy horse. Because replicants' memories are artificial, K's holographic AI girlfriend Joi believes this is evidence that K was born, not created. He searches LAPD records and discovers twins born on that date with identical DNA aside from the sex chromosome, but only the boy is listed as alive. K tracks the child to an orphanage in ruined San Diego but discovers the records from that year to be missing. K recognizes the orphanage from his memories and finds the toy horse where he remembers hiding it.\nDr. Ana Stelline, a designer of replicant memories, confirms that the memory of the orphanage is real, leading K to conclude that he is Rachael's son. At LAPD headquarters, K fails a post-traumatic baseline test, marking him as a rogue replicant; he lies to Joshi by implying he killed the replicant child. Joshi gives K 48 hours to disappear. At Joi's request, K reluctantly transfers her to a mobile emitter, an emanator, so he cannot be traced through her console memory-files. He has the toy horse analyzed, revealing traces of radiation that lead him to the ruins of Las Vegas. He finds Deckard, who reveals that he is the father of Rachael's child and that he scrambled the birth records to protect the child's identity; Deckard left the child in the custody of the replicant freedom movement.\nAfter killing Joshi, Luv tracks K's LAPD vehicle to Deckard's hiding place in Las Vegas. She kidnaps Deckard, destroys Joi, and leaves K to die. The replicant freedom movement rescues K. When their leader, Freysa, informs him that she helped deliver Rachael's daughter, K understands he is not Rachael's child and deduces Stelline is her daughter and that the memory of the toy horse is hers, which she implanted amongst those of other replicants whose memories she designed. To prevent Deckard from leading Wallace to Stelline or the freedom movement, Freysa asks K to kill Deckard for the greater good of all replicants.\nLuv takes Deckard to Wallace Co. headquarters to meet Niander Wallace. Wallace offers Deckard a clone of Rachael in exchange for revealing what he knows. Deckard refuses, and the clone is killed. As Luv is transporting Deckard to a ship to take him off-world to be interrogated, K intercepts and kills Luv but is mortally wounded in the fight. He stages Deckard's death to protect him from Wallace and the replicant freedom movement before taking Deckard to Stelline's office and handing him her toy horse. As K lies motionless on the steps, looking up at the snowing sky, Deckard enters the building and meets his daughter for the first time.", "cast": "Archival footage, audio and stills of Sean Young from the original film are used to represent both her original character of Rachael and a clone of the character created by Niander Wallace. Young's likeness was digitally superimposed onto Loren Peta, who was coached by Young on how to recreate her performance from the first film. The voice of the replicant was created with the use of a sound-alike actress to Young. Young was credited for her work."}