{"_movieID": "99861", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:10", "summary": "Avengers: Age of Ultron is a 2015 American superhero film based on the Marvel Comics superhero team the Avengers, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2012's The Avengers and the eleventh film in the Marvel Cinematic Universe (MCU). The film was written and directed by Joss Whedon and features an ensemble cast that includes Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Jeremy Renner, Don Cheadle, Aaron Taylor-Johnson, Elizabeth Olsen, Paul Bettany, Cobie Smulders, Anthony Mackie, Hayley Atwell, Idris Elba, Stellan Skarsgård, James Spader, and Samuel L. Jackson. In the film, the Avengers fight Ultron, an artificial intelligence obsessed with causing human extinction.\nThe sequel was announced in May 2012, after the successful release of The Avengers. Whedon, the director of the first film, was brought back on board in August and a release date was set. By April 2013, Whedon had completed a draft of the script, and casting began in June with the re-signing of Downey. Second unit filming began in February 2014 in South Africa with principal photography taking place between March and August 2014. The film was primarily shot at Shepperton Studios in Surrey, England, with additional footage filmed in Italy, South Korea, Bangladesh, New York City, and various locations around England. While in post-production, the film was converted to 3D and over 3,000 visual effects shots were added. With an estimated net production budget of $365 million, it is the second most expensive film ever made.\nAvengers: Age of Ultron premiered in Los Angeles on April 13, 2015, and was released in the United States on May 1, 2015, in 3D and IMAX 3D. The film received generally positive reviews from critics and grossed over $1.4 billion worldwide, becoming the fourth-highest-grossing film of 2015 as well as the fifth-highest-grossing film at the time. Two sequels, Avengers: Infinity War and Avengers: Endgame, were released in April 2018 and April 2019, respectively.", "plot": "In the Eastern European country of Sokovia, the Avengers—Tony Stark, Steve Rogers, Thor, Bruce Banner, Natasha Romanoff, and Clint Barton—raid a Hydra facility commanded by Baron Wolfgang von Strucker, who has been experimenting on humans using the scepter previously wielded by Loki. They encounter two of Strucker's test subjects—twins Pietro, who has superhuman speed, and Wanda Maximoff, who has telepathic and telekinetic abilities—and apprehend Strucker, while Stark retrieves Loki's scepter.\nStark and Banner discover an artificial intelligence within the scepter's gem, and secretly decide to use it to complete Stark's \"Ultron\" global defense program. The unexpectedly sentient Ultron, believing he must eradicate humanity to save Earth, eliminates Stark's A.I. J.A.R.V.I.S. and attacks the Avengers at their headquarters. Escaping with the scepter, Ultron uses the resources in Strucker's Sokovia base to upgrade his rudimentary body and build an army of robot drones. Having killed Strucker, he recruits the Maximoffs, who hold Stark responsible for their parents' deaths by his company's weapons, and goes to the base of arms dealer Ulysses Klaue in Johannesburg to obtain Wakandan vibranium. The Avengers attack Ultron and the Maximoffs, but Wanda subdues them with haunting visions, causing Banner to turn into the Hulk and rampage until Stark stops him with his anti-Hulk armor.A worldwide backlash over the resulting destruction, and the fears Wanda's hallucinations incited, send the team into hiding at a safe house. Thor departs to consult with Dr. Erik Selvig on the apocalyptic future he saw in his hallucination, while Nick Fury arrives and encourages the team to form a plan to stop Ultron. In Seoul, Ultron uses Loki's scepter to enslave the team's friend Dr. Helen Cho. They use her synthetic-tissue technology, vibranium, and the scepter's gem to craft a new body. As Ultron uploads himself into the body, Wanda is able to read his mind; discovering his plan for human extinction, the Maximoffs turn against Ultron. Rogers, Romanoff, and Barton find Ultron and retrieve the synthetic body, but Ultron captures Romanoff.\nThe Avengers fight amongst themselves when Stark and Banner secretly upload J.A.R.V.I.S.—who is still operational after hiding from Ultron inside the Internet—into the synthetic body. Thor returns to help activate the body, explaining based on his vision that the gem on its brow is the Mind Stone, one of the six Infinity Stones, the most powerful objects in existence. This \"Vision\" and the Maximoffs accompany the Avengers to Sokovia, where Ultron has used the remaining vibranium to build a machine to lift a large part of the capital city skyward, intending to crash it into the ground to cause global extinction. Banner rescues Romanoff, who awakens the Hulk for the battle. The Avengers fight Ultron's army while Fury arrives in a Helicarrier with Maria Hill, James Rhodes and S.H.I.E.L.D. agents to evacuate civilians. Pietro dies when he shields Barton from gunfire, and a vengeful Wanda abandons her post to destroy Ultron's primary body, which allows one of his drones to activate the machine. The city plummets, but Stark and Thor overload the machine and shatter the landmass. In the aftermath, the Hulk, unwilling to endanger Romanoff by being with her, departs in a Quinjet, while Vision confronts and seemingly destroys Ultron's last remaining body.\nLater, with the Avengers having established a new base run by Fury, Hill, Cho, and Selvig, Thor returns to Asgard to learn more about the forces he suspects have manipulated recent events. As Stark leaves and Barton retires, Rogers and Romanoff prepare to train new Avengers: Rhodes, Vision, Sam Wilson, and Wanda.\nIn a mid-credits scene, Thanos, dissatisfied by the failures of his pawns, dons a gauntlet and vows to retrieve the Infinity Stones himself.", "cast": "Robert Downey Jr. as Tony Stark / Iron Man: The benefactor of the Avengers who is a self-described genius, billionaire, playboy, and philanthropist with electromechanical suits of armor of his own invention. On how his character evolves after the events of Iron Man 3, Downey said, \"I think he realizes that tweaking and making all the suits in the world—which is what he has been doing—still didn't work for that thing of his tour of duty that left him a little PTSD. So his focus is more on how can we make it so that there's no problem to begin with. That, you know, there's a bouncer at our planet's rope. That's the big idea.\"\nChris Hemsworth as Thor: An Avenger and the crown prince of Asgard, based on the Norse mythological deity of the same name. Regarding Thor's place in the film, Hemsworth stated that as Thor has remained on Earth since Thor: The Dark World, and has begun to feel at home here, he considers Ultron's threat a personal attack. Hemsworth stated that he had to work harder to bring new elements to the character to avoid repeating himself saying, \"It gave us room to kind of make him a little more grounded and human and have him in some civilian clothes and mixing it up at a party.\" Hemsworth noted that Thor's motivations in this film were completely different, as it was the first MCU film where he did not play against Tom Hiddleston's character of Loki.\nMark Ruffalo as Bruce Banner / Hulk: An Avenger and genius scientist who, because of exposure to gamma radiation, transforms into a monster when enraged or agitated. To prepare for the role, Ruffalo worked with motion capture performer Andy Serkis' The Imaginarium. He stated that his character had grown since the previous film and was \"a bit more complex\". Ruffalo explained that a confrontation is brewing between Banner and the Hulk saying, \"There's a very cool thing happening: Hulk is as afraid of Banner as Banner is afraid of Hulk.. and they have got to come to peace somehow with each other.\" While filming in London, Ruffalo said that Whedon still had not given him any of the Hulk's lines. Whedon later explained that he writes the Hulk's dialogue spontaneously, saying, \"What makes the Hulk so hard to write is that you're pretending he's a werewolf when he's a superhero. You want it vice versa... So the question is, how has he progressed? How can we bring changes on what the Hulk does? And that's not just in the screenplay, that's moment to moment.\"\nChris Evans as Steve Rogers / Captain America: The leader of the Avengers and a World War II veteran who was enhanced to the peak of human physicality by an experimental serum and frozen in suspended animation before waking up in the modern world. Evans stated that since the fall of S.H.I.E.L.D. in Captain America: The Winter Soldier, Rogers has been left to depend on his Avenger teammates without the structure of military life and is now \"looking to understand where he belongs, not just as a soldier, as Captain America, but as Steve Rogers, as a person.\" Evans said that he was able to maintain the strength he built up for Captain America: The Winter Soldier by working out up to an hour a day. Regarding Captain America's fighting style, Evans felt he did not want to take a step back from the skills shown in The Winter Soldier, making sure Rogers' fight style advanced, showing \"a consistent display of strength\" and having Rogers utilizing his environment.\nScarlett Johansson as Natasha Romanoff / Black Widow: An Avenger who formerly worked for S.H.I.E.L.D. as a highly trained spy. Producer Kevin Feige stated that more of the character's backstory is explored in the film. Johansson elaborated, \"In Avengers 2 we go back... we definitely learn more about Widow's backstory, and we get to find out how she became the person you see. All of these characters have deep, dark pasts, and I think that the past catches up to some of us a little bit.\" Regarding where the film picks up Widow's story, Johansson felt it was a continuation of what was seen for her character in The Winter Soldier, with the fact that \"'[Widow] never made an active choice. [She's] a product of other people's imposition.' That's going to catch up with her. That's bound to have a huge effect. There's got to be a result of that realization... You'll see her actively making some choices in her life, for better or worse.\" A mixture of close-ups, concealing costumes, stunt doubles and visual effects were used to help hide Johansson's pregnancy during filming.\nJeremy Renner as Clint Barton / Hawkeye: An Avenger and master archer who previously worked as an agent for S.H.I.E.L.D. Whedon said that Hawkeye interacts more with the other characters in the film, as opposed to the first film where the character had been \"possessed pretty early by a bad guy and had to walk around all scowly.\" As the character did not appear in any other of Marvel's Phase Two films, Whedon stated Age of Ultron sheds light on to what the character was doing since the end of The Avengers. Renner described the character as \"kind of a loner\" and \"a team player only 'cause he sort of has to be. He's not really a company man. Captain America can be that guy. In [Age of Ultron] you'll understand why [Hawkeye] thinks the way he thinks.\"\nDon Cheadle as James \"Rhodey\" Rhodes / War Machine: An officer in the U.S. Air Force and Tony Stark's close personal friend who operates the War Machine armor.\nAaron Taylor-Johnson as Pietro Maximoff / Quicksilver: The twin brother of Scarlet Witch who can move at superhuman speed. Taylor-Johnson felt Pietro was defined by the fact that he and his sister were abandoned by their family, and they both had to grow up \"in Eastern Europe defending and looking out for themselves and each other,\" that they both look to the other for guidance. Taylor-Johnson also said that Quicksilver was \"very overprotective\" of Scarlet Witch and has \"real anger frustration\", which results in him being easily bored because of a short attention span. Feige stated exploring Quicksilver's relationship with his sister and his backstory growing up in Eastern Europe would help differentiate the character from Evan Peters' version in X-Men: Days of Future Past (2014). Taylor-Johnson stated that the running style for Quicksilver went through multiple iterations, saying, \"The running style we tested early on was just very one-dimensional and boring to look at, but if you try to do free running, like parkour, then that's very much Captain America's style... You have to find your own place in the stunt world.\" Much of Taylor-Johnson's scenes were filmed outdoors to give \"life\" to his running, as opposed to running indoors in front of a green screen.\nElizabeth Olsen as Wanda Maximoff / Scarlet Witch: The twin sister of Quicksilver who can engage in hypnosis and telekinesis. Olsen felt Wanda was \"overly stimulated\" rather than \"mentally insane\" because \"she has such a vast amount of knowledge that she's unable to learn how to control it. No one taught her how to control it properly... she can connect to this world and parallel worlds at the same time, and parallel times.\" Describing her character's mind control powers, Olsen said that the character is able to do more than manipulating someone's mind, with Scarlet Witch able to \"feel and see what they feel and see\" by projecting visions that they have never seen. Olsen expanded saying, \"What I love about her is that, in so many superhero films, emotions are kind of negated a bit, but for her everything that someone else could feel—like their weakest moments—she physically goes through that same experience with them, which is pretty cool.\" Olsen drew on her relationship with her older brother and her sisters to prepare for the role, as well as looking to the comics for inspiration. Olsen revealed that Whedon was inspired by dancers as a way to visually represent how the character moves. As such, Olsen mostly trained with a dancer in lieu of traditional stunt training. Olsen is signed for this film and another.\nPaul Bettany as J.A.R.V.I.S. and Vision: Bettany, who voiced J.A.R.V.I.S., Stark's A.I. companion in previous films, was cast again as the Vision, an android created by Ultron. Bettany stated that he was surprised when Whedon asked him if he wanted to be the Vision because once an actor has been cast as a particular character in the MCU, they usually are not cast as another. On what intrigued him about the Vision, Bettany said, \"The thing that appealed to me is that this sort of nascent creature being born, being both omnipotent and totally naive, the sort of danger of that and complex nature of a thing being born that is that powerful and that created in a second and the choices he makes morally are really complex and interesting. They've really managed to maintain all of that\". Bettany also stated that the Vision feels paternal and protective to a number of people in the film, particularly Scarlet Witch, and has the ability to change his density. Bettany did wire work for the part. Whedon stated he wanted to include the Vision in a second Avengers film before he signed onto the first film. Bettany's make-up, which consisted of a mix of face paint and prosthetics, took two hours to apply with make-up artists Jeremy Woodhead and Nik Williams citing the correct hue of the Vision's skin as the hardest thing to figure out.\nCobie Smulders as Maria Hill: A former high-ranking S.H.I.E.L.D. agent who now works for Stark. Describing Hill's situation in the film, Smulders said that after The Winter Soldier, Hill does not \"really know who's a good guy and who's a bad guy and she's trying to figure out that throughout this film.\" She added, \"She's not getting any sleep. She's doing all the work. She doesn't have the kind of manpower that she had in S.H.I.E.L.D.,\" instead working for Tony Stark at the Avenger's headquarters \"trying to keep everything running as smoothly as possible... it's an entirely different vibe for her.\"\nAnthony Mackie as Sam Wilson / Falcon: A former pararescueman trained by the military in aerial combat using a specially designed wing pack and a friend of Steve Rogers. Discussing the relationship between Wilson and Rogers, Mackie said that the two characters have a mutual \"soldier respect\", which is explored in the film and in Captain America: Civil War. Feige said that it was decided to reshoot the final scene of the film to incorporate the new Falcon suit designed for Ant-Man, which was released after Age of Ultron, as Falcon was originally shot in his original suit from The Winter Soldier. Mackie stated he did not realize Wilson had become an Avenger until he watched the film at the premiere, as he was only given the script for the scenes he worked on.\nHayley Atwell as Peggy Carter: A retired officer with the Strategic Scientific Reserve and co-founder of S.H.I.E.L.D. who is a former love interest of Steve Rogers.\nIdris Elba as Heimdall: The all-seeing, all-hearing Asgardian sentry of the Bifröst Bridge, based on the mythological deity of the same name.\nStellan Skarsgård as Erik Selvig: An astrophysicist and friend of Thor. Skarsgård said he was originally not supposed to appear in the film, but received a call because \"they'd written a couple of scenes, and I went and did them,\" not knowing if the scenes would appear in the final cut of the film.\nJames Spader as Ultron: An artificial intelligence repurposed by Tony Stark and Bruce Banner for a pilot peace program that is overwhelmed with a god complex and now desires to pacify the Earth by eradicating humanity. Director Joss Whedon stated that Spader was his \"first and only choice\" for the role, because of his \"hypnotic voice that can be eerily calm and compelling\" while also being very human and humorous. Feige clarified that Spader's face and body were motion captured \"to create a whole performance... We did not hire James Spader to do a robot voice.\" Extensive scans were taken of Spader's head and body in preparation for the role. About the character Whedon said, \"He's always trying to destroy the Avengers, goddamn it, he's got a bee in his bonnet. He's not a happy guy, which means he's an interesting guy. He's got pain. And the way that manifests is not going to be standard robot stuff.\" Whedon added that Ultron is \"not a creature of logic—he's a robot who's genuinely disturbed. We're finding out what makes him menacing and at the same time endearing and funny and strange and unexpected, and everything a robot never is.\" Whedon compared Ultron to Frankenstein's monster, saying, \"It's our new Frankenstein myth [...] We create something in our own image and the thing turns on us. It has that pain of 'Well, why was I made? I want to kill Daddy.'\" Spader called the character \"self-absorbed\" and added, \"I think he sees the Avengers as being part of a problem, a more comprehensive problem in the world. He sees the world from a very strange, [biblical] point of view because he's brand new, he's very young... He's immature, and yet has knowledge of comprehensive, broad history and precedent, and he has created in a very short period of time a rather skewed worldview.\" Spader elaborates, \"He truly is an artificial intelligence with absolutely no censorship at all, no parameters really … he's got too much power, too much strength and speed and size, so he's a very dangerous child.\"\nSamuel L. Jackson as Nick Fury: The former director of S.H.I.E.L.D. who originally recruited the Avengers and continues to be a mentor and leader for the team. Jackson described the role as a cameo, saying, \"I'm just kind of passing by there ... Because, it's another one of those 'people who have powers fighting people who have powers'. That's why I didn't get to New York in The Avengers. There's not a lot I could do except shoot a gun.\"Thomas Kretschmann and Henry Goodman reprise their roles as Baron Wolfgang von Strucker and Dr. List, Hydra leaders who specialize in human experimentation, advanced robotics, and artificial intelligence from Captain America: The Winter Soldier. Linda Cardellini portrays Laura Barton, Hawkeye's wife; Claudia Kim portrays Helen Cho, a world-renowned geneticist who helps the Avengers from her office in Seoul; Andy Serkis portrays Ulysses Klaue, a South-African black-market arms dealer, smuggler and gangster who is a former acquaintance from Stark's weapons-dealing days; and Julie Delpy appears as Madame B., who mentored Black Widow into becoming an assassin. Kerry Condon voices the artificial intelligence F.R.I.D.A.Y., a replacement for J.A.R.V.I.S., while Spader also voices Stark's Iron Legion droids. Josh Brolin makes an uncredited appearance during the mid-credits scene as Thanos, reprising his role from Guardians of the Galaxy. Avengers co-creator Stan Lee makes a cameo appearance in the film as a military veteran who attends the Avengers' victory party. Tom Hiddleston was to reprise his role of Loki, but his scenes did not make the theatrical cut of the film."}