{"_movieID": "157851", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:48:33", "summary": "Maps to the Stars is a 2014 internationally co-produced satirical drama film directed by David Cronenberg, and starring Julianne Moore, Mia Wasikowska, John Cusack, Robert Pattinson, Olivia Williams, Sarah Gadon, and Evan Bird. The screenplay was written by Bruce Wagner, who had written a novel entitled Dead Stars based on the Maps to the Stars script, after initial plans for making the film with Cronenberg fell through.This is the second consecutive collaboration between Cronenberg and Pattinson (after Cosmopolis) and marks the third collaboration between Cronenberg and Prospero Pictures, who previously collaborated on A Dangerous Method and Cosmopolis. This is also the third Cronenberg film made with Canadian actress Sarah Gadon. It is the first Cronenberg film shot partially in the United States, although most of it was shot, like his other films, in his native city of Toronto, Ontario, Canada.The film concerns the plight of a child star and a washed up actress while commenting on the entertainment industry's relationship with Western civilization as a whole. The film premiered in competition for the Palme d'Or at the 2014 Cannes Film Festival on May 19, 2014. Moore won the festival's Best Actress Award. Following its premiere at Cannes, the film had a theatrical release in France on May 21, 2014.", "plot": "Agatha Weiss arrives in Los Angeles and employs limousine driver Jerome to take her to the site of the former house of child star Benjie Weiss. Agatha has severe burns to her face and body, and takes a copious amount of medication. Benjie visits a child suffering from non-Hodgkin lymphoma in the hospital; however, the girl later dies. Benjie's father, Dr. Stafford Weiss, is a TV psychologist who is treating aging actress Havana Segrand for abuse she suffered at the hands of her deceased mother, also an actress. Havana's agent struggles to get Havana a role in a remake of her mother's film Stolen Waters. Havana routinely hallucinates about the deceased younger version of her mother.\nBenjie and his mother, Cristina, negotiate a role for Benjie in a film as his comeback after drug rehabilitation. At the suggestion of Carrie Fisher, Havana hires Agatha, whom Carrie had met on Twitter, as a personal assistant. Agatha continues to see Jerome, and a romance forms, though Jerome appears resistant at first. Stafford learns through Havana that Agatha has returned to L.A. Agatha is Stafford and Cristina's daughter – however, they shun her completely, with Cristina breaking down at the thought of Agatha contacting Benjie.\nUsing Havana's role in Stolen Waters to gain access to the production lot, Agatha visits Benjie on set. A schizophrenic, Agatha tells him that she has returned from a sanatorium to make amends for setting the fire that burned her and nearly killed him when he was seven. When Stafford learns Agatha visited Benjie, he visits her in a rage and warns her to leave L.A.\nBenjie breaks his sobriety, getting high on GHB, and carelessly shoots the dog of his only friend. Agatha visits her mother, Cristina, to make amends. Cristina reveals that she and Stafford are brother and sister, making Agatha and Benjie children of incest – though Cristina insists it was unbeknownst to them at the time.  Stafford comes home, and when Agatha tells him she knows about their familial relations, Stafford violently beats her, until Cristina intervenes. During the altercation, Agatha steals Cristina's wedding ring. On set, Benjie is haunted by the girl from the hospital, and, during an hallucination, he strangles his young co-star. The child survives, though Benjie is now to be replaced in the film.\nHavana requests Jerome as a driver and seduces him in the backseat of his parked limo in the driveway of her home, as Agatha watches from the window. Havana enters the house and berates Agatha for her poor performance at work and then verbally humiliates her when she finds that the girl has stained her expensive couch with menstrual blood. Agatha beats Havana to death with one of her awards.\nStafford returns home to see Cristina on fire outside near the pool. Benjie goes home, finds his father in a catatonic state and steals his ring. He then reunites with Agatha at the ruins of their old home that Agatha had burned down, and, on the fireplace hearth, the siblings/cousins perform an impromptu wedding ceremony with their parents' wedding rings. In order to commit suicide, they take an extreme amount of Agatha's pills together, before lying down to watch the stars.", "cast": "Main castJulianne Moore as Havana SegrandA famous but aging and fading actress, living in the shadow of her legendary movie-star mother and feeling abused by her. Moore based the character on \"an amalgam of people I've known and observed. She is someone who lives completely isolated in this make-believe world. She doesn't really have a family and she's still very angry with her mother because she feels she was abused. She's always lived in her mother's shadow, and in her mind, it's all a kind of mixed-up, Freudian mess.\"Mia Wasikowska as Agatha WeissThe scarred and estranged pyromaniac daughter of the Weiss family who takes a job as Havana's personal assistant, while waiting for the opportunity to make amends with her family. Wasikowska said, \"I love Agatha because she's dark inside but at the same time in a lot of ways she has this very positive outlook. There's something very sweet and sad about this girl who, in the midst of these celebrity-obsessed parents, and this troubled past, really just wants to connect with them. They've totally rejected her, but in a way, she's desperately trying to mimic their lives. She's desperately trying to find her identity.\" She further added, \"She has the gloves she wears over her burns, the facial scar, and all these rituals with the poem and the pills she takes, it's all very distinct to who she is.\"John Cusack as Dr. Stafford WeissThe head of the Weiss family, a TV psychologist with a number of high-profile celebrity clients, and immensely egoistic about the success of his son Benjie. Stafford exploits people's emotions and takes advantage of them. Stafford Weiss and his wife Cristina are brother and sister; they were separated at birth and discovered their relation after meeting in college and becoming a couple. According to Cusack, \"He sees himself as a healer. He's part Tony Robbins, part Reiki Master, part shrink. But his son is the real star—he's a massive teen star of Bieberesque proportions.\" Describing the script he said, \"It was the most savage destruction of Hollywood fame and secrets and that whole toxic brew that I'd ever seen.\"Evan Bird as Benjie WeissA 13 year old sensation and controversial star, who is trying to get his career on track after his stint at rehab while simultaneously battling demons from his past. Cronenberg was not sure that any child actor could play Benjie's character successfully until he saw Bird in the TV series The Killing. Bird said about his character, \"[H]e doesn't really have love and yet he doesn't really have limitations, either. So he's searching for both of those things. He's making way too much money, he's being taken advantage of by his parents, and he's really screwed up.\"Olivia Williams as Cristina WeissAmbitious and controlling, she manages the career of her son. Cristina Weiss and her husband Stafford are sister and brother; they were separated at birth and discovered their relation after meeting in college and becoming a couple. According to Williams, \"She is a very ambitious woman and we get to see her downfall from the very heights of her power. She operates in a world where someone could be the nastiest person on earth and make your life hell, but you might still want them in your movie because they'll make you money.\"Robert Pattinson as Jerome FontanaA limousine driver and struggling actor who wants to be a successful screenwriter. Jerome is inspired by Bruce Wagner, who, at the time when he conceived the idea for this story, was himself a struggling actor and writer working as a limo driver. Pattinson described the character as most sane and ordinary but like every LA dreamer in the story and said, \"Jerome would never accept that he is just a limo driver. I think he feels he's just waiting for his break. And yet, he's seemingly the only one in this story who's not going insane—or who isn't a ghost.\" And about the script he added that \"It's really about people who lie to themselves - right up until the end.\"Sarah Gadon as Clarice TaggartAn iconic Hollywood movie star who died in a fire and appears as a twenty-something-year-old ghost to her daughter Havana. Cronenberg said that \"it's such a lovely, unusual role, because she's simply this ghostly memory.\" Gadon said, \"I really want to do the film because I thought it was a critique about contemporary Hollywood. And, specifically, of a woman's place in Hollywood.\""}