{"_movieID": "22538", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:47:25", "summary": "Scott Pilgrim vs. the World is a 2010 action comedy film co-written, produced and directed by Edgar Wright, based on the graphic novel series Scott Pilgrim by Bryan Lee O'Malley. It stars Michael Cera as Scott Pilgrim, a slacker musician who must battle the seven evil exes of his newest girlfriend Ramona Flowers, played by Mary Elizabeth Winstead.\nA film adaptation of the comics was proposed following the release of the first volume. Wright became attached to the project, and filming began in March 2009 in Toronto. The film premiered after a panel discussion at the San Diego Comic-Con International on July 22, 2010, and received a wide release in North America on August 13, 2010.\nDespite being a box office bomb, grossing $47.7 million against its production budget of $85–90 million, Scott Pilgrim vs. the World received positive reviews from critics, who particularly noted the film's visual style and humour, and eventually garnered a cult following.", "plot": "In Toronto, 22-year-old Scott Pilgrim is a bassist in Sex Bob-Omb, a floundering garage band. To the disapproval of his friends, roommate Wallace Wells, and younger sister Stacey Pilgrim, he is dating Knives Chau, a 17-year-old high-school student. Scott meets an American Amazon delivery girl, Ramona Flowers, having first seen her in a dream, and loses interest in Knives, but doesn't break up with her before pursuing Ramona. When Sex Bob-Omb plays in a battle of the bands sponsored by record executive Gideon Graves, Scott is attacked by Ramona's ex-boyfriend Matthew Patel. Scott defeats Patel and learns that, in order to date Ramona, he must defeat the remaining six evil exes.\nScott breaks up with Knives, who blames Ramona and swears to win him back. Scott defeats Ramona's second evil ex, Hollywood actor and skateboarder Lucas Lee, by tricking him into performing a dangerous stunt. He defeats her third ex, superpowered vegan Todd Ingram, who is dating Scott's ex-girlfriend, Envy Adams, by tricking him into drinking half n half. Todd is arrested by the Vegan Police and de-veganized. He defeats her fourth ex, Roxy Richter (with Ramona's help, as he refuses to hit a girl), by touching the spot behind her knee (Ramona tells him this is Roxy's weak point).\nScott becomes upset with Ramona's dating history, and Ramona breaks up with him. At the next battle of the bands, Sex Bob-Omb defeats Ramona's fifth and sixth evil exes, twins Kyle and Ken Katayanagi, earning Scott an extra life. Ramona gets back with her seventh evil ex, Gideon. Sex Bob-Omb accepts Gideon's record deal, except for Scott, who quits the band in protest.\nGideon invites Scott to his venue, the Chaos Theater, where Sex Bob-Omb is playing. Resolving to win Ramona back, Scott challenges Gideon to a fight for her affections, earning the \"Power of Love\" sword. Knives interrupts the battle, attacking Ramona, and Scott is forced to reveal that he cheated on both of them. Gideon kills Scott and Ramona visits him in limbo to reveal that Gideon has implanted her with a mind control device.\nScott uses his 1-up and re-enters the Chaos Theater. He makes peace with his friends and challenges Gideon again, this time for himself. He gains the \"Power of Self-Respect\" sword and disarms Gideon. He apologizes to Ramona and Knives for cheating on them, and Scott and Knives join forces to defeat Gideon.\nFree from Gideon's control, Ramona prepares to leave. Knives accepts that her relationship with Scott is over and, at her encouragement, he leaves with Ramona."}