{"_movieID": "109414", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:14", "summary": "This Is the End is a 2013 American disaster comedy horror film written, directed and co-produced by Seth Rogen and Evan Goldberg in their directorial debuts. Starring Seth Rogen, Jay Baruchel, James Franco, Jonah Hill, Danny McBride and Craig Robinson, the film centers on fictionalized versions of themselves in the wake of a global biblical apocalypse. \nProduced by Mandate Pictures and Rogen and Goldberg's Point Grey Pictures, This Is the End premiered at the Fox Village Theater on June 3, 2013 and was released theatrically in the United States on June 14, 2013 by Columbia Pictures. The film was a critical and commercial success, grossing $126 million against a $32 million budget.", "plot": "Jay Baruchel arrives in Los Angeles to visit old friend and fellow Canadian actor Seth Rogen, who invites him to a housewarming party hosted by James Franco. There, Jay is uncomfortable at the crowded party, so Seth accompanies him to a convenience store for cigarettes. When beams of blue light come down and suck numerous people into the sky, Seth and Jay flee back to James' house and find the party unharmed. An earthquake strikes and the crowd rushes outside, witnessing a sinkhole opening in James' yard. Several celebrities and party guests are killed as Seth, Jay, James, Jonah Hill and Craig Robinson run back inside the house. Jay tells the remaining partygoers that the earthquake has destroyed most of Los Angeles. They then take inventory of their supplies, set up a ration system, board up the house and await help.\nThe next morning, Danny McBride, unaware of the crisis, wastes much of their food and water. He disbelieves what the others tell him of the previous night's events until a man outside is decapitated by an unseen creature. Tensions rise due to various conflicts, including Jay and Seth's growing estrangement and the others' skepticism of Jay's belief that the disaster might be the Apocalypse predicted in the Book of Revelation. Emma Watson makes her way back to James' house, but due to a misunderstanding, she believes the group is planning to rape her and leaves with the group's remaining drinks. \nCraig goes for water, but he encounters an unknown being causing him to believe Jay's theory. Jay and Seth dig through the floor and find water, but Danny wastes most of it out of spite and the others kick him out of the house. Before leaving, Danny reveals that Jay was in town two months prior, but stayed at a hotel instead of with Seth because of their strained friendship. Jonah annoys Jay, who then punches him in the face. That night, Jonah prays for Jay to die and is possessed by a demon. Seth and James are attacked by the possessed Jonah, but Jay and Craig subdue Jonah and tie him up. During an exorcism attempt, Jay and Seth fight and knock over a candle, starting a fire that engulfs Jonah and the house and forces the others outside.\nJames suggests driving to his home in Malibu, but finds his car guarded by a demon. Craig volunteers to sacrifice himself and is raptured into Heaven when the plan succeeds. The others realize they can save themselves by performing a selfless act. On the way to Malibu, the three encounter cannibals led by Danny and his gimp, Channing Tatum. When James volunteers to sacrifice himself, a blue beam begins to pull him to Heaven, but when he taunts and insults Danny, the beam vanishes to which Danny and the other cannibals eat James alive while Seth and Jay escape and encounter Satan. Jay apologizes to Seth for his wrongdoings while Satan attempts to eat them. A beam strikes Jay and he begins to ascend while Seth does not. Jay grabs Seth's hand, but his presence prevents them from ascending into Heaven. Seth forces Jay to leave him behind whereupon another beam appears around Seth. The pair arrive in Heaven where they are reunited with Craig, who tells them that any wish comes true there. Jay wishes for the Backstreet Boys and the band performs \"Everybody (Backstreet's Back)\" as everyone dances.", "cast": "Most of the film's cast portray fictional and exaggerated versions of themselves:"}