{"_movieID": "72190", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:58:44", "summary": "World War Z: An Oral History of the Zombie War is a 2006 zombie apocalyptic horror novel written by American author Max Brooks. The novel is a collection of individual accounts narrated by an agent of the United Nations Postwar Commission, following the devastating global conflict against the zombie plague. Other passages record a decade-long desperate struggle, as experienced by people of various nationalities. The personal accounts also describe the resulting social, political, religious, and environmental changes.\nWorld War Z is a follow-up to Brooks' fictitious survival manual The Zombie Survival Guide (2003), but its tone is much more serious. It was inspired by The Good War: An Oral History of World War Two (1984) by Studs Terkel, and by the zombie films of George A. Romero (1968–2009). Brooks used World War Z to comment on government ineptitude and US isolationism, while also examining survivalism and uncertainty. The novel was a commercial hit and was praised by most critics.\nIts 2007 audiobook version, performed by a full cast including Alan Alda, Mark Hamill, and John Turturro, won an Audie Award. A film with the same name as the novel, directed by Marc Forster and starring Brad Pitt, was released in 2013, and a video game of the same name, based on the 2013 film, was released in 2019 by Saber Interactive.", "plot": "At the start of the novel, it has been nearly twenty years since the start of the apocalyptic worldwide pandemic known as the Zombie War, and about ten years since the war has ended in humanity's victory. The framing device for the novel follows Max Brooks, author of the Zombie Survival Guide (referred to simply as \"the civilian survival guide\" in this book) and agent of the United Nations Postwar Commission, as he travels the world interviewing survivors of this zombie plague. \nThe interviews are categorized within eight different main topics: Warnings, Blame, The Great Panic, Turning The Tide, Home Front USA, Around The World And Above, Total War, and Good-Byes. \nAlthough the exact origin and cause of the plague is unknown, a young boy from a village in Chongqing, China is identified as the outbreak's official patient zero. The zombies of this setting are slow-moving, with no intelligence or senses, but with a grip as strong as steel and a primal drive to consume living flesh (for reasons unknown, they possess the ability to tell the difference between the living and the dead). They are incapable of fully decomposing, are immune to damage by most chemical means such as from freezing or sea water, and can only be killed permanently by destroying the brain. \nChina initiates a military crisis with Taiwan to distract from their attempts to contain the initial outbreaks. The plague spreads to various nations by human trafficking, refugees and the black market organ trade. Initially these nations are able to cover up their smaller outbreaks, until a much larger outbreak in South Africa brings the plague to public attention. At this point, the public and governments around the world begin to refer to the plague as \"African Rabies\", as most believe the zombies to merely be humans infected with a new strain of rabies rather than the living dead. \nAs the infection spreads, Israel abandons the Palestinian territories and initiates a nationwide reverse cordon sanitaire, closing its borders to everyone except uninfected Jews and Palestinians, leading to a civil war. The United States does little to prepare because of its overconfidence in its ability to suppress any threat, and the desire to not cause a panic during an election year. Although special forces teams contain initial outbreaks, a widespread effort never starts: the US is deprived of political will by \"brushfire wars\", and a widely distributed and marketed placebo vaccine, Phalanx, creates a false sense of security.\nAfter a journalist reveals that Phalanx does nothing to prevent zombification, and moreover that the infected are not victims of rabies but rather walking corpses, a period known as the \"Great Panic\" begins. It is speculated that more deaths are caused by this disaster than the zombie plague itself, as the world begins to destabilize and order breaks down. Panicked refugees by the millions move aimlessly all over the world searching for safety, and some begin taking matters into their own hands to fight the undead, instead causing the deaths of many uninfected. Pakistan and Iran destroy each other in a nuclear war over Pakistani refugees entering Iran. Russia forces a decimation of the military to prevent mutinies. Ukraine gases large numbers of refugees and soldiers alike to weed out the infected. \nAfter zombies overrun New York City, the US military sets up a high-profile defense in the nearby city of Yonkers with the hope that a great display of military power may help restore public order. The \"Battle of Yonkers\" is a disaster; modern weapons and tactics prove ineffective against zombies, which have no self-preservation instincts, feel no pain, and can only be stopped if shot through the head. The unprepared and demoralized soldiers are routed on live television. Other countries suffer similarly disastrous defeats, and human civilization teeters on the brink of collapse.\nIn South Africa, the government adopts a contingency plan drafted by apartheid-era intelligence consultant Paul Redeker, known as the Redeker Plan. It calls for the establishment of small Safe Zones, leaving large groups of survivors abandoned in special zones as human bait, serving as a distraction to the undead and allowing those within the main safe zones time to regroup and recuperate. Governments worldwide assume similar plans. The United States establishes its Safe Zone west of the Rocky Mountains and directs those left behind to evacuate north, giving no other direction or instruction. As zombies freeze solid in extreme cold, many civilians in North America flee to the wildernesses of northern Canada and the Arctic, where eleven million people die of starvation and hypothermia. Meanwhile, several astronauts stranded aboard the ISS witness the profound environmental impact as most of humanity resorts to burning wood and trash for warmth.\nAfter the US government relocates to Hawaii and its Safe Zones are well established, all aspects of civilian life are devoted to supporting the war effort; people with skills such as carpentry and construction find themselves more valuable than people with managerial skills. General morale begins to increase for the first time since before the Great Panic, as the military evolves to better combat zombies, and civilians (at least those within the Safe Zones) begin to find purpose in their lives again. \nSeven years after the outbreak began, a conference is held off the coast of Honolulu, aboard the fifty-year-old USS Saratoga, where the new United Nations headquarters are located. Most of the world's leaders argue that they can outlast the zombie plague if they stay in their safe zones while the zombies  rot away. However, the US president argues for going on the offensive, and a general vote results in most countries either voting \"no\" or \"abstain\" while the remainder decide to attack.\nDetermined to lead by example, the US military reinvents itself to meet the specific strategic requirements of fighting the undead. Backed by a resurgent US wartime economy, the military begins the three-year-long process of retaking the contiguous United States from both the undead swarms and groups of hostile human survivors. Other nations that voted to attack go about their own offensives: Russia, its armories badly-depleted, resorts to using large stores of World War II-era tanks, firearms, flamethrowers and ammunition, waging a costly offensive against the undead by brute force. The United Kingdom takes a slow-but-steady approach, taking until five years after the official end of the war to finish clearing London. France, set on restoring its pride and reputation after embarrassments and defeats going back to World War II, charges headlong against the undead, its armed forces displaying extreme valor at an extraordinarily high cost. An unnamed British Army general comments as the war ends that there are \"enough dead heroes for the end of time.\"\nTen years after the official end of the Zombie War, millions of zombies are still active, mainly on the ocean floor or on snow line islands. The United Nations fields a large military force to eliminate them. Cuba has become a democracy and hosts the world's most thriving economy. Tibet is freed from Chinese rule, which in turn becomes a democracy as well, and hosts Lhasa as the world's most populated city. Following a religious revolution, Russia is now an expansionist theocracy and adopts a repopulation programme, keeping the nation's few remaining fertile women as state broodmares. North Korea is completely empty, with the entire population presumed to have disappeared into underground bunkers or been wiped out in the outbreak. Iceland has been depopulated and remains the world's most heavily infested country. \nThe situation in the British Isles is not entirely clear in the novel. The Pope and members of the British Royal Family had fled to Ireland (specifically Armagh) and the Isle of Man, following the military retreat to the Antonine Wall, and now exports oil from a reserve under Windsor Castle where the Queen held out for the war's duration, refusing to flee with her relatives. In France, the Palace of Versailles was the site of a massacre and has been burned to the ground; military losses were particularly high clearing the catacombs underneath Paris, because the catacombs housed nearly a quarter of a million refugees during the early stages of the war, all of whom became zombies.\nThe Israelis and Palestinians have made peace, and the former occupied territories have been renamed \"Unified Palestine\". Mexico is now known as \"Aztlán\". Several countries are described as having revised borders due to the \"dumping\" of convicts into infected zones; these convicts rose to command \"powerful fiefdoms\" that later became independent states. A so-called \"Pacific Continent\" appears to encompass previously uninhabited islands as well as ships rendered immobile due to lack of fuel. For unknown reasons, the Saudi Royal Family have destroyed the oil fields in Saudi Arabia.\nThe United Nations fields a large military force to eliminate the remaining zombies from overrun areas, defeat hordes that surface from the ocean floor, and kill frozen zombies before they thaw. Life on Earth is hinted at being brought to near extinction, including the extinction of most aquatic life, including whales. Overall quality of life on earth for those who remain is much less than it was before the war, with diminished life expectancy, limited access to running water and electricity, and an ongoing nuclear winter, the combined result of the nuclear war, the fires caused during the Great Panic, and the advent of fire as humanity's primary source of warmth. Nevertheless, the majority of those who have survived have hope for the future, knowing that humanity faced the brink of extinction, and won.", "cast": "* The Complete Edition"}