{"_movieID": "245906", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:44:11", "summary": "She’s Funny That Way is a 2014 American screwball comedy film directed by Peter Bogdanovich and co-written with Louise Stratten. The film stars Owen Wilson, Imogen Poots, Kathryn Hahn, Will Forte, Rhys Ifans, and Jennifer Aniston.\nThe film had a limited release in the United States and was released through video on demand on August 21, 2015, by Lionsgate Premiere.", "plot": "Broadway director Arnold Albertson alias \"Derek\" (Owen Wilson) hires call girl/escort Izzy Patterson (Imogen Poots), despite being married. Izzy dreams of being an actress, and \"Derek\" gives her $30,000 in exchange for her promise to stop being a call girl and pursue her true goal. She is not the first escort he has done this for. Lead actor Seth Gilbert (Rhys Ifans) sees Arnold kissing Izzy as she leaves his room.\nArnold's wife Delta Simmons (Kathryn Hahn) is the star of Arnold's new play A Grecian Evening. Izzy, keeping her promise to \"Derek\", shows up to audition for a part in the play as a call girl, not knowing that Derek/Arnold is the director. \nThe playwright Joshua Fleet (Will Forte) falls for Izzy, despite the fact that he’s dating Jane Claremont (Jennifer Aniston), who happens to be Izzy's therapist. Meanwhile, Judge Pendergast (Austin Pendleton) is another client of Izzy's, and also a patient of Jane Claremont. He is obsessed with Izzy, and hires private investigator Harold Fleet (George Morfogen), who happens to be Joshua Fleet's father, to follow her.\nAfter the auditions, everyone ends up at the same Italian restaurant. Jane sees Joshua with Izzy and breaks up with him. Izzy sees Arnold and tries to escape out the bathroom window, but Delta catches her and brings her back into the restaurant. Izzy's cover is almost blown when Seth arrives with a co-worker of Izzy's.\nWhile shopping, Delta finds out that Arnold has been hiring escorts when Margie, another call girl Arnold helped, thanks him profusely and indiscreetly. Joshua finds out about Izzy when Judge Pendergast confronts the two of them while they are on a date; she runs off before he can talk to her. Delta turns to Seth, who has long professed his love for her, for comfort, but finds another call girl hiding in his bathroom. She then storms into Arnold's room, only to find Izzy hiding in his bathroom (the two were just talking).\nEveryone shows up to the first table read the next day, despite the tension. Delta makes a point of kissing Seth passionately while rehearsing. Izzy's father shows up looking for the men who paid his daughter for sex. Jane shows up to cause a scene, and identifies Arnold, Seth, and Joshua as Izzy's clients. During the commotion, Seth and Jane catch each others' eye.\nThe play opens to great acclaim. In an interview some time later, Izzy says that it closed in a week because wives from Long Island don't want to go to a play about call girls. Nevertheless, she caught the attention of a man from Hollywood, and has had success as a film actress since. She and Joshua broke up; she's now dating Quentin Tarantino. Seth and Jane are still dating. Judge Pendergast went to prison for solicitation; his wife is now dating Harold Fleet. Arnold now works for a charity giving large sums of money to women's causes."}