{"_movieID": "51497", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:38", "summary": "Fast Five (alternatively known as Fast & Furious 5 or Fast & Furious 5: Rio Heist) is a 2011 American heist action film directed by Justin Lin and written by Chris Morgan. It is the fifth installment in The Fast and the Furious franchise. It was released first in Australia on April 20, 2011, and then in the United States on April 29, 2011. Fast Five follows Dominic Toretto (Vin Diesel), Brian O'Conner (Paul Walker), and Mia Toretto (Jordana Brewster) as they plan a heist to steal $100 million from corrupt businessman Hernan Reyes (Joaquim de Almeida) while being pursued for arrest by U.S. Diplomatic Security Service (DSS) agent Luke Hobbs (Dwayne Johnson).\nWhile developing Fast Five, Universal Studios deliberately departed from the street racing theme prevalent in previous films in the series, to transform the franchise into a heist action series involving cars. By doing so, they hoped to attract wider audiences that might otherwise be put off by a heavy emphasis on cars and car culture. Fast Five is considered the transitional film in the series, featuring only one car race and giving more attention to action set pieces such as gun fights, brawls, and the heist of $100 million. The production mounted a comprehensive marketing campaign, marketing the film through social media, virtual games, cinema chains, automobile manufacturers, and at NASCAR races.\nFast Five achieved financial success, breaking box office records for the highest-grossing April opening weekend and the second-highest spring opening weekend, and surpassing Fast & Furious (2009) to become the highest-grossing film in the franchise. Fast Five grossed over $625 million worldwide, making it number 66 on the all-time worldwide list of highest-grossing films, in unadjusted dollars, and the seventh-highest-grossing film of 2011.\nFast Five received mostly positive reviews, with critics praising the combination of comedy and \"action sequences that toy idly with the laws of physics\"; some labeled it the best film in the series. Johnson was singled out for praise in numerous reviews for his performance, with critics calling him \"the best thing, by far, in Fast Five\" and remarking that scenes shared by Johnson and Diesel were often the \"best moments\". Despite the positive response, many were critical of the film's running time, considering it too long, and others criticized the treatment of women, stating \"[Women] cameo strikingly in buttock form. Others actually have first names.\" South American reviewers were critical of the film's portrayal of Rio de Janeiro as a haven for drug trafficking and corruption, labeling it a \"stereotype\". A sequel, Fast & Furious 6, was released in May 2013 to box office success, surpassing Fast Five as the highest-grossing film in the franchise. Another sequel, Furious 7, released in April 2015, soon surpassed Fast & Furious 6, grossing over $1.5 billion worldwide.", "plot": "As Dominic \"Dom\" Toretto is being transported to Lompoc Prison by bus, his sister Mia Toretto and friend Brian O'Conner lead an assault on the bus, freeing Dom. While the authorities search for them, the trio escapes to Rio de Janeiro. Awaiting Dom's arrival, Mia and Brian join their friend Vince and other participants on a job to steal three cars from a train. Brian and Mia discover that agents from the U.S. Drug Enforcement Administration (DEA) are also on the train and that the cars are seized property. When Dom arrives at the train with his accomplices, he realizes that one of them, Zizi, is only interested in stealing one car, a Ford GT40. Dom has Mia steal the car herself before he and Brian fight Zizi and his henchmen, during which Zizi kills the DEA agents assigned to the vehicles. Dom and Brian are captured and brought to crime lord Hernan Reyes, the owner of the cars and Zizi's boss. Reyes orders the pair interrogated to discover the location of the car, but they manage to escape and retreat to their safehouse.\nWhile Brian, Dom, and Mia examine the car to discover its importance, Vince arrives and is caught trying to remove a computer chip from it. He admits he was planning to sell the chip to Reyes on his own, and Dom forces him to leave. Brian investigates the chip and discovers it contains the complete financial details of Reyes' criminal empire, including the locations of US$100 million in cash.\nDiplomatic Security Service agent Luke Hobbs and his team arrive in Rio to arrest Dom and Brian. With the help of local officer Elena Neves, they travel to Dom's safehouse, but find it under assault by Reyes' men. Brian, Dom and Mia escape. Dom suggests they split up and leave Rio, but Mia announces she is pregnant with Brian's child. Dom agrees to stick together and suggests they steal the money from Reyes to start a new life. They organize a team to perform the heist: Han, Roman, Tej, Gisele, Leo, and Santos. Vince later joins the team after saving Mia from being captured by Reyes' men. The crew infiltrate one of Reyes' facilities and set fire to the money there, baiting him into consolidating his money at a single location: a secure vault inside a police station. \nHobbs and his team eventually find and arrest Dom, Mia, Brian, and Vince. While transporting them to the airport for extradition to the United States, the convoy is attacked by Reyes' men, who kill Hobbs' team. Hobbs and Elena are saved by Dom, Brian, Mia, and Vince, who escape the assault, but Vince is fatally shot. Wanting to avenge his murdered team, Hobbs and Elena agree to help with the heist. The gang break into the police station and tear the vault holding Reyes' money from the building using their cars, dragging it through the city. After an extensive police chase, Dom has Brian continue without him while he attacks the police and the pursuing Reyes, using the vault attached to his car to smash their vehicles. Brian returns and kills Zizi while Reyes is badly injured by Dom's assault. Hobbs arrives on the scene and executes Reyes. Though Hobbs refuses to let Dom and Brian go free, he gives them a 24-hour head start to escape on the condition they leave the vault as it is. However, the vault is empty as it had been switched during the chase. After splitting the cash (Vince's share is given to his family), they go their separate ways.\nOn a tropical beach, Brian and a visibly pregnant Mia relax. They are met by Dom and Elena. Brian challenges Dom to a final, no-stakes race to prove who is the better driver.\nIn a mid-credits scene, Hobbs is given a file by Monica Fuentes concerning the hijack of a military convoy in Berlin, where he discovers a recent photo of Dom's former girlfriend Letty, who had been presumed dead.", "cast": "Vin Diesel as Dominic TorettoA professional criminal, street racer, and fugitive. Diesel was reportedly paid $15 million to star in and produce the film.Paul Walker as Brian O'ConnerA former FBI agent turned criminal. He is in a relationship with Mia Toretto. Walker did many of his own stunts for the film, training with parkour professional Paul Darnell to improve his movement.Jordana Brewster as Mia TorettoDominic's younger sister and Brian's girlfriend.Tyrese Gibson as Roman PearceBrian's childhood friend. Gibson's involvement was confirmed on June 30, 2010. Gibson was committed to Transformers: Dark of the Moon at the time he signed on to Fast Five, so he flew between Puerto Rico and Atlanta to accommodate both films.Chris \"Ludacris\" Bridges as Tej ParkerBrian's and Roman's friend from Miami. Ludacris confirmed his involvement in the film on July 12, 2010, when he stated he had arrived in Puerto Rico to begin filming.Matt Schulze as VinceDominic's childhood friend. Schulze had appeared in the first film, and it was confirmed on July 16, 2010, that he would be returning.Sung Kang as Han Seoul-OhA street racer who was Dominic's business partner in the Dominican Republic.Dwayne Johnson as Luke HobbsA Diplomatic Security Service agent. According to producer Vin Diesel, the role of Hobbs was originally developed with Tommy Lee Jones in mind. However, when reading feedback on his Facebook page, Diesel noted a fan stating a desire to see Diesel and Johnson in a film together. Diesel and Lin then redesigned the role for Johnson. Johnson wanted to work with Universal Studios, citing their support for him during his transition from wrestling to acting. He described the role as a former bounty hunter turned US Marshal and as \"the government's version of the best bounty hunter on the planet\". He undertook an extensive daily workout regime to enlarge his physique, wanting his character to appear as a \"hunter\" and to be formidable enough to present a credible threat to the protagonists.Gal Gadot as Gisele YasharA former Mossad agent. Although Gadot had prior experience handling motorbikes, she was required to learn how to ride the larger, more powerful Ducati Streetfighter for the film.Joaquim de Almeida as Hernan ReyesA ruthless drug lord posing as a legitimate businessman. It was confirmed on July 16, 2010, that Almeida would play Reyes. Having previously played several antagonists, he hesitated to take this role, but accepted it after speaking with Lin and hearing his take on the character.Elsa Pataky as Elena NevesA Rio police officer who works with Hobbs' team and becomes Dominic's love interest. It was confirmed on July 16, 2010, that Pataky would take this role. She underwent several days of tactical training with a police/military technical advisor and was required to learn how to handle her gun in a variety of situations to portray Elena believably.The central cast is rounded out by Puerto Rican singers Tego Calderón and Don Omar as Leo and Santos respectively, members of the heist team. Michael Irby plays Reyes' right-hand man Zizi. Alimi Ballard, Fernando Chien, Yorgo Constantine, and Geoff Meedy portray Hobbs' team members Fusco, Wilkes, Chato, and Macroy. Michelle Rodriguez appears in photographs as Letty Ortiz, Dominic's girlfriend who is presumed dead following the events of Fast & Furious. Eva Mendes appears in an uncredited cameo as Agent Monica Fuentes, reprising her role from 2 Fast 2 Furious."}