{"_movieID": "130925", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:30", "summary": "Toy Story Toons: Partysaurus Rex is a 2012 Pixar computer animated short film directed by Mark Walsh. It was first screened in theaters ahead of the 3-D theatrical re-release of Finding Nemo. Partysaurus Rex is the third and final short in the Toy Story Toons series, based on the characters from the Toy Story feature films. The short involves Rex getting left in a bathroom and making friends with bath toys.", "plot": "Rex disrupts the other toys blowing soap bubbles, worried that they may ruin Bonnie's house. He is chastised by the other toys, with Mr. Potato Head calling him \"Partypooper Rex\". The other toys sense Bonnie approaching, and scatter, leaving Rex alone when she enters. She takes him to play with while she takes a bath until Bonnie's mother comes to turn off the bath, pull out the plug and take her out. The bath toys are happy to see Rex, but soon the water gets drained, leaving them on dry land. Sad, the bath toys wish that they could continue to have fun, but all of them lack arms (except Rex) and can only function if afloat in the water. Rex initially thinks drawing a new bath is a bad idea, but after recalling Mr. Potato Head's insult, he asserts that he is \"Partysaurus Rex\", and helps the bath toys to start a new bath.\nThe toys quickly start to sing and dance in a rave-like fashion, aided by a carefree Rex throwing a bubble bath solution into the tub, and blocking the overflow drain with a frog sponge. However, he suddenly realizes that if the tub overflows, the water will leak out into the hall; the bath toys become careless if this happens and continue to party. Rex tries to turn the water, but only causes the handle to fall off, and the drain stays plugged when he tries to pull it out. Finally, he spots the knob on the faucet that stops the flow from it, but realizes too late that this only diverts the water to the shower head. The tub starts to overflow, and the other bath toys are unconcerned about the problem. Outside the bathroom, Woody, Buzz, and some of the other toys arrive to check on Rex when the bathroom door suddenly bursts open and a flood of water pours out.\nLater, Bonnie's mother is paying to have plumbing repairs done to the house. Though he knows it was his fault, Rex enjoys the short-lived fame with the other toys in Bonnie's room as Mr. Potato Head is still getting the water out of himself. Outside, several pool toys have heard of Rex's exploits from the bath toys and get him to agree to help turn on the outside faucet to let them party as well. Rex quickly joins in on their fun."}