{"_movieID": "411144", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:57:53", "summary": "We Have Always Lived in the Castle is a 2018 American mystery thriller film directed by Stacie Passon, written by Mark Kruger, and starring Taissa Farmiga, Alexandra Daddario, Crispin Glover, and Sebastian Stan. It was based on the 1962 novel of the same name by Shirley Jackson.\nIt premiered at the LA Film Festival on September 22, 2018, to positive to mixed reviews, praising the performances and direction but criticizing the lack of dramatic atmosphere. It was released on May 17, 2019 by Brainstorm Media.", "plot": "18-year-old Mary Katherine \"Merricat\" Blackwood lives in isolation on the family estate with her older sister Constance and their ailing uncle Julian. Constance has not left the house in the six years since she was tried and acquitted of the poisoning death of her parents. Every Tuesday, Merricat must go to the village to do the shopping, where she is harassed by the villagers, who believe Constance has gotten away with murder. Merricat practices her own brand of protective magic by burying articles of power in the grounds around her home to keep evil forces at bay.\nConstance sees only a single family friend, Helen Clarke, who comes to tea every week. Helen tries to convince Constance that she should rejoin the world. This enrages and terrifies Merricat, who responds by creating even more powerful magic to prevent Constance from leaving.\nThe following Thursday, Constance sends Merricat on an errand to town. Merricat is distressed at the thought of going into town on the wrong day and has no time to check her magical safeguards before leaving. When she returns, she finds all her wards have been unearthed. Rushing to warn Constance, she finds Constance with their cousin Charles, who has come to visit.\nOver the next few days, Charles attempts to lure Constance away with the promise of seeing the world while setting his sights on the family's fortune locked in a safe in the study. Constance is charmed by the attention and begins to act more and more subservient toward him. At the same time Charles secretly behaves condescendingly to Julian and taunts Merricat with the idea of stealing her sister. Merricat retaliates by casting magical spells on Charles, destroying his room and belongings, and speaking to him only in descriptions of poisonous plants. \nAfter several days, Charles has enough of Merricat's defiance and destructiveness and threatens to punish her. In revenge, Merricat secretly throws everything on Charles' desk, including his lit pipe, into a wastebasket. After defying Charles by speaking when he warns her not to, Charles chases her upstairs and beats her, while Constance, paralyzed with fear, is unable to stop him. He is interrupted by the smell of smoke and discovers that his room is on fire.\nThe fire department arrives, along with the villagers who call to let the house burn. Constance and Merricat hide downstairs as the fire is extinguished. The villagers rush into the house and begin to destroy it, forcing the sisters to flee. The mob seems ready to attack them, but Helen Clarke's husband intervenes and announces that Uncle Julian has died of smoke inhalation. The mob disperses, and the sisters take refuge in the woods overnight.\nThe following morning, the sisters return home and begin barricading the doors and windows from the inside. With the upper floors destroyed, the remains resemble a turreted castle. Merricat announces to Constance that she intends to poison the whole village; Constance says that this is what Merricat did once before to their parents and expresses gratitude that Merricat saved her from their wicked father. Over the course of the day, the villagers leave gifts of food at the door and apologize for destroying the sisters' property, but no one is allowed inside.\nCharles returns, begging Constance to let him in. When the sisters refuse to open the door, Charles enters the house by force and attacks Constance. Merricat bludgeons him to death with a glass snowglobe, and they bury the body in Constance's garden.\nNow in the present, the sisters are still in the process of cleaning what remains of their house when two village children arrive outside to taunt them. Merricat steps outside unexpectedly, causing the children to flee in fear. As Merricat returns, Constance tells her sister that she loves her, and Merricat, for the first time in the film, smiles.", "cast": "Taissa Farmiga as Merricat Blackwood\nAlexandra Daddario as Constance Blackwood\nSebastian Stan as Charles Blackwood\nCrispin Glover as Julian Blackwood, uncle of Merricat and Constance\nPaula Malcomson as Helen Clarke\nPeter O'Meara as Sam Clarke\nPeter Coonan as Bobby Dunham\nAnna Nugent as Lucille Wright\nStephen Hogan as John Blackwood\nBosco Hogan as Old Ned\nJoanne Crawford as Stella\nPatrick Joseph Byrnes as Mr. Elbert\nLiz O'Sullivan as Mrs. Harris\nIan Toner as Jim Donnell\nLuan James-Geary as Sean Harris\nCormac Melia as Tim Harris\nStephen Hogan as John Blackwood, Merricat and Constance's father\nMaria Doyle-Kennedy as Mrs. Blackwood, Merricat and Constance's mother"}