{"_movieID": "25472", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:19", "summary": "Merry Madagascar is a Christmas special first broadcast on the NBC network on November 17, 2009, which starred the characters from the Madagascar film series. The story appears to take place sometime between the first and second movies.\nIt features many of the same voices from the film (except Sacha Baron Cohen, who was replaced by Danny Jacobs, the voice of Julien in The Penguins of Madagascar television series), including Ben Stiller, Chris Rock, David Schwimmer, and Jada Pinkett Smith. Carl Reiner provided the voice of Santa Claus.\n\n", "plot": "Alex (Ben Stiller), Marty (Chris Rock), Melman (David Schwimmer), and Gloria (Jada Pinkett Smith) attempt to return to New York City in a hot air balloon, but the lemur population inadvertently thwarts their escape plan, as they mistook them for the \"red night goblin\" that visits every year at that time. Immediately after that, the \"goblin\" showers the island with coals; Alex evades the barrage and shoots it down, but soon discovers that it was actually Santa Claus throwing coal at Julien for being naughty.\nThe group realizes the crash has left Santa with amnesia, unaware of his responsibilities, and resolve to deliver all the presents for him and then use the sleigh to get them back home. However, the reindeer (who have a rivalry with the penguins over Santa's original workshop location) refuse to take orders from anyone other than Santa, forcing them to rely on the penguins, who use Santa's magic dust to fly. Their attempts to make deliveries initially go awry, so they agree to dump the gifts at their respective post offices. However, after crashing into an apartment and unintentionally bringing joy to a little girl (Willow Smith), they continue with the deliveries (despite the adverse conditions).\nMeanwhile on Madagascar, while the lemurs are presenting gifts to Julien for \"Julianuary\", Santa rediscovers his ability to make toys, to the lemurs' amazement. He soon crafts gifts for all of them to enjoy, much to Julien's anger since he feels the focus is supposed to be on him; Julien decrees that all the lemurs' gifts are now his. He begins to feel depressed as he sifts through the presents alone; Santa suggests that giving someone a gift might change Julien's mood, which it does.\nAs the night nears its end, the animals discover that they only have enough magic dust to make one last trip (Madagascar or home). Putting aside their personal wishes, they return to Madagascar to rescue Santa, but they run out of dust and crash into him by mistake. This restores Santa's memory, and he thanks the animals for making his deliveries for him; he also takes Julien off the naughty list. However, they overlooked one last bag meant for Liechtenstein, and Santa switches to a reserve tank to make the trip in time before the animals can ask for a ride. Despite this, the animals resolve to enjoy their Christmas in Madagascar, but Julien mischievously throws a coconut at Alex to get back on the naughty list, causing a lump on his head and amnesia, like Santa before him.", "cast": "Ben Stiller as Alex the lion\nChris Rock as Marty the zebra\nDavid Schwimmer as Melman the giraffe\nJada Pinkett Smith as Gloria the hippopotamus\nDanny Jacobs as King Julien XIII the ring-tailed lemur\nTom McGrath as Skipper the penguin\nChris Miller as Kowalski the penguin\nChristopher Knights as Private the penguin\nCarl Reiner as Santa Claus\nCedric the Entertainer as Maurice the aye-aye\nAndy Richter as Mort the mouse lemur\nNina Dobrev as Cupid the reindeer\nWillow Smith as Abby\nJim Cummings as Donner, the lead reindeerNote: Rico appears, but John DiMaggio recorded no lines for him."}