{"_movieID": "241554", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:01:46", "summary": "Run All Night is a 2015 American action thriller film directed by Jaume Collet-Serra and written by Brad Ingelsby. The film stars Liam Neeson, Joel Kinnaman, Common and Ed Harris, and follows an ex-hitman who goes on the run with his estranged adult son after he is forced to kill the son of a mafia boss. It also marks the third collaboration between Liam Neeson and Jaume Collet-Serra after Unknown and Non-Stop.\nIt was released in the United States on March 13, 2015, received mixed reviews from critics and grossed $71 million worldwide.\n\n", "plot": "Haunted by his past, former Irish mob enforcer Jimmy \"The Gravedigger\" Conlon has become an angry drunk. His son Mike, a retired professional boxer who mentors at-risk kids at the local gym, is disgusted by his father's actions and refuses to call him \"Dad\" or involve him in the lives of his daughters.\nJimmy's old boss and closest friend, Shawn Maguire, rejects an offer to allow the sale of Albanian heroin in his territory. His son Danny, who received a large fee to arrange the deal, is told to return the money or suffer the consequences. Mike, working as a chauffeur, takes the two Albanian creditors to Danny's house. The deal goes bad once Danny reveals that he does not have the money, and a brief shootout ensues which kills one of the Albanians. The other Albanian, wounded, stumbles out of Danny's flat and attempts to escape, only to be shot dead by Danny. The events are witnessed by Mike and his mentee Legs and are captured on Legs' phone. Danny spots them and attempts to kill Mike, but he escapes.\nJimmy has Mike promise not to expose Danny, but Mike refuses to listen. As Mike is leaving, Jimmy spots Danny trying to kill his son and shoots him before he can fire. Shawn sends two corrupt police officers to pick up Mike and kill him, but Jimmy rescues him and shoots and kills one of the corrupt cops before taking Mike to his family. Mike still distrusts his father, but agrees to give him that night to fix the situation.\nJimmy meets Shawn and tells him that Danny was about to kill Mike, and that he might have to speak to the N.Y.P.D. about his criminal past. Shawn furiously says that the cops care nothing for Jimmy's information, and tells Jimmy he will kill Mike and his family, only then letting Jimmy die.\nJimmy sends Mike's family to a remote cabin and takes Mike with him to retrieve proof of his innocence, but Andrew Price, an assassin hired by Shawn, intercepts them before they can collect the evidence. Jimmy is able to subdue him, but is wounded. Jimmy later contacts Detective Harding, a cop who has not been able to prove Jimmy's responsibility for a long list of homicides. Harding says that witnesses claim Mike was the shooter, not Danny, but Jimmy makes a deal with him: he will prove Mike is innocent and then turn himself in with a list of all the people he murdered in his mob career.\nThe two hide at the house of Jimmy's brother Eddie. An incensed Eddie reveals that Jimmy is loyal only to Shawn — he once killed his own cousin to prevent him testifying against Shawn and will do the same to Mike. Disgusted and unwilling to trust his father, Mike returns to his family. Seeking to end the blood feud, Jimmy attacks Shawn's hideout and kills him and his gang. At the same time, Legs visits Harding with the video he shot of the murder of the Albanians. Convinced, Harding has the police check the ballistics on Danny's gun.\nMike arrives at the cabin and alerts the police to his location. Jimmy soon arrives, and Mike finally introduces him to his grandchildren. Suddenly, Price returns and attacks the cabin, shooting Jimmy and then hunting down Mike. Mike is cornered by Price, but Jimmy kills him at the last second. Mike runs up to Jimmy and finally calls him \"Dad\". The police arrive and confirm Legs' evidence has cleared Mike as Jimmy dies, holding the list of his past victims as promised.\nIn the film's epilogue, Mike is back working as a boxing trainer and chauffeur and living happily with his wife and daughters. He looks wistfully at a photo of himself and Jimmy from long ago on his dresser before he heads out to his shift."}