{"_movieID": "51876", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:02:04", "summary": "Limitless is a 2011 American science fiction thriller film directed by Neil Burger and written by Leslie Dixon. Based on the novel The Dark Fields by Alan Glynn, the film stars Bradley Cooper, Abbie Cornish, Robert De Niro, Andrew Howard, and Anna Friel. The film follows Edward Morra, a struggling writer who is introduced to a nootropic drug called NZT-48, which gives him the ability to fully utilize his brain and vastly improve his lifestyle.\nLimitless was released on March 18, 2011 and became a box office success, grossing over $161 million on a budget of $27 million. A television series of the same name, covering events that take place after the film, debuted on September 22, 2015, but was cancelled after one season.", "plot": "Eddie Morra is a struggling author in New York City. His girlfriend Lindy, frustrated with his lack of progress, breaks up with him. Eddie encounters Vernon, the brother of his ex-wife Melissa, who gives Eddie a sample of a new nootropic called NZT-48. On the drug, Eddie discovers he has acquired perfect recollection of everything he has ever read and refined his interpersonal skills. His new power enables him to make significant progress on his book.\nThe next day, the effects having worn off, he brings his pages to his publisher, who praises them. Eddie seeks out Vernon for more NZT-48 but while Eddie leaves to run some errands for Vernon, Vernon is murdered by someone searching for the drug. Eddie locates Vernon's supply and begins ingesting pills daily. With its effects, Eddie improves his entire lifestyle, appearance, sex appeal, and social circle, and finishes his book. While enjoying his new life, Eddie has an epiphany to focus his talent on investing. \nEddie quickly begins making large returns on the stock market and borrows $100,000 from a Russian loan shark, Gennady. He is hired at a brokerage firm and resumes his relationship with Lindy. Eddie experiences what he refers to as a \"time skip\", a momentary lapse in memory. Eddie's success leads to a meeting with finance tycoon Carl Van Loon, who tests him by seeking advice on a merger with Hank Atwood's company. After the meeting, Eddie experiences an 18-hour party-hopping time skip. The next day in a meeting with Van Loon, Eddie sees a news telecast that a woman has been murdered in her hotel room. Eddie recognizes her as the woman he slept with during his time skip and abruptly leaves the meeting. \nBy calling the people in Vernon's ledger, Eddie realizes everyone taking NZT-48 is either hospitalized or dead. A man in a trench coat is revealed to have been following him. Eddie meets with Melissa, who had also been on the drug but, when she attempted to stop, experienced a severe mental and physical withdrawal effect. Gennady finds Eddie and demands the money be paid back immediately, with interest. He discovers and ingests Eddie's last NZT-48, and begins using Eddie as his source for the drug. \nDesperate for a pill, Eddie asks Lindy to retrieve his stash. En route to Eddie, she notices the man in the trench coat following her. She calls Eddie for help and he encourages her to take one of the pills, which empowers her to escape. Afterwards, Lindy tells Eddie she cannot be with him while he is on the drug.\nEddie experiments with NZT-48 and learns to control his dosage, sleep schedule, and food intake to prevent side effects. He hires a laboratory in an attempt to reverse-engineer the drug, an attorney to keep the police from investigating the death of Vernon or the woman, and two bodyguards to protect him from Gennady, who is threatening him to obtain more NZT-48. \nOn the day of the merger, Atwood falls into a coma. Eddie recognizes Atwood's driver as the man in the trench coat and realizes Atwood is on NZT-48. While Eddie participates in a police lineup, his attorney steals Eddie's whole supply of pills from his jacket pocket. Eddie enters into withdrawal, and while Van Loon questions him about Atwood's coma, Eddie receives a parcel which is found to contain the severed hands of his bodyguards. He hurries home and locks himself in, before Gennady breaks into Eddie's apartment, demanding more NZT-48. Gennady flaunts his abilities while injecting himself with NZT-48. As Gennady threatens to eviscerate him, Eddie grabs his own knife and kills Gennady, then licks Gennady's blood. This gives Eddie the mental abilities of the drug once again, and Eddie is able to kill the remaining henchmen. He then meets with the man in the trench coat, surmising Atwood employed the man to locate more NZT-48. Once Atwood dies, the two recover Eddie's stash from his attorney's apartment.\nA year later, Eddie has retained his wealth, published a book, and is running for the United States Senate. Van Loon visits him and reveals he has absorbed the company that produced NZT-48 and shut down Eddie's laboratory. Van Loon offers Eddie a continued supply of the drug in exchange for Eddie assisting his ambitions. Eddie tells Van Loon he has already perfected the drug and weaned himself off of it, retaining his abilities without side effects."}