{"_movieID": "450465", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:03", "summary": "Glass is a non-crystalline, amorphous solid that is most often transparent and has widespread practical, technological, and decorative uses in, for example, window panes, tableware, optics and optoelectronics. The most familiar, and historically the oldest, types of manufactured glass are \"silicate glasses\" based on the chemical compound silica (silicon dioxide, or quartz), the primary constituent of sand.  The term glass, in popular usage, is often used to refer only to this type of material, which is familiar from use as window glass and in glass bottles. Of the many silica-based glasses that exist, ordinary glazing and container glass is formed from a specific type called soda-lime glass, composed of approximately 75% silicon dioxide (SiO2), sodium oxide (Na2O) from sodium carbonate (Na2CO3), calcium oxide (CaO), also called lime, and several minor additives.\nMany applications of silicate glasses derive from their optical transparency, giving rise to their primary use as window panes. Glass will transmit, reflect and refract light; these qualities can be enhanced by cutting and polishing to make optical lenses, prisms, fine glassware, and optical fibers for high speed data transmission by light. Glass can be coloured by adding metallic salts, and can also be painted and printed with vitreous enamels. These qualities have led to the extensive use of glass in the manufacture of art objects and in particular, stained glass windows. Although brittle, silicate glass is extremely durable, and many examples of glass fragments exist from early glass-making cultures. Because glass can be formed or moulded into any shape, it has been traditionally used for vessels: bowls, vases, bottles, jars and drinking glasses. In its most solid forms it has also been used for paperweights, marbles, and beads. When extruded as glass fiber and matted as glass wool in a way to trap air, it becomes a thermal insulating material, and when these glass fibers are embedded into an organic polymer plastic, they are a key structural reinforcement part of the composite material fiberglass. Some objects historically were so commonly made of silicate glass that they are simply called by the name of the material, such as drinking glasses and eyeglasses.\nScientifically, \"glass\" is often defined in a broader sense, encompassing every solid that possesses a non-crystalline (that is, amorphous) structure at the atomic scale and that exhibits a glass transition when heated towards the liquid state. Porcelains and many polymer thermoplastics familiar from everyday use are glasses. These sorts of glasses can be made of quite different kinds of materials than silica: metallic alloys, ionic melts, aqueous solutions, molecular liquids, and polymers. For many applications, like glass bottles or eyewear, polymer glasses (acrylic glass, polycarbonate or polyethylene terephthalate) are a lighter alternative than traditional glass."}