{"_movieID": "11157", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:41", "summary": "She-Devil is a 1989 American black comedy film directed by Susan Seidelman and written by Barry Strugatz and Mark R. Burns. It stars Meryl Streep, Roseanne Barr (in her film debut) and Ed Begley Jr.. A loose adaptation of the 1983 novel The Life and Loves of a She-Devil by British writer Fay Weldon, She-Devil tells the story of Ruth Patchett, a dumpy, overweight housewife who exacts devilish revenge, after her philandering husband leaves her and their children for glamorous, best-selling romance novelist Mary Fisher.\nThe second adaption of Weldon's novel, after a BBC TV miniseries entitled The Life and Loves of a She-Devil was broadcast in 1986, the film was shot amid the first season break of Barr's highly successful ABC sitcom Roseanne, in New York City throughout spring and summer 1989. For a while, Streep, who was one of the first actresses to read the script, considered taking the part of Ruth herself but later opted to play Fisher instead, as she felt she had dealt with a similar subject in her previous film Evil Angels (1988).\nProduced by Orion Pictures, She-Devil was released on December 8, 1989, and grossed $15.5 million at the box office. Critics praised Barr's and Streep's performances but criticized the film for its tone. Streep earned a Golden Globe Award nomination for Best Actress - Motion Picture Musical or Comedy the following year.", "plot": "Ruth Patchett is a frumpy, overweight wife and mother, who tries desperately to please her husband Bob, an accountant trying to boost his business. After Bob meets Mary Fisher, a narcissistic romance novelist, at a dinner party, they begin an affair. Ruth, aware of the affair, confronts Bob while his parents are visiting, and Bob leaves her. As he packs his suitcase, he says his assets are his home, his family, his career, and his freedom. Angry, Ruth vows  revenge on him and Mary. Ruth writes a list titled \"Bob's Assets\", with the four assets that Bob stated. She crosses off each one when it is destroyed.\nWith Bob away at Mary's and the kids at school, she overloads the electricity of the house, which is destroyed in a gigantic explosion. She leaves the kids with Mary and Bob and tells him that she will not be returning. However, she is still working behind the scenes to destroy Bob's remaining assets, aided by Mary's financial records which she procured prior to destroying the house. It is revealed that Bob's second asset, his family, is being destroyed, too, as Mary's selfish refusal to learn how to be a mother causes tension in her relationship with Bob. \nRuth takes a job at a nursing home under the pseudonym Vesta Rose, where she befriends Mary's foul-mouthed, estranged mother, and arranges for her to return to Mary's life at an inopportune moment. She also meets Nurse Hooper, a woman who has worked for the nursing home for twenty-two years and put aside her earnings for a considerable life savings. They form a partnership and start an employment agency for downtrodden women who have been rejected by society and need a second chance. The agency is a success, and the women Ruth has helped assist her in getting revenge on Bob. \nMary writes a new novel loosely based on her romance with Bob, which her publisher considers strange and off-putting, because of its focus on laundry and the protagonist's name, Bob. Olivia, an attractive but ditsy young blonde, applies to Ruth's agency, and she finds her a position as Bob's secretary. He soon starts sleeping with her, but when she proclaims her love, he immediately dumps and fires her. Olivia reveals to Ruth that Bob is a fraudster who cons money out of his clients by skimming interest off their accounts, then transferring it to his offshore account. Ruth hacks his files and exposes this to clients and the police, thus destroying his career.\nMary's career goes downhill, too. As she is being interviewed for a puff piece by People, her mother reveals embarrassing secrets about Mary that are then titled \"Dethroning the Queen of Romance\". Mary, intent on reclaiming her former life, throws a party for her friends, which goes well until state troopers appear with a warrant for Bob's arrest. Bob's lawyer bribes a judge to ensure the verdict is favorable, and unknowingly informs Mary that Bob has been stealing from her account as well. As Mary leaves Bob, he realizes that what he did to Ruth has happened to him and he has ended up with nothing because of his greed, selfishness, and infidelity. A woman who gained employment as a court clerk thanks to Ruth's agency, pays Ruth back by reassigning Bob's case to an unbiased judge. Bob is convicted of embezzlement and sentenced to 18 months in prison, thus destroying his fourth and final asset: his freedom. Meanwhile, Mary sells her mansion when her novel fails, while Ruth's business thrives. \nOne year later, Ruth and her children visit a greatly reformed Bob, who says he will be free soon and is looking forward to catching up with them. It is loosely implied that he and Ruth have divorced but are now on considerably more amicable terms with each other. Ruth ends by saying she believes a person can change, as has Bob, but that not everyone does so.  The final scene shows Ruth at a book signing for Mary's new novel – in which she tells all about her affair. Ruth asks Mary to make the autograph out to Ruth, and Mary does a double take. Next in line after Ruth is a man whom Mary clearly tries to become more personal with, indicating she has not changed her ways. The film ends with Ruth, a smile on her face as she walks down a busy street in Manhattan, accompanied by women from her firm.", "cast": "Meryl Streep as Mary Fisher\nRoseanne Barr as Ruth Patchett\nEd Begley Jr. as Bob Patchett\nLinda Hunt as Hooper\nSylvia Miles as Mrs. Fisher\nElisebeth Peters as Nicolette Patchett\nBryan Larkin as Andy Patchett\nA Martinez as Garcia\nMaria Pitillo as Olivia Honey\nMary Louise Wilson as Mrs. Trumper\nSusan Willis as Ute\nJack Gilpin as Larry\nRobin Leach as Himself\nNitchie Barrett as Bob's Secretary\nJune Gable as Realtor\nLori Tan Chinn as Vesta Rose Woman\nSally Jessy Raphael as Herself"}