{"_movieID": "331482", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:32:11", "summary": "Little Women is a novel by American author Louisa May Alcott (1832–1888), which was originally published in two volumes in 1868 and 1869. Alcott wrote the books over several months at the request of her publisher.\nFollowing the lives of the four March sisters—Meg, Jo, Beth and Amy—the novel details their passage from childhood to womanhood and is loosely based on the author and her three sisters. Scholars classify Little Women as an autobiographical or semi-autobiographical novel.Little Women was an immediate commercial and critical success with readers demanding to know more about the characters. Alcott quickly completed a second volume (entitled Good Wives in the United Kingdom, although this name originated from the publisher and not from Alcott). It was also successful. The two volumes were issued in 1880 as a single novel entitled Little Women.\nAlcott wrote two sequels to her popular work, both of which also featured the March sisters: Little Men (1871) and Jo's Boys (1886). Although Little Women was a novel for girls, it differed notably from the current writings for children, especially girls. The novel addressed three major themes: \"domesticity, work, and true love, all of them interdependent and each necessary to the achievement of its heroine's individual identity.\"Little Women \"has been read as a romance or as a quest, or both. It has been read as a family drama that validates virtue over wealth\", but also \"as a means of escaping that life by women who knew its gender constraints only too well\". According to Sarah Elbert, Alcott created a new form of literature, one that took elements from Romantic children's fiction and combined it with others from sentimental novels, resulting in a totally new format. Elbert argued that within Little Women can be found the first vision of the \"All-American girl\" and that her various aspects are embodied in the differing March sisters. The book has frequently been adapted for stage and screen."}