{"_movieID": "11774", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:46", "summary": "Lemony Snicket's A Series of Unfortunate Events (also simply known as A Series of Unfortunate Events) is a 2004 American gothic dark comedy film directed by Brad Silberling. It is a film adaptation of A Series of Unfortunate Events by Lemony Snicket, covering the first three novels: The Bad Beginning, The Reptile Room, and The Wide Window. The film stars Jim Carrey, Liam Aiken, Emily Browning, Timothy Spall, Catherine O'Hara, Billy Connolly, Cedric the Entertainer, Luis Guzmán, Jennifer Coolidge and Meryl Streep, as well as Jude Law as Lemony Snicket (the pen name of American writer Daniel Handler).\nNickelodeon Movies purchased the film rights to Daniel Handler's book series in 2000 and soon began development of a film with Barry Sonnenfeld attached to direct. Handler adapted the screenplay and courted Jim Carrey for Count Olaf. Sonnenfeld eventually left over budget concerns in January 2003 and Brad Silberling took over. Robert Gordon rewrote Handler's script, and principal photography started in November 2003. A Series of Unfortunate Events was entirely shot using sound stages and backlots at Paramount Pictures and Downey Studios. The film received positive reviews, with many praising Carrey's performance, while some criticized its comical tone and short length - only focusing on the first 3 books in the series. The film also grossed $209 million worldwide, and won the Academy Award for Best Makeup.", "plot": "Lemony Snicket narrates the story of the Baudelaire children.\nFourteen-year-old inventor Violet Baudelaire, her twelve-year-old bibliophile brother Klaus, and their mordacious baby sister Sunny are orphaned after a mysterious fire destroys their home and kills their parents. Mr. Poe, the family's banker, manages their affairs and leaves them in the care of their closest relative Count Olaf. Olaf is intent upon obtaining their family fortune, which will remain in the custody of the bank until Violet comes of age. He forces them to do chores and belittles them.\nDriving back from the court where Olaf has legally obtained custody of the children, he stops to go into a store, leaving them in the car parked directly on train tracks with a train heading towards them. They manage to divert the train by building a device to remotely turn the switch controlling the tracks. Mr. Poe arrives and takes them away.\nThe orphans are taken to their uncle Montgomery, a kind herpetologist. However, Olaf arrives disguised as Montgomery's assistant Stephano. The orphans attempt to warn Montgomery, but he believes Stephano is after a large viper in his laboratory. Montgomery is discovered dead shortly after, his death blamed on the viper. They are almost placed in Stephano's care by Mr. Poe, but Sunny proves Stephano's guilt by showing the viper is harmless. Stephano escapes.\nMr. Poe leaves them with their Aunt Josephine. Olaf appears disguised as Captain Sham to interfere with their plans again. One day, Josephine is not at the house, leaving an apparent suicide note entrusting them to Captain Sham. Klaus deduces that Olaf forced her to forge the note, but she left a hidden message revealing her location. They sail to the cave where she is hiding and rescue her, but attract leeches. Olaf appears and takes the children, throwing Josephine off the boat to the leeches. Mr. Poe finds Olaf with the children, and Olaf pretends to have rescued them. Mr. Poe is fooled and gives the children back to Olaf.\nOlaf plans a play titled \"The Marvelous Marriage\", that stars Violet and Olaf as a bride and groom. Klaus's suspicions reveal that Olaf is planning to take advantage of the play to really marry Violet in an attempt to get the fortune. \nKlaus manages to escape and finds a hidden tower in Olaf's house, with a large lens which, if positioned correctly, can focus the rays of the sun. He discovers this way that it was Olaf who set fire to their old house. He uses this window to burn the marriage certificate, leading to Olaf's arrest. However, a jury of his peers overturn his sentence and Olaf vanishes.\nViolet, Klaus and Sunny are taken to visit the burned remains of their old home one last time. A lost letter from their parents finally arrives, and inside is a spyglass announcing their family's secret society."}