{"_movieID": "239346", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:55", "summary": "Kelly Clarkson's Cautionary Christmas Music Tale is a Christmas television special produced by Done and Dusted for NBC. Directed by Hamish Hamilton, it stars Kelly Clarkson, Blake Shelton, Reba McEntire, Trisha Yearwood, Robin Williams, Whoopi Goldberg, William Shatner, Jay Leno, Matt Lauer, Danica Patrick, Heidi Klum, Ken Jeong, Jai Rodriguez and Morgan Bastin. It is a musical comedy pastiche loosely based on Charles Dickens's A Christmas Carol where Clarkson's character learns the true meaning of Christmas, accompanied by the music of her sixth studio album Wrapped in Red. With its musical performances filmed live at The Venetian Las Vegas on October 30, 2013, the television special itself was broadcast on December 11, 2013 on NBC in the United States. The special won a Gold World Medal for best Variety Special in the New York Festival’s International Television & Film Awards. The special was aired on December 23, 2014 and December 17, 2015.", "plot": "The story is narrated by a little girl (Morgan Bastin), who sits in a chair and reads the story from a book.\nKelly's career has been fading, so she, her manager (Ken Jeong) and her assistant Chad (Jai Rodriguez) make a plan to revive it. Kelly decides to do a Christmas special and makes a deal with a NBC executive (William Shatner) that many celebrities will star in her special. She also says that children will benefit from the special, although it is only a pretext to have more publicity for the special. Kelly promotes it on The Tonight Show with Jay Leno.\nShe manages to get Reba McEntire and Trisha Yearwood to sing \"Silent Night\" with her on her special by blackmailing them. Kelly wants more celebrities including George Clooney. Nevertheless, everyone including Whoopi Goldberg, Robin Williams, Danica Patrick and Heidi Klum declines. Kelly is furious and fires her assistant Chad. The only one who wants to participate is Blake Shelton but Kelly is afraid that he would overshadow her. She makes him sew her dresses and iron them. When he asks her what she wants to do for the finale, she is not paying much attention and replies that probably something with elves.\nOn the night of the finale, Kelly faces the humiliation of being unable to get any celebrities to join her. She panics and runs away from the theater, where the special is shot. Outside, it is snowing. Kelly encounters a man begging on the street with a little girl. The man turns out to be Chad and the girl is his little sister, Poppy. When he sees that Kelly is cold, he gives her his coat and takes her to a shelter where he lives now. Kelly is moved when she sees all the homeless children who live there. Chad give some sweets to the children and Poppy gives her own candy cane to Kelly. Kelly is touched by her generosity and realizes that she was wrong and that Christmas is not about her career. Having nothing else to give, she sings \"White Christmas\" to the people in the shelter. When she finishes, Chad tells her that he managed to get George Clooney on the phone and that he was available for the special. Much to his surprise, Kelly only wishes Merry Christmas to Clooney and hangs up.\nMeanwhile, a video of Kelly singing \"White Christmas\" has gone viral on YouTube, having more than 25 million views, and the fact is announced by Matt Lauer. When the celebrities who refused to participate in the special before see it, they call Kelly as they want to be a part of the show now. Nevertheless, Kelly does not pick up her phone. Instead she invites Poppy and her new Boston and Seattle friends to join her on stage and sing \"Underneath the Tree\". When Kelly heads home after the performance, she meets Blake Shelton who is wearing an elf costume. He bitterly yells at her for not including him into her special, claiming that he is \"way too cool for this\". The story ends with the narrator saying \"and they all lived happily ever after\" to which Kelly replies \"for the most part, anyway\" and winks at the camera.", "cast": "Kelly Clarkson\nBlake Shelton\nReba McEntire\nTrisha Yearwood\nRobin Williams\nWhoopi Goldberg\nWilliam Shatner\nJay Leno\nMatt Lauer\nDanica Patrick\nHeidi Klum\nKen Jeong\nJai Rodriguez\nMorgan Bastin\nGianna ArchuletaSource:"}