{"_movieID": "16577", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:11", "summary": "Astro Boy, known in Japan by its original name Mighty Atom (Japanese: 鉄腕アトム, Hepburn: Tetsuwan Atomu), is a Japanese manga series written and illustrated by Osamu Tezuka. It was serialized in Kobunsha's Shōnen from 1952 to 1968. The 112 chapters were collected into 23 tankōbon volumes by Akita Shoten. English volumes were not available until 2002, when the manga was licensed by Dark Horse. The story follows Astro Boy, an android with human emotions who is created by Umataro Tenma after the death of his son. Eventually, Astro is sold to a robot circus run by Hamegg, but is saved from his servitude by Professor Ochanomizu. Astro becomes a surrogate son to Ochanomizu who creates a robotic family for Astro and helps him to live a normal life like an average human boy, while accompanying him on adventures.Astro Boy has been adapted into three anime series produced respectively by Mushi Production and Tezuka Productions, with a fourth in development. The manga was originally produced for TV as Astro Boy, the first popular animated Japanese television series that embodied the aesthetic that later became familiar worldwide as anime. After enjoying success abroad, Astro Boy was remade in the 1980s as New Mighty Atom, known as Astroboy in other countries, and again in 2003. In November 2007, he was named Japan's envoy for overseas safety. An American computer-animated film based on the original manga series by Tezuka was released on October 23, 2009. In March 2015, a trailer was released announcing a new animated series. The success of the manga and anime series led it to becoming a major media franchise consisting of films including a major motion picture, a number of soundtracks and a library of Video Games. The series was also among the first to embrace mass merchandise including action figures, collectible figurines, food products, clothing, stamps and trading cards. By 2004, the franchise had generated $3 billion in merchandise sales.Astro Boy has is one the most successful manga and anime franchises in the world. The combined 23 tankōbon volumes have sold over 100 million copies worldwide, making it the tenth-best-selling manga series of all time. The 1963 anime series became a hit on television in Japan and the United States. Astro Boy has been praised for its importance in developing the anime and manga industry. It has been featured on numerous greatest anime of all time lists and has partially inspired other authors in the creation of influential manga.", "plot": "Astro Boy is a science fiction series set in a futuristic world where robots co-exist with humans. Its focus is on the adventures of the titular \"Astro Boy\" (sometimes called simply \"Astro\"): a powerful android created by the head of the Ministry of Science, Doctor Tenma (aka Dr. Astor Boynton II in the 1960s English dub; Dr. Boynton in the 1980s English dub). Dr. Tenma created Astro to replace his son Tobio ('Astor' in the 1960s English dub; 'Toby' in the 1980s English dub and the 2009 film), who died in a self-driving car accident (first ran away, then died in the accident in the 2003 anime; vaporized by the peacekeeper in the 2009 film). Dr. Tenma built and adopted Astro in Tobio's memory and treated Astro as lovingly as if he was the real Tobio. However, Dr. Tenma soon realized that the little android could not fill the void of his lost son, especially given that Astro could not grow older or express human aesthetics (in one set of panels in the manga, Astro is shown preferring the mechanical shapes of cubes over the organic shapes of flowers). In the original 1960 edition, Tenma rejected Astro and sold him to a cruel circus owner, Hamegg (the Great Cacciatore in the '60 English dub). In the 1980 edition, Hamegg kidnapped Astro while Tenma was trying to find him. In the 2009 film, Tenma rejected Astro part-time because he could not stop thinking about his original son, but later during the film, Tenma realized that Astro made credit to replace Tobio; as a result, Tenma decided that he would readopt Astro. None these events about Astro being rejected (completely or temporarily) or kidnapped in both the 1960 & 1980 cartoons as well as in the 2009 film happened in the 2003 cartoon as Astro's birth was given by Professor Ochanomizu (Dr. Elefun in the 1960 & 1980 cartoons as well as in the 2009 film; Dr. O'Shay in the 2003 cartoon).\nAfter some time, Professor Ochanomizu, the new head of the Ministry of Science (co-head of the Ministry of Science in the 2009 film), notices Astro Boy performing in the circus and convinces Hamegg to turn Astro over to him. (In a retcon the story becomes far more violent and complicated). He then takes Astro in as his own and treats him gently and warmly, becoming his legal guardian. He soon realizes that Astro has superior powers and skills, as well as the ability to experience human emotions.\nAstro then is shown fighting crime, evil, and injustice using his seven powers: 100K horsepower strength, jet flight, high intensity lights in his eyes, adjustable hearing, instant language translation, a retractable machine gun in his hips, and a high IQ capable of determining if a person is good or evil.  Most of his enemies are robot-hating humans, robots gone berserk, or alien invaders. Almost every story includes a battle involving Astro and other robots. In one manga episode, Astro takes on the US Air Force, and stops it from bombing some innocent Vietnamese villagers (this was a time-travel episode, in which Astro went back from the 21st century to 1969)."}