{"_movieID": "354857", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:08:58", "summary": "Regular Show: The Movie is a 2015 American animated science-fiction comedy film based on the Cartoon Network original series, Regular Show. It is produced by Cartoon Network Studios and premiered on August 14, 2015 at The Downtown Independent theater in Los Angeles, where it was shown until August 20, 2015. The film was released digitally on September 1, 2015, on DVD on October 13, 2015, and ultimately had its television premiere on November 25, 2015 on Cartoon Network. The events of the film take place during the seventh season of the show.", "plot": "In the distant future, Rigby leads Benson, Skips, Hi-Five Ghost, Muscle Man, and Pops against an evil man named Mr. Ross who is erasing time. They find Mr. Ross' weapon is guarded by a future version of Mordecai, who attempts to kill Rigby for a transgression he did in the past. When the entire team is killed, Benson sacrifices himself so that Rigby can use a timeship to reach the past and stop the chaos. Rigby does so, but not before Mordecai shoots him with a plasma shotgun.\nIn the present, Mordecai and Rigby barely convince Benson not to fire them after running late due to Rigby's idea to get breakfast burritos. When the timeship crash lands in the park, future Rigby appears to tell Mordecai, Rigby and their co-workers that when Mordecai and Rigby were in high school, they created a time machine that backfired and created a \"Time-nado\", a tornado with the ability to travel through space and time, which was harnessed and weaponized by their former science teacher and volleyball coach, Mr. Ross, who was held responsible and sent to prison. Before dying, future Rigby also reveals future Mordecai shot him and says Rigby must soon reveal a secret from his past in order to save the universe, even if it costs him his friendship with Mordecai. When questioned for details, Mordecai explains they created the time machine because Rigby got into their dream college, College University, but Mordecai did not. Benson tries to convince everyone the whole thing is a hoax until Muscle Man finds a plasma shotgun and blows up Benson's car with it.\nAfter preparing for the mission, the employees use the ship to reach Mordecai and Rigby's high school days but damage the ship's engines in the process. Skips, Muscle Man and Hi-Five Ghost stay behind to repair the ship's engines while Benson and Pops follow Mordecai and Rigby to the science lab to find the time machine that Mordecai and Rigby's past selves were working on with past Mr. Ross, who is angry at Rigby for costing the volleyball team the championship but was forced to let him do an extra credit assignment to pass his class. However, the volleyball team attack Benson and Pops, thinking they were spies from their rival school, riverdale. Forcing Mordecai and Rigby to get help from their past selves.\nAfter convincing past Rigby to make a model volcano instead, the group destroy the time machine and return to the timeship only to find the repairs stalled due to an encounter with Muscle Man and Hi-Five Ghost's past selves. Complicating matters further is that temporal ruptures begin appearing just as the repairs are finished. Rigby, who had slipped away earlier, alerts them that past Mordecai and past Rigby are heading to the high school to finish a second time machine future Mr. Ross planted. The employees race back to the science lab but are held up by Mr. Ross and future Mordecai, allowing past Mordecai and past Rigby to botch the time machine and create the Time-nado. Mr. Ross then forces Rigby to admit the truth while holding Mordecai hostage: he never got into College U but Mordecai did and he created Mordecai's fake rejection letter in order to maintain their friendship. Mr. Ross tries to kill Mordecai with a volleyball bomb in the confusion, but future Mordecai jumps into the bomb's path, taking a heavy wound and forcing Mr. Ross to retreat.\nEnraged over the duplicity that has affected his life, Mordecai ends his friendship with Rigby completely, blaming him for holding him back the entire time. This prompts a heartbroken Rigby to run off with the timeship, leaving the group behind. Before dying, future Mordecai gives his present version his timeship and instructs him to patch things up, saying what Rigby did was no excuse to side with Mr. Ross. As the group tries to rebound, a distress call from future Gene the Vending Machine prompts them to help out. Meanwhile, after a suicide attempt to fly into the sun, Rigby encounters Father Time, who is falling apart due to the Time-nado and convinces Rigby to apologize to Mordecai. Rigby heads to the future and races back to the Time-nado space station but gets intercepted along with Mordecai by Mr. Ross at the temporal crystal power core. They manage to kill Ross and the duo restore their friendship before using the plutonium from Mordecai's ship to destroy the Time-nado. They later convince past Rigby to apologize to past Mr. Ross before he's taken to jail For Life, thus ending the feud between them.\nIn the present, Mordecai and Rigby agree that, despite how cool their future selves turned out, they won't let their friendship degrade into trying to kill each other, which alters the future and erases their dead future selves from the timeline. The next day, as Benson catches them out of the park, the pair race back in the timeship from a fast food place with Rigby saying they'll \"never be late again\"."}