{"_movieID": "395834", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:06:02", "summary": "Wind River is a 2017 neo-Western murder mystery film written and directed by Taylor Sheridan. The film stars Jeremy Renner and Elizabeth Olsen as a U.S. Fish and Wildlife Service tracker and an FBI agent, respectively, who try to solve a murder on the Wind River Indian Reservation in Wyoming. Gil Birmingham, Jon Bernthal and Graham Greene also star. According to Sheridan, the opening \"inspired by true events\" card was a reference to the \"thousands of actual stories just like it\" involving the sexual assault and murder of Indigenous women, which was his primary motivation for writing the film.Wind River premiered at the 2017 Sundance Film Festival and was released in the United States on August 4, 2017. The film received generally positive reviews from critics and was a box office success, grossing $45 million against an $11 million budget. While theatrically released by The Weinstein Company, in October 2017, following the Harvey Weinstein sexual abuse allegations, the film's distribution rights for home media were acquired by Lionsgate, with Weinstein's credits and logo being omitted on home media and streaming services, which caused TWC to lose distribution rights.", "plot": "During the winter on the Wind River Indian Reservation in Wyoming, expert tracker and U.S. Fish and Wildlife Service agent Cory Lambert discovers the frozen body of 18-year-old Natalie Hanson in the snow. Her body is barefoot, without proper winter attire, miles from any building, and has a blood-stained groin. FBI Special Agent Jane Banner arrives to investigate a possible homicide. The next day, Jane learns from Natalie's father, Martin, that his daughter was dating a new boyfriend, but he does not know the man's name or whereabouts. The autopsy shows blunt trauma and sexual violence and confirms Lambert's deduction that the girl died from exposure, specifically pulmonary hemorrhage caused by rapid inhalation of sub-zero air. However, the medical examiner is unable to confirm the death as a homicide, therefore preventing Agent Banner from calling in an additional FBI investigative unit.\nLambert discovers that Natalie's \"new boyfriend\" was Matt Rayburn, who works security at a nearby oil drilling site. The next day, Matt's body is discovered, nude and heavily ravaged by scavenging wildlife. Lambert tells Agent Banner about his own daughter's death three years earlier, whose body was also discovered in the snow, following a party while he and his wife were away.\nAgent Banner, accompanied by Tribal Police Chief Ben Shoyo and additional officers, visit the drill site where they meet with several of the security guards. They report that Matt had stormed off a few days ago following an argument with Natalie and has not been seen since. One guard mentions that they heard about Natalie's body being found by monitoring law enforcement radio channels. Agent Banner points out that the victim's (Natalie's) name had not yet been released at that point. One of the police officers notices that the security guards are slowly surrounding Agent Banner and her team. The confrontation quickly escalates into an armed standoff as they argue over who has jurisdiction. Agent Banner defuses the situation by asserting FBI authority. She asks to see where Matt was bunking, and they resume their approach to the trailer.\nA flashback then depicts Natalie in bed with Matt in his trailer. Unexpectedly, his security colleagues barge into the trailer after a night of hard drinking. Pete, a particularly vulgar crew member, taunts them and tries to sexually assault Natalie, which provokes Matt to violence. The guards retaliate by beating Matt down while Pete rapes Natalie. Matt's attempt to fight back gives Natalie an opportunity to escape, but the group bludgeon him to death.\nBack in the present, Cory has retraced the tracks from where Matt's corpse was found back to the drilling camp. Meanwhile, Agent Banner and the police approach the drill crew's sleeping quarters. Cory, standing at a distance on a hill above the camp and looking down at the group, radios a warning to Police Chief Shoyo, but not before Agent Banner, wearing a bullet-proof vest, is hit in the chest by a shotgun blast fired through the door by Pete, wounding her. An all out firefight at point blank range ensues, in which Chief Shoyo and the other officers are killed. As the surviving security guards prepare to execute Agent Banner, Cory arrives on the scene and picks four of them off with his high caliber rifle, except for Pete, who, though wounded, flees on foot. Cory catches Pete and takes him up a mountain top. After forcing Pete's confession, Cory offers him the same chance Natalie had: a barefoot escape toward a distant road wearing light-weight clothing. Pete runs through the snow but quickly succumbs as his lungs give out from the same pulmonary hemorrhage that killed Natalie.\nCory visits Agent Banner in the hospital and praises her toughness. He later visits Martin, Natalie's bereaved father, finding him sitting outside his house wearing his \"death face\" paint and holding a handgun. Cory tells Martin that the case is closed and that the man responsible for Natalie's death went out, \"with a whimper.\" They share grief over their daughters' deaths. A title card states that missing-persons statistics are kept for every demographic group except for  Native American women, whose numbers remain unknown."}