{"_movieID": "424694", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:00:45", "summary": "\"Bohemian Rhapsody\" is a song by the British rock band Queen. It was written by Freddie Mercury for the band's 1975 album A Night at the Opera. It is a six-minute suite, consisting of several sections without a chorus: an intro, a ballad segment, an operatic passage, a hard rock part and a reflective coda. The song is a more accessible take on the 1970s progressive rock genre.Upon its release as a single, \"Bohemian Rhapsody\" became a commercial success, topping the UK Singles Chart for nine weeks and selling more than a million copies by the end of January 1976. It reached number one again in 1991 for another five weeks when the same version was re-released following Mercury's death, eventually becoming the UK's third-best-selling single of all time. It is also the only song to be the UK Christmas number one twice by the same artist. It topped the charts in several other markets as well, including Canada, Australia, New Zealand, Ireland, and The Netherlands, later becoming one of the best-selling singles of all time selling over six million copies worldwide. In the United States, the song originally peaked at number nine in 1976, but returned to the chart in 1992 after being used in the film Wayne's World and reached a new peak of number two on the Billboard Hot 100. The release of the film of the same name in 2018 resulted in renewed popularity and chart success worldwide for the song.\nAlthough critical reaction was initially mixed, \"Bohemian Rhapsody\" became Queen's most popular song and is considered one of the greatest rock songs. The single was accompanied by a promotional video, which scholars consider ground-breaking. Rolling Stone stated that its influence \"cannot be overstated, practically inventing the music video seven years before MTV went on the air.\" The Guardian ranked the music video for \"Bohemian Rhapsody\" number 31 on their list of the 50 key events in rock music history, adding it ensured \"videos would henceforth be a mandatory tool in the marketing of music\".In 2004, \"Bohemian Rhapsody\" was inducted into the Grammy Hall of Fame. Appearing in various polls as being one of the greatest songs in popular music, in 2012, the song topped the list on an ITV nationwide poll in the UK to find \"The Nation's Favourite Number One\" over 60 years of music, while Mercury's vocal performance was chosen as the greatest in rock history by readers of Rolling Stone. In December 2018, \"Bohemian Rhapsody\" became the most-streamed song from the 20th century, and the most-streamed of all classic rock songs. The number of downloads of the song and original video has exceeded 1.6 billion downloads across global on-demand streaming services."}