{"_movieID": "44718", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:53:49", "summary": "Get Low is a 2010 drama film about a Tennessee hermit in the 1930s who throws his own funeral party while still alive. It was directed by Aaron Schneider, written by Chris Provenzano and C. Gaby Mitchell, and starring Robert Duvall, Bill Murray, Sissy Spacek, Lucas Black, Gerald McRaney, Bill Cobbs, Arin Logan, Lori Beth Edgeman, Andrea Powell, Rebecca Grant, Scott Cooper and Chandler Riggs.  The motion picture was filmed entirely on location in Georgia, and support for the production was provided by the Georgia Department of Economic Development.The film premiered at the Toronto International Film Festival and is distributed by Sony Pictures Classics. For his performance, Robert Duvall was awarded the Hollywood Film Festival Award for Best Actor in October 2010. The film was released on July 30, 2010, in the United States. It received positive reviews from critics, and earned the Independent Spirit Award for Best First Feature for Schneider.", "plot": "No one really knows Felix Bush (Robert Duvall), who lives as a hermit deep in the woods. Rumors surround him, such as how he might have killed in cold blood, and that he's in league with the devil. So, the town is surprised when Felix shows up at Reverend Gus Horton's church with a fat wad of cash and requests a \"funeral party\" for himself, which Rev. Horton refuses to do. Frank Quinn (Bill Murray), the owner of the local, financially troubled, funeral parlor, covets Bush's money and agrees to advertise and help organize a funeral party. Townsfolk and others in the area are invited to come to the event and tell Felix Bush the stories they've heard about him. To ensure a good turnout, Bush insists upon a raffle, with his property as the prize; many people buy tickets. \nThings get more complicated when an old mystery is remembered, involving a local widow named Mattie Darrow (Sissy Spacek), who was Bush's girlfriend in their youth, and her deceased sister, Mary Lee Stroup (Arin Logan). With the help of a preacher who insists upon the truth from forty years ago being revealed, Bush intends to confess his shame about and complicity in a terrible occurrence.  He reveals to Mattie his affair with her married sister, Mary Lee, telling her that it was Mary Lee who was his true love, his only love. To the people gathered for his funeral party, he tells the story of how the two of them made plans to run away together and, when she didn't arrive at the agreed place, he went to her home to search for her. He discovered that her husband had attacked her with a hammer, knocking her out. The husband threw a kerosene lamp against a wall to set the house on fire and kill himself, the unconscious Mary Lee, and Bush. Bush freed himself from the attacking husband, but as his clothes caught fire, he also saw Mary Lee catch fire. As he went to put the fire out, he felt himself flying through the window, possibly pushed by the husband, and he was unable to re-enter the house to save Mary Lee.\nMattie leaves the party, the raffle is held and a winner proclaimed. Later, after everything has been packed away and everyone has gone, Mattie returns; she seems to have forgiven Bush. He dies shortly after, walking toward who he sees as Mary Lee coming down the lane toward him. \nHis actual funeral service and burial is held in a small area of his property where he has, over the years, buried his animal companions. Charlie officiates the ceremony, with Reverend Gus Horton, Buddy, his wife and child, Mattie and Frank in attendance. After a short benediction from Charlie, Mattie places a portrait of her sister, Mary Lee on Felix's casket, allowing them to be together, even if only figuratively. As his grave is filled, the mourners leave.", "cast": "Robert Duvall as Felix Bush\nSissy Spacek as Mattie Darrow\nBill Murray as Frank Quinn\nLucas Black as Buddy Robinson\nGerald McRaney as Rev. Gus Horton\nBill Cobbs as Rev. Charlie Jackson\nArin Logan as Mary Lee Stroup\nLori Beth Edgeman as Kathryn Robinson\nAndrea Powell as Bonnie\nRebecca Grant as Joan\nScott Cooper as Carl\nBlerim Destani as Gary\nChandler Riggs as Tom\nDanny Vinson as Grier\nTomasz Karolak as Orville\nAndy Stahl as Photographer"}