{"_movieID": "290637", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:55:27", "summary": "Pay the Ghost is a 2015 American supernatural horror film directed by Uli Edel and written by Dan Kay. The film stars Nicolas Cage, Sarah Wayne Callies, Veronica Ferres, Lauren Beatty, Jack Fulton, and Elizabeth Jeanne le Roux. The film was released on September 25, 2015, by RLJ Entertainment.", "plot": "A professor, Mike Lawford (Nicolas Cage) frantically searches for his son who was abducted during a Halloween parade. As nearly a year goes by,  the parents are still looking for their son and starting to hear and see their son reaching out to them from the other world—the Professor sees his son on a passing bus, but upon chasing the bus down and gaining access, his son is not there. He disembarks and notices spray painted on a building, \"pay the ghost,\" the phrase his son uttered before vanishing. He enters the building and finds homeless people living there. Unearthly screams of a woman are heard, and a blind homeless man calls for the others to mask their fires, explaining to Mike that the screams are heard every year before Halloween. Mike asks about the phrase, and is taken to a wall with more of the same phrases written on it. Engrossed by the wall and the homeless man, he does not notice the wall behind him shift into another world, and a demonic figure briefly appears behind him, then vanishes. The homeless man explains nothing, but quickly tells Mike to leave.\nHis wife later sees their son's scooter move on its own, and calls him. Later that night while pouring wine, the power in their home goes out. Mike looks out the window to see three children appear and burned at the stake, then turns and sees his apartment crowded with figures of children, standing lifeless and pale. They call a psychic to investigate. Standing in their son's room, she senses nothing, but then abruptly walks to the window, looks at the approaching storm, and says, \"It's here... it has all the children.\" The psychic is then thrown against the wall and strangled before collapsing, burn scars all over her hands. A later autopsy shows her internal organs were burned to ash.\nLater, Mike walks upstairs to his wife's room, and she addresses him with their son's voice, pleading for help and saying \"She's coming, Dad. I'm scared.\" He walks closer, and sees his wife cutting herself. Cleaning the wound, they find a symbol, which leads them to a Celtic Halloween celebration. A participant explains—the children are burning dolls to pay the ghost, so they won't be taken. In early New York, on Halloween night of 1679, because of her Celtic worship, a young widow living on the first New York settlement was burned alive with her three children by an angry mob of settlers suspecting her to be a witch, and she takes revenge every year on Halloween, when the border between the spiritual world and the physical world dissolves for a short time. Since then, every Halloween the ghost of this woman takes three living children from their parents and puts them in an alternate world. The borders solidify until next Halloween, and the children taken are able to reach out and be rescued. But if the children cannot escape this alternate world within the first year, they are stuck in this world forever.\nThe professor is able to break into this world and bring back his son as well as the other children that were taken exactly one year ago on Halloween.", "cast": "Nicolas Cage as Mike Lawford\nSarah Wayne Callies as Kristen\nVeronica Ferres as Hannah\nLyriq Bent as Detective Jordan Reynolds\nLauren Beatty as Annie Sawquin\nSam Velasquez as Professor Oak\nKalie Hunter as Ghost Annie\nJack Fulton as Charlie\nStephen MChattie as Blind Man\nSusannah Hoffmann as Jane\nCaroline Gillis as Priestess\nJanet Lo as Jai Wen\nErin Boyes as Emily (Sexy Coed)\nJuan Carlos Velis as Morales (Cop)\nAlex Mallari Jr. as EMT\nDarren Frost as Ice Cream Vendor\nMatteo Ghazni as Pablo"}