{"_movieID": "10317", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:59:53", "summary": "Our Brand Is Crisis is a 2015 American comedy-drama film directed by David Gordon Green and written by Peter Straughan. Based on the 2005 documentary film of the same name by Rachel Boynton, it is a fictionalized account of the involvement of American political campaign strategists Greenberg Carville Shrum (GCS) in the 2002 Bolivian presidential election. The film stars Sandra Bullock, Scoot McNairy, Billy Bob Thornton, Anthony Mackie, Ann Dowd and Joaquim de Almeida.\nPrincipal photography began on September 29, 2014, in New Orleans, Louisiana. George Clooney and Grant Heslov produced. The film was screened in the Special Presentations section of the 2015 Toronto International Film Festival. It was theatrically released by Warner Bros. on October 30, 2015, to mixed reviews and was a box office disappointment.\n\n", "plot": "In 2002, Bolivian politician Pedro Castillo (a fictionalized version of Gonzalo Sánchez de Lozada) hires an American political consulting firm (based on James Carville's Greenberg Carville Shrum firm) to help him win the 2002 Bolivian presidential election. The firm brings in Jane Bodine (Sandra Bullock) to manage the campaign in Bolivia. The opposition's political consultant is her nemesis, fellow American Pat Candy (Billy Bob Thornton). In Bolivia the situation is tense: the indigenous people, who are a majority in the country, are protesting for a constitutional reform, to get proper representation.\nThe American consultants, not knowing the language or the culture, are persuaded by Bodine, a burned out political strategist, to follow a strategy of smear campaigning. However, Castillo refuses to give permission for the team to do so. It is only after publishing a flyer accusing Castillo of a long ago affair (and blaming it on the opposition) does Castillo agree to smear his opponents likewise.\nIn the following months, the team exercises a strategy of declaring a crisis. They are planning on frightening the people, so they would be persuaded to vote for the unsympathetic but known Castillo rather than the younger oppositions' candidates. Also they publish photos of their enemy with Nazi war criminal Klaus Barbie in the background, so that he has to deny being a Nazi. Castillo's bus is stopped by a group of protesters who don't want the International Monetary Fund in Bolivia. Castillo promises not to invite the IMF without a referendum. Eduardo, a young volunteer of the Castillo campaign, is deeply impressed by this. His loyalty comes mostly from the fact that Castillo, who was President at the time, took Eduardo on his arm, during a rally in his town. Nevertheless, his brothers are much more skeptical about Castillo.\nDuring the final debate, Bodine cites a quote in her conversation with Candy, which he gives to Rivera in his speech, saying that \"a great man\" said it. Unfortunately the quote is actually from Joseph Goebbels, Adolf Hitler's minister of propaganda. Castillo wins the vote by a small margin. As one of his first actions, he invites the IMF, thereby breaking his promise. The deeply disappointed Eduardo visits Bodine in her hotel, who says that she is not responsible for Castillo's actions. In her eyes, her job is done.\nThe disillusioned Eduardo joins his brothers at a demonstration of people demanding change. The police arrive and the demonstration quickly turns into a riot. Bodine and her crew are with Candy on the way to the airport. All of them, except Bodine, already have jobs as political consultants in other countries. When Bodine realizes that she brought a liar into office, she leaves the car. At the demonstration she meets Eduardo. In a final clip of the TV interview she has been shown giving throughout the movie, it's revealed that she is now the head of an organization that promotes Latin American solidarity.", "cast": "Sandra Bullock as 'Calamity' Jane Bodine, a retired political consultant hired by an unpopular Bolivian politician to help him win the presidential election.\nScoot McNairy as Richard Buckley\nBilly Bob Thornton as Pat Candy, Jane's nemesis, who leads the opposition's campaign.\nAnthony Mackie as Ben\nAnn Dowd as Nell\nJoaquim de Almeida as Pedro Castillo, the Bolivian Presidential candidate who hires Jane.\nZoe Kazan as LeBlanc, a researcher who specializes in digging up dirt on candidates.\nReynaldo Pacheco as Eduardo, a young volunteer who befriends Jane.\nDominic Flores as Hugo\nLouis Arcella as Rivera\nOctavio Gómez Berríos as Pepe\nLuis Chavez as Abraham\nTilda Del Toro as Pedro Castillo's secretary"}