{"_movieID": "193610", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:04:39", "summary": "The Other Woman is a 2014 American comedy film directed by Nick Cassavetes and written by Melissa Stack. The film stars Cameron Diaz, Leslie Mann and Kate Upton. Nikolaj Coster-Waldau, Nicki Minaj and Taylor Kinney appear in supporting roles. The film follows three women—Carly (Diaz), Kate (Mann), and Amber (Upton)—who are all romantically involved with the same man, Mark (Coster-Waldau). After finding out about each other, the trio take revenge on Mark.\nDevelopment of The Other Woman began in January 2012, when 20th Century Fox hired Stack to write the script, based on the original idea from 1996 comedy The First Wives Club. Casting was done between November 2012 and June 2013. Filming began on April 29, 2013, in locations including Manhattan, Long Island, The Hamptons, Dockers Waterside Restaurant on Dune Road in Quogue, and The Bahamas, and it concluded on August 27 that year. Aaron Zigman composed the score and LBI Productions produced the film. The film was released on April 25, 2014, in the United States, and distributed worldwide by 20th Century Fox.", "plot": "Carly Whitten (Cameron Diaz), a New York attorney, has started a relationship with Mark King (Nikolaj Coster-Waldau), a man she's been having sex with for eight weeks. Carly, planning to introduce Mark to her father, Frank (Don Johnson), is upset that Mark has to go out of town on account of a flood at his Connecticut home, missing their dinner. However, she decides to go to his house to seduce him instead. She is horrified to meet Mark's wife, Kate (Leslie Mann), whom she'd originally assumed to be Mark's housekeeper. While initially hostile, both of the women befriend each other. Kate then discovers that he is still seeing another woman, who she thinks is Carly secretly continuing her previous relationship with Mark. After another fight, they discover together that Mark is seeing a third woman.\nCarly and Kate follow Mark and travel to The Hamptons, where they stay at the house of Kate’s brother, Phil (Taylor Kinney). The duo spies on Mark and find him with his mistress, Amber (Kate Upton) on the beach, and when Mark leaves for the gym the two women inform her that Mark has been cheating on all of them. \nAll three women decide to take revenge on him together. Kate spikes his smoothies with estrogen pills to swell his nipples; has their dog lick his toothbrush before soaking it in their toilet; and adds hair-removal cream into his shampoo. Carly spikes his water with a laxative to cause him to defecate heavy diarrhea. Amber uses an ugly drag queen sexual partner against him.\nIn the course of carrying out the women's vicious pranks, they also discover that Mark has been embezzling money from various startup companies that his workplace helps develop. Meanwhile, Carly begins to connect romantically and feel a bond with Phil. The women’s camaraderie begins to fall apart when Kate finds herself still in love with Mark after sleeping with him again. Carly exposes Mark's fraud before texting him, upsetting Kate and Amber.\nLater Mark goes to the Bahamas on a supposed business trip, and Kate decides to follow and expose him. When she arrives she is surprised to find Carly and Amber at the airport, who explain that Mark has been using Kate as the owner of the companies he defrauded from, which would—were his fraud to be discovered—result in Kate and Mark going to prison. Kate also finds out that Mark has been seeing yet another woman, someone he has met on this trip. This, and the possibility of her facing prison, motivates her to take action, with the help of Carly's legal expertise. In addition, Amber confides to Carly that she is seeing someone else as well.\nWhen Mark returns from vacation, he visits Carly at her office. He is then locked in a conference room by her assistant and friend, Lydia (Nicki Minaj), and is stunned to see all three women sitting in there together. They proceed to confront him with his infidelities and embezzlement. With Carly as her attorney, Kate presents divorce papers and a list of their assets. She reveals how she, as a CEO, has returned all of Mark's embezzled money to the companies he had robbed from, which saves both of them from prison time but leaves him bankrupt, much to his shock and hysterical outrage. Mark's business partner, Nick (David Thornton), then arrives and acknowledges Kate’s work while firing him.\nThe three women all applaud each other, as Mark excuses himself from them, fuming. With his furious anger and rush to leave, he smashes into an empty glass room, which drastically cuts himself and rips his clothes. Afterwards, he then actually finds his car being towed away before also receiving a departing punch in the face from Frank.\nIn the film's epilogue, Kate takes over Mark's previous job with Nick and is a CEO of several successful companies, making big profits under her honest leadership. Carly and Phil fall in love, and the couple are expecting a child. Amber and Frank are now a couple and are traveling the world together.", "cast": "Cameron Diaz as Carly Whitten, an attorney who finds out that her boyfriend Mark is already married and has another girlfriend.\nLeslie Mann as Kate King, a business educated housewife who discovers that her husband Mark is cheating on her with two women.\nKate Upton as Amber, an Amazon swimsuit supermodel, Mark's second girlfriend.\nNikolaj Coster-Waldau as Mark King, a wealthy businessman who is cheating on his wife Kate and two girlfriends Carly and Amber, at the same time.\nTaylor Kinney as Phil Hampton, Kate's brother who becomes romantically involved with Carly.\nNicki Minaj as Lydia, Carly's confidante of an assistant.\nDon Johnson as Frank Whitten, Carly's father who dates women half his age.\nDavid Thornton as Nick, Mark's business partner.\nOlivia Culpo as Raven-Haired Beauty, one of Mark's conquests in the Caribbean\nRadio Man (Craig Castaldo) as himself"}