{"_movieID": "22971", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:10:04", "summary": "Dear John is a 2010 American romantic drama-war film starring  Amanda Seyfried and  Channing Tatum. It was made by Screen Gems and was released theatrically in North America on February 5, 2010. The film was directed by Lasse Hallström, and it is an adaptation of Nicholas Sparks' 2006 novel of the same name. It follows the life of a soldier (Channing Tatum) after he falls in love with a young woman (Amanda Seyfried). They decide to exchange letters to each other after he is deployed to the war. The movie was filmed in 2009 in Charleston, South Carolina.", "plot": "While serving in the United States Army Special Forces in 2003, Staff Sergeant John Tyree is lying on the ground in Afghanistan, after being shot twice with his comrades around him. In a voice-over, he recalls a childhood trip to the US Mint and compares himself to a coin in the United States military before stating that the last thing he thought of before he blacked out was \"you.\"\nIn 2001, John is on leave in Charleston, South Carolina. He meets Savannah Curtis, a college student building homes with a group of co-eds for Habitat for Humanity while on spring break, when he fetches her purse after she drops it off of a pier into the ocean. She invites him to a bonfire party where he meets her neighbor, Tim Wheddon, and his autistic son, Alan. Over the course of two weeks, they go on several dates and fall in love. Savannah also meets John's father, who is obsessed with his coin collection. John's father takes an interest in showing Savannah his collection and what it means to him.\nSavannah mentions to John that his father may have a form of high-functioning autism known as Asperger's syndrome like Tim's son, Alan. This upsets John, who storms off. Savannah's friend Randy, who also has a crush on her, makes a comment that provokes John to fight, and he accidentally punches Tim, breaking his nose. Savannah sees the commotion, and stops speaking to John. John later apologizes to Tim, who offers to give Savannah a message. She drives to John's house to spend one last day together. On their last day, they both make a promise that they will continue their correspondence with letters. They vow to tell each other \"everything\".\nJohn and Savannah continue their relationship through letters, and John visits her in her hometown to meet her family while on a future leave. John and Savannah makes plans to start a life together after John is discharged from the army in December 2001. However, when the September 11 attacks occur, John chooses to re-enlist with his team. Their time apart start as weeks and turn into months and years. Savannah begins to spend more time with Tim, and decides that she wants to work with autistic children; she plans to build a farm and horse stables where they can enjoy the outdoors and animals. Over the next two years, John and Savannah's romance continues through their letters. One turns out to be a literal \"Dear John\" letter, in which Savannah breaks up with John, saying that, while she still loves him, she has developed feelings for someone else - she does not reveal that the \"other man\" is Tim. In a fit of anger, John burns all of Savannah's letters.\nJohn is later wounded and encouraged to return home, but he re-enlists for a second time. Four years pass, and John is informed that his father has had a stroke - instead of being deployed with the rest of his unit, John is being sent home to be with his dad. When John arrives at the hospital, he learns that his father is alive, but in grave condition. In addition to reading his father articles from coin collectors' newsletter (which Mr. Tyree has collected, along with his beloved coins, for decades), John writes a letter to his father, which he reads to him at the hospital; John's voice-over at the beginning of the film was from this letter, in which he told his father that the first thing to cross his mind after he was shot was coins, and the last thing to cross his mind before he lost consciousness was his dad. Soon afterward, his father dies.\nAfter his father's funeral, John visits Savannah at her ranch and learns that she has married Tim, abandoning her dream of a riding camp for autistic kids because of Tim's fight against lymphoma. She talks to Tim on the phone and tells John that Tim would like to see him. She takes John to the hospital, and Tim tells John that Savannah still loves John; she loves him (Tim), too, but not in the same way she loves John - and Tim can see that. John takes her back to her house and they enjoy a quiet evening together, eating dinner, and are tempted to pick up where they left off years earlier, but do not go through with their feelings and, upset, John leaves. John sells all of his father's coin collection (except the valuable mule coin that he found with his father years ago) in order to raise money to help with Tim's cancer treatment. John returns to the military, carrying the mule coin with him as a charm/talisman. He receives a letter from Savannah telling him that Tim died after two months of treatment. John, now a civilian, eventually returns home; while riding his bike in town one day, he sees Savannah at a coffee shop, and they hug.", "cast": "Channing Tatum as John Tyree\nAmanda Seyfried as Savannah Lynn Curtis\nHenry Thomas as Tim Wheddon\nRichard Jenkins as Mr. Tyree\nLuke Benward as Alan\nBraeden Reed as Young Alan\nScott Porter as Randy\nD.J. Cotrona as Noodles\nCullen Moss as Rooster\nGavin McCulley as Starks"}