{"_movieID": "62764", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:07:05", "summary": "Mirror Mirror is a 2012 American fantasy adventure film based on the fairy tale \"Snow White\" collected by the Brothers Grimm.\nIt is directed by Tarsem Singh and produced by Ryan Kavanaugh, Bernie Goldmann, Brett Ratner and Kevin Misher. It was written by Marc Klein and Jason Keller, with music by Alan Menken. It stars Lily Collins, Julia Roberts, Armie Hammer, Nathan Lane, Mare Winningham, Michael Lerner, and Sean Bean. It was released theatrically by Relativity Media on March 30, 2012.\nThe film received an Academy Award nomination for Best Costume Design. The film received generally mixed reviews from critics and it earned $183 million on an $85 million budget. Mirror Mirror was released on DVD and Blu-ray by 20th Century Fox Home Entertainment on June 26, 2012.", "plot": "Snow White's widowed father the King (Sean Bean) marries an evil sorceress named Clementianna (Julia Roberts), the most beautiful woman in the land. One day, the king leaves to fight a great evil that has invaded the land, but never returns. Clementianna rules in his absence and keeps Snow White in the palace\nTen years later Snow White (Lily Collins) desires to see her kingdom Defying Clementianna's orders, she leaves the palace Arriving at a forest she meets Prince Andrew Alcott Armie Hammer who has been robbed by Dwarf Germanic mythology dwarves She and the prince are smitten with each other but go their separate ways Snow White arrives in the town and finds the town folk are destitute due to Queen Clementianna's greed\nMeanwhile, Prince Alcott finds his way to the palace. Clementianna realizes he comes from a wealthy kingdom and throws a ball to woo him. Snow White secretly attends the ball, planning to ask the prince to help her restore the kingdom. Queen Clementianna notices them dancing and orders her manservant Brighton (Nathan Lane) to take the princess into the forest and feed her to the Beast (Frank Welker) that lives there Going Mad Brighton takes Snow White to the forest, but he releases her. Snow White flees the Beast and collapses at the door to the Seven Dwarves' house. She wakes up to find the dwarves Grimm (Danny Woodburn) Butcher (Martin Klebba) Wolf (Sebastian Saraceno) Napoleon (Jordan Prentice) Half Pint (Mark Povinelli) Grub (Joe Gnoffo) and Chuck (Ronald Lee Clark)\nQueen Clementianna levies another tax on the townfolk to pay for the parties she throws for Prince Alcott Brighton collects the taxesAnd Didn’t see Snow White but on the way back to the palace, the dwarves rob him. Snow White sneaks away to return the money. The townspeople and the Town Magistrate (Alex Ivanovici) are overjoyed to have their money back and Snow White lets the Dwarves take credit for it, earning them the people's loyalty.\nClementianna informs Alcott that Snow White is dead. When the Prince finds out that the bandits have robbed Brighton, he goes after them, unaware of the awful things the Queen has done. In the forest, Alcott discovers that Snow White is alive and in league with the bandits. Each believing the other to be in the wrong, Snow White and Alcott duel. Alcott returns to the Palace defeated and informs the Queen that Snow White is alive.\nClementianna goes to her Mirror House, within which lives her reflection, the Mirror Queen (Lisa Roberts Gillan). Clementianna has the Mirror Queen temporarily turn Brighton into a cockroach, and requests a love potion so she can make the prince fall in love with her. The potion turns out to be a 'puppy love' potion and the prince becomes devoted to her like a puppy dog. Under this spell the prince agrees to marry her. She then uses dark magic to create two giant wooden puppets in the forest and uses them to attack Snow White and the Dwarves Snow White cuts the strings of the puppets and breaks the spell\nSnow White and the Dwarves crash the royal wedding and capture the Prince before Clementianna and Brighton arrive. When Queen Clementianna arrives the Baron and the other Aristocrats had their clothes stolen, because of her inability to handle bandits and for lying about Snow White's death they demanded that Clementianna be deposed Back in the forest the still cursed Prince wishes to return to the Queen Snow White kisses Alcott and the spell is broken\nSnow White encounters Clementianna who sends the Beast after her Prince Alcott tries to save Snow White but the Beast captures her However the Beast hesitates in killing her and Snow White sees that it wears a necklace with a moon charm on it similar to the one the Queen wears which the princess noticed just before she was taken to be eaten by the Beast She cuts the chain with her father's dagger and the Beast suddenly becomes engulfed in light Clementianna begins to age, and the Mirror Queen says this is her punishment for using dark magic The Beast turns out to be Snow White's father who has no memory of the last ten years        \nGrateful to Alcott for his assistance the king agrees to let him marry Snow White as Brighton starts a relationship with jillian To Accept His Hand In Marriage To marry Jillian After Snow White accepts the Magistrate's gift a crone in a hooded robe appears and offers Snow White an apple as a wedding gift At first Snow White accepts the gift As she is about to bite it she realizes that the crone is Clementianna and Jillian Snow White pulls out her knife and cuts a piece from the apple and gives it to Clementianna who reluctantly accepts it The Mirror House declares that it was Snow White's story along and shatters The Dwarves meanwhile all live happily ever after\nDuring the credits the cast led by Snow White engage in a Bollywood style musical number", "cast": "Lily Collins as Snow White\nJulia Roberts as Queen Clementianna, Snow White's evil stepmother.\nArmie Hammer as Prince Andrew Alcott, the prince of a distant kingdom.\nNathan Lane as Brighton, the Queen's executive bootlicker.\nMare Winningham as Margaret, a baker who was Snow White's friend since childhood.\nMichael Lerner as The Baron, an elite member of the kingdom who is often recommended for Queen Clementianna to get engaged to.\nSean Bean as The King, the father of Snow White, who went missing.\nDanny Woodburn as Grimm, the leader of the Seven Dwarfs. He is named after the Brothers Grimm.\nMartin Klebba as Butcher, a dwarf who used to work as a butcher.\nSebastian Saraceno as Wolf, a dwarf in a wolf-skin cape.\nJordan Prentice as Napoleon, a dwarf who wears a hat similar to Napoleon's.\nMark Povinelli as Half Pint, a dwarf who has a crush on Snow White.\nJoe Gnoffo as Grub, a dwarf who is always eating.\nRonald Lee Clark as Chuckles, a dwarf who chuckles a lot.\nLisa Roberts Gillan as Mirror Queen, the reflection of Queen Clementianna who is much wiser, kinder, and somewhat younger than her.\nRobert Emms as Charles Renbock, Prince Alcott's faithful valet and confidant.\nAlex Ivanovici as Town Magistrate\nFrank Welker as the voice of the Beast, a chimeric creature with a lion/dog-like head, the antlers of a deer, chicken leg-like arms, the wings of an eagle, and the body and tail of a snake with a tail-claw at the end of the tail.\nFrank Welker also provides the vocal effects of the giant puppets."}