{"_movieID": "87101", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:46:21", "summary": "Terminator Genisys is a 2015 American science fiction action film directed by Alan Taylor and written by Laeta Kalogridis and Patrick Lussier. The film reboots the Terminator film series, retaking the story's basics of the original film but in another direction. It stars Arnold Schwarzenegger, who reprises his role as the Terminator, alongside Jason Clarke, Emilia Clarke, Jai Courtney, J. K. Simmons, Dayo Okeniyi, Matt Smith, Courtney B. Vance, and Lee Byung-hun. It follows Kyle Reese, a soldier in a post-apocalyptic future with a war against the machines led by Skynet, who is sent from 2029 to 1984 by John Connor, leader of the Human Resistance, to protect his mother Sarah. When Kyle arrives in the past, he discovers that the timeline has been altered and Sarah has been raised by a reprogrammed Terminator.\nMegan Ellison and her production company Annapurna Pictures acquired the franchise rights in May 2011. The following year, production of another installment in the series was set up in collaboration with Skydance Productions, owned by Ellison's brother David. The Ellisons consulted Terminator creator James Cameron in the hope of returning to the spirit of The Terminator (1984) and its sequel Terminator 2: Judgment Day (1991). Principal photography was primarily in New Orleans, with some in the on-screen setting of San Francisco. Six companies handled the film's visual effects, with its prosthetic make-up and animatronics created by Legacy Effects.\nThe film was released by Paramount Pictures on July 1, 2015, in RealD 3D and IMAX 3D. It was not well-received by critics, who found its story and performances unsatisfactory, although Schwarzenegger's return to the franchise was praised. Terminator Genisys grossed over $440 million worldwide, making it the second-highest-grossing film of the franchise and of Schwarzenegger's career, behind Terminator 2: Judgment Day.Though Terminator Genisys was originally planned as the first film of a new trilogy, it was announced in 2017 that the next film, Terminator: Dark Fate, would serve as a direct sequel to Terminator 2: Judgment Day, and reboot the series once again following the return of creative control to James Cameron.", "plot": "In 2029, Human Resistance leader John Connor launches a final offensive against Skynet, an artificial general intelligence system. Before the Resistance can triumph, Skynet activates a time machine and sends a T-800 (Model 101) Terminator back to May 12, 1984, to kill John's mother Sarah. John's right-hand man, Kyle Reese, volunteers to travel back in time to protect her. As Kyle floats in the machine's magnetic field, he sees John being attacked by another Resistance soldier and has visions from his childhood about Sarah Connor.\nWhen it arrives in Los Angeles 1984, Skynet's T-800 is disabled by Sarah and \"Pops\", a reprogrammed T-800 sent to protect Sarah when she was nine years old. Kyle arrives shortly afterwards, and is intercepted by a T-1000. Sarah and Pops join Kyle and destroy the T-1000 with acid; she and Pops reveal that they have constructed a makeshift time machine similar to Skynet's, and Sarah plans to travel to 1997 (the year Skynet becomes self-aware). Realizing that the timeline has been altered, Kyle is convinced that the future has changed because of the warning he received in his childhood vision and persuades Sarah to travel to 2017 to stop Skynet.\nIn 2017, Kyle and Sarah materialize in the middle of a busy San Francisco highway and are apprehended by city police. While they are treated for injuries, Sarah and Kyle learn that Skynet is called \"Genisys\" – a soon-to-be-unveiled global operating system which is embraced by the public. John suddenly appears and rescues Sarah and Kyle; Pops arrives and unexpectedly shoots John, revealing that John is an advanced T-3000 Terminator. While Kyle was traveling back in time a T-5000, the physical embodiment of Skynet disguised as a member of the Resistance, attacked John and transformed him into a nanocyte infiltrator. John, tasked with ensuring Cyberdyne Systems' survival, traveled back in time to assist them with the development of Genisys and hence securing Skynet and its machines' rise.\nA day before Skynet's worldwide attack, Sarah, Kyle and Pops escape to a safe house and make final preparations to destroy Cyberdyne's Genisys mainframe. They head toward Cyberdyne's headquarters with the T-3000 in close pursuit. During an airborne chase, Pops dive-bombs into the T-3000's helicopter and causes it to crash. The T-3000 survives the crash and enters the Cyberdyne complex, where it advances the countdown from 13 hours to 15 minutes. Kyle, Sarah and Pops plant bombs at key points in the facility while holding off the T-3000.\nIn a final battle, Pops traps the T-3000 in the magnetic field of a prototypical time machine. Both are destroyed, but just before the explosion the remains of Pops are flung out of the apparatus into a nearby experimental vat of mimetic polyalloy. Kyle and Sarah reach a bunker beneath the facility and the explosion sets off the bombs, preventing Genisys from coming online. Pops appears, upgraded with mimetic polyalloy components similar to that of the T-1000, and helps them escape from the debris.\nThe trio travels to Kyle's childhood home, where Kyle tells his younger self about Genisys and instructs him to repeat the warning to himself, securing the trio's arrival from 1984. Sarah and Kyle finally kiss and they along with Pops drive off into the countryside. A mid-credits scene reveals that the system core of Genisys, located in a protected subterranean chamber, has survived the explosion.", "cast": "Arnold Schwarzenegger as T-800 \"Model 101\" / Guardian: A reprogrammed T-800 (Model 101) Terminator, also nicknamed \"Pops\" or \"The Guardian\", who is Sarah's protector and mentor.\nBrett Azar stood in on-set as the body double for the Young Guardian in 1973, and Guardian's doppelgänger (the T-800 Terminator from the first film who time-traveled to 1984).\nJason Clarke as John Connor: The leader of the Resistance and Kyle Reese's mentor, who was attacked by T-5000 and turned into a nanorobotic prototypical T-3000 Terminator composed of machine phase matter.\nEmilia Clarke as Sarah Connor: \"Pops'\" protégée and, in one timeline, destined to be John Connor's mother.Willa Taylor as Young Sarah\nJai Courtney as Kyle Reese: A Resistance soldier and John Connor's protégé. In one timeline, he is destined to be John Connor's father.\nBryant Prince as Young Kyle\nJ. K. Simmons as O'Brien: An alcoholic police detective from the San Francisco Police Department who investigates Terminators and time travelers.Wayne Bastrup as Young O'Brien: A LAPD beat cop in 1984 who witnesses the encounter between Kyle Reese and the T-1000.\nDayo Okeniyi as Danny Dyson: The son of Miles Dyson and Cyberdyne Systems' president; he co-creates the operating system Genisys with John Connor, unwittingly substituting his father's role as Skynet's creator.\nMatthew Smith as Alex: An advanced T-5000 Terminator who embodies Skynet. Alex's appearance is also used by Skynet as a holographic avatar in 2017.Ian Etheridge as Skynet, age 10.\nNolan Gross as Skynet, age 12–14.\nSeth Meriwether as Skynet, age 18.\nCourtney B. Vance as Miles Dyson: Cyberdyne Systems' CEO, who, in the original timeline, was one of Skynet's creators; he funds his company's Genisys project.\nMichael Gladis as Lieutenant Matias: A SFPD police lieutenant and O'Brien's superior.\nSandrine Holt as Detective Cheung: A SFPD police detective and O'Brien's colleague.\nByung-Hun Lee as Cop / T-1000: A shapeshifting prototypical Terminator composed of mimetic polyalloy."}