{"_movieID": "239678", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:00:52", "summary": "This Is Where I Leave You is a 2014 American comedy-drama film directed by Shawn Levy. It is based on the book of the same name by Jonathan Tropper, who also wrote the film's screenplay.  The film was released on September 19, 2014.\n\n", "plot": "Judd Altman (Jason Bateman) finds out his wife Quinn (Abigail Spencer) has been having an affair with his boss Wade (Dax Shepard) for a year. After he moves out, his sister Wendy (Tina Fey) calls to tell him their father Mort has died. The Altmans gather for the funeral at their mother's home where they reconnect with Wendy's ex-boyfriend Horry Callen (Timothy Olyphant), who suffered a brain injury years before, and his mother Linda (Debra Monk). Wendy is unhappy because her workaholic husband Barry (Aaron Lazar) neglects her. Judd reunites with his older brother Paul (Corey Stoll) and Paul's wife Annie (Kathryn Hahn), who had once been Judd's girlfriend. The youngest brother, Phillip (Adam Driver), arrives late with his new, older girlfriend Tracy (Connie Britton).\nThe Altmans' mother Hilary (Jane Fonda) tells her children their father, though an atheist, wanted them to sit shiva, presided over by the Altmans' childhood friend, rabbi Charles \"Boner\" Grodner (Ben Schwartz). Wendy is the only one in the family who knows about Judd's marital problems. Judd also reunites with Penny Moore (Rose Byrne), a woman who had a crush on him in high school. \nDuring a family gathering, Wendy drunkenly badgers Judd to tell the truth about Quinn. Phillip laments being seen as the family screw-up, while flirting with another woman in front of Tracy. Judd blurts out that Quinn was cheating on him and he plans to divorce her. Quinn shows up the next day and reveals she's pregnant with Judd's child. Phillip finds out about the pregnancy and reveals this to the family.\nJudd spends the night with Penny, and then spends the day with her. Wendy visits Horry in his backyard, and expresses remorse over causing the accident that caused Horry's brain injury. The family goes to temple, where the brothers sneak out to smoke joints Judd found in his father's suit. Annie, upset that she and Paul haven't conceived, tries to seduce Judd in hopes that he will impregnate her, but he rejects her. A few days later, after Barry leaves for a conference, Wendy sleeps with Horry, with whom she is still in love. \nQuinn calls Judd out of fear that she is having a miscarriage, and he admits to Penny that Quinn is pregnant. Judd gets to the hospital to be with Quinn where Wade also shows up. The baby, a girl, is fine. Judd and Wade get into a fight in the waiting room. When Philip and Wendy arrive, Wendy punches Wade in the face, and Judd gets a group of young men who witnessed the confrontation to flip Wade’s car. As he leaves, Wade tells Judd he's not ready to be a step-dad and leaves Quinn.\nThe next day, Tracy talks with Judd and decides to break up with Phillip. Judd drives to Penny's house to talk to her, but she won't listen. Later, Annie apologizes to Judd, tearfully confessing that she is frustrated that she can't get pregnant. Judd replies that she should focus on what she and Paul do have. Paul sees Judd hugging her and assumes Judd is hitting on her. Paul attacks Judd as Tracy leaves Phillip, resulting in the three brothers fighting. Hilary silences everyone by kissing Linda passionately. She informs them that she and Linda are in love and that they had Mort's blessing. She admits the shiva was her idea, in order to come out to her children and get them to reconnect. The siblings are shocked, but see their mother is happy and accept it. \nOne night, when the power goes out in the basement, Judd attempts to fix the fusebox, only to receive an electric shock and be knocked out. He dreams of a childhood memory of falling off his bike and of Mort comforting him. Judd wakes up crying, finally mourning his father. \nJudd apologizes to Penny for not being honest and promises to call her. Wendy leaves with her two children, tearing up as she again leaves Horry. The brothers reconcile and Paul offers Phillip a job at their father's sporting goods store. Judd quietly slips out, steals Phillip's Porsche, and drives up the highway to Maine, where he had dreamed of going.", "cast": "Jason Bateman as Judd Altman, the middle boy of the four Altman siblings. He is married to Quinn, whom he recently caught cheating on him with his boss.\nTina Fey as Wendy Altman, one of the four siblings; she is a responsible mother who is married to Barry and has two kids. She is the ex-girlfriend of her childhood friend Horry.\nJane Fonda as Hilary Altman, the widowed mother of Judd, Phillip, Wendy and Paul. She is a celebrity psychologist and writer.\nAdam Driver as Phillip Altman, the youngest of the four siblings; the playboy of the family who thinks he is an entrepreneur.\nRose Byrne as Penny Moore, who had a crush on Judd in high school.  He claims that he did not date her at the time because she was just a kid.\nCorey Stoll as Paul Altman, the oldest of the four siblings; the no-nonsense brother who is responsible for the family business. He is married to Annie.\nKathryn Hahn as Annie Altman, Paul's wife and Judd's ex-girlfriend. She and Paul have been trying to conceive.\nConnie Britton as Tracy Sullivan, Phillip's girlfriend and therapist.\nTimothy Olyphant as Horry Callen, Wendy's ex-boyfriend, who lives with his mother across the street from the Altman family home due to a brain injury sustained from a car accident.\nDax Shepard as Wade Beaufort, a shock jock radio personality and Judd's former boss.\nDebra Monk as Linda Callen, the Altmans' neighbor, mother of Horry, and Hilary's best friend/romantic partner.\nAbigail Spencer as Quinn Altman, Judd's estranged wife.\nBen Schwartz as Rabbi Charles \"Boner\" Grodner, the family’s young rabbi."}