{"_movieID": "254128", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:56:54", "summary": "Grand Theft Auto: San Andreas is an action-adventure video game developed by Rockstar North and published by Rockstar Games. It was released on 26 October 2004 for PlayStation 2 and on 7 June 2005 for Microsoft Windows and Xbox. A high definition remastered version received a physical release for both Xbox 360 and PlayStation 3 on 30 June 2015 and 1 December 2015, respectively. It is the seventh title in the Grand Theft Auto series, and the first main entry since 2002's Grand Theft Auto: Vice City. It was released on the same day as the handheld game Grand Theft Auto Advance for Game Boy Advance. On 8 June 2018, the game was added to the Xbox One Backward Compatible library.\nGrand Theft Auto: San Andreas is played from a third-person perspective in an open world environment, allowing the player to interact with the game world at their leisure. The game is set within the fictional U.S. state of San Andreas, which is heavily based on California and Nevada. The state of San Andreas consists of three metropolitan cities: Los Santos, based on Los Angeles; San Fierro, based on San Francisco; and Las Venturas, based on Las Vegas. The single-player story follows Carl \"CJ\" Johnson, an ex-gangbanger who returns home to Los Santos from Liberty City after his mother's murder. Carl finds his old friends and family in disarray, and over the course of the game, he attempts to re-establish his old gang, clashes with corrupt cops, and gradually unravels the truth behind his mother's murder. The plot is based on multiple real-life events in Los Angeles, including the rivalry between the Bloods, Crips, and Hispanic street gangs, the 1980s crack epidemic, the LAPD Rampart scandal, and the 1992 Los Angeles riots.\nConsidered one of the sixth generation of video gaming's most notable titles, and by many reviewers to be one of the greatest video games ever made, San Andreas received rave reviews by many critics who praised the music, story and gameplay. It became the best-selling video game of 2004, as well as one of the best-selling video games of all time. It has sold over 27.5 million copies worldwide as of 2011; it remains the best-selling PlayStation 2 game of all time. The game, like its predecessors, is cited as a landmark in video games for its far-reaching influence within the industry. However, the violence and sexual content of San Andreas has been the source of much public concern and controversy. In particular, a player-made software patch, dubbed the \"Hot Coffee mod\", unlocked a previously hidden sexual scene. The next main entry in the series, Grand Theft Auto IV, was released in April 2008. San Andreas has been ported to various other platforms and services, such as OS X, Xbox Live, PlayStation Network and mobile devices (iOS, Android, Windows Phone and Fire OS).", "plot": "In 1992, Carl \"CJ\" Johnson, a former gangbanger for the Los Santos-based Grove Street Families, returns home to Los Santos from Liberty City after learning about the murder of his mother, Beverly in a drive-by shooting. Upon his arrival, CJ is intercepted by a group of corrupt police officers led by Frank Tenpenny. Tenpenny coerces CJ into working for him by threatening to frame CJ for the murder of an Internal Affairs officer, whose death had been orchestrated by Tenpenny.\nAfter Tenpenny releases him, CJ reunites with his surviving family at Beverly's funeral: Big brother Sweet, and his sister, Kendl. Sweet angrily confronts CJ about his long absence from Los Santos and blames CJ for the Grove Street gang's declining fortunes. However, CJ wins Sweet's grudging acceptance by promising to stay and help rebuild the gang. The two brothers work closely with their friends, Big Smoke and Ryder, to reunite the divided Grove Street Families and reconquer their old turf from their rivals, the Ballas. During the gang war, CJ is occasionally sidetracked by orders from Officer Tenpenny, who forces CJ to assist him with the black market and drug racketeering. Later, Sweet asks CJ to investigate Kendl's new boyfriend Cesar, a high-ranking member of the Varrios Los Aztecas. Despite his preconceptions, CJ discovers that Cesar genuinely cares about Kendl, and the two men become friends.\nWith Grove Street stronger than ever, Sweet plans to ambush a major group of Ballas and end the war. However, before CJ can get to the fight, Cesar calls him for a meetup. During the rendezvous, Cesar and CJ witness Big Smoke, Ryder, Tenpenny, and the Ballas working together to hide the car used in the shooting that resulted in Beverly's death, which infuriates CJ. It is revealed at this point that Big Smoke and Ryder had arranged the shooting, and were working with Tenpenny and the Ballas to sell out Grove Street. CJ rushes to warn Sweet, but is too late, as Sweet is severely wounded from the Ballas counter-ambush. Tenpenny shows up with Los Santos PD backup and arrests them both. With Grove Street's leadership decapitated, Big Smoke and Ryder openly declare their alliance with the Ballas. They take over Los Santos and flood its streets with drugs, and with Tenpenny protecting them from police interference, they appear unstoppable.\nHowever, Tenpenny decides to get more use out of CJ. Instead of throwing CJ in prison with Sweet, Tenpenny drives him into the rural country outside Los Santos and threatens to arrange Sweet's death in prison if CJ doesn't co-operate. Exiled in the countryside, CJ is forced to carry out favours for C.R.A.S.H, under threat of Sweet being transferred to a cell block where Ballas affiliates are housed. He also works with Cesar's cousin Catalina to make money by carrying out several heists in the area. He also befriends a hippie named The Truth and a blind Chinese-American Triad leader named Wu Zi Mu. After winning the deed to a garage in San Fierro in a race against Catalina and her new boyfriend, CJ goes there with The Truth, Cesar, and Kendl to get it up and running so they can make a living. While in San Fierro, CJ crosses paths with the Loco Syndicate, Big Smoke and Ryder's drug connection. CJ infiltrates the organization and identifies its leader, Mike Toreno. CJ kills Ryder and the other Loco Syndicate leaders, Jizzy B and T-Bone Mendez, and shoots down Toreno's helicopter. CJ then destroys the Syndicate's drug factory.\nSoon after, CJ is called by an unknown man using a digitally distorted voice, who asks CJ to meet him at a ranch in the desert. There, CJ finds Mike Toreno alive, thus revealing Toreno as the caller. Toreno reveals that he is an undercover government agent spying on criminal operations and enlists CJ's help in several shady operations in exchange for Sweet's freedom. Meanwhile, CJ travels to Las Venturas, where Wu Zi Mu invites him to become a partner in the Four Dragons Casino, where the organization is facing problems from the mob families that control the city. Seeking to wrest control of Venturas from them, CJ helps Wu Zi Mu plot a robbery of the mob's casino and gains the mob's trust through various jobs for the mob boss, Salvatore Leone, leader of the Leone Family Mafia back in Liberty City. Eventually, the heist is carried out successfully, earning the Triad a place of power in Las Venturas, although causing the mob to detest CJ. CJ also encounters rapper Madd Dogg, from whom he stole a rhyme book to help rapper OG Loc become a name in the business. After rescuing Madd Dogg from a suicide attempt, he asks CJ to be his manager once he returns from rehab.\nTenpenny, fearing his arrest is inevitable, tasks his partner Eddie Pulaski with killing CJ and another police officer: Jimmy Hernandez, whom Tenpenny found out was informing on them to Internal Affairs. After Tenpenny leaves the scene, Pulaski forces CJ to dig his own grave. Just as CJ finishes and is about to be executed, a severely injured Hernandez manages to attack Pulaski - who shoots him dead in response. Pulaski then flees, but CJ pursues and kills him.\nSoon afterwards, Madd Dogg returns from rehab - prompting CJ to return to Los Santos to get his music career restarted. Toreno contacts CJ for one last favour, and finally has Sweet released from prison. Now wealthy and successful, CJ attempts to cut Sweet in on his businesses, but Sweet becomes angry that he ran away and let their home be taken over by rival gang members and drug dealers to make his fortune. While CJ helps Sweet once again kill the rival gangs and retake Grove Street to rebuild the Grove Street Families, Tenpenny is arrested and tried for felonies that he has been charged with, but the charges are dropped due to lack of evidence, prompting a citywide riot. CJ helps Cesar regain control over the barrio and also regain territory for his gang, to have enough power to obtain knowledge of Big Smoke's whereabouts.\nSweet soon learns that Big Smoke is hiding in a fortified crack den in the city, and he and CJ set out to confront him. CJ enters the building alone, fighting his way to the top floor and facing Smoke. CJ attempts to reason with Smoke, but the latter engages CJ in a gunfight. CJ defeats him, and a mortally wounded Smoke confesses that he betrayed the GSF to gain more power and money before dying. Tenpenny then arrives and holds CJ at gunpoint, before stealing Big Smoke's money, intending to use it to leave the city. Tenpenny escapes, and CJ and Sweet pursue him. During the pursuit, Tenpenny loses control of a fire truck that he was using as a getaway vehicle, driving off the bridge over the Grove Street cul-de-sac and crashing at the entrance to it. CJ and his friends watch as a fatally wounded Tenpenny crawls from the wreckage and succumbs to his injuries.\nIn the aftermath, CJ and his family along with Cesar celebrate while Madd Dogg and his friends visit them. During the celebrations, CJ leaves to check the neighbourhood and its surroundings."}