{"_movieID": "15764", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:31:22", "summary": "Sophie's Choice is a 1982 American drama film directed by Alan J. Pakula, who adapted William Styron's novel of the same name. Meryl Streep stars as Sophie, a Polish immigrant who shares a boarding house in Brooklyn with her tempestuous lover, Nathan (Kevin Kline in his feature film debut), and a young writer, Stingo (Peter MacNicol).\nStreep's performance was acclaimed, and she received the Academy Award for Best Actress. The film was nominated for Best Cinematography (Néstor Almendros), Best Costume Design (Albert Wolsky), Best Music (Marvin Hamlisch), and Best Adapted Screenplay (Alan J. Pakula).\nBritish company ITC Entertainment produced the film, and Universal Pictures distributed and released it.", "plot": "In 1947, Stingo moves to Brooklyn to write a novel, and is befriended by Sophie Zawistowski, a Polish immigrant, and her emotionally unstable lover, Nathan Landau. Nathan is constantly jealous, and when he is in one of his violent mood swings, he convinces himself that Sophie is unfaithful to him, and he abuses and harasses her. A flashback shows how Nathan first met Sophie after her immigration to the U.S. when she nearly died due to anemia.\nSophie tells Stingo that before she came to the U.S., her husband and father were killed in a German work camp, and that she was interned in the Auschwitz concentration camp. Stingo later learns from a college professor that Sophie's father was a Nazi sympathizer. When Stingo confronts Sophie with this, she admits the truth and tells him about her war-time lover, Józef, who lived with his half-sister, Wanda, and was a leader in the Resistance. Wanda tried to convince Sophie to translate some stolen Gestapo documents, but Sophie declined, fearing she might endanger her children. Two weeks later, Józef was murdered by the Gestapo, and Sophie was arrested and sent to Auschwitz with her children.\nNathan tells Sophie and Stingo that he is doing groundbreaking research at a pharmaceutical company, but Nathan's physician brother tells Stingo that Nathan is a paranoid schizophrenic, and that all of the schools that Nathan attended were \"expensive funny farms\". Nathan is not a biologist as he claims. He does have a job at a pharmaceutical firm, but it is in the library, which his brother obtained for him, and he only occasionally assists with research.\nAfter Nathan believes Sophie has betrayed him again, he calls Sophie and Stingo on the telephone and fires a gun in a violent rage. Sophie and Stingo flee to a hotel. She reveals to him that, upon arrival at Auschwitz, she was forced to choose which one of her two children would be gassed and which would proceed to the labor camp. To avoid having both children killed, she chose her son, Jan, to be sent to the children's camp, and her daughter, Eva, to be sent to her death.\nSophie and Stingo have sex, but while Stingo is sleeping, Sophie returns to Nathan. Sophie and Nathan commit suicide by taking cyanide. Stingo recites the poem \"Ample Make This Bed\" by Emily Dickinson — the American poet that Sophie was fond of reading.\nStingo moves to a small farm that his father recently inherited in southern Virginia to finish writing his novel."}