{"_movieID": "246202", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:53:39", "summary": "The Five(ish) Doctors Reboot is a 2013 comedy spoof and homage to the British science fiction television programme Doctor Who. It debuted on the BBC Red Button service after the broadcast of \"The Day of the Doctor\", the official 50th anniversary special. The programme was written and directed by Peter Davison, who stars alongside fellow former Doctor actors Sylvester McCoy, Colin Baker, and Paul McGann. It features appearances from more recent stars of the show David Tennant, Matt Smith, Jenna Coleman, and John Barrowman, as well as Doctor Who executive producer Steven Moffat, his predecessor Russell T Davies, and numerous others connected to the programme,  all playing themselves in a more or less parodic manner.\nThe plot focuses on the fictionalised, disgruntled Davison, Baker and McCoy, who become embroiled in misadventures as they attempt to sneak onto the set of the official Doctor Who 50th anniversary special.\nThe Five(ish) Doctors Reboot was nominated for the 2014 Hugo Award for Best Dramatic Presentation (Short Form), (along with \"The Day of the Doctor\", An Adventure in Space and Time, \"The Name of the Doctor\", and episodes of Game of Thrones and Orphan Black).", "plot": "On Christmas Day 2012, former Fifth Doctor actor Peter Davison watches \"The Snowmen\" with his children. They remark on the upcoming 50th anniversary special and speculate as to whether Davison will be invited to return or if it will simply feature the most recent two Doctors, David Tennant and Matt Smith. Davison has a dream where he is invited back and given special treatment, ending with a vision of Janet Fielding telling him that none of the old Doctors will be asked to return. Over the next couple of months, he, Sixth Doctor actor Colin Baker and Seventh Doctor actor Sylvester McCoy desperately await a call inviting them to star in the special. A disillusioned Davison attends a convention, where he is unrecognised by the hotel receptionist and asked by fans if he has heard about appearing in the episode. He calls current Doctor Who executive producer Steven Moffat, who is more interested in playing with his action figures and deletes his messages from Davison, as well as Baker and McCoy who have also called about appearing (McCoy mentions appearing in The Hobbit and Baker mentions doing I'm a Celebrity...Get Me Out of Here!).\nAt another convention appearance, Davison, Baker and McCoy all eye Eighth Doctor actor Paul McGann suspiciously. They discuss inviting Fourth Doctor actor Tom Baker to help them get involved, but when they call him he is revealed to be stuck in the Time Vortex again. McGann, having received no Doctor Who news from his agent, says he wants in on their plans – \"work permitting, obviously.\" After the convention, McCoy returns to New Zealand to continue filming The Hobbit, but decides to return to England after director Peter Jackson leaves him sitting around doing nothing. Davison's scheme is revealed to involve the three of them (McGann has work commitments) protesting with picket signs outside the BBC Television Centre in London. Meanwhile, back in New Zealand, McCoy's disappearance has ruined a scene with Ian McKellen, though McKellen himself says to Jackson that the scene might be \"a slight improvement\" without McCoy. In London, a passing John Barrowman informs the three actors that Doctor Who filming now takes place in Cardiff. Barrowman abandons his secret wife and children to drive the trio there, singing show tunes all the way and giving them each a copy of one of his CDs.\nThe former Doctors enter the Doctor Who Experience, steal their old costumes, and with the help of Davison's son-in-law David Tennant are able to infiltrate Roath Lock and get onto the set of the 50th anniversary special, \"The Day of the Doctor\". They are initially unsure how to proceed with getting in the special, but end up taking the place of the three Dalek operators after locking them in their room. After a close call with some security guards which leads to the trio having to hide back on the set, they manage to escape and catch a bus back to London. Davison receives a call and ignores it; it turns out to be former Doctor Who executive producer Russell T Davies asking for a part in Davison's project, as he has also been left out of the 50th celebrations.\nIn the coda, Moffat deletes the scene where the former Doctors play Daleks. However, when Moffat's editor reviews another scene, he sees the former Doctors evade the on-set security guards by hiding under shrouds in the undergallery set; the editor conceals this from Moffat, ensuring that the former Doctors appear in the special after all."}