{"_movieID": "413362", "source": "wikipedia", "created_utc_dt": "09/14/2019, 13:05:48", "summary": "Roman J. Israel, Esq. is a 2017 American legal drama film written and directed by Dan Gilroy. The film stars Denzel Washington, Colin Farrell, and Carmen Ejogo, and centers on the life of an idealistic defense lawyer (Washington) who finds himself in a tumultuous series of events that lead to a personal crisis and the necessity for extreme action.\nRoman J. Israel, Esq. premiered at the 2017 Toronto International Film Festival on September 9, 2017, and began a limited release in the United States by Sony Pictures Releasing on November 17, 2017. The film went wide on November 22, 2017, and grossed just $13 million against its $22 million budget. The film received mixed reviews from critics but Washington was widely praised for his performance, for which he received nominations for the Academy Award for Best Actor, the Golden Globe Award for Best Actor – Motion Picture Drama, and the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Leading Role.", "plot": "Roman J. Israel is a lawyer working for $500 a week at a small law firm in Los Angeles. In his two-partner office, Israel is responsible for preparing briefs, often focusing on the civil rights of their defendants, while William Jackson, the firm's owner and a well-respected professor, focuses on the courtroom appearances that Israel struggles with. Israel has spent years developing a brief that he believes will bring social reform to the unfair use of plea-bargaining to induce guilty pleas in the justice system. Though short on interpersonal skills, Israel is gifted with a phenomenal memory as well as strong personal convictions on the meaning of justice, which he has pursued at the expense of family.\nJackson suffers a fatal heart attack. The firm is broke and will close, all to be handled by Jackson’s former student, George Pierce. Pierce, who greatly admired Jackson and is impressed by Israel’s legal mind (“worth $500 an hour”), offers a job at his own large firm. Israel rejects this offer, believing that Pierce is simply a greedy lawyer. Israel meets Maya during a job interview at a local activist network. The interview does not go well, but Maya asks him to speak at an upcoming meeting organizing a protest.\nIsrael reluctantly takes a job with Pierce. Israel is a poor fit, clashing with senior partner Jesse Salinas after Israel mockingly laughs at a joke Salinas makes about battered women. After attempting to interest Pierce in his brief to change the legal system, Israel is disappointed when he is instead assigned by Pierce to handle clients. \nIsrael is assigned Derrell Ellerbee, a young man arrested for murder. Ellerbee tells Israel that he is willing to tell police the whereabouts of the actual shooter, longtime criminal Carter Johnson, and will testify against him. Israel goes behind Salinas' back to negotiate a plea deal with the district attorney, but the prosecutor rejects his offer and hangs up on Israel after he insults her unsympathetic counter-offer to his bargain. No deal is struck and Ellerbee is murdered as a snitch.\nIsrael's mishandling of Ellerbee's case leads to trouble for the firm and Pierce berates him for his insubordination. That evening Israel is mugged and beaten by a homeless man he attempted to help. Israel becomes downcast and cynical, illegally using the information he received from Ellerbee to anonymously collect the $100,000 reward for Johnson's location. Israel indulges in luxuries he had previously eschewed.\nPierce apologizes to Israel, revealing that the death of Jackson and his observations of Israel’s dedication to justice has touched him. He reforms his firm to add a new focus on pro-bono cases, headed by Israel. Pierce offers to work with Israel on the legal brief for plea reform, but Israel's new materialistic outlook prevents him from enjoying the changes he has inspired.\nMaya calls Israel to ask him out on a date, where she shares some of her struggles with idealism and thanks Israel for his inspiration about progressive lawyering and advocacy, but he appears unmoved.\nPierce calls Israel to meet a new client arrested for murder, who turns out to be Carter Johnson. At the jailhouse, Johnson accuses Israel of divulging privileged communications to collect the reward. Having accepted that he will spend the rest of his life in prison, Johnson's only goal is to torment Israel with the threat of jail time or even death. Israel finally suffers a breakdown in which he becomes a law unto himself becoming both the Lawyer and the defendant in one.  After judging his own actions as unlawful as the defendant, he renounces his greedy, self-centered worldview.\nIsrael returns the reward (with a promise to repay the $5,547.27 he spent), reconciles with Maya and Pierce and tries to motivate them to pursue their inner sense of justice. He tells Pierce that he is turning himself in to the police for his crime, then starts walking to a nearby station, but is shot and killed by one of Johnson's henchmen.\nIn the aftermath, Maya is seen to be renewed in her activism efforts, while Pierce files Israel’s massive brief in Federal Court, in both their names, intent on continuing Israel’s efforts to reform the justice system.", "cast": "Denzel Washington as Roman J. Israel\nColin Farrell as George Pierce\nCarmen Ejogo as Maya Alston\nShelley Hennig as Olivia Reed\nLynda Gravatt as Vernita Wells\nAmanda Warren as Lynn Jackson (niece)\nHugo Armstrong as Fritz Molinar\nSam Gilroy as Connor Novick\nTony Plana as Jesse Salinas\nDeRon Horton as Derrell Ellerbee\nAmari Cheatom as Carter Johnson"}