{"_movieID": "283366", "source": "wikipedia", "created_utc_dt": "09/14/2019, 12:51:58", "summary": "Miss Peregrine's Home for Peculiar Children is a 2016 American fantasy film directed by Tim Burton and written by Jane Goldman, based on the 2011 novel of the same name by Ransom Riggs. The film stars Eva Green, Asa Butterfield, Chris O'Dowd, Allison Janney, Rupert Everett, Terence Stamp, Ella Purnell, Judi Dench, and Samuel L. Jackson.\nFilming began in February 2015 in London and the Tampa Bay Area. The film premiered at Fantastic Fest in Austin, Texas, on September 25, 2016, and was theatrically released in the United States on September 30, 2016, by 20th Century Fox. It received mixed reviews and grossed $296 million worldwide against a production budget of $110 million.", "plot": "Abe Portman has told stories to his grandson Jake about his childhood surviving World War II, battling monsters and living at a secret home for children on the island of Cairnholm, Wales. According to Abe, the home's children and their headmistress Miss Alma Peregrine possess paranormal abilities and are known as \"Peculiars\". When Jake turns 16, he responds to a phone call from Abe and finds him dying with his eyes removed. Abe tells him to go to \"the loop of September 3, 1943\". After Abe dies, Jake glimpses a monster, like the ones described in Abe's stories, hiding in the forest.\nJake's parents arrange psychiatric check-ups, and following advice from his psychiatrist, Dr. Golan, and the clue of a letter from Miss Peregrine to Abe, Jake travels to Cairnholm with his father to investigate the children's home. He learns that it was destroyed in a Luftwaffe raid. Upon visiting the ruined house, he finds the children there alive and well. They take him through a portal in a cave and he emerges in the year 1943 when the house was still intact. Miss Peregrine greets him and explains that she belongs to a class of female Peculiars called \"Ymbrynes\" who can shapeshift into birds –in her case, a peregrine falcon – and manipulate time. To avoid persecution, she and the children hide from the outside world in a time loop she created, accessible only to Peculiars and set to September 3, 1943. This time loop allows them to live the same day repeatedly and avoid aging as long as they stay inside it.\nJake is introduced to other children, including aerokinetic Emma Bloom, to whom he is attracted. Jake learns that he himself is a Peculiar and, like Abe, has the ability to see the invisible monsters from Abe's stories, \"Hollowgast\" (or \"Hollows\"). Hollows are invisible disfigured Peculiar scientists that resulted from killing an Ymbryne in a failed experiment to become immortal by harvesting her powers. Led by shapeshifter Mr. Barron, they hunt Peculiars to consume their eyeballs, which allows them to become \"Wights\", Hollows with regained visible human forms, but with milky-white eyes.\nA wounded Ymbryne named Miss Avocet arrives and explains that Barron and the Hollows and Wights raided her January 2016 time loop at Blackpool, England, killed her children, and are trying to repeat Barron's failed experiment by using more Ymbrynes. Worried, Miss Peregrine decides to move out with her children and Miss Avocet.\nJake returns to 2016 and confirms a Hollow is on the island after another victim is killed, so he returns to the cave to warn his friends, followed by a disguised Barron. Barron reveals that he was about to gain Miss Peregrine's loop from Abe, but his hungry Hollow companion Mr. Malthus killed him before he could. Barron then posed as Dr. Golan and encouraged Jake to go to the island so Barron could find the loop.\nUsing Jake as a hostage at the children's home, Barron forces Miss Peregrine to trap herself in bird form and takes her to Blackpool, leaving Jake, the children, and Miss Avocet as prey for Malthus. Malthus arrives and kills Miss Avocet, but Jake and the children escape just as the Luftwaffe bomb is about to destroy the house. Without Miss Peregrine to reset it, the house is destroyed and the loop closes, leaving Jake and the children stuck in 1943, but safe from Malthus, who is killed in the explosion.\nRescuing a sunken ocean liner, they travel to Blackpool and enter its January 2016 loop, fight Barron's Wight and Hollow allies, and rescue Miss Peregrine and other captive Ymbrynes. Barron disguises himself as Jake, hoping to confuse the children who have come to finish him off. When the last remaining Hollow arrives, it mistakes Barron for Jake and kills him, and is in turn killed by Jake.\nBefore the time loop closes, Emma tells Jake that because of Miss Peregrine's injury in the battle, the children will live in 1943 and that they will handle the Hollows. Jake says goodbye to them as they exit and return to their ship in 1943, while he stays in his present in 2016. He travels back to Florida and relates his adventures to his grandfather, who is alive and well, as Barron's death in the beginning of 2016 erased his presence in Florida later on. Abe gives Jake a map of international time loops and money from different countries and urges him to seek out Emma.\nAfter months of searching and traveling, Jake reaches Emma and the children in 1943. Emma and Jake confess their feelings, and start traveling along with Miss Peregrine and the other children, searching for a new home."}