{"birthday": "1969-01-18", "known_for_department": "Acting", "deathday": null, "id": 543530, "name": "Dave Bautista", "also_known_as": ["David Michael Bautista Jr.", "Batista", "Dave Batista", "Deacon Batista", "David Bautista", "Leviathan", "Дэйв Батиста", "데이브 바티스타", "David Michael \"Dave\" Bautista Jr.", "Ντέιβ Μπαουτίστα"], "gender": 2, "biography": "An American actor and former professional wrestler, mixed martial artist, and bodybuilder.\n\nFrom 2000–2010 and 2013–2014, he was signed to WWE under the ring name Batista, where he became a six-time world champion, winning WWE's World Heavyweight Championship four times and the WWE Championship twice. He holds the record for the longest reign as World Heavyweight Champion at 282 days, and has also won the World Tag Team Championship three times (twice with Ric Flair and once with John Cena) and the WWE Tag Team Championship once (with Rey Mysterio). He was the winner of the 2005 Royal Rumble match and went on to headline WrestleMania 21, one of the top five highest-grossing pay-per-view events in professional wrestling history. When Bautista returned to WWE in 2014, he won the 2014 Royal Rumble match, after which he headlined WrestleMania XXX.\n\nIn August 2012, Bautista signed a contract with Classic Entertainment & Sports to fight in mixed martial arts. He won his MMA debut on October 6, 2012, defeating Vince Lucero via TKO in the first round. He was representing the Philippines during the fight. Bautista first entered the world of acting in 2006. As an actor, Bautista has starred in The Man with the Iron Fists (2012), Riddick (2013), Guardians of the Galaxy (2014), the 24th James Bond film, Spectre (2015), L.A. Slasher (2015), and in the 2016 Kickboxer reboot, Kickboxer: Vengeance. Bautista is set to reprise his role as Drax in Guardians of the Galaxy Vol. 2 (2017) and Avengers: Infinity War (2018). He has also appeared in several direct-to-video films since 2009.", "popularity": 7.831, "place_of_birth": "Washington, DC, USA", "profile_path": "/oZDL1VprkUEFhOtG5WcVjudj5ks.jpg", "adult": false, "imdb_id": "nm1176985", "homepage": null, "images": [{"iso_639_1": null, "width": 370, "height": 555, "vote_count": 3, "vote_average": 5.194, "file_path": "/21bkLWMVWkSWy0KHrvJrfZFJ94V.jpg", "aspect_ratio": 0.66666666666667}, {"iso_639_1": null, "width": 1000, "height": 1500, "vote_count": 7, "vote_average": 5.326, "file_path": "/oZDL1VprkUEFhOtG5WcVjudj5ks.jpg", "aspect_ratio": 0.66666666666667}, {"iso_639_1": null, "width": 1000, "height": 1500, "vote_count": 1, "vote_average": 5.312, "file_path": "/3vA8kfDZGIj71G8LV9N1J9YTrLv.jpg", "aspect_ratio": 0.66666666666667}, {"iso_639_1": null, "width": 1000, "height": 1500, "vote_count": 0, "vote_average": 0, "file_path": "/nXTLsPnaLz1lOhWmkBLGcYl2i6u.jpg", "aspect_ratio": 0.66666666666667}, {"iso_639_1": null, "width": 820, "height": 1230, "vote_count": 4, "vote_average": 5.252, "file_path": "/mR7ZdtykA2MvT6ZCZtM4pjXW1gA.jpg", "aspect_ratio": 0.66666666666667}, {"iso_639_1": null, "width": 354, "height": 531, "vote_count": 4, "vote_average": 5.252, "file_path": "/uwPQIsUdI4lEsrtqPqEgqeIpRo9.jpg", "aspect_ratio": 0.66666666666667}], "cast": [{"character": "Big Ronnie 'B.R.'", "credit_id": "52fe44ea9251416c9102130b", "poster_path": "/kqkL6OH8lCp5w4ggxMraZGOjswd.jpg", "id": 32845, "video": false, "vote_count": 27, "adult": false, "backdrop_path": "/cjHaDK1IUmm8Rbd9k2U9fPjJttx.jpg", "genre_ids": [28, 80], "original_language": "en", "original_title": "Wrong Side of Town", "popularity": 3.413, "title": "Wrong Side of Town", "vote_average": 5.3, "overview": "Ex-Navy Seal Bobby Kalinowski lives a quiet, peaceful life as a landscape architect in an LA suburb with his wife Dawn and 16 year old daughter Brianna. Tonight they are invited out for an evening on the town by new neighbors clay and Elise Freeman to a happening club downtown. Little did they know that this would be the start of a life or death ordeal for the group.", "release_date": "2010-02-23"}, {"character": "Ray", "credit_id": "52fe4794c3a368484e0cec13", "poster_path": "/mme4WFIa9gGKgjqOdGAGjDCGUYT.jpg", "id": 68472, "video": false, "vote_count": 27, "adult": false, "backdrop_path": "/grzi7tR0PYtSUfRAQTU75DXnWXD.jpg", "genre_ids": [28], "original_language": "en", "original_title": "House of the Rising Sun", "popularity": 3.077, "title": "House of the Rising Sun", "vote_average": 4.3, "overview": "Ray, an ex-cop, is starting a new life looking to stay out of trouble. One evening, on Ray's watch, the nightclub he works for is robbed and the owner's son is shot dead. As his criminal past is exposed Ray hunts for the person responsible for this crime in an effort to clear his own name. Ray must get to the bottom of this as both the mob and cops start to close in on him as their target suspect.", "release_date": "2011-07-19"}, {"character": "Batista", "credit_id": "52fe48acc3a36847f81738f9", "poster_path": "/bSQ3cSnSSbkFWzivDslRekNvB31.jpg", "id": 54728, "video": true, "vote_count": 20, "adult": false, "backdrop_path": "/84OZ2sFgKlQnlO2g4eLfTXbFR9i.jpg", "genre_ids": [28], "original_language": "en", "original_title": "WWE Wrestlemania XXVI", "popularity": 2.117, "title": "WWE Wrestlemania XXVI", "vote_average": 6.6, "overview": "WrestleMania XXVI was the twenty-sixth annual WrestleMania PPV and was presented by Slim Jim. It took place on March 28, 2010 at the University of Phoenix Stadium in Glendale, Arizona. The first main event was a No DQ, no count-out match that featured The Undertaker versus Shawn Michaels. The second was a singles match for the WWE Championship that saw Batista defend the championship against John Cena. The third was a singles match for the World Heavyweight Championship featured the champion, Chris Jericho, defending against Edge for the title. Featured matches on the undercard included a 10-Diva tag team match, Bret Hart versus Vince McMahon in a No Holds Barred match, Rey Mysterio versus CM Punk, Triple H versus Sheamus, the sixth annual Money in the Bank ladder match, a Triple Threat match between Randy Orton, Ted DiBiase, and Cody Rhodes, and a WWE Tag Team Championship match between Big Show and The Miz, against John Morrison and R-Truth.", "release_date": "2010-03-28"}, {"character": "Argomael", "credit_id": "52fe498bc3a368484e130ba9", "release_date": "2012-01-17", "vote_count": 166, "video": false, "adult": false, "vote_average": 4.1, "title": "The Scorpion King 3: Battle for Redemption", "genre_ids": [28, 12, 18, 14], "original_language": "en", "original_title": "The Scorpion King 3: Battle for Redemption", "popularity": 10.398, "id": 78049, "backdrop_path": "/yZybOa1rTXyB7mzDpiYL96nubTM.jpg", "overview": "Since his triumphant rise to power in the original blockbuster \"The Scorpion King\", Mathayus' kingdom has fallen and he's lost his queen to plague. Now an assassin for hire, he must defend a kingdom from an evil tyrant and his ghost warriors for the chance to regain the power and glory he once knew. Starring Ron Perlman (\"Hellboy\") and Billy Zane (\"Titanic\"), and featuring 6-time WWE champion Dave Bautista and UFC star Kimbo Slice, \"The Scorpion King 3: Battle for Redemption\" takes \"The Mummy\" phenomenon to an all-new level of epic action and non-stop adventure.", "poster_path": "/i4BjV6dMPaCMiWCf86hPUg0BF9Z.jpg"}, {"character": "Diaz", "credit_id": "52fe49c39251416c910b8141", "poster_path": "/duoN6oNGp1emHkkhlTcY76Wz2ED.jpg", "id": 87421, "video": false, "vote_count": 2935, "adult": false, "backdrop_path": "/mLbjD5xyrjLzVviSd8l37rxfWBo.jpg", "genre_ids": [878, 28, 53], "original_language": "en", "original_title": "Riddick", "popularity": 17.117, "title": "Riddick", "vote_average": 6.2, "overview": "Betrayed by his own kind and left for dead on a desolate planet, Riddick fights for survival against alien predators and becomes more powerful and dangerous than ever before. Soon bounty hunters from throughout the galaxy descend on Riddick only to find themselves pawns in his greater scheme for revenge. With his enemies right where he wants them, Riddick unleashes a vicious attack of vengeance before returning to his home planet of Furya to save it from destruction.", "release_date": "2013-09-06"}, {"character": "Brass Body", "credit_id": "52fe49df9251416c750d62cb", "release_date": "2012-11-02", "vote_count": 604, "video": false, "adult": false, "vote_average": 5.3, "title": "The Man with the Iron Fists", "genre_ids": [28], "original_language": "en", "original_title": "The Man with the Iron Fists", "popularity": 11.302, "id": 97430, "backdrop_path": "/uSZweG7S50fe8vqMHnJHl8H6S33.jpg", "overview": "In feudal China, a blacksmith who makes weapons for a small village is put in the position where he must defend himself and his fellow villagers.", "poster_path": "/rYnPhYmG4qyWSXRmVUlzmlA0RFg.jpg"}, {"character": "Batista", "credit_id": "52fe4a8ac3a368484e159337", "poster_path": "/oEcRquvNIFvtZGqIgYJwVCfjJAc.jpg", "id": 122965, "video": true, "vote_count": 5, "adult": false, "backdrop_path": "/de7TpTsUTPYeoMOE9O7YYiCFoYY.jpg", "genre_ids": [28], "original_language": "en", "original_title": "WWE Royal Rumble 2010", "popularity": 2.034, "title": "WWE Royal Rumble 2010", "vote_average": 7, "overview": "Royal Rumble (2010) was the twenty-third annual Royal RumblePPV. It took place on January 31, 2010 at the Philips Arena in Atlanta, Georgia. As has been customary since 1993, the Royal Rumble match winner received a match at that year's WrestleMania, for his choice at either the WWE Championship, the World Heavyweight Championship, or the ECW Championship.\r The main event was the annual 30-competitor Royal Rumble match which featured wrestlers from all three brands. The primary match on the Raw brand was for the WWE Championship between champion Sheamus and Randy Orton. The primary match on the SmackDown brand was between The Undertaker and Rey Mysterio for the World Heavyweight Championship. The featured match on the ECW brand was between Christian and Ezekiel Jackson for the ECW championship.", "release_date": "2010-01-31"}, {"character": "Batista", "credit_id": "52fe4b699251416c910d9879", "poster_path": "/tarPAYsH6JCNvb8SfvTsGyRkJ9j.jpg", "id": 154719, "video": true, "vote_count": 6, "adult": false, "backdrop_path": "/t9kzKGTc1eZ4zHB7BNcKoZTmqkS.jpg", "genre_ids": [28], "original_language": "en", "original_title": "WWE Elimination Chamber 2010", "popularity": 1.214, "title": "WWE Elimination Chamber 2010", "vote_average": 6.6, "overview": "Elimination Chamber (2010) was a PPV which took place on February 21, 2010 at the Scottrade Center in St. Louis, Missouri. It was the first Elimination Chamber event.  The concept of the event was that the two main event matches would occur in an Elimination Chamber. Each match featured six competitors: the defending champion and five challengers. Sheamus defended the WWE Championship against Triple H, Ted DiBiase, Randy Orton, John Cena, and Kofi Kingston in the Raw Elimination Chamber. In the SmackDown Elimination Chamber match, The Undertaker defended the World Heavyweight Championship against Chris Jericho, John Morrison, Rey Mysterio, CM Punk and R-Truth. On the undercard, Drew McIntyre defended the WWE Intercontinental Championship against Kane, The Miz defended the WWE United States Championship against Montel Vontavious Porter, and Maryse and Gail Kim competed against Team Lay-Cool (Layla and Michelle McCool) in an interbrand Divas tag team match.", "release_date": "2010-02-21"}, {"character": "Batista", "credit_id": "52fe4bbd9251416c910e437f", "poster_path": "/gqomp6L0Pi2cPuT8IeWGK4NnLdw.jpg", "id": 157287, "video": true, "vote_count": 5, "adult": false, "backdrop_path": "/zHts5wkGfK6lvhaQFE5Kp5OfRXS.jpg", "genre_ids": [28], "original_language": "en", "original_title": "WWE TLC: Tables Ladders & Chairs 2009", "popularity": 1.344, "title": "WWE TLC: Tables Ladders & Chairs 2009", "vote_average": 5.4, "overview": "TLC: Tables, Ladders &amp; Chairs (2009) was the first annual TLC: Tables, Ladders &amp; Chairs PPV. It took place on December 13, 2009 at the AT&amp;T Center in San Antonio, Texas.  Each main match contained a stipulation utilizing tables, ladders and chairs as legal weapons. The primary matches included Christian challenging Shelton Benjamin in a Ladder match for the ECW Championship, Sheamus challenging John Cena in a Tables match for the WWE Championship, the reigning World Heavyweight Champion, The Undertaker, defending his title against Batista in a Chair match and the main event, where Chris Jericho and The Big Show defended against D-Generation X (Triple H and Shawn Michaels) in a Tables, Ladders, and Chairs match for the Unified WWE Tag Team Championship. Other matches in the card included John Morrison versus Drew McIntyre for the WWE Intercontinental Championship, Michelle McCool versus Mickie James for the WWE Women's Championship and Randy Orton versus Kofi Kingston.", "release_date": "2009-12-13"}, {"character": "Drax the Destroyer", "credit_id": "52fe4bd5c3a36847f8215d05", "release_date": "2014-08-01", "vote_count": 18699, "video": false, "adult": false, "vote_average": 7.9, "title": "Guardians of the Galaxy", "genre_ids": [28, 12, 878], "original_language": "en", "original_title": "Guardians of the Galaxy", "popularity": 51.748, "id": 118340, "backdrop_path": "/kHex2XdOmGtazk1VfJjp4bl7BIc.jpg", "overview": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.", "poster_path": "/y31QB9kn3XSudA15tV7UWQ9XLuW.jpg"}, {"character": "Batista", "credit_id": "52fe4dbfc3a368484e1fb31b", "poster_path": "/27TdukfWHTkvXttQNDBLfDWKG6i.jpg", "id": 213198, "video": true, "vote_count": 7, "adult": false, "backdrop_path": "/aUeNqznp0aDwyOc6WMpYRly8Ncq.jpg", "genre_ids": [28, 18], "original_language": "en", "original_title": "WWE Over the Limit 2010", "popularity": 1.371, "title": "WWE Over the Limit 2010", "vote_average": 6.4, "overview": "Over the Limit (2010) was a PPV presented by Axe Hair, which took place on May 23, 2010 at the Joe Louis Arena in Detroit, Michigan. It was the first event promoted under the Over the Limit name.  In the main event from the Raw brand, John Cena faced Batista for the WWE Championship, while The Big Show versus World Heavyweight Champion Jack Swagger was the main event from the SmackDown brand. Matches on the undercard included Randy Orton against Edge, CM Punk facing Rey Mysterio, and Drew McIntyre defending the WWE Intercontinental Championship against Kofi Kingston. Other championships defended at the event were the WWE Divas Championship and the Unified WWE Tag Team Championship.  The event drew 197,000 pay-per-view buys, and was attended live by 11,000 people. Five wrestlers sustained legitimate injuries during the course of the show.", "release_date": "2010-05-23"}, {"character": "Batista", "credit_id": "52fe4e5ec3a368484e21cf6d", "poster_path": "/jFqTUziGqG9cb9jLRgIjS8vrlYp.jpg", "id": 219099, "video": true, "vote_count": 3, "adult": false, "backdrop_path": "/qH6iPwwNZJOTFMd2PAkZPRYuCAs.jpg", "genre_ids": [28, 18], "original_language": "en", "original_title": "WWE Extreme Rules 2009", "popularity": 1.681, "title": "WWE Extreme Rules 2009", "vote_average": 7.3, "overview": "Extreme Rules (2009) was a PPV which took place on June 7, 2009 at the New Orleans Arena in New Orleans, Louisiana and was presented by AT&amp;T. It was the first event promoted under the Extreme Rules name, and initially noted by WWE to be a direct continuation of the One Night Stand chronology. It featured talent from the Raw, SmackDown, and ECW brands.  The main event was a Ladder match for the World Heavyweight Championship, which saw Jeff Hardy challenge reigning champion Edge. There were also two other highly-publicized matches; the first was a steel cage match for the WWE Championship between the champion Randy Orton and Batista, as well as a submission match between The Big Show and John Cena. Featured matches on the undercard included a No Holds Barred match between Rey Mysterio and Chris Jericho for the WWE Intercontinental Championship, CM Punk versus Umaga in a Samoan Strap match and a Triple Threat Hardcore match for the ECW Championship.", "release_date": "2009-06-07"}, {"character": "Batista", "credit_id": "52fe4e5fc3a368484e21d20b", "poster_path": "/ul6ydcovZyzkCmUTzmeYcXwJxL.jpg", "id": 219146, "video": true, "vote_count": 4, "adult": false, "backdrop_path": "/Aj21D787s2IcwLO1ZZ32a3GRRUM.jpg", "genre_ids": [28], "original_language": "en", "original_title": "WWE Hell in a Cell 2009", "popularity": 1.699, "title": "WWE Hell in a Cell 2009", "vote_average": 5.5, "overview": "Hell in a Cell (2009) was a PPV presented by Ubisoft's Teenage Mutant Ninja Turtles: Smash-Up, which took place on October 4, 2009 at the Prudential Center in Newark, New Jersey. It was the first Hell in a Cell event.  Each of the main event matches were contested in a Hell in a Cell match. The main events of the evening included D-Generation X's Triple H and Shawn Michaels versus The Legacy's Cody Rhodes and Ted DiBiase, Randy Orton challenging John Cena for the WWE Championship, and The Undertaker challenging CM Punk for the World Heavyweight Championship.  Other matches featured on the show were John Morrison defending the WWE Intercontinental Championship against Dolph Ziggler, Mickie James versus Alicia Fox for the WWE Divas Championship, Unified WWE Tag Team Champions Chris Jericho and The Big Show versus Batista and Rey Mysterio, Drew McIntyre facing R-Truth, and a Triple Threat match for the WWE United States Championship among Kofi Kingston, The Miz and Jack Swagger.", "release_date": "2009-10-04"}, {"character": "Batista", "credit_id": "52fe4e5fc3a368484e21d27f", "poster_path": "/1atf3Kn7PLwLBEv9Z5LM3E7App3.jpg", "id": 219151, "video": true, "vote_count": 2, "adult": false, "backdrop_path": "/8F55HKakAA3WCTilfLuczLhoJUS.jpg", "genre_ids": [28], "original_language": "en", "original_title": "WWE Bragging Rights 2009", "popularity": 0.764, "title": "WWE Bragging Rights 2009", "vote_average": 8, "overview": "Bragging Rights (2009) was a PPV presented by THQ's WWE Smackdown vs Raw 2010. It took place on October 25, 2009 at the Mellon Arena in Pittsburgh, Pennsylvania. It was the first Bragging Rights event.  A Bragging Rights trophy was awarded to the show that won the most matches. Matches included Raw's US Champion The Miz versus SmackDown's IC Champion John Morrison, SmackDown's team of Michelle, Beth and Natalya versus Raw's team of Melina, Kelly and Gail, and Raw's team of Triple H, Shawn Michaels, Big Show, Cody Rhodes, Jack Swagger, Kofi Kingston and Mark Henry versus SmackDown's team of Jericho, Kane, R-Truth, Matt Hardy, Finlay, Tyson Kidd and David Hart Smith.  The show also contained three world championship matches including the main event where Randy Orton defended against John Cena in an Anything Goes Iron Man match for the WWE Championship, and The Undertaker defended against CM Punk, Rey Mysterio and Batista in a Fatal Four-Way match for the World Heavyweight Championship.", "release_date": "2009-10-25"}, {"character": "Batista", "credit_id": "52fe4e5fc3a368484e21d425", "poster_path": "/9KbpaSeCAQAB5muaHeKmP98hpq4.jpg", "id": 219157, "video": true, "vote_count": 2, "adult": false, "backdrop_path": "/cZEzrsEJELn0LtIpbt3pWYUbXP6.jpg", "genre_ids": [28], "original_language": "en", "original_title": "WWE Survivor Series 2009", "popularity": 1.547, "title": "WWE Survivor Series 2009", "vote_average": 6, "overview": "Survivor Series (2009) was a PPV which took place on November 22, 2009 at the Verizon Center in Washington, D.C.. It was the 23rd annual Survivor Series event.  There were two matches that were deemed the main events of the program. The first was the triple threat match featuring The Undertaker defending the World Heavyweight Championship against the Unified WWE Tag Team Champions Chris Jericho and The Big Show. This was also followed by the another triple threat main event match with John Cena defending the WWE Championship against Triple H and Shawn Michaels. Four matches comprised the undercard of the event. The first was the team of WWE US Champion The Miz, Sheamus, Drew McIntyre, Jack Swagger, and Dolph Ziggler versus WWE IC Champion John Morrison, Matt Hardy, Shelton Benjamin, Finlay, and Evan Bourne. This was later followed by Kofi Kingston leading the team of Christian, MVP, Mark Henry, and R-Truth versus Randy Orton, CM Punk, William Regal, Cody Rhodes, and Ted DiBiase.", "release_date": "2009-11-22"}, {"character": "Batista", "credit_id": "52fe4e60c3a368484e21d769", "poster_path": "/7ZrnMmbJZFZBGKqzQSxsl5dLVZN.jpg", "id": 219205, "video": true, "vote_count": 3, "adult": false, "backdrop_path": "/qZXJEalSdVEzWEepzrsigz3ZCqT.jpg", "genre_ids": [28], "original_language": "en", "original_title": "WWE Extreme Rules 2010", "popularity": 1.849, "title": "WWE Extreme Rules 2010", "vote_average": 7, "overview": "Extreme Rules (2010) was a PPV presented by KFC, which took place on April 25, 2010 at the 1st Mariner Arena in Baltimore, Maryland. It was the second event promoted under the Extreme Rules name. There were eight matches scheduled on the event's card, all of which featured an 'extreme' stipulation, with no regular singles matches on the card.  The main event was a Last Man Standing match between WWE Champion John Cena and Batista. The World Heavyweight Championship was defended by Jack Swagger against Randy Orton in an Extreme Rules match. Edge fought Jericho in a Steel Cage, Sheamus challenged Triple H to a street fight, CM Punk fought Rey Mysterio in a Hair Match, and a Gauntlet match took place for a shot at a Tag Team Title match.", "release_date": "2010-04-25"}, {"character": "Batista", "credit_id": "52fe4e6ac3a368484e21f791", "poster_path": "/tgFOjlkxTWeTUCzPvh7TgqolkKE.jpg", "id": 219616, "video": true, "vote_count": 2, "adult": false, "backdrop_path": "/eS6No8V37xPG0jIeO3ltHARwZrl.jpg", "genre_ids": [99], "original_language": "en", "original_title": "WWE: Rey Mysterio - The Life of a Masked Man", "popularity": 0.6, "title": "WWE: Rey Mysterio - The Life of a Masked Man", "vote_average": 8, "overview": "For the first time ever, Rey Mysterio sits down and reviews his historic career, reflecting on his greatest matches and moments. This all-new interview features exclusive and candid comments from the Ultimate Underdog on his Sports Entertainment path through ECW, WCW, and WWE; his rivalries with Eddie Guerrero, Chris Jericho, CM Punk; his thoughts on battling men almost twice his size, and his emotional Cruiserweight, Intercontinental, and World Championship runs.", "release_date": "2012-02-24"}, {"character": "Batista", "credit_id": "53002aa3c3a3683fcf1da56f", "poster_path": "/sGTWx6mPKnlzDdOIUudsBxnjiOf.jpg", "id": 255813, "video": true, "vote_count": 9, "adult": false, "backdrop_path": "/r4xSZlTqh7pb3gJR2HR9k6ID1qw.jpg", "genre_ids": [28], "original_language": "en", "original_title": "WWE Elimination Chamber 2014", "popularity": 2.301, "title": "WWE Elimination Chamber 2014", "vote_average": 7.1, "overview": "Elimination Chamber was an upcoming professional wrestling PPV event produced by WWE. The fifth annual Elimination Chamber event took place on February 23, 2014, at the Target Center in Minneapolis. The main event was the Elimination Chamber match, in which Randy Orton defended the WWE World Heavyweight Championship against John Cena, Sheamus, Antonio Cesaro, Christian, and Daniel Bryan. The secondary main event was a 6-Man Tag team match between The Shield and the Wyatt Family. This match was considered the highlight of the PPV and received glowing reviews from several media sites. Also on the card was Alberto Del Rio vs Batista, AJ Lee defending the Divas Belt against Cameron, Titus O'Neil vs Darren Young, The New Age Outlaws defending the Tag Team Championships against The Usos, and Big E defending the Intercontinental Belt against Jack Swagger.", "release_date": "2014-02-23"}, {"character": "Michael Knox", "credit_id": "58049f1a925141265a00573d", "release_date": "2018-09-07", "vote_count": 127, "video": false, "adult": false, "vote_average": 6, "title": "Final Score", "genre_ids": [28], "original_language": "en", "original_title": "Final Score", "popularity": 12.771, "id": 421658, "backdrop_path": "/doZknFSxaF0lfEDmfPRZFNsfIIJ.jpg", "overview": "When a stadium is seized by a group of heavily armed criminals during a major sporting event, an ex-soldier must use all his military skills to save both the daughter of a fallen comrade and the huge crowd unaware of the danger.", "poster_path": "/jawqGBrUOHyXSyT7HknITUnL98.jpg"}, {"character": "Trent DeRosa", "credit_id": "58e2877d925141283500f3b1", "release_date": "2018-06-29", "vote_count": 588, "video": false, "adult": false, "vote_average": 4.7, "title": "Escape Plan 2: Hades", "genre_ids": [28], "original_language": "en", "original_title": "Escape Plan 2: Hades", "popularity": 30.906, "id": 440471, "backdrop_path": "/xIAaN3AQqaJiN5RJ0WsmBady8Hq.jpg", "overview": "Ray Breslin manages an elite team of security specialists trained in the art of breaking people out of the world's most impenetrable prisons. When his most trusted operative, Shu Ren, is kidnapped and disappears inside the most elaborate prison ever built, Ray must track him down with the help of some of his former friends.", "poster_path": "/Aqhl55vpzxNFqVfc2DpedUsR39L.jpg"}, {"character": "Batista", "credit_id": "5342e2a4c3a36814ff003b79", "poster_path": "/nXjmM18BV3CCwfhDV1wYE404SJ0.jpg", "id": 257747, "video": true, "vote_count": 28, "adult": false, "backdrop_path": "/U8h2TSmJPODqp6HAHV7AG6mKJV.jpg", "genre_ids": [28, 18], "original_language": "en", "original_title": "WWE WrestleMania XXX", "popularity": 6.717, "title": "WWE WrestleMania XXX", "vote_average": 8, "overview": "WrestleMania XXX was the 30th annual WrestleMania professional wrestling PPV event produced by WWE to be held, on April 6, 2014, at the Mercedes-Benz Superdome in New Orleans, Louisiana. The event was the first WrestleMania to be held in the state of Louisiana. This was also the first WWE pay-per-view to broadcast live on the WWE Network service.", "release_date": "2014-04-06"}, {"character": "Batista", "credit_id": "5370da74c3a3687e6c0030ae", "poster_path": "/i2pKz8EjQwH4ylPPCJ2NIP7D5we.jpg", "id": 269506, "video": true, "vote_count": 6, "adult": false, "backdrop_path": "/7h3oKsgpUETZF25oY3ZzrBp5sy2.jpg", "genre_ids": [28, 53], "original_language": "en", "original_title": "WWE Payback 2014", "popularity": 1.794, "title": "WWE Payback 2014", "vote_average": 7.3, "overview": "Payback (2014) took place on June 1, 2014 at the Allstate Arena in Rosemont, Illinois. It was the second event under the Payback chronology, with the event having originated in 2013.  There were two main events, with the first main event featuring John Cena versus Bray Wyatt in a Last Man Standing Match. The second match faced Evolution (Triple H, Randy Orton and Batista) against The Shield (Roman Reigns, Seth Rollins and Dean Ambrose) in a No Holds Barred six-man tag team elimination match.  Other matches included Bad News Barrett defending the IC Title against RVD, the debut of Bo Dallas against Kofi Kingston, Big E vs Rusev, Cody Rhodes and Goldust vs Rybaxel, and Cesaro defending the US Title against Sheamus.", "release_date": "2014-06-01"}, {"character": "Batista", "credit_id": "537102bfc3a36870050001cb", "poster_path": "/5Y1ZzbSnk2FmrGdxxxZfNfJ2ObY.jpg", "id": 268109, "video": true, "vote_count": 7, "adult": false, "backdrop_path": "/vtyfAeWoMQH4uqGupocMeuiscdY.jpg", "genre_ids": [28, 53], "original_language": "en", "original_title": "WWE Extreme Rules 2014", "popularity": 1.517, "title": "WWE Extreme Rules 2014", "vote_average": 7, "overview": "When playing by the rules gets you nowhere, it's time to get extreme! Don't miss WWE World Champion Daniel Bryan when he defends his title against Kane in an Extreme Rules Match, John Cena battles Bray Wyatt in a Steel Cage and Evolution reunites to challenge The Shield in a Six Man Tag Match at WWE Extreme Rules, Sunday, May 4th at the Izod Center in East Rutherford, New Jersey.", "release_date": "2014-05-04"}, {"character": "Batista", "credit_id": "537752edc3a36855540016bf", "poster_path": "/oTg6uC6zrArsxBK4pc1rsCIIrqD.jpg", "id": 270284, "video": true, "vote_count": 1, "adult": false, "backdrop_path": null, "genre_ids": [28, 53, 99], "original_language": "en", "original_title": "Undertaker: The Streak 21-1", "popularity": 0.882, "title": "Undertaker: The Streak 21-1", "vote_average": 6, "overview": "Documentary that reflects on the WWE career of the Undertaker, the franchise's longest serving wrestler with over two decades of action behind him. Known for his trademark finishing move, the tombstone piledriver, the Undertaker has entered battle with generations of WWE stars. Among those to offer their thoughts on what it is like to face him in the ring are Shawn Michaels, Triple H, Big Show, Randy Orton and Brock Lesnar who ended The Streak.", "release_date": "2014-05-09"}, {"character": "", "credit_id": "53e52045c3a368484d003cbd", "poster_path": "/wbgtCdiXCPmccKQjmbz1ZQF7Nt9.jpg", "id": 285871, "video": true, "vote_count": 1, "adult": false, "backdrop_path": null, "genre_ids": [99], "original_language": "en", "original_title": "WWE: Batista – The Animal Unleashed", "popularity": 0.67, "title": "WWE: Batista – The Animal Unleashed", "vote_average": 5, "overview": "In 2010, a wounded animal walked away from WWE. Now, Batista is back to reclaim his spot at the top of the food chain, whether you like it or not! Walk Batista's path from recovery to redemption and discover the real Dave Batista! Why did he really leave WWE? What conquests has he pursued since? What drives the \"Animal\"?", "release_date": "2014-06-01"}, {"character": "Mr. Hinx", "credit_id": "5480590f9251416e7b0022f4", "release_date": "2015-11-06", "vote_count": 6914, "video": false, "adult": false, "vote_average": 6.4, "title": "Spectre", "genre_ids": [28, 12, 80], "original_language": "en", "original_title": "Spectre", "popularity": 30.585, "id": 206647, "backdrop_path": "/wVTYlkKPKrljJfugXN7UlLNjtuJ.jpg", "overview": "A cryptic message from Bond’s past sends him on a trail to uncover a sinister organization. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.", "poster_path": "/hE24GYddaxB9MVZl1CaiI86M3kp.jpg"}, {"character": "The Drug Dealer #1", "credit_id": "54d3bbc49251413fd300736d", "poster_path": "/iaoJ7nJ8ZV6g3f8wLQQ8tWCYqKS.jpg", "id": 323792, "video": false, "vote_count": 17, "adult": false, "backdrop_path": "/lv2kc5OS57ufXzXA4LCFRE3TgNG.jpg", "genre_ids": [35, 80, 14, 27, 53], "original_language": "en", "original_title": "L.A. Slasher", "popularity": 3.096, "title": "L.A. Slasher", "vote_average": 3.9, "overview": "Incensed by the tabloid culture which celebrates it, the L.A. Slasher publicly abducts a series of reality TV stars, while the media and general public in turn begin to question if society is better off without them. A biting, social satire about reality TV and the glorification of people who are famous for simply being famous, \"L.A. Slasher\" explores why it has become acceptable and even admirable for people to become influential and wealthy based on no merit or talent - purely through notoriety achieved through shameful behavior.", "release_date": "2015-06-12"}, {"character": "Tong Po", "credit_id": "54e1fc92c3a36840950012ca", "poster_path": "/fHwikdzHy8btv7Rn1eRGe9rvLVO.jpg", "id": 308529, "video": false, "vote_count": 190, "adult": false, "backdrop_path": "/r1Ei4M6eLiooPTQ4ej7Ikub9lJt.jpg", "genre_ids": [28, 18], "original_language": "en", "original_title": "Kickboxer: Vengeance", "popularity": 8.964, "title": "Kickboxer: Vengeance", "vote_average": 4.6, "overview": "Eric and Kurt Sloane are the descendants of a well-known Venice, California-based family of martial artists.  Kurt, the younger of the two,  has always been in his brother Eric’s shadow, and despite his talent has been told he lacks the instinct needed to become a champion.  But when Kurt witnesses the merciless murder of his brother at the hands of Muay Thai champion Tong Po, he vows revenge.  He trains with his brother’s mentor for a fight to the death with Tong Po. At first it seems impossible to turn Kurt into the living weapon he must become to beat Tong Po, but through a series of tests and dangerous encounters, Kurt proves he has a deeper strength that will carry him through to his final showdown with Tong Po.", "release_date": "2016-09-02"}, {"character": "", "credit_id": "5506612492514153ba00244d", "poster_path": "/fMcxVuN0iCxmXeBiigxj9HDi18y.jpg", "id": 330963, "video": true, "vote_count": 1, "adult": false, "backdrop_path": null, "genre_ids": [], "original_language": "en", "original_title": "Satan's Prison: The Anthology of the Elimination Chamber", "popularity": 0.6, "title": "Satan's Prison: The Anthology of the Elimination Chamber", "vote_average": 6, "overview": "A collection of the greatest matches and moments inside the Elimination Chamber.", "release_date": "2010-06-15"}, {"character": "Drax the Destroyer", "credit_id": "5526167ec3a36857ae0012fd", "release_date": "2017-05-05", "vote_count": 13162, "video": false, "adult": false, "vote_average": 7.7, "title": "Guardians of the Galaxy Vol. 2", "genre_ids": [28, 12, 35, 878], "original_language": "en", "original_title": "Guardians of the Galaxy Vol. 2", "popularity": 41.953, "id": 283995, "backdrop_path": "/aJn9XeesqsrSLKcHfHP4u5985hn.jpg", "overview": "The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage.", "poster_path": "/y4MBh0EjBlMuOzv9axM4qJlmhzz.jpg"}, {"character": "Owen Davidson", "credit_id": "58decb199251415e5f000230", "release_date": "2019-04-12", "vote_count": 160, "video": false, "adult": false, "vote_average": 5.3, "title": "Master Z: Ip Man Legacy", "genre_ids": [28], "original_language": "cn", "original_title": "葉問外傳：張天志", "popularity": 24.799, "id": 450001, "backdrop_path": "/grtVFGJ4ts0nDAPpc1JWbBoVKTu.jpg", "overview": "Following his defeat by Master Ip, Cheung Tin Chi (Zhang) tries to make a life with his young son in Hong Kong, waiting tables at a bar that caters to expats. But it s not long before the mix of foreigners, money, and triad leaders draw him once again to the fight.", "poster_path": "/6VxEvOF7QDovsG6ro9OVyjH07LF.jpg"}, {"character": "Cox", "credit_id": "552f13e19251413838003d27", "poster_path": "/t5tGykRvvlLBULIPsAJEzGg1ylm.jpg", "id": 336004, "video": false, "vote_count": 511, "adult": false, "backdrop_path": "/cBlnfR0n1GA2vPoUQNcbL9pb3VW.jpg", "genre_ids": [80, 28, 53], "original_language": "en", "original_title": "Heist", "popularity": 9.425, "title": "Heist", "vote_average": 5.8, "overview": "A father is without the means to pay for his daughter's medical treatment. As a last resort, he partners with a greedy co-worker to rob a casino. When things go awry they're forced to hijack a city bus.", "release_date": "2015-11-13"}, {"character": "Batista", "credit_id": "55419dc49251414af0002f3d", "poster_path": "/i6O9TjFcAKQPWtDyTxrwQruU8cL.jpg", "id": 337930, "video": true, "vote_count": 0, "adult": false, "backdrop_path": null, "genre_ids": [], "original_language": "en", "original_title": "WWE: Greatest Superstars of the 21st Century", "popularity": 0.635, "title": "WWE: Greatest Superstars of the 21st Century", "vote_average": 0, "overview": "A feature length look at all of your favourite superstars who have impacted the WWE in the 21st Century.", "release_date": "2011-07-12"}, {"character": "", "credit_id": "5549ba51c3a3683d410007e3", "poster_path": "/syPWZNGnK6uXdvh2t2cpfAPfW6g.jpg", "id": 72939, "video": true, "vote_count": 0, "adult": false, "backdrop_path": null, "genre_ids": [99], "original_language": "en", "original_title": "WWE: Top 50 Superstars of All Time", "popularity": 0.6, "title": "WWE: Top 50 Superstars of All Time", "vote_average": 0, "overview": ".A countdown of the greatest superstars in WWE History. From Hulk Hogan to Randy Savage to The Rock to John Cena enjoy an experience down memory lane for long-time fans, and a new experience for new fans of WWE.", "release_date": "2010-12-07"}, {"character": "Sapper Morton", "credit_id": "575d7fce925141189e001471", "release_date": "2017-10-06", "vote_count": 7033, "video": false, "adult": false, "vote_average": 7.4, "title": "Blade Runner 2049", "genre_ids": [18, 878], "original_language": "en", "original_title": "Blade Runner 2049", "popularity": 38.314, "id": 335984, "backdrop_path": "/sAtoMqDVhNDQBc3QJL3RF6hlhGq.jpg", "overview": "Thirty years after the events of the first film, a new blade runner, LAPD Officer K, unearths a long-buried secret that has the potential to plunge what's left of society into chaos. K's discovery leads him on a quest to find Rick Deckard, a former LAPD blade runner who has been missing for 30 years.", "poster_path": "/gajva2L0rPYkEWjzgFlBXCAVBE5.jpg"}, {"character": "Stockwell", "credit_id": "55f3a032c3a36871ec001b56", "poster_path": "/3iOYH67ZPflBMDMMkEv2tKRX4xe.jpg", "id": 359412, "video": false, "vote_count": 286, "adult": false, "backdrop_path": "/tl43mLoritpnT3CxC7cTdyPCtgt.jpg", "genre_ids": [28, 80, 53], "original_language": "en", "original_title": "Marauders", "popularity": 13.011, "title": "Marauders", "vote_average": 5.7, "overview": "An untraceable group of elite bank robbers is chased by a suicidal FBI agent who uncovers a deeper purpose behind the robbery-homicides.", "release_date": "2016-07-01"}, {"character": "Drax the Destroyer", "credit_id": "57eb6d44c3a368397e00276d", "release_date": "2018-04-27", "vote_count": 15124, "video": false, "adult": false, "vote_average": 8.3, "title": "Avengers: Infinity War", "genre_ids": [28, 12, 878], "original_language": "en", "original_title": "Avengers: Infinity War", "popularity": 74.19, "id": 299536, "backdrop_path": "/bOGkgRGdhrBYJSLpXaxhXVstddV.jpg", "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.", "poster_path": "/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg"}, {"character": "Batista", "credit_id": "581d2b009251410a1600149f", "release_date": "2016-11-15", "vote_count": 2, "video": true, "adult": false, "vote_average": 7.5, "title": "Randy Orton: RKO Outta Nowhere", "genre_ids": [], "original_language": "en", "original_title": "Randy Orton: RKO Outta Nowhere", "popularity": 0.6, "id": 424422, "backdrop_path": null, "overview": "One of the most accomplished and most gifted athletes in the ring – Randy Orton is one of the greatest superstars in WWE History.  Now, get a chance to hear from the Viper as he discusses some of his greatest matches against some of his fiercest rivals, with main event encounters against John Cena, Triple H, The Undertaker, Shawn Michaels, Seth Rollins and so many more!", "poster_path": "/tawmsBiRrqL6z7WDoIyBz3dwLa1.jpg"}, {"character": "Batista", "credit_id": "5821a0639251413cf4006b0d", "poster_path": "/em0l7ErJZrQHHFga0aBq2Tgq8aT.jpg", "id": 260338, "video": true, "vote_count": 1, "adult": false, "backdrop_path": null, "genre_ids": [], "original_language": "de", "original_title": "WWE: The Undertaker's Deadliest Matches", "popularity": 0.6, "title": "WWE: The Undertaker's Deadliest Matches", "vote_average": 6, "overview": "", "release_date": "2010-06-08"}, {"character": "Stupe", "credit_id": "586182f4c3a3681a7d0310b2", "poster_path": "/9fGjmzxdiKWsrlY3syrm2aXeTq7.jpg", "id": 430354, "video": false, "vote_count": 224, "adult": false, "backdrop_path": "/qZM7tkRU49IlKu4in8J4unlTzpX.jpg", "genre_ids": [53, 28], "original_language": "en", "original_title": "Bushwick", "popularity": 10.163, "title": "Bushwick", "vote_average": 5.2, "overview": "When an unknown military force invades Bushwick, a Brooklyn neighborhood, young student Lucy and war veteran Stupe must rely on each other to escape and survive.", "release_date": "2017-01-21"}, {"character": "Drax", "credit_id": "585d562492514123c800bd2f", "release_date": "2019-04-26", "vote_count": 9224, "video": false, "adult": false, "vote_average": 8.3, "title": "Avengers: Endgame", "genre_ids": [28, 12, 878], "original_language": "en", "original_title": "Avengers: Endgame", "popularity": 97.834, "id": 299534, "backdrop_path": "/7RyHsO4yDXtBv1zUU3mTpHeQ0d5.jpg", "overview": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.", "poster_path": "/or06FN3Dka5tukK1e9sl16pB3iy.jpg"}, {"character": "Arun", "credit_id": "57f0bda7c3a3683c88009a56", "poster_path": "/ocwjA3k921qzDDfXE7jDTEjlwWn.jpg", "id": 413658, "video": false, "vote_count": 139, "adult": false, "backdrop_path": "/5Jgq2b75vQDJyjlOldatEJPYWLF.jpg", "genre_ids": [28, 12], "original_language": "zh", "original_title": "勇士之门", "popularity": 9.638, "title": "Enter the Warriors Gate", "vote_average": 5.9, "overview": "Epic fantasy-adventure meets martial arts action in this thrilling film written by Luc Besson &amp; Robert Mark Kamen. After a mysterious chest opens a gateway through time, teen gamer Jack (Uriah Shelton) is transported to an ancient empire terrorized by a cruel barbarian king (former WWE superstar Dave Bautista). Jack will need all of his gaming skills as he battles to defeat the barbarian, protect a beautiful princess, and somehow find his way back home.", "release_date": "2017-05-05"}, {"character": "Everest", "credit_id": "58ae4654c3a3683c2a0040dc", "poster_path": "/wUTiyJ9N8rVLOxJz7aVpaBLpbot.jpg", "id": 406761, "video": false, "vote_count": 574, "adult": false, "backdrop_path": "/E0QuvtI9RCDfi79WnQSPKIzc61.jpg", "genre_ids": [53, 878, 28], "original_language": "en", "original_title": "Hotel Artemis", "popularity": 20.55, "title": "Hotel Artemis", "vote_average": 5.9, "overview": "Los Angeles, June 21st, 2028. While the streets are being torn apart by riots, the Nurse, who runs a clandestine hospital for criminals in the penthouse of the Artemis, a closed old hotel, has a rough night dealing with troublemaker clients: thieves, assassins, someone from the past and the one who owns the place and the whole city.", "release_date": "2018-06-08"}, {"character": "Batista", "credit_id": "58c757cfc3a3683dd70047e6", "poster_path": "/k9D7iask6S9BZIGGlntpx4kC2RC.jpg", "id": 109985, "video": true, "vote_count": 2, "adult": false, "backdrop_path": "/e6bFaCIsCeeSAd4te9CkuxA2tMe.jpg", "genre_ids": [], "original_language": "en", "original_title": "WWE: The Big Show - A Giant's World", "popularity": 0.918, "title": "WWE: The Big Show - A Giant's World", "vote_average": 6.5, "overview": "This penetrating pro-wrestling bio offers a bird's-eye view of what it's like to be a giant -- which, in the case of Paul Wight (better known as the Big Show), makes you one of the most intimidating figures in the WWE. In addition to discussing his battles with wrestling superstars like Steve Austin, Ric Flair and the Undertaker, the Show also talks about his struggles with the genetic condition that caused his extraordinary growth.", "release_date": "2011-10-11"}, {"character": "Himself", "credit_id": "58d2b5809251411f81001832", "poster_path": "/6Npw2utmyIdfqYlXgSZnEeN1eBR.jpg", "id": 448371, "video": true, "vote_count": 4, "adult": false, "backdrop_path": null, "genre_ids": [99], "original_language": "en", "original_title": "Guide to the Galaxy with James Gunn", "popularity": 1.242, "title": "Guide to the Galaxy with James Gunn", "vote_average": 9.6, "overview": "The director and his 8-bit avatar lead you on a galactic adventure through the making of this epic movie, from vibrant concept art, elaborate makeup and amazing sets, to dancing baby Groot.", "release_date": "2014-12-09"}, {"character": "", "credit_id": "58dc5a72925141412a000ba7", "poster_path": "/fhJk0dvj7te0OhE146hbUhRJBOt.jpg", "id": 449413, "video": true, "vote_count": 4, "adult": false, "backdrop_path": null, "genre_ids": [28], "original_language": "en", "original_title": "WWE: Best of the 2000's", "popularity": 1.013, "title": "WWE: Best of the 2000's", "vote_average": 3.3, "overview": "The 2000s was an exciting time for WWE. The Attitude Era was reaching its conclusion, new Superstars were beginning to make their presence known, and for the first time in history, both Raw and SmackDown had their own unique rosters. Now you can relive this period of sports entertainment with WWE's Best of the 2000s. Featuring Superstars such as John Cena, Triple H, Batista, Chris Jericho, Edge, Stone Cold Steve Austin, The Rock, Booker T, Shawn Michaels, Undertaker and more!", "release_date": "2017-04-25"}, {"character": "Sapper Morton", "credit_id": "59baf3c89251410f55000c9a", "release_date": "2017-09-14", "vote_count": 137, "video": false, "adult": false, "vote_average": 6.9, "title": "2048: Nowhere to Run", "genre_ids": [28, 878, 53], "original_language": "en", "original_title": "2048: Nowhere to Run", "popularity": 7.594, "id": 475759, "backdrop_path": "/iiUizZMPhzGFo743aH0mz1GTLdx.jpg", "overview": "“2048: Nowhere to Run” takes place one year before the events of Blade Runner 2049. The short film focuses on Sapper, a man who is trying to make it through life day-by-day without turning back to his old ways. We’re introduced to both the gentle nature of Sapper and the violence he’s capable of when set off.", "poster_path": "/l8JKbUCIe4y1LujxMMjbxG6ueH.jpg"}, {"character": "Police Officer", "credit_id": "5ad694fa9251413b37003979", "poster_path": "/4lwiKyTDQZVizgVxKRxjh3iICBC.jpg", "id": 44027, "video": false, "vote_count": 89, "adult": false, "backdrop_path": "/dX1hG3rlvO7TWwTfIraDcntEPpm.jpg", "genre_ids": [80, 18, 53], "original_language": "en", "original_title": "My Son, My Son, What Have Ye Done", "popularity": 4.166, "title": "My Son, My Son, What Have Ye Done", "vote_average": 6.1, "overview": "Brad has committed murder and barricaded himself inside his house. With the help of his friends and neighbours, the cops piece together the strange tale of how this nice young man arrived at such a dark place.", "release_date": "2010-04-24"}, {"character": "", "credit_id": "5c0596a30e0a265b280ddd7e", "poster_path": "/w8saQfGC3EpbkCV8gqI2ESS0YhW.jpg", "id": 566480, "video": true, "vote_count": 0, "adult": false, "backdrop_path": null, "genre_ids": [], "original_language": "en", "original_title": "Shawn Michaels: The Showstopper Unreleased", "popularity": 0.6, "title": "Shawn Michaels: The Showstopper Unreleased", "vote_average": 0, "overview": "To the WWE Universe, Shawn Michaels made every match he competed in feel like a main event. No matter the time or the place, when The Showstopper stepped inside the ring, he delivered a performance unlike any other. Now for the first time ever, WWE Home Video dives deep into the archives to bring the WWE Universe never-before-released matches spanning the entire career of “The Heartbreak Kid.” From tag team classics as one half of The Rockers, to hidden gems against Mr. Perfect, “Stone Cold” Steve Austin and Ric Flair, this is a special collection for any fan of The Showstopper.", "release_date": "2018-10-02"}, {"character": "Batista", "credit_id": "5c9a44c792514165b2f644f2", "poster_path": "/kaALhkHhXKWs1ZGTYbWWbzpBQcZ.jpg", "id": 590921, "video": true, "vote_count": 9, "adult": false, "backdrop_path": "/ds4IYAHtO6zuYC4Zh6u3zRHmrIf.jpg", "genre_ids": [28, 18], "original_language": "en", "original_title": "WWE WrestleMania 35", "popularity": 2.314, "title": "WWE WrestleMania 35", "vote_average": 8.7, "overview": "WrestleMania 35 will be the thirty-fifth annual WrestleMania professional wrestling pay-per-view (PPV) event and WWE Network event produced by WWE for their Raw, SmackDown, and 205 Live brands. It will take place on April 7, 2019 at MetLife Stadium in East Rutherford, New Jersey.  The event is set to feature the first-ever women's main event match in the show's history.", "release_date": "2019-04-07"}, {"character": "Self", "credit_id": "5cae2c6d0e0a2626c5c0e17d", "poster_path": "/hwT24pjlqCAZnhpTVoBuiwCeYkd.jpg", "id": 594053, "video": false, "vote_count": 2, "adult": false, "backdrop_path": null, "genre_ids": [99], "original_language": "en", "original_title": "Designing the World of Blade Runner 2049", "popularity": 0.738, "title": "Designing the World of Blade Runner 2049", "vote_average": 7, "overview": "A comprehensive overview of the newly imagined world of the film, with substantial contributions from the cast and creative team.", "release_date": "2018-01-16"}, {"character": "Himself", "credit_id": "5d23c4d26d4c97000d7999ab", "poster_path": "/iQXBH74Cs4eHrhtypEJZVU4M9d9.jpg", "id": 614103, "video": true, "vote_count": 2, "adult": false, "backdrop_path": null, "genre_ids": [], "original_language": "en", "original_title": "Guardians of the Galaxy: Inferno", "popularity": 1.379, "title": "Guardians of the Galaxy: Inferno", "vote_average": 9, "overview": "A Guardians of the Galaxy video, the Guardians Inferno, featuring 80s pop star Zardu Hasselfrau.", "release_date": "2017-08-08"}], "_actorID": "49", "_source": "themoviedb", "created_utc_dt": "09/09/2019, 18:10:32"}