{"_movieID": "399170", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:55:19", "summary": "Logan Lucky is a 2017 American heist comedy film directed by Steven Soderbergh, based on a screenplay by Rebecca Blunt. Soderbergh came out of retirement to direct the film, and to distribute it independently through his own company Fingerprint Releasing. The film features an ensemble cast consisting of Channing Tatum, Adam Driver, Riley Keough, Daniel Craig, Seth MacFarlane, Katie Holmes, Hilary Swank, Katherine Waterston and Sebastian Stan, and follows the Logan family, who plan to rob the Charlotte Motor Speedway and must avoid getting caught by the FBI.\nLogan Lucky premiered in Knoxville on August 9, 2017, and was theatrically released in the United States on August 18, 2017, by Bleecker Street. The film received positive reviews, with many critics praising the cast's performances and Soderbergh's direction, and grossed $48 million worldwide.", "plot": "Jimmy Logan is laid off from his construction job working in tunnels underneath the Charlotte Motor Speedway. He is close to his daughter, Sadie, who lives with her mom, Bobbie Jo, and her new, rich husband. Sadie performs in beauty pageants, and Jimmy’s hair stylist sister Mellie, does her hair.\nJimmy goes to a bar tended by his brother Clyde, who lost his hand fighting in Iraq. A pretentious, NASCAR-team owner, Max Chilblain, makes fun of Clyde’s hand, leading to a fight with Jimmy, while Clyde sets fire to Max’s car. The next day, Jimmy tells Clyde his plan to rob the Speedway, exploiting his knowledge of its underground pneumatic tube system for moving its vast amount of money.\nClyde and Jimmy recruit their sister Mellie, incarcerated safe-cracker Joe Bang, and Joe's dimwitted brothers Sam and Fish. They will break Joe out of prison and return him later that day. Clyde intentionally gets himself sent to prison on a minor charge. With the help of a woman working at the vault, Mellie, Sam, and Fish infest the Speedway's tube system with painted cockroaches, determining which tubes go to the vault. While gathering supplies, Jimmy meets former schoolmate Sylvia, who gives him a tetanus shot inside her mobile clinic, which is in need of donations.  Jimmy learns that construction at the speedway is being completed ahead of schedule, forcing them to mount the heist a week earlier, during the much busier Coca-Cola 600 race on Memorial Day weekend. \nJoe arranges for fellow inmates to stage a riot, resulting in a lockdown that hides his and Clyde’s escape. Mellie meets them in a Ford Shelby GT350 stolen from Bobbie Jo's arrogant husband. At the speedway, Sam and Fish blow up a generator to kill all credit card machines, forcing vendors to accept cash only. Clyde, Jimmy and Joe enter the tube room, and Joe improvises an explosive with bleach, gummy bears, and a dietary salt substitute, which blows the gate from the tube to the vault. They connect the tube to a giant vacuum pump, and suck up all the cash into garbage bags. Security guards investigate the smoke from the explosion, but are diverted by Earl, one of Clyde's bar patrons. Jimmy accidentally reverses the direction of the vacuum, sucking Clyde's prosthetic arm into the machine. Sam and Fish get the money out and into Jimmy’s truck. On his way out Clyde is recognized by Chilblain, and Clyde hits him, and Clyde and Joe sneak back into the prison as firefighters. Jimmy makes it to his daughter's pageant just in time to see her perform his favorite song, \"Take Me Home, Country Roads.\" Jimmy then abandons the money and anonymously informs the police of its location. \nFBI agent Sarah Grayson investigates the heist, dubbed “Ocean’s Seven-Eleven” in the press. While she suspects Jimmy, Clyde and Joe, she has no evidence. Due to the unwillingness of the prison warden to report the riot, the refuting of Chilblain's eyewitness account by his disgruntled race driver, and the speedway president’s satisfaction with the money's recovery and insurance settlement, the case is closed after six months. When Joe returns home after prison he finds a garbage bag of money buried in his yard. Sylvia receives an anonymous donation for her clinic, as does the inmate who orchestrated the riot.\nUnknown to Joe and his brothers, Jimmy had thrown into a dumpster several bags of money, which he retrieved from the dump. Now working in a hardware store and having bought a house near his daughter and ex-wife's home, Jimmy happily reunites with his family at Clyde's bar. They're all watched by Grayson, who tells Clyde that she's new to the area but thinks she'll stay for a while.", "cast": "Six other NASCAR drivers make cameo appearances in the film. Carl Edwards and Kyle Busch are West Virginia state troopers, Brad Keselowski and Joey Logano are security guards, Kyle Larson is a limousine driver, and Ryan Blaney is a delivery boy. LeAnn Rimes, Adam Alexander and Jesco White also make cameo appearances."}