{"_movieID": "343921", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:57:16", "summary": "A Deadly Adoption is a 2015 American made for television black comedy thriller film directed by Rachel Lee Goldenberg and written by Andrew Steele. The film aired on the Lifetime Network on June 20, 2015. It stars Will Ferrell, Kristen Wiig and Jessica Lowndes.", "plot": "Sarah Benson (Kristen Wiig) is a successful organic food vendor. Her husband Robert (Will Ferrell) is a best-selling author and finance guru. They're also the parents of a one-year-old daughter named Sully, and Sarah is pregnant with their second child.\nDuring a gathering with friends for Sully's first birthday, Sarah gets an urge for Robert to take her on a boat ride on the lake behind their home, the fictitious Storm Lake. Despite Robert's repeated warnings for Sarah to get off the unsafe dock, she leans against its railing, causing it to break away. She hits her head on the boat as she falls into the water. Robert dives in, pulling her to safety and successfully resuscitating her. The resulting trauma from the experience causes Sarah to lose the baby. As a result, they can no longer have children.\nFive years later, Robert has become a recluse, but has been sober for six months following an alcohol addiction which began after the loss of his child. He has also become over-protective of their now-six-year old diabetic daughter Sully. Robert and Sarah plan to adopt an unwanted child, but are not satisfied with any of the birth mothers they have met. They ultimately decide to house and care for an attractive young woman named Bridgette Gibson (Jessica Lowndes) during the final months of her pregnancy. Robert is currently writing his new book, but is struggling for inspiration.\nAfter Bridgette tells the Bensons that she is living in a homeless shelter, Robert and Sarah decide to offer her a bedroom they had built onto the house for their lost child. Bridgette accepts the offer. Once left alone in her room, she pulls out a magazine with the Bensons on the front cover and rips off the half containing Sarah.\nSully discovers through Bridgette's cracked bathroom door as she's showering that her enlarged belly is fake. Bridgette explains to Sully that because of her small and slender build, she was worried that the Bensons wouldn't believe that she was pregnant. The impressionable youngster accepts this, and agrees to keep this secret from her parents. Another secret is when Bridgette removes the training wheels from Sully's bike (without Robert's knowledge or approval) and pushes her down the driveway where she's almost struck by a car. She steers away from the vehicle and into the path of Dwayne Tisdale, Bridgette's tattooed hoodlum boyfriend. Sully is unhurt and Bridgette persuades her to keep this a secret as well.\nOne day, Robert opens the door to Bridgette's room and discovers a copy of one of his books among her belongings. He opens the front cover and recognizes the autograph as his own...to \"Joni\". Robert then realizes that Bridgette is really Joni, a fan with whom he slept while on his last book tour and in the depths of his alcoholism. After Sully turns up missing, Robert and Sarah are questioned by the police, who produce a photo of the real Bridgette and confirm her identity.\nBridgette and Dwayne bring Sully back to their cabin across the lake, where Dwayne is led to believe Bridgette is with him on a plot to blackmail Robert in order to get Sully back. But Bridgette has an agenda all her own: to kill Sarah and have Robert and Sully for herself. Charlie, an employee of Sarah's who's had suspicions of Bridgette, follows her and Dwayne back to the cabin. He is discovered and fatally shot by Dwayne.\nAfter Sully begins to feel ill from not having her insulin, Bridgette speeds up her plan and confronts Robert and Sarah. A struggle breaks out and Bridgette shoots Robert in the shoulder moments after she overpowers Sarah. Bridgette then sets Sarah in the driver's seat of her running car in the garage, making it look like a suicide attempt. Robert regains consciousness, finds Sarah and quickly moves her to fresh air. He then runs off to find Bridgette.\nBridgette is driving Dwayne's truck with Sully next to her, when she comes upon Robert standing in the middle of a bridge. She does not stop, and Robert dives out of the way just in time, but Bridgette halts the vehicle and aims her gun at him. Sully jumps out of the truck and runs to him. Holding them at gunpoint, Bridgette orders Sully to return to her or she will kill Robert. Her father whispers something in Sully's ear before she turns to make her way back to Bridgette. On her way, Sully darts to the bridge's railing and dives off the bridge. Distracted, Bridgette shifts her gaze, allowing Robert to dive off the bridge after his daughter, as Bridgette fires her pistol after them. Bridgette looks over the railing as Robert and Sully climb into a small boat with an outboard motor, which Robert tries frantically to start. Completely losing it, Bridgette gets ready to pull the trigger to kill them both, until another shot rings out, and Bridgette is struck below her right shoulder blade. The shot is from another gun that Bridgette left at the Benson home...now held by Sarah, having regained consciousness and followed her family to their would-be murder scene. Fatally wounded, Bridgette falls to her death into the water below.\nSix months later, the Benson family is restored and intact. Robert and Sarah dance in the kitchen with their daughter.", "cast": "Will Ferrell as Robert Benson\nKristen Wiig as Sarah Benson\nJessica Lowndes as Bridgette Gibson / Joni Mathers\nAlyvia Alyn Lind as Sully Benson\nJake Weary as Dwayne Tisdale\nErik Palladino as Sheriff J. Moore\nBryan Safi as Charlie\nDebra Christofferson as Ellen Macy\nCarolyn Hennesy as Debby\nKellita Smith as Officer F. Mason\nMatt Corboy as Stan\nBrooke Lyons as Christine"}