{"_movieID": "370567", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:44:28", "summary": "Sherlock Gnomes is a 2018 3D computer-animated fantasy romantic mystery comedy film directed by John Stevenson. A sequel to Gnomeo & Juliet (2011), the film stars the voices of James McAvoy, Emily Blunt, Chiwetel Ejiofor, Mary J. Blige, and Johnny Depp. Unlike its predecessor, which was produced and distributed by Walt Disney Studios Motion Pictures under their Touchstone Pictures banner, Sherlock Gnomes was produced by Paramount Animation and Metro-Goldwyn-Mayer, with the animation service provided by Mikros Image, though Rocket Pictures was still involved. It was the first film from Paramount Animation to be entirely animated, and the first animated film from Metro-Goldwyn-Mayer since 2008's Igor. The film was released in the United States on March 23, 2018, by Paramount Pictures. It grossed $90 million worldwide.", "plot": "Sherlock Gnomes and his assistant, Gnome Watson, storm London's natural history museum where their nemesis, a pie mascot named Moriarty, is holding gnomes hostage. After a brief battle, Moriarty is seemingly crushed by a dinosaur skeleton.\nMeanwhile, Gnomeo and Juliet and their fellow gnomes move to London, where the couple are declared the new leaders of the garden. Feeling neglected by Juliet's focus on improving the garden, Gnomeo leaves to find a flower centerpiece, but is nearly caught in a shop, forcing Juliet to rescue him and leading to a heated argument between the couple with Juliet harshly telling Gnomeo \"the garden can't wait, you can!\". They return to the garden to find all the other gnomes missing. Sherlock and Watson arrive to investigate; after Gnomeo and Juliet help them escape a sewer flood, Sherlock agrees to join forces.\nA clue from Moriarty, whom Sherlock believes survived their last encounter, leads them to Chinatown. They find the next clue at Curly Fu's Emporium, and escape a group of Maneki-nekos whom Sherlock had previously offended. They arrive back at the natural history museum, where Gnomeo suggests they look inside but Sherlock decides to wander an art gallery instead, followed by Juliet. Gnomeo goes into the museum anyway with Watson in pursuit, only to be kidnapped by a Gargoyle who seemingly smashes Watson. Gnomeo is brought to the rest of the gnomes and informed they will be smashed during a fireworks celebration the following evening. Meanwhile, Sherlock figures out the next clue is at the royal park. He and Juliet disguise themselves as a squirrel to get the clue from a dog whom Sherlock has an unfortunate history with (and describes as \"the hound owned by the Baskervilles\"), and manage to evade the dog on a lawnmower.\nGnomeo attempts to free the gnomes, but only he and the Red Goon Gnomes are able to escape before the gargoyles arrive. The next clue leads Sherlock and Juliet to a doll shop where they meet his resentful former fiancée, Irene, who kicks them out, but allows Juliet back in after she distances herself from Sherlock. Irene gives Juliet the clue, which leads her and Sherlock to Traitor's Gate at the Tower of London. They discover Watson, apparently the true mastermind, who reveals that he pretended to be Moriarty to get through to Sherlock, who didn't respect or show appreciation for him, and supposedly has the gnomes in custody, only to find them all missing. The Gargoyles reveal that they never worked for Watson, and dispose of Sherlock, Watson, and Juliet on a ship.\nSherlock realizes the gnomes are being held at the bottom of the Tower Bridge with pie filling, and Moriarty appears, revealing that he really was behind everything and plans to smash the gnomes with the raised bridge. After witnessing Sherlock's mistreatment of Watson, he had the Gargoyles pretend to work for Watson to access his map and identify where all the gnomes lived. Sherlock and Watson agree to work together a final time to save the gnomes, and they and Juliet head to the bridge on a drone.\nGnomeo is able to stall the bridge opening by having the Red Goon Gnomes pretend to be humans. He reunites with Juliet, and together they defeat the Gargoyles. Watson frees the trapped gnomes with soap just in time. Moriarty pursues Sherlock, and attempts to kill everyone, but Sherlock throws him over the bridge and into the river, while Watson narrowly saves him with his cane. Moriarty vows revenge as he helplessly floats away. Sherlock, finally appreciating his friend, reconciles with Watson, as do Gnomeo and Juliet, and the gnomes enjoy the fireworks.\nThe following spring, Gnomeo and Juliet take charge of the garden, and the gnomes celebrate with Irene and the Maneki-nekos. Satisfied, Sherlock and Watson leave for another adventure.", "cast": "James McAvoy  as Gnomeo, Lady Bluebury's son, Juliet's husband, Benny's best friend and a blue gnome counterpart to Romeo Montague.\nEmily Blunt as Juliet, Lord Redbrick's daughter, Gnomeo's wife, Nanette's best friend and a red gnome counterpart to Juliet Capulet.\nJohnny Depp as Sherlock Gnomes, Gnome Watson's friend, Irene's ex-boyfriend, Moriarty's nemesis and a gnome counterpart to Sherlock Holmes.\nChiwetel Ejiofor as Dr. Gnome Watson, Sherlock Gnomes' friend and assistant and a gnome counterpart to Dr. John Watson.\nMary J. Blige as Irene, Sherlock's ex-girlfriend, and a plastic doll counterpart to Irene Adler.\nJamie Demetriou as Moriarty, Sherlock's nemesis and a pie mascot counterpart to Professor Moriarty.\nMichael Caine as Lord Redbrick, the leader of the red gnomes and Juliet's overprotective widowed father and gnome counterpart to Lord Capulet.\nMaggie Smith as Lady Bluebury, the leader of the blue gnomes and Gnomeo's widowed mother; gnome counterpart to Lady Montague.\nAshley Jensen as Nanette, a Scottish-accented plastic garden frog, Juliet's best friend and Paris' girlfriend in first film now is the new girlfriend of Benny and garden frog counterpart to Nurse.\nMatt Lucas as Benny, Gnomeo's impulsive and tall-hatted best friend, Call Me Doll's boyfriend in first film who is the new boyfriend of Nanette; gnome counterpart to Benvolio.\nStephen Merchant as Paris, a nerdy red gnome who was arranged to marry Juliet and Nanette's boyfriend in first film and gnome counterpart to Count Paris.\nOzzy Osbourne as Fawn, a garden deer and counterpart to Peter.\nJulie Walters as Ms. Montague, the elderly owner of the garden.\nRichard Wilson as Mr. Capulet, the other elderly owner of the garden.\nJulio Bonet as Mankini Gnome, a red gnome in a mankini.\nKelly Asbury as Red Goon Gnomes; counterparts to Gregory, Sampson, Anthony, and Potpan.\nDan Starkey as Teddy Gregson, a counterpart to Tobias Gregson.\nDexter Fletcher as Reggie, a gargoyle.\nJames Hong as Salt Shaker\nJohn Stevenson as Big Boy Gorilla\nStephen Wight as Bridge Operator"}