{"_movieID": "22897", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:45", "summary": "It's Complicated is a 2009 American romantic comedy film written and directed by Nancy Meyers. It stars Meryl Streep as a successful bakery owner and single mother of three who starts a secret affair with her former husband, played by Alec Baldwin, ten years after their divorce – only to find herself drawn to another man: her architect Adam (portrayed by Steve Martin). The film also features supporting performances by Lake Bell, Hunter Parrish, Zoe Kazan, John Krasinski, Mary Kay Place, Robert Curtis Brown and Rita Wilson, among others.The film was met with average reviews from critics, who praised the acting of its ensemble cast but declared its story rather predictable. It became another commercial hit for Meyers, however, upon its Christmas Day 2009 opening release in the United States and Canada. It played well through the holidays and in to January 2010, ultimately closing on April 1 with $112.7 million. Worldwide, It's Complicated eventually grossed $219.1 million, and surpassed The Holiday (2006) to become Meyer's third-highest-grossing project to date.For their performances, the cast was awarded a National Board of Review of Motion Pictures Award for Best Ensemble Cast the same year. In addition, the film was nominated at both the Critics' Choice Awards and the Satellite Awards and garnered Meyers two Golden Globe nominations, including Best Motion Picture – Musical or Comedy and Best Screenplay. Streep and Baldwin each were individually recognized with Best Actress and Best Supporting Actor nominations at the Golden Globe and BAFTA award ceremonies, respectively.", "plot": "Jane (Meryl Streep), who owns a successful bakery in Santa Barbara, California, and Jake Adler (Alec Baldwin), a successful attorney, divorced ten years earlier. They had three children together, two girls and a boy, who are grown. Jake, who was cheating on Jane, married the much younger Agness (Lake Bell).\nJane and Jake attend their son Luke's graduation from college in New York City. After a dinner together, the two begin an affair, which continues in Santa Barbara. Jane is torn about the affair; Jake is not. While Agness has Jake scheduled for regular sessions at a fertility clinic, Jake is secretly taking medication to increase urine flow, the side effects of which are decreased sperm count and dizziness.  After one of his sessions he has a lunchtime rendezvous with Jane at a hotel. Jake collapses in the hotel room and a doctor is called. The doctor speculates that the reason for Jake's distress may be the medication and says he should stop taking it. Jake and Jane's children know nothing of the affair, but Harley (John Krasinski), who is engaged to their daughter Lauren, spots the pair and the doctor in the hotel, but keeps silent.\nAdam (Steve Martin) is an architect hired to remodel Jane's home. Still healing from a divorce of his own, he begins to fall in love with Jane. On the night of Luke's graduation party in Santa Barbara, Jane invites Adam to the party. She is stoned when he picks her up because she has smoked a marijuana joint that Jake had given her earlier. Before going into the party, Adam smokes some of the joint with Jane. Once inside, they are laughing and happily high, Jake becomes jealous observing them, and after pressing Jane, smokes some with her also.\nAgness then observes Jake and Jane dancing together and realizes they are having an affair. When they leave the party, Adam asks Jane if they could have something to eat. Jane takes him to her bakery and they make chocolate croissants together. Jake and Agness separate, although it is not clear who leaves whom. Eventually by a webcam in Jane's bedroom, Adam sees Jake naked and realizes that the two have been having an affair. Adam tells Jane he cannot continue seeing her because it will only lead to heartbreak. Jane's kids also find out, and they are not happy about Mom and Dad getting together again because they are still recovering from the divorce. Jane tells them she is not getting back with Jake. Jane and Jake talk and end their affair on amicable terms. The film ends with Adam at Jane's house ready to commence the remodeling. Before the credits roll, Jane and Adam are seen laughing about the chocolate croissants while walking into her house.", "cast": "Meryl Streep as Jane Adler, a successful bakery owner.\nSteve Martin as Adam Schaffer, Jane's architect.\nAlec Baldwin as Jacob \"Jake\" Adler, Jane's ex-husband.\nLake Bell as Agness Adler, Jake's wife.\nHunter Parrish as Luke David Adler, Jane and Jake's son.\nZoe Kazan as Gabby Adler, Jane and Jake's younger daughter.\nCaitlin FitzGerald as Lauren Adler, Jane and Jake's older daughter.\nJohn Krasinski as Harley, Lauren's fiancé.\nMary Kay Place as Joanne\nRita Wilson as Trisha\nAlexandra Wentworth as Diane\nJames Patrick Stuart as Dr. Moss, the plastic surgeon\nBlanchard Ryan as Annalise\nMichael Rivera as Eddie\nRobert Curtis Brown as Peter\nPeter Mackenzie as Dr. Alan, Jane's therapist.\nRosalie Ward as Alex\nJimmy Clabots as Chase\nEmjay Anthony as Pedro Adler\nEmily Kinney as Waitress.\nNora Dunn as Sally\nBruce Altman as Ted\nLisa Lynn Masters as the beautiful woman in elevator."}