{"_movieID": "103731", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:14:57", "summary": "A MUD (; originally Multi-User Dungeon, with later variants Multi-User Dimension and Multi-User Domain) is a multiplayer real-time virtual world, usually text-based.  MUDs combine elements of role-playing games, hack and slash, player versus player, interactive fiction, and online chat. Players can read or view descriptions of rooms, objects, other players, non-player characters, and actions performed in the virtual world. Players typically interact with each other and the world by typing commands that resemble a natural language.\nTraditional MUDs implement a role-playing video game set in a fantasy world populated by fictional races and monsters, with players choosing classes in order to gain specific skills or powers.  The objective of this sort of game is to slay monsters, explore a fantasy world, complete quests, go on adventures, create a story by roleplaying, and advance the created character. Many MUDs were fashioned around the dice-rolling rules of the Dungeons & Dragons series of games.\nSuch fantasy settings for MUDs are common, while many others have science fiction settings or are based on popular books, movies, animations, periods of history, worlds populated by anthropomorphic animals, and so on.  Not all MUDs are games; some are designed for educational purposes, while others are purely chat environments, and the flexible nature of many MUD servers leads to their occasional use in areas ranging from computer science research to geoinformatics to medical informatics to analytical chemistry.  MUDs have attracted the interest of academic scholars from many fields, including communications, sociology, law, and economics.  At one time, there was interest from the United States military in using them for teleconferencing.Most MUDs are run as hobbies and are free to players; some may accept donations or allow players to purchase virtual items, while others charge a monthly subscription fee. MUDs can be accessed via standard telnet clients, or specialized MUD clients which are designed to improve the user experience. Numerous games are listed at various web portals, such as The Mud Connector.\nThe history of modern massively multiplayer online role-playing games (MMORPGs) like EverQuest and Ultima Online, and related virtual world genres such as the social virtual worlds exemplified by Second Life, can be traced directly back to the MUD genre.  Indeed, before the invention of the term MMORPG, games of this style were simply called graphical MUDs.  A number of influential MMORPG designers began as MUD developers and/or players (such as Raph Koster, Brad McQuaid, Matt Firor, and Brian Green) or were involved with early MUDs (like Mark Jacobs and J. Todd Coleman)."}