{"_movieID": "45013", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:55:29", "summary": "Burning Palms is a 2010 American satirical thriller film based on Los Angeles stereotypes told through five intertwining storylines. The film is the directorial debut of screenwriter Christopher B. Landon.", "plot": "The Green-Eyed MonsterDedra Davenport (Rosamund Pike) meets Chloe, the 15-year-old daughter (Emily Meade) of her fiancé Dennis (Dylan McDermott) for the very first time. However, she is soon disturbed by how close father and daughter are, committing suicide by cutting her veins just like Chloe's mother, feeling herself shut out and betrayed by the unhealthy close and bordering on incestuous relationship between the two.\n\nThis Little PiggyGinny Bai (Jamie Chung) agrees to participate in an unconventional sex act with her boyfriend Chad Bower (Robert Hoffman). Soon after she begins to slowly lose her mind when she cannot seem to get rid of an odd smell from her finger.\n\nBuyer's RemorseA rich and well-recognized West Hollywood gay couple (Peter Macdissi and Anson Mount) decide to adopt a seven-year-old African girl (Tiara McKinney). They prove to be mentally unprepared for the challenges and risks involved in parenthood, especially since she is a decided mute who refuses to speak to them, and abandon her.\n\nKangaroo CourtA group of bullying, bratty boys, cared for by an irresponsible nanny (Lake Bell) are puzzled by their maid (Paz Vega) keeping the umbilical cord of her dead child and eventually discover that the maid murdered her own child to punish her boyfriend for infidelity.\n\nManeaterAn unidentified man (Nick Stahl) breaks into the apartment of meek woman Sarah Cotton (Zoe Saldana), and rapes her. Sometime later she finds the man's wallet and is able to track him down and approaches him, wanting him to rape her again.", "cast": "Zoe Saldana as Sarah Cotton\nJamie Chung as Ginny Bai\nDylan McDermott as Dennis Marx\nRosamund Pike as Dedra Davenport\nLake Bell as Maryjane\nNick Stahl as Robert Kane\nPaz Vega as Blanca Juarez\nAdriana Barraza as Luisa Alvarez\nShannen Doherty as Dr. Shelly\nRobert Hoffman as Chad Bower\nPeter Macdissi as Geri\nAnson Mount as Tom\nEmily Meade as Chloe Marx\nJon Polito as The Pharmacist\nVictor Webster as Paulo\nDimitri Diatchenko as Bob\nColleen Camp as Barbara Barish\nTom Wright as Maxwell Barron\nAustin Williams as Nicholas Pinter\nChandler George Brown as Jeffrey"}