{"_movieID": "257440", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:50:15", "summary": "Term Life is a 2016 American action drama film based on the graphic novel of the same name. It is directed by Peter Billingsley from a screenplay by A.J. Lieberman. The film stars Vince Vaughn, who also produces the film, Hailee Steinfeld, Jonathan Banks, Mike Epps, Jordi Molla, Shea Whigham, William Levy, Taraji P. Henson, Annabeth Gish, and Terrence Howard. The film was released on April 29, 2016, in a limited release and through video on demand by Focus World. The film received negative reviews.", "plot": "Nick (Vaughn) plans and sells heists to the highest bidder but is forced to take his daughter Cate (Hailee Steinfeld), who he hasn't had a relationship with her whole life, on the lam when a job goes bad.  Cate has had to fend for herself because her mother Lucy is an alcoholic.  Cate gives her father a hard time because of the hideout that has no food, him trying to assert himself in her life.  Nick is now trying to connect the dots and hunt down who double-crossed him.  With the aid of an elderly man Harper, he gets the inside scoop and comes to the conclusion that it was an undercover officer Captain Keenan who is out to kill Nick.  In the meantime, Nick and Cate bond and Nick explains to Cate when she asks how he does his heists: \"learn how to get out before you get in, evaluate the security of a location, whether they have CCTV or the owner is the one that responds, and always make sure to have a workable exit plan.  Cate was initially irritated that her father knows so much about her and has taken pictures of her throughout her life and has kept it in a box but she also enjoys the birthday gift he gets for her, taking her to the carnival and teaching her how to shoot.  Keenan now needs to clean up his corrupt team who is ratting him out to Internal Affairs and kills Detective Matty and a hooker and fingers Nick as the guy who did the killing.\nHunted by mob bosses, contract killers and dirty cops, he takes out a life insurance policy on himself to leave something for her.  Nick educates Cate on how to separate and survive.  In the meantime, Nick gets arrested by the local sheriff responding to an APB and the Spanish mob springs him out of jail to kill him but Cate comes to the rescue.  Cate and Nick argue and Cate abandons Nick on the side of the road.  Keenan abducts Cate and uses her as bait to try to get Nick and in the shoot-out, Nick and Cate escape.  Even though Nick was unwilling to listen to Cate's plan, Cate executed a plan that got rid of Keenan, evidence pointed to him for multiple murders and exonerated Nick, and Nick and Cate choose to live together and bond as father and daughter."}