{"_movieID": "38303", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:27:43", "summary": "You Again is a 2010 American comedy film produced by John J. Strauss and Eric Tannenbaum and directed by Andy Fickman with music by Nathan Wang and written by Moe Jelline. The film stars Kristen Bell, Jamie Lee Curtis, Sigourney Weaver, Odette Yustman, James Wolk, Victor Garber, Billy Unger, Kyle Bornheimer, Kristin Chenoweth, and Betty White.\nThe film was released on September 24, 2010, by Touchstone Pictures to negative reviews from critics and it earned $32 million against a production budget of $20 million. It was the last solo Touchstone Pictures project before working on subsequent films in association with Miramax, DreamWorks, and Lucasfilm. As a result of this, Touchstone signed a deal with DreamWorks Pictures in 2011 starting with I Am Number Four.", "plot": "In 2002, Marni Olsen is an acne-riddled high school sophomore in Ridgefield, California, with glasses and braces, being tormented and bullied by other children, specifically popular mean girl J.J.. Her protective older brother, Will, was very popular as a handsome basketball player. At a very important basketball game, J.J. pushes Marni, dressed as the mascot, who runs into Will, resulting in a loss of the game.\nEight years later, in 2010, Marni is a successful public relations executive in Los Angeles, recently promoted to a job in New York. She returns to Ridgefield to celebrate Will's upcoming wedding to fiancee Joanna, an apparently amazing woman.  Having never met Joanna, Marni discovers on the flight back home that Will is about to marry her former bully, J.J. being a nickname that Joanna went by in high school. Marni is upset to see that Joanna gets along very well with the family during her welcome home dinner.  Gail, Marni and Will's mother, also discovers that Joanna's beloved aunt, Ramona, a successful and wealthy businesswoman who is also in town for the wedding, is a former high school friend of hers.\nMarni is unwilling to forget the things Joanna did to her in high school unless she apologizes, and tries to let her brother know of Joanna's bullying past. Joanna, meanwhile, seems to have no memory of Marni, though Marni discovers that this is an act. As a result of this and remembering that a time capsule that was buried during her senior year contained a video tape of Joanna acting as a bully, Marni decides to uncover the capsule. Meanwhile, Gail comes to Ramona's hotel room for \"closure\" about anything bad between them that happened in the past. They appear to make up, but Ramona still seems not to be too fond of Gail.\nWill and Marni's grandmother Bunny meet Joanna's ex-boyfriend Tim, who appears devastated when he hears that she's marrying Will. Marni invites Tim as her plus-one to the upcoming rehearsal dinner, hoping his presence there will throw a wrench into things. At the rehearsal dinner, when it is time for guests to make a toast to the bride and groom, Tim reveals in his toast that Joanna left him at the altar. Later, the video recovered from their old high school's time capsule reveals Joanna confessing her true nature as a bully, with footage of her tormenting Marni and other students. Will, confused and upset, leaves the rehearsal dinner, saying he needs to get some air.\nGoing outside, Marni confronts Joanna once again and the two fight, eventually finding their way inside the rehearsal venue, throwing plates and glasses at each other.  After Marni wrecks one of the wedding gifts in retaliation,  Joanna intentionally dumps a bowl of cold soup on Marni's head.  As this is happening, Will walks in. He scolds both of them for ruining the night before storming out and calling off the wedding, much to Joanna's devastation. Ramona and Gail argue after the rehearsal dinner, and Ramona accuses Gail of trying to ruin her life throughout high school, including by stealing her high school crush, Richie Phillips. A fight ensues, with both of them falling into the pool. They revisit the past and make up when Gail's husband, Mark, shows up. At home, he angrily grounds Marni and Gail.\nLater that night, Marni finds Joanna in the kitchen wearing her wedding dress, crying and binging on junk food. She finally admits to Marni that she feels awful for bullying and tormenting her when they were in high school. Joanna tells Marni that she turned over a new leaf after the death of her parents, hoping to be the kind of person that they could be proud of. Joanna also says that she pretended not to know Marni because she was afraid that the revelation of her bullying past would lead to her losing Will and his family, saying that she loves them all, and that they made her feel like she had a family again. Marni forgives her and promises to get them back together. Marni apologizes to Will for her actions, saying she was only trying to protect him.\nJoanna and Will reconcile in the family's old tree house, but it collapses and injures both of them. They are both forced to stay at a hospital, which delays the wedding. However, Marni puts together a makeshift wedding at the hospital. Gail surprises Ramona with Richie Phillips. Marni appears to start a relationship with Charlie, her brother's best friend. Joanna introduces Bunny to an elderly woman, Helen. Helen and Bunny are revealed to be rivals in high school. Bunny gets her revenge when she cuts in on Helen's dance and takes her partner.", "cast": "Kristen Bell as Marni Olivia Olsen\nJamie Lee Curtis as Gail Byer Olsen\nSigourney Weaver as Ramona \"Mona\" Clark\nOdette Yustman as Joanna \"J.J.\" Clark\nJames Wolk as Will Olsen\nVictor Garber as Mark Olsen\nBetty White as Grandma Bunny Byer\nBilly Unger as Ben Olsen\nKristin Chenoweth as Georgia King\nKyle Bornheimer as Timothy \"Tim\"\nSean Wing as Charlie Mason\nCloris Leachman as Helen Sullivan (uncredited cameo)\nDwayne Johnson as Air Marshal (uncredited cameo)\nChristine Lakin as Taylor\nMeagan Holder as Kendall\nPatrick Duffy as Ritchie Phillips\nReginald VelJohnson as Mason Dunlevy\nStaci Keanan as Dana\nDaryl Hall as himself\nJohn Oates as himself"}