{"_movieID": "399057", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:18:12", "summary": "The Killing of a Sacred Deer is a 2017 psychological thriller film directed by Yorgos Lanthimos, from a screenplay by Lanthimos and Efthymis Filippou. It stars Colin Farrell, Nicole Kidman, Barry Keoghan, Raffey Cassidy, Sunny Suljic, Alicia Silverstone, and Bill Camp. The story is based on the ancient Greek tragedy Iphigenia at Aulis by Euripides.The film follows a cardiac surgeon (Farrell) who secretly befriends a teenage boy (Keoghan) with a connection to his past. He introduces the boy to his family, who begin to fall mysteriously ill.\nThe Killing of a Sacred Deer was selected to compete for the Palme d'Or in the main competition section at the 2017 Cannes Film Festival. The film was theatrically released in the United States on October 20, 2017, by A24, and in the United Kingdom and Ireland on November 3, 2017, by 20th Century Fox. It has received positive reviews, and grossed over $6 million worldwide.", "plot": "Steven Murphy, a skilled cardiothoracic surgeon, finishes an open heart surgery, and goes to a diner where he meets a teenage boy named Martin. Afterward, Steven returns home to his wife, Anna, and their children, Kim and Bob. He later tells Anna that Martin's father died in a car accident ten years earlier, and that he has taken an interest in the boy to help him grieve. Martin comes to the Murphy household for dinner; Kim seems rather taken with him.\nMartin returns the favor by inviting Steven to his mother's home for dinner. After the meal, Steven tries to leave but Martin insists he watch a movie with them. Martin leaves halfway through, and his mother makes a romantic advance on Steven, who rebuffs her and goes home. Over the next few days, Martin's demands on Steven's time grow increasingly frequent and desperate, but Steven does not reply. One morning, Bob awakens and finds he cannot feel his legs; he has become paralyzed. Steven and Anna rush him to the hospital, where an examination reveals that nothing is physically wrong. Meanwhile, Kim visits Martin, seeking insight .\nThe next morning, Martin meets Steven and reveals the truth: his father did not die in the crash but had died during surgery that Steven himself performed after the accident. Steven failed to save his father, and the boy blames the surgeon for the death. Martin explains that, to \"balance\" the act of destroying a family, Steven must kill one of the members of his own. If not, the Murphys will slowly die after four stages; paralysis is the first stage, followed by self-imposed starvation, bleeding from the eyes, and finally death. Steven attempts to dismiss these claims, but later finds that Bob is refusing food (the second stage). Kim also loses the use of her legs and the will to eat.\nKim receives a call from Martin at the hospital. During the conversation, she regains the use of her legs, only to lose mobility again when the connection is broken. This convinces Anna that Martin has power. She visits Martin to ask why she and her children must suffer for Steven's mistakes. Martin responds that \"it's the only thing...that's close to justice\". Anna, suspecting that her formerly alcoholic husband may have been drinking on the day of the operation, speaks to Steven's anesthesiologist, Matthew, who reveals that Steven did in fact have a few drinks that morning. Anna performs a sexual favor on Matthew as payment for the information. At Anna's insistence, the children are transported to their home, where they are tube-fed. Steven then kidnaps Martin, brutally beating him and demanding that he reverse the condition of the children. Martin is unaffected, warning Steven that time is running out.\nMartin's presence only exacerbates the tension in the household, with Kim and Bob arguing over who their father will choose, while Anna claims that killing one of the children is clearly the only option, as she can have another. Kim attempts to save herself by escaping and crawling through the neighborhood. Steven and Anna retrieve her. The next morning, Anna releases Martin as holding him captive was no use. Bob begins bleeding from the eyes—the final stage before death. Rather than choose, Steven binds Kim, Bob, and Anna to chairs, covers their heads, and pulls a woolen hat over his own face. He loads a rifle, spins in circles, and fires. The first two shots miss, but the third kills Bob.\nSome time later, the family visits the same diner where Steven met with Martin. Martin enters and stares at them; he and the family briefly lock eyes and the Murphys leave as Martin gazes after them.", "cast": "Colin Farrell as Steven Murphy\nNicole Kidman as Anna Murphy\nBarry Keoghan as Martin\nRaffey Cassidy as Kim Murphy\nSunny Suljic as Bob Murphy\nAlicia Silverstone as Martin's mother\nBill Camp as Matthew"}