{"_movieID": "190859", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:17:43", "summary": "American Sniper is a 2014 American biographical war drama film directed by Clint Eastwood and written by Jason Hall. It is loosely based on the memoir American Sniper: The Autobiography of the Most Lethal Sniper in U.S. Military History (2012) by Chris Kyle, with Scott McEwen and Jim DeFelice. The film follows the life of Kyle, who became the deadliest marksman in U.S. military history with 255 kills from four tours in the Iraq War, 160 of which were officially confirmed by the Department of Defense. While Kyle was celebrated for his military successes, his tours of duty took a heavy toll on his personal and family life. The film was produced by Eastwood, Robert Lorenz, Andrew Lazar, Bradley Cooper, and Peter Morgan. It stars Cooper as Kyle and Sienna Miller as his wife Taya, with Luke Grimes, Jake McDorman, Cory Hardrict, Kevin Lacz, Navid Negahban, and Keir O'Donnell in supporting roles.\nThe world premiere was on November 11, 2014, at the American Film Institute Festival, followed by a limited theatrical release in the United States on December 25, 2014, and a wide release on January 16, 2015. The film became a major success, with a worldwide gross of over $547 million, making it the highest-grossing film of 2014 in the United States ($350 million), the highest-grossing war film of all time unadjusted for inflation, and Eastwood's highest-grossing film to date.\nThe film received mostly positive reviews from critics, with the majority of praise directed towards Cooper's lead performance and Eastwood's direction, though it attracted some controversy over its portrayal of both the War in Iraq and of Chris Kyle. At the 87th Academy Awards, American Sniper received six nominations, including Best Picture, Best Adapted Screenplay, and Best Actor for Cooper, ultimately winning one award for Best Sound Editing.", "plot": "Growing up in Texas, Chris Kyle is taught by his father how to shoot a rifle and hunt deer. Years later, Kyle has become a ranch hand and rodeo cowboy, and returns home early, to find his girlfriend in bed with another man. After telling her to leave, he is mulling it over with his brother when he sees news coverage of the 1998 U.S. embassy bombings and decides to enlist in the Navy. He qualifies for special training and becomes a U.S. Navy SEALs sniper.\nKyle meets Taya Studebaker at a bar, and the two soon marry. He is sent to Iraq after the September 11 attacks. His first kills are a woman and boy who attacked U.S. Marines with a Russian made RKG-3 anti-tank grenade. Kyle is visibly upset by the experience but later earns the nickname \"Legend\" for his many kills. Assigned to hunt for the al-Qaeda leader, Abu Musab al-Zarqawi, Kyle interrogates a family whose father offers to lead the SEALs to \"The Butcher\", al-Zarqawi's second-in-command. The plan goes awry when The Butcher captures the father and his son, killing them while Kyle is pinned down by a sniper. This sniper goes by the name Mustafa and is an Olympic Games medalist from Syria. Meanwhile, the insurgents issue a bounty on Kyle.\nKyle returns home to his wife and the birth of his son. He is distracted by memories of his war experiences and by Taya's concern for them as a couple – she wishes he would focus on his home and family.\nKyle leaves for a second tour and is promoted to Chief Petty Officer. Involved in a shootout with The Butcher, he helps in killing him. When he returns home to a newborn daughter, Kyle becomes increasingly distant from his family. On Kyle's third tour, Mustafa seriously injures a unit member, Ryan \"Biggles\" Job, and the unit is evacuated back to base. When they decide to return to the field and continue the mission, another SEAL, Marc Lee, is killed by gunfire.\nGuilt compels Kyle to undertake a fourth tour, and Taya tells him that she may not be there when he returns. Back in Iraq, Kyle is assigned to kill Mustafa, who has been sniping U.S. Army combat engineers building a barricade. Kyle's sniper team is placed on a rooftop inside enemy territory. Kyle spots Mustafa and takes him out with a risky long distance shot at 2,100 yards (1,920 m), but this exposes his team's position to numerous armed insurgents. In the midst of the gunfight, and low on ammunition, Kyle tearfully calls Taya and tells her he is ready to come home. A sandstorm provides cover for a chaotic escape in which Kyle is injured and almost left behind.\nAfter Kyle gets back, on edge and unable to adjust fully to civilian life, he is asked by a Veterans Affairs psychiatrist if he is haunted by all the things he did in war. When he replies that it is \"all the guys [he] couldn't save\" that haunt him, the psychiatrist encourages him to help severely wounded veterans in the VA hospital. After that, Kyle gradually begins to adjust to home life.\nYears later, on February 2, 2013, Kyle says goodbye to his wife and family as he leaves in good spirits to spend time with a veteran at a shooting range. An on-screen subtitle reveals: \"Chris Kyle was killed that day by a veteran he was trying to help\", followed by archive footage of crowds standing along the highway for his funeral procession. More are shown attending his memorial service."}