{"_movieID": "392044", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:44:36", "summary": "Murder on the Orient Express is a 2017 mystery thriller film directed by Kenneth Branagh with a screenplay by Michael Green, based on the 1934 novel of the same name by Agatha Christie. The film stars Branagh as Hercule Poirot, with Penélope Cruz, Willem Dafoe, Judi Dench, Johnny Depp, Josh Gad, Derek Jacobi, Leslie Odom Jr., Michelle Pfeiffer, and Daisy Ridley in supporting roles. The film is the fourth screen adaptation of Christie's novel, following the 1974 film, a 2001 TV film version, and a 2010 episode of the television series Agatha Christie's Poirot. The plot follows Poirot, a world-renowned detective, as he seeks to solve a murder on the famous trans-European train in the 1930s.\nPrincipal photography began in November 2016 in the United Kingdom; it is one of the few productions in recent decades to have used 65 mm film cameras. Murder on the Orient Express had its world premiere on November 2, 2017 at Royal Albert Hall in London, and was released in theatres in the United Kingdom on November 3, 2017, and in the United States on November 10, 2017, by 20th Century Fox. The film grossed over $351 million worldwide and received mixed reviews from critics, with praise for the cast's performances and the production value, but some criticism for not adding anything new to previous adaptations.\nA sequel, titled Death on the Nile, is scheduled to be released on October 2, 2020.\n\n", "plot": "In 1934, famous Belgian detective Hercule Poirot solves a theft at the Church of the Holy Sepulchre in Jerusalem. The obsessive-compulsive—who seeks balance in life, and considers his case-solving ability to see a lie amid truth to be a curse—wants to rest in Istanbul, but must return to London for another case. His friend Bouc, director of the Simplon-route Orient Express service, arranges a bunk for him aboard the train.\nUnscrupulous businessman Edward Ratchett offers to hire Poirot as his bodyguard during the three-day journey, having received threatening letters from an unknown party, but Poirot refuses. That night, Poirot hears strange noises coming from Ratchett's compartment, and later sees someone in a red kimono running down the hallway. An avalanche derails the train's engine, stranding the passengers.\nThe next morning, Poirot discovers Ratchett was murdered during the night after having been stabbed a dozen times. Poirot and Bouc investigate the other passengers as repairs begin. Evidence indicates that Ratchett was murdered by one person, and Caroline Hubbard, a fellow passenger, claims that a man had been in her compartment in the night. Poirot discovers a partially burned note connecting Ratchett to the kidnapping of Daisy Armstrong, a child who was abducted from her bedroom and held for ransom. Though the family paid the ransom, Daisy was murdered nonetheless. Ratchett's true identity is revealed: he was John Cassetti, Daisy's kidnapper and murderer. The shock of her death caused her mother Sonia to die after giving premature birth to a stillborn baby; her father, Colonel John Armstrong, then committed suicide. The family's nursemaid Susanne was wrongly suspected of complicity, leading to her being arrested and subsequent suicide in police custody, only to be found innocent afterward.\nMore evidence is found, including a bloodstained handkerchief, and, in Mrs. Hubbard's compartment, the button of a conductor's uniform. The uniform is later found, as is the red kimono—in Poirot's own suitcase. Hubbard is suddenly stabbed in the back; she survives but cannot identify the culprit. Poirot discovers many of the passengers have direct connections to the Armstrong family and uncovers their hidden pasts. While interviewing governess Mary Debenham, Poirot is shot in the shoulder by Doctor John Arbuthnot, who claims responsibility for the murder, but Bouc stops him from killing Poirot. Poirot realizes that Arbuthnot—a medical doctor and former army sniper—never meant to kill him.\nPoirot confronts the suspects outside the train, offering two theories of how Cassetti died. The first is simple but does not meet all of the facts: A murderer disguised as a conductor boarded the train at a previous stop, murdered Cassetti, and fled at the stop as the train left. The second is more complex: with every single suspect connected to the Armstrongs, Susanne, or her trial in some way, they all had a motive against Cassetti. Poirot predicts that they acted together. Hubbard is revealed to be Linda Arden, a former stage actress and aspiring director, and Sonia Armstrong's mother.\nHubbard confirms the latter, admitting that she planned the murder and had recruited everyone else to help her. All the other passengers and the Conductor, Pierre Michel (Susanne's brother), took turns stabbing Cassetti. Mary wore the kimono, and Arbuthnot stabbed Hubbard without endangering her life, to convince Poirot of a lone killer. Poirot challenges the passengers and Michel to shoot him with a confiscated gun since he is the only one who can expose their plot; Bouc can lie, but Poirot, obsessed with truth and balance, cannot. Hubbard grabs the gun and tries to kill herself, but it is not loaded; Poirot wanted to see how the suspects would react.\nWith the train back on track, Poirot concludes that justice is impossible in this case, as Cassetti deserved death; for the first time, Poirot will have to live with a lie and imbalance. He presents the lone killer theory to the Yugoslavian police, allowing the others to leave on the train. As he disembarks, a British Army messenger asks him to investigate a death on the Nile. Poirot accepts the case."}