{"_movieID": "34544", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:17:00", "summary": "The A-Team is an American action-adventure television series that ran on NBC from 1983 to 1987 about former members of a fictitious United States Army Special Forces unit.  The members, after being court-martialed \"for a crime they didn't commit\", escaped from military prison and, while still on the run, worked as soldiers of fortune. The series was created by Stephen J. Cannell and Frank Lupo. A feature film based on the series was released by 20th Century Fox in 2010.", "plot": "The A-Team is a naturally episodic show, with few overarching stories, except the characters' continuing motivation to clear their names, with few references to events in past episodes and a recognizable and steady episode structure. In describing the ratings drop that occurred during the show's fourth season, reviewer Gold Burt points to this structure as being a leading cause for the decreased popularity \"because the same basic plot had been used over and over again for the past four seasons with the same predictable outcome\". Similarly, reporter Adrian Lee called the plots \"stunningly simple\" in a 2006 article for The Express (UK newspaper), citing such recurring elements \"as BA's fear of flying, and outlandish finales when the team fashioned weapons from household items\".  The show became emblematic of this kind of \"fit-for-TV warfare\" due to its depiction of high-octane combat scenes, with lethal weapons, wherein the participants (with the notable exception of General Fulbright) are never killed and rarely seriously injured (see also On-screen violence section).\nAs the television ratings of The A-Team fell dramatically during the fourth season, the format was changed for the show's final season in 1986–87 in a bid to win back viewers. After years on the run from the authorities, the A-Team is finally apprehended by the military. General Hunt Stockwell, a mysterious CIA operative played by Robert Vaughn, propositions them to work for him, whereupon he will arrange for their pardons upon successful completion of several suicide missions. In order to do so, the A-Team must first escape from their captivity. With the help of a new character, Frankie \"Dishpan Man\" Santana, Stockwell fakes their deaths before a military firing squad. The new status of the A-Team, no longer working for themselves, remained for the duration of the fifth season while Eddie Velez and Robert Vaughn received star billing along with the principal cast. The missions that the team had to perform in season five were somewhat reminiscent of Mission: Impossible, and based more around political espionage than beating local thugs, also usually taking place in foreign countries, including successfully overthrowing an island dictator, the rescue of a scientist from East Germany, and recovering top secret Star Wars defense information from Soviet hands. These changes proved unsuccessful with viewers, however, and ratings continued to decline. Only 13 episodes aired in the fifth season.  In what was supposed to be the final episode, \"The Grey Team\" (although \"Without Reservations\" was broadcast on NBC as the last first-run episode in March 1987), Hannibal, after being misled by Stockwell one time too many, tells him that the team will no longer work for him. At the end, the team discusses what they were going to do if they get their pardon, and it is implied that they would continue doing what they were doing as the A-Team.  The character of Howling Mad Murdock can be seen in the final scene wearing a T-shirt that says, \"Fini\"."}