{"_movieID": "59678", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:29:34", "summary": "Attack the Block is a 2011 British science fiction comedy horror film written and directed by Joe Cornish and starring John Boyega, Jodie Whittaker, and Nick Frost. It was the film debut of Cornish, Boyega, and composer Steven Price.\nThe film centres on a teenage street gang who have to defend themselves from predatory alien invaders on a council estate in South London on Guy Fawkes Night. Released on 11 May 2011, it underperformed at the box office but received a positive critical reception, with particular praise for Cornish's direction and Boyega's performance, and several international accolades.\n\n", "plot": "Samantha Adams, a trainee nurse, is mugged by a gang of teenage hoodlums: Pest, Dennis, Jerome, Biggz, and leader Moses. When a meteorite falls from the sky into a nearby car, Samantha escapes. As Moses searches the wreck of the car for valuables, his face is scratched by a small alien creature. The creature runs away, but the gang chase and kill it. Hoping to gain fame and fortune, they take the dead animal to their acquaintance, cannabis dealer Ron and his boss Hi-Hatz.\nMore objects fall from the sky. Eager to fight the creatures, the gang arm themselves and go to the nearest crash site. However, they find these aliens are much larger and threatening. Fleeing the aliens, the gang are intercepted by two policemen accompanying Samantha, and Moses is arrested. The aliens follow Moses and maul the unarmed officers to death, leaving Samantha and Moses trapped inside a van. Dennis reaches the vehicle and drives away, only to crash into Hi-Hatz's car. Samantha runs away while the rest of Moses's gang catch up and confront Hi-Hatz and his henchman.\nThe gang try to flee to Wyndham Tower, but are attacked by the aliens; Biggz is forced to hide and Pest is bitten in the leg. They find that Samantha lives in their building and persuade her to treat Pest's leg. An alien bursts in and Moses kills it with a samurai sword. Realizing that the group was not lying about the creatures being extraterrestrial, Samantha joins them.\nThe gang moves upstairs to the flat owned by Tia, Dimples, Dionna, and Gloria, believing that their security gate will keep them safe. The aliens instead attack from outside, smashing through the windows and decapitating Dennis. The girls believe them to be the focus of the creatures and kick them out of the flat. Hi-Hatz and two more henchmen attack the gang, but an alien arrives and chases Hi-Hatz and the henchmen into a lift. \nMaking their way upstairs to Ron's weed room, the gang runs into more aliens, but using fireworks as a distraction, they manage to get through. Jerome becomes disoriented in the smoke and is killed by an alien. Entering Ron's flat, they find that Hi-Hatz waiting for them there. Hi-Hatz prepares to shoot Moses, but multiple aliens break through the window and kill him. They are now joined by Brewis, one of Ron's customers and a zoology student. Moses, Pest and Samantha retreat into the weed room, while Ron hides in the flat.\nIn the weed room, Brewis notices a luminescent stain on Moses' jacket under the ultraviolet light. Brewis theorises that the aliens are like spores, drifting through space on solar winds until they chance on a Habitable planet. After landing in an area with enough food, the female lets off a strong pheromone to attract the male creatures so that they can mate and propagate their species. The gang form a plan for Samantha, who has not been stained with the pheromone, to go to Moses's flat and turn on the gas oven.\nSamantha successfully avoids the aliens, turns on the gas, and leaves the block. Moses, with the body of the small alien strapped to his back, runs to the gas filled apartment with all of the aliens following him. He throws the dead small alien into the apartment, and then using fireworks he ignites the gas-filled room and leaps out of the window. In the aftermath, Moses, Pest, Brewis, and Ron are arrested and held responsible for the deaths around the block. In the back of the police van, Moses and Pest hear the residents of the block cheering for Moses. The police then ask Samantha to identify Moses and his friends as those who killed everyone, including the two police officers that had arrested Moses earlier. Instead Samantha corrects them by saying that all of the boys are her neighbors, and that they were the ones who protected her.", "cast": "Representative of the film's plot and location, most of the cast (many of whom spoke Multicultural London English during the film, were young, relative unknowns, and local to the area. According to the DVD's making-of featurette, the teenagers were selected from drama classes of London council estate schools, and then had to go through eight auditions before being offered a part. John Boyega found out about this film from an ad placed on the internet. The cast includes:\n\nJohn Boyega as Moses, a low level crook, teenage gang leader and orphan looking for respect around the block.\nJodie Whittaker as Samantha Adams, a trainee nurse and new resident of Wyndham Tower.\nAlex Esmail as Pest, a teenage jokester and second in command of Moses's gang.\nFranz Drameh as Dennis, a hotheaded pizza delivery boy and the enforcer of the gang.\nLeeon Jones as Jerome, a schoolboy and the most level headed member of the gang.\nSimon Howard as Biggz, the youngest member of the gang. Throughout most of the film, Biggz is trapped in a dumpster after he's cornered by the aliens.\nNick Frost as Ron, the local drug dealer who lives in the penthouse of Wyndham Tower and knows everyone.\nLuke Treadaway as Brewis, a student stoner who's one of Ron's customers.\nJumayn Hunter as Hi-Hatz, the local psychopathic gangster who's Ron's feared boss and the true main antagonist.\nDanielle Vitalis as Tia, a girl living in Wyndham Tower who's Moses's love interest and friend to the gang.\nPaige Meade as Dimples, Tia's quick tempered roommate who is also a friend to the gang.\nSammy Williams as Probs, a little kid who wishes to join Moses's gang.\nMichael Ajao as Mayhem, Probs's best friend who shares his goal of joining Moses's gang."}