{"_movieID": "136835", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:42:44", "summary": "No Good Deed is a 2014 American psychological thriller film directed by Sam Miller and written by Aimée Lagos. The film stars Idris Elba, Taraji P. Henson, Kate del Castillo, Mark Smith, Henry Simmons, Wilbur Fitzgerald and Frank Brennan. The film was released on September 12, 2014.\nDespite negative critical reception, the film was a box office success and received two Image Award nominations, winning one for Taraji P. Henson's performance.", "plot": "Colin Evans (Idris Elba) has been sentenced to ten years in prison for manslaughter in the state of Tennessee, after beating a man to death in a bar. Colin is suspected of murdering five young women, but couldn't be tried due to lack of evidence. He is eligible for parole halfway into his sentence, and during his parole hearing, Colin charms the parole board. He claims to be a changed man who is remorseful for his crime, and brings up a reading program he started in prison. The board members are nearly swayed, until one of them, a doctor, states that beneath Colin's charming facade is a malignant narcissist who reacts violently to rejection or not getting his way. As parole in Tennessee requires a unanimous vote, he is ordered back to prison. Frustrated and furious, Colin, having already charmed the two guards transporting him, feigns a nosebleed and brutally murders both of them.\nIn Atlanta, Terri Granger (Taraji P. Henson) is home with her young children. Her best friend Meg (Leslie Bibb) suggests that Terri relax and not stress herself with her children and husband Jeffrey (Henry Simmons). Meg knows that Terri's relationship with Jeffrey has been taxing. Hence, Meg tells her not to worry and that she will visit her at night for a 'girls' night' to cheer Terri up. When Jeffrey arrives home, he immediately starts packing and preparing to spend his father's birthday on a golfing trip. He reminds her( when she complains about her situation) that she chose to be a stay-at-home-mom, then leaves her and his kids behind.\nColin stalks his ex-fiancée Alexis (Kate del Castillo) and witnesses her meeting another man at an outdoor cafe. She greets the man with a hug and joins him at a table. Colin follows her home where he confronts her on not reading his letters from prison. He also demands to know is she cheated on him. When Alexis admits that she did, Colin murders her in a blind rage. Later, Colin is driving on a dark road in a terrible storm and loses control of his car, crashing it into a tree. Walking down the road, he notices one house with the lights on, and it is Terri's. He rings her doorbell and asks her if he can use her phone to call for a tow truck. She is at first apprehensive, but she gives him the phone. They engage in chit chat, and, feeling more comfortable with the stranger, she invites him inside. Terri reveals that before she married and had children, she was a criminal prosecutor for the District Attorney's office. Colin tells Terri that he just broke up with his fiancée because she was cheating on him.\nMeg arrives at the house and is shocked to see Colin. When she inquires about where he lives, he is evasive. Later, the three talk and share glasses of wine. When Terri leaves momentarily to comfort her baby, Meg and Colin are left alone. Colin excuses himself for a cigarette break. Meg follows him into the garage, smokes with him and resumes her inquiries about him. Colin suggests that he is having an affair with Terri, but Meg doubts Terri would not have previously confided this. Meg bluntly tells him that his story \"doesn't add up\" and declares that she will find out the truth. She begins to call out to Terri, but Colin quickly grabs a shovel and bashes Meg in the head with it, killing her.\nTerri returns to the hall after putting her baby to bed and is surprised to see that Meg is not there. Colin tells Terri that Meg left, but Terri is suspicious, especially when she sees Meg's umbrella in the stand. Terri realizes that Colin is not the nice person that he appeared to be. Alarmed, she rushes to the kitchen to call the police, only to find out that Colin has disconnected all the wires and hidden all of her knives. She realizes that she and her children are in danger, and she rushes to her daughter Ryan's bedroom, finding Colin playing with the child. Seeing a firearm in his back pants, she takes the girl away and puts her to bed. As they walk out of Ryan's bedroom, Terri hits him with a fire extinguisher after spraying him in the face with it. He falls down the stairs, and she runs to get her children, but as she leaves Ryan's room, she sees that Colin has recovered. He tells her to put the children back in their rooms and threatens her with his cocked gun. Terri obeys him (including taking her clothes off in his presence). When he bends down to put on his shoes, she manages to strike him unconscious and locks herself into her home office where there is a fax machine. She dials 911 for help. Colin recovers and breaks down the door to the office. He yanks the phone out of her hand just as she finishes her call. She begs him to leave, explaining him that the police are coming, that his blood is all over her kitchen (because she managed to cut him). Colin forces her to take the children into her vehicle and drive away with him. While walking out of the garage, Terri sees Meg's dead body on the floor.\nTearfully, Terri asks him why he is doing this; Colin replies that she will see for herself soon. He refuses to tell her their destination. As they pass a police car on the road, Terri flashes her headlights when she thinks Colin is not looking, hoping to catch their attention. The police car forces them to pull over, and Colin grabs her baby to force her to act normal while the policeman questions them. Ryan indirectly reveals to the cop that Colin isn't Terri's husband, and he orders her out of the car alone. Terri is eventually coaxed by him into revealing that Colin has kidnapped her, and the policeman pretends to let her go while ordering her not to move so he can arrest the abductor. Unfortunately, the convict catches on and shoots the cop dead before he can rescue his hostages. Colin then forces Terri back into the car.\nColin makes Terri drive to Alexis' house. She panics when she sees Alexis' dead body in the bedroom. As she tries to find the first aid kit in the house, the high winds from the storm cause Terri's car alarm to activate. Worried that the noise will attract attention, Colin binds her hands behind her back and her feet with medical gauze while he goes to check on the car. As Colin exits the house, Alexis' phone rings. Terri manages to answer the phone and is surprised to hear the voice of her husband Jeffrey, who is calling Alexis to find out why she has not arrived at the hotel for a rendezvous with him. Terri realizes that he was not out of town with his father after all and has been having an affair with Alexis. Terri also realizes that the encounter with Colin was not so random and that Colin wants revenge on Jeffrey because of his affair with Alexis. Terri tells her surprised husband the truth and has him call 911. She misleads Colin into thinking that she and her children have escaped. When Colin discovers her, she attacks him, grabbing his gun and shooting him until he falls out of a window, dead.\nThe police arrive with Jeffrey. He tells Terri that he is sorry and that Alexis meant nothing to him. Terri punches Jeffery in the face and walks away. Sometime later, a much more confident Terri returns to her career and has moved into a new house with her children.", "cast": "Idris Elba as Colin Evans\nTaraji P. Henson as Terri Granger\nLeslie Bibb as Meg, Terri's friend\nKate del Castillo as Alexis, Colin's ex-fiancee\nHenry Simmons as Jeffrey Granger, Terri's husband\nMark Smith as EMT\nWilbur Fitzgerald as Dr. Ross\nMirage Moonschein as Ryan Granger, Terri and Jeffrey's daughter"}