{"_movieID": "59108", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:48:06", "summary": "Tower Heist is a 2011 American heist comedy film directed by Brett Ratner and written by Ted Griffin and Jeff Nathanson, based on a story by Bill Collage, Adam Cooper and Griffin. The plot follows Josh Kovaks (Ben Stiller), Charlie Gibbs (Casey Affleck) and Enrique Dev'reaux (Michael Peña), employees of an exclusive apartment building who lose their pensions in the Ponzi scheme of Wall Street businessman Arthur Shaw (Alan Alda). The group enlist the aid of criminal Slide (Eddie Murphy), bankrupt businessman Mr. Fitzhugh (Matthew Broderick) and another employee of the apartment building, Odessa (Gabourey Sidibe), to break into Shaw's apartment and steal back their money while avoiding the FBI agent in charge of his case, Claire Denham (Téa Leoni).\nTower Heist began development as early as 2005, based on an idea by Murphy that would star himself and an all-black cast of comedians as a heist group who rob Trump International Hotel and Tower. As the script developed and changed into an Ocean's Eleven–style caper, Murphy left the project. Ratner continued to develop the idea into what would eventually become Tower Heist, with Murphy later rejoining the production. Filming took place entirely in New York City on a budget of $75 million (after tax rebates), with several buildings provided by Donald Trump used to represent the eponymous tower. The film score was composed by Christophe Beck and released commercially on November 1, 2011.\nThe film received mixed reviews with much of the praise going to the cast, including Broderick, Leoni and Stiller. However, Murphy was repeatedly singled out by critics as the star of the film, with critics feeling that he displayed a welcome return to the comedic style of his early career. Much of the criticism received by the film was focused on the plot, which was considered \"formulaic,\" \"rushed,\"  \"dull\"  and \"laborious.\"  The film was released on November 4, 2011 and earned $152 million worldwide.\nPrior to release, the film was involved in a controversy over plans by Universal Pictures to release it for home viewing on video on demand to 500,000 Comcast customers, only three weeks after its theatrical debut. Concern over the implementation's harming ticket sales and inspiring further films to follow suit resulted in several theater chains' refusal to show the film at all if the plan went ahead, forcing Universal to abandon the idea.\n\n", "plot": "Josh Kovaks is the building manager of The Tower, an upscale apartment complex in New York City. Its employees include Josh's brother-in-law, concierge Charlie Gibbs, who is expecting a child with Josh's sister; Enrique Dev'Reaux, a newly hired elevator operator; Lester, the doorman nearing retirement; Odessa Montero, an immigrant maid from Jamaica threatened with deportation; and receptionist Miss Iovenko, who is studying to become a lawyer.\nOne morning Josh witnesses what he believes is Arthur Shaw, The Tower's penthouse tenant, being kidnapped. Josh gives chase, but is tackled by FBI agent Claire Denham, who has Shaw arrested and explains to Josh that Shaw was actually attempting to flee the country to resist arrest for masterminding a Ponzi scheme, embezzling $2 billion. Josh confesses to the Tower staff that he gave their pensions to Shaw to invest, and they have lost everything; Lester attempts suicide by stepping in front of a train, but survives. After visiting Lester in the hospital, Josh, Charlie, and Enrique confront Shaw, under house arrest in his penthouse apartment. Shaw expresses condolences, but is not sincere enough when he forgets to ask if Lester is all right. Out of anger, Josh smashes the windows of the 1963 Ferrari 250 GT Lusso displayed in Shaw's apartment living room, which Shaw claims was originally owned and raced by Steve McQueen. Josh's boss Mr. Simon fires him for his actions, as well as Charlie and Enrique, who were with him at the time of his actions.\nJosh meets Denham at a bar where she drunkenly suggests that Shaw has concealed $20 million as a reserve, and that Josh should steal it. Josh, Charlie, Enrique, and evicted Tower tenant Mr. Fitzhugh conspire to find and steal the money from Shaw's assumed safe. They supplement their inexperience by enlisting Josh's childhood friend Slide, a petty criminal, and Odessa, who has locksmith experience that can help open the safe. Charlie is later rehired as the Tower's new manager, and still feeling uncomfortable with Josh's plan, warns Josh that he must abandon it, or Charlie will turn him over to the police. Subsequently, Denham informs Josh that Shaw is scheduled to attend court on Thanksgiving during the Macy's Thanksgiving Day Parade to avoid publicity, and that Shaw will be set free. Josh and his team decide to break into Shaw's apartment during the parade.\nHowever, Slide attempts to betray the team by reaching the safe ahead of them and taking all of the money for himself, having tricked Odessa into giving him lessons. The team intercepts him at Shaw's apartment and during the ensuing altercation, they break down a false wall, revealing Shaw's safe, which turns out to be empty. Slide and Fitzhugh fight over Slide's gun, which Fitzhugh accidentally fires, and the bullet hits the car's hood, revealing gold underneath the Ferrari's paint. They realize that Shaw used his money to buy gold, turn it into car parts, and assembled the car to hide the money in plain sight. Later, Josh finds a ledger of Shaw's illegal finances in the car's glove box.\nAs they reach the lobby, Denham and Shaw return revealing the Thanksgiving Day court date to be a ruse. Denham notes the missing car and Shaw's safe remanding him back into federal custody until his real court date for violating his bail by not declaring the latter. Denham and the FBI arrest Josh and the crew (except Slide) as they walk out of The Tower. Miss Iovenko arrives, telling the FBI that she passed her bar exam three days ago and will be Josh's attorney. She shows them Shaw's ledger containing all his illegal dealings and tells them she will turn it over in exchange for everyone's freedom. The FBI accepts on the condition that Josh, being the primary conspirator, serve a minimal two-year sentence. Shaw pleads guilty and is sentenced to life in prison.\nThe team retrieve the car, take it apart and send various parts to Tower employees to compensate for their lost pensions. As Josh is led to his cell, a satisfied smile slowly forms on his face.", "cast": "Ben Stiller as Josh KovaksThe Tower's manager. Stiller was paid $15 million for the role.Eddie Murphy as Darnell \"Slide\" DavisA petty crook and Josh's childhood friend whom Josh turns to for help. Murphy joined the cast on October 13, 2010, and became a producer on the film. He was paid $7.5 million for his work.Casey Affleck as Charlie GibbsThe Tower's concierge and Josh's brother-in-law. Affleck wanted to participate in the film as he was interested in playing a comedy role, saying \"it sounded like a fun film to do. I wanted to do a comedy, and I thought this was an opportunity to try and be funny.\" Grazer felt that Affleck would be perfect for the role because of his deadpan timing.Alan Alda as Arthur ShawA Wall Street billionaire placed under house arrest for stealing $2 billion. On his character, Alda said \"Shaw is sometimes described as a Bernie Madoff like character. I don't think anyone has ever operated on the scale that Madoff did. And I don't know if what Shaw did technically qualifies as a Ponzi scheme. Shaw was willing to steal money from people who really needed it – who couldn't afford to lose it – and was willing to take everything they had…yes, he's in Bernie territory, with both feet.\" Ratner initially approached Robert Redford to play the role, being a fan of his work in the heist film The Hot Rock, but Redford turned him down.Matthew Broderick as Mr. FitzhughA bankrupt former Wall Street investor. Broderick joined the cast on October 26, 2010.Téa Leoni as Claire DenhamAn FBI special agent assigned to Shaw's case. Leoni joined the cast on October 21, 2010. Leoni worked with FBI technical advisor Anne C. Beagan to prepare for her role. On her character and work with Beagan, Leoni said: \"Agent Denham is your standard-issue, ball-breaking FBI agent. She's certainly a very tough lady, and it's not my first waltz with this type of character. However, I was able to spend some time with Anne, a great technical advisor we had on set. She's got this steely gaze that is terrifying, but what's underneath that is a very interesting lady. Beyond the technical aspects of the job, she provided so much more for me to use.\"Michael Peña as Enrique Dev'reauxThe elevator operator and the newest employee of the building staff. Peña was cast on October 19, 2010.Gabourey Sidibe as Odessa MonteroA Jamaican-born maid threatened with deportation by Shaw's theft. To perform her character's Jamaican accent, Sidibe had three dialect coaches help her prepare along with a friend of Jamaican heritage. Additionally, Sidibe worked with an actual safecracker to accurately portray breaking into locks. Sidibe was cast on October 19, 2010.Judd Hirsch plays Mr. Simon, The Tower's General Manager, and Stephen Henderson plays Lester, The Tower's retiring doorman. Henderson was cast after the filmmakers saw his performance in August Wilson's Fences on Broadway. The cast is rounded out by Nina Arianda as Miss Iovenko, attorney-in-training, Juan Carlos Hernandez as Manuel, The Tower's head of security, Harry O'Reilly as FBI Agent Dansk, Marcia Jean Kurtz as Rose, Peter Van Wagner as attorney Marty Klein, James Colby as Special Agent Huggins and Željko Ivanek as FBI Director Mazin. Jessica Szohr plays Sasha Kovaks-Gibbs, Charlie's pregnant wife, who is also Josh's sister. Heavy D has a cameo appearance as a guard at a courthouse. Model Kate Upton cameos as the mistress of a Tower resident. Robert Downey Sr. has a cameo as Judge Ramos."}