{"_movieID": "64328", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:35:14", "summary": "The Muppets are an ensemble cast of puppet characters known for their absurdist, burlesque, and self-referential style of variety-sketch comedy. Created by Jim and Jane Henson in 1955, they are the namesake for the Disney media franchise that encompasses television, music, film, and other media associated with the characters.\nThe Muppets originated in the short-form television series Sam and Friends, which aired from 1955 to 1961. Following appearances on late night talk shows and in advertising during the 1960s, the Muppets began appearing on Sesame Street in 1969. The Muppets attained celebrity status and international recognition through The Muppet Show (1976–1981), which received four Primetime Emmy Award wins and twenty-one nominations during its five-year run.\nDuring the 1970s and 1980s, the Muppets diversified into theatrical films, including The Muppet Movie (1979); The Great Muppet Caper (1981); and The Muppets Take Manhattan (1984). The Walt Disney Company began involvement with the Muppets in the late 1980s, during which Henson entered negotiations to sell The Jim Henson Company. The Muppets continued their media presence in the 1990s with television series The Jim Henson Hour (1989) and Muppets Tonight (1996–98), both of which were similar in format to The Muppet Show, and three films: The Muppet Christmas Carol (1992), Muppet Treasure Island (1996), and Muppets from Space (1999).\nDisney acquired the Muppets in February 2004, allowing the characters to gain broader public exposure than in previous years. Under Disney, subsequent projects included two films: The Muppets (2011) and Muppets Most Wanted (2014); a short-lived primetime series on ABC; and a reboot of the Muppet Babies animated series.\nIn their six-decade career, the Muppets have been regarded as a staple of the entertainment industry and popular culture in the United States and English-speaking area generally, being recognized by various cultural institutions and organizations, including the American Film Institute, Academy of Motion Picture Arts and Sciences, Library of Congress, and the Hollywood Walk of Fame."}