{"_movieID": "205588", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:48:41", "summary": "Our Kind of Traitor is a 2016 British spy thriller film directed by Susanna White and written by Hossein Amini, adapted from John le Carré's novel of the same name. Starring Ewan McGregor, Naomie Harris, Stellan Skarsgård, Damian Lewis, and Alicia von Rittberg, the film was released in the United Kingdom on 13 May 2016 by Lionsgate.", "plot": "As part of a plan to launder billions of dollars in London, \"the Prince\" – the head of the Russian Mafia – creates a new bank and has its financial oligarchs sign over their accounts to him. The first oligarch to do so is murdered alongside his family by a blue-eyed assassin.\nPoetics lecturer Perry MacKendrick  and his barrister wife Gail are on a holiday in Morocco. Perry strikes up a friendship with Dima, a hearty and boisterous Russian with an eidetic memory. The two men bond over drinks and tennis before Dima invites both MacKendricks to his daughter's birthday where Dima gives Perry a USB stick that links corrupt British politicians and businessmen to the Russian mafia. He fears for his life after hearing of his fellow oligarch's fate, and pleads with Perry to turn the USB stick over to MI6 when he returns to London.\nPerry turns the information over to MI6 agent Hector, the investigator in charge. The information provided by Dima enables Hector and his supervisor Billy to witness a meeting between the Prince and corrupt politician Aubrey Longrigg. Billy refuses to sanction an investigation on a chance meeting. Hector continues regardless and recruits the MacKendricks to help stage a chance encounter with Dima in France. There, Dima provides all the names of his clients and confirms each banker and politician involved has received £5 million each for their endorsement of the new bank, with Longrigg receiving £30 million. Dima refuses to provide the bank account numbers that would verify the corruption until he and his family have been granted asylum in London.\nEmilio, the Prince's consigliere, suspects the MacKendricks and has henchman Niki intimidate them by bringing them to his rough neighbourhood. While there, the blue-eyed assassin beats a woman and Perry defends her. Gail is touched by her husband's protectiveness of others, and their relationship begins to heal. Hector reveals to the MacKendricks that he only has two men and that he has been funding the operation himself, and they plan to seize Dima and his family simultaneously after Dima has signed the accounts over to the bank. Gail successfully retrieves Dima's wife and children, and Dima kills Niki before Perry can find him and bring him to safety.\nAs the family are about to board a charter plane back to London, Billy calls Hector and informs him that Longrigg has convinced the Home Office the family be denied asylum. With their plan thwarted, Hector must return to London alone. The MacKendricks refuse to leave Dima and the family until the asylum is granted and they are safe in London.\nGiven the MacKendricks' involvement, Hector sends everyone to a safehouse in the French Alps. While there, Dima's daughter blows their cover by calling one of Dima's bodyguards, Andrei, by whom she is pregnant. Andrei traces the location of the call and the blue-eyed assassin leads an attack on the safehouse, but it is fended off by Dima and the agents. Dima chases the blue-eyed assassin into the woods, but is ambushed and beaten almost to death before Perry arrives and kills the assassin.\nMeanwhile, Hector has returned to London and attempted to convince the UK Treasury Office that the Prince's bank is a cover to launder the Russian mafia’s money in London. He succeeds, but for asylum to be granted to Dima and his family, he must provide proof in the form of all the account numbers and names of the corrupt UK politicians and bankers involved in endorsing the bank—the detail that Dima still has in his head.\nA deal is made that Dima must be sent to London first by helicopter, with his family to follow once the account information he has memorised has been verified. The attack at the safe house and his wife's insistence convinces Dima to go on ahead and Perry volunteers to accompany him.\nThe family and Gail are driven to another safe house while Dima, Perry and Hector's agent head to the helicopter rendezvous location. Sensing danger, Dima insists Perry not come with him on the helicopter. Sure enough, it explodes over the Alps, killing Dima and Hector's agent and ruining the plan. Soon afterward, the mafia bank opens in London and begins trading at massive profit; Longrigg is announced as the new Minister of State for Trade and Investment.\nDima's family receives asylum after all, arranged by Hector as compensation for Dima's murder while under his protection. Perry visits Hector at home and gives him a gift from Dima, a box containing the ornate pistol that the Prince had given Dima upon the signing of the accounts. After Perry leaves, Hector finds a tiny roll of paper addressed to him from Dima with the list of all the corrupt Britons' names and account numbers hidden in the pistol's chamber. With this information, Hector is able to expose the Prince's money laundering network and the role of Longrigg and the other politicians within it."}