{"_movieID": "260514", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:45:33", "summary": "Cars 3 is a 2017 American 3D computer-animated comedy-adventure film produced by Pixar Animation Studios and released by Walt Disney Pictures. Directed by Brian Fee in his directorial debut and written by Kiel Murray, Bob Peterson and Mike Rich, it is the third installment of the Cars film franchise and a stand-alone sequel to Cars 2 (2011). It was executive-produced by then-chief creative officer of Walt Disney Animation Studios and Pixar, John Lasseter, who directed the first two Cars films. The returning voices of Owen Wilson, Bonnie Hunt and Larry the Cable Guy are joined by Cristela Alonzo, Chris Cooper, Armie Hammer, Nathan Fillion, Kerry Washington and Lea DeLaria, in addition to a dozen NASCAR personalities. In the film, Lightning McQueen sets out to prove to a new generation of high tech race cars that he is still the best race car in the world.\nReleased worldwide in movie theaters on June 16, 2017, along with its theatrical animated short film Lou, the film grossed $383 million worldwide and received mainly positive reviews from critics, who praised it as an improvement over its predecessor as well as its emotional story and animation. This was the last piece of Cars media where Katherine Helmond voices Lizzie two years before her death on February 23, 2019.", "plot": "Lightning McQueen and the other veteran racers of the Piston Cup racing series suddenly find themselves struggling to win against next-generation rookies like Jackson Storm, who utilize advanced technology and modern training methods. As Storm's breakout success attracts other rookies to the series, most of the veterans either retire or are fired to make way for the new generation. In the final race of the season, McQueen desperately attempts to overtake Storm but loses control and suffers a violent crash, leaving him badly injured.\nFour months later, McQueen is still recovering in Radiator Springs, isolating himself from his friends and spending his time watching footage of his late mentor, Doc Hudson. After receiving some encouragement from his girlfriend Sally, McQueen decides to return to racing and calls his sponsors from Rust-Eze, Rusty and Dusty, who reveal that they have sold the team to a new owner named Sterling. In a new state-of-the-art training center, Sterling assigns McQueen to train under racing trainer Cruz Ramirez. McQueen struggles to adapt to Cruz's modern methods and fails to improve, damaging an expensive simulator in the process, so Sterling tries to force him into retirement. McQueen offers a deal: if he can win the first race of the season, he can continue racing as long as he wants; otherwise, he will retire immediately. Sterling is worried about damaging McQueen's marketability, but accepts the deal, but assigns Cruz to join him.\nMcQueen tries to train on nearby Fireball Beach but ends up spending most of his time teaching Cruz how to drive on the sandy terrain. McQueen then attempts to join a race incognito at a famous dirt track called Thunder Hollow, but inadvertently enters a figure-8-style demolition derby with Cruz, which she wins. McQueen's identity is also discovered, adding to his humiliation. Distraught at the apparent waste of training time, McQueen rages at Cruz and in the process accidentally breaks her trophy. Cruz reveals that she had wanted to be a racer just like McQueen all her life, but never started a race due to her feeling intimidated and outclassed by the other racers. She resigns as McQueen's trainer and heads back to the training center.\nGuilty and with no other options, McQueen calls his friend Mater for advice. He suggests that McQueen tracks down Doc's mentor Smokey, in Doc's hometown of Thomasville, so McQueen catches up to Cruz and convinces her to rejoin him. In Thomasville, McQueen meets up with Smokey, who reveals that despite the fact Doc never raced again, he found a new happiness in training McQueen. After McQueen accepts that he will never be as fast as Storm, Smokey and his friends help McQueen learn new tricks to overcome his speed disadvantage, using Cruz as his sparring partner. However during the final practice race, Cruz suddenly overtakes him and he suffers a flashback to his crash, shaking his confidence.\nAt the race in Florida, McQueen starts last, but with coaching from Smokey in the pits, manages to gradually push up the ranks. Sterling, who still believes McQueen can't win, orders Cruz back to the training center, despite her wanting to stay and watch the race. Overhearing the exchange and remembering Cruz's dream of racing, McQueen instead has his crew outfit her to take his place. While shaky at first, Cruz is able to push up the ranks thanks to McQueen coaching her, and eventually ends up right behind Storm. Storm, feeling threatened, tries to intimidate Cruz, even to the point of ramming her against the wall in the final lap. Cruz, however, uses one of Doc's old tricks to outmaneuver him and wins the race.\nAs Cruz celebrates her victory, Sterling offers her a role on his team, but she instead takes a counteroffer from legendary owner Tex Dinoco. Sterling reminds McQueen about his bet, but as McQueen started the race that Cruz finished, he gets a share of the win, thus winning his bet. Sometime later, McQueen and Cruz return to Radiator Springs, where McQueen reveals that Tex, after seeing Sterling's callousness, has bought Rust-eze from him, and McQueen, now decked in Doc's racing colors, decides to continue racing and train Cruz.", "cast": "Owen Wilson as Lightning McQueen, a legendary Piston Cup veteran.\nCristela Alonzo as Cruz Ramirez, Lightning McQueen's trainer.\nChris Cooper as Smokey, Doc Hudson's former mechanic and crew chief.\nNathan Fillion as Sterling, a rich business car and the new Rust-eze team owner.\nLarry the Cable Guy as Mater, a jolly tow truck and Lightning McQueen's best friend.\nArmie Hammer as Jackson Storm, McQueen's new racing rival.\nTom and Ray Magliozzi as Rusty and Dusty Rust-eze, respectively, the owners of Rust-eze. Following Tom's death in 2014, unused archive recordings from the first film were used for Rusty's lines.\nTony Shalhoub as Luigi, a Fiat 500.\nGuido Quaroni as Guido, a forklift who is Luigi's best friend and assistant.\nBonnie Hunt as Sally Carrera, a Porsche 996, and Lightning McQueen's girlfriend.\nLea DeLaria as Miss Fritter, an intimidating monster school bus at the Thunder Hollow demolition derby.\nKerry Washington as Natalie Certain, a statistical analyst.\nBob Costas as Bob Cutlass\nMargo Martindale as Louise \"Barnstormer\" Nash\nIsiah Whitlock Jr. as River Scott\nBob Peterson as Chick Hicks/Dr. Damage\nJohn Ratzenberger as Mack\nLewis Hamilton as Hamilton\nLloyd Sherr as Fillmore\nJunior Johnson as Junior \"Midnight\" Moon\nCheech Marin as Ramone\nKatherine Helmond as Lizzie\nPaul Dooley as Sarge\nJenifer Lewis as Flo\nMadeleine McGraw as Maddy McGear\nMichael Wallis as Sheriff\nJerome Ranft as Red\nAngel Oquendo as Bobby Swift\nDiedrich Bader as Brick Yardley\nAndra Day as Sweet TeaAdditionally, several drivers and other racing-related personalities from NASCAR have cameos, including Chase Elliott, Ryan Blaney, Darrell Wallace Jr., Shannon Spake, Daniel Suárez, Kyle Petty, Mike Joy, Ray Evernham and as well as Darrell Waltrip, Humpy Wheeler, Jeff Gordon, and Richard Petty's return as Darrell Cartrip, Tex Dinoco, Jeff Gorvette, and Strip \"The King\" Weathers, who now acts as Cal Weathers' (his nephew) crew chief. Doc Hudson appears in flashbacks with unused audio recordings of the late Paul Newman from the first film."}