{"_movieID": "404368", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:13", "summary": "Ralph Breaks the Internet is a 2018 American 3D computer-animated comedy film produced by Walt Disney Animation Studios and distributed by Walt Disney Pictures. It is the sequel to the 2012 film Wreck-It Ralph, making it Disney's 57th feature-length animated film. The film was directed by Rich Moore and Phil Johnston (who wrote the screenplay with Pamela Ribon and his directorial debut) and executive-produced by John Lasseter, Chris Williams and Jennifer Lee. It features voice work by John C. Reilly, Sarah Silverman, Jack McBrayer, Jane Lynch and Ed O'Neill (reprising their roles from the first film), with Alan Tudyk returning to voice a new character and new additions to the cast that include Gal Gadot, Taraji P. Henson and Alfred Molina.\nThe first discussions about a sequel to Wreck-It Ralph began in October 2012, and the new installment went through three different scripts before the filmmakers settled on the final plot. When the film was officially announced in June 2016 as Ralph Breaks the Internet: Wreck-It Ralph 2, much of the original cast confirmed they had signed on, with new cast members added in 2018. It is Walt Disney Animation Studios' first animated film sequel to be created by the original film's writing and directing team and is the first sequel from the studio since 2011's Winnie the Pooh .Ralph Breaks the Internet had its world premiere at the El Capitan Theatre in Los Angeles, California, on November 5, 2018 and was released in the United States on November 21, 2018. The film has grossed over $529 million worldwide and it has received mostly positive reviews from critics, who called it a \"worthy successor\" and praised the animation, humor, characters, and plot, as well as the vocal performances of Reilly and Silverman. The film was nominated for Best Animated Feature at the 91st Academy Awards, 76th Golden Globe Awards, and 24th Critics' Choice Awards, but lost to Spider-Man: Into the Spider-Verse.", "plot": "Over the last six years, Wreck-it Ralph and Vanellope Von Schweetz have stayed best friends and hang out after work in Litwak's Arcade. Vanellope expresses how bored she has become of Sugar Rush's tracks, so Ralph sneaks into the game and makes a new track for her. The arcade player fights Vanellope's control, and causes the cabinet's steering wheel to break off. As the company that made Sugar Rush is defunct, and the cost of a replacement wheel on eBay is too high, Litwak decides to ship Sugar Rush away. Ralph and Vanellope help to evacuate the game before it is unplugged, and with Felix and Calhoun's help, find homes for all its citizens as a short term measure as they figure out how to save the game. After talking with Felix, Ralph decides to grab Vanellope and travel to the Internet via Litwak's new router.\nWith the help of the search engine KnowsMore, they are directed to eBay. They end up winning the auction for the wheel, but they unintentionally spike the price to more than US$27,000. They are given 24 hours to come up with the funds. On the way out, they run into J.P. Spamley, who offers them a lucrative job of stealing a car from Shank, the lead character in Slaughter Race. Entering that game, Vanellope becomes enthralled with its relative novelty compared to her own. They steal Shank's car, but she stops them before they can leave the game with it, recognizing Vanellope's driving talent. To help, Shank makes a viral video of Ralph and uploads it to BuzzzTube, and tells them to check with BuzzzTube's operator, Yesss, about getting money for it. At BuzzzTube, Yesss is elated by how popular Ralph's video is, and they come up with the idea of making more videos, which if given enough views, will earn them the money for the wheel in no time. Vanellope offers to help advertize the videos, and Ralph has Yesss send her to \"Oh My Disney\". There, Vanellope befriends the Disney Princesses, being encouraged by them to address her sense of unfulfillment and reaching a musical epiphany.\nRalph soon has made enough money, but cannot find Vanellope. He contacts her through a device Yesss had given them, and finds Vanellope talking with Shank about staying in Slaughter Race, having found her epiphany there. Ralph asks Spamley for a way to draw Vanellope out of the game, and he takes him to the Dark Net vendor Double Dan. Dan provides Ralph with a virus, Arthur, that feeds off insecurities and replicates them. When Ralph unleashes Arthur into Slaughter Race, it replicates Vanellope's glitch, triggering a server reboot. Shank and the others help Vanellope to escape before the game resets. Vanellope assumes that the crash was her fault, but Ralph confesses to her that the crash was his fault. Outraged, Vanellope ends her friendship with Ralph and throws away the hero cookie medal. Arthur scans Ralph and clones his personality flaws and starts making duplicates of Ralph, all wanting to keep Vanellope for themselves. Ralph finds the medal, but it's broken in two.\nThe Internet is soon overrun by Ralph clones in a DOS attack, all chasing after Vanellope. Ralph saves her, but the clones form a giant Ralph monster that seizes them both. Ralph comes to accept that Vanellope can make her own choices, letting go of his insecurities. This causes the giant Ralph monster and the clones to disappear. Ralph is caught in mid-air with help from the Disney Princesses. Ralph gives half of the broken medal to Vanellope and they bid each other a tearful farewell as Shank has arranged for Vanellope to respawn in Slaughter Race. Back in the arcade, Sugar Rush has been repaired. Ralph partakes in healthy social activities as he stays in touch with Vanellope over video chat. After hanging up, Ralph looks contently towards the sunrise then goes back to work with Felix."}