{"_movieID": "333371", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:17:14", "summary": "10 Cloverfield Lane is a 2016 American science fiction psychological horror film directed by Dan Trachtenberg in his directorial debut, produced by J. J. Abrams and Lindsey Weber and written by Josh Campbell, Matthew Stuecken and Damien Chazelle. The film stars Mary Elizabeth Winstead, John Goodman, and John Gallagher Jr. It is the second installment in the Cloverfield franchise. The story follows a young woman who, after a car crash, wakes up in an underground bunker with two men who insist that an event has left the surface of Earth uninhabitable.\nThe film was developed from a script titled The Cellar, but under production by Bad Robot, it was turned into a spiritual successor to the 2008 film Cloverfield. It is presented in a third-person narrative, in contrast to its predecessor's found-footage style. Principal photography took place under the title Valencia in New Orleans, Louisiana from October 20 to December 15, 2014.\n10 Cloverfield Lane premiered in New York City on March 8, 2016 and was released in select countries on March 10. It was released in the United States on March 11, 2016, in both conventional and IMAX formats. The film received positive reviews, with many praising the performances of the cast, as well as the film's tense and suspenseful atmosphere; it grossed $110 million worldwide.", "plot": "After breaking up with her boyfriend Ben, Michelle packs up and leaves New Orleans. While driving through rural Louisiana late at night, she hears car radio news reports of blackouts in several major cities before her red VW Jetta is abruptly sideswiped by a truck and rolls off the road, knocking her unconscious.\nMichelle wakes in a locked room within an underground bunker below a farmhouse very far outside of Lake Charles, her wounds tended to. She is frightened as a man steps into the room and introduces himself as Howard. He tells her that he is the bunker's owner. He then explains that he brought her there for her protection, claiming that the air outside has been poisoned by a massive nuclear or chemical fallout from an unknown force. Michelle is initially hostile towards Howard, but once she has calmed down, Howard takes her on a tour of the well-stocked bunker, and she meets Emmett, another survivor who found his way to it. Howard takes her to the viewport of the bunker's exit hatch, showing her two dead pigs outside as evidence of the fallout; Michelle also sees Howard's truck, and recognizes it from the accident. Michelle privately relays her concerns about Howard's motivations to Emmett.\nDuring their first dinner together, Michelle secretly takes Howard's keys and makes her way to the hatch, but as she is about to open it, a woman with skin lesions, named Leslie, appears outside and begs to be let in. Eventually, she begins to violently slam against the window demanding that the door be opened in an increasingly aggressive tone, then collapses. Michelle then openly returns the keys and agrees that Howard was right. Howard admits to accidentally hitting her car in his panic to get to the shelter.\nWhile the trio's relationship becomes more relaxed, Howard still shows intolerance towards Emmett and treats Michelle as a little girl; however, Howard opens up about his daughter who he states is \"not with us anymore\". Howard enlists Michelle to fix the air filtration unit when it fails since she is small enough to fit through the vents; while repairing it, she finds a locked skylight, with the word \"HELP\" scratched into its glass and visible to anyone outside. Further suspicious of Howard, Michelle and Emmett discover that Howard's purported daughter was a young girl who had gone missing about two years earlier, and they suspect he abducted her to the bunker. They make plans to escape the bunker, creating a makeshift Hazmat suit behind Howard's back. When Howard discovers tools and parts missing, he accuses the two of stealing them, threatening to immerse them in a barrel of perchloric acid. Emmett quickly takes responsibility of stealing the materials. He explains that he was building a weapon so that Michelle would respect him. Howard suddenly pulls out a gun and kills Emmett with it. He then tries to comfort Michelle, telling her that he killed Emmett to protect her. In shock, Michelle is desperately making final preparations to leave, when she is surprised by Howard. She manages to escape from him with the suit. En route, she knocks over the acid barrel, which starts an electrical fire in the bunker. It later explodes, killing Howard.\nMichelle dons the suit and escapes the burning bunker onto Howard's homestead. Seeing signs of living wildlife, she takes off the suit's helmet, but then she suddenly sees a giant biomechanical alien spacecraft, drawn by the bunker explosion. A quadrupedal creature drops from the craft and chases Michelle, forcing her to hide in a shed. She then races towards the farmhouse, but the craft appears and emits a green gas that forces Michelle back into the suit. Her delay allows mechanical appendages from the ship to capture her, but she is able to craft a Molotov cocktail from items in Howard's truck to throw into the ship. The fireball destroys the ship causing it to crash and the appendage drops her; after recovering she is able to take the dead woman's car and escape.\nAs she nears the Texas border she hears radio chatter instructing any survivors to head to Baton Rouge to evacuate, but also requesting the help of anyone with medical or combat training in Houston. At a crossroad, she pauses a moment before driving off towards Houston. In the distance, two larger alien craft can be seen in the sky.", "cast": "Mary Elizabeth Winstead as Michelle\nJohn Goodman as Howard Stambler\nJohn Gallagher Jr. as Emmett DeWitt\nSuzanne Cryer as Leslie\nBradley Cooper as Ben (voice)"}