{"_movieID": "429202", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:47:19", "summary": "Vox Lux is a 2018 American drama film directed by Brady Corbet with a screenplay by Corbet from a story by Corbet and Mona Fastvold. It stars Natalie Portman, Jude Law, Raffey Cassidy, Stacy Martin and Jennifer Ehle. \nThe film had its world premiere at the 75th Venice International Film Festival on September 4, 2018. It was released on December 7, 2018, by Neon.", "plot": "ACT 1: Genesis \nIn the winter of 1999, a boy named Cullen Active walks into a school in the Staten Island neighborhood of New Brighton. He arrives in a classroom, pulls out an assault rifle, and shoots the teacher. After shooting several students, 13-year-old Celeste Montgomery seems to bring the violence to a stop after calmly and compassionately talking to Cullen, and offers to pray with him. However, he shoots her in the neck, and shortly after authorities arrive, Celeste is hospitalized. As she slowly recovers from her injury, she and her older sister, Ellie, write music together. Soon after, at an event held in memory of the shooting victims, Celeste sings a song that she and Ellie wrote called \"Wrapped Up\". The song becomes an instant hit and Celeste is soon picked up by a manager.\nOver the next two years, Celeste manages and navigates the increasing pressures of her newfound fame in spite of the past and her injury. She and Ellie indulge in bouts of partying that soon get in the way of Celeste's work, including Celeste having a one-night stand with an older musician and Ellie also having a nocturnal encounter with the manager. However, we see that Celeste continues to successfully rise in the music industry, with her songs getting quickly picked up by the radio and rushing the demand for her first music video, \"Hologram (Smoke and Mirrors)\" which is released shortly after the September 11 attacks.\nACT 2: Regenesis\nIn 2017, a terrorist shooting on a beach in Croatia is rumored to be linked to Celeste's music due to the masks that the criminals donned, which are similar to Celeste's masks from her \"Hologram\" video.\nThe movie shifts to a now-31-year-old Celeste, who is preparing for the first night of a concert tour for her sixth album, Vox Lux. Her manager informs her of the terrorist shooting, and then tells her to prepare for the ensuing press junkets. Before her first interview, Celeste takes her teenage daughter, Albertine, to lunch. Once there, Celeste unveils her erratic and destructive behavior, aided by alcohol, resulting in Celeste and Albertine getting kicked out of the restaurant by the manager. It is revealed here that 6 years prior, Celeste blinded herself in her left eye due to consuming excessive amounts of methanol while binge-drinking household cleaning products. Celeste then drove under the influence, injuring a man in his left leg and pelvis and resulting in a public lawsuit.\nAfter lunch, Celeste has a heated argument with Ellie after finding out Albertine has recently lost her virginity and that Ellie neglected to tell Celeste. The press interviews begin soon after, with Celeste becoming increasingly unhinged after one interviewer mentions the aforementioned driving incident. Her publicist decides to cancel the rest of the interviews scheduled that day, and asks Celeste to rest before the concert. However, Celeste and her manager get high on drugs and have sex. That evening, an impaired Celeste heads for the concert venue with her entourage in tow. She then experiences a mental breakdown, with Ellie successfully comforting her before sending her out.\nFINALE \nCeleste appears ready for the concert and preps for the stage with her band and background dancers. She then performs multiple songs with elaborate dance numbers involved. It is revealed that, after she was shot in 1999, Celeste told Ellie that she made a deal with the devil for her life. The movie ends with her manager, Albertine, and Ellie pensively looking on at the facade of a performing Celeste."}