{"_movieID": "290595", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:16:28", "summary": "The Huntsman: Winter's War is a 2016 American fantasy adventure film, both a prequel and sequel to Snow White and the Huntsman (2012), it takes place before and after the events of the first film. The film is the directorial debut of Cedric Nicolas-Troyan, who was a visual effects supervisor and second unit director on the first film. It is written by Craig Mazin and Evan Spiliotopoulos, based on characters created by Evan Daugherty, which like the first film were inspired by the fairy tale \"Snow White\" compiled by the Brothers Grimm, as well as \"The Snow Queen\" by Hans Christian Andersen. Reprising their roles from the first film, the cast includes Chris Hemsworth, Charlize Theron, Nick Frost, and Sam Claflin. The film also introduced new characters played by Emily Blunt, Jessica Chastain, and Rob Brydon.\nThe film premiered in Hamburg on March 29, 2016, and was released in the United States on April 22, 2016. It received mixed to negative reviews from critics and audiences alike, with praise for the visuals and cast but many feeling the film was an unnecessary sequel and prequel. It grossed $165 million worldwide against an estimated $115 million production cost.", "plot": "Evil sorceress Queen Ravenna's powers allow her to know that her younger sister Freya, whose powers have not yet emerged, is not only involved in an illicit affair with nobleman Andrew, but is also pregnant with his child. Freya gives birth to a baby girl and discovers that Andrew murdered their child. In grief-fueled rage, her broken heart freezes over and she kills him with her sudden emergence of powers - the elemental control of ice.\nFreya builds herself a new kingdom up north. Ruling as the much-feared Ice Queen, she orders parents to be killed and their children to be abducted so they can be trained to be an army of huntsmen to conquer for her and avoid the pain of love that she suffered. Despite the training, two of her best huntsmen, Eric and Sara, fall in love. Sara claims Eric in \"marriage\" by giving him her mother's medallion necklace. They plan to escape to a free life together but are discovered by Freya. Sara is apparently killed while Eric is beaten and thrown into a river.\nSeven years later, after Ravenna's death, Queen Snow White falls ill after hearing Ravenna's Magic Mirror beckon her. Because of its dark magic, she orders it to be taken to Sanctuary, the magical place that sheltered her during the events leading to Ravenna's defeat, so the Mirror's magic can be contained. Snow White's husband, William, informs Eric that the soldiers tasked with carrying the Mirror went missing en route. Knowing its dark magic can make Freya stronger, Eric agrees to try and retrieve the Mirror; Snow White's dwarf ally Nion and his half-brother Gryff accompany him.\nThey travel to the last location of the soldiers. Eric discovers they killed one another because they used their own weapons on each other. The trio are attacked by Freya's huntsmen and are rescued by Sara, revealed to be alive. Sara explains that she was imprisoned by Freya all this time, and only escaped recently. She has not forgiven Eric for abandoning her. They decipher that Eric was shown an illusion of Sara's death, while she was made to see him abandoning her rather than fighting to help. Eric manages to convince her that Freya tricked them.\nThat night, Eric and Sara make love. Sara later notices Eric still wears the necklace she gave him. The next day, the group go to the forest of the goblins who stole the mirror. They retrieve it and after a strong fight in which Eric protects Sara and she saves him, the group makes it out unharmed. Near the Sanctuary, Freya attacks and reveals Sara has been loyal to her all along. Sara shoots an arrow at Eric, who appears to die. Freya departs with the Mirror but is unaware that Sara purposely hit Eric's medallion necklace, protecting him from dying. At her palace, Freya resurrects Ravenna, who became one with the Mirror when Snow White vanquished her.\nEric attempts to assassinate Freya, but is stopped by Ravenna. Ravenna begins to kill the huntsmen, and Freya, realizing that she regards the huntsmen as her own children, protects them with an ice wall. As Eric, Sara, and the huntsmen climb over the wall to retrieve the Mirror, the sisters argue. Ravenna lets slip that she's responsible for Freya's powers. Suspicious, Freya forces Ravenna (who as the mirror's captive spirit must answer her summoner's questions truthfully) to reveal that the Mirror had told her Freya's child would become more beautiful than Ravenna. Ravenna then enchanted Andrew to kill the baby so she could remain \"the fairest of them all.\" Outraged, Freya turns against her sister but is impaled by her. With her remaining strength, she freezes the Mirror and Eric shatters it, destroying Ravenna. As Freya dies, she smiles at a vision of herself holding her baby.\nWith Freya's death, those who had been imprisoned by her magic are set free. Eric, Sara, and the huntsmen look forward to a new future, with Eric and Sara happy to have a free life together for the first time.\nIn a post-credits scene, Snow White is seen from behind. A mysterious golden bird lands on the balcony next to her.", "cast": "Chris Hemsworth as Eric: An exceptional warrior and Ravenna's main Huntsman.\nConrad Khan as Young Eric\nCharlize Theron as Queen Ravenna: Snow White's evil stepmother.\nEmily Blunt as Queen Freya: Ravenna's sister.\nJessica Chastain as Sara: Eric's wife who was thought to be dead by and through Freya's deceiving powers.\nNiamh Walter as Young Sara\nNick Frost as Nion: a Dwarf who previously helped Eric and Snow White defeat Ravenna's army.\nSam Claflin as King William: Snow White's husband who helped her and Eric defeat Ravenna's army.\nRob Brydon as Gryff: A debt-collecting Dwarf who is Nion's half-brother.\nAlexandra Roach as Doreena: A female Dwarf and Nion's love interest.\nSheridan Smith as Bromwyn: A feisty and greedy Dwarf who becomes allies with Nion and Gryff.\nSope Dirisu as Tull: A fellow Huntsman.\nColin Morgan as Andrew: Freya's lover.\nChristopher Obi as the voice of Mirror Man: The physical form of the Magic Mirror.\nFred Tatasciore as motion-capture for Mirror Man\nMadeleine Worrall as Eric's Mother\nSam Hazeldine as Liefr\nSophie Cookson as Pippa\nLiam Neeson as Narrator"}