{"_movieID": "80585", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:47:27", "summary": "Rock of Ages is a 2012 American musical comedy-drama film directed by Adam Shankman and based on the rock jukebox Broadway musical Rock of Ages by Chris D'Arienzo. Starring country singer Julianne Hough and Diego Boneta leading an ensemble cast that includes Russell Brand, Alec Baldwin, Paul Giamatti, Catherine Zeta-Jones, Malin Åkerman, Mary J. Blige, Bryan Cranston and Tom Cruise, the film features the music of many 1980s Rock and Glam Rock artists including Def Leppard, Journey, Scorpions, Poison, Foreigner, Guns N' Roses, Pat Benatar, Joan Jett, Bon Jovi, Twisted Sister, Whitesnake, REO Speedwagon, and others. The film's score was composed and conducted by Cliff Eidelman.\nOriginally scheduled to enter production in summer 2009 for a 2011 release, it eventually commenced production in May 2011 and was released on June 15, 2012. The film received mixed critical reviews and grossed only $59 million worldwide. However, Cruise was particularly lauded for his performance of \"Pour Some Sugar on Me\" and \"Wanted Dead or Alive\". The related film soundtrack also did critically well, certified Gold in Canada.", "plot": "In 1987 Los Angeles, Sherrie Christian (Julianne Hough) arrives from Oklahoma with dreams of becoming a singer. Barback Drew Boley (Diego Boneta) prepares for another night at The Bourbon Room (\"Sister Christian/Just Like Paradise/Nothin' But a Good Time\"). Sherrie’s suitcase is stolen, and Drew gets her a job as a waitress at the Bourbon Room.\nThe club's owner, Dennis Dupree (Alec Baldwin), and his right-hand man, Lonny Barnett (Russell Brand), are desperate to save the club from a tax debt. They book Stacee Jaxx (Tom Cruise), a detached and self-indulgent rock star preparing for his final gig with his band, Arsenal. Drew tells Sherrie his own dreams of becoming a rock star, but that he has stagefright (\"Juke Box Hero/I Love Rock 'n' Roll\"). Learning of Stacee's upcoming concert, Patricia Whitmore (Catherine Zeta-Jones), conservative wife of the mayor (Bryan Cranston), organizes a protest in front of the club (\"Hit Me with Your Best Shot\")\nDrew and Sherrie have their first date at the Hollywood Sign, where Drew reveals he is writing a song for Sherrie (\"Waiting for a Girl Like You\"). On the night of Arsenal's final show, Dennis learns the opening act has cancelled; Sherrie convinces him to use Drew’s band, Wolfgang Von Colt (\"More Than Words/Heaven\"). Stacee's manager, Paul Gill (Paul Giamatti), schedules an interview with Constance Sack (Malin Åkerman), a reporter for Rolling Stone.\nConstance mentions rumors of Stacee’s difficult behavior and implies he was kicked out of Arsenal, which Stacee denies (\"Wanted Dead or Alive\"). Stacee sends Sherrie for a bottle of scotch from his limo. Constance lashes out at the once-great Stacee; they recognize their mutual attraction and are about to have sex when Stacee sings (\"I Want to Know What Love Is\"). Ashamed, Constance leaves as Sherrie enters and collides with Stacee. Drew mistakenly believes that Sherrie and Stacee had sex, and is angrily inspired to sing (\"I Wanna Rock\") for the opening act. Drew and Sherrie break up and she quits the Bourbon Room. Drew tries to run after her but Paul, impressed with his performance, offers him a record deal as Arsenal sings their last song of the night (\"Pour Some Sugar on Me\").\nSherrie takes refuge at strip club the Venus Club (\"Harden My Heart\"), where owner Justice Charlier (Mary J. Blige) offers her a job as a dancer (\"Shadows of the Night/Harden My Heart\"), but Sherrie chooses to wait tables. She realizes she needs more money, as Drew signs to Gill's record label (\"Here I Go Again\"). Dennis worries the Bourbon Room will close and that he has \"let everyone down.\" Lonny confesses his love for him, and Dennis reciprocates (\"Can't Fight This Feeling\"). Drew realizes his record deal makes him part of hip-hop boy band \"The Zee Guys\" as Joshua Zee, while Sherrie decides to becomes a dancer at the Venus Club (\"Any Way You Want It\").\nSherrie visits the Hollywood sign, where she finds Drew, whose life has also not gone as planned. She tells him she did not have sex with Stacee and will be returning to Oklahoma. They part ways, lamenting their situation (\"Every Rose Has Its Thorn\").\nStacee realizes his feelings for Constance and calls Rolling Stone to learn “she is covering Stacee Jaxx's show at The Bourbon Room\". Stacee rushes to the venue, where Lonny leads the patrons against Patricia’s protest group (\"We're Not Gonna Take It/We Built This City\"). Stacee recognizes Patricia, whom Lonny exposes as a former Arsenal groupie. Drew buys back Sherrie’s stolen records and drops them off at the strip club.\nThe Zee Guys are rejected by the rocker crowd; Drew spots Sherrie in the audience and leaves the stage. They reconcile and Drew dismisses Paul, telling him rock 'n' roll will never die. Sherrie reunites Wolfgang Von Colt onstage, where she and Drew perform the song he wrote for her (\"Don't Stop Believin'\"). Stacee, having sex with Constance in the bathroom, is moved by the song.\nEight months later, Stacee has rejoined Arsenal and performs the song with Drew and Sherrie, now part of Wolfgang Von Colt, at Dodger Stadium in front of a crowd including Dennis, Lonny, Justice, a pregnant Constance, and Patricia, returned to her rock 'n' roll persona.", "cast": "Julianne Hough as Sherrie Christian\nDiego Boneta as Drew Boley\nRussell Brand as Lonny Barnett\nPaul Giamatti as Paul Gill\nCatherine Zeta-Jones as Patricia Whitmore\nMalin Åkerman as Constance Sack\nMary J. Blige as Justice Charlier\nAlec Baldwin as Dennis Dupree\nTom Cruise as Stacee Jaxx\nBryan Cranston as Mayor Mike Whitmore\nWill Forte as Mitch MileyAdditionally, Kevin Nash and Jeff Chase starred as Jaxx's bodyguards. Constantine Maroulis, who played Drew in the original Broadway cast, appears as the Capitol Records executive during \"Any Way You Want It”. Several musicians also made cameo appearances throughout the film, including Kevin Cronin of REO Speedwagon, Sebastian Bach of Skid Row, Deborah \"Debbie\" Gibson, Nuno Bettencourt, Joel Hoekstra of Night Ranger and Porcelain Black. Eli Roth makes an appearance as Stefano, the Zee Guys' music video director, and T. J. Miller cameos as a Rolling Stone receptionist."}