{"_movieID": "425980", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:48:15", "summary": "Brad's Status is a 2017 American comedy-drama film written and directed by Mike White and starring Ben Stiller, Austin Abrams, Michael Sheen, Jenna Fischer, and Luke Wilson. It premiered on September 9 at the 2017 Toronto International Film Festival in the juried Platform section, and was theatrically released by Amazon Studios on September 15, 2017.\n\n", "plot": "Brad Sloan (Ben Stiller) runs his own non-profit organization, and lives a comfortable life with his loving wife and son, but cannot help contemplating how his old friends Craig Fisher (Michael Sheen), Billy Wearslter (Jemaine Clement), Jason Hatfield (Luke Wilson), and Nick Pascale (Mike White) are rich and accomplished. Craig works in the White House and published a best-selling book; Jason owns a hedge fund firm; Billy sold a company he founded, moved to Maui, and retired; and Nick is a Hollywood director. Brad's wife, Melanie (Jenna Fischer), tries to comfort Brad, telling him that they do not need to compare themselves with the wealthiest 1%.\nIn the morning, Brad and his son, Troy (Austin Abrams), leave for Boston to visit colleges. After Troy confesses to him that he aims to get into Harvard, Brad sees this as a way to make up for his lost ambitions. After arriving at Harvard to meet with admissions, they find out they have missed the appointment by one day. Brad argues to see the admission committee, but Troy gets him to back down. Melanie suggests that Brad should call Craig, which he reluctantly agrees. Brad calls Billy to get Craig's number and finds out that Nick got married a few years back, but Brad was not invited. He then laments how his friends' exclusion of him confirms his fears: that he is not only a failure in his own eyes but to others as well. Brad also reflects about his waning sex life with Melanie and how his wife easily gets satisfied, which he thinks might have undermined his ambitions. At a restaurant, Brad opens up to Troy about feeling left out, and Troy picks up on things. After talking to Craig, Craig gets Troy a meeting with the famous Harvard music professor and the dean of admissions.\nBrad and his son meet Ananya (Shazi Raja), a high school musician friend of his son, and her friend Maya (Luisa Lee). Brad relishes Ananya's idealism and her respect for his work, reminding him of his better days. She also reveals to Brad that she did not like Craig's lectures since she finds him sexist and arrogant. After having dinner with them, Brad and Troy turn down the offer of drinks with them and return to their hotel.\nThat night, Brad can not sleep so he decides to have a drink with Ananya. He tells her that the non-profit life was a mistake and he should have tried to make money. As he is talking, he recognizes that he's lost her admiriation; but he goes on about his perceived mistakes in his career, relative to the success of his friends. Ananya lets him know that he is living the white man's privilege and that there are kids she knows in India who are lucky to have dinner, so he should be grateful for what he has in his life.\nTroy meets his role model music composer thanks to Craig pulling some strings. However, when Troy tells Brad that his idol is not as cool as he thought, they get in an argument where Brad tells Troy that he cannot judge people for selling out because he is just living in a bubble. The argument soon ends and Troy attends his interview. During the interview, Jason calls Brad in a rush that Brad does not initially pick up on because of his self-focus. Jason informs him that he is at the Mayo Clinic and that his 3-year old daughter has a tethered spine. Shaken by the news, Brad forgets to ask Troy about how his interview went. Troy tell Brad things went really well. Brad then accompanies Troy to Tufts, his alma mater, where he learns his old professor just passed away. Watching Troy go on the tour at Tufts, his thoughts are interrupted when Melanie returns his call. Brad expresses his pride about his son and wishes Melanie were there with them.\nThe next night, Brad has dinner with Craig, to properly thank him for his help. He finds out that his old friends, the ones he believes are leading privileged lives, are actually living with major problems. In addition to Jason Hatfield's daughter having a serious medical condition, he learns Jason's company is under legal investigation. He also learns Billy Wearslter is an addict and alcoholic. Craig also expresses some homophobic remarks about Nick. While Brad tolerates Craig's constant bragging and backhanded compliments, eventually Brad feels conflicted about how Craig treats him, questioning if they really are friends. When Craig seems confused at Brad's reaction, Brad abruptly leaves their dinner. He decides to join Troy at the orchestral performance where Ananya and Maya are playing, explaining to Troy he'd rather be there with him. The beautiful music transports Brad into feeling emotional and reflective, realizing he still loves the things of the world. After returning to the hotel that evening, Troy wonders if his father is having some sort of nervous breakdown. Brad said he just sometimes has doubts that people view him as a failure. Troy explains that everyone in the world is thinking of themselves; and he is the only one thinking about Brad. Brad tells Troy that he loves him, and Brad realizes he is truly grateful.\nIn his thoughts, Brad is trying to imagine the future. The movie ends with him repeating, \"We're still alive. I am still alive,\" as he turns over and goes to sleep. At the end of the credits, Brad's imagination wanders back into thinking that his son is playing music on the street collecting coins.", "cast": "Ben Stiller as Brad Sloan, Melanie's husband, Troy's father and one of Craig, Billy, Nick and Jason's four friends\nMichael Sheen as Craig Fisher, one of Billy, Nick, Jason and Brad's four friends\nJenna Fischer as Melanie Sloan, Brad's wife and Troy's mother\nLuke Wilson as Jason Hatfield, one of Billy, Nick, Craig and Brad's four friends\nAustin Abrams as Troy Sloan, Brad and Melanie's son\nDevon Packer as Young Troy Sloan\nJemaine Clement as Billy Wearslter, one of Nick, Craig, Jason and Brad's four friends\nMike White as Nick Pascale, one of Billy, Craig, Jason and Brad's four friends\nJimmy Kimmel as himself\nShazi Raja as Ananya"}