{"_movieID": "200505", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:50:31", "summary": "Draft Day is a 2014 American sports comedy film directed by Ivan Reitman and starring Kevin Costner. The premise revolves around the fictional general manager of the Cleveland Browns (Costner) deciding what to do after his team acquires the number one draft pick in the upcoming National Football League draft.\nThe film premiered in Los Angeles on April 7, 2014 and was released in the United States on April 11, 2014. It received mixed reviews from critics and was a box office failure grossing just $29 million against its $25 million budget.", "plot": "On the morning of the 2014 NFL Draft, Cleveland Browns general manager Sonny Weaver Jr. must decide how to use the seventh overall pick to improve the team, but he has other problems on his mind. His semi-secret girlfriend Ali Parker, the team's salary cap analyst, is pregnant, and the recent death of Sonny's father causes tension with his mother.\nThe Seattle Seahawks hold the first overall draft pick, and general manager Tom Michaels offers to trade it to Sonny; this would allow the Browns to draft highly-rated quarterback prospect Bo Callahan. Sonny initially declines, but under orders from team owner Anthony Molina to \"make a splash,\" reluctantly makes the deal, trading away the Browns' first-round draft picks for the next three years. The unexpected opportunity to obtain Callahan excites Browns fans, but splits the team's front office and players.\nThe trade goes public after a tweet by Ohio State linebacker Vontae Mack, who had been Sonny's original first pick. Vontae tells Sonny to re-watch college footage of him and Callahan playing against each other, with Mack coming out on top. Sonny begins to have doubts about Callahan's ability under pressure, and the Browns' investigations also bring Callahan's character into question. \nWhen the draft begins that evening, Sonny agonises over the choice before drafting Vontae Mack at number one. Roger Goodell's announcement of the selection shocks the rest of the league, and disrupts many of their plans for their own picks. Molina is irate and flies back to Cleveland, intent on firing Sonny. Head coach Vince Penn is also incensed and threatens to resign.\nRumors spread about Callahan as other teams avoid selecting him. However, the Seahawks are still in contention to pick Callahan with the seventh pick, and Sonny senses an opportunity. He convinces the rookie general manager of the Jacksonville Jaguars to trade him their pick at sixth in exchange for the Browns' second-round draft picks for the next three years. Sonny then calls Michaels; in return for passing on Callahan, Sonny demands his first-round picks back, along with punt returner David Putney. After fraught negotiations, the Seahawks seal the deal and choose Callahan at sixth pick. With his now-restored seventh pick, Sonny appeases Penn and Molina by selecting skilled running back Ray Jennings of Florida State.\nMolina and his team celebrate an outstanding draft for the Browns. After the draft party, Sonny reconciles with his mother over his excellent draft performance and her soon-to-be first grandchild."}