{"_movieID": "97020", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:28:39", "summary": "RoboCop is a 1987 American cyberpunk action film directed by Paul Verhoeven and written by Edward Neumeier and Michael Miner. The film stars Peter Weller, Nancy Allen, Dan O'Herlihy, Kurtwood Smith, Miguel Ferrer, and Ronny Cox. Set in a crime-ridden Detroit, Michigan, in the near future, RoboCop centers on police officer Alex Murphy (Weller) who is murdered by a gang of criminals and subsequently revived by the megacorporation Omni Consumer Products (OCP) as a superhuman cyborg law enforcer known as RoboCop.\nThemes that make up the basis of RoboCop include media influence, gentrification, corruption, authoritarianism, greed, privatization, capitalism, identity, dystopia and human nature. It received positive reviews and was cited as one of the best films of 1987, spawning a franchise that included merchandise, two sequels, a television series, a remake, two animated TV series, a television mini-series, video games, and a number of comic book adaptations/crossovers. In 2018 it was announced that a direct sequel to the original film titled RoboCop Returns was in the works and it would ignore the other sequels and remake. The film was produced for a relatively modest $13 million. Honors for the film include five Saturn Awards, two BAFTA Award nominations and the Academy Award for Best Sound Effects Editing, along with nominations for Best Film Editing and Best Sound.", "plot": "In a dystopian future, Detroit, Michigan is on the verge of total collapse due to financial mismanagement and a high crime rate. The city signs a deal with the mega-corporation Omni Consumer Products (OCP) to run Detroit's police department in exchange for letting OCP rebuild run-down sections of the city into a high-end utopia called Delta City. Senior Vice President Dick Jones proposes the use of a new law-enforcement droid codenamed ED-209. However, the droid malfunctions during its demonstration, killing a young executive. Bob Morton, an ambitious executive, uses the opportunity to introduce his own experimental cyborg design called \"RoboCop\". The chairman of the board, known as the Old Man, is dismayed at the ED-209 failure and approves Morton's plan, much to Jones' anger.\nTo create a test subject for the project, OCP reassigns their best police officers to crime-ridden districts. Officer Alex Murphy is transferred to the violent Metro West precinct, where he is partnered with Officer Anne Lewis. On their first patrol, they pursue the notorious gang of Clarence Boddicker after they have committed an armed robbery. In investigating their hideout, an abandoned steel mill, Murphy kills one of the gang's members, but is ambushed by Boddicker and his lieutenants - Cox, Emil, Minh, and Nash. The gang brutalizes Murphy, blasting him repeatedly with shotguns, until Boddicker shoots him through the head. Lewis arrives too late to help. Murphy is evacuated by helicopter to a trauma center but dies in the trauma unit.\nOCP claims Murphy's body and converts it into RoboCop. The cyborg is programmed with three Prime Directives: serve the public trust; protect the innocent; and uphold the law. RoboCop is assigned to Metro West, where he begins a brutally efficient campaign against crime. However, even though Murphy's memory was wiped as part of the conversion, RoboCop begins to remember scenes from Murphy's life, including his death at Boddicker's hand. Lewis confirms to RoboCop that he is Murphy, much to his shock. While out patrolling, RoboCop foils Emil's attempt at armed robbery; Emil recognizes Murphy mannerisms, furthering Robocop's memory recall. Using Emil as a reference point, RoboCop uses the police database to identify the gang's other members and locate his (now abandoned) home. Meanwhile, at the behest of Jones, Boddicker murders Morton.\nRoboCop locates Boddicker at a cocaine factory, where he kills most of Boddicker's henchmen (including Minh) and captures Boddicker. RoboCop brutalizes Boddicker, but before Robocop can kill him, Boddicker reveals that he is in Jones' employ. Depositing Boddicker at Metro West, RoboCop heads to OCP Tower to arrest Jones for aiding Boddicker. However, when RoboCop attempts to arrest Jones, RoboCop unwittingly activates Directive 4, implanted by Jones himself: \"Any attempt to arrest a senior officer of OCP results in shutdown\". Jones admits his culpability in Morton's death, and then tries to kill RoboCop with an ED-209 unit. However, RoboCop escapes to the garage, where the police S.W.A.T. team ambushes him. Lewis finds RoboCop and helps him escape to the abandoned steel mill to repair himself.\nThe police, angered by OCP's underfunding and short-staffing, call a strike, and Detroit descends into chaos. Jones, having freed Boddicker and his gang, provides them with Cobra Assault Cannons and a tracking system for RoboCop, then sends them out to destroy RoboCop. The gang arrives at the steel mill, but is swiftly dispatched by RoboCop and Lewis – RoboCop shoots Cox dead; Emil is mutated by toxic waste and then run over by Boddicker; Lewis kills Nash with a Cobra Assault Cannon; and RoboCop kills Boddicker by impaling him in the neck with his data probe. RoboCop returns to OCP Tower, destroying the ED-209 at the door with Boddicker's Cobra Assault Cannon. RoboCop confronts Jones in front of a board meeting, revealing Directive 4 and his recording of Jones' confession.  A frantic Jones grabs a gun and the Old Man, planning to escape via helicopter with a hostage. Thinking adroitly, the Old Man fires Jones, rendering Directive 4 irrelevant. RoboCop then shoots Jones repeatedly, causing him to fall through a window to his death. A grateful Old Man asks RoboCop's name, to which he replies, \"Murphy\".", "cast": "Peter Weller as Alex Murphy/RoboCop\nNancy Allen as Anne Lewis\nRonny Cox as Dick Jones\nKurtwood Smith as Clarence Boddicker\nMiguel Ferrer as Bob Morton\nDan O'Herlihy as \"The Old Man\" (OCP Chairman)\nPaul McCrane as Emil Antonowsky\nRay Wise as Leon Nash\nJesse D. Goins as Joe Cox\nCalvin Jung as Steve Minh\nMichael Gregory as Lt. Hedgecock\nRobert DoQui as Sergeant Warren Reed\nMario Machado as Casey Wong\nLeeza Gibbons as Jess Perkins\nFelton Perry as Donald Johnson\nLee de Broux as Sal\nS. D. Nemeth as Bixby Snyder"}