{"_movieID": "58219", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:46:27", "summary": "The Ages of Love (Italian: Manuale d'amore 3, also known as Manual of Love 3)  is a 2011 Italian romantic comedy film consisting of three segments. It was directed by  Giovanni Veronesi, and it is a sequel of Manuale d'amore (2005) and Manuale d'amore 2 – Capitoli successivi (2007).", "plot": "The film is composed of three episodes, connected through a young taxi driver who plays Cupid. Each episode is following a different couple:\n\nGiovinezza (youth): Roberto and Micol (Riccardo Scamarcio and  Laura Chiatti);\nMaturità (maturity): Fabio and Eliana (Carlo Verdone and Donatella Finocchiaro);\nOltre (beyond): Adrian and Viola (Robert De Niro and Monica Bellucci).In the first  story, Roberto is a lawyer sent to a rural town in Tuscany to convince a family of old farmers to sell their land. They are reluctant to accept the offer, so Roberto stays for a few days. He spends his time in a company of locals, where he meets Micol, a beautiful young woman who flirts with him. They have fun together and one night, they kiss and make love on a beach. But Roberto has a fiance, Sara, who calls him every day to say how she misses him. Roberto is quite uneasy about settling down and getting married. Torn by his feelings, Roberto comes to Micol's house for a serious talk, only to find out she's married to a wealthy businessman. Realizing they have no future together, Roberto and Micol part their ways. Sara comes to take him, and before leaving town, Roberto urges the farmers to stand for their land.\nIn the second story, Fabio (Verdone) is a famous news anchor on TG La7. At a party, he meets a pretty woman and they hook up. She offers Fabio casual sex, which leads to a few weird sexual encounters. When one of them ends with a damage to a police car, Fabio learns that Elaine is suffering from bipolar disorder and has a history of mental breakdowns. He tries to end the affair, but she begins to stalk him, threatening him with a home video recording of them having sex and finally tearing down his apartment. His wife and daughter leave after he discloses his infidelity, and Fabio has a breakdown on live air, which has him demoted to a field reporter in Africa. On his way to the airport, he is called to the mental institution where Elaine is now treated for a chronic depression. She bids him farewell and gives him keys to her apartment, where he retrieves the video recording and an awkward farewell poem. On his way out, he encounters Adrian, and it is later revealed that Fabio was taken hostage by terrorists.\nIn the final story, Adrian is a retired professor of art history from Boston who lives alone in his Rome apartment. His only friend is Augusto, the house concierge, who one day is visited by his daughter Viola, a beautiful fashion model from Paris. Though Adrian has shied away from any contact with women for years, he is immediately attracted to her. After he fights an abusive former boyfriend, Viola takes interest in Adrian and learns that he had serious health problems, having gone through a heart transplant operation which left him physically and emotionally scarred. After a fierce argument with her father, Viola knocks on Adrian's door, as she has nowhere else to go. Augusto comes to Adrian and is furious to disclose that Viola is actually a stripper girl and has incurred a large debt. Adrian and Viola spend an evening, revealing their stories. Adrian suffered from depression after his operation, which ended his marriage, and Viola tried to open a restaurant with a loan from local gangsters, but didn't succeed. They spend the night together. Viola wants to leave town, not wanting to cause trouble to anyone, but Adrian professes his love to her and they embrace. In the end, it is revealed they moved to a small town to have their first child, and Adrian secretly settled Viola's debt.", "cast": "Carlo Verdone as Fabio\nRobert De Niro as Adrian\nMonica Bellucci as Viola\nRiccardo Scamarcio as Roberto\nMichele Placido as Augusto\nValeria Solarino as Sara\nLaura Chiatti as Micol\nDonatella Finocchiaro as Eliana\nEmanuele Propizio as Cupid"}