{"_movieID": "97430", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:41:36", "summary": "The Man with the Iron Fists is a 2012 American martial arts film directed by RZA and written by RZA and Eli Roth. The film stars RZA, Russell Crowe, Cung Le, Lucy Liu, Byron Mann, Rick Yune, Dave Bautista, and Jamie Chung. Set in 19th century China, the story follows a series of lone warriors who are forced to unite to defeat a common foe and save their home of Jungle Village.\nDevelopment began in 2005 when RZA shared his idea for the film with Roth. After nearly two years of development, Roth and RZA secured financial backing in May 2010. Filming began in December 2010 on a $15 million budget and concluded by March 2011. The film was shot in Shanghai and at other locations in China. RZA and Howard Drossin composed the film's musical score, and RZA produced its soundtrack, which featured several new songs by various artists. A series of concerts  featuring music from the soundtrack were held to promote the film.\nThe film was released in North America on November 2, 2012. Critics were divided over the film's homage to martial arts films, considering it well-choreographed and representative of the genre, but offering nothing original, and the direction was criticized for a lack of refinement. The performances of Crowe and Mann were well received. The film earned $19 million at the box office.", "plot": "In nineteenth century China, Jungle Village is home to several warring clans. The village blacksmith creates deadly weapons for the clans, intending to use his payments to purchase the freedom of his lover Lady Silk, and leave the village. The region's governor tasks the Lion Clan's leader, Gold Lion, with protecting a large shipment of gold that must pass through the village. Gold is betrayed by his lieutenants Silver Lion and Bronze Lion, who plan to steal the gold. They use the chaos ensuing from a fight with the Hyena Clan to allow their co-conspirator Poison Dagger—the governor's aide—to assassinate Gold, after which Silver becomes the Lions' leader. Gold's son Zen-Yi learns of his father's murder and sets off to the village to seek revenge.\nThe Qing Emperor's undercover emissary Jack Knife arrives in the village to monitor the gold and takes up residence in the Pink Blossom, a brothel run by Madam Blossom, Lady Silk's madame. Silver sends members of the Rodent clan to kill Zen-Yi before he can reach the village, but Zen-Yi kills them. The mercenary Brass Body arrives in the village and meets with Silver; he is sent to kill Zen-Yi. The blacksmith meets with Silk in the brothel and delivers the final payment needed to free her. After arriving in the village, Zen-Yi and his men are confronted by Brass and find that they cannot physically harm him because his skin turns to metal on impact. Brass beats Zen-Yi and destroys his blade-laden armor. Zen-Yi's last surviving man sacrifices himself to pull a canopy support beam loose, burying Brass under heavy stone. The blacksmith is watching the fight; he rescues Zen-Yi and helps him recover as penance for crafting the weapon that killed Zen-Yi's father.\nMeanwhile, the gold shipment arrives in the village, accompanied by two skilled warriors, the Geminis. The Lions soon confront the Geminis and their men, and in the ensuing fight, Poison Dagger assassinates the Geminis and the Lions capture the gold. Jack later arrives to investigate the incident and learns that the Geminis were poisoned with mercury-tipped weapons, leading him to the blacksmith. The Lions' theft prompts the governor to send his Jackal troops to recover the shipment or destroy the village. Zen-Yi asks the blacksmith to craft him a new suit of weaponized armor. The Lions suspect that the blacksmith is helping Zen-Yi and have him tortured for information. The blacksmith refuses to talk, and Brass cuts off  his forearms. Jack, who had been following the blacksmith, saves him from bleeding to death. While the blacksmith recovers, he tells Jack of his past as an emancipated American slave who accidentally killed a white man who refused to let him go. He fled America by boat and went to China, where monks trained him to use his body's energy to perform superhuman feats. Jack with the aid of the blacksmith crafts his greatest weapon: a pair of iron forearms that he can animate using this energy.\nZen-Yi recovers and joins Jack and the blacksmith. Meanwhile, Blossom offers to let Silver hide the gold in a secret tomb beneath the brothel in return for payment. The gold is stored in a coffin which is raised up to the rafters. That night, Blossom has her girls serve the Lions, and Silk serves Brass. At Blossom's signal, the girls use weapons hidden in their mouths to poison many of the Lions, and they join with Blossom as the Black Widows. When Silk tries to poison Brass, his skin protects him, and he beats and almost kills her. Zen-Yi, Jack, and the blacksmith arrive and join with the Black Widows to fight the remaining Lions while Blossom and Bronze fight and kill each other. While fighting Jack, Poison Dagger is crushed between large moving gears. Silver and Zen-Yi fight in the tomb; Zen-Yi cuts the coffin free, and it crushes Silver. The blacksmith finds Silk, who dies in his arms. He confronts Brass, and his iron fists prove capable of inflicting damage on Brass' seemingly invincible body. While Brass is in metal form, a powerful punch from the blacksmith shatters him to pieces. Jack runs outside in time to stop the soldiers from decimating the building with Gatling guns.\nUltimately, Jack leaves the village to accompany the gold, and Zen-Yi tells the blacksmith that he has gained a brother. With the clans destroyed and the village safe, the blacksmith vows to keep it that way and destroys the sign pointing to his weapon shop. During the credits, Zen-Yi's pregnant fiancee is kidnapped by a bird clan, prompting Zen-Yi to seek the blacksmith's aid.", "cast": "RZA as Blacksmith / The Man with the Iron Fists:An emancipated slave from America who becomes the blacksmith of Jungle Village. He channels an ancient energy to turn himself into a living weapon. His name is Thaddeus Henry Smith. RZA wrote the role specifically for himself, and trained in Hung Ga for 1–2 hours a day over 2 months in preparation.Rick Yune as Zen-Yi, The X-Blade:The son of the murdered Lion Clan leader who goes to Jungle Village to avenge his father's death. RZA said that he had Yune in mind for the role before the script had been completed.Russell Crowe as Jack Knife:An opium-addicted British soldier named after his signature weapon. The character was partly inspired by RZA's late cousin Ol' Dirty Bastard. Crowe based his performance on Clint Eastwood in Dirty Harry (1971) and The Outlaw Josey Wales (1976). Crowe agreed to join the cast because of his previous working relationship with RZA. Crowe was only able to spend 10 days filming his scenes.Lucy Liu as Madam Blossom:The owner of the Pink Blossom brothel, whom Liu described as the queen of the village. Liu wanted to emphasize Blossom's strength against all the male fighters and convinced RZA to give the character a fight sequence with Cung Le's Bronze Lion.David Bautista as Brass Body:A mercenary capable of turning his body to metal, making him invulnerable. Bautista described the character as a \"good guy\" who \"made a lot of bad choices in his life. He doesn’t really understand the difference between right and wrong.\" RZA auditioned Bautista for the role after seeing him \"moving as fast as lightning\" during a stick-fighting training video.Jamie Chung as Lady Silk:A prostitute in the Pink Blossom and the blacksmith's lover.Cung Le as Bronze Lion:A member of the Lion Clan. Le came to RZA's attention following his 2008 mixed martial arts fight against Frank Shamrock. Bronze Lion's fighting style incorporates elements of Tiger Kung-Fu and Le's own training in kicks and scissor kicks.Byron Mann as Silver Lion:The leader of the Lion Clan after he kills the previous leader. Mann was initially cast for a smaller role but after his successful audition, he was given the bigger role of Silver Lion.The cast also includes Pam Grier as the blacksmith's mother Jane, Osric Chau as Blacksmith's assistant, MC Jin as Zen-Yi's ally Chan, Daniel Wu as Poison Dagger, and Andrew Lin and Grace Huang as The Geminis. Co-writer Eli Roth appears in a cameo. Several veteran martial arts actors—including Chen Kuan-tai as Golden Lion, Bryan Leung as Hyena Chief, Telly Liu as Iron Lion, Xue Jing Yao as Copper Lion, Zhu Zhu as Zen-Yi's fiancee Chi Chi, Terence Yin as the Governor, and Gordon Liu as The Abbot—appeared in the film. Liu's role was written for RZA's Shaolin teacher Shi Yan Ming, but Ming could not obtain permission to return to China for filming."}