{"_movieID": "33909", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:51:28", "summary": "Wall Street: Money Never Sleeps (also known as Wall Street 2 or Wall Street 2: Money Never Sleeps) is a 2010 American drama film directed by Oliver Stone, a sequel to Wall Street (1987). It stars Michael Douglas, Shia LaBeouf, Josh Brolin, Carey Mulligan,  Frank Langella, Susan Sarandon and Eli Wallach in his final film role.\nThe film takes place in New York, 23 years after the original, and revolves around the 2008 financial crisis. Its plot centers on a supposedly reformed Gordon Gekko, played by Douglas, and follows his attempts to repair his relationship with his daughter Winnie (Mulligan), with the help of her fiancé, Jacob Moore (LaBeouf).\nPrincipal photography took place in New York between September and November 2009. After having its release date moved twice, Money Never Sleeps was released theatrically worldwide on September 24, 2010, by 20th Century Fox. Prior to its official release, many journalists connected to the financial industry were reportedly shown advance screenings of the film.\nDespite opening to positive reception at the 2010 Cannes Film Festival, Money Never Sleeps received mixed reviews from critics. Though failing to meet its critical expectations, the film was successful at the box office, topping the United States's ranking during its opening weekend, and earning a worldwide total of $134 million in ticket sales, and more than $15 million on DVD.", "plot": "In 2001, Gordon Gekko is released from prison after serving time for insider trading and securities fraud.\nIn 2008, Gekko is promoting his new book Is Greed Good?, warning about a coming economic downturn. His estranged daughter, Winnie, runs a small, non-profit news website and is dating Jacob Moore, a top trader at Keller Zabel Investments (KZI). Jacob, a protégé of KZI managing director Louis Zabel, has been raising money for Dr. Masters and his fusion research project, which might create abundant clean energy. Jake is also financially assisting his mother, Sylvia, who has quit nursing to speculate in residential real estate.\nIn the early stages of the downturn predicted by Gekko, KZI's stock loses more than 50% of its value. Louis Zabel tries to arrange a bailout for KZI from other Wall Street banks but is blocked by Bretton James, head of rival firm Churchill Schwartz (Church), which KZI had refused to help during the dot-com bubble years earlier. Despondent, Zabel commits suicide by jumping in front of a subway train. A distraught Jacob proposes marriage to Winnie, who accepts.\nJacob attends a lecture given by Gekko and introduces himself. Gekko tells him that KZI's collapse started when Bretton spread rumors of KZI having toxic debt. Jacob and Gekko arrange a trade: Jacob will try to reconcile Winnie's and Gekko's relationship, and Gekko will gather information to destroy Bretton for his actions against KZI and for providing evidence against Gekko years ago. In revenge, Jake illegally manipulates the market by spreading rumors about the nationalization of a foreign oil field which Church has invested in. The company loses $120 million, but Bretton gives Jake a job, impressed by his initiative. Jake further impresses Bretton when he convinces Chinese investors to invest in the fusion project through Church.\nJake attends a $10,000-a-seat fundraiser with Winnie, buying a seat for Gekko to facilitate a \"chance\" meeting. Gekko confronts Bretton about what he did to him and to KZI. Bretton replies that no one cares what Gekko thinks anymore. Gekko also bumps into Bud Fox (Charlie Sheen), who following his release from jail turned Bluestar Airlines into a huge success, sold it for millions, and retired from business to play golf and become a philanthropist. Gekko follows Winnie outside, where she explains why she blames him for everything that went wrong, stemming from his affairs and her brother Rudy's suicide. Gekko claims he worked, from prison, to get the best therapists and even paid off a drug dealer to stop selling to Rudy, who died from an overdose. Winnie forgives him.\nAs the financial crisis accelerates, Bretton and Churchill Schwartz's Chairman Julius Steinhardt advise federal regulators to buy their multi billion-dollar subprime loans. As real estate collapses, Jake helps out Sylvia with his own money. Shortly after Winnie informs Jake that she is expecting their first child, Jake learns that Bretton is diverting the Chinese investment into underperforming solar panels, which are not a threat to his large position in fossil fuels.  Gekko soon informs Jake that Bretton had secretly made huge profits betting against subprime loans yet still accepted the feds massive bailout.\nGekko proposes using a $100 million trust fund account, which he hid in Switzerland for Winnie in the 1980s, to fund the fusion research. She signs the money over to Jake, not knowing he would entrust it to Gekko to complete the investment. When Gekko betrays them by leaving the country with the money, Winnie breaks up with Jake. Gekko sets up a hugely successful investment company in London, capitalized by the $100 million. Jake visits him to propose a new trade: Winnie gets her money back, and Gekko can participate in his grandchild's life. Gekko refuses.\nJake pieces together all the details of Bretton's dealings, from KZI's collapse through to his unnecessary government bail-out of Bretton's company.  He gives the information to Winnie, telling her that revealing it will bring her website publicity and credibility. When Winnie runs the story, Bretton finds himself under intense government scrutiny and is fired by his company's board, who then turn to Gekko's firm for a partnership, which recently posted a $1.1 billion return on investment.\nJake has successfully reunited with Winnie in New York, when late one night Gekko appears, apologizes and tells them that he has anonymously deposited $100 million into the fusion research account. One year later, Gekko, Sylvia and other family and friends attend the first birthday party of Louis, Jacob and Winnie's son."}