{"_movieID": "60540", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:14:21", "summary": "Sushi Girl is an American crime film directed by Kern Saxton and starring Tony Todd, Mark Hamill, Noah Hathaway, Sonny Chiba and Cortney Palm. Tony Todd also served as an executive producer. It premiered at a TCL Chinese Theatre, played in several festivals and was then released directly to home media in 2012.\n\n", "plot": "Fish (Noah Hathaway) has been recently released from prison where he was serving time for his part in a diamond heist. He refused to give the authorities any information on his partners in crime nor reveal to them the location of the stolen diamonds. In order to locate and divide the stolen diamonds, crime boss Duke (Tony Todd) invited Fish to dinner along with the rest of the gang, including Crow (Mark Hamill), Max (Andy Mackenzie) and Francis (James Duval). The meal is sushi, served on the naked body of a woman, the titular Sushi Girl (Cortney Palm), who must remain motionless and silent for the duration of the meal.\nWhen Fish tells the others that he doesn't have the diamonds, they do not believe him. He is tied up, with Max and Crow taking turns torturing him. Duke instructs Francis to take a turn as well, but he refuses. Francis goes to the bathroom and it is revealed to the camera that he is wearing a listening device. The sequences of torture are intercut with flashbacks to the heist, culminating in the gang being run off the road by another car, with Duke shooting the driver in order to escape. Eventually Max loses control and begins to beat Fish savagely, killing him.\nMax, Crow and Duke begin to argue savagely about who was responsible for Fish's death. Francis comes back from the bathroom, and wants to leave, accusing Duke of arranging this dinner in order to kill them all, and thus wrap up loose ends. Duke, in turn, accuses Francis of being a spy for the police. The others demand that Francis unbutton his shirt and prove that he is not wearing a wire. Francis responds by insulting Duke and taunting Max. Max finally loses control and assaults Francis, tearing open his shirt, thus revealing that there is no listening device. Despite this, Francis is shot by Duke.\nAfter more arguing the remaining three eventually draw their guns on one another and shooting breaks out. Only Duke survives. He returns to the Sushi Girl, who has remained silent and motionless all this time. Duke tells her that she is to be his 'consolation prize'. He eats a piece of fugu from her body and promptly succumbs to paralysis, whereupon she sits upright and tells him the fugu was purposely prepared leaving the toxins intact. A final flashback reveals that she was present at the heist's aftermath; it was her husband whom Duke shot, and she who recovered the diamonds after the bag was ripped open. She explains that she used her newfound riches to arrange this night and take her revenge upon the gang, and then she shoots Duke fatally and departs."}