{"_movieID": "308529", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:41:49", "summary": "Kickboxer: Vengeance is a 2016 American martial arts film directed by John Stockwell, and starring David Bautista, Alain Moussi, Gina Carano, Georges St-Pierre, and Jean-Claude Van Damme. It is the sixth film in the Kickboxer franchise and also serves as a reboot. The film has a similar premise as the first film in the franchise. The film was released in select theaters and on VOD by RLJ Entertainment on September 2, 2016.", "plot": "Kurt Sloane goes to Thailand and heads to the martial arts compound of Tong Po. He is met with resistance by doorman Kavi. When Kurt pays Kavi to let him in, Kavi starts a fight with Kurt. However, Kurt is able to get the upper hand on Kavi and defeats him. Another compound fighter, Storm, struts his stuff and is able to beat Kurt. Kurt and Kavi are doing laundry when Kavi attempts to steal Kurt's wallet. Kurt, noticing what Kavi was up to, tells him to return the wallet but lets him keep the money. That night, Crawford introduces Tong Po to the compound and Tong Po shows his strong he is when he uses simple knees and elbows to a statue that breaks. After a few battles between compound fighters, Tong returns inside to meet with his escorts. Later that night, Kurt wakes up and finds Tong Po. Discovering Kurt has pointed a gun to him, Tong Po tells Kurt that his brother was brave and a warrior where Kurt is a coward. Tong Po knocks Kurt out and Crawford informs Kurt that because of what he had attempted, the police have been called in to arrest him.\nFlashbacks reveal that Eric Sloane has won the World Karate Championship. At a celebratory event at the Sloan Gym, fight promoter Marcia arrives and invites Eric to go to Thailand to fight in an underground match. Eric thinks that they can make more money and get their name known, while Kurt is extremely skeptical and attempts to talk Eric out of going. Eric, determined, has made up his mind and tells Kurt he is leaving. A while later, Kurt receives an envelope with Eric's championship medal and a ticket to Bangkok. Kurt has learned that the night he is there, Eric is scheduled to fight Tong Po. Meanwhile, Liu, a local Thai police officer, has been planning to stop the underground fights much to the chagrin of her superior, Wattona, who is on Marcia's payroll. When Kurt arrives to Thailand, he sees Eric being brutalized by Tong Po. Tong Po puts Eric in a headlock and breaks his neck, killing him. Liu and some officers show up, forcing everyone to disperse except for Kurt, who is with his brother. At the coroners, Kurt confronts Marcia, blaming her for what had happened to Eric. Marcia told her it was Eric'c choice. As Kurt attempts to confront Marcia, he is stopped by police, who then escort him first to meet Master Durand, Eric's Muay Thai trainer, who gives him Eric's money from the fight and then to the airport. Kurt is warned to leave Thailand and never come back. However, he ends up staying.\nReturning to the present, the police take Kurt but they are stopped by Liu, who offers to take Kurt herself. However, suspecting Liu may have other plans, Wattona sends some thugs to deal with Liu and Kurt. As they are stopped on the street, Kurt and Liu are confronted by the thugs but Kurt is able to fend off the thugs with his martial arts skills. Liu takes Kurt to Master Durand and tells him to stay there until he is well enough to return to America. However, Kurt attempts to convince Durand to train him to face Tong Po. Durand, feeling he has already failed Eric, declines Kurt's offer. However, after a confrontation in the rain, Durand sees determination in Kurt and decides to train him. As Kurt begins his training, he and Liu slowly begin to start a romance. As Kurt feels ready, Durand gives him a test to a local bar where Joseph King sets up some small fights against his top fighter for money. When Durand has Kurt fight King's fighter, Kurt is decimated to the point where Durand must step in and stop the fighter before bringing Kurt back. Kavi shows up as a spy for Tong Po, but when Durand defeats Kavi, he makes Kavi a deal that will prevent him from having Tong Po get angry. Kavi has now joined Durand and helps Kurt train as well. When Kurt finally finds himself ready, he shows up at Tong Po's compound and has a rematch with Storm, which he now wins but then is faced with another fighter. Using his newfound skills, Kurt challenges Tong Po to a fight, to which he accepts. Liu has learned through surveillance that Kurt has challenged Tong Po.\nThe next day, Liu has Kurt and Durand arrested for safekeeping with Liu having full intention on protecting Kurt from Tong Po. Knowing that night would be the fight between Kurt and Tong Po, Durand and Kurt are able to escape. Liu also informs Wattona that she is having him investigated for corruption with the country's authorities. That night, Kurt and Tong have their long-awaited match. The first round has Tong Po getting most of the upper hand, but Kurt proves to be a worthy fighter, impressing the crowd. The second round includes broken glass on the hands, but once again Tong Po proves to be too powerful. Liu shows up to arrest Marcia, who vows she will be out the next morning. Liu arrives at the fight, but does not stop the fight this time. \nThe final round has Tong Po and Kurt fight with double swords to the death. Kurt is able to knock one of Tong Po's swords out of his hands and throw one of his swords, slashing Tong Po in the face and the sword impales on the wall. Kurt still gets knocked down, but finally has the determination to take on Tong Po. Kurt is able to now get the upper hand, especially when he has countered Tong Po's headlock, the same move that killed Eric. Kurt uses an array of Muay Thai and even adds a bit of grappling to stop Tong Po. However, when it looks like Kurt has won, Tong Po pushes Kurt to the impaled sword and the two lock up with Kurt finally using his strength to impale Tong Po on the exposed blade of the sword, killing him when he tells Tong Po, \"This is for Eric\".\nThe next day, Kurt and Liu leave on a boat with Kavi and another female with Durand offering his goodbye in comic fashion.", "cast": "Alain Moussi as Kurt Sloane\nJean-Claude Van Damme as Master Durand\nDave Bautista as Tong Po\nDarren Shahlavi as Eric Sloane\nGina Carano as Marcia\nGeorges St-Pierre as Kavi\nSara Malakul Lane as Liu\nMatthew Ziff as Bronco\nT.J. Storm as Storm\nSteven Swadling as Joseph King\nSam Medina as Crawford\nLuis Da Silva as Stahl\nCain Velasquez as King's Fighter\nFabricio Werdum as Fighter\nMichel Qissi as Prisoner (uncredited cameo)"}