{"_movieID": "297270", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:13:22", "summary": "Tinker Bell and the Legend of the NeverBeast is a 2014 American computer-animated fantasy film directed by Steve Loter. The sixth and final installment in the Disneytoon Studios Tinker Bell film series, based on the character Tinker Bell from J. M. Barrie's Peter and Wendy. It is the final feature film to be produced by Disneytoon Studios before its closure in 2018.Mae Whitman, Lucy Liu, Raven-Symoné, Megan Hilty, Pamela Adlon, and Anjelica Huston reprise their roles of Tinker Bell, Silvermist, Iridessa, Rosetta, Vidia and Queen Clarion. Ginnifer Goodwin joins the cast, replacing Angela Bartys as the voice of Fawn in this film, Rosario Dawson joins the cast as new character Nyx. Singer Mel B also joins the cast as new character Fury in the British release while Danai Gurira voices Fury in the American release.", "plot": "Fawn (voiced by Ginnifer Goodwin) rescues a baby hawk with a broken wing. Once it recovers, she, with the help of Tinkerbell (voiced by Mae Whitman), attempts to hide it from the other fairies, as grown hawks eat fairies and everyone is afraid of them. However, their attempt fails and the baby hawk is revealed. The adult hawks hear its calls and arrive to attack and to reclaim the baby, but the scout-fairies are able to fend them off.\nFawn is reprimanded by Queen Clarion for following her heart and not her head. After helping the baby hawk return to its rightful home, Fawn hears an unfamiliar roar and decides to fly to the depths of the forest to investigate. She finds a massive, unusual creature that has never been seen before, laying in a cave beneath the earth. It has a thorn stuck in its paw and Fawn tries to get it out for him, but he \"blows\" her out of his lair with a powerful snort of air. Fawn is determined to get the thorn out, and later when the beast emerges from its slumber, she manages. She realizes the beast isn't vicious, it just simply goes along with its business: moving rocks and boulders into a pile formation. Fawn stays to observe this behavior, and she surmises that it has traits similar to many different animals she's encountered, such as thick legs for digging and wide, powerful jaws for carrying the rocks. Eventually she names him Gruff. She helps Gruff as he builds four identical, giant rock towers, one in each season of Pixie Hollow. All the while Fawn tries to figure out why he's doing it.\nMeanwhile, in Pixie Hollow, an ambitious scout fairy named Nyx (voiced by Rosario Dawson) also heard the roar, and decides to investigate, researching in the fairy lore library to find out what she's up against. Using some pieces of information gathered from several torn pages of an undisclosed animal-book, she discovers that Gruff is a creature that awakens about once every thousand years, when he will transform into an even more ferocious beast that could destroy Pixie Hollow with a mysterious series of events that culminate in a deadly storm.\nFawn reveals Gruff to Tinkerbell, Silvermist, Vidia, Rosetta, and Iridessa, and explains that he isn't aggressive, but friendly. She wants to show him to the Queen and demonstrate that he isn't a fairy-eating monster. Her plan goes wrong when she approaches Queen Clarion, because Nyx got to her first and already presented the legend of the NeverBeast. Fawn decides not to tell the Queen about Gruff. She is horrified of the legend but is confident that it all is just a big misunderstanding.\nQueen Clarion urges both Fawn and Nyx to work together and \"do the right thing\" regarding the protection of Pixie Hollow. Each fairy takes this edict to mean different things: Fawn sets out to relocate Gruff so he'll be safe from the Scouts, while Nyx is determined to capture him and prevent the impending storm.\nThe next day, before Fawn could move him, Gruff disappears and indeed transforms into the monster depicted in the fairy lore, growing wings and horns. Fawn and Tinkerbell set out to find him before the Scouts do. Tinkerbell finds him first but he doesn't seem to recognize her. He knocks Tinkerbell with his tail so hard she passes out. Fawn finds Tinkerbell and is heartbroken to discover Nyx was right about Gruff. She lures Gruff to be captured by Nyx and the other Scouts and taken away, causing herself to cry. Tinkerbell wakes up and explains that if Gruff hadn't shoved her out of the way she would've been crushed by a falling tree. Fawn realizes she misunderstood the whole thing, and they set off to free Gruff with some of their fairie friends.\nThey successfully free Gruff, and though he is weak from the ordeal of being captured, he and Fawn start the ritual that will save Pixie Hollow. The rock towers Gruff built have collected lightning and he flies through each one, and the lightning then redirects to his horns as the towers crumble. The last tower is destroyed by Nyx before Gruff can get to it. Thus the plan has failed, and the lightning strikes and starts a fire all around Pixie Hollow. When lightning almost hits Nyx, Gruff catches it in his horns and saves her, and Nyx finally understands that Gruff is there to save Pixie Hollow from the storm, not destroy it.\nThere is no time to rebuild the towers, so Fawn comes up with an idea. She leads Gruff high into the sky where he absorbs all the lightning strikes. Then he flies directly into the eye of the storm, and with a large blast, it ends. Gruff falls to the ground, where the fairies catch him with pixie dust before he lands, softening his fall. Gruff's wings are burnt off and his once-long horns are now small nubs. Worst of all, Fawn seems to be dead. The Neverbeast mourns her along with everyone else, but as he barely touches Fawn's body, after-lightning sparks through him and into her. This revives Fawn and all rejoice.\nFor the next few days, Gruff helps around Pixie Hollow by moving large things. He begins to feel very tired, as it's time for him to go back into hibernation. The fairies sadly send him off to his cave in a gentle, respectful ceremony. They want to make his thousand-year sleep comfortable, so his cave has been given a pillow made of cotton and a mattress made of straw for him to sleep on, as well as a trickling pool of spring water that emits of a soft glow of light as a night light. The fairies give their good byes, and leave the content Gruff to sleep for another 937 years. His legend is retold by Fawn as the Guardian and Protector of Pixie Hollow."}