{"_movieID": "8987", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:55", "summary": "The River Wild is a 1994 American adventure thriller film directed by Curtis Hanson and starring Meryl Streep, Kevin Bacon, David Strathairn, John C. Reilly, Benjamin Bratt,  and Joseph Mazzello as Roarke. It is about a family on a whitewater rafting trip who encounter two violent criminals in the wilderness.", "plot": "A Boston couple, Gail (Meryl Streep) and Tom Hartman (David Strathairn), are having marital problems, due to his inability to spend time with his family because of his work as an architect. She, a history teacher and former river guide, decides to take their son, Roarke (Joseph Mazzello), on a holiday rafting trip down the Salmon River in Idaho, along with their dog, Maggie. Their daughter, Willa (Stephanie Sawyer), accompanies them to Gail's parents' house in Idaho. At the last minute, just when they are about to leave for the almost week-long trip, Tom joins them. As they are setting off, they meet a trio of other rafters, Wade (Kevin Bacon), Terry (John C. Reilly), and Frank (William Lucking), who appear to be friendly. Thus they leave for the trip, leaving Willa behind to be taken care of by her grandparents.\nThe Hartmans catch up with the trio during a day break, and notice that Frank is no longer with Wade & Terry. They explain that Frank decided to hike out after an argument. Unfortunately, Frank was their guide, and Wade & Terry lack any experience on the river. In the spirit of cooperation often found in the backcountry, Gail offers to lead them down the rest of the river. Before getting back on the water, Maggie is found barking and digging at something buried farther up the canyon wall - presumably Frank's body. Tom interrupts Maggie before she discovers the body, and brings her back to the boats. Tom is startled by Terry, who was sent by Wade to ensure Tom didn't learn what had happened to Frank.\nAfter a day's rafting, they make camp for the night, but Tom continues to work on his renderings rather than entering fully into the experience, which agitates Roarke. They are joined by Wade and Terry, who help to celebrate Roarke's birthday that night. Gail becomes friendly with Wade. However, after a while he begins acting suspiciously, and she decides it would be best to part ways. During the morning's rafting, he reveals to Roarke that they have a gun with them. As they raft down the river, Gail and Tom discuss a strategy that will allow them to leave Wade and Terry behind, and at lunch they attempt to leave on their raft and get away before Wade and Terry realize what is going on.\nThe attempt fails, and Wade pulls the gun on them and assaults Tom. Maggie runs off during the melee, avoiding a shot by Wade. Gail then realizes that an armed robbery she had heard about was carried out by Wade and Terry, and their rafting trip is actually a way for them to get away. Having found out that they are criminals, the Hartmans are forced down the river at gunpoint before they set up camp for the night.\nDuring the night, Tom attempts to steal the gun from Terry while he sleeps but is heard and has to run into the bushes and to the river. Wade gives chase and believes he has shot Tom when he hears a loud splash into the water. A park ranger named Johnny (Benjamin Bratt), who knows Gail, is whitewater canoeing down the river. He bumps into them. Wade holds the gun to Gail's back, and they pretend everything is okay.\nWade and Terry plan to escape by rafting a set of rapids named the Gauntlet, where rafting is no longer allowed because in recent years one person was killed and another was left paralyzed. Aware that Gail is one of only three people to have ever survived it, they force her to raft down it despite her repeated declarations that she can no longer navigate such big water, especially not with novices and Roarke. Johnny returns, trying to warn them off going on the Gauntlet, which has been made illegal. Wade shoots Johnny and throws his body into the rapids.\nUnbeknownst to anyone Tom has been racing on foot along the canyon rim to get ahead of the raft, in a desperate attempt to save his family. After a harrowing ride in which Terry is nearly drowned, they manage to make it through the Gauntlet. Tom reappears, and manages to flip the raft. As he struggles with Terry, Gail is able to get the gun.\nWade tells Gail there is no need to kill him, and that if she does, it will haunt her because she will never have a way to know if she truly had to. She, knowing Wade believes the gun has only one round, points it into the air to fire it, but it only clicks on an empty chamber, after which Wade orders Terry to kill Tom and Roarke, and Wade goes after Gail. Gail opens the gun, sees the remaining cartridge, chambers the last round, and fatally wounds Wade, who is dragged off with the money by the current. The film ends with the Hartmans and Terry, who has been arrested, being helicoptered out."}