{"_movieID": "76494", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:40", "summary": "What to Expect When You're Expecting is a 2012 American romantic comedy film that follows the lives of five interconnected couples in the Atlanta area as they experience the thrills and surprises of having a baby, and realize that no matter what you plan for, life does not always deliver what is expected. It was distributed by Lionsgate, produced by Mike Medavoy, Arnold Messer and David Thwaites, co-produced by Alcon Entertainment, Phoenix Pictures, What to Expect Productions and Georgia Public, edited by Michael Berenbaum, directed by Kirk Jones from a screenplay by Shauna Cross and Heather Hach with music by Mark Mothersbaugh and based on the pregnancy guide of the same name by Heidi Murkoff.\nThe film stars Cameron Diaz, Jennifer Lopez, Elizabeth Banks, Chace Crawford, Brooklyn Decker, Anna Kendrick, Matthew Morrison, Dennis Quaid, Chris Rock and Rodrigo Santoro. The film was theatrically released on May 18, 2012 by Lionsgate. The film earned $84.4 million on a $40 million budget. What to Expect When You're Expecting was released on DVD and Blu-ray on September 11, 2012 by Lionsgate Home Entertainment.", "plot": "Set in Atlanta, the film opens with TV fitness trainer Jules Baxter (Cameron Diaz) and her dance partner Evan Webber (Matthew Morrison) performing on the TV show Celebrity Dance Factor. They are crowned the winners of the show, but Jules vomits in their trophy, discovering that she is pregnant. Jules struggles when trying to balance her pregnancy with her normal active life. After being told during the ultrasound that she is having a son, she has an ongoing argument with Evan over whether or not to have their son circumcised. During labor, she chooses not to have an epidural. She gives birth to a daughter they name Emerson, ending their debate. After giving birth, Jules and Evan get engaged.\nPhotographer Holly Castillo (Jennifer Lopez) can't conceive children and decides to adopt from Ethiopia with her husband, Alex (Rodrigo Santoro). They decide to buy a new house for the baby. Holly sends Alex to hang out with the \"dudes group\", a group of fathers who walk around the park and support one another, which was founded by Vic Mac (Chris Rock). Alex feels even more nervous to become a father. Holly loses her job and becomes hurt when she realizes how much Alex is unprepared for a child. However, they eventually go to Ethiopia and adopt a baby boy named Kaleb.\nWendy Cooper (Elizabeth Banks) runs a breast feeding boutique called The Breast Choice, and has been trying to have a baby with her husband Gary (Ben Falcone) for two years. She eventually does conceive and shares the news with Gary after taking five pregnancy tests.  Having planned a magical and happy pregnancy, Wendy feels awful throughout it and, during a convention she was chosen to speak at about the miracle of childbirth, she begins to break down and bursts out into a speech about how much the process sucks. Her outburst is filmed and becomes a viral hit on YouTube, after which her boutique is flooded with customers. After many labor-inducing activities, she goes to the hospital only to find out she has to have a cesarean section, which is against her birth plan. She loses a lot of blood, but is okay and delivers a son named Theo.\nRamsey Cooper (Dennis Quaid), a famous race car driver and Gary's father, is married to a younger woman named Skyler (Brooklyn Decker), making her Gary's stepmother. She treats Gary as her own son despite her obviously not being his mother, much to Gary's annoyance. During a lunch where Wendy and Gary announce her pregnancy, Ramsey and Skyler also announce they are expecting. Unlike Wendy, Skyler cruises through her pregnancy without issues. Wendy envies her and detests her ease; however, soon after Skyler gives birth to twin girls named Laverne and Shirley, she and Ramsey are shown struggling with the fussy babies. Theo, meets the half-aunts Laverne and Shirley.\nRosie Brennan (Anna Kendrick), Skyler's cousin and food-truck chef, meets an old high school friend, Marco (Chace Crawford), also a food-truck chef, during a turf war between their food trucks. She believes he is a player and initially blows him off, but the reunion leads to an unexpected pregnancy after sex that night. Worried at first, they eventually adjust to the idea of becoming parents and move in together. However, one night Rosie discovers she is bleeding and they drive to the hospital where they discover she has miscarried. Devastated, Rosie tells Marco to leave, which he does, but he makes several attempts to get back with her. Eventually, they get back together and decide to take things slowly and their story ends with them joining forces to create a food truck together.\nAt different points in the film, certain characters meet others and we discover all the stories are linked. Many of the characters are fans of one or both of Jules' two TV series. Gary was on Jules' weight loss program and is a regular customer of Marco's food truck, Skyler is Rosie's cousin, and Holly is Wendy and Skyler's photographer.", "cast": "Cameron Diaz as Jules Baxter, a contestant on a celebrity dance show and a host to a weight-loss fitness show, who becomes pregnant with her dance partner's baby girl named Emerson\nJennifer Lopez as Holly Castillo, a woman who adopts a baby boy named Kaleb from abroad with her unwilling husband after difficulty conceiving\nElizabeth Banks as Wendy Cooper, Gary's wife and Theo's mother who becomes pregnant after trying for 2 years. Runs the Breast Choice Boutique.\nChace Crawford as Marco, who reunites with an old flame (Rosie) after a turf war between their respective food trucks\nBrooklyn Decker as Skyler Cooper, the wife of a much older man named Ramsey, stepmother of Gary who becomes pregnant with twins Laverne & Shirley\nBen Falcone as Gary Cooper, Wendy's husband Theo's father, son of Ramsey, stepson of Skyler and two half-sisters Laverne & Shirley\nAnna Kendrick as Rosie Brennan, who reunites with an old flame and fellow food-truck owner and becomes pregnant unexpectedly and has a miscarriage\nMatthew Morrison as Evan Webber, who teams with Jules on a celebrity dance show and the father of her baby girl named Emerson \nDennis Quaid as Ramsey Cooper, the husband of Skyler, father of Gary, Laverne & Shirley and grandfather of Theo\nChris Rock as Vic Mac, founder of the \"dude group\" and father of four.\nRodrigo Santoro as Alex Castillo, Holly's husband who's in music business and is not ready to have an adopted son named Kaleb \nJoe Manganiello as Davis\nRob Huebel as Gabe, a new parent who adjusts to \"fatherdom\" by bonding with other dads in a city park-based group that is part play group, part secret society\nThomas Lennon as Craig, a father who joins Vic's \"dude group\"\nAmir Talai as Patel, a father who joins Vic's \"dude group\"\nRebel Wilson as Janice, an eccentric employee at The Breast Choice boutique\nWendi McLendon-Covey as Kara, Holly's co-worker and friend\nDwyane Wade has a cameo as himself\nWhitney Port has a cameo as herself\nMegan Mullally has a cameo as herself\nCheryl has a cameo as a TV dance talent show judge\nTyce Diorio has a cameo as a TV dance talent show judge\nTaboo has a cameo as a TV dance talent show judge\nKim Fields plays a social worker who helps out a couple with an adoption\nJesse Burch as Hutch Davidson\nMimi Gianopulos as Molly, Rosie's funny roommate who comforts and supports her\nGenesis Rodriguez as Courtney, Rosie's roommate"}