{"_movieID": "353074", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:37:00", "summary": "Run the Tide is a 2016 drama film directed by Soham Mehta, written by Rajiv Shah, and starring Taylor Lautner, Constance Zimmer, Kenny Johnson and Johanna Braddy. The film was produced by Pilar Savone and 1821 Pictures. The film focuses on Rey Hightower, a young man who learns that his former abusive drug-addicted mother has been released from prison and is planning on fixing her broken relationship with her two sons-(who she has not seen or talked to in six years since her incarceration). Not wanting to have anything to do with his mother, Rey and his younger brother Oliver decide to pack up their bags and run away from home to California to live a better life together.", "plot": "A young man named Rey Hightower (Lautner), is a college drop-out who has been raising his ten-year-old younger brother, Oliver, ever since their mother was sent to prison for drug-related charges six years prior; her first husband who is also the boys' father had abandoned them long before. Rey's high school sweetheart is in town for her late father's memorial service. She has graduated from college and is working for a tech company in San Francisco, while Rey works in his home town at a gas station. They spend the night together on a lookout tower before her imminent return; she has told him to visit her and she'll help get him started in something (pitying his plight). Their mother has just been released, hopefully rehabilitated, and determined to rebuild their family. Rey acts very bitter toward her, with no intention of reconciling, and while trying to protect his brother, he supposedly \"kidnaps\" him and heads for the California coast; also with the intention of connecting with his hopefully rekindled relationship. Upon visiting her workplace, Rey is rebuffed by his friend, who had been insincere (she is engaged to another) and is surprised he showed up. After a while, Oliver is soon resentful, as he had hoped to bond with his estranged mother. The boys are being pursued by her and her second husband (to whom she was married throughout her incarceration). After soul searching Rey contacts them—not far away as his mom had deduced they were headed for San Francisco from a map poster Rey marked where he dreamed of traveling—and directs them to his and his brother's location. Rey's mother, her husband and his brother Oliver head back home, while Rey strikes out on his own in California, against a panorama of the Pacific Ocean.", "cast": "Taylor Lautner as Reymund Hightower\nConstance Zimmer as Lola\nKenny Johnson as Bo\nJohanna Braddy as Michelle Turner\nNico Christou as Oliver Hightower\nDavid Barrera as TJ\nDerek Krantz as Michael\nK.C. Clyde as Dave\nPaul Sanchez as Big Biker\nRomi Diaz as Angela\nSean Rey as Buster"}