{"_movieID": "87428", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:07:03", "summary": "That's My Boy is a 2012 American satirical dark comedy film directed by Sean Anders and starring Adam Sandler and Andy Samberg. The film follows Donny Berger (Sandler), a middle aged alcoholic who once enjoyed celebrity status for being at the center of a teacher-student sexual abuse case, as he tries to rekindle his relationship with his adult son Todd (Samberg), born as the result of sexual abuse, in hopes that their reunion will earn him enough money to avoid going to prison for tax evasion.\nThe film was released on June 15, 2012, by Columbia Pictures, and despite a sizable budget for a comedy film and a cast made of well known actors, comedians, and celebrities, the film was both a critical and financial failure, grossing just $57 million against a $70 million budget. Further damaging the film's financial health was accusations of homophobic and misogynistic writing and criticism for its comedic treatment of child sexual abuse, rape, incest, and child neglect. Film critic Richard Roeper gave the film an F, calling it \"an ugly, tasteless, deadly and mean-spirited piece of filmmaking,\" and John Hanlon of Rotten Tomatoes, certified it rotten, saying it was \"easily the worst movie of 2012.\" Many have considered this to be one of the worst films ever made.", "plot": "The film begins in Massachusetts in 1984, when middle schooler Donny Berger sexually harasses his teacher, Mary Beth McGarricle, who in turn gives him detention alone and sexually assaults him. In a story that parallels that of the real life teacher-turned-sex-offender Mary Kay Letourneau, Mary's continued abuse of her pupil eventually results in pregnancy, and, when her crimes are discovered during a auditorium speech, she shows no remorse and is sentenced the maximum penalty: 30 years in a womens prison. Meanwhile, due to widespread media coverage of the event, Donny, blind to the seriousness of the situation at hand, enjoys his fifteen minutes of fame as a tabloid icon while his father takes custody of his newborn son, whom he names Han Solo Berger, after the Star Wars character of the same name, until Donny's 18th birthday. Unfortunately for Han Solo, even as an adult, Donny's mentality is still that of a 12 year old's and, time and time again, he proves himself to be an unfit parent, exposing Han Solo to drug and alcohol abuse, having his back illegally tattooed, forcing him to drive his father home to avoid a DUI charge, and allowing him to eat so much junk food that he becomes morbidly obese and develops diabetes mellitus type 2. Suffering from lifelong effects of the physical and psychological abuse done to him by his father, Han Solo severs all ties with Donny as an adult, changing his name to Todd Peterson and becoming a successful businessman. He also stops going to see his mother in prison after he turns 18.In 2012, Donny, now a middle aged broke and unemployed alcoholic, is suddenly made aware of the consequences of his lifelong nonchalance when he receives a phone call from his lawyer, who informs him that he owes $43,000 in back taxes and that unless the Internal Revenue Service receives their payment in full before the end of the week, he'll go to prison for up to three years for tax evasion. Having no way to earn so much money in so little time, Donny places an 8000:1 bet that an obese runner by the name of Tubby Tuke will win the upcoming Boston Marathon and, as a backup plan, phones a sleazy tabloid talk show producer, who offers him $50,000 to film a segment for his show, but the offer is only valid if Mary and Todd appear alongside him, as the segment would be a family reunion special. Desperate to avoid prison, Donny tracks down Todd to Cape Cod, to find his son, whom he's been estranged from since Todd left him on his 18th birthday, to be planning his wedding.\nAs Todd is embarrassed by his parent’s scandalous past and Donny’s immaturity, he has told his fiancee Jamie that his parents are dead. He has also told her this lie to avoid answering questions about his family, so Donny poses as a family friend and, much to Todd's chagrin, is well liked by his friends and future in-laws. While Todd is able to remain cordial towards his father in front of Jamie and the others, he and Donny fight constantly when alone. At first, he is willfully ignorant of how his actions, both past and present, are hurting his son. Soon, Donny finally apologizes to Todd and admits his regret in not being a better father to him. He explains that he was unprepared to be a father himself because his own father was an alcoholic and never taught him how to be one. When the stress of Donny's presence, combined with the stress of planning his wedding, are finally too much for him to bear, Todd ultimately suffers a mental breakdown, causing him to ruin the dress rehearsal and is almost banned from the church as he initiates a fight with the man who is both a church elder and the officiating priest. Donny, in a move unusual for his character, saves him by successfully convincing his future-in-laws to change the wedding rehearsal and keeping it away from churches. He mentioned that Todd never intended to hurt the priest and was suffering from a mental breakdown that was caused by the trauma he endured when he lost his parents in a church explosion. However, Donny's newfound maturity is short-lived and it's not long before he crashes Todd's bachelor party, moving it from a day spa to a strip club. Todd meets Brie and is impressed by her maturity.\nWith the deadline to the pay the IRS growing closer by the minute, Donny relief at finally convincing Todd to visit Mary is almost instantly replaced with feelings of guilt. He's unsuccessful in stopping Todd from visiting Mary and when he arrives at the women's prison, he's bombarded with cameras and learns of Donny's dealings with the producer, causing him to leave in disgust. In the midst of the chaos caused by the failed reunion, Donny is presented with yet another way to earn the money he needs to pay the IRS by exploiting Todd when Jamie offers him a $50,000 check to stay mum about her infidelity, as he catches her having sex with her own brother, Chad. She also asks him not to mention her affair with Todd's boss, Steve, as she was the main reason why he was promoted in his business. Donny accepts the money and is in the clear.\nHowever, the next day, this action starts to weigh heavily on his conscience and he decides to go to the wedding and stop it. Acting like a father to Todd for the first time in his life, Donny arrives at the wedding with his recently re-connected friend, Vanilla Ice, and declines Jamie's offer by ripping up the check right in front of her. He orders Jamie to confess to her incestuous relationship with Chad. Todd breaks up with Jamie, quits his job and returns to his birth name, Han Solo. Jamie and Chad try to attack Todd and Donny, but are both knocked unconscious by the two with the help of the priest.\nCome Monday morning, Han is revealed to be dating Brie. With no more time to earn the money to repay the IRS, he offers Donny the money to pay off his debts. He graciously declines Han's offer and decides to take responsibility for his actions. As he prepares to go to prison to rekindle his relationship with Mary McGarricle, he learns that his bet on Tubby Tuke would win the Boston Marathon proves good, earning him more than $160,000 and satisfying the IRS. Donny, Han and their friends celebrate."}