{"_movieID": "245168", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:31:49", "summary": "A suffragette was a member of militant women's organisations in the early 20th century who, under the banner \"Votes for Women\", fought for the right to vote in public elections, known as women's suffrage. The term refers in particular to members of the British Women's Social and Political Union (WSPU), a women-only movement founded in 1903 by Emmeline Pankhurst, which engaged in direct action and civil disobedience. In 1906, a reporter writing in the Daily Mail coined the term 'suffragette' for the WSPU, from suffragist, to belittle the women advocating women's suffrage. The militants embraced the new name, even adopting it for use as the title of the newspaper published by the WSPU.\nWomen had won the right to vote in several countries by the end of the 19th century; in 1893, New Zealand became the first self-governing country to grant the vote to all women over the age of 21. When by 1903 women in Britain had not been enfranchised, Pankhurst decided that women had to \"do the work ourselves\"; the WSPU motto became \"deeds, not words\". The suffragettes heckled politicians, tried to storm parliament, were attacked and sexually assaulted during battles with the police, chained themselves to railings, smashed windows, set fire to postboxes and empty buildings, set bombs in order to damage churches and property, and faced anger and ridicule in the media. When imprisoned they went on hunger strike, to which the government responded by force-feeding them. The death of one suffragette, Emily Davison, when she ran in front of the king's horse at the 1913 Epsom Derby, made headlines around the world. The WSPU campaign had varying levels of support from within the suffragette movement; breakaway groups formed, and within the WSPU itself not all members supported the direct action.The suffragette campaign was suspended when World War I broke out in 1914. After the war, the Representation of the People Act 1918 gave the vote to women over the age of 30 who met certain property qualifications. Ten years later, women gained electoral equality with men when the Representation of the People (Equal Franchise) Act 1928 gave all women the vote at age 21."}