{"_movieID": "411741", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:28", "summary": "Ingrid Goes West is a 2017 American black comedy-drama film directed by Matt Spicer and written by Spicer and David Branson Smith. The film stars Aubrey Plaza, Elizabeth Olsen, Billy Magnussen, Wyatt Russell, Pom Klementieff and O'Shea Jackson Jr. and follows a young woman who moves to Los Angeles in an effort to befriend her Instagram idol.\nThe film premiered in competition at the 2017 Sundance Film Festival, where it won the Waldo Salt Screenwriting Award. It was released in limited theaters in the United States on August 11, 2017 by Neon, grossing $3 million. The film received positive reviews, with many praising the script, dark themes, humor, and performances.\n\n", "plot": "Ingrid Thorburn is a mentally unstable young woman in Pennsylvania. After discovering on Instagram that an unrequited friend of hers named Charlotte did not invite her to her wedding, Ingrid crashes the reception and pepper sprays her in the face. Ingrid undergoes a brief stay at a mental hospital.\nAfter being released, Ingrid learns of a social media influencer named Taylor Sloane while reading a magazine article. Beguiled by her seemingly perfect life, Ingrid comments on one of her photographs and receives a slight response from Sloane. With an inheritance of over $60,000 from her deceased mother, Ingrid decides to move to Los Angeles to become friends with Taylor. Upon arrival, she rents a house in Venice from Dan Pinto, an aspiring screenwriter. She visits Taylor's regular hangouts and restaurants, and gets a makeover in her style.\nAfter running into Taylor at one of her favorite book stores, Ingrid follows her to her house and kidnaps her dog Rothko. She returns Rothko to Taylor, officially meeting her and her husband Ezra. Ingrid accepts their offer to stay for dinner, where they become acquainted. The next day, Ingrid borrows Dan's truck to help Taylor move some items to her home in Joshua Tree, promising she'll return it to him that evening. She lies and tells Taylor that the truck belongs to her boyfriend. They stay out late and party and on the way home, Ingrid damages Dan's truck while driving under the influence. She returns it the following morning, causing Dan to miss the table read of his screenplay that was scheduled for the previous night. \nThe next day at Taylor and Ezra's house, Ingrid meets Taylor's brother Nicky, a recovering drug addict. Taylor dismisses her previous plans with Ingrid to attend a party with Nicky, furthering Ingrid's disdain for him. Taylor and Nicky tease Ingrid about her imaginary boyfriend Dan, who they've never met. They invite Ingrid to a party that weekend at fashion blogger Harley Chung's house and tell her to bring Dan.\nIngrid apologizes to Dan for wrecking his truck, promising to reimburse him and take him out to dinner. Later that night, after bonding over their past losses, the two have sex and begin a relationship. Ingrid invites Dan to the party at Harley Chung's and asks him to tell everyone that he's her boyfriend. Once there, Ingrid becomes envious of Taylor and Harley's friendship. Ingrid also begins to realize that several aspects of Taylor's persona are fabricated. Nicky finds Ingrid's phone with incriminating photographs that reveal her obsession with Taylor. He blackmails her, in exchange for money. As retaliation, Ingrid devises a plan to feign domestic abuse and blame Nicky. Telling Dan that Nicky beat her, she begs him to not tell the police in fear of what Nicky may do to him; she instead convinces him to kidnap and terrorize Nicky to keep him quiet. Nicky escapes his bindings and attacks Dan, leading Ingrid to attack Nicky with a crowbar. After Dan is hospitalized, Ingrid tries to call Taylor, but Ezra answers and tells Ingrid that Nicky has told them what happened. He relates that Taylor does not want to hear from Ingrid again and that she would have been arrested if Nicky had not been trying to hide his own crimes.\nDesperate, Ingrid moves into the small house next door to Taylor, using the last of her inheritance. Unable to pay the bills, she eventually loses power at the house. After noticing a nearby Halloween party at Taylor's house, she dons a bed sheet and wig and crashes the party to charge her cellphone. When discovered, Ingrid berates Nicky, Ezra, and Taylor. Taylor responds by saying that because of her façade, the two were never truly friends, and suggests Ingrid seeks professional help. Bereft, Ingrid retreats to her home surrounded by lit candles and records a video for her Instagram page, confessing her loneliness before overdosing on pills.\nIngrid survives the suicide attempt because Dan called emergency services. She wakes in the hospital to learn that her video has gone viral, and thousands of strangers have responded to her hashtag #iamingrid to show support. Feeling loved, Ingrid smiles.", "cast": "Aubrey Plaza as Ingrid Thorburn, a mentally unstable woman with attachment issues, obsessed with social media.\nElizabeth Olsen as Taylor Sloane, a popular, narcissistic social media influencer with whom Ingrid becomes obsessed.\nO'Shea Jackson Jr. as Dan Pinto, an aspiring screenwriter and Ingrid's landlord who falls in love with her.\nWyatt Russell as Ezra O'Keefe, a painter and Taylor's husband.\nBilly Magnussen as Nicky Sloane, a recovering drug addict and Taylor's brother.\nPom Klementieff as Harley Chung, a fashion blogger.\nHannah Utt as Nicole\nJoseph Breen as Garth Lafayette\nAngelica Amor as Cindy\nMeredith Kathleen Hagner as Charlotte Buckwald, a woman Ingrid forms a one-sided friendship with.\nCharlie Wright as Chuck\nDennis Atlas as Buck"}