{"_movieID": "62837", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:09:06", "summary": "Dolphin Tale is a 2011 American 3D family drama film directed by Charles Martin Smith, from a screenplay by Karen Janszen and Noam Dromi and a book of the same name. It stars Nathan Gamble, Harry Connick Jr., Ashley Judd, Kris Kristofferson, Cozi Zuehlsdorff in her film debut, and Morgan Freeman. The book and film are inspired by the true story of Winter, a bottlenose dolphin that was rescued in December 2005 off the Florida coast and taken in by the Clearwater Marine Aquarium. Winter lost her tail after becoming entangled with a rope attached to a crab trap, and was fitted with a prosthetic one.\nThe film was released on September 23, 2011, by Warner Bros. Pictures; Dolphin Tale received positive reviews from critics and earned $95.9 million on a $37 million budget. A sequel, Dolphin Tale 2, was released on September 12, 2014.\n\n", "plot": "Sawyer Nelson, a lonely 11-year-old boy, has fallen behind in school since being abandoned by his father five years earlier. His only friend is his cousin Kyle, a champion swimmer who hopes to compete in the Olympics. Kyle leaves to spend time in the army.\nOne day on his way to summer school, Sawyer finds a fisherman attempting to help an injured dolphin tangled in a crab trap. The dolphin is taken for treatment to Clearwater Marine Aquarium (CMA), run by Doctor Clay Haskett. Clay's daughter Hazel names the dolphin Winter, after two prior dolphins, Summer and Autumn, had been treated successfully and returned to the ocean. Sawyer sneaks in to see Winter, and later starts to visit each day, being harassed by a roof-dwelling pelican named Rufus. Their respective parents are initially hesitant (Clay since Sawyer does not have any experience with marine animals, and Sawyer's mother, Lorraine, since Sawyer is skipping summer school without permission), but they realize that the friendship seems to benefit both Winter and Sawyer. Dr. Clay allows the visits to continue, and Lorraine withdraws Sawyer from summer school and lets him volunteer at CMA, and gives him a new wetsuit.\nHowever, Winter's tail is damaged and must be amputated. Winter learns to swim without a tail by developing a side-to-side motion like a fish, but after an X-ray, Clay notices the unnatural motion is causing unnatural stress on her spine, which if continued will cripple and eventually kill her.\nNews comes that Kyle has been injured in an explosion and is returning home for treatment. Sawyer is excited to see him, but devastated when Kyle, depressed, skips his own welcoming party and stays at the local Department of Veterans Affairs Medical Center, where Doctor Cameron McCarthy develops prosthetic limbs. Sawyer and his mother visit Kyle there, but Sawyer is affronted when Kyle asks them to leave. Not wanting to upset Sawyer, Kyle takes Sawyer for a walk and explains his situation and that he needs some time. Sawyer then asks Dr. McCarthy if he could make a prosthetic tail for Winter. McCarthy agrees to do so and convinces his prosthetic supplier Hanger Prosthetics and Orthotics to supply the parts at no cost. Dr. McCarthy manufactures a \"homemade\" model tail while waiting for the real one to arrive, but Winter rejects it by banging it against the pool wall. Meanwhile, Kyle gets more depressed when his friend and swimming partner, Donovan Peck, beats Kyle's old swimming records. McCarthy persuades Kyle to go home.\nThen CMA, already in financial peril, is heavily damaged by a hurricane. The board of directors agrees to close up and sell the land to a real estate developer, and find homes for all the animals except Winter; due to her condition she is not wanted, and may have to be put down. Kyle visits CMH and sees that Winter is like him, with a damaged limb. However, inspired by a girl with a prosthetic limb whose mother drives her 8 hours from Atlanta, Georgia to visit Winter, Sawyer imagines holding a \"Save Winter Day\" to save the facility. Clay is not convinced, but he reconsiders after talking with his father, Reed. Kyle agrees to race Donovan Peck and persuades Bay News 9 to cover the event.\nThe Hanger-supplied tail finally arrives; however, Winter rejects it too. Sawyer then realizes what the real problem is: the plastic base for the tail is irritating her skin. Therefore, McCarthy develops an alternative gel-like sock which he calls \"Winter's Gel\" (which is the real name of the Hanger product used to attach prosthetic limbs, developed during research with Winter). Winter accepts this new prosthetic tail.\nAt Save Winter Day, the work with Winter impresses everyone. Sawyer's teacher gives him school credit, allowing him to pass summer school. The fisherman who found Winter on the beach comes too. The real estate developer decides to keep CMH open and to support it financially.  With Winter's help, Kyle then wins a swimming race against Donovan.\nThe ending shows documentary footage from Winter's actual rescue, several of the prosthetic tails that Winter has worn, and scenes of real amputees visiting Winter at the Clearwater Marine Aquarium.", "cast": "Nathan Gamble as Sawyer Nelson, an 11-year-old boy who finds Winter and cuts the crab trap off her. He becomes a friend and paternal figure of sorts to Winter.\nWinter as herself, an injured dolphin that must have part of her fluke amputated. Despite that, she adapts and swims side-to-side, but that turns out to be bad for Winter's spine, so the prostethic fin which allows her to swim naturally is developed.\nHarry Connick Jr. as Dr. Clay Haskett, the operator of the Clearwater Marine Aquarium in Clearwater, Hazel's widowed father and Reed's son.\nAshley Judd as Lorraine Nelson, Sawyer's divorced mother and a nurse.\nKris Kristofferson as Reed Haskett, Clay's father and Hazel's grandfather.\nMorgan Freeman as Dr. Cameron McCarthy, a prosthetic designer and Kyle's doctor at the VA Hospital. He agrees to help create a prosthetic tail for Winter.\nKim Ostrenko as Alyce Connellan, Kyle's mother, Sawyer's aunt, and Lorraine's sister.\nJim Fitzpatrick as Max Connellan, Kyle's father and Sawyer's uncle. He is also an army veteran.\nCozi Zuehlsdorff as Hazel Haskett, an 11-year-old girl and the daughter of Clay and granddaughter of Reed. She helps out in the aquarium and becomes friends with Sawyer.\nRay McKinnon as Mr. Doyle, Sawyer's teacher.\nAustin Stowell as Kyle Connellan, Sawyer's cousin, who is a state swimming champion. At the start of the movie, he leaves to spend time in the army to get money to participate in the Olympics, but is injured and comes home prematurely.\nMichael Roark as Donovan Peck, a friend of Kyle's who is also a state swimming champion.\nFrances Sternhagen as Gloria Forrest, the owner of Clearwater Marine Aquarium.\nAustin Highsmith as Phoebe, the trainer of Clearwater Marine Aquarium.\nBetsy Landin as Kat, one of the Clearwater Marine Aquarium dolphin specialists.\nJuliana Harkavy as Rebecca, one of the Clearwater Marine Aquarium employees\nTom Nowicki as Philip J. Hordern, a real estate developer.\nRichard Libertini as the fisherman who finds Winter. He later visits during the fundraiser and gives them a generous donation. This would prove to be Libertini's final film role before his death in 2016.\nZoe Naomi as Lilla Forrest, the daughter of Gloria Forrest."}