{"_movieID": "696", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:32", "summary": "Manhattan (), (or the City), is the most densely populated of the five boroughs of New York City and its economic and administrative center, cultural identifier, and historical birthplace. The borough is coextensive with New York County, one of the original counties of the U.S. state of New York. The borough consists mostly of Manhattan Island, bounded by the Hudson, East, and Harlem rivers; several small adjacent islands; and Marble Hill, a small neighborhood now on the U.S. mainland, physically connected to the Bronx and separated from the rest of Manhattan by the Harlem River. Manhattan Island is divided into three informally bounded components, each aligned with the borough's long axis: Lower, Midtown, and Upper Manhattan.\nManhattan has been described as the cultural, financial, media, and entertainment capital of the world, and the borough hosts the United Nations Headquarters. Anchored by Wall Street in the Financial District of Lower Manhattan, New York City has been called both the most economically powerful city and the leading financial center of the world, and Manhattan is home to the world's two largest stock exchanges by total market capitalization: the New York Stock Exchange and NASDAQ. Many multinational media conglomerates are based in Manhattan, and the borough has been the setting for numerous books, films, and television shows. Manhattan real estate has since become among the most expensive in the world, with the value of Manhattan Island, including real estate, estimated to exceed US$3 trillion in 2013; median residential property sale prices in Manhattan approximated US$1,600 per square foot ($17,000/m2) as of 2018, with Fifth Avenue in Midtown Manhattan commanding the highest retail rents in the world, at US$3,000 per square foot ($32,000/m2) in 2017.Manhattan traces its origins to a trading post founded by colonists from the Dutch Republic in 1624 on Lower Manhattan; the post was named New Amsterdam in 1626. Manhattan is historically documented to have been purchased by Dutch colonists from Native Americans in 1626 for 60 guilders, which equals roughly $1038 in current terms. The territory and its surroundings came under English control in 1664 and were renamed New York after King Charles II of England granted the lands to his brother, the Duke of York. New York, based in present-day Manhattan, served as the capital of the United States from 1785 until 1790. The Statue of Liberty greeted millions of immigrants as they came to the Americas by ship in the late 19th and early 20th centuries and is a world symbol of the United States and its ideals of liberty and peace. Manhattan became a borough during the consolidation of New York City in 1898.\nNew York County is the United States' second-smallest county by land area (larger only than Kalawao County, Hawaii), and is also the most densely populated U.S. county. It is also one of the most densely populated areas in the world, with a census-estimated 2017 population of 1,664,727 living in a land area of 22.83 square miles (59.13 km2), or 72,918 residents per square mile (28,154/km2), higher than the density of any individual U.S. city. On business days, the influx of commuters increases this number to over 3.9 million, or more than 170,000 people per square mile (65,600/km2). Manhattan has the third-largest population of New York City's five boroughs, after Brooklyn and Queens, and is the smallest borough in terms of land area.Many districts and landmarks in Manhattan are well known, as New York City received a record 62.8 million tourists in 2017, and Manhattan hosts three of the world's 10 most-visited tourist attractions in 2013: Times Square, Central Park, and Grand Central Terminal. The borough hosts many prominent bridges, such as the Brooklyn Bridge and the Williamsburg Bridge; tunnel such as the Holland Tunnel; skyscrapers such as the Empire State Building and the Chrysler Building; and parks, such as Central Park. Chinatown incorporates the highest concentration of Chinese people in the Western Hemisphere, and the Stonewall Inn in Greenwich Village, part of the Stonewall National Monument, is considered the birthplace of the modern gay rights movement. The City of New York was founded at the southern tip of Manhattan, and the borough houses New York City Hall, the seat of the city's government. Numerous colleges and universities are located in Manhattan, including Columbia University, New York University, Cornell Tech, Weill Cornell Medical College, and Rockefeller University, which have been ranked among the top 40 in the world."}