{"_movieID": "157360", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:48", "summary": "In a World... is a 2013 American comedy film written, directed and co-produced by Lake Bell.\nThe film stars Bell as Carol Solomon, a vocal coach intent on doing voice-over work for film trailers. The film co-stars Demetri Martin, Fred Melamed, Rob Corddry, Michaela Watkins, Ken Marino, Nick Offerman, and Tig Notaro.\nThe film grossed nearly $3 million against a production budget of less than $1 million, and received positive reviews from critics.", "plot": "Sam Sotto is a Hollywood actor who is known as \"king of voice-overs\" for his extensive narration and voice-over work. He has recently published an autobiography and is about to receive a lifetime achievement award upon turning 60. \nHis 31-year-old daughter, Carol Solomon, is a struggling vocal coach who has always been overshadowed by her father. Carol agrees to help Eva Longoria (playing herself) to loop her accent as a British mob boss wife.\nSam forces Carol to move out of his house so that he can live with his girlfriend Jamie, who is a year younger than Carol. Carol leaves to stay with her older sister Dani and her husband Moe.\nAn upcoming film series, The Amazon Games, plans to bring back the \"In a world...\" line made famous by the late Don LaFontaine. The trailer voice-over is highly sought after. Sam bows out so that his friend and heir-apparent, Gustav Warner, can assume the role, but Gustav develops laryngitis and fails to show up to a temp track recording. Carol happens to be at the studio doing other work with engineer Louis, and she substitutes for Gustav. The series' executive producer (Geena Davis) decides she wants Carol for the job instead. Carol also gets other voice-over work, but she neglects to tell her self-absorbed father about her newfound success. Gustav and Sam feel entitled and are dismissive of the unknown woman who \"stole\" the job from them.\nCarol visits Dani at the hotel where Dani works as concierge. Intrigued by the voice of a flirtatious Irish guest, she asks Dani to interview and record him for her voice archive. During the interview, Dani pretends to be single.\nCarol joins Sam and Jamie at a party at Gustav's mansion. Gustav flirts with her, and Carol ends up staying the night. While waiting for Dani to come home from work, Moe listens to the recording of her interview with the hotel guest and is shocked at her lie. He leaves the apartment after she arrives.\nRumors spread quickly about Carol and Gustav. Gustav boasts to Sam of his night with some party-crasher, and when Gustav learns she is the woman in competition for the job, he decides to keep pursuing her, still not fully realizing who she is.\nSam and Jamie host a meal for Sam's daughters. It comes out that Carol is the mystery woman in the running for the coveted job. Sam is indignant, furious at Gustav, and dismissive of Carol, causing her to leave angry. Sam vows to compete for the job himself.\nDani is distraught about her husband, and Carol secretly records her anguish, sending the message to Moe to help win him back.\nCompetition for the job heats up. All three must send recordings for the studio to decide among. Carol is ready to drop out, but Louis champions her cause, also explaining that he likes her. Carol admits she likes him, too. They work together to produce the audition recording, then party together afterwards. At the end of the night, Louis finally kisses her.\nThough Carol is still angry at her father, Moe insists that she and Dani go to the Golden Trailer Awards, where Sam is due to receive a lifetime achievement award. There the trailer for The Amazon Games is revealed; Carol got the job and is elated. Sam storms off. Jamie berates him and threatens to leave him if he does not grow up and show support for his daughters. During his acceptance speech, Sam is magnanimous in victory, dedicating the award to his daughters. In the ladies room, Carol encounters the executive producer, Katherine Huling, who bluntly tells Carol that she was not the best person for the job, but was chosen for the greater meaning of having a woman in that role.\nIn the final scene, Carol goes back to her work as a voice coach, helping low self-esteem, high-pitched, squeaky-voiced women to speak less like a \"baby doll\" or \"sexy baby\" and be taken more seriously as mature women, using her voice-over on The Amazon Games trailer as their inspiration."}