{"_movieID": "180863", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:48:39", "summary": "T2 Trainspotting is a 2017 British black comedy drama film, set in and around Edinburgh, Scotland. The film was directed by Danny Boyle and written by John Hodge, based on characters created by Irvine Welsh in his novel Trainspotting and its follow-up Porno. T2 was released in the United Kingdom on 27 January 2017, and worldwide throughout February and March 2017.\nA sequel to Boyle's 1996 film Trainspotting, T2 stars the original ensemble cast, including leads Ewan McGregor, Ewen Bremner, Jonny Lee Miller, and Robert Carlyle, with Shirley Henderson, James Cosmo, and Kelly Macdonald. T2 features a new character, Veronika, played by Anjela Nedyalkova. T2 includes film clips, music and archive sound from the first film.\nT2 Trainspotting was a critical and commercial success, grossing £42.1 million against a production budget of £18 million.", "plot": "Twenty years after stealing £12,000 in drug money from his friends and making a new life in Amsterdam, 46-year old Mark Renton returns to Edinburgh after suffering a heart attack in a gym. Though now decades clean from heroin, he is on the verge of divorce and imminent job redundancy. On the brink of a mid-life crisis and at a loss for direction, a nostalgic trip back home was the result. Daniel \"Spud\" Murphy has returned to a cycle of heroin addiction after losing everything, including his wife, Gail, and visitation with his teenage son, Fergus, whom he fathered shortly after Renton left. Simon \"Sick Boy\" Williamson abuses copious cocaine, runs a failing pub, and engages in blackmail schemes with his Bulgarian girlfriend, Veronika. Francis \"Franco\" Begbie is still serving a 25-year prison sentence following the botched drug deal of twenty years before, and attacks his lawyer after being denied parole once again.\nRenton visits Spud just in the nick of time to save him from himself. Suicide attempt thwarted, Renton offers to help Spud overcome and redirect his addictions. Renton visits Sick Boy at his pub, but reunion initially goes sour as they soon get into a fight, as Sick Boy, still seething from being ripped off, can't resist giving Renton a good thrashing with whatever's at hand, including snooker cues. Afterward, Renton meets Veronika and pays Sick Boy back his original share of the money. Sick Boy is not appeased, outraged at the audacity of not even a cent of interest; he informs Veronika that he's going to string Renton along, reel him right back in, then make him pay fourfold for his betrayal.\nBegbie escapes from prison via the ruse of a self-inflicted injury, and returns to his girlfriend's flat, where he meets his college-bound son, Frank Jr., whom he forces to join him in burgling houses. Affronted by his son's choice of studying hotel management instead, he mocks his probability of not being his son. Begbie visits Sick Boy, who pretends to have heard of Renton living in Amsterdam and promises to provide Begbie with a false passport so he can travel to the Netherlands to exact his long-awaited revenge. \nRenton, Sick Boy and Veronika fraudulently apply for a £100,000 European Union business development grant to turn the upper floor of the pub into the business venture he'd promised Veronika, a \"sauna\" - or, basically, a brothel. Veronika, however, finds herself getting more drawn to Renton and they begin an affair. Spud, meanwhile, joins in the renovation and too befriends Veronika, who inspires him to write his memoirs. One of Sick Boy's blackmail targets reports him to the police, and Renton seeks legal advice from his ex-girlfriend, Diane Coulston, now a successful (and expensive) solicitor. The proceeds of their crimes are quickly used up in legal fees and Sick Boy's sizeable cocaine addiction. Renton manages to escape from Begbie after a chance encounter at a nightclub, but not before Begbie slashes him with a knife. Renton and Sick Boy are kidnapped by Doyle, owner of a rival brothel, who drives them to the countryside and intimidates them into abandoning their scheme, leaving them to walk back to Edinburgh stark naked.\nBegbie visits Spud, and in reading his memoirs, discovers that Renton left Spud his share of the money. Veronika arrives and Begbie steals her phone, which he uses to text Renton and Sick Boy to come to the pub at midnight. Veronika takes Spud to her apartment and asks him to leave with her, promising him half of the £100,000. Spud is afraid he will spend it on heroin again, so she offers to give his share to Gail and Fergus. He helps transfer the money to Veronika’s account by forging Renton's and Sick Boy's signatures. After reading another excerpt of Spud's writings about their encounter with Begbie's alcoholic father in the derelict Leith Central railway station, Begbie visits his girlfriend's flat for the last time, apologising to Frank Jr. for his abuse and telling him to be a better man than he or his father were.\nAt the pub, Spud arrives too late to warn Renton and Sick Boy of Begbie's trap. Begbie knocks Sick Boy unconscious and chases Renton across the upstairs floor. He throws Renton through the floorboards, leaving him suspended by the neck from electrical wiring; Begbie tries to strangle him, but Sick Boy douses him with pepper spray and saves Renton. Begbie pulls out a sawn-off shotgun and tries to kill them both, but Spud knocks him out with a toilet bowl.\nThey leave Begbie in the boot of Sick Boy's car outside the prison. Veronika returns to her son in Bulgaria. Spud puts together his book of memoirs and mends his relationship with Fergus and Gail, who suggests a title. Renton and Sick Boy resume their old friendship. Renton moves back into his widowed father's home and embraces him in reconciliation, before going to his bedroom and dancing to a remix of \"Lust for Life\".", "cast": "Footage included McGregor, Bremner, Miller and Carlyle from the original Trainspotting film. The author of Trainspotting, Irvine Welsh, appears near the middle of the film as Mikey Forrester, reprising his role from the first film. Carlyle also plays Begbie's father, the briefly seen wino in the Leith Railway Station."}