{"_movieID": "308369", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:56:32", "summary": "Me and Earl and the Dying Girl is a 2015 American comedy-drama film directed by Alfonso Gomez-Rejon and written by Jesse Andrews, based on Andrews' 2012 debut novel of the same name. The film stars Thomas Mann, Olivia Cooke, RJ Cyler, and Jon Bernthal. The film premiered at the 2015 Sundance Film Festival to a standing ovation. It received positive reviews from critics, who praised the screenplay and cast.", "plot": "18 year old Greg Gaines (Thomas Mann) is a senior at Pittsburgh's Schenley High School who avoids close engagement with the various student. He learns that fellow student and former childhood friend of his, Rachel Kushner (Olivia Cooke), has been diagnosed with leukemia and is forced by his parents (Nick Offerman and Connie Britton) to befriend her in her time of need. Despite an awkward first encounter on Rachel's staircase, with neither of them truly wanting the other's company, Greg manages to strike up a conversation about her pillow collection. She comes to find his quirky personality endearing, and they make plans to meet on a regular basis.\nGreg introduces Rachel to his friend Earl (RJ Cyler), with whom he makes short films parodying famous film titles. Despite Greg's reluctance, Earl shares their collection of short films with her, which she finds entertaining. As Rachel begins chemotherapy, her disease worsens, and Greg begins spending less time at school and more time with and caring for her.\nMadison (Katherine C. Hughes), Greg's crush, convinces Greg and Earl to make a film dedicated to Rachel, and Rachel persuades Greg to apply to a local college. Despite being accepted by the college, Greg continues to ignore schoolwork, and eventually school altogether, in order to finish the film. After realizing that her chemotherapy is doing more harm than good, Rachel opts to discontinue her treatment. Greg and Rachel have a heated argument over her choice where she points out his unwillingness to do anything selfless unless he's told to do so. He leaves, devastated that he can no longer help her.\nIn a rage, Greg confronts Earl, blaming him for the events leading to the end of his friendship with Rachel. Earl in turn admonishes Greg's inability to care and sympathize for anyone but himself despite the genuine affection she gave him, and ultimately punches Greg after the latter dares him to. Later, Earl gives Greg a heartfelt testimonial for Rachel before letting him know that he's finished with their friendship. Greg is also told that due to his failing grades, he has been rejected by the college he planned to attend.\nLater in the year, Greg's mom lets him know that Rachel has been moved into a hospice, which Greg originally believes to be for more treatment, before learning that she is in hospital to die. Madison invites him to the prom, but at the last moment, he decides to go to the hospital. During the journey to the hospital, Greg is asked by the limo driver if he loves Rachel, a question he finds himself unable to answer. He brings his iPhone and a portable projector and places a corsage around Rachel's wrist before running the film he made for Rachel on the front wall of her room, lying beside her as they did when they watched his other films. Rachel is moved to tears by the movie. However, shortly after viewing the film, she falls into a coma, dying a few hours later.\nAt her Shiva, Greg is comforted by Rachel's mom, as they grieve together for their loss. Earl and Greg reconcile and rekindle their friendship. During the funeral, Greg sneaks up into Rachel's room. Greg finds a card to him from her explaining that she wrote a letter to the college Greg applied to in order to let them know that he missed school for her sake. In a personal letter to Greg, Rachel states her wish for Greg to take any of her possessions that he pleases.  Rachel also explains through the letter that she sent to the college that Greg was the kindest and most caring person she had ever met. Greg also finds several intricate carvings within her books depicting scenes of her with Greg and Earl, proving that she still cared for him. Greg leaves with one of the books containing a personal carving and his favorite of Rachel's pillows.\nSome time later, Greg writes his story of his time with Rachel and mails it to the college along with the film he made for her with a warning that \"the last person who saw this immediately went into a coma and DIED.\""}