{"_movieID": "58760", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:48:37", "summary": "Jackboots on Whitehall (a.k.a. Nazi Invasion: Team Europe) is a 2010 British puppet adult animated satirical action comedy film set in an alternative history Second World War, in which Nazi Germany has seized London. The British must band together at Hadrian's Wall if they are to thwart the German invasion. Conceived by Edward and Rory McHenry, it is the first of its kind to feature animatronic puppets and the voices of well-known British actors including Ewan McGregor, Rosamund Pike, Richard E. Grant, Timothy Spall, Richard O'Brien and Richard Griffiths. The film was executive produced by Frank Mannion.The film premiered at the Edinburgh International Film Festival on 20 June 2010 and was theatrically released in the United Kingdom on 8 October 2010 by Vertigo Films. It received mixed reviews from critics, praising the cast, set design and voice acting but negativity is geared towards the puppetry, action scenes, humor and story, calling it \"lifeless, stiff, boring and unfunny.\"\n\n", "plot": "In 1940, Nazi Germany invades Great Britain by drilling under the English Channel and up through the cobblestones on Whitehall. In London, from his bunker under Downing Street, Prime Minister Winston Churchill issues a call to arms for all of Britain to band together to resist the invaders. In a small village, Chris, a young everyman rallies the residents to fight back. Joining forces with Churchill's small group of soldiers, the resistance movement retreats to Hadrian's Wall where the unlikely saviours of the country come from the Scottish highlands.", "cast": "As appearing in Jackboots on Whitehall, (main speaking roles and screen credits identified):\n\nIn using real-life characters to embody a more accurate portrayal, some characters are easily recognizable. While Battle of Britain hero and American pilot Billy Fiske appears, he embodies the characteristics of screen legend Clark Gable. Spall had previously portrayed Churchill in The King's Speech (2010)."}