{"_movieID": "412547", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:43:16", "summary": "Killing Gunther is an American action comedy film written and directed by Taran Killam, in his directorial debut. Arnold Schwarzenegger stars as the titular Gunther alongside Killam, Cobie Smulders, and Bobby Moynihan. It was released on video on demand on September 22, 2017, before being given a limited theatrical release on October 20, 2017 by Saban Films.", "plot": "Blake, an assassin, wants to become more famous by killing the world's greatest hitman, Gunther. He hires a documentary camera crew to have video proof and to document the process. He also puts together a team composed of his friend Donnie, an explosives expert; Sanaa, the daughter of legendary hitman Rahmat Fairouza; Gabe, an inexperienced technology 'expert', and Ashley, Blake's elderly and sickly mentor. As Ashley is interviewed by the documentary crew, he has a heart attack.\nBlake then hires other hitmen: Izzat, a former Islamist extremist with an extremely strong robotic arm; Yong, who only uses poisons; the psychotic twins, Mia and Barold Bellakalakova; and Max, Blake's former partner. The group gathers in a warehouse, where Max states that he knows Gunther's location. Before he can reveal this information, Gunther kills him with a sniper rifle, and disappears.\nBlake's real motivation to kill Gunther is that his ex, Lisa, slept with Gunther prior to breaking up with him. Ashley has another heart attack seconds after leaving hospital, forcing him to return. The team then sets up a fake hit in order to draw Gunther out, pursuing him after he kills the target. Gunther chokes Izzat with his own robotic hand, and Sanaa manages to wound Gunther before he escapes.\nWorking on a tip from Yong, the team go to the office of a local underground doctor, believing Gunther is being treated there. Donnie plants a bomb in Gunther's car, which fails to detonate. Yong discovers that the trunk is full of poisonous snakes, and is killed when one leaps out and bites him in the neck. Another car picks Gunther up; however Sanaa shoots the driver, causing it to crash. After ensuring that both occupants are dead, the team go out to celebrate, and Sanaa and Donnie spend the night together.\nBlake is awakened in the middle of the night by Rahmat threatening to kill Donnie for sleeping with his daughter, claiming that Blake texted him. Blake, realizing it must have been Gunther, finds the Bellakalakova twins dead in bed. Donnie leaves the group to hide from Rahmat and Sanaa follows them. Blake, along with only the documentary crew and Gabe, lay low at Gabe's cramped apartment. Donnie contacts Blake, saying he wants to quit the assassination business to be with Sanaa.\nBlake goes to Lisa's house and delivers all the letters he had written while they were apart, revealing he was afraid that someone would hurt her to get to him. He then goes to once again pick up Ashley from the hospital, who suddenly dies of a heart attack. At Ashley's funeral, a bomb explodes in his grave, killing Gabe.\nLisa finds Blake and gives him Gunther's home address. After infiltrating his house, Blake soon finds himself in a shootout with Gunther, only to be assisted by Sanaa and Donnie. They chase Gunther into a room where he reveals himself to them with his own camera crew. Gunther has been making his own documentary about the team and their efforts to kill him.\nGunther gives them a chance to leave, which Donnie and Sanaa take. Gunther then reveals the kidnapped Lisa, and says that if Blake kills him, his armed camera crew will kill Lisa. Lisa escapes, and Blake kills Gunther's camera crew. The pair fight, however the police arrive and Gunther escapes and disappears.\nOne year later, Donnie and Sanaa are happily married and have a daughter, Donnie having earned Rahmat's respect by converting to Islam. Lisa has remarried and Blake has disappeared. Gunther has retired and is back living in his native Austria. In the middle of an interview he is suddenly shot by Blake, who celebrates at finally having killed Gunther. However, he finds Gunther is wearing a bomb vest with a dead man's switch. It explodes, killing Blake and the camera crew.\nLater as the Austrian authorities give a press conference, one of the reporters is revealed to be Gunther in disguise.", "cast": "Arnold Schwarzenegger as Robert \"Gunther\" Bendik\nTaran Killam as Blake\nBobby Moynihan as Donnie\nHannah Simone as Sanaa\nPeter Kelamis as Rahmat\nAaron Yoo as Yong\nPaul Brittain as Gabe\nAmir Talai as Izzat\nSteve Bacic as Max\nRyan Gaul as Barold\nAllison Tolman as Mia\nCobie Smulders as Lisa\nAubrey Sixto as Ashley"}