{"_movieID": "12537", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:31:04", "summary": "The French Lieutenant's Woman is a 1969 postmodern historical fiction novel by John Fowles. It was his third published novel, after The Collector (1963) and The Magus (1965). The novel explores the fraught relationship of gentleman and amateur naturalist Charles Smithson and Sarah Woodruff, the former governess and independent woman with whom he falls in love. The novel builds on Fowles' authority in Victorian literature, both following and critiquing many of the conventions of period novels.Following publication, the library magazine American Libraries, described the novel as one of the \"Notable Books of 1969\". Subsequent to its initial popularity, publishers produced numerous editions and translated the novel into many languages; soon after the initial publication, the novel was also treated extensively by scholars. The novel remains popular, figuring in both public and academic conversations. In 2005, Time magazine chose the novel as one of the 100 best English-language novels published between 1923 and 2005.Part of the novel's reputation is based on its expression of postmodern literary concerns through thematic focus on metafiction, historiography, metahistory, Marxist criticism and feminism. Stylistically and thematically, Linda Hutcheon describes the novel as an exemplar of a particular postmodern genre: \"historiographic metafiction.\" Because of the contrast between the independent Sarah Woodruff and the more stereotypical male characters, the novel often receives attention for its treatment of gender issues. However, despite claims by Fowles that it is a feminist novel, critics have debated whether it offers a sufficiently transformative perspective on women.\nFollowing popular success, the novel created a larger legacy: the novel has had numerous responses by academics and other writers, such as A. S. Byatt, and through adaptation as film and dramatic play. In 1981, the novel was adapted as a film of the same name with script by the playwright Harold Pinter, directed by Karel Reisz and starring Meryl Streep and Jeremy Irons. The film received considerable critical acclaim and awards, including several BAFTAs and Golden Globes. The novel was also adapted and produced as a British play in 2006."}