{"_movieID": "228326", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:55:36", "summary": "The Book of Life is a 2014 American  3D computer-animated musical fantasy adventure comedy film co-produced by Reel FX Creative Studios and 20th Century Fox, and distributed by 20th Century Fox. Co-written and directed by Jorge R. Gutierrez, it was produced by Aaron Berger, Brad Booker, Guillermo del Toro, and Carina Schulze. The film stars the voices of Diego Luna, Zoe Saldana, Channing Tatum, Christina Applegate, Ice Cube, Ron Perlman, and Kate del Castillo. Based on an original idea by Gutierrez, the story follows a bullfighter who, on the Day of the Dead, embarks on an afterlife adventure to fulfill the expectations of his family and friends.\nThe film premiered in Los Angeles on October 12, 2014, and was released theatrically in the United States on October 17, 2014. It received a Golden Globe nomination for Best Animated Feature Film. The film grossed $99 million on a $50 million budget.", "plot": "Mary Beth, a museum tour guide, takes a group of school detention students on a secret museum tour, telling them, with wooden figures, the story of a Mexican town called San Angel from the Book of Life, holding every story in the world.\nOn the Day of the Dead, La Muerte, ruler of the Land of the Remembered, and Xibalba, ruler of the Land of the Forgotten, see Manolo Sánchez and Joaquín Mondragon competing over María Posada. They strike a wager: if María marries Manolo, Xibalba will no longer interfere in mortal affairs, but if she marries Joaquín, La Muerte and Xibalba will swap realms. However, Xibalba cheats by giving Joaquín his Medal of Everlasting Life, which grants the wearer invincibility.\nYears later, Joaquín has become a hero with the Medal's aid, but Manolo's musical aspirations are suppressed by his father Carlos, who trains him to be a bullfighter in their family tradition. At Manolo's first bullfight he defeats the bull but refuses to kill it, dismaying Carlos and the crowd but impressing María. That night, María is pressured by her father and mayor, General Ramiro Posada, to marry Joaquín for his protection from the Bandit King Chakal. María and Manolo both profess their love before dawn but are interrupted when Xibalba sends his dual-headed snake staff, who bites her and sends her into a coma. Devastated by María's apparent death, Manolo allows Xibalba to kill him, believing he will be reunited with María in death.\nIn the Land of the Remembered, Manolo reunites with his mother and his ancestral family. They travel to La Muerte's castle, discovering Xibalba, now the ruler of the realm, who explains the bet and smugly reveals that María didn’t die because she was only bitten once and therefore survived. However, Manolo was bitten twice and died. Furious but determined to return to María, Manolo travels to the Cave of Souls to reach La Muerte. Inside, he meets the Candle Maker, the overseer of mortal lives and the Book of Life's keeper. The Candle Maker sees that Manolo's story in the Book of Life is blank and can be rewritten by himself, so he takes them to the Land of the Forgotten. They find La Muerte at Xibalba's castle and expose his cheating. Furious, La Muerte lectures Xibalba before offering a new wager at Manolo's request: Manolo's life will be returned if he completes a challenge of Xibalba's choosing, but if he fails, he will be forgotten and Xibalba will keep both realms. Xibalba sets Manolo against a giant bull skeleton made from the skeletons of every bull slain by the Sanchez family, believing that to be his greatest fear.\nMeanwhile, María has been awakened from her coma, learns of Manolo's death, and accepts Joaquín's proposal. Their wedding is interrupted by Chakal, who leads his army to San Angel to find the Medal, which was previously his. Chakal kills Carlos, who arrives in the Land of the Remembered in time to see Manolo's fight. Manolo, realizing his fear is actually of being himself, refuses to fight and instead sings an apology to the bull, appeasing it and touching everyone present. Impressed, the deities resurrect Manolo and send him and his family to San Angel to protect it. Manolo is knocked unconscious when Chakal destructs himself, but he is protected by the Medal, which Joaquín had slipped him earlier. Joaquín returns it to Xibalba and resolves to be a true hero, while Manolo and María are happily married as Xibalba and La Muerte reconcile.\nIn the present, Mary Beth finishes the story, and the amazed children leave the museum. Mary Beth and a security guard reveal themselves to be La Muerte and Xibalba in disguise. The Candle Maker appears and encourages the audience to write their own story."}