{"_movieID": "49524", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:28:00", "summary": "R.I.P.D.  or Rest in Peace Department is a 2013 American science fiction action comedy film starring Jeff Bridges and Ryan Reynolds. Robert Schwentke directed the film based on a screenplay adapted from the comic book R.I.P.D by Peter M. Lenkov. The film also stars Kevin Bacon, Mary-Louise Parker, Stéphanie Szostak, and Marisa Miller.\nFilming was completed on January 28, 2012, and the film was originally set to be released on June 28, 2013 in the United States by Universal Pictures, but was pushed back to July 19, 2013.\nThe film was both a critical and commercial failure, grossing $78 million on a $130 million budget.", "plot": "Boston Police Department officers Detective Sergeant Nick Walker and Detective Lieutenant Bobby Hayes discover and steal several shards of gold while on duty. Nick buries his share under an orange tree sapling in his garden; his wife, Julia, thinks that the tree is a surprise gift and mentions how content she is with their life together. Nick realizes that they do not need the gold, and decides to submit it as evidence. During a raid later on, Hayes tells Nick that he can't let him turn in the gold, Hayes then shoots and kills Nick.  Time stops around Nick and he is drawn into a vortex in the sky.\nIn the afterlife, Nick finds that he faces eternal damnation for his thievery. As penance, Nick is recruited for the R.I.P.D. (The Rest In Peace Department). The R.I.P.D. is responsible for finding and returning souls who refuse to move on to the afterlife.  Left unchecked, these souls become \"deados\", monsters disguised as humans, and when their souls begin to rot, the environment rots around them. He is partnered with Roycephus \"Roy\" Pulsipher, a former U.S. Marshal and participant in the American Civil War.  Their first stop is at a cemetery to watch Nick's funeral, and Nick attempts to make his presence known to Julia but is not recognized.  Roy explains that R.I.P.D. officers are given new identities and appearances to prevent them from revealing that the afterlife exists.  Nick appears as an old Chinese man while Roy appears as a beautiful blonde woman.\nOn his first field mission, Nick aids Roy in interrogating a suspected deado and discovers the perpetrator is in possession of gold like he and Hayes had stolen.  Nick and Roy submit the gold as evidence before visiting one of Roy's informants.  Nick tricks the informant into revealing Hayes as his contact. They follow Hayes to Nick's old house, where he \"discovers\" Nick's stolen gold. Roy and Nick track Hayes and observe him handing the gold off to a deado whom they stop and interrogate.  The deado overpowers them, taking the gold and transforming into a hulking monster that leads them on a chase through the city that attracts the attention of normal humans and causes a panic.  R.I.P.D. Chief Mildred Proctor receives orders to remove Roy and Nick from the case and from active duty due to this exposure. Proctor learns from Eternal Affairs that the gold could be used to construct the Staff of Jericho, which will reverse the flow of souls from Earth to the afterlife.\nRoy and Nick argue, and Nick leaves by himself to try again to reveal himself to Julia.  Roy tails him and they argue but finally make amends and decide to work together to stop whatever Hayes is planning. They discover that Hayes is a deado and arrest him, but a confiscated item of his freezes the whole department.  Hayes and a group of deados escape with the remainder of the gold and assemble the Staff of Jericho (an Obelisk of gold).  Hayes takes Julia hostage and stabs her as a necessary human sacrifice to activate the staff. A battle ensues; Pulsipher destroys the Staff of Jericho, and Nick exacts his revenge on Hayes. Close to death, Julia sees Nick for who he is; and they share a tearful farewell.\nLater, Proctor informs Nick that Julia will live. She reinstates them both fully, though she adds 53 years to Roy's term in the R.I.P.D. due to her revealed affections for him. As a reward, Roy gives Nick a new appearance, but he is dismayed to find it is that of a Girl Scout.", "cast": "Jeff Bridges as Roycephus \"Roy\" Pulsipher, a United States Marshal and former American Civil War Yankee soldier from the Wild West and veteran officer of the R.I.P.D.\nRyan Reynolds as Nick Walker, a detective sergeant of the Boston Police Department who is murdered and becomes Roy Pulsipher's partner.\nKevin Bacon as Bobby Hayes, a detective lieutenant of the Boston Police Department who is in league with the deados.\nMary-Louise Parker as Mildred Proctor: Head of the Boston Police Department R.I.P.D.\nStéphanie Szostak as Julia Walker, Nick's wife/widow.\nMarisa Miller as Opal Pavlenko, Roy's avatar.\nJames Hong as Grandpa Jerry Chen, Nick's avatar #1.\nDevin Ratray as Pulaski, a Deado\nRobert Knepper as Stanley Nawicki, a Deado.\nMike O'Malley as Elliot, Fenway Park's scoreboard operator.\nLarry Joe Campbell as Officer Murphy\nPiper Mackenzie Harris as Girl Scout, Nick's avatar #2.\nToby Huss, Mike Judge, and Jon Olson as Various Deado VoicesZach Galifianakis was originally cast as Roy Pulsipher, but dropped out due to scheduling conflicts. Jodie Foster was originally considered for the role of Proctor, but in the end, Mary-Louise Parker was cast."}