{"_movieID": "293767", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:10", "summary": "Billy Lynn's Long Halftime Walk is a 2016 war drama film directed by Ang Lee and written by Jean-Christophe Castelli, based on the 2012 eponymous novel by Ben Fountain. The film stars Joe Alwyn, Kristen Stewart, Garrett Hedlund, Vin Diesel, Steve Martin, and Chris Tucker. Principal photography began in early April 2015 in Georgia. The film is a co-production between the United States, United Kingdom, and China.The film had its world premiere at the 54th New York Film Festival on October 14, 2016, and was theatrically released in the United States on November 11, 2016, by TriStar Pictures. It had high production costs associated with being the first ever feature film using an extra-high frame rate of 120 frames per second, further complicated by the 3D format, at 4K HD resolution. It received mixed reviews from critics and was a box-office bomb, grossing just $30 million worldwide against its $40 million budget.", "plot": "Billy Lynn, a 19-year-old US Army specialist from Texas, is caught on camera dragging wounded Sergeant Virgil \"Shroom\" Breem to safety during an intense firefight in Iraq on October 23, 2004. This act of courage earns Lynn the Silver Star and quickly ascends him and his unit, erroneously designated \"Bravo Squad\" by the media, to celebrity status. They return to the U.S. for Shroom's funeral, then are sent on a publicity tour culminating at the halftime show of the November 25 Dallas Cowboys Thanksgiving home game.\nNow led by Sgt. David Dime, the members of Bravo Squad are driven in a limousine to the stadium with the Cowboys' PR representative Josh and film producer Albert Brown, who is in the process of securing a film deal for the squad. A flashback reveals that Billy joined the army after destroying the car of his older sister Kathryn's boyfriend, who left her after she was in a car accident that required multiple facial reconstruction procedures. At the stadium, the group is greeted by anxious fans who express gratitude for their actions and blindly support the Iraq War. During a press conference, Billy spots a Cowboys Cheerleader, Faison, smiling at him. They strike up a conversation and begin a flirtation. Billy tells her how it feels weird to be honored for the worst day of his life.\nAs the game starts, Billy recalls his time in Iraq, where Shroom had offered him karmic philosophical insight and advice during their downtime. It is revealed that once the game ends, Bravo Squad will have to return to duty. Billy receives a phone call from a psychiatrist to whom Kathryn had spoken, regarding a plan to get Billy honorably discharged so he doesn't have to return to Iraq, thereby sparing him further suffering.\nDuring the halftime show, featuring Destiny's Child, the loud music and pyrotechnics traumatize an already unstable squad member, Crack, and he reacts violently against a security guard. Billy experiences a flashback to the battle that made them famous. The squad was called in to rescue soldiers pinned down by insurgents at a school. Shroom is shot while advancing from cover, and Billy rushes to save him, firing on the nearby insurgents with his sidearm. Billy drags Shroom into a trench, but an insurgent attacks Billy at close range. Billy kills him in self-defense, and is traumatized. Then, upon returning to help, Shroom has bled to death. Billy's flashback ends when troop members get his attention and point out that the halftime show has been over for a few minutes. Billy had been frozen in place all the while. As they are urged to leave by stage hands and security, the soldiers are diverted from a fight by cheerleaders led by Faison. Billy takes her name and number on his cell phone, learning that her last name is Zorn, meaning 'anger'.\nBilly and Dime meet with the owner of the Cowboys, Norm Oglesby, who is considering investing in Albert's movie about the incident in Iraq. However, instead of the $100,000 that Albert was hoping to get for each squad member, Oglesby offers them only $5,500 apiece. Dime angrily rebuffs Oglesby's offer. In private, Oglesby tells Billy that the squad's story is no longer theirs, but instead belongs to the U.S. people. Billy tells Oglesby off, joining Dime. Albert promises Billy that he will find investors one way or another, and that their story deserves to be told \"the right way.\"\nAs the squad leaves, they are attacked by the security guards from earlier, briefly triggering Billy's PTSD, which fills his mind with surreal imagery of war and death. The altercation is halted with a warning gunshot, and Billy meets up with Faison briefly before leaving. He says he would run away with her, even though he has to go back. In a clumsy deflection, she reinforces his duty to redeploy, and he accepts with understanding. They share a kiss. Kathryn arrives to retrieve Billy and effect his medical discharge.  He makes it clear he is redeploying with his squad, more for his sense of belonging than for duty. She is upset, but after Billy explains, they share a tearful hug.\nBilly returns to the limo, but hallucinates and sees a Humvee. He gets in, sees Shroom's familiar icon of Ganesha and has a philosophical conversation with Shroom. Billy tells Shroom \"I love you,\" then returns to the reality of the Bravo Squad members in the limo, each of whom responds with \"I love you.\"", "cast": "Joe Alwyn as Billy Lynn\nKristen Stewart as Kathryn\nChris Tucker as Albert\nGarrett Hedlund as Dime, Bravo Squad's Staff Sgt.\nMakenzie Leigh as Faison Zorn, Dallas cheerleader\nVin Diesel as Shroom, Bravo Squad\nSteve Martin as Norm Oglesby\nBrian \"Astro\" Bradley as Lodis, Bravo Squad\nArturo Castro as Mango, Bravo Squad\nIsmael Cruz Córdova as Holliday, Bravo Squad\nBarney Harris as Sykes, Bravo Squad\nBeau Knapp as Robert \"Crack\" Earl Koch, Bravo Squad\nMason Lee as Foo, Bravo Squad\nBen Platt as Josh, Dallas team rep working with Bravo Squad during the football game.\nTim Blake Nelson as Wayne\nMatthew Barnes as Travis\nDeirdre Lovejoy as Billy's Mother\nBruce McKinnon as Billy's Father\nLaura Wheale as Billy's Sister"}