{"_movieID": "270946", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:10:25", "summary": "Penguins of Madagascar is a 2014 American computer-animated spy action comedy film produced by DreamWorks Animation and distributed by 20th Century Fox. It is a spin-off of the Madagascar film series, and takes place right after the events of Madagascar 3: Europe's Most Wanted, following the penguins Skipper, Kowalski, Rico and Private in their own adventure. Apart from the main characters, it is unrelated to the TV series The Penguins of Madagascar.The film was directed by Simon J. Smith and Eric Darnell, and written by Michael Colton, John Aboud, and Brandon Sawyer. It stars the voices of Tom McGrath, Chris Miller, Conrad Vernon, Christopher Knights, Benedict Cumberbatch, John Malkovich, and Ken Jeong. The film was released on November 26, 2014. It is the first and only film in the Madagascar franchise that was distributed by 20th Century Fox and was the final DreamWorks Animation film produced by Pacific Data Images before its closure on January 22, 2015. With a gross of $373 million on a $132 million budget, the film underperformed at the box office and forced a write-down for the studio.", "plot": "In Antarctica, three young penguin brothers — Skipper, Kowalski, and Rico — defy the laws of nature in order to save an egg the other penguins believe to be doomed. After saving it from a pack of leopard seals and accidentally setting themselves adrift on an iceberg, the egg hatches into their new member, Private, (before the events of the first film).\nTen years later (after the events of the previous film), the penguins decide to leave the circus to celebrate Private's birthday by breaking into the Fort Knox in order to treat him to a discontinued snack called \"Cheezy Dibbles\" in the vending machine of their break room. Despite this, Private begins to feel out of place with the team, as he is constantly described as being the \"secretary/mascot\". Suddenly, they are abducted by the machine and sent to Venice, Italy by Dr. Octavius Brine, a renowned geneticist who removes his human disguise and reveals he is actually an octopus named Dave, who has grown resentful of penguins after their cuteness had him shunned from every zoo and aquarium across the globe.\nRico swallows Dave's collection of snowglobes along with a canister of a green substance called the Medusa Serum before the four escape and are chased through the canals and streets of Venice by Dave's henchmen. When cornered, they are rescued by a group of animals from an Arctic elite undercover inter-species task force agency called \"The North Wind\" consisting of their leader, a wolf whose name is classified in which Skipper mistakenly calls him \"Classified\" throughout this film, a harp seal demolitionist named Short Fuse, a polar bear named Corporal, and an intelligent snowy owl named Eva, who Kowalski instantly falls in love with. Their mission is to help animals who can't help themselves and have been fighting Dave to protect the penguin population.\nAt their hideout, their communication systems are hacked by Dave, who reveals that he has an enormous supply of the Medusa Serum and that he intends to capture the penguins out of every zoo he was kicked out of. Viewing the penguins as a hindrance to their mission, Classified tranquilizes the group and sends the group to their most remote base (which happens to be on Madagascar) but the penguins awaken mid-flight and crash land in the Sahara Desert before making their way to Shanghai, China, which they mistake for Dublin, Ireland. Discovering Dave's next target in Shanghai using Dave's snowglobe collection, the penguins ship themselves to the same current location and make their way to the zoo. Skipper disguises Private as a mermaid-tailed penguin (a tourist attraction) to distract Dave from his real target, but Private is captured along with the Shanghai penguins after the North Wind arrives to put a stop to Dave's plan. The penguins take the North Wind's high-tech plane to give chase, but inadvertently self-destruct the machine. They manage to track Private to an island base, using a tracking device planted on him when Classified darted them before planting them in a flight to Madagascar. \nMeanwhile, on the island, Dave demonstrates his way to use the medusa serum (most likely gotten from the islands plants) to genetically mutate the penguins into hideous monsters as an effort to make humans disgusted by them as revenge.\nSkipper and Classified argue on the best means to rescue the captives and stop Dave, finally settling on Classified's plan of a frontal assault and Skipper agrees to act as a diversion. The North Wind manages to corner Dave in his lair only to be captured by Dave's henchmen as well as the other penguins. Dave demonstrates his mutation ray at full power on Private, apparently disintegrating him with the beam, but unbeknownst to them he escapes at the last minute by using a paper clip he swallowed earlier. Private rescues the North Wind members, who want to regroup due to lack of equipment, but Private, not wanting to leave anyone behind goes to stop Dave. As Dave's submarine docks at New York with the promise of returning the penguins he found to the zoo, he turns the ray on the rest of the penguins, mutating them all into hideous monsters. The city erupts into chaos as the brainwashed, mutated penguins run amok on the terrified human crowd. Getting Skipper, Kowalski and Rico back to their senses, Private decides to connect himself into the ray to return them to normal. After fending off Dave and his henchman, they manage to turn all the penguins back to normal in one huge blast.\nPrivate is left partially mutated from the machine while the rest of the penguins are restored to normal. Despite his strange new look, the Penguins show their gratitude and new-found respect for Private. Dave (who was caught in the blast) has been turned into a pipsqueak version of himself and is trapped in a snow globe where he is admired by a little girl. Finally seeing one another as equals, Classified promises to grant the Penguins anything they want. In addition to Kowalski getting a kiss from Eva, the Penguins are given their own jet packs and they then fly off above the clouds looking for their new adventures.\nIn a mid-credits scene, the Penguins return to the circus and plug Mort into the ray and use him to revert Private back to normal. Mort does not appear to show any side effects from the ray until he manages to swallow King Julien whole.", "cast": "Tom McGrath as Skipper, the leader of the penguins.\nChris Miller as Kowalski, the brains of the penguins.\nChristopher Knights as Private, the rookie of the penguins.\nConrad Vernon as Rico, the loose cannon of the penguins.\nBenedict Cumberbatch as Classified, a British wolf and team leader of the North Wind.\nKen Jeong as Short Fuse, a Belgian explosive and demolitions expert harp seal and a member of the North Wind.\nAnnet Mahendru as Eva, a Russian snowy owl and the North Wind's intelligence analyst.\nPeter Stormare as Corporal, a Norwegian polar bear and a member of the North Wind who serves as the muscle.\nJohn Malkovich as Dave, a villainous and disgruntled octopus who has the human disguise of Dr. Octavius Brine.\nWerner Herzog as a documentary filmmaker.\nDanny Jacobs as King Julien XIII, a ring-tailed lemur.\nAndy Richter as Mort, a Goodman's mouse lemur."}