{"_movieID": "269149", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:42:56", "summary": "Zootopia (known as Zootropolis in some regions) is a 2016 American 3D computer-animated comedy film produced by Walt Disney Animation Studios and released by Walt Disney Pictures. It is the 55th Disney animated feature film, directed by Byron Howard and Rich Moore, co-directed by Jared Bush, and stars the voices of Ginnifer Goodwin, Jason Bateman, Idris Elba, Jenny Slate, Nate Torrence, Bonnie Hunt, Don Lake, Tommy Chong, J. K. Simmons, Octavia Spencer, Alan Tudyk, and Shakira. It details the unlikely partnership between a rabbit police officer and a red fox con artist, as they uncover a criminal conspiracy involving the disappearance of predators.\nZootopia premiered at the Brussels Animation Film Festival in Belgium on February 13, 2016, and went into general theatrical release in conventional 2D, Disney Digital 3-D, RealD 3D, and IMAX 3D formats in the United States on March 4. Critics praised its screenplay, animation, voice acting, and subject matter. It opened to record-breaking box offices in several countries, and earned a worldwide gross of over $1 billion, making it the fourth-highest-grossing film of 2016, the 34th-highest-grossing film of all time, the fourth animated film to pass $1 billion in global box-office earnings, and Walt Disney Animation Studios' highest-grossing film since 2013's Frozen. The film earned numerous accolades; it was named one of the top ten best films of 2016 by the American Film Institute, and received an Academy Award, Golden Globe, Critics' Choice Movie Award, and Annie Award for Best Animated Feature Film, it also received a nomination for the BAFTA Award for Best Animated Film, but lost to Kubo and the Two Strings.", "plot": "In a world populated by anthropomorphic mammals, rabbit Judy Hopps from rural Bunnyburrow fulfills her childhood dream of becoming a police officer in urban Zootopia. Despite Judy being the academy valedictorian, Chief Bogo doubts her potential and delegates her to parking duty. On her first day, she is hustled by a con artist fox duo, Nick Wilde and Finnick.\nJudy abandons parking duty to arrest Duke Weaselton, a weasel who stole a bag of crocus bulbs known as Midnicampum holicithias. As she is reprimanded by Bogo, an otter named Mrs. Otterton enters Bogo's office pleading for someone to find her husband Emmitt, one of fourteen predators who have gone missing. Bogo is forced to let a volunteering Judy take the case when Assistant Mayor Dawn Bellwether praises the assignment. He gives Judy 48 hours to find Emmitt on the condition that she must resign if she fails.\nDeducing that Nick was the last to see Emmitt, Judy blackmails him into assisting her by covertly recording his confession to tax evasion. They track Otterton to a limousine owned by crime boss Mr. Big, who reveals Otterton went \"savage\"—reverted to a feral state—and attacked his chauffeur Manchas. At his home, Manchas mentions Otterton yelled about \"night howlers\" before the attack. Manchas himself then turns savage and chases the pair. Judy saves Nick by trapping Manchas and calls the ZPD for help, but Manchas flees before they arrive. Bogo demands Judy's resignation, but Nick defends Judy and tells his story about the junior ranger scouts, in which he has been tormented by them, due to his species.\nJudy and Nick then travel to the City Hall to access to the city's traffic cameras. They discover Manchas was captured by wolves, who Judy surmises are the \"night howlers\". They locate the missing predators—who have all turned savage—imprisoned at Cliffside Asylum, where Mayor Leodore Lionheart is secretly imprisoning them while attempting to determine the cause of their behavior. Judy records video of Lionheart discussing the plot with her cell phone and reports him to the ZPD; Lionheart and the asylum staff are arrested for false imprisonment, and Bellwether becomes the new mayor.\nJudy, praised for solving the case, asks Nick to join the ZPD as her partner. At her following press conference, however, Judy suggests that the cause of the savage behavior is predator biology; in anger, Nick rejects Judy's offer and abandons her. Hateful speech and discrimination against predators runs rampant throughout Zootopia. Wracked with guilt for the consequences of her words, Judy resigns from the ZPD and returns to Bunnyburrow.\nBack home, Judy learns that the night howlers are actually the crocus bulbs Weaselton stole, and they contain a neurotoxin that has severe psychotropic effects on mammals which cause them to turn savage via absorption through the skin. After returning to Zootopia and tearfully reconciling with Nick, the pair confront Weaselton, who is pressured by Mr. Big and reveals that the bulbs he stole were meant for a ram named Doug. They find Doug in a laboratory hidden in the city subway developing a drug made from night howlers, which he has been shooting at predators with a dart gun.\nJudy and Nick obtain the serum as evidence, but before they can reach the ZPD, Bellwether confronts them in the Natural History Museum, revealing herself as the mastermind behind a prey-supremacist conspiracy to frame predators as dangerous and savage. Bellwether retrieves the evidence after Nick refuses to abandon an injured Judy. She shoots Nick with a serum pellet to make him attack Judy, but the pellets she is using are revealed to have been replaced with blueberries by Nick. Judy then baits Bellwether into openly declaring her role in the attacks and records the confession just as Bogo and his deputies arrive at the scene.\nBellwether is arrested for her treachery, while Lionheart publicly denies knowledge of her plot and defends his imprisonment of the savage predators as a necessary precaution to maintain public safety. The savage animals are cured and Judy rejoins the ZPD. Nick graduates from the Zootopia Police Academy as the city's first fox police officer and becomes Judy's partner."}