{"_movieID": "324849", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:55:21", "summary": "The Lego Batman Movie is a 2017 3D computer-animated superhero comedy film produced by the Warner Animation Group and distributed by Warner Bros. Pictures. It was directed by Chris McKay, and written by Seth Grahame-Smith, Chris McKenna, Erik Sommers, Jared Stern and John Whittington, and produced by Dan Lin, Roy Lee, Phil Lord and Christopher Miller. Based on the Lego Batman toy line, the film is an international co-production of the United States, Australia and Denmark, the first spin-off installment of The Lego Movie film series and the second installment overall. The story centers on the DC Comics character Batman as he attempts to overcome his greatest fear in order to stop the Joker's latest plan. The film features Will Arnett reprising his role as Batman from The Lego Movie alongside Zach Galifianakis, Michael Cera, Rosario Dawson and Ralph Fiennes.\nThe Lego Batman Movie had its world premiere in Dublin, Ireland on January 29, 2017, and was released in the United States on February 10, 2017. The film was released in 3D, RealD 3D, Dolby Cinema, IMAX and IMAX 3D. The film received generally positive reviews from critics for its animation, voice acting, soundtrack, visual style and humor; it was also commercially successful, having grossed $312 million worldwide against a budget of $80 million. A sequel is in development.", "plot": "Within the DC superhero dimension in the Lego Universe, Batman continues to protect Gotham City and fight crime. During his latest mission to stop the Joker from destroying the city, he hurts his feelings by telling him he is not as important in his life as he thinks he is, leading Joker to seek the ultimate revenge on him. The following day, Batman's alter-ego Bruce Wayne attends the city's winter gala which is celebrating both the retirement of Commissioner Gordon and the ascension of his daughter Barbara as the city's new police commissioner, only to be infuriated by Barbara's plans to restructure the police to function without the need of Batman. Joker crashes the party with the city's other villains, all of whom surrender except Harley Quinn, who disappears during the confusion.\nSuspecting his archenemy is up to something, Batman plots to steal Superman's Phantom Zone Projector (a device that can banish anyone to the Phantom Zone which houses some of the most dangerous villains in the Lego multiverse), only for Alfred to intervene and advise him to take care of Dick Grayson, whom Bruce unwittingly adopted as his ward during the gala earlier. Reluctantly agreeing to do so, Batman fosters Dick as Robin, whereupon the pair successfully recover the Projector from the Fortress of Solitude and break into Arkham Asylum to send Joker to the Phantom Zone. Suspecting that the Joker wanted to be sent there, Barbara locks up Batman and Robin.\nWhile the Projector is being seized as evidence, Harley steals it back as part of Joker's plan and frees him, allowing him to return to Gotham with all the villains he had recruited in the Phantom Zone, including King Kong, the Gremlins, the Wicked Witch of the West and her Flying Monkeys, a Tyrannosaurus rex and a Velociraptor (presumably from Jurassic Park), Lord Voldemort, Sauron, the Jaws great white shark, the Daleks, Lord Vampyre, The Evil Mummy, Swamp Creature, Medusa, Agent Smith and his clones, Skeleton Warriors, General Zod and the Kraken. Realizing that the city does need him, Barbara releases Batman and Robin and teams up with them and Alfred to stop the Joker. Although Batman finds himself able to trust and rely on his new team upon reaching Wayne Island, he chooses to send them away rather than losing them like his parents. Upon facing him alone, Joker believes that Batman is incapable of change and zaps him to the Phantom Zone before stealing the Batcave's stash of confiscated bombs. Arriving in the Phantom Zone, Batman witnesses the harm his selfishness has caused to everyone and slowly accepts his greatest fear. Making a deal with the Zone's gatekeeper Phyllis, a talking Lego brick, to be allowed back to Gotham in order to retrieve the Zone's escaped prisoners, Batman arrives in time to save his teammates, apologizing to them for leaving them and requesting their help to stop Joker.\nRealizing Joker's plans to use the explosives he took to destroy the city's Energy Facility that causes the city to come apart and be destroyed, Batman turns Barbara into Batgirl, before he, his team and Gotham City's other villains, who felt neglected by Joker, manage to successfully send the escaped villains back to the Phantom Zone. However, the group fail to stop Joker's bombs going off as the explosion begins to tear the city apart at the plates beneath it. Knowing this was his fault, Batman reluctantly convinces Joker that he is the true reason for being the hero he is before they, their friends and allies and the city's inhabitants, chain-link themselves together and pull the plates back together, saving the city.\nWith the city saved, Batman prepares to be taken back into the Phantom Zone to fulfill his bargain, only to be rejected by Phyllis, who chooses to let him remain after realizing he is a hero and seeing how much he had changed in order to save everyone. Afterwards, Batman allows Joker and the rest of his rogues to temporarily escape with the confidence that whenever they return, they will be no match for the Batman family.\nThe movie ends with Batman spending a new life with his family."}