{"_movieID": "480530", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:41:15", "summary": "Creed II is a 2018 American sports drama film directed by Steven Caple Jr., and written by Sylvester Stallone and Juel Taylor, from a story by Sascha Penn and Cheo Hodari Coker. A sequel to Creed (2015) and the eighth installment in the Rocky film series, it stars Michael B. Jordan, Stallone, Tessa Thompson, Dolph Lundgren, Florian Munteanu, Wood Harris, and Phylicia Rashad. Creed writer-director Ryan Coogler serves as an executive producer on the film. The film follows a fight over 33 years in the making, as Adonis Creed meets a new adversary in the ring: Viktor Drago, son of Ivan Drago, the powerful athlete who killed Adonis' father Apollo Creed.\nA Creed sequel was confirmed in January 2016, although due to both Coogler and Jordan's involvement in Black Panther, the film was delayed, with Coogler ultimately being replaced by Caple. Stallone completed the script in July 2017 and announced Lundgren would be reprising his role as Drago, and filming began in Philadelphia in March 2018, lasting through June.\nCreed II was released in the United States by Metro-Goldwyn-Mayer and Warner Bros. on November 21, 2018. The film grossed $214 million worldwide and received generally positive reviews from critics, who praised the performances, character development, and Caple's direction, while noting its predictability.", "plot": "In 2018, three years after his loss to \"Pretty\" Ricky Conlan, Adonis Creed peels off 6 straight wins, culminating in a victory over Danny \"Stuntman\" Wheeler to win the WBC World Heavyweight Championship. Now a worldwide star, Adonis proposes to his girlfriend, Bianca Taylor, who agrees to marry him. When Bianca suggests starting a new life together in Los Angeles, Adonis is reluctant to leave Philadelphia as it would mean leaving Rocky.\nIvan Drago, the former Soviet boxer who killed Adonis' father, Apollo Creed, in the ring thirty-three years earlier, sees an opportunity to regain lost glory after his 1985 loss to Rocky Balboa: assisted by promoter Buddy Marcelle, Ivan pits his son, Viktor Drago, against Adonis. When Rocky refuses to support Adonis' decision to accept Viktor's challenge, Adonis leaves for Los Angeles.\nAdonis and Bianca settle down in a luxurious apartment in Los Angeles close to Adonis' adoptive mother and Apollo's widow, Mary Anne. As they adjust to their new life and prepare for the upcoming match with Viktor, Bianca learns that she is pregnant. Adonis recruits Tony \"Little Duke\" Evers, son of his father's trainer and later Rocky's trainer, but overwhelmed with his life’s recent developments, he rushes into the match and is badly injured.  Viktor is disqualified for hitting Adonis while he is down, allowing Adonis to retain the World Heavyweight Championship. Viktor becomes extremely popular in Russia and wins a series of fights with top billing.\nHis body and ego shattered, Adonis becomes increasingly disconnected from Bianca. Mary Anne reaches out to Rocky, who reconciles with Adonis and agrees to train him for a rematch against Viktor, who is suffering torturous physical tests by his father. Bianca gives birth to a daughter, Amara, and Rocky is named her godfather. Adonis and Bianca learn Amara is deaf, inherited from her mother's progressive degenerative hearing disorder.\nWhile Viktor taunts Adonis publicly, he faces constant pressure from his father, who enjoys the attentions of the media and various Russian delegates. At a state dinner, he and Ivan meet Ludmilla, his mother and Ivan's ex-wife, for the first time in several years after she abandoned them after Ivan’s loss to Rocky. Enraged at the sight of his mother, Viktor chastises Ivan for his interactions with the people who made them outcasts. Meanwhile, Rocky and Little Duke retrain Adonis in a decrepit location in the California desert, focusing on fighting from within and training Adonis's body to absorb the heavy impact he will receive from Viktor in the ring.\nIn Moscow, the rematch is considerably more balanced as a more controlled and focused Adonis exchanges equal blows with Viktor. Since Viktor is accustomed to winning by knockout, his fights have never lasted beyond the fourth round, which Adonis uses to his advantage as he endures Viktor's punishment, even after his ribs are broken. In the tenth round, Adonis unleashes sequence after sequence of effective blows and knocks Viktor down twice. Ludmilla departs after the second knockdown, upsetting Viktor, and Ivan comes to terms with Viktor's earlier statements. With Viktor exhausted, cornered and receiving multiple strikes without defending himself, but unwilling to go down, Ivan throws in the towel, conceding the fight to Adonis to protect his son. Ivan assures the distraught Viktor it is okay that he lost, and embraces him. As Bianca enters the ring to celebrate with Adonis and Little Duke, Rocky recuses himself, telling Adonis \"it's your time\", and takes a seat to watch them from outside the ring.\nViktor and Ivan later train together back in Ukraine. Rocky travels to Vancouver to make peace with his own estranged son, Robert, and meets his grandson Logan for the first time, noting how much he looks like Adrian. Adonis visits Apollo's grave where he makes peace with his deceased father and the burden of carrying on his legacy, as he and Bianca introduce his granddaughter, who is sporting a new set of hearing aids.", "cast": "Michael B. Jordan as Adonis Creed: An underdog but talented heavyweight boxer, the son of world heavyweight champion Apollo Creed. He goes by the name Donnie Johnson.\nSylvester Stallone as Rocky Balboa: A two-time world heavyweight champion and Apollo's best friend and former rival who becomes Adonis' avuncular trainer and mentor. He owns and operates an Italian restaurant in Philadelphia named after his deceased wife, Adrian.\nTessa Thompson as Bianca: Adonis's girlfriend, who since becomes his fiancée and the mother of his child. Also a singer-songwriter with progressive hearing loss.\nWood Harris as Tony \"Little Duke\" Evers: One of Wheeler's assistant trainers. His father, Tony \"Duke\" Evers, was a father-figure for Apollo as well as his trainer/manager when Apollo became world heavyweight champion. He then became one of Rocky's trainers after Apollo's death. He trains Adonis for his first match with Viktor after Rocky refuses, and acts as an assistant trainer for the rematch.\nRussell Hornsby as Buddy Marcelle: A boxing promoter who sets up the match between Adonis Creed and Viktor Drago.\nPhylicia Rashad as Mary Anne Creed: Apollo's widow and Adonis' stepmother, who takes in Adonis as a child following the death of Adonis' biological mother.\nDolph Lundgren as Ivan Drago: Russia's former prize champion boxer, who with the secret use of steroids and advanced training, gained worldwide attention due to his brute strength that had not been seen before. Years prior, he killed Apollo Creed during an exhibition boxing match, and was later defeated by Rocky. Having been disgraced in Russia, he relocated to Ukraine to raise his son Viktor, whom he also trained to box.\nFlorian \"Big Nasty\" Munteanu as Viktor Drago: Ivan's son who is also a boxer, and Adonis' new rival.\nAndre Ward as Danny \"Stuntman\" Wheeler: A heavyweight boxer and Adonis' rival whom Adonis beats to become the heavyweight champion.\nBrigitte Nielsen as Ludmilla Drago: Ivan's ex-wife and Viktor's mother who left the pair during the latter's infancy.\nMilo Ventimiglia as Robert Balboa: Rocky's estranged son, who moved to Vancouver in the period between Rocky Balboa and Creed and is now a father himself.Archive footage of Carl Weathers as Apollo Creed is used throughout the film, and the actor's likeness appears through the use of photographs and murals."}