{"_movieID": "388241", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:25:47", "summary": "Out of Time is a 2003 American neo-noir thriller film, directed by Carl Franklin featuring Denzel Washington. Matthias \"Matt\" Lee Whitlock, played by Washington, is the respected Chief of Police of the fictional Florida Keys small town of Banyan Key, Florida.\n\n", "plot": "Matthias \"Matt\" Lee Whitlock is the respected Chief of Police of the fictional Florida Keys small town of Banyan Key, Florida. Recently separated, Whitlock is currently seeing local resident Anne Merai-Harrison, an old flame from high school whose husband Chris, a former professional quarterback seemingly oblivious to the relationship, abuses her. While attending Anne to the doctor, Whitlock finds out she has just been diagnosed with terminal cancer. Whitlock is also going through a divorce from his wife, homicide detective Alex. \nAnne intends to reward Whitlock's loyalty to her by making him the sole beneficiary of her $1,000,000 life insurance policy. Whitlock suggests that she should travel to Switzerland to undergo a newly-developed, groundbreaking treatment. The problem is that Anne does not have any money. Desperate to help her, Matt takes $480,000 out of evidence and gives it to her so she can make the trip. When the $480,000 goes up in flames in a suspicious house fire that kills Anne and Chris, Whitlock is horrified to find their charred remains.\nWhen the Drug Enforcement Administration agents call the next day to get the evidence money in order to bust a higher drug lord, Matt responds erratically. He also discovers a person who visited Anne. He finds out that the money is now with this new person and that Alex is about to bust him. He rushes to the hotel and after a brief struggle, he accidentally kills the stranger, takes the money and flees. Although Matt is seen by the police, he is thought to have come to protect Alex. The stranger is revealed to be Paul Cabot, the doctor who diagnosed Anne with cancer.\nLater that evening, Alex finds that Matt is Anne's sole beneficiary and also that he has been visiting her. At the same time, Matt receives a distress call from Anne and unofficially goes to save her. Chris and Matt fight, Anne shoots and kills Chris. Then Anne reveals that she had planned all of this and shoots Matt in the leg.\nWhen Anne is about to kill Matt, Alex kills her; Alex traced Matt using a GPS tracker and asks him whether he planned to elope with the money. But Matt reveals that he has not brought the money with him. When the irritated DEA agents come to arrest Matt as he had promised the money delivery by noon and it was 7pm, he says that his man was sent to Miami, and simultaneously Chae appears with the money, explaining about a wrong address and that he could not find the DEA office. So the DEA agents leave with the money and Matt has no charges on him. \nLater, when Matt is on medical leave, Chae visits him with news that Matt now owns $1 million USD, which is Anne's insurance money. But Alex says that, \"as his wife,\" she knows that Matt has to reject it, meaning that she has decided to drop the divorce and move back in with Matt. Overjoyed, Matt seemingly forgets about the life insurance money, though Chae is amusingly adamant that Matt must take it.", "cast": "Denzel Washington as Matthias Lee Whitlock\nEva Mendes as Alex Diaz-Whitlock\nSanaa Lathan as Anne-Merai Harrison\nDean Cain as Chris Harrison\nJohn Billingsley as Chae, the medical examiner\nRobert Baker as Tony Dalton\nAlex Carter as Paul Cabot\nAntoni Corone as Deputy Baste\nTerry Loughlin as Agent Stark\nNora Dunn as Dr. Donovan\nJames Murtaugh as Dr. Frieland\nO. L. Duke as Detective Bronze\nTom Hillmann as Robert Guillette, Living Gift Salesman"}