{"_movieID": "473072", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:57", "summary": "2036: Nexus Dawn (known in Chinese and Taiwanese territories as 2036: Clone Era, 2036: Chain Dawn, or 2036: Copy of the Times; alternatively known as Blade Runner 2036) is a 2017 American neo-noir science fiction short film acting as a prequel to the feature film Blade Runner 2049. It is one of three such prequels, alongside Blade Runner Black Out 2022 and 2048: Nowhere to Run. The short was released on August 30, 2017, approximately five weeks before the release of the feature film, and features Jared Leto as Blade Runner 2049 character Niander Wallace, alongside Benedict Wong. The film was written by Hampton Fancher and Michael Green, who also wrote the feature film, and directed by Luke Scott, whose father Ridley Scott directed the original Blade Runner and is executive producer on the sequel Blade Runner 2049.\nThe film takes place in Los Angeles in 2036, 13 years before the events of Blade Runner 2049, and tells the story of  Wallace's meeting with the \"lawmakers\" and his attempts to convince them to allow his new line of replicants to enter production.", "plot": "Niander Wallace is called to a hearing about his desire to manufacture a new generation of replicants. Wallace is warned that what he is doing is illegal and not open to debate, which Wallace questions saying they are debating it. Wallace points out that Earth's ecosystem is collapsing and the only thing that will be able to sustain the human race is cheap labor provided by replicants. He also claims the new replicants are not dangerous to humans, but the lawmakers remain unconvinced. To prove this, he orders his replicant assistant, a newly developed Nexus-9, to purposely cut himself and then decide between Wallace's life and his own. The replicant then cuts his own throat, shocking the lawmakers. Wallace once again asks them if they are willing to authorize the production of new replicants.", "cast": "Jared Leto as Niander Wallace, a replicant manufacturer\nBenedict Wong as lawmaker\nNed Dennehy as lawmaker No. 2\nAde Sapara as lawmaker No. 3\nAnia Marson as lawmaker No. 4\nSet Sjöstrand as Nexus-9 replicant"}