{"_movieID": "268531", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:37:41", "summary": "Captain Underpants: The First Epic Movie (or shortly known as Captain Underpants) is a 2017 American computer-animated superhero comedy film based on Dav Pilkey's children's novel series of the same name, produced by DreamWorks Animation and distributed by 20th Century Fox. It was directed by David Soren from a screenplay by Nicholas Stoller, and stars the voices of Kevin Hart, Ed Helms, Nick Kroll, Thomas Middleditch, Jordan Peele and Kristen Schaal. The plot follows two imaginative elementary school pranksters named George Beard and Harold Hutchins who hypnotize their mean-spirited principal, Mr. Krupp, into thinking he is Captain Underpants, a superhero who fights crime while wearing only underwear and a cape.\nCaptain Underpants premiered on May 21, 2017, at the Regency Village Theater in Los Angeles, and was released in the United States on June 2, 2017, in 3D and 2D. The film received generally positive reviews and grossed $125 million worldwide against a budget of $38 million, making it the lowest-budgeted computer-animated feature of DreamWorks Animation's history. This was the last DreamWorks Animation film to be distributed by 20th Century Fox (rights to the entire DreamWorks Animation library, including this film, are now owned by Universal Pictures, following NBCUniversal's purchase of the company in 2016). With the film's release in Saudi Arabia paired with The Emoji Movie on January 13, 2018, both became the first films to be given official public screenings in the country in 35 years after the removal of Saudi Arabia's cinema ban.", "plot": "In Piqua, Ohio, George Beard and Harold Hutchins are two fourth-grade friends and next-door neighbors who often bring joy to their school, Jerome Horwitz Elementary School, by excessively pranking the cruel teachers, especially the mean Principal Benjamin \"Benny\" Krupp, which puts them at odds with him. The duo also create comic books about a superhero named Captain Underpants, a character who has superpowers and wears underwear and a cape. They sell these to their schoolmates through a comic company called Treehouse Comix Inc, housed in their treehouse. George and Harold's pranks come to an apparent end after they tamper with a toilet invention, the Turbo Toilet 2000, made by the school's local snitch, intellectual Melvin Sneedly, who was able to catch them thanks to another invention which Mr Krupp asked him to make, the Tattle Turtle 200. This causes Mr. Krupp to decide to put the boys in separate classes and annihilate their friendship.\nTo prevent this, George hypnotizes Mr. Krupp with a 3D Hypno Ring he received out of a cereal box; the boys see that Mr. Krupp bears a resemblance to Captain Underpants without his toupee and command him to be Captain Underpants. The boys soon learn the severity of this when Captain Underpants begins causing some problems around Piqua and take him to their tree-house. There they discover that they can turn Captain Underpants back into Mr. Krupp by splashing water on him and can turn him back into Captain Underpants by snapping their fingers. Believing that Mr. Krupp will continue with trying to separate them, they decide to settle with Captain Underpants but insist that he be dressed up as Mr. Krupp under the pretense of a 'secret identity' to which Captain Underpants agrees. His sudden personality change even manages to attract the attention and affection of the school's shy lunch lady, Edith.\nJust when George and Harold believe that their troubles have ended, Jerome Horwitz Elementary School is visited by an odd, German-accented scientist named Professor Pippy P. Poopypants, or as he calls himself Professor P. Captain Underpants (disguised as Mr. Krupp) hires him to be a new teacher, but George and Harold are suspicious of him due to his short-tempered and violent behavior.  As it turns out, Poopypants is seeking to get rid of laughter altogether due to the fact that people have made fun of his name for years. \nWith Captain Underpants as principal, the school is a more lively place, with a funfair being set up in the yard. However, a rainstorm occurs and Captain Underpants turns back into Mr. Krupp, who finally finishes the paperwork to put George and Harold into separate classes. Meanwhile Professor P. recruits Melvin into his plan, as his brain lacks a \"Hahaguffawchuckleamalus\", a gland that triggers laughter. Soon, Professor Poopypants tries to take over the town with a giant version of the Turbo Toilet 2000, fueled by the school cafeteria's rotten leftovers left out by Edith– and uses Melvin's brain to turn the children into glum, humorless zombies. Captain Underpants tries to stop the villain, but due to having no actual superpowers, is effortlessly defeated and thrown into the toilet. George and Harold are captured and nearly turned into zombies, but are able to escape when their laughter from the joke that made them friends in kindergarten, damages the Turbo Toilet 2000's computer. Upon consuming the mutated leftovers, Captain Underpants acquires superpowers and, with George and Harold's help, defeats and shrinks Poopypants, though he escapes on a bee shortly thereafter.\nKnowing that they cannot control Captain Underpants, George and Harold destroy the Hypno Ring in an attempt to permanently change him back into Mr. Krupp. Feeling that Mr. Krupp would be nicer if he had friends, the boys set him and lovesick Edith up on a date, thus making Mr. Krupp have a change of heart. He returns the comics he took away from George and Harold, even admitting their comics to be funny. However, the toxic waste from the Turbo Toilet 2000 transforms all the toilets into an army of Talking Toilets which attack the restaurant at which Mr. Krupp and Edith are dining. Upon snapping his fingers (accidentally), Mr. Krupp once again becomes Captain Underpants, carrying George and Harold away to help him fight them, much to Edith's surprise and admiration. \nIn a mid-credits scene, George and Harold realize that the secretary, who they put on the phone by faking a competition for $1 billion, has been on the phone for the entire film. They shut off the call, much to the secretary's anger, and make a new comic based on her reaction."}