{"_movieID": "347969", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:37:01", "summary": "The Ridiculous 6 is a 2015 American western action comedy film directed by Frank Coraci and written by Tim Herlihy and Adam Sandler. Starring Sandler, Terry Crews, Jorge Garcia, Taylor Lautner, Rob Schneider and Luke Wilson, the plot follows six men who discover that they share the same bank-robbing father (Nick Nolte), and thereafter set out to reunite with him.\nReleased worldwide on Netflix on December 11, 2015, the film was panned by critics and is one of few films to receive an approval rating of 0% on Rotten Tomatoes.", "plot": "In the Old West, a calm man named Tommy, known as \"White Knife\" by the Native American tribe who raised him after his mother was murdered is to marry a member of the tribe named Smoking Fox. Following a run-in with a deranged, Native American-racist food proprietor named Clem and the Left-Eye Gang (who have all removed their right eyes to join) led by Will Patch, Tommy is visited by a bank robber named Frank Stockburn who claims to be Tommy's biological father. Tommy explains to Frank that his mother was shot by a man with a tattooed hand when she was escorting him to school during his childhood. Frank also tells Tommy that he is dying of consumption and had amassed $50,000 which he buried in a meadow next to a pine tree and is offering to Tommy and the Natives. The next day, a group of bandits with connections to Frank come to the village, led by the ruthless Cicero who wants Frank to give them his \"big score\" he gained a while back. Frank has the bandits kidnap him so he can lead them to the $50,000 at the so-called \"Singing Windmill\", in return for the bandits not attacking Tommy or the Indians. With no time to search the meadow and find the money, and to live to his tribe's standards, Tommy decides to resort to stealing from dishonorable persons (corrupt politicians, racist bankers, and thugs alike) to obtain the amount needed and save his father. During his quest, Tommy discovers that he has 5 half-brothers: Mexican burro rider Ramon whose innkeeper mother had a fling with Frank; mentally challenged yet happy-go-lucky Lil' Pete (Lautner) whose strong neck makes him immune to hanging; feral mountain-man Herm (Garcia) who speaks incomprehensibly while having helped his mother sell their moonshine.\nTommy meets his last two half-brothers, Abraham Lincoln's former bodyguard Danny who resorts to drinking from guilt of accidentally leading John Wilkes Booth to murder him; and African-American saloon pianist Chico who confesses to be half-White, when the brothers stole a large gold nugget from Chico's boss: the ever smiling sociopathic saloon owner Smiley Harris, who was part of Frank's gang until Frank stole his cut of their biggest score and left him to die at the windmill. When Smiley attempts to kill the brothers as revenge against Frank, he ended up being unintentionally decapitated by Ramon who was trying to knock him out. Meanwhile, having joined the Left-Eye Gang at the cost of his only functional eye, Clem helps the bandits\nabduct Smoking Fox while searching for Tommy before their captive ultimately eluded them while they learn of the brothers' exploits as they came to be known as the Ridiculous 6. The Left-Eye Gang soon catch up to the Ridiculous 6 while they were relaxing in a pond, overpowered but stealing their loot. But at Herm's notion, which Tommy translates through his mysticism, the brothers decide to rob from gambling game in Yuma hosted by Ezekiel Grant and attended by Mark Twain and General George Armstrong Custer. Though Wyatt Earp nearly jeopardized their plan, the brothers succeed and head out to ransom their father, saving the Eye Patch Gang after learning they were left to die by Cicero while forcing them to reform and getting back the original $50,000.\nAs dusk falls, Tommy realizes through a Danny's photograph of their father that Cicero is his mother's murderer, leaving his brothers in the cover of night to rescue his father and kill Cicero. The half-brothers, who followed Tommy along with the Left-Eye Gang, have a reunion with their long lost father, who reveals to have masterminded his abduction upon learning his sons exceed his expectations in amassing $100,000 and had taken Smoking Fox captive. But Tommy reveals his group had a Plan B: a hidden bomb inside the bag containing the ransom money. When the bomb explodes and commotion ensues, Frank runs off with Smoking Fox inside a mine. Tommy runs after them and successfully rescues his bride-to-be and captures his father. Back in the Native Village, Tommy weds Smoking Fox with his brothers in attendance. Since the revelation that their biological father Frank Stockburn was no more than a two-bit crook, the Native chief decides to adopt the half-brothers as he did with Tommy."}