{"_movieID": "31967", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:14:20", "summary": "Dante's Inferno: An Animated Epic is a direct to DVD animated dark fantasy action film released on February 9, 2010. The film is based on Dante's Inferno video game which is itself loosely based on Dante's Inferno.", "plot": "Returning from the Third Crusade, Dante passes gloomy, depressing forests. He can detect someone following him. He arrives home to find his servants slain, his father dead and his beloved fiancee Beatrice lying on the ground, dying of a stab wound to the stomach. As she dies, she turns into a spirit and begins to ascend into Heaven. However, a shadowy Lucifer plucks Beatrice from the sky and into the gates of Hell.\nDante gives chase through the forest; Lucifer's portal to Hell closes around all three of them. Dante fights off and slaughters a mob of creatures, but is captured by a score of serpent-like arms which suspend him immobile in the air. They sow a red cross into his chest and torso, a living tapestry, detailing his greatest sins in life. Virgil appears and offers to guide him through Hell; Dante, invoking his faith, tears open the gates and enters.\nDante and Virgil board Charon, a massive, demonic, living ferry that takes souls across the river Acheron to the First Circle of Hell. Charon commands demons to attack Dante, as no living being is allowed to enter. Dante fights them off, but loses his sword and so picks up one of the demons' scythes. He then kills Charon and steers him into the coasts of the first circle, Limbo.\nVirgil and Dante enter Limbo, home to mostly virtuous pagans and unbaptized babies. Here Dante learns Beatrice was pregnant with his child while he was away, but miscarried after five months. Attacked by demonic children, he and Virgil escape into a large building; they enter a hall of great rulers, philosophers, and thinkers, including Aristotle, Plato, Socrates, and Saladin, whose forces Dante had battled during his crusade. Moving on, they encounter King Minos, whose task is to send condemned souls to their sin's corresponding circle of Hell. He denies Dante entry; they battle, and Minos is killed. Meanwhile, Lucifer tortures Beatrice, repeatedly killing her, tricking her with the hope of rescue, and taunting her that Dante had been unfaithful.\nOn the storm-ravaged shores of the second circle, the island of Lust, bodies fly through the wind, intertwined, caught in a never-ending storm of passion. Hearing Beatrice's cries in the distance, Dante enters a room of succubi who transform into hideous demons. As they try to seduce him, he realizes that he did break his promise to Beatrice; during the Crusade, an imprisoned heretic woman offered \"comfort\" to save her husband from being beaten to death. Under the illusion he was 'absolved' of all sin by a priest, he accepted her offer. Upon hearing this, Beatrice begins to lose faith, but still refuses Lucifer's offer of his hand in marriage.\nThe pair come to a grotto where men and women who had lived their lives in gluttony are tortured by starvation; many are caught and devoured by Cerberus, the great hound of Hell. Virgil tells Dante the only way to the next circle is from within the beast, so Dante allows himself to be eaten. He encounters Ciacco, a man from his village, who confesses to gluttony; Dante tells him to be free and blesses him with his cross. Ciacco's spirit floats skyward. A shadow of Lucifer appears to torment Dante, who attacks and destroys the hound's heart; he is spewed out into a river of blood.\nFloating down into the next circle, Dante and Virgil meet men and women who wasted their lives in pursuit of material possessions. The condemned souls are tortured by being sheared in money presses, boiled in melted gold, and buried in enormous mounds of heavy gold coins. Here Dante confronts his father, who has been promised a thousand years free of torture and endless gold to murder his own son. The pair battle fiercely; Dante kicks his father into a vat of boiling gold.\nProceeding through the fifth circle of hell, Wrath. Virgil and Dante come to the River Styx, where spirits are fighting in the shallow waters. They climb aboard Phlegyas, a demonic giant who traverses the river; men and women who know of Dante taunt him from within the boiling mud below. Dante sees Lucifer in a city; he announces to the city's damned souls his intent to marry Beatrice. He strikes Phlegyas down and chases after the devil.\nIn the sixth circle of Hell, heretics forever burn in fire and tortured. Dante meets his rival Farinata, who taunts him, revealing Lucifer's plan to wed Beatrice and leave him trapped in Hell forever. Dante angrily kills Farinata, fleeing the circle before it collapses from quakes caused by the force of Christ's death.\nVirgil helps Dante defeat the Minotaur, guardian of the Circle of Violence, who is overcome by his own anger. The centaur Nessus helps them to cross a river where many souls of the violent are boiling in the blood of their victims. Entering the Forest of Suicides, Dante hears a familiar cry and finds his mother growing from the sapling of a tree, forever in pain for hanging herself rather than standing up against or leaving her husband, Dante's father. Believing she had died of a fever, Dante is overwhelmed with sorrow; he uses his cross to free her soul.\nThey come to a graveyard within the Abominable Sands. Dante's one-time Crusader comrades, including his friend Francesco, rise from the grave as undead warriors, condemned for committing acts of violence in the name of God. Dante defeats Francesco by slicing his head in half, and remembers that he himself had slaughtered several heretics.\nAfter being carried by the geryon to the realm of Fraud, Virgil parts ways with Dante, advising him to cross a series of bridges to stop the marriage of Beatrice and Lucifer. Dante begins to reflect upon his own sins; he realizes his father, family servants, and Beatrice were slain by the husband of the woman with whom he had been unfaithful and thus he is to blame for their deaths. Beatrice is overcome by sorrow at Dante's betrayal; she weds Lucifer and becomes a demon, losing her wings and rights to heaven. Her body engulfed in flames, Beatrice proceeds to attack Dante, overpowering him and forcing him to look into the ninth circle of Treachery, where he sees his greatest sin: allowing her brother to take the blame for his slaughter of the heretic prisoners. Overwhelmed with grief, he gives Beatrice her cross, which he had promised to restore to her upon his return from the Crusade. He begs for forgiveness and pleads with her to once again accept the love of God. She forgives him, and returns to her previous angelic form as she kisses him. A two-headed angel descends from Heaven to take her. Beatrice promises they will be together soon, but in order to escape Hell, he will need to face Lucifer alone.\nWandering in the dark, cold caverns of the final circle, Dante comes across a cave filled with huge frozen chains; he mows through them, only to find that he has freed a three-faced demon which appears to be Lucifer's corporeal form. Dante slays the beast and moves toward Purgatory, where his salvation awaits. Lucifer, however, reveals his true corporeal form and easily overpowers Dante. He brags that many heroes, including Ulysses, Alexander, Attila, and Lancelot, had tried to kill him, but none had a soul black enough to allow Lucifer to free himself. He explains that Beatrice was merely bait to lure Dante into Hell to free him from his prison. He vows to enter Purgatory and Paradise, and to rend Heaven into a new and greater Hell. Dante realizes he cannot stop Lucifer on his own; he prays and repents in humility and begs for divine forgiveness. Willing to sacrifice his own soul to defeat Lucifer and so prevent him from his sworn conquest of the higher realms, he pleads for the power to trap Lucifer with him forever. Shocked, Lucifer runs back to stop Dante from making this pact; an explosive beam of light emanates from Dante, and Lucifer is frozen solid.\nDante dives into the chasm that leads through the earth to Purgatory to be with Beatrice, now \"neither completely living, nor completely dead\", as he puts it. Later that night, the flesh-emblem of sin he ripped off his chest, transforms into a serpent, supposedly Lucifer waiting to get his revenge, that slithers away into the distance.", "cast": "Graham McTavish - Dante\nVanessa Branch - Beatrice\nSteven Blum - Lucifer\nPeter Jessop - Virgil\nMark Hamill - Alighiero (Dante's father)\nVictoria Tennant - Bella\nBart McCarthy - Filippo Argenti\nKevin Michael Richardson - King Minos, Phlegyas\nJohn Paul Karliak - Avenger\nTom Tate - Francesco\nJ. Grant Albrecht - Ciacco, Farinata Uberti\nStephen Apostolina - Walla\nNika Futterman - Female Prisoner, Lust Minion #4\nCharlotte Cornwell - Nessus, Lust Minion #3\nVanessa Marshall - Lust Minion #2, Frozen Prisoner\nGrey DeLisle - Lust Minion #1, Dante (as 10 years old)\nH. Richard Greene - Socrates, King Richard I\nJohn Rees (as Greg Ellis) - Plato\nShelley O'Neil - Child\nNicholas Guest - Demon Priest\nWendy Cutler - unspecified voice\nLia Sargent -  unspecified voice\nMark Sussman -  unspecified voice\nDave Zyler (as Dave Zyler)  -  unspecified voice"}