{"_movieID": "54138", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:55:37", "summary": "Star Trek Into Darkness is a 2013 American science fiction adventure film directed by J. J. Abrams and written by Roberto Orci, Alex Kurtzman, and Damon Lindelof. It is the twelfth installment in the Star Trek film franchise and the sequel to the 2009 film Star Trek, as the second in a rebooted film series. The film features Chris Pine reprising his role as Captain James T. Kirk, with Zachary Quinto, Simon Pegg, Karl Urban, Zoe Saldana, John Cho, Anton Yelchin, Bruce Greenwood, and Leonard Nimoy reprising their roles from the previous film. Benedict Cumberbatch, Alice Eve and Peter Weller are also credited in the film's principal cast. It was the last time Nimoy would portray the character of Spock before his death in 2015. Set in the 23rd century, Kirk and the crew of USS Enterprise are sent to the Klingon homeworld seeking former Starfleet member-turned terrorist John Harrison.\nAfter the release of Star Trek, Abrams, Burk, Lindelof, Kurtzman, and Orci agreed to produce its sequel. Filming began in January 2012. Into Darkness's visual effects were primarily created by Industrial Light & Magic. The film was converted to 3D during its post-production stage.\nStar Trek Into Darkness premiered at Event Cinemas in Sydney, Australia, on April 23, 2013, and was released on May 9 in Australia, New Zealand, the United Kingdom, Europe, and Peru, with other countries following. The film was released on May 17 in the United States and Canada, opening at IMAX cinemas a day earlier. Into Darkness was a financial success and received positive reviews from critics. Its gross earnings of over $467 million worldwide have made it the highest-grossing entry in the Star Trek franchise. At the 86th Academy Awards, the film was nominated for the Academy Award for Best Visual Effects. It was followed by Star Trek Beyond in 2016.", "plot": "In 2259, Captain James T. Kirk is removed from command of the starship USS Enterprise for violating the Prime Directive after exposing the ship to the primitive inhabitants of the planet Nibiru in order to save them, and Spock, from a cataclysmic volcanic eruption. Admiral Christopher Pike is reinstated as commanding officer with Kirk demoted to first officer. Spock is transferred to another ship. Shortly after, the Section 31 installation in London is bombed by renegade Starfleet operative John Harrison. Harrison attacks Starfleet Headquarters in a jumpship during an emergency meeting regarding the situation, killing Pike and other senior officers. Kirk disables the jumpship, but Harrison transports to Kronos, homeworld of the hostile Klingons.\nAdmiral Alexander Marcus reinstates Kirk and Spock to Enterprise with orders to kill Harrison using a new long range stealth photon torpedo. Chief Engineer Montgomery Scott objects to allowing untested torpedoes on board the ship without knowing their specifications; when he is overruled, he resigns. Kirk assigns Pavel Chekov to replace Scotty. En route to Kronos, Enterprise's warp capabilities become disabled. Kirk leads a team with Spock and Uhura onto the planet in a small landing craft, where they are ambushed by Klingon patrols who order them to land. Uhura leaves the landing craft to talk to the Klingons. They decide to kill Uhura, but Harrison appears and kills the Klingons. Harrison demands that Kirk tell him the number of torpedoes on board the Enterprise, surrendering when Spock tells him.\nDr. Leonard McCoy and Marcus's daughter, Dr. Carol Marcus, open a torpedo at Harrison's behest, revealing a man in cryogenic stasis. The other experimental torpedoes similarly contain cryogenically frozen humans. Harrison is taken to the ship's brig, where he reveals his true identity as Khan, a genetically engineered superhuman awoken by Admiral Marcus from centuries of suspended animation to develop advanced weapons. Khan reveals that Marcus sabotaged Enterprise's warp drive, intending for the Klingons to destroy the ship after it fired on Kronos, creating an act of war by the Klingon Empire. Khan also gives Kirk a set of coordinates. Kirk contacts Scotty on Earth and asks him to investigate. Scotty discovers the coordinates lead to a covert Starfleet facility.\nEnterprise is intercepted by a much larger Starfleet warship, USS Vengeance, commanded by Admiral Marcus. Marcus demands that Kirk deliver Khan, but Enterprise flees to Earth to expose him. After Vengeance disables Enterprise near the Moon, Carol reveals her presence aboard the ship. Marcus forcibly transports Carol to Vengeance before ordering Enterprise's destruction. Kirk offers Khan and himself for the lives of his crew, but Marcus rejects Kirk's offer, revealing he never intended to spare them. Vengeance suddenly loses power after being sabotaged by Scotty, who infiltrated the ship. With transporters down, Kirk and Khan, with the latter's knowledge of the warship's design, space-jump to Vengeance. Spock contacts his older self, who warns that Khan is ruthless and untrustworthy and that Khan's older self was only defeated at terrible cost. Khan overpowers Kirk, Scott and Carol, kills Marcus, and takes control of Vengeance.\nKhan demands that Spock return his crew in exchange for the Enterprise officers. Spock complies but surreptitiously removes Khan's frozen crew from the torpedoes and arms the warheads. Khan beams Kirk, Scott and Carol aboard Enterprise, but betrays their agreement by attacking Enterprise; however, Vengeance is disabled when the torpedoes detonate. With both starships caught in Earth's gravity, they plummet toward the surface. Kirk enters the radioactive reactor chamber to realign the warp core, sacrificing himself to save the ship.\nKhan crashes the Vengeance into downtown San Francisco in an attempt to destroy Starfleet headquarters. Khan escapes the wreckage so Spock transports down in pursuit. McCoy discovers that Khan's blood has regenerative properties that may save Kirk. Spock pursues Khan through the city and the two engage in hand to hand combat. Spock gains the upper hand and is about to kill Khan, but Uhura stops him. Khan's blood revives Kirk. One year later, Kirk speaks at Enterprise's re-dedication ceremony. Khan is sealed in his cryogenic pod and stored with his compatriots. The Enterprise crew embarks on a five-year exploratory mission.", "cast": "Chris Pine as Captain James T. Kirk, commanding officer and former first officer of the starship Enterprise.\nZachary Quinto as Commander Spock, first officer and science officer. Leonard Nimoy has a cameo appearance as Spock Prime.\nZoe Saldana as Lieutenant Nyota Uhura, communications officer.\nKarl Urban as Dr. Leonard \"Bones\" McCoy, chief medical officer.\nSimon Pegg as Lieutenant Commander Montgomery \"Scotty\" Scott, second officer and chief engineer.\nJohn Cho as Lieutenant Hikaru Sulu, third officer and helmsman.\nBenedict Cumberbatch as Khan, a genetically engineered superhuman given the false identity of Commander John Harrison.\nAnton Yelchin as Ensign Pavel Chekov, navigator and Scott's temporary replacement as chief engineer.\nBruce Greenwood as Rear Admiral Christopher Pike, Kirk's predecessor as captain of the Enterprise and mentor.\nPeter Weller as Starfleet Admiral Alexander Marcus, Carol's father.\nAlice Eve as Dr. Carol Marcus, a science officer who uses the pseudonym Carol Wallace to board the Enterprise.\nNoel Clarke as Thomas Harewood, a Starfleet officer, working within Section 31 who is bribed by Khan into blowing up the facility.\nNazneen Contractor as Rima Harewood, Thomas's wifeAdditional members of the Enterprise crew include Amanda Foreman as Ensign Brackett, Jay Scully as Lieutenant Chapin, Jonathan Dixon as Ensign Froman, Aisha Hinds as Navigation Officer Darwin, and Joseph Gatt as Science Officer 0718. Deep Roy and Jason Matthew Smith reprise their roles as Keenser and Hendorff from the first film. Anjini Taneja Azhar, Nolan North, and Sean Blakemore also appear in the film, with Azhar as Lucille Harewood, the terminally ill daughter of Thomas Harewood; North portraying a Vengeance helmsman; and Blakemore playing a Klingon. Heather Langenkamp portrays Moto, a character she describes as a small role."}