{"_movieID": "76492", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:07:02", "summary": "Hotel Transylvania is a 2012 American computer-animated comedy film produced by Columbia Pictures and Sony Pictures Animation. It was directed by Genndy Tartakovsky (in his directorial debut) from a screenplay by Peter Baynham and Robert Smigel and a story by Todd Durham, Dan Hageman, and Kevin Hageman, and stars the voices of Adam Sandler, Andy Samberg, Selena Gomez, Kevin James, Fran Drescher, Steve Buscemi, Molly Shannon, David Spade, and CeeLo Green. The film tells a story of Count Dracula, the owner of a hotel called Hotel Transylvania where the world's monsters can take a rest from human civilization. Dracula invites some of the most famous monsters to celebrate the 118th birthday of his daughter Mavis (with a 18 year old aspect). When the \"human-free hotel\" is unexpectedly visited by an ordinary 21-year-old traveler named Jonathan, Dracula must protect Mavis from falling in love with him before the hotel's guests learn a human is in the castle, which may jeopardize the hotel's future and his career.\nThe film was released on September 28, 2012, by Sony Pictures Releasing, and was met with mixed critical reception, while the general public received it favorably, with many of them and some critics praising the colorful cartoony animation, humor and voice acting, while criticizing the predictable story and writing. It earned a total of $358 million worldwide, against a budget of $85 million, at the box office, and was nominated for a Golden Globe Award for Best Animated Feature Film. It launched a franchise with a sequel titled Hotel Transylvania 2, which takes place seven years after the first film, released in 2015, and a third film titled Hotel Transylvania 3: Summer Vacation released in 2018. A television series based on the film premiered on Disney Channel in June 2017, focusing on the teenage years of Mavis and her friends at the Hotel Transylvania. A fourth film set to be released on December 21, 2021.\n\n", "plot": "In 1895, in the aftermath of the death of his wife Martha (Jackie Sandler) at the hands of an angry human mob, Count Dracula (Sandler) commissions and builds a massive five-star, monsters-only hotel in Transylvania, in which he raises his daughter Mavis (Gomez) and to serve as a safe-place getaway for the world's monsters from fear of human persecution. Famous monsters such as Frank (James) and his wife Eunice (Drescher), Wayne and Wanda Werewolf (Buscemi and  Shannon) and their massive immediate family, Griffin The Invisible Man (Spade), and Murray the Mummy (Green) often come to stay at the hotel.\nIn the present day, on Mavis's 118th birthday, Dracula allows his daughter to leave the castle to explore the human world, but he sets up an elaborate plan using his zombie bellhops disguised as humans to make them seem intimidating, and frighten her home. The plan works, but the zombies inadvertently lead a 21-year-old human Jonathan Loughran (Samberg) back to the hotel. Dracula frantically disguises him as a Frankensteinesque monster and passes him off as Frank's cousin \"Johnnystein\". Johnny soon encounters Mavis and the two \"Zing\". Unable to get Johnny out of the hotel without notice, Dracula quickly improvises that Johnny is a party planner, brought in to bring a fresher approach to his own traditional and boring parties. Johnny quickly becomes a hit to the other monsters, but this disgusts and worries Dracula greatly. Dracula orders Johnny to leave, but he is brought back by Mavis. After being shown the beauty of a sunrise by Johnny, Mavis is inspired to give humans another chance.\nMeanwhile, the hotel chef Quasimodo (Jon Lovitz), with the help of his pet rat Esmeralda, learns that Johnny is a human and kidnaps him to cook him. Dracula intervenes and magically freezes Quasimodo to keep him from telling anyone that Johnny is human. Dracula leads Johnny to his quarters and shows him a painting of Martha, allowing Johnny to realize why Dracula built the hotel and became overprotective of Mavis. Johnny then agrees to leave for good, but Dracula convinces him to stay for the time being to avoid ruining Mavis's birthday.\nThe party is a great success the next night, and Mavis looks forward to opening a gift from Martha. However, when Johnny and Mavis share their first kiss, Dracula overreacts, and in his outburst, inadvertently confesses to deceiving Mavis with the town. A still-frozen Quasimodo bursts in and Mr. Fly (Chris Parnell) reveals from his frozen speech that Johnny is a human disguised by Dracula. The guests are outraged by the deceit at play, but Mavis is undeterred and wants to be with Johnny. Johnny feigns disinterest in Mavis and rejects her out of respect for her father and leaves the hotel.\nMavis flies onto the roof with her mother's present, and Dracula follows her in hopes of comforting her. He learns the present is a book about how Martha and Dracula \"Zinged\" and fell in love. Dracula realizes he no longer knows humankind's true tolerance of monsters, and manages to convince Frank, Wayne, Griffin, and Murray to head out into the human world to help him find Johnny, and with the scent-tracking ability of Wayne's daughter, Winnie, they learn that he is about to catch a flight to the United States. The four head to the airport, but are held up in a town celebrating a Monster Festival along the way. Admiring the group, the humans agree to help, and a team of men dressed as vampires provides Dracula shelter from the sunlight while he rushes to the airport. Dracula arrives to see Johnny's plane taking off, and he gives chase in bat form, burning in the sunlight. After getting Johnny's attention, Dracula makes his way to the front of the plane and uses his mind-controlling power on the pilot (Brian Stack) to help him apologize, stating that Mavis has grown up and can make her own decisions. Jonathan accepts his apology, and Dracula manipulates the pilot to return to the Transylvanian airport.\nDracula returns Jonathan to Mavis, announcing that he approves of Johnny. Johnny confesses to Mavis that their \"Zing\" was mutual and the two kiss. The monsters finish celebrating Mavis's party, impressing the hotel guests."}