{"_movieID": "84316", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:13:27", "summary": "My Brother the Devil is a 2012 British crime drama film written and directed by Sally El Hosaini.\nIt has won multiple awards, including at the 2012 Sundance Film Festival and at the 2012 Berlin International Film Festival.\nIt stars James Floyd, Fady Elsayed and Saïd Taghmaoui. It tells the story of two sons of Egyptian immigrants coming of age in east London. It was released in UK on 9 November 2012 and was in US cinemas from 22 March 2013. Further releases in Canada, Germany, Australia and New Zealand.", "plot": "Mo (Fady Elsayed) and Rashid \"Rash\" (James Floyd) are teenage brothers of Egyptian descent living with their parents in Hackney. Elder brother Rash is fiercely protective of Mo, giving him a TV when he does well and encouraging him to stay in school. However Mo begins to want to emulate Rash who works as a low level drug dealer, and is able to use money from his job to pay for small luxuries to make their lives more comfortable.\nMo is robbed by rival gang members while trying to do a drop-off for his brother. He calls Rash and his friends later when he spots the gang members at the corner store near where he lives. The confrontation between Rash's gang and his rival Demon's gang quickly grows violent and after Demon's dog is stabbed Demon retaliates by stabbing and killing Izzi, Rash's best friend.\nRash acquires a gun and plans to shoot Demon in retaliation. He finds Demon at a tattoo parlour but is unable to complete the task after seeing that Demon's little brother is there, wearing the shoes he lifted from Mo. Rash begins to dream of getting out of the gang the way Izzi was planning on doing before he was murdered. He grows close to Sayyid, a French photographer who had been helping Izzi to get legal employment. After he tells Sayyid that he wants to leave the gang Sayyid offers him a job as a photography assistant working with him.\nMo begins to grow jealous of Rash and Sayyid's increasing closeness and the respect that Rash has for him. When he is offered the opportunity to join Rash's gang as a dealer he takes it. In the meantime Sayyid kisses Rashid while they are playing around. Initially repulsed at the idea of kissing another man, Rash tries to go back to his old lifestyle. However he finds himself changed and ends up going back to Sayyid and starting a relationship with him. Mo, growing suspicious that Rash is not in fact working, goes to Sayyid's home to spy and sees the two men undressed and realizes what is going on. Angry at his brother, Mo continues to deal drugs and become further entrenched in Rash's old gang. Eventually Rash finds Mo's money and drugs. He confronts his former friends telling them that he will kill Demon in exchange for them allowing Mo to walk away from the drug business and his family to stay safe and unharmed. Upset that Rash has isolated him from his \"family\" Mo ends up telling Rash's former girlfriend Vanessa that Rash is gay. She spreads it around the neighbourhood and Rash's former friends give him the address of a house belonging to Demon which is actually a set up so they can kill Rash. However Rash manages to escape from the house.\nThe day after Rash's escape some of his friends go to Mo and tell him that Rash was hurt killing Demon and is hiding out at Sayyid's place. Mo goes with them but becomes suspicious when he sees plastic gloves, the kind that the gang uses for killings, hanging out of one of the men's pockets. Mo leads his friend to the apartment adjacent to Sayyid's. His friend pulls a gun on the woman who answers the door, and when she screams Rash and Sayyid come running out of his building. Mo ends up taking a bullet for Rash as his former friend gets in the car and runs away.\nAt the hospital Rash is approached by his parents who tell him that Mo will be okay and ask him to forget about Sayyid and come home. Rash refuses.\nSometime later when Mo has been released from the hospital he is approached by Rash outside the building where he lives. He and Rash have a brief conversation and he tells Rash that the family is fine and he doesn't need to return. After they hug Rash walks off towards his new life.", "cast": "James Floyd as Rashid\nSaïd Taghmaoui as Sayyid\nFady Elsayed as Mo\nAnthony Welsh as Izzi\nAmira Ghazalla as Hanan\nNasser Memarzia as Abdul-Aziz\nAymen Hamdouchi as Repo\nArnold Oceng as Aj"}