{"_movieID": "157384", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:13:20", "summary": "Mother of George is a 2013 Nigerian drama film directed by Andrew Dosunmu and tells the story of a newly married Nigerian couple in Brooklyn who own and manage a small restaurant while struggling with fertility issues.  The film was produced by Patrick S. Cunningham and Rhea Scott.The film premièred in the U.S. Dramatic Competition at the 2013 Sundance Film Festival. Cinematographer Bradford Young won Sundance 2013's Cinematography Award: U.S. Dramatic for his work on this film and Ain't Them Bodies Saints. Mother of George was also selected as the closing night film at the 2013 Maryland Film Festival.The film has been acquired for U.S. distribution by Oscilloscope Laboratories.\n\n", "plot": "The film opens with the wedding of a Nigerian couple, Ayodele (Issach de Bankolé) and Adenike (Danai Gurira) Balogun. Adenike is given fertility beads by her mother-in-law, Mama Ayo (Bukky Ajayi) and although the couple make love on their first night of marriage, Adenike struggles to become pregnant. Despite drinking a tea that is supposed to help with fertility, Adenike is still unable to conceive and faces growing pressure from Mama Ayo. A visit to the doctor reveals that Adenike can receive help on the issue, but Ayodele refuses to cooperate.\nSade (Yaya Alafia) mentions adoption but Adenike insists that she wants to give birth to the child herself. Mama Ayo raises a controversial option: Adenike could conceive the child with Ayodele's brother, Biyi (Tony Okungbowa). Biyi initially refuses to participate in the scheme but eventually gives in. Following this Adenike becomes pregnant. Ayodele believes he is the father.\nThe guilt becomes too much for Adenike to bear, and she finally tells her husband the truth. Ayodele subsequently walks out of the marriage and confronts his mother. Adenike goes into labor, and the film concludes as Ayodele joins the others at the hospital.", "cast": "Isaach de Bankolé as Ayodele\nDanai Gurira as Adenike\nBukky Ajayi as Ma Ayo\nTony Okungbowa as Biyi\nYaya Alafia as Sade"}