{"_movieID": "475759", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:41:58", "summary": "2048: Nowhere to Run (known in China and Taiwan as 2048: No Escape or 2048: Nowhere to Escape; alternatively known as Blade Runner 2048) is a 2017 American neo-noir science fiction short film acting as a prequel to the feature film Blade Runner 2049 and the sequel to short film 2036: Nexus Dawn. It is one of three such prequels, alongside Blade Runner Black Out 2022 and 2036: Nexus Dawn. The short was released on September 16, 2017, approximately three weeks before the release of the feature film, and features Dave Bautista as Blade Runner 2049 character Sapper Morton, alongside Orion Ben. The film was written by Hampton Fancher and Michael Green, who also wrote the feature film, and directed by Luke Scott, whose father Ridley Scott directed the original Blade Runner and is executive producer on the sequel Blade Runner 2049.\nThe film takes place in Los Angeles in 2048, one year before the events of Blade Runner 2049, and tells the story of Morton's protecting of a mother and daughter from thugs, ultimately leading to his status as a replicant being reported.", "plot": "In Los Angeles, in 2048, Sapper Morton is shown weeping hysterically into a mirror. He washes his face in a sink and puts on his glasses. Walking through a crowded street, he is briefly accosted by a group of thugs, whom he ignores. Greeted by Ella, he gives her the book The Power and the Glory to read, a book that he enjoyed. Leaving, Sapper goes to a market to sell leeches he has farmed, being paid $3,000, which is $1,000 less than Sapper needs. After leaving the market, Sapper sees Ella and her Mother about to be sexually assaulted by the group of thugs he had earlier ignored. Angered, Sapper proceeds to savagely beat the group with seemingly superhuman strength and resilience, inadvertently killing most of them. Sapper leaves the scene, having dropped his identification papers. A spectator, having watched Sapper earlier, calls the LAPD to inform them that he thinks he's found a rogue \"skin-job\".", "cast": "Dave Bautista as Sapper Morton, a Nexus-8 replicant.\nGerard Miller as Salt\nGaia Ottman as Ella\nBjörn Freiberg as spectator\nOrion Ben as mother\nAdam Savage as shop patron (cameo)"}