{"_movieID": "315635", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:50:21", "summary": "Spider-Man: Homecoming is a 2017 American superhero film based on the Marvel Comics character Spider-Man, co-produced by Columbia Pictures and Marvel Studios, and distributed by Sony Pictures Releasing. It is the second Spider-Man film reboot and the sixteenth film in the Marvel Cinematic Universe (MCU). The film is directed by Jon Watts, from a screenplay by the writing teams of Jonathan Goldstein and John Francis Daley, Watts and Christopher Ford, and Chris McKenna and Erik Sommers. Tom Holland stars as Peter Parker / Spider-Man, alongside Michael Keaton, Jon Favreau, Zendaya, Donald Glover, Tyne Daly, Marisa Tomei, and Robert Downey Jr. In Spider-Man: Homecoming, Peter Parker tries to balance high school life with being Spider-Man while facing the Vulture.\nIn February 2015, Marvel Studios and Sony reached a deal to share the character rights of Spider-Man, integrating the character into the established MCU. The following June, Holland was cast as the title character and Watts was hired to direct. This was followed shortly by the hiring of Daley and Goldstein. In April 2016, the film's title was revealed, along with additional cast, including Downey in his MCU role of Tony Stark / Iron Man. Principal photography began in June 2016 at Pinewood Atlanta Studios in Fayette County, Georgia, and continued in Atlanta, Los Angeles, and New York City. The other screenwriters were revealed during filming, which concluded in Berlin in October 2016. The production team made efforts to differentiate the film from previous Spider-Man films.\nSpider-Man: Homecoming premiered in Hollywood on June 28, 2017, and was released in the United States in 3D, IMAX, and IMAX 3D on July 7, 2017. Homecoming grossed over $880 million worldwide, becoming the second-most successful Spider-Man film and the sixth-highest-grossing film of 2017. It received praise for the light tone and focus on Parker's high school life, and the performances of Holland and Keaton. A sequel, Spider-Man: Far From Home, was released on July 2, 2019.", "plot": "Following the Battle of New York, Adrian Toomes and his salvage company are contracted to clean up the city, but their operation is taken over by the Department of Damage Control (D.O.D.C.), a partnership between Tony Stark and the U.S. government. Enraged at being driven out of business, Toomes persuades his employees to keep the Chitauri technology they have already scavenged and use it to create and sell advanced weapons. Eight years later, Peter Parker is drafted into the Avengers by Stark to help with an internal dispute in Berlin, but resumes his studies at the Midtown School of Science and Technology when Stark tells him he is not yet ready to become a full Avenger.\nParker quits his school's academic decathlon team to spend more time focusing on his crime-fighting activities as Spider-Man. One night, after preventing criminals from robbing an ATM with their advanced weapons from Toomes, Parker returns to his Queens apartment where his best friend Ned discovers his secret identity. On another night, Parker comes across Toomes' associates Jackson Brice and Herman Schultz selling weapons to local criminal Aaron Davis. Parker saves Davis before being caught by Toomes and dropped in a lake, nearly drowning after becoming tangled in a parachute built into his suit. He is rescued by Stark, who is monitoring the Spider-Man suit he gave Parker and warns him against further involvement with the criminals. Toomes accidentally kills Brice with one of their weapons, and Schultz becomes the new Shocker.\nParker and Ned study a weapon left behind by Brice, removing its power core. When a tracking device on Schultz leads to Maryland, Parker rejoins the decathlon team and accompanies them to Washington, D.C. for their national tournament. Ned and Parker disable the tracker Stark implanted in the Spider-Man suit, and unlock its advanced features. Parker tries to stop Toomes from stealing weapons from a D.O.D.C. truck, but is trapped inside the truck, causing him to miss the decathlon tournament. When he discovers that the power core is an unstable Chitauri grenade, Parker races to the Washington Monument where the core explodes and traps Ned and their friends in an elevator. Evading local authorities, Parker saves his friends, including his classmate and crush Liz. Returning to New York City, Parker persuades Davis to reveal Toomes' whereabouts. Aboard the Staten Island Ferry, Parker captures Toomes' new buyer Mac Gargan, but Toomes escapes and a malfunctioning weapon tears the ferry in half. Stark helps Parker save the passengers and takes away the suit as a result of his recklessness.\nParker returns to his high school life, and eventually asks Liz to go to the homecoming dance with him. On the night of the dance, Parker learns that Toomes is Liz’s father. Deducing Parker's secret identity from Liz's account about him, Toomes threatens retaliation if he interferes with his plans. During the dance, Parker realizes Toomes is planning to hijack a D.O.D.C. plane transporting weapons from Avengers Tower to the team's new headquarters, dons his old homemade Spider-Man suit, and races to Toomes' lair. He is first ambushed by Schultz, but defeats him with the help of Ned. At the lair, Toomes destroys the building's support beams and leaves Parker to die. Parker escapes the rubble and intercepts the plane, steering it to crash on the beach near Coney Island. He and Toomes continue fighting, ending with Parker saving Toomes' life after the damaged Vulture suit explodes, and leaving him for the police along with the plane's cargo. After her father's arrest, Liz moves away, Parker declines an invitation from Stark to join the Avengers full-time, and Stark proposes to Pepper Potts.  He also returns Parker's suit, which he puts on in his bedroom just as his Aunt May walks in.\nIn a mid-credits scene, an incarcerated Gargan approaches Toomes in prison. Gargan has heard that Toomes knows Spider-Man's real identity, which Toomes denies.", "cast": "Tom Holland as Peter Parker / Spider-Man: A 15-year-old who gained spider-like abilities after being bitten by a genetically-modified spider. Producers Kevin Feige and Amy Pascal were impressed by Holland's performances in The Impossible (2012), Wolf Hall (2015), and In the Heart of the Sea (2015). Holland took inspiration from previous Spider-Man actors Tobey Maguire and Andrew Garfield, but also hoped to deliver something \"new and exciting\" with his take on the character, the first to focus on Parker as \"dealing with everyday problems that a 15-year-old deals with as well as trying to save the city.\" Holland attended The Bronx High School of Science in The Bronx for a few days to prepare for the role, where other students did not believe he was cast as Spider-Man. Holland felt this would carry over well to the film, where other characters do not suspect Parker of being Spider-Man. It took 25 to 45 minutes for Holland to get into costume, depending on if he had to wear a stunt harness underneath the suit. Holland initially signed for six MCU films, including three Spider-Man films.\nMichael Keaton as Adrian Toomes / Vulture: A salvager-turned-arms-trafficker after his company is forced out of business. He uses a suit with mechanical wings forged from Chitauri technology. Toomes is revealed to be the father of Liz, Parker's love interest. Director Jon Watts wanted him to be a \"regular guy\", closer to John C. Reilly's Nova Corpsman Rhomann Dey from Guardians of the Galaxy (2014) than other MCU villains like Thanos and Ultron, to go with Spider-Man as a \"regular kid who becomes a superhero\". This helped avoid Toomes drawing the attention of the Avengers, and provided someone that Parker would be able to defeat while still learning to use his abilities. Keaton said Toomes was not completely villainous, as \"there's parts of him that you go, 'You know what? I might see his point'.\" Co-producer Eric Hauserman Carroll likened Toomes to \"the dark Tony Stark\", a \"businessman with a family. He wants to look out for his kids ... He doesn't have these big delusions of grandeur where he wants to take over the world, or replace the government, or even defeat the Avengers or anything. He just wants his shot at the good life.\" Keaton was not hesitant to portray another comic book character after playing Batman in Tim Burton's 1989 film and its 1992 sequel.\nJon Favreau as Harold \"Happy\" Hogan: The former head of security for Stark Industries and Tony Stark's driver and bodyguard. Hogan is \"looking after\" Parker in the film, with Favreau saying that Parker \"needs someone to help him out\". Favreau previously portrayed Hogan in the Iron Man films, having also directed the first two of those, and described returning as just an actor as fun, allowing him \"to maintain the relationship with the MCU ... Especially when the filmmakers are taking care of you, and taking care of the characters and the story.\"\nZendaya as Michelle \"MJ\" Jones: One of Parker's classmates. Zendaya, calling her awkward but intellectual, said that \"she just feels like she doesn't need to talk to people\" because of her intelligence. She added that it was \"refreshing\" that Michelle was weird and different, feeling that \"a lot of young people—especially young women—can relate to that.\" Watts likened the character to Ally Sheedy's Allison Reynolds from The Breakfast Club (1985) or Linda Cardellini's Lindsay Weir from Freaks and Geeks (1999–2000). The character is not a direct adaptation of Mary Jane Watson, but was given the initials \"MJ\" to \"remind you of that dynamic\", with the writers \"plant[ing] the seeds in this movie\" for comparisons to Watson, but also making her \"wholly different\". Feige added that Michelle is \"not obsessed with\" Parker like Watson is at times in the comics, \"she's just observant\".\nDonald Glover as Aaron Davis: A criminal looking to purchase weapons from Toomes. Davis is the uncle of Miles Morales, a version of Spider-Man, in the comics. Glover voiced Morales in the Ultimate Spider-Man television series, and campaigned to portray Spider-Man in a film in 2010. Watts was aware of the campaign, and as soon as he was hired he asked Feige about casting Glover. The role was designed as \"a surprise treat for fans\", with Davis mentioning his nephew to set up Morales potentially appearing in a future MCU film.\nTyne Daly as Anne Marie Hoag: The head of the U.S. Department of Damage Control.\nMarisa Tomei as May Parker: Peter's aunt. First reports of Tomei's casting caused backlash on social media, with comic book fans opining that the actress was \"too young and attractive to portray the character\", especially after the character had previously been depicted by actresses older than Tomei. Regarding the casting, Captain America: Civil War co-writer Stephen McFeely said that, for the MCU, they were trying to make Peter \"as naturalistic as possible...That's partly why his aunt isn't 80 years old; if she's the sister of his dead mother, why does she have to be two generations ahead?\" Carroll added that the creative team was looking for more of a \"big sister\" or someone closer in age to Peter Parker in the casting process. After researching the character, Tomei did make \"a case to age me up, but no they didn't do it\". Tomei felt there was a \"blank slate\" from which she could develop the character, and talked to Watts about May being \"a community organizer or invested in the neighborhood\" to indicate where Peter's values come from.\nRobert Downey Jr. as Tony Stark / Iron Man: A self-described genius, billionaire, playboy, and philanthropist with electromechanical suits of armor of his own invention who is Parker's mentor and the creator of the U.S. Department of Damage Control. Sony Pictures Motion Picture Group chairman Tom Rothman noted that, beyond the commercial advantage of featuring Downey in the film, the inclusion of Stark was important due to the relationship established between him and Parker in Captain America: Civil War. Watts noted that after Stark's actions in Civil War, introducing Parker to life as an Avenger, there are \"a lot of repercussions to that. Is it a first step towards Tony as some sort of mentor figure? Is he comfortable with that?\" Co-writer Jonathan Goldstein compared Stark to Ethan Hawke's father character in Boyhood (2014).Additionally, Gwyneth Paltrow, Kerry Condon, and Chris Evans reprise their roles as Pepper Potts, F.R.I.D.A.Y., and Steve Rogers / Captain America from previous MCU films, respectively. Rogers appears in public service announcements played at Parker's school. Jacob Batalon portrays Parker's best friend Ned, a \"complete gamer\", whom Batalon described as \"the quintessential best guy, the best man, the number two guy, the guy in the chair\" for Parker. Marvel used Ned Leeds as a basis for the character, who does not have a last name in the script or film, but essentially created their own character with him. Carroll said that Ned and other characters in the film are composites of several of their favorites from Spider-Man comics, and while Ned may eventually wind up with the last name \"Leeds\", it is not a certainty. He was later given this surname in the sequel. Laura Harrier portrays Liz, a senior, Parker's love interest, and Toomes' daughter, with a \"type-A\" personality. Tony Revolori plays Eugene \"Flash\" Thompson, Parker's rival and classmate. It was noted that the character is generally depicted as a white bully in the comics; the Guatemalan American actor received death threats upon his casting. Revolori worked hard \"to do him justice\", as he is an important character to the fans. Rather than being a physically imposing jock, Thompson was re-imagined as \"a rich, smug kid\" to reflect modern views of bullying, by crafting him more into a social media bully and rival for Parker opposed to a jock; this depiction was largely informed by Holland's visit to The Bronx High School of Science. Revolori said that Thompson has to work hard to match Parker's intelligence, which is \"one of the reasons he doesn't like Peter. Everyone else seems to like Peter, so he's like, why don't they like me like they like him?\" Revolori gained 60 lb (27 kg) for the role.Garcelle Beauvais portrays Doris Toomes, Adrian's wife and Liz's mother, and Jennifer Connelly provides the voice of Karen, the A.I. in Parker's suit. Hemky Madera appears as Mr. Delmar, the owner of a local bodega. Bokeem Woodbine and Logan Marshall-Green respectively play Herman Schultz and Jackson Brice, both incarnations of Shocker; they are accomplices of Toomes who use modified, vibro-blast shooting versions of Crossbones' gauntlets. Other business partners of Toomes' include: Michael Chernus as Phineas Mason / Tinkerer, Michael Mando as Mac Gargan, and Christopher Berry as Randy. Faculty at Parker's high school include: Kenneth Choi, who previously played Jim Morita in the MCU, as Jim's descendant Principal Morita; Hannibal Buress as Coach Wilson, the school's gym teacher, who he described as \"one of the dumbass characters that don't realize [Parker is] Spider-Man\"; Martin Starr, who reprises his previously unnamed role from The Incredible Hulk (2008), as Mr. Harrington, a teacher and academic decathlon coach; Selenis Leyva as Ms. Warren; Tunde Adebimpe as Mr. Cobbwell; and John Penick as Mr. Hapgood. Parker's classmates include: Isabella Amara as Sally; Jorge Lendeborg Jr. as Jason Ionello; J. J. Totah as Seymour; Abraham Attah as Abraham; Tiffany Espensen as Cindy; Angourie Rice as Betty Brant; Michael Barbieri as Charles; and Ethan Dizon as Tiny. Martha Kelly appears in the film as a tour guide, and Kirk Thatcher makes a cameo appearance as a \"punk\", an homage to his role in Star Trek IV: The Voyage Home. Spider-Man co-creator Stan Lee also has a cameo, as a New York City apartment resident named Gary who witnesses Parker's confrontation with a neighbor. Jona Xiao was cast in an undisclosed role, but did not appear in the final film."}