{"_movieID": "353486", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:37:43", "summary": "Jumanji: Welcome to the Jungle is a 2017 American fantasy adventure comedy film directed by Jake Kasdan and written by Chris McKenna, Erik Sommers, Scott Rosenberg, and Jeff Pinkner, based on a story by McKenna. It is the third installment of the Jumanji franchise, after Zathura: A Space Adventure (2005) and a direct sequel to Jumanji (1995), which was based on the 1981 children's book of the same name by Chris Van Allsburg. It pays tribute to Robin Williams, the star of the first film, by mentioning his character's name. In addition, a replica of the board game piece used by Williams's character also appears as a clue for the Jumanji game's new players. The film stars Dwayne Johnson, Jack Black, Kevin Hart, Karen Gillan, Nick Jonas, and Bobby Cannavale. Set twenty-one years after Jumanji, it follows four teenagers who are transported into the video game world of Jumanji and play as their chosen characters. Joining another player, they must beat the game to return home.\nPrincipal photography began in Honolulu in September 2016 and ended in Atlanta in December. Jumanji: Welcome to the Jungle premiered at the Grand Rex in Paris on December 5, 2017, and was theatrically released in the United States on December 20 in RealD 3D and IMAX formats by Sony Pictures Releasing under its Columbia Pictures label; unlike its predecessor, which was distributed under the TriStar Pictures label. The film received generally positive reviews from critics, who called it a \"pleasant surprise\" and praised the cast. It grossed over $962 million worldwide, becoming the fifth-highest-grossing film of 2017 and the 49th highest-grossing film of all time. A sequel, titled Jumanji: The Next Level, is scheduled to be released on December 13, 2019.", "plot": "In Brantford, New Hampshire (1996), teenager Alex Vreeke is given the Jumanji board game by his father, who found it on a beach after it was thrown into a river by Alan Parrish and Sarah Whittle 27 years earlier. Uninterested, Alex sets the game aside. That night, it transforms into a video game cartridge which catches Alex's attention when he is awakened by the Jumanji drum beats. When he begins playing it, he disappears into the game.\nTwenty years later, four students at Brantford High School are given detention: Spencer Gilpin and his ex-best friend Anthony \"Fridge\" Johnson for cheating, Bethany Walker for making a phone call during class and talking back to her teacher, and Martha Kaply for insulting her gym teacher and refusing to participate. In the school basement, where they are serving their detention, Fridge discovers Alex's discarded video-game system, and he and Spencer decide to play. Although it has five playable characters, they are unable to select the first one, so they choose two others and convince the girls to play as the remaining two. As they begin, the four are sucked into the game.\nThey land in a jungle in the forms of their game avatars. Spencer is a tough, muscular explorer and archaeologist named Dr. Smolder Bravestone. Fridge is a diminutive zoologist named Franklin \"Mouse\" Finbar. Bethany is an overweight male cartographer named Professor Sheldon Oberon. Martha is a female commando and martial arts expert named Ruby Roundhouse. They each have three lives marked on their arms and Bethany immediately loses one after being eaten by a hippo. Spencer deduces that if they lose all three, they die in real life.\nThey learn the game's story from NPC Nigel: corrupt archeologist Russell Van Pelt stole the Jaguar's Eye, a magic jewel, from its shrine, cursing Jumanji. Nigel escaped Van Pelt with the jewel, and the players must return it to a jaguar statue to lift the curse and call \"Jumanji\" to leave the game. Nigel warns them that Van Pelt will stop at nothing to retrieve the jewel, which gives him control of Jumanji's animals; Van Pelt himself is possessed by its power. They begin tackling the game's increasingly-difficult \"levels\", losing lives as they do so. The four are rescued by Alex, the missing fifth player, whose avatar is pilot Jefferson \"Seaplane\" McDonough. Taking shelter in a jungle house built by the game's previous player Alan Parrish, Alex believes that he has been in the game for a few months and is distressed to learn that it has really been twenty years. The newcomers vow to help him return home. They break into a transportation shed, commandeering a helicopter, but Fridge drops the jewel into a herd of rhinos. Spencer sacrifices one of Fridge's lives by pushing him out of the helicopter as a distraction and retrieves the jewel. Alex loses his last life when a mosquito bites him, but Bethany performs CPR and transfers one of her lives to him.\nArriving at a path leading to the statue, the players are surrounded by a pack of jaguars and Van Pelt's forces. They outmaneuver their opposition while Spencer and Martha race to the statue. Van Pelt confronts Martha and demands the jewel, but she purposely gets a snake to bite her, allowing her to respawn and to get the jewel to Spencer. Now on their last lives, the players end the game, with Van Pelt disintegrating into a bunch of rats, and return to the school basement, though without Alex. They find the formerly-dilapidated Vreeke home restored and decorated for a Christmas family gathering. An adult Alex arrives, having returned to 1996 when the game ended. Now married with children, he reveals he named his eldest daughter after Bethany out of gratitude for saving his life.\nThe four are now friends after their experiences in the game. Spencer and Fridge reconcile, Bethany begins caring for others more than herself and plans a summer wilderness backpacking adventure and Martha and Spencer become romantically involved. When they hear Jumanji's drumbeats, they bring the game behind the school, and Fridge destroys it with a bowling ball to prevent anyone from playing it."}