{"_movieID": "284293", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:35:46", "summary": "Still Alice is a 2014 American independent drama film written and directed by Richard Glatzer and Wash Westmoreland and based on Lisa Genova's bestselling 2007 novel of the same name. The film stars Julianne Moore as Alice Howland, a linguistics professor diagnosed with familial Alzheimer's disease shortly after her 50th birthday. Alec Baldwin plays her husband, John, and Kristen Stewart, Kate Bosworth and Hunter Parrish play her children, Lydia, Anna and Tom.\nGlatzer and Westmoreland were approached by Lex Lutzus and James Brown to adapt Genova's novel in 2011, when Glatzer had just been diagnosed with amyotrophic lateral sclerosis (ALS). Moore was their first choice for the lead role; she researched Alzheimer's disease for four months to prepare for the part. The film was shot in New York in March 2014, with a budget of $4 million.\nStill Alice had its world premiere at the 2014 Toronto International Film Festival on September 8, 2014. It was one of several films stolen in the Sony Pictures hack incident and leaked online on November 27, 2014. The film was released theatrically on January 16, 2015, and grossed $43.9 million at the international box office. It received critical acclaim, particularly for the performance given by Moore, who won numerous awards including the Academy Award for Best Actress. She dedicated her Academy Award win to Glatzer, who died from ALS in March 2015. The film was named among the year's top ten independent films by the National Board of Review.", "plot": "Alice Howland, a linguistics professor at Columbia University, celebrates her 50th birthday with her physician husband John and their three adult children. After she forgets a word during a lecture and becomes lost during a jog on campus, Alice's doctor diagnoses her with early onset familial Alzheimer's disease. Alice's eldest daughter, Anna, and son, Tom, take a genetic test to find out if they will develop the disease. Alice's younger daughter Lydia, an aspiring actress, decides not to be tested.\nAs Alice's memory begins to fade, she daydreams of her mother and sister, who died in a car crash when she was a teenager. She memorizes words and sets a series of personal questions on her phone, which she answers every morning. She hides sleeping pills in her room, and records a video message instructing her future self to commit suicide by overdosing on the pills when she can no longer answer the questions. As her disease advances, she becomes unable to give focused lectures and loses her job. She becomes lost searching for the bathroom in her own home and does not recognize Lydia after seeing her perform in a play.\nJohn is offered a job at the Mayo Clinic in Minnesota. Alice asks him to postpone accepting the job, but he feels this is impossible. At her doctor's suggestion, Alice delivers a speech at an Alzheimer's conference about her experience with the disease, using a highlighter to remind herself which parts of the speech she has already spoken, and receives a standing ovation.\nAlice begins to have difficulty answering the questions on her phone. She loses the phone and becomes distressed; John finds it a month later in the freezer, but Alice thinks it has only been missing for a day. Alice and John visit Anna in the hospital to meet their newborn twin grandchildren, but Alice doesn't recognize her daughter.\nAfter a video call with Lydia, Alice inadvertently opens the video with the suicide instructions. With some difficulty, she finds the pills and is about to swallow them, but when she is interrupted by the arrival of her caregiver, she drops the pills on the floor and forgets what she was doing.\nJohn, unable to watch his wife continue to deteriorate, moves to Minnesota. Lydia, who has been living in California, moves back home to care for Alice. Lydia reads her a section of the play Angels in America and asks her what she thinks it is about. Alice, barely able to speak, responds with a single word: \"love\".", "cast": "Julianne Moore as Alice Daly Howland\nAlec Baldwin as John Howland\nKristen Stewart as Lydia Howland\nKate Bosworth as Anna Howland-Jones\nHunter Parrish as Tom Howland\nShane McRae as Charlie Jones\nStephen Kunken as Dr. Benjamin\nVictoria Cartagena as Professor Hooper\nSeth Gilliam as Frederic Johnson\nDaniel Gerroll as Eric Wellman\nErin Darke as Jenny\nKristin Macomber as Anne\nCaridad Montanez as Elena\nEha Urbsalu as Mrs. Daly, Alice's mother (in flashbacks)"}