{"_movieID": "244458", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:28:06", "summary": "The Voices is a 2014 black comedy horror film directed by Marjane Satrapi, written by Michael R. Perry, and starring Ryan Reynolds, Gemma Arterton, Anna Kendrick and Jacki Weaver. It had its world premiere at 2014 Sundance Film Festival on January 19, 2014. The film was released in a limited release and through video on demand on February 6, 2015, by Lionsgate. It received positive reviews from critics.", "plot": "Jerry (Ryan Reynolds) is an upbeat man who works at a bathtub factory, and lives in a modified apartment above a bowling alley with his dog, Bosco, and his cat, Mr. Whiskers. Jerry is a schizophrenic who chooses not to take his medication and enjoys delusions and hallucinations that manifest in the form of his pets talking to him. Bosco often represents his good intentions while Mr. Whiskers represents his more violent nature. Jerry has a workplace crush on an English woman named Fiona. She stands him up to go to a karaoke party with two other women from work, Lisa and Alison. Fiona's car doesn't start, leading her to flag down Jerry as he drives by. Jerry accidentally hits a deer which crashes through his windshield. Jerry's hallucinations show the deer convincing Jerry to cut its throat. Jerry does as told. Fiona, terrified, runs off into the woods. Jerry chases her to explain but ends up tripping over Fiona, and accidentally stabbing her. As Fiona starts gurgling blood, Jerry tearfully apologizes for hurting her and says that he loves her. To end her pain, Jerry stabs her again, and she dies.\nUpon returning home, Bosco suggests he has to go to the police and confess, while Mr. Whiskers says there is no shame in killing, but insists Jerry needs to dispose of the body. Jerry collects Fiona's body but leaves a bloody shoe and pile of organs. He dismembers Fiona, placing her innards in numerous Tupperware containers and her severed head inside his fridge. His delusions increase and Fiona's head comes to life and starts talking to Jerry. Jerry apologizes about Fiona's death. Fiona doesn't approve and tells him about the good life she's had before she died. Fiona then demands Jerry take his medication. Jerry takes his pills, and the next day, he experiences nightmares of his abusive past. When he wakes up his hallucinations have ended; his pets no longer speak to him, his apartment is a mess, with animal waste littering the floor, garbage, and blood all over his kitchen. Fiona's head is cold and rotting. He throws away the pills in terror, and the next morning, his hallucinations return and his happy life is back to 'normal'. Fiona tries to convince Jerry to kill another person so she has a friend.\nJerry asks Lisa on a date. He takes her to his abandoned childhood home, where it is revealed his German mother had admitted to her insanity and was about to be taken away by the authorities when he was a child. When they arrived, she decided to commit suicide by trying to slit her throat, but couldn't do it herself and so she begged Jerry to finish the job to end her suffering. The police found Jerry standing over his dead mother and he was committed instead. Jerry sobs in front of Lisa, who comforts him. They go to her house and spend the night together.\nLisa goes to Jerry's house. She wanders in and discovers the state of the apartment including all the contained guts, blood stains, and Fiona's severed head covered. Despite pressure from Mr. Whiskers, Jerry refuses to kill her. Jerry tries to explain the corpse meat but Lisa flees and hides into the bathroom. When Jerry breaks in, Lisa starts hitting him with a towel hanger and runs to his room. Jerry tries to calm her with an apology, which she seems to accept. When she tries to escape, Jerry throws her onto the bed, causing the back of her neck to hit a shelf, badly breaking it. After she dies, Jerry removes her head and places it in the fridge, next to Fiona's. Other workers begin to realize Fiona and Lisa have gone missing. When Alison goes to Jerry's house, Jerry immediately kills her, taking her head as well.\nJerry confesses his killings to his counselor Dr. Warren. She tries to call the police, but he takes her hostage into the countryside and forces her to help him. She calms him down and shows understanding. Meanwhile, the other workers from accounting break into Jerry's home, while Bosco runs away, and immediately retreat to call the police. Shortly after Jerry returns home, still holding Warren hostage, the police surround his house and prepare to move in. Jerry flees down into the basement, breaking a gas pipe while doing so. After rescuing Dr. Warren, the police are knocked back from a huge explosion caused by the gas leak.\nJerry realizes the bowling alley is on fire and he is in grave danger. The voices of Bosco and Mr. Whiskers speak to him in his own mind. Mr. Whiskers insists that he get out of there and find another place to live, to hide, so that he may continue killing and feeling alive. However, Bosco tells him that there is no place for him in life any longer and that he should let the fire \"put him to sleep\". Choosing to stay and end his own misery, he lies down and waits until he blacks out from the smoke.\nIn a white void, Bosco and Mr. Whiskers confess that, despite their opposing beliefs, they did like each other, before going their separate ways. Jerry then appears with his parents, Fiona, Lisa and Alison, and he apologizes to the women for killing them. Jesus appears, and they all dance and sing together. In the end, Jesus ascends Jerry in a forklift.", "cast": "Ryan Reynolds as Jerry Hickfang and the voices of Bosco, Mr. Whiskers, The Deer and Bunny Monkey\nGulliver McGrath as young Jerry\nAnna Kendrick as Lisa\nGemma Arterton as Fiona\nJacki Weaver as Dr. Warren\nSam Spruell as Dave\nAdi Shankar as John and Jesus\nElla Smith as Alison\nPaul Chahidi as Dennis Kowalski\nStanley Townsend as Sheriff Weinbacher\nValerie Koch as Jerry's mother\nPaul Brightwell as Jerry's stepfather\nAlessa Kordeck as Sheryl\nStephanie Vogt as Tina TV"}