{"_movieID": "175574", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:45:23", "summary": "Free Birds is a 2013 American 3D computer-animated comedy film about two turkeys traveling back in time to prevent Thanksgiving. It was produced by Reel FX Creative Studios as its first theatrical fully animated feature film. Jimmy Hayward directed the film, which he also co-wrote with Scott Mosier, the film's producer. The film stars the voices of Owen Wilson, Woody Harrelson and Amy Poehler with supporting roles done by George Takei, Colm Meaney, Keith David, and Dan Fogler. Originally titled Turkeys, and scheduled for 2014, the film was released on November 1, 2013, by Relativity Media. The film earned $110 million on a $55 million budget.         \nFree Birds was Relativity Media's second animated movie after 9 (2009 animated film).", "plot": "Reggie is a turkey who has always feared Thanksgiving because turkeys have always been on the menu, but his incessant attempts to warn his flock have made him an outcast. When the other turkeys finally realize what is happening, they thoughtlessly throw Reggie outside in an attempt to save themselves. To his surprise, he is named the \"pardoned turkey\" by  the President and is subsequently taken to Camp David. Although initially hesitant, Reggie soon eases into a routine of doing nothing but enjoying pizza from the \"Pizza Dude\" and watching Mexican telenovelas.\nReggie is kidnapped by Jake, a member of the Turkey Freedom Front, who tells him that \"The Great Turkey\" told him to find Reggie and take him back to the first Thanksgiving with him to take turkeys off the menu. They steal a time machine controlled by an A.I. named S.T.E.V.E (Space Time Exploration Vehicle Envoy). Jake instructs S.T.E.V.E. to time-travel back to the same day in 1621, three days before the first Thanksgiving. Once there, they are ambushed by colonial hunters led by Myles Standish, but they are quickly rescued by native turkeys led by Chief Broadbeak and his two children, Ranger and Jenny.\nBroadbeak explains that the turkeys in the area have been forced underground since the settlers came and that they cannot risk fighting back without the settlers taking them. The next day, Broadbeak orders Jake and Ranger to spy on the settlers while Reggie and Jenny spring all the humans' hunting traps. Despite initial hostility, Ranger and Jake find out that the settlers have already begun preparations for Thanksgiving and where they keep their weapons. Meanwhile, Jenny is unconvinced Reggie is from the future, but is impressed with his accidental unorthodox way of springing the traps. However, they are soon intercepted by Standish and Reggie is forced to send her into orbit aboard the time machine, validating everything he said. Reggie asks Jenny to go back to the future with him once everything blows over, but she refuses to leave the flock no matter how much she likes him. Jake then drags Reggie away and tells him he has a plan to attack the settlers. However, Reggie has become sick of all his improbable stories and threatens to leave.\nDesperate, Jake tells him that this trip was more about him making up for his failure to save turkey eggs while escaping a factory farm when he was young, maintaining that the Great Turkey convinced him to go through with this. While still reluctant to believe what he said, Reggie still goes along with the plan. They blow up the weapons shack, but Jake inadvertently leaves a gunpowder trail back to the turkeys' hideout. Standish and his men flush the turkeys out from underground, capturing enough for the feast; Broadbeak sacrifices his life to help the remaining turkeys escape. Disgraced, Reggie returns home, where he discovers from S.T.E.V.E. that he is the Great Turkey. He travels back in time to send the young Jake on his mission. Jenny is sworn in as the new chief and orders the remaining turkeys to prepare an attack on the settlers.\nJenny, Jake and Ranger lead the turkeys in an attack on the settlement just as Chief Massasoit and his tribe arrive. Inspired, Reggie goes back in time to stop the attack, inadvertently trapping Standish in the time stream. Through S.T.E.V.E. and the Pizza Dude, Reggie convinces the settlers and Indians that pizza is a more acceptable food than turkeys, taking them off the Thanksgiving menu entirely. Reggie stays with Jenny while Jake takes S.T.E.V.E. in order to look for new adventures.\nIn the mid-credits, Jake returns moments after leaving Reggie and Jenny. With a chicken and duck in his wings, Jake starts to tell every turkey present about the turducken.", "cast": "Owen Wilson as Reggie, a domesticated turkey who is pardoned by the President of the United States and is dragged into Jake's plot.\nWoody Harrelson as Jake, a wild turkey and the president of the Turkey Freedom Front.\nAmy Poehler as Jenny, a wild turkey and Reggie's love interest.\nGeorge Takei as S.T.E.V.E., the artificial intelligence of the time machine.\nColm Meaney as Myles Standish, a pilgrim hunter.\nKeith David as Chief Broadbeak, the chief of the native wild turkeys, domesticated turkeys, and ocellated turkeys and Jenny's father.\nDan Fogler as Governor William Bradford, the governor of the Plymouth colony.\nJimmy Hayward as President of the United States, Ranger, Leatherbeak, Hazmats and additional voices\nKaitlyn Maher as President's daughter\nCarlos Alazraqui as Amos\nJeff Biancalana as General Sagan, Hazmats and additional voices\nDanny Carey as Danny\nCarlos Ponce as Narrator, Alejandro\nRobert Beltran as Chief Massasoit, the leader of the Wampanoags.\nLesley Nicol as Pilgrim Woman\nJason Finazzo as Chrononaut One and additional voices\nScott Mosier as Pizza Dude and additional voices\nLauren Bowles as Jake's Mother\nDwight Howard as Cold Turkey\nJosh Lawson as Gus"}