{"_movieID": "51999", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:48:34", "summary": "Perfect Sense, formerly known as The Last Word, is a 2011 science fiction drama film directed by David Mackenzie and written by Kim Fupz Aakeson, starring Eva Green and Ewan McGregor.  Scenes were shot in various locations around Glasgow, Mexico City and Kenya. The film premiered at the 2011 Sundance Film Festival.\n\n", "plot": "An epidemic begins to spread throughout the globe, causing humankind to lose their sensory perceptions one by one. The story focuses on two people: Susan, one of a team of epidemiologists who are trying to find the causes of the disease, and Michael, a chef who works at a busy restaurant located next to Susan's flat. The two meet and get to know each other as the epidemic progresses, a relationship which soon turns to love.\nHumans begin to lose their senses one at a time. Each loss is preceded by an outburst of an intense feeling or urge. First, people begin suffering uncontrollable bouts of crying and this is soon followed by the loss of their sense of smell. An outbreak of irrational panic and anxiety, closely followed by a bout of frenzied gluttony, precedes the loss of the sense of taste. The film depicts people trying to adapt to each loss and trying to carry on living as best they can, rediscovering their remaining senses as they do so. Michael and his co-workers do their best to cook food for people who cannot smell nor taste.\nThe loss of hearing comes next and is accompanied by an outbreak of extreme anger and rage. Michael experiences it first and is verbally abusive at Susan who flees in fear, losing her own hearing shortly afterwards. Despite her knowledge that it was the disease that caused the outburst, Susan cannot face Michael again. People struggle to adjust and to go on living. One day, every person on Earth suddenly experiences a feeling of joyful euphoria. Susan realizes she both forgives and still loves Michael and rushes to his job. The two find each other and embrace just as they, and the rest of the world, become blind."}