{"_movieID": "60747", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:11:00", "summary": "Red Dawn is a 1984 American war film directed by John Milius, with a screenplay by Kevin Reynolds and Milius. It stars Patrick Swayze, Charlie Sheen, C. Thomas Howell, Lea Thompson, Jennifer Grey, Ben Johnson, Harry Dean Stanton, Ron O'Neal, William Smith, and Powers Boothe. It was the first film to be released in the US with a PG-13 rating (under the modified rating system introduced on July 1, 1984).\nThe film is set in an alternate history timeline in which the United States is invaded by the Soviet Union and its Cuban and Nicaraguan allies. However, the onset of World War III is in the background and not fully elaborated. The story follows a group of American high school students who resist the occupation with guerrilla warfare, naming themselves \"Wolverines\", after their high school mascot.", "plot": "The United States has gradually become strategically isolated after several European nations (except the United Kingdom) withdraw from NATO. At the same time, the Soviet Union and its Warsaw Pact partners aggressively expand their sphere of influence. In addition, the Ukrainian wheat harvest fails while a communist coup d'etat occurs in Mexico.\nOn a September morning, in the small town of Calumet, Colorado, a local high school teacher pauses when he sees Soviet paratroopers landing in a nearby field. The paratroopers open fire when the teacher confronts them. Pandemonium follows as students flee amid heavy gunfire. In downtown Calumet, Cuban and Soviet troops are trying to impose order after a hasty occupation. Cuban Colonel Bella instructs the KGB to go to a local sporting goods store and obtain the records of the store's gun sales on the ATF's Form 4473, which lists citizens who have purchased firearms.\nBrothers Jed and Matt Eckert, along with their friends Robert Morris, Danny, Daryl Bates, and Arturo \"Aardvark\" Mondragon, flee into the wilderness after hastily equipping themselves at the sporting goods store owned by Robert's father. While on the way to the mountains, they run into a Soviet roadblock, but are saved by an attacking U.S. Army UH-1 helicopter gunship. After several weeks in the forest, they sneak back into town; Jed and Matt learn that their father is being held in a re-education camp. They visit the site and speak to him through the fence, and learn that their mother is already dead; Mr. Eckert orders his sons to avenge his inevitable death and that of his wife.\nThe kids visit the Masons and learn that they are behind enemy lines in \"occupied America\". Robert's father is revealed to have been executed because of the missing inventory from his store. The Masons charge Jed and Matt with taking care of their two granddaughters, Toni and Erica. After killing Soviet soldiers in the woods, the youths begin an armed resistance against the occupation forces, calling themselves \"Wolverines\", after their high school mascot. The occupation forces initially try reprisal tactics, executing groups of civilians following every Wolverine attack. During one of these mass executions, the fathers of Jed, Matt, and Aardvark are killed. Daryl's father, Mayor Bates, is a collaborator and tries to appease the occupation authorities. Despite the reprisal tactics the occupation forces get nowhere.\nThe Wolverines find a downed American pilot, Lt. Col. Andrew Tanner, who informs them of the current state of the war: several American cities, including Washington, D.C., were destroyed by nuclear strikes; the Strategic Air Command was crippled by Cuban saboteurs; and paratroopers were dropped from fake commercial airliners to seize key positions in preparation for subsequent assaults via Mexico and Alaska. The middle third of the U.S. has been taken over, but American counterattacks have halted Soviet advances along the Rocky Mountains and the Mississippi River and the lines have stabilized. The only remaining U.S. allies, the UK and People's Republic of China, are militarily crippled. Concerned about nuclear fallout, both sides refrain from the further use of nuclear weapons.\nTanner assists the Wolverines in organizing raids against the Soviets. Soon after, in a visit to the front line, Tanner and Aardvark are killed in the crossfire of a tank battle. Daryl is caught by the Soviets after being turned in by his collaborating father. Using threats of torture, KGB officers force Daryl to swallow a tracking device, then release him to rejoin the guerrillas. Spetsnaz are sent into the mountains carrying portable radio triangulation equipment, but are ambushed by the Wolverines. The group trace the source of the signal to Daryl, who confesses and pleads for mercy, but is executed by Robert, along with a captured Soviet soldier.\nThe remaining Wolverines are ambushed by Mi-24 helicopter gunships, and Robert and Toni are killed. Jed and Matt attack the Soviet headquarters in Calumet to distract the troops while Danny and Erica escape. The plan works, but Jed and Matt are mortally wounded. Though Colonel Bella comes across the brothers, he is unable to bring himself to kill them and lets them go. The brothers reach a bench in the park where they spent time as kids, holding each other as they die. Meanwhile, Danny and Erica trek through the Rocky Mountain Wilderness. They reach the frontier of Free America.\nIn the closing scene, a plaque is seen with Partisan Rock in the background. The rock is fenced off and an American flag flies nearby. The plaque reads:\n\n... In the early days of World War III, guerrillas – mostly children – placed the names of their lost upon this rock. They fought here alone and gave up their lives, so \"that this nation shall not perish from the earth.\""}