{"_movieID": "389015", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:44:12", "summary": "I, Tonya is a 2017 American biographical film directed by Craig Gillespie and written by Steven Rogers. It follows the life of figure skater Tonya Harding and her connection to the 1994 attack on her rival Nancy Kerrigan. The film states that it is based on \"contradictory\" and \"true\" interviews with Tonya Harding and her ex-husband Jeff Gillooly, suggesting they are unreliable narrators. It features darkly comedic interviews with the characters in mockumentary-style, set in the modern day, and breaks the fourth wall. Margot Robbie (who also co-produced) stars as Harding, Sebastian Stan plays Harding's husband Jeff Gillooly, and Allison Janney plays Harding's mother LaVona Golden; Julianne Nicholson, Caitlin Carver, Paul Walter Hauser, and Bobby Cannavale also star.\nBased very loosely on real events, the movie depicts Harding as a victim, ignoring the evidence which implicated her criminally, as well as other criticism of her actions. I, Tonya premiered at the Toronto International Film Festival on September 8, 2017, and was theatrically released in the United States on December 8, 2017, and grossed $53.9 million worldwide on an $11 million budget. It received positive reviews, with major praise drawn towards Robbie and Janney's performances.\nAt the 90th Academy Awards, Janney won for Best Supporting Actress, while the film also earned nominations for Best Actress for Robbie and Best Film Editing. It earned three nominations at the 75th Golden Globe Awards, winning Best Supporting Actress for Janney, and at the 24th Screen Actors Guild Awards, it won Outstanding Performance by a Female Actor in a Supporting Role for Janney and was nominated for Outstanding Performance by a Female Actor in a Leading Role (Robbie). At the 71st British Academy Film Awards, the film earned five nominations, winning Best Actress in a Supporting Role for Janney.", "plot": "In 1970s Portland, Oregon, four year-old Tonya Harding is forced to ice skate by her abusive mother, LaVona Golden. As Tonya grows up, her parents take her out of school to focus on her skating career, as she trains under coach Diane Rawlinson. Tonya rapidly becomes one of the best figure skaters in the United States, but is held back by her \"white trash\" reputation, home-made costumes and unconventional choice of performance music (ZZ Top). At 15, she begins dating 18-year-old Jeff Gillooly. They marry, but Jeff becomes abusive. When LaVona scorns Tonya for putting up with it, Tonya blames LaVona for her raising her badly.\nAfter a dispute with Diane, Tonya fires her and hires Dody Teachman as her new coach. Tonya becomes the first female figure skater to complete two triple Axel jumps in competition. At the 1992 Winter Olympics, Tonya fails to stick her landings and finishes fourth. Defeated, she moves in again with Jeff and takes a job as a waitress, but Diane convinces her to train for the 1994 Winter Olympics. On the day of her November 1993 competition at the Northwest Pacific Regional Championships in Portland, Tonya receives a death threat and chooses not to compete. In retaliation, Jeff instructs his friend Shawn Eckardt to send death threats to Tonya's rival Nancy Kerrigan. Tonya makes a phone call trying to locate Kerrigan's training arena and her practice times. Eckardt hires two inept crooks to attack Kerrigan after a practice session in Detroit. On January 6, 1994, Eckardt's henchmen strike Kerrigan's knee; she cannot compete at the next day's National competition. The hired henchmen are arrested.\nEckardt's bragging quickly leads the FBI to him. He blames Jeff, who is horrified to learn that Eckardt gave orders beyond sending the letters. Tonya qualifies for the Olympic team but realizes she will be found guilty by association. She goes to the FBI and tells them what Jeff and Eckardt did, but they show her interview transcript to Jeff after his arrest, and he races home to confront her. She briefly speaks to Jeff, then climbs out the window, leaving him for good. Jeff later implicates Tonya, saying she knew about the attack.\nLaVona visits Tonya and offers her kind words; however, when LaVona asks if Tonya knew anything about the crime, Tonya realises she is wearing a wire and throws her mother out. Jeff, Eckardt, and the henchmen are charged, with Tonya's hearing postponed until after the Olympics. Tonya finishes eighth and Nancy Kerrigan wins the silver medal. Tonya avoids jail but is banned from competitive figure skating for life. Heartbroken, she begs the judge to give her jail time but not to take away the one thing she knows how to do; the judge refuses. \nJeff acknowledges that he ruined Tonya's career. He changes his name, remarries, opens a hair salon, divorces, and remarries. LaVona moves to Washington state and has no contact with Tonya either. Tonya remarries, divorces, takes up professional boxing, and becomes a landscaper, house painter and deck builder. She now lives happily with her seven-year-old son and third husband.", "cast": "Margot Robbie as Tonya Harding\nTonya Harding as old Tonya Harding\nMckenna Grace as young Tonya Harding\nMaizie Smith as Tonya Harding (age 4)\nSebastian Stan as Jeff Gillooly, Harding's lover and friend, later husband\nAllison Janney as LaVona Golden, Harding's abusive mother\nJulianne Nicholson as Diane Rawlinson, Harding's skating coach and Bob's wife\nCaitlin Carver as Nancy Kerrigan, Harding's skating rival and Olympic teammate, and the victim of the 1994 attack\nBojana Novakovic as Dody Teachman, another of Harding's coaches\nPaul Walter Hauser as Shawn Eckardt, a bodyguard and friend of Gillooly\nBobby Cannavale as Martin Maddox, a former reporter\nDan Triandiflou as Bob Rawlinson, Diane's husband and Tonya's attorney\nRicky Russert as Shane Stant, hired by Jeff and Shawn to attack Nancy\nAnthony Reynolds as Derrick Smith, Stant's uncle, previous friend of Eckardt, first hired to attack Nancy before recruiting Shane himself to injure her"}