{"_movieID": "270487", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:56:01", "summary": "Hail, Caesar! is a 2016 comedy film written, produced, edited, and directed by Joel and Ethan Coen. The film stars Josh Brolin, George Clooney, Alden Ehrenreich, Ralph Fiennes, Jonah Hill, Scarlett Johansson, Frances McDormand, Tilda Swinton, and Channing Tatum. It is a fictional story that follows the real-life fixer Eddie Mannix (Brolin) working in the Hollywood film industry in the 1950s, trying to discover what happened to a cast member who vanished during the filming of a biblical epic.\nFirst talked about by the Coens in 2004, Hail, Caesar! was originally set to take place in the 1920s and to follow actors performing a play about ancient Rome. The Coens shelved the idea until late 2013. Principal photography began in November 2014 in Los Angeles, California.\nThe film premiered in Los Angeles on February 1, 2016, and was released in the United States on February 5, 2016. It grossed $63 million worldwide and received positive reviews. The film was chosen by National Board of Review as one of the top ten films of 2016 and it received nominations at the 89th Academy Awards and 70th British Academy Film Awards, both for production design.", "plot": "In 1951 Hollywood, Eddie Mannix is head of physical production at Capitol Pictures. His duties as the studio \"fixer\" find him corraling its scandalous stars, fending off twin gossip columnists Thora and Thessaly Thacker, and weighing an impressive job offer from the Lockheed Corporation. When unmarried synchronized swimming actress DeeAnna Moran becomes pregnant, Mannix arranges for her to place the baby in foster care then discreetly adopt it, preserving her image.\nBaird Whitlock, the dimwitted star of the studio's major production Hail, Caesar! A Tale of the Christ, is drugged and abducted. He awakens at a meeting of The Future, a group of Communist screenwriters, and is won over to their cause. The Future send a ransom note demanding $100,000 for Whitlock's return, which Mannix procures from the studio as “petty cash”. He convinces Thora to withhold a story in exchange for information on singing Western film star Hobie Doyle.\nDoyle has been hopelessly cast in a comedy of manners and, despite the efforts of director Laurence Laurentz, cannot overcome his thick Southern American accent. When Laurentz requests Doyle's removal, Mannix convinces him to continue his coaching. Doyle admits to Mannix his trepidation about the role, but Mannix reassures him and confides in him about Whitlock's kidnapping.\nThat evening, Doyle attends the premiere of his new Western with starlet Carlotta Valdez, as arranged by Mannix. The pair are accosted by the Thacker sisters, but Doyle spots the briefcase of ransom money, carried by musical star Burt Gurney.\nMannix and Moran meet with surety agent Joseph Silverman, a trusted scapegoat for the studio, who agrees to foster Moran's child. His dependability proves immensely attractive to Moran.\nDoyle follows Gurney to The Future's beach house but finds only Whitlock inside. The Future have taken Gurney to rendezvous with a Soviet submarine and defect to Russia, but lose the briefcase in the ocean. Doyle returns Whitlock to the studio as the police arrive to arrest the group.\nMannix smacks Whitlock to stop his blathering in his newfound Communist jargon, but then orders him to \"go out and be a star\" and finish Hail, Caesar! The next morning, Mannix learns that Moran has married Silverman. Mannix rejects the Lockheed offer and decides to remain at Capitol Pictures. Thora informs him that her column will reveal Whitlock won his role by having sex with Laurentz. However, Mannix persuades her not to run the story as her source, Gurney – being a Communist defector – will tarnish her reputation. Mannix moves on, confident in his role in life."}