{"_movieID": "65759", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:45:47", "summary": "Happy Feet Two (or Happy Feet 2) is a 2011 computer-animated family film directed, produced and co-written by George Miller. It is the sequel to the 2006 film Happy Feet, and features an ensemble voice cast that includes Ava Acres, Elijah Wood, Hank Azaria, Robin Williams, Sofia Vergara, Alecia Moore, Meibh Campbell, Lil' P-Nut, Brad Pitt, Matt Damon, Common, Hugo Weaving, Richard Carter, Magda Szubanski, and Anthony LaPaglia. In this movie, Erik, the son of Mumble and Gloria, must stop the Apocalypse from bringing over Antarctica.\nKennedy Miller Mitchell and Dr. D Studios from Sydney, Australia, produced the film, which premiered in North American theaters on November 18, 2011 in Digital 3D and IMAX 3D. The film was released with a Looney Tunes short called I Tawt I Taw a Puddy Tat starring Sylvester Cat and Tweety Bird. A different short, \"Daffy's Rhapsody\", was slated to premiere with this movie, and was switched in production. \"Daffy's Rhapsody\" instead premiered with Journey 2: The Mysterious Island in 2012.  The film received mixed reviews and grossed just $150 million against its $135 million budget, becoming a box office bomb and resulting in the closure of Miller's Dr. D Studios.", "plot": "An evil iceberg is plotting to destroy Antarctica. Meanwhile, Erik, son of the penguins Mumble and Gloria, is unable to dance like the other penguins. Erik and his two best friends, Bodicea and Atticus, follow Ramón to Adélie-Land and find that Adélie-Land has been ruled by a puffin con artist named the Mighty Sven, who survived the loss of his native fishing grounds due to his \"miraculous\" ability to fly and hired Lovelace the Rockhopper as his partner in-crime. Sven and Lovelace choose Erik to stop the apocalypse of Antarctica and tell the others that they were saved by humans. The two eventually flee (under Sven's mistaken assumption that the humans were going to eat them) and end up on Antarctica, where Sven performs his first miracle by revealing moss to the local penguins. Sven uses his power of \"Sven Think\" to help Ramón find a mate. Ramón instantly falls in love with Carmen, another Adélie penguin who is uninterested. Mumble follows the chicks' footprints to Adélie-Land and orders them to return to Emperor-Land, but they refuse. Sven sends Erik back to Emperor-Land with Mumble.\nMeanwhile, a couple of krill are in the midst of a swarm. Will is an adventurous and existentialist krill determined to discover what lies beyond the swarm. His implied partner, Bill, reluctantly follows him to ensure his safety. Once separated from the swarm, Will and Bill realize that krill are at the bottom of the food chain, created to be eaten. Inspired, Will ventures out to evolve and \"move up the food chain\" by eating a real creature instead of being eaten.\nMumble tells Erik that he is unique to the world and that he will someday find his calling, but Erik is oblivious. While trying to cross a perilous ice bridge, the penguins encounter Elephant Seal Bryan the Beach Master and his two young sons, who refuse to let the penguins pass. Suddenly the ice gives away and Bryan is trapped in a deep crevice below the ice. Mumble sets out to free Bryan by luring a leopard seal to chase him down. Seeking acceptance from Erik, Mumble is devastated to learn Erik attributed the feat of courage to Sven Think. Bryan returns to the southern elephant seal beach.\nWhen the penguins return to Emperor-Land they discover that a large iceberg has trapped the emperor penguin population below large walls of ice. The Amigos and the Adélie penguins to bring fish to the doomed Emperor penguins. Meanwhile, Mumble, Erik and Atticus deliver meager supplies of fish to the trapped penguins. Erik attempts to deliver a fish to Gloria by flying and nearly tossing himself over the edge of the iceberg. Mumble scolds Erik for his beliefs, saying that no penguin can fly and that none of the emperor penguins will be able to escape. Gloria sends Mumble off to hunt for fish, calming Erik and the rest of the hysterical Emperor-Land. In the process, Bill becomes inspired to create another swarm of krill but Will refuses, preferring to adhere to his new predator lifestyle.\nThe next morning, a large flock of skua attack the trapped Emperor-Land. Noah the Elder encourages the penguins to stand up to the birds through perseverance and unity. When all hope seems lost, Bo returns with the entire Adélie-Land, led by Sven, to aid the trapped emperor penguins. Sven orchestrates a cooperative effort to feed the trapped emperor penguins through hunting and bringing back a flow of fish from the sea. Meanwhile, Will becomes increasingly agitated with Bill's behavior and leaves him into the Adélie feeding swarm, to join \"fellow predators\". In the process he is attached to a fish carried by Sven and down into the trapped Emperor-Land.\nThe humans who saved Sven and Lovelace come to Antarctica again to help the penguins find a way out. However, a blizzard approaches and causes the humans to flee and not return. Erik urges Sven to teach the penguins how to fly, but Sven reveals that he is not a penguin but a Tufted puffin. Mumble, after watching snow fall into a crevice between chunks of iceberg, begins to tap-dance on the ice and lead the Adélie penguins in a dance to force snow between the ice and weaken it. The plan works until several chunks break loose, sending Bo, Atticus, and a portion of the Adélies as well as several chinstrap, little blue and Magellanic penguins into the doomed crevice. Erik and Lovelace tumble towards the edge, and Mumble grabs the thread from Lovelace's vest. The thread snaps and Lovelace falls on Sven. Mumble and the Amigos pull on the thread that Erik is holding onto and pull him up but Mumble injures his foot, unable to dance and lead the Adélies. Ramón realizes Carmen is trapped below and, risking his own life, jumps off the iceberg to be with her and professes their love to each other. Sven becomes aware of the dancing and proves himself to be a worthy dancer despite public outcry against him. He leads the remaining Adélies in dance while Erik and Mumble venture off to the elephant seal beach. Meanwhile, Will went back in search of Bill and reunited with all others.\nMumble and Erik arrive at Elephant Seal Beach where Bryan is in the middle of a fight of dominance between another large male. Mumble pleads to the elephant seals to help free the emperor penguins. Hesitant to return a favor at such a pivotal time of the year, Bryan declines. Using his singing abilities, Erik commends Mumble for his bravery and lectures Bryan for his lack of kindness. The elephant seals travel en-masse to Emperor-Land. The emperor penguins and the seals begin slamming the ice to the beat of Queen's song Under Pressure, joined by Will, Bill, their krill swarm, the Amigos, Carmen, Lovelace and the newly-reformed Sven. Finally, the iceberg crumbles enough for the emperor penguins to climb out of the crevice and reunite with their families.", "cast": "Ava Acres as Erik, only son of Gloria and Mumble and Memphis and Norma Jean's grandson. (singing by E.G. Daily)\nElijah Wood as Mumble, husband of Gloria and father of Erik\nHank Azaria as The Mighty Sven, a tufted puffin who speaks in a Scandinavian accent and is a small-time con artist. He is also the ruler of Adélie lands.\nRobin Williams, Carlos Alazraqui, Johnny A. Sanchez, Lombardo Boyar and Jeffrey Garcia as Ramón, Nestor, Raul, Lombardo, and Rinaldo (aka the Amigos), a quintet of laid-back and comical Adélie penguins who speak in thick Spanish-accents. This was Williams' last animated feature before his death in 2014\nWilliams also provides the voice of Lovelace, a goofy rockhopper penguin and Sven's partner in crime. He is also this film's narrator, like the first film.\nSofia Vergara as Carmen, Ramón's love interest\nAlecia Moore (P!nk) as Gloria, wife of Mumble and mother of Erik (replacing Brittany Murphy)\nMeibh Campbell as Bodicea \"Bo\", daughter of Miss Viola, and Erik's best friend. (singing by E.G. Daily)\nBenjamin \"Lil' P-Nut\" Flores Jr. as Atticus, son of Seymour, and Erik's best friend.\nBrad Pitt as Will the Krill\nMatt Damon as Bill the Krill\nCommon as Seymour (Atticus's father) (replacing Fat Joe)\nHugo Weaving as Noah the Elder\nRichard Carter as Bryan the Beach Master\nMagda Szubanski as Miss Viola (Bo's mother)\nAnthony LaPaglia as Alpha Skua\nJai Sloper and Oscar Beard as Weaner Pups\nDanny Mann as Brokebeak\nLee Perry as Francesco, Wayne the Challenger, Eggbert and Leopard seal\nHugh Jackman as Memphis\nNicole Kidman as Norma JeanLive action cast featured Septimus Caton as the guitarist and Ivan Vunich as the beanie man."}