{"_movieID": "60420", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:42:00", "summary": "Like Crazy is a 2011 American romantic drama film directed by Drake Doremus and starring Anton Yelchin, Felicity Jones, and Jennifer Lawrence. Written by Doremus and Ben York Jones, the film tells the story of Anna (Felicity Jones), a British exchange student who falls in love with an American student, Jacob (Anton Yelchin), only to be separated from him when she is denied re-entry into the United States after staying in the country longer than her student visa allows.\nDoremus based the storyline of the film partly on his own long-distance relationship with a woman living in London while he lived in Los Angeles. Rather than writing a traditional screenplay, he and Ben York Jones compiled a 50-page outline of the film from which the actors improvised almost all of the dialogue. Filming took place over four weeks in Los Angeles and London with a budget of $250,000.\nLike Crazy premiered on January 22, 2011 at the Sundance Film Festival, where it won the festival's Grand Jury Prize. It was released in theaters on October 28, 2011 and grossed over $3.7 million at the box office. Most reviews of the film were positive, with reviewers giving particular praise to the performances of Yelchin and Jones, although some found the plot unrealistic and contrived.", "plot": "Anna Gardner, a British exchange student attending college in Los Angeles, meets and falls in love with Jacob Helm, an American student who returns her affections. After graduation, Anna decides to spend the summer with Jacob rather than return to the United Kingdom, unaware of the consequences of overstaying her student visa, which expired upon her graduation. After returning to London for a family engagement, Anna flies back to Los Angeles, where she is detained, denied entry, and deported back to the United Kingdom by immigration officials.\nThe couple's love for each other grows strained by their separation and long-distance relationship. Despite her efforts at appealing the immigration decision, Anna is told she is banned from entering the United States. Meanwhile, Jacob leaves behind his successful design business and visits Anna in London for a few weeks. There, he learns that Anna's parents, Bernard and Jackie, have hired an immigration lawyer to try to get the ban lifted. Bernard suggests that marrying may help their efforts. Jacob is uncomfortable with the suggestion, and the couple struggle with their feelings.\nAfter Jacob returns to the United States, he and Anna grow apart, and Jacob begins a relationship with his colleague, Samantha. Anna also tries to find a new life for herself, beginning work as a secretary for a magazine, but she is unable to abandon her feelings for Jacob. She eventually phones him from London and says that they will never find in others what they found in each other and that they should marry. Soon afterward, Jacob breaks up with Samantha, returns to London, and marries Anna in a small registry office ceremony with her parents as witnesses — Jacob and Anna affirming that they will \"never allow anything to destroy the feelings we share for each other\". With a tearful parting, Jacob returns to his business in Los Angeles while the couple waits six months before they appeal the ban on Anna's visa.\nSix months later, Jacob flies back to the United Kingdom for the appeal, but it is rejected. With their relationship compromised and no hope of resolving the visa issue, Anna and Jacob begin to fight with each other out of jealousy and frustration. Jacob flies back to the US and resumes his relationship with Samantha. Anna eventually gets promoted at work to the position of editor—something she wanted very much. Her love life, however, is not as positive or fulfilling—her new boyfriend Simon does not evoke the same feelings in her as Jacob, whom she still misses.\nSometime later, Anna is finally offered a new visa. She gives up her job, her current boyfriend, and her apartment and flies to Los Angeles to Jacob, who greets her with flowers at the airport where they have an awkward reunion. Jacob brings Anna to his house where he joins her in the shower, and as the water falls over them, they remember happier memories they had together at the beginning of their relationship, which has now become strained due to their indiscretions during the time spent apart."}