{"_movieID": "340945", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:33:46", "summary": "USS Indianapolis: Men of Courage (also titled USS Indianapolis: Disaster in the Philippine Sea) is a 2016 American war disaster film  directed by Mario Van Peebles and written by Cam Cannon and Richard Rionda Del Castro, based largely on the true story of the loss of the ship of the same name in the closing stages of the Second World War. The film stars Nicolas Cage, Tom Sizemore, Thomas Jane, Matt Lanter,  Brian Presley, and Cody Walker. Principal photography began on June 19, 2015 in Mobile, Alabama. The film premiered in the Philippines on August 24, 2016. It was released as a digital rental on iTunes and Amazon in the United States on October 14, 2016 and in limited theaters during the Veterans Day weekend.", "plot": "In 1945, the Portland-class heavy cruiser USS Indianapolis, commanded by Captain Charles McVay (Nicolas Cage), delivers parts of the atomic bomb that would later be used to bomb Hiroshima during the ending of World War II. While patrolling in the Philippine Sea, on July 30 in 1945, the ship is torpedoed and sunk by the Imperial Japanese Navy (IJN) submarine I-58, taking 300 crewmen with it to the bottom of the Philippine Sea, while the rest climb out of the ship and were left stranded at sea for five days without food and water in shark-infested waters.\nWith no hope for five days, most of the remaining crew-members were eaten by sharks or would die of salt water poisoning by drinking seawater (which also caused some of those injured to die from infectious wounds). Others swam off from their groups after hallucinating of a non-existent island, never to be seen again. On the 5th day, the surviving crew were rescued by an airplane pilot who spotted them by chance and called for a rescue. Only 317 survived the disaster. Looking for a scapegoat for their own gross negligence, the US Navy court-martials and convicts Captain McVay for \"hazarding his ship by failing to zigzag\", despite overwhelming evidence supporting McVay (such as even having the former captain of the IJN's I-58 submarine to testify for the trial, which proved McVay to be not at fault). It ends with Captain McVay finally committing suicide years after the tragedy after being harassed and tormented with phone calls and mail from angry and grief-stricken relatives of the deceased crew-members, as well as the media (mostly in the form of newspapers, which placed the blame on him for the ship's sinking).  In the movie's postscript they show President Clinton exonerating Captain McVay of all charges on October 30, 2000.\nIn a subplot, two childhood friends, Indianapolis diver Brian \"Bama\" Smithwick and crew member Mike D'Antonio, fall in love with the same woman without the other knowing. D'Antonio purchases an engagement ring before the trip to Tinian to propose to the girl who tells D'Antonio before the trip that she is expecting their first child. During a brawl involving two of the crewmen, D'Antonio loses the ring and one of the crew members, Alvin, steals it. After the ship is destroyed, Smithwick and D'Antonio spend the next few days in the sea with the rest of the crew where D'Antonio succumbs to massive leg injuries received in a shark attack and Smithwick is given the engagement ring by Alvin. Bama proposes to D'Antonio's fiancée Clara to help her raise her child and she accepts his proposal.\nWhile the credits roll, two Navy sailors recount the sharks in the waters and real rescue footage is shown along with many still shots of lost sailors."}