{"_movieID": "291870", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:46:44", "summary": "Dirty Grandpa is a 2016 American comedy/coming of age film about a lawyer who drives his grandfather to Florida during spring break. The film was directed by Dan Mazer and written by John Phillips. It stars Robert De Niro, Zac Efron, Aubrey Plaza, and Zoey Deutch.\nFilming began on January 19, 2015 in Atlanta and ended on May 9. Dirty Grandpa was theatrically released on January 22, 2016 by Lionsgate. It grossed $105.2 million against a production budget of $25 million, but it was met with strongly negative critical reception, and is considered one of the worst films ever made.", "plot": "Jason Kelly is a lawyer who works for his father. Jason's grandmother dies, and after the funeral, his Army veteran grandfather, Dick, asks Jason to drive him to Boca Raton, Florida. Jason is getting married to his controlling fiancée, Meredith, in one week, but decides to take his grandfather anyway.\nOn the way there, the two meet Jason's old photography classmate, Shadia, along with her friends Lenore and Bradley. Dick and Lenore are instantly attracted to each other. Dick tells the girls that he is a professor and that Jason is a photographer. They all go their separate ways, but Dick convinces Jason that they should meet the girls at Daytona Beach, Florida, because Dick wants to have sex with Lenore. The two go to a golf course, where Dick flirts with two women.\nAt Daytona Beach, they meet up with the girls and the girls' friends, Cody and Brah, with whom they compete in beer chugging. That night, a drunk Jason, wearing nothing but a Hornet fanny pack, parties and smokes crack cocaine that he gets from a drug dealer named Pam. He steals a motorcycle and wakes up the next day on the beach. During an awkward FaceTime with Meredith, a boy grabs the fanny pack and takes it off; his father suspects Jason of being a pervert and calls the police, who promptly arrest Jason. Dick bails him out, and the two visit Dick's old Army friend in a nursing home. They meet the girls again and enter a flexing contest with Cody and Brah; when they lose, Dick alters a T-shirt cannon to fire a beer can at the winning duo, hospitalizing them. With Cody and Brah in the hospital, Jason and Dick take their hotel room. After Dick reveals to Jason that he was a member of the Special Forces, the two go to a nightclub with the girls. Dick gets into a fight with some men after they bully Bradley for his homosexuality. The next day, Jason goes to a protest with Shadia and she tells him that she is leaving soon and going to live on a ship for a year.\nThat night, Jason plans on telling Shadia who he really is, but before he can, Cody does an online search on him and tells Shadia that Jason is already engaged. Jason then gets caught with drugs and is thrown into jail again. The next day, Dick bails him out and tells Jason that his real reason for the trip was to convince Jason not to go through with the wedding. Jason leaves Dick and drives back home.\nDuring his wedding rehearsal, Dick hacks into the computer system, revealing embarrassing photos of Jason during the party. Jason says that he cannot marry Meredith, who reveals that she had an affair. He, Dick, and Pam use Pam's ice cream truck to catch up with the bus that Shadia is on as she is leaving. Jason and Shadia kiss, and he gets on the bus with her. Dick goes to his house in Boca Raton and finds Lenore there waiting for him, and they have sex. Dick and Lenore get married and have a baby boy, and Jason and Shadia are named the godparents.", "cast": "Robert De Niro as Richard \"Dick\" Kelly, Jason's grandfather\nZac Efron as Jason Kelly\nAubrey Plaza as Lenore, Shadia's best friend\nZoey Deutch as Shadia\nJulianne Hough as Meredith Goldstein, Jason's fiancée\nDermot Mulroney as David Kelly, Jason's father and Dick's son\nJason Mantzoukas as Pam\nJeffrey Bowyer-Chapman as Bradley, Shadia and Lenore's effeminate gay male friend\nJake Picking as Cody\nMichael Hudson as Brah\nAdam Pally as Nick\nHenry Zebrowski as Officer Gary Reiter\nMo Collins as Officer Jean Finch\nDanny Glover as Stinky\nBrandon Mychal Smith as Tyrone"}