{"_movieID": "301365", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:43:37", "summary": "The Neon Demon is a 2016 psychological horror film directed by Nicolas Winding Refn, co-written by Mary Laws, Polly Stenham, and Refn, and starring Elle Fanning. The plot follows an aspiring model in Los Angeles whose beauty and youth generate intense fascination and jealousy within the industry. Supporting roles are played by Karl Glusman, Jena Malone, Bella Heathcote, Abbey Lee, Desmond Harrington, Christina Hendricks, and Keanu Reeves.\nAn international co-production between France, Denmark, and the United States, the film competed for the Palme d'Or at the 2016 Cannes Film Festival, the third consecutive film directed by Refn to do so, following Drive (2011) and Only God Forgives (2013). In the United States, the film was released theatrically on June 24, 2016 by Amazon Studios and Broad Green Pictures. It opened to polarized reviews, and ultimately grossed a little over $3 million against a $7 million budget.", "plot": "Following the death of her parents, sixteen-year-old aspiring model Jesse has just moved from small-town Georgia to Los Angeles. She meets photographer Dean, who does her first shoot, and makeup artist Ruby, who introduces her to older fellow models Sarah and Gigi. The three women are intrigued by Jesse's natural beauty and curious about her sexual proclivities. Jesse feigns experience in the latter.\nJesse is signed by Roberta Hoffman, the owner of a modeling agency, who tells her to pretend she is nineteen and refers her to a test shoot with notable photographer Jack McCarther. Jesse goes on a date with Dean, but keeps his advances at bay. She returns to her motel room to find it ransacked and occupied by a feline that resembles a mountain lion but roars like most big cats. Jesse goes to the photo shoot with Jack, who covers her naked body in gold paint. The shoot is successful, and Gigi and Sarah begin envying Jesse's youth, while Ruby is fascinated with her.\nJesse and Sarah cross paths in a casting call for fashion designer Robert Sarno. He pays no attention to Sarah but is entranced by Jesse. After tearing her own portfolio and smashing a ladies room mirror, a distraught Sarah asks how it feels to be the focus of admiration. Jesse admits, \"It's everything.\" Sarah lunges forward, Jesse accidentally cuts her hand on glass and Sarah sucks her blood. Jesse rushes back to her motel and faints, hallucinating strange images. Dean arrives and treats Jesse's wound after paying Hank, the lecherous motel owner, for the property damage caused by the feline.\nJesse and Gigi meet in Sarno's fashion show. Gigi describes all her past cosmetic surgery, and expresses disbelief that Jesse has not used casting couches to achieve success. As Jesse is closing the show, she has a vision of a glowing triangle she hallucinated earlier while she was unconscious. After the show, a visibly-changed Jesse goes out with Dean to a bar. They hear Sarno decry cosmetic surgery, using a humiliated Gigi as an example. In contrast, he praises Jesse's natural looks. Dean challenges this view and wants to leave with Jesse but she rejects him, now displaying a narcissistic new persona.\nJesse has a nightmare of Hank taking her off-guard and orally raping her with a knife. She wakes up in time to hear someone fidgeting with her door knob. She quickly turns the lock, but is left to listen as the intruder breaks into the adjacent room and assaults the female occupant. Terrified, she calls Ruby, who tells her to come over. Ruby tries to initiate sex with her, but Jesse rejects her, revealing herself to be a virgin. A resentful Ruby leaves for her second job as a makeup artist at a morgue, where she pleasures herself with a female corpse while fantasizing about Jesse. \nRuby returns home and finds Jesse made up, wearing a new dress and fully unabashed in her narcissism. Sarah and Gigi show up and attack Jesse with a fire-poker and a butcher knife. The three women corner Jesse outside, where Ruby pushes her into an empty swimming pool, seriously incapacitating her. They butcher and cannibalize Jesse off-screen, then take turns bathing in her blood. Occult tattoos are visible in Ruby's topless abdomen the next morning as she hoses blood off the pool and lies in Jesse's unmarked grave. She later lies nude in her moonlit living room as a torrent of blood gushes from her genitals.\nSarah drives Gigi along the Pacific Coast Highway to one of Jack's photoshoots with fellow model Annie. Jack wanders to the living room, is suddenly enthralled with Sarah and fires Annie on the spot. In the midst of the shoot, Gigi feels ill and leaves. Sarah witnesses Gigi vomit up one of Jesse's eyeballs. She screams with regret, \"I need to get her out of me\", and stabs herself with a pair of scissors. Sarah watches Gigi die, sheds a tear and eats the regurgitated eyeball; she then returns to the photoshoot.\nThe end credits scene show a woman, who does not show her face but dresses and looks like Sarah, walking alone in the Mojave Desert."}