{"_movieID": "419700", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:07:12", "summary": "Sandy Wexler is a 2017 American comedy film directed by Steven Brill and written by Dan Bulla, Paul Sado and Adam Sandler. The film stars Sandler, Jennifer Hudson, Kevin James, Terry Crews, Rob Schneider, Colin Quinn, Nick Swardson, Lamorne Morris and Arsenio Hall, and follows a talent manager in 1990s Hollywood. The film was released on Netflix on April 14, 2017.", "plot": "Sandy Wexler (Adam Sandler) is a talent manager working in Los Angeles in the 1990s, diligently, albeit erratically, representing a group of eccentric clients on the fringes of show business. His skills as a manager are challenged when he discovers a genuinely talented singer, Courtney Clarke (Jennifer Hudson).", "cast": "Adam Sandler as Sandy Wexler\nJennifer Hudson as Courtney Clarke\nKevin James as Ted Rafferty\nTerry Crews as \"Bedtime\" Bobby Barnes\nShad Gaspard as \"Bedtime\" Bobby Barnes (in-ring)\nRob Schneider as Firuz\nColin Quinn as Kevin Connors\nNick Swardson as Gary Rodgers\nLamorne Morris as Bling\nArsenio Hall as himself\nAaron Neville as Willy Clarke\nJane Seymour as Cindy Marvelle\nSandy Wernick as Peter Marvelle\nWayne Federman as Eric Lamonsoff\nJackie Sandler as Amy Baskin\nLuis Guzmán as Oscar\nRob Reiner as Marty Markowitz\nChris Elliott as Mr. Buttons\nIdo Mosseri as Yuri\nMilo Ventimiglia as Barry Bubatzi\nEugenio Derbez as Ramiro Alejandro\nJessica Lowe as Ms. Gideon\nAllen Covert as Gurvy\nJonathan Loughran as Trucker Jon\nKate Micucci as Nurse TrishaCameo roles include Jewel, Darius Rucker, Jason Priestley, Gary Dell'Abate, Arsenio Hall, Quincy Jones, Judd Apatow, Janeane Garofalo, Pauly Shore, Kevin Nealon, Lorne Michaels, Dana Carvey, Chris Rock, David Spade, George Wendt, Penn Jillette, Henry Winkler, Tony Orlando, Al B. Sure!, Brian McKnight, Vanilla Ice, Jimmy Kimmel, Conan O'Brien, Louie Anderson, \"Weird Al\" Yankovic, Kenneth \"Babyface\" Edmonds, Mason \"Ma$e\" Betha, Jay Leno, Lisa Loeb, Jon Lovitz, Budd Friedman and his wife Alix Friedman.\nMike Judge makes a vocal cameo as Beavis and Butt-Head during the end credits. Professional wrestlers Rikishi and David Otunga have brief roles in the film."}