{"_movieID": "31723", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:01", "summary": "Women in Trouble is a 2009 American comedy film written and directed by Sebastián Gutiérrez and starring Carla Gugino, Adrianne Palicki, Marley Shelton, Cameron Richardson, Connie Britton and Emmanuelle Chriqui.\nIt was shot in 10 days for $50,000.", "plot": "The film focuses on six women in Los Angeles as their lives become intertwined in the course of 24 hours.\nAfter learning that she is pregnant, porn star Elektra Luxx (Carla Gugino) gets stuck in an elevator with Doris (Connie Britton), sister to Addy (Caitlin Keats). Addy has recently started taking her daughter, Charlotte, to see her therapist, Maxine (Sarah Clarke), while secretly using the visits to sleep with Maxine's husband. Upon learning about the affair during a therapy session with Charlotte, Maxine rushes out and gets into her car. While backing out, she hits porn star Holly Rocket (Adrianne Palicki), a colleague of Elektra Luxx who had been fleeing with her friend, Bambi (Emmanuelle Chriqui), from a job that had gone wrong. Meanwhile, flight attendant Cora (Marley Shelton) finds herself the object of rock star, Nick Chapel's (Josh Brolin), affection on a flight to his band's upcoming show.", "cast": "Carla Gugino as Elektra Luxx, adult film superstar\nAdrianne Palicki as Holly Rocket, adult film actress\nConnie Britton as Doris, Addy's sister\nCaitlin Keats as Addy Hunter, Doris' sister\nIsabella Gutierrez as Charlotte, 13-year-old girl, daughter of Doris\nMarley Shelton as Cora, flight attendant\nGarcelle Beauvais-Nilon as Maggie, flight attendant\nJosh Brolin as Nick Chapel, rock star (drummer and songwriter) who's a passenger on the airplane\nEmmanuelle Chriqui as Bambi, call girl (?)\nRya Kihlstedt as Rita, barmaid at Ruby's Caribbean, the lesbian bar, & Darby's roommate\nCameron Richardson as Darby, masseuse and Rita's roommate\nSarah Clarke as Maxine McPherson, therapist\nSimon Baker as Travis McPherson, the therapist's husband\nXander Berkeley as Mr. Frost, one of the people talking to the therapist\nElizabeth Berkley as Tracy, one of the people talking to the therapist\nLauren Katz as Tara, one of the people talking to the therapist\nPaul Cassell as a Jay, one of the people talking to the therapist\nErmahn Ospina as El Capitan, character in the porn movie\nGreg Lauren as fireman\nSamantha Shelton as singer at Ruby's Caribbean (bar)\nAntonio Graña as Jimbo, the mafioso muscle\nJoseph Gordon-Levitt as Bert Rodriguez, \"sex blogger\""}