{"_movieID": "259316", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:44:31", "summary": "Fantastic Beasts and Where to Find Them is a 2016  fantasy film directed by David Yates. A joint British and American production, it is a spin-off and prequel to the Harry Potter film series, and is produced and written by J. K. Rowling in her screenwriting debut, inspired by her 2001 guide book of the same name. The film features an ensemble cast that includes Eddie Redmayne, Katherine Waterston, Dan Fogler, Alison Sudol, Ezra Miller, Samantha Morton, Jon Voight, Carmen Ejogo, and Colin Farrell. It is the first installment in the Fantastic Beasts film series, and ninth overall in the Wizarding World franchise, that began with the Harry Potter films.\nFantastic Beasts and Where to Find Them premiered in New York City on 10 November 2016 and was released worldwide on 18 November 2016 in 3D, IMAX 4K Laser and other large format cinemas. It received generally positive reviews from critics and emerged a commercial success having  grossed $814 million worldwide, making it the eighth highest-grossing film of 2016.\nThe film was nominated for five BAFTAs, including Best British Film, winning Best Production Design, and was nominated for two Academy Awards, winning Best Costume Design, becoming the first Wizarding World film to win an Academy Award. A sequel, titled Fantastic Beasts: The Crimes of Grindelwald, was released on 16 November 2018.", "plot": "In 1926, British wizard and \"magizoologist\" Newt Scamander arrives in New York, en route to Arizona. He encounters Mary Lou Barebone, a non-magical woman (\"No-Maj\" or \"Muggle\") who heads the New Salem Philanthropic Society. As Newt listens to her speaking about witches and wizards being real and dangerous, a Niffler escapes from Newt's magically expanded suitcase, which houses various magical creatures. As Newt attempts to capture the Niffler, he meets No-Maj cannery worker and aspiring baker Jacob Kowalski, and they unwittingly swap suitcases. Demoted Auror (hunter of dark wizards) Tina Goldstein arrests Newt for the chaos caused by the Niffler and takes him to the Magical Congress of the United States of America (MACUSA) headquarters, hoping to regain her former position. However, as Jacob's suitcase contains only baked goods, Newt is released. At Jacob's tenement apartment, several creatures escape from Newt's suitcase.\nAfter Tina and Newt find Jacob and the suitcase, Tina takes them to her apartment and introduces them to Queenie, her Legilimens sister. Jacob and Queenie are mutually attracted, though American wizards are forbidden to have any contact with No-Majs. Newt takes Jacob inside his magically expanded suitcase, where Jacob encounters a contained Obscurus, a parasite that develops inside magically gifted children if they suppress their magical abilities. Newt extracted it from a young girl who died, those afflicted rarely living past the age of ten. Newt persuades Jacob to help search for the missing creatures. After they re-capture two of the three escaped beasts, Tina returns the suitcase to MACUSA. Officials arrest them, believing one of Newt's beasts to be responsible for killing Senator Henry Shaw, Jr. Director of Magical Security Percival Graves accuses Newt of conspiring with the infamous dark wizard Gellert Grindelwald, and decides to destroy Newt's suitcase and erase Jacob's recent memories of magic. Newt and Tina are sentenced to immediate death in secret, but Queenie and Jacob rescue them, and they escape after retrieving Newt's suitcase. Following a tip from Tina's old goblin informant Gnarlack, the foursome find and re-capture the last of the escaped creatures.\nMeanwhile, Graves approaches Mary Lou's adopted son Credence and offers to free him from his abusive mother. In exchange, Graves wants Credence to find an Obscurus, which he believes has caused the mysterious destructive incidents around the city. Credence finds a wand under his adopted sister Modesty's bed. Mary Lou assumes it is Credence's wand, but Modesty says it is hers. When Modesty is about to be punished, the Obscurus kills Mary Lou and her eldest daughter Chastity. Graves arrives, and after Credence leads him to Modesty, who he assumes is the Obscurus's host, he dismisses Credence as being a Squib and refuses to teach him magic as he had previously promised. Credence reveals he is the real host, having lived longer than any other host due to the intensity of his magic. In a fit of rage, Credence transforms and attacks the city.\nNewt finds Credence hiding in a subway tunnel, but he is attacked by Graves. Tina, who knows Credence, arrives and attempts to calm him, while Graves tries to convince Credence to listen to him. As Credence begins to settle back into human form, Aurors arrive and apparently disintegrate him to protect the magical society; however, a tiny Obscurus fragment escapes. Graves admits his plan of unleashing the Obscurus to expose the magical community to the No-Majs and framing Newt for it, and angrily claims that MACUSA protects the No-Majs more than themselves. As the president orders the Aurors to apprehend Graves, he attacks and begins to defeat all of them. Newt manages to subdue him with one of his beasts, and uses a revealing spell to expose Graves as Grindelwald in disguise, who is taken into custody.\nMACUSA fears their secret world has been exposed, but Newt releases his Thunderbird to disperse a potion as rainfall over the city that erases all New Yorkers' recent memories, as MACUSA wizards repair the destruction. Queenie kisses Jacob goodbye as the rain erases his memories. Newt departs for Europe, but promises to return and visit Tina when his book is finished; he also anonymously leaves Jacob a case of silver Occamy eggshells to fund his bakery. Jacob's breads and pastries are subconsciously inspired by Newt's creatures, and Queenie visits him in his shop.", "cast": "Eddie Redmayne as Newt Scamander: an introverted British wizard, magizoologist and an employee at the Ministry of Magic. Scamander is the future author of the Hogwarts School of Witchcraft and Wizardry standard textbook Fantastic Beasts and Where to Find Them. Redmayne was cast in June 2015. Matt Smith and Nicholas Hoult were also considered for the role.\nKatherine Waterston as Tina Goldstein: a grounded, down-to-earth witch and a former Auror employed by MACUSA. She longs to fight for what is right, but was demoted to a position well below her skill level.\nDan Fogler as Jacob Kowalski: a genial No-Maj cannery worker and aspiring baker who is accidentally exposed to the New York City magical community upon meeting Newt.\nAlison Sudol as Queenie Goldstein: Tina's younger sister and roommate, she's described as a free-spirited and big-hearted bombshell, and is a naturally born and skilled Legilimens. The film is Sudol's feature film debut.\nEzra Miller as Credence Barebone: Mary Lou's troubled adopted son who is an Obscurial.\nSamantha Morton as Mary Lou Barebone: a narrow-minded No-Maj and the sinister leader of the New Salem Philanthropic Society or \"The Second-Salemers\", a group whose goals include exposing and killing wizards and witches.\nJon Voight as Henry Shaw Sr.: a newspaper owner and the father of U.S. senator Henry Shaw Jr. and Langdon Shaw.\nCarmen Ejogo as Seraphina Picquery: the President of MACUSA, the Magical Congress of the United States of America. As such, she is the American equivalent of a Minister for Magic in the United Kingdom.\nColin Farrell as Percival Graves: a high-ranking Auror and Director of Magical Security for MACUSA. He is charged with the protection of wizards.\nRon Perlman as the voice of Gnarlack: a goblin gangster who owns a magical speakeasy nightclub called \"The Blind Pig\".\nRonan Raftery as Langdon Shaw: the youngest of Henry Shaw Sr.'s sons, who begins to believe in magic.\nJosh Cowdery as Henry Shaw Jr.: the eldest of Henry Shaw Sr.'s sons, an arrogant and cruel U.S. senator.\nFaith Wood-Blagrove as Modesty Barebone: a haunted young girl and the youngest of Mary Lou's adopted children. Wood-Blagrove was chosen for the role following thousands of auditions in an open casting call.\nJenn Murray as Chastity Barebone: the eldest of Mary Lou's adopted children.\nKevin Guthrie as Mr. Abernathy: Tina and Queenie's MACUSA supervisor.\nJohnny Depp  as Gellert Grindelwald: an infamous powerful dark wizard who seeks to lead a new Wizarding Order, believing in wizarding superiority.\nZoë Kravitz as Leta Lestrange: Newt's former love who betrayed his trust."}