{"_movieID": "513576", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:43:52", "summary": "Always Be My Maybe is a 2019 American romantic comedy film, written by Ali Wong, Randall Park and Michael Golamco and directed by Nahnatchka Khan. It stars Wong and Park as childhood friends Marcus and Sasha, who have not been in touch since a brief teenage fling ended badly. When Sasha returns to San Francisco to open a restaurant and romantic chemistry from their teenager years remains, Marcus's fears and Sasha's fame and demanding career challenge their potential new relationship.\nThe film was released in select theaters on May 29, 2019, and digitally on May 31, 2019, on Netflix.", "plot": "Sasha Tran and Marcus Kim are childhood friends who grow up next door to each other in San Francisco. As Sasha's Vietnamese-immigrant/refugee parents regularly leave her home alone while they tend to their store, Marcus's parents often have her over for dinner, and Marcus's Korean American mother Judy teaches her to cook. Eventually Sasha and Marcus form a close friendship that carries on into their teenage years, but this is broken after his mother dies in an accident. Grieving, the two have sex but a wedge is driven between the two when they argue shortly afterwards and they fall out of touch.\nSixteen years later, Sasha is a celebrity chef and engaged to Brandon Choi, a successful restaurateur. Marcus is still in San Francisco living with his widowed father and performs in a talented but largely unsuccessful band that only plays in his neighborhood. He also has a girlfriend Jenny, an Asian American woman with dreadlocks. Sasha breaks up with Brandon after he delays their wedding yet again. Briefly moving back to the Bay Area to oversee the opening of a new restaurant, she has a chance encounter with Marcus when he and his father are hired to install air conditioning at her temporary home. After initial friction, they reconnect and become friends again, and Marcus admits to his father he still has feelings for Sasha. But before he can tell her, Sasha announces she has met someone new, and they wind up on a disastrous double date with Marcus' girlfriend and Sasha's new love interest: movie star Keanu Reeves. The long evening ultimately dissolves into chaos as Sasha confesses her longtime childhood crush on Marcus, a brawl breaks out between Marcus and Keanu, and Jenny ends up staying with Keanu for the night. Sasha and Marcus then begin seeing each other, with Marcus reacquainting Sasha with the home and San Francisco Asian community she had distanced herself from, still harboring resentment of her absentee parents. He takes her to an old favorite Cantonese restaurant from their childhood, which Sasha remembers as terrible but discovers is delicious, marred only by her painful memories. As she reconnects to the city and the two fall in love, Marcus is taken aback to learn that, as planned, Sasha still intends to move on to New York for her next project, once the San Francisco restaurant has launched. When Sasha asks Marcus to join her, he refuses and she leaves San Francisco alone.\nTaken to task by both his father and his bandmates, Marcus realizes that his mother's death has made him scared to move on in life. He then moves out of his childhood home and takes steps to make his band more successful. He calls her regularly with updates but, not receiving any reply, does not pursue her further until he discovers Sasha is secretly supporting his musical ambitions. This emboldens Marcus to surprise Sasha on the red carpet at an awards show in Manhattan, asking for her to take him back and pledging to be wherever she is. She accepts. Reunited, Sasha takes Marcus to the New York restaurant she has been developing: it is named for and features Judy's recipes.", "cast": "Ali Wong as Sasha Tran\nMiya Cech as 12-year-old Sasha\nAshley Liao as 15-year-old Sasha\nRandall Park as Marcus Kim\nEmerson Min as 12-year-old Marcus\nJackson Geach as 15-year-old Marcus\nJames Saito as Harry Kim\nMichelle Buteau as Veronica\nAnaiyah Bernier as 15-year-old Veronica\nVivian Bang as Jenny\nKeanu Reeves as himself\nSusan Park as Judy Kim\nDaniel Dae Kim as Brandon Choi\nKaran Soni as Tony\nCharlyne Yi as Ginger\nLyrics Born as Quasar\nCasey Wilson as Chloe\nRaymond Ma as Quoc Tran\nPeggy Lu as Sandy Tran"}