{"_movieID": "309242", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:28:09", "summary": "Mississippi Grind is a 2015 American drama film directed and written by Anna Boden and Ryan Fleck. It stars Ryan Reynolds, Ben Mendelsohn, Sienna Miller, Analeigh Tipton, Robin Weigert, and Alfre Woodard. The film was released by A24 on September 25, 2015.", "plot": "Gerry, a gambler facing financial hardship, meets Curtis Vaughn, a younger traveling gambler, while playing Texas hold 'em in Dubuque, Iowa.   Curtis wins a hand and buys Gerry a drink.  Hours later, Gerry sees Curtis playing darts at a bar and returns the favor.  Curtis explains that he is successful playing cards because he does not care about winning.  The two drink heavily.\nAfter an unsuccessful real estate showing the next morning, Gerry goes to a dog track with Curtis. They initially win a large amount of money, but Gerry is unwilling to walk away, and he gambles away their winnings.  Afterward, they drink at a bar, where they attempt to bet $1,000 on a game of pool.  The men at the pool table are not interested and they force Curtis and Gerry to leave the bar.  In the parking lot, Curtis explains to Gerry that \"Machu Picchu time\" is approaching – a phrase he uses whenever he leaves town, implying exotic destinations.  Gerry is stabbed by a man who overheard the attempted bet, not knowing that Gerry was bluffing.\nThe next morning, Gerry meets Sam in a restaurant. She demands that Gerry pay her the money he owes and threatens him when he does not have it.  Gerry runs into Curtis at a bar, where he proposes a trip down the Mississippi River, where they will gamble at several major cities and ultimately play at a poker game in New Orleans with a $25,000 buy-in.  Curtis agrees to spot Gerry $2,000 for gambling, provided that Gerry drives his car.\nThe two arrive in St. Louis, where they meet prostitutes Simone and Vanessa.  After Gerry has a successful poker session on a riverboat casino, Gerry and Curtis spend time in St. Louis with Simone and Vanessa.  Simone warns Curtis of previous times he has trusted a fellow gambler and ended up being deceived. In Memphis, Gerry plays well at the poker table but loses everything on the final \"river\" card of a Texas Hold 'em game.  Gerry lies to Curtis, saying that he won $7,000 and is inspired to go to Little Rock to make amends with his ex-wife.  Curtis agrees to come along.  Gerry attempts to steal his ex-wife's money; she catches him and tells him to leave.\nCurtis and Gerry visit Tunica, Mississippi, where Curtis' casino VIP card is rejected.  After asking Gerry for money for the hotel room, Curtis discovers Gerry's lie.  Curtis tells Gerry that if he continues on this path, it will not end well for him.  In the restroom, Curtis agitates some younger men.  When they see Curtis has left the bathroom, they direct their anger towards Gerry.\nThe two go to a horse race in New Orleans.  After selling Gerry’s car, they agree to bet on a longshot, but Curtis secretly bets on a different horse.  When Curtis’ horse wins, he does not tell Gerry, and Gerry assumes they are out of money.  Gerry attempts to talk his way into the high stakes poker game but is thrown out.  Curtis intentionally antagonizes men in a pickup basketball game and is beaten up.  Curtis goes to a cabaret club, buys a drink, and leaves the rest of his money to his mother who is performing at the club.  At a casino, Gerry places the last of his money on the roulette table and wins.  While playing blackjack, Curtis shows up at the table, out of money, and Gerry shares his winnings.  After several hours of playing craps, the two amass $285,000.  Curtis calls Simone and proclaims his love for her.  Convinced that they cannot lose, Curtis and Gerry place all their money on the field.\nCurtis and Gerry eat lobster and steak, discussing their win of a half of a million dollars.  Gerry, in shock of his miraculous luck, begins to act noticeably odd, criticizing his steak and saying he plans to use his money to do something nice for his estranged daughter.  They are comped a suite, where they keep their cash in a large safe.  The next morning, Curtis finds Gerry has left.  In the safe, he sees his half of the money, along with a note from Gerry, saying \"Machu Picchu time\".  Curtis flirts with a cashier, who asks him if he's going anywhere special with his winnings. He responds, \"Peru.\" Gerry re-purchases his car.  He hears the gambling tips CD he left in the stereo describe what true confidence looks like. As the tape plays, describing a strong, upright posture that winners have, Gerry slouches as an American flag can be seen reflected upside down in the windshield.", "cast": "Ryan Reynolds as Curtis Vaughn\nBen Mendelsohn as Gerry\nSienna Miller as Simone\nAnaleigh Tipton as Vanessa\nAlfre Woodard as Sam\nJayson Warner Smith as Clifford\nRobin Weigert as Dorothy\nMarshall Chapman as Cherry\nJane McNeill as Kate\nIndigo as Dora\nJames Toback as Tony Roundtree\nJason Shaffette as Chuck"}