{"_movieID": "76163", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:54:24", "summary": "The Expendables 2 is a 2012 American action film directed by Simon West, written by Richard Wenk and Sylvester Stallone and based on a story by Ken Kaufman, David Agosto and Wenk. Brian Tyler returned to score the film. It is the sequel to the 2010 action film The Expendables, and stars Sylvester Stallone, Jason Statham, Jet Li, Dolph Lundgren, Chuck Norris, Terry Crews, Randy Couture, Liam Hemsworth, Jean-Claude Van Damme, Bruce Willis, and Arnold Schwarzenegger. The story follows the mercenary group known as \"the Expendables\" as they undertake a seemingly simple mission which evolves into a quest for revenge against rival mercenary Jean Vilain, who murdered one of their own and threatens the world with a deadly weapon. It is the second installment in The Expendables film series.\nPrincipal photography took place over 14 weeks (beginning in September 2011) on an estimated $100 million budget. Film locations included Bulgaria, Hong Kong and New Orleans. Controversy arose over the accidental death of a stuntman and environmental damage caused during filming in Bulgaria.\nThe film was released in Europe on August 16, 2012 and in North America the following day. The Expendables 2 grossed over $310 million worldwide, with its greatest success outside North America. Critics generally considered the film an improvement over its predecessor (citing an increased use of humor and action scenes), but its plot and dialogue received negative reviews. A tie-in downloadable video game was released on July 31, 2012 as a prequel to the events of the film. A sequel, The Expendables 3, was released on August 15, 2014.", "plot": "The Expendables—leader Barney Ross, knife specialist Lee Christmas, hand-to-hand combat specialist Yin Yang, heavy-weapons specialist Hale Caesar, demolitions expert Toll Road, the unstable Gunner Jensen, and sniper Billy the Kid, the team's newest recruit and Ross' protégé—are deployed to Nepal to rescue Dr. Zhou, a hostage. They also rescue the captured mercenary Trench, Ross's rival. Yang leaves the group to escort Zhou back to China.\nAfter returning to New Orleans, Billy tells Ross that he intends to retire at the end of the month and live with his girlfriend Sophia. Later, Ross is forced to accept a mission from CIA operative Mr. Church to retrieve an item from a downed airplane in Albania. Church sends technical expert Maggie Chan with the team. In Albania the Expendables retrieve the item, but are then ambushed by international criminal and arms dealer Jean Vilain, his right-hand man Hector and his mercenary group (the Sangs), who have captured Billy. Vilain demands the item in exchange for Billy's life. The team gives up the item, but Vilain roundhouse kicks a knife through Billy's heart and flees with the Sangs by helicopter. Ross recovers a note for Sophia from Billy's body; the team buries their fallen comrade, swearing vengeance on Vilain.\nMaggie tells them that the item is a computer, with the location of five tons of refined plutonium abandoned in a mine by the Soviet Union after the Cold War. Vilain intends to retrieve the plutonium and sell it. The Expendables are able to weakly track the computer's signal and follow Vilain, which leads them to Bulgaria where they stay overnight at an abandoned Russian military base. The next morning, the team is ambushed by the Sangs and a tank. After the Expendables run out of ammunition, they are saved by Ross's old friend, Booker, who quickly eliminates both the Sangs and the tank. Before he departs, Booker informs the group of a nearby village whose residents oppose Vilain. Meanwhile, Hector and Vilain dig up the plutonium and begin collecting it.\nIn the village, the Expendables find several armed female villagers guarding their children from Vilain's forces. The local inhabitants are taken and put to work as slaves in the mine, never returning, and the women ask for the Expendables' help. The Sangs arrive for more villagers, but are ambushed by the Expendables and killed. After locating Vilain and the mine, the team assaults the area with their plane before deliberately crashing into the mine. The team saves the enslaved miners from execution, but Vilain and Hector escape with the plutonium. Vilain remotely detonates explosive charges in the mine; it collapses, trapping the miners and the Expendables.\nChurch and Trench arrive, freeing the miners and the team, and join the Expendables to pursue Vilain. The group intercepts Vilain and his men at an airport as he prepares to leave by plane. Joined again by Booker, the Expendables, Trench and Church engage the Sangs in battle. Christmas decapitates Hector, while Ross and Vilain fight hand-to-hand. Ross defeats Vilain, stabbing him and avenging Billy.\nIn the aftermath, Ross is given an old Antonov An-2 biplane by Church; Church, Maggie, Booker and Trench then leave the team. In France, Sophia discovers a box on her doorstep with a large sum of money and Billy's letter. As the Expendables depart in the plane, they propose a final toast to Billy.", "cast": "Sylvester Stallone as Barney Ross:The Expendables' leader. Stallone insisted on performing his own stunts, ignoring his doctor's advice after several surgeries to repair a broken back and neck injury he received while filming The Expendables.Jason Statham as Lee Christmas:The team's knife expert. Statham described his character as \"kind of a workingman's hero… a guy you’d want to go out and have a beer with.\"Jet Li as Yin Yang:The Expendables' hand-to-hand combat expert. Schedule conflicts with Flying Swords of Dragon Gate meant Li could only participate in the film's opening.Dolph Lundgren as Gunner Jensen:A volatile member of the team, undone by years of combat stress and alcohol abuse. Lundgren's personal history (including his chemical engineering degree) were incorporated into the character's story by Stallone. Lundgren was hesitant to participate in the film based on the first script draft; however, rewrites and additional content for his character changed his mind.Chuck Norris as Booker:A retired military operative on a mission to save his old teammates. The character's name is an homage to the 1978 action film Good Guys Wear Black, where Norris plays John T. Booker. During the film, Booker claims to have been bitten by a cobra and states that the cobra later died as a result; this is a reference to Chuck Norris facts, satirical factoids about the actor.Terry Crews as Hale Caesar:The Expendables' barrel-weapons specialist.Randy Couture as Toll Road:The team's demolitions expert. Couture described his character as \"the glue that holds all of these dysfunctional guys together\".Liam Hemsworth as Billy the Kid:An ex-military sniper, disenchanted after service in Afghanistan. Hemsworth was confirmed for the role on September 19, 2011. He was cast in The Expendables in a similar role as a different character, but his role was written out of the script. Stallone remained in contact with him, offering him a role in the sequel when production began. Stallone described the character as the next generation of the Expendables, who is not as \"cynical as the other team members\".Jean-Claude Van Damme as Jean Vilain:The leader of an opposing team of mercenaries known as the Sangs. Van Damme was intentionally distant from the cast and crew during filming to stay in character. Commenting on the role, Stallone said: \"We’ll have a big showdown between me and Van Damme, which has been anticipated for a long time, so it should be a good one.\" Van Damme was offered a role in The Expendables, but ultimately turned it down.Bruce Willis as Church:A secretive CIA agent. In late August 2010, Stallone expressed an interest in having Willis return in the sequel (expanding upon his brief cameo in the original) as a potential \"super-villain\". Willis was confirmed in a \"substantial\" role on September 6, 2011, saying, \"Hopefully, they'll start shooting it while we're young enough to survive.\"Arnold Schwarzenegger as Trench Mauser:Ross' arch-rival (and occasional ally). Stallone intended to have Schwarzenegger return for a sequel before the release of The Expendables: \"If this works, I would love to get him in the next one\". Schwarzenegger's involvement was confirmed on September 6, 2011, his \"substantial\" role expanding a cameo appearance in the original film. He filmed his scenes in four days.Scott Adkins as Hector:Vilain's right-hand man. Adkins was offered a role in the original film, but turned it down for Undisputed III: Redemption.Yu Nan as Maggie Chan:A CIA agent working for Church who teams with the Expendables to retrieve the lost safe.The cast is rounded out by Charisma Carpenter (reprising her role as Christmas's girlfriend, Lacy), Swedish actress Amanda Ooms as Pilar, opposition leader in the enslaved village and Nikolette Noel as Sophia, Billy's girlfriend. Bulgarian mixed martial artist Lyubomir Simeonov has a cameo as one of the Sangs. Tennis pro Novak Djokovic filmed a cameo as himself (after being invited to participate by producer Avi Lerner), but his scenes were cut from the film.At several stages of development, other actors were pursued for the film. In October 2010, Willis said that Steve Austin would reprise his role as villain Dan Paine. In November 2010, Charlie Sheen was reported to be in consideration for the role of a CIA agent hunting down Willis' Mr. Church. In August 2011, Variety reported that actor and martial artist Donnie Yen was offered a role in the film; however, Yen declined the role because he did not find it intriguing.In September 2011, Stallone confirmed that he was in talks with Nicolas Cage and John Travolta, and scheduling would be the only obstacle to their involvement. In July 2011, Mickey Rourke was stated to be reprising his role as Tool; by late September it was reported that he had dropped out of the film, and on October 18 this was confirmed. Antonio Banderas was reportedly offered a role, but was unable to participate due to other commitments. Jackie Chan said he had been offered a role, but was forced to turn it down due to scheduling conflicts with CZ12.On his approach to casting, Stallone said that he was looking for actors who had not experienced recent success in film: \"I like using people that had a moment and then maybe have fallen on some hard times and give them another shot. So we’re always looking for actors like Michael Biehn and Michael Paré. I like those kinds of guys. Someone did it for me and I like to see if I can do it for them.\""}