{"_movieID": "336029", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:47:05", "summary": "A Tale of Love and Darkness is a 2015 Israeli drama film written and directed by Natalie Portman. Based on the autobiographical novel of the same name by Israeli author Amos Oz, it takes place in Jerusalem in the last years of Mandatory Palestine and the first years of independent Israel, and stars Amir Tessler as Oz, and Gilad Kahana and Portman as his parents. It is Portman's directorial feature debut. It was screened at the 2015 Cannes Film Festival and in the Special Presentations section of the 2015 Toronto International Film Festival.", "plot": "Amos reflects back on his early childhood in then British Mandate of Palestine (now Israel) with his mother Fania (Natalie Portman) and father Arieh (Gilad Kahana). His parents are Eastern European Jews living in Jerusalem, which his mother finds difficult as her sisters and family live in Tel Aviv and communication between them is difficult. Amos, an only child, is particularly close with his mother, who frequently tells him stories based on her childhood that often have unhappy or violent endings.\nAmos' parents regularly lend him out to a childless couple they are friends with. On one occasion this couple take him to visit a friend of theirs, a Palestinian Arab. They warn Amos to be quiet and not make much fuss lest he offend their hosts, but while playing with a swing he accidentally injures a child.\nOn November 29, 1947, Amos' family and others from the neighbourhood gather around a radio in the street to hear the passing of United Nations General Assembly Resolution 181, which adopted a plan to partition Mandatory Palestine into independent Arab and Jewish states. Amos' parents are overwhelmed with joy. Soon afterwards, civil war erupts in Palestine. Amos' father enlists to fight in the 1948 Arab–Israeli War, while Amos and other children are recruited to the war effort. One of his mother's friends is killed while hanging up laundry during the war.\nFania falls into a depression and becomes unable to sleep or eat. Amos and Arieh try their best to hide her depression from their friends and family. After a change in pills Fania abruptly becomes her old more lively self and tries to act normally for her husband and child. A short time later she relapses once more and goes to visit her sisters in Tel Aviv, where she kills herself by overdose.\nAmos goes to live on a kibbutz. Reuniting with his father as a teenager, he shows him his new life but admits that despite his attempts at being a strong and healthy farmer he is still a pale and weak intellectual.\nAn elderly Amos sits down to write his memoirs, beginning with the word \"mother\".", "cast": "Natalie Portman as Fania Klausner né Mussman\nGilad Kahana as Arieh Klausner\nAmir Tessler as Amos Klausner (child)\nMakram Khoury as Halawani\nYonatan Shiray as Amos Klausner/Oz (teenager)\nShira Haas as Fania Mussman (young)\nTomer Kapon as The Pioneer\nNeta Riskin"}