{"_movieID": "82675", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:15:56", "summary": "Taken 2 is a 2012 English-language French action thriller film directed by Olivier Megaton and starring Liam Neeson, Maggie Grace, Famke Janssen, Rade Šerbedžija, Leland Orser, Jon Gries, D.B. Sweeney and Luke Grimes. The film follows Bryan Mills taking his family to Istanbul, only to be kidnapped, along with his ex-wife, by the father of one of the men he killed while saving his daughter two years prior.\nIt is the sequel to the 2008 film Taken and the second installment in the Taken trilogy. Released on 5 October 2012, the film grossed over $376 million at the box office, but received largely negative reviews from critics. A third film, Taken 3, was released on 9 January 2015.", "plot": "At the funeral of his son Marko and associates in Tropojë, Albanian mafia head and freelance terrorist Murad Hoxha vows to seek vengeance on his son's killer. Travelling to Paris with his men, he interrogates and tortures former intelligence agent Jean-Claude Pitrel, whose business card was found at the scene of Marko's death, but finds no information. He then bribes a corrupt police official for Pitrel's files and deduces that Pitrel's old friend Bryan Mills was responsible and is holidaying in Istanbul.\nMeanwhile, Bryan has just finished his three-day security job for a wealthy Arabian sheikh in Istanbul and is surprised by his former wife Lenore and daughter Kim turning up to visit him. While going out for lunch with Lenore the next day, Bryan spots Murad's men following them. He tells Lenore to run and tries to outrun the Albanians, but finally surrenders when they capture Lenore. Realising that Kim is also a target, Bryan calls her at the hotel and tells her to hide, but then he is captured and knocked unconscious. She narrowly avoids capture when the kidnappers are forced to flee after shooting two security guards.\nRegaining consciousness, Bryan finds himself zip tied to a pipe over his head in an empty basement. He uses a concealed miniature cell phone hidden in his sock to contact Kim and instructs her to alert the American Embassy; instead she convinces him to let her help. Opening her father's equipment case, Kim takes a grenade and detonates it on a nearby rooftop; the resulting sound allows Bryan to instruct her on triangulating his location.\nThe mobsters bring in Lenore, cut her throat slightly, and hang her upside down to bleed out. As soon as they leave, Bryan frees himself and then her. He next has Kim detonate two more grenades and releases some steam through a chimney to guide her to his location. Kim tosses a gun down the chimney, which Bryan uses to kill the guards holding him captive. He rescues Kim, but watches Lenore get recaptured. Stealing a taxi, Bryan and Kim pursue the kidnappers' van, whereupon an SUV, driven by one of the kidnappers' henchmen, arrives to distract them. A chase and shootout ensue, alerting Turkish police and ending when Bryan manages to lure the SUV into the path of an oncoming train, taking it out.\nLeaving Kim at the U.S. Embassy, Bryan uses his memory to find Murad's hideout. He rescues Lenore and pursues the surviving mobsters to a bathhouse, where he kills them. Confronting Murad, Bryan offers to let him walk if he agrees to return home and cease his desire for revenge. Murad agrees and Bryan drops his gun, but the former goes back on his word and tries to kill Bryan, only to find the gun unloaded. Realizing that Murad will never drop his vendetta against him, Bryan kills him by impaling him onto a sharp towel hook.\nThree weeks later, the Mills family are at a diner back in Los Angeles, having milkshakes to celebrate Kim passing her driving test. They are joined, much to Bryan's surprise, by Kim's boyfriend Jamie, to which she jokingly tells her father not to \"shoot this one\"."}