{"_movieID": "137113", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:47:33", "summary": "Edge of Tomorrow (also known by its marketing tagline Live. Die. Repeat., and renamed as such on home release) is a 2014 American science fiction action film starring Tom Cruise and Emily Blunt. Doug Liman directed the film based on a screenplay adapted from the 2004 Japanese light novel All You Need Is Kill by Hiroshi Sakurazaka. The film takes place in a future where most of Europe is invaded by an alien race. Major William Cage (Cruise), a public relations officer with no combat experience, is forced by his superiors to join a landing operation against the aliens. Though Cage is killed in combat, he finds himself in a time loop that sends him back to the day preceding the battle every time he dies, with some memory of events. Cage teams up with Special Forces warrior Rita Vrataski (Blunt) to improve his fighting skills through the repeated days, while looking for a way to defeat the extraterrestrial invaders.\nIn late 2009, 3 Arts Entertainment purchased the rights to the Japanese novel and sold a spec script to the American studio Warner Bros. The studio produced the film with the involvement of 3 Arts, the novel's publisher Viz Media, and Australian production company Village Roadshow. Filming began in late 2012, taking place in England: at WB Studios in Leavesden, outside London, and other locations, such as London's Trafalgar Square and the coastal Saunton Sands. A total of nine companies handled the visual effects.\nThe film was released in cinemas on the weekend of May 30, 2014, in 28 territories, including the United Kingdom, Brazil, Germany, Spain, and Indonesia. On the weekend of June 6, it was released in 36 additional territories, including North America (United States and Canada), Australia, China, and Russia. The film received positive reviews from critics and was a box office success, grossing over $370.5 million worldwide after its theatrical run, as reported in September. A sequel, titled Live Die Repeat and Repeat, is in development.", "plot": "In 2015, aliens called Mimics arrive in Germany via an asteroid and swiftly conquer most of continental Europe. By 2020, the United Defense Force (UDF), a global military alliance established to combat the alien threat, finally achieves a victory over the Mimics at Verdun using newly developed mech-suits. In Britain, UDF General Brigham orders Major William Cage of the media relations department to cover a massive invasion in France. Cage, having no combat experience, objects and threatens to blame Brigham should the invasion fail. Brigham has Cage arrested and sent to Heathrow Airport, now a military base. Cage awakens to find Brigham has demoted him to a private and assigned him to Master Sergeant Farell and the misfit J-Squad, who do not take kindly to Cage.\nThe invasion is a colossal failure; Farell and J-Squad are killed, and Cage uses a Claymore mine to kill an unusually large Mimic, but dies when the alien's blood dissolves him. Cage jolts awake to find himself back at Heathrow reliving the events of the previous morning. His attempts to warn Farell against the invasion are ignored, and he repeats the loop of dying on the beach and waking at Heathrow again and again, becoming increasingly skilled in combat. During one loop, Cage tries to save Sergeant Rita Vrataski, a celebrated hero of the battle of Verdun, who realizes Cage can loop time and orders him to find her the next time he wakes up.\nCage reawakens and locates Vrataski, who takes him to Dr. Carter, an expert in Mimic biology who explains the Mimics are a superorganism in which the \"Omega\" controls the cerebrum, while the \"Alphas\" behave as the ganglia through which the Omega controls ordinary Mimics. If an Alpha is terminated, the Omega resets the day and rearranges its tactics until the battle is won. Cage inadvertently \"hijacked\" their ability to reset time through his exposure to an Alpha's blood. Vrataski had this ability at Verdun, using it to win the battle before she was wounded and received a blood transfusion, losing the power. She tells Cage to locate and kill the Omega to end the alien invasion.\nOver many more loops, Vrataski trains Cage to excel in combat. After a frustrating lesson, Cage escapes to London, discovering the Mimics will attack there next, and has visions of a dam in Germany where the Omega is hiding. Spending many loops figuring out how to escape the invasion and reach the dam, Cage grows closer to Vrataski, but she is only interested in the mission. Upon reaching a point where Vrataski is killed no matter what they do, Cage flies to the dam alone. Instead of finding the Omega, he is ambushed by an Alpha who attempts to strip him of his ability to reset time, but Cage deliberately drowns himself.\nCage and Vrataski infiltrate the Ministry of Defence, where Cage compels Brigham to give him Carter's prototype device that can locate the Omega. In the ensuing car chase, they discover the Omega is under the Louvre Pyramid in Paris. Cage is captured and seriously injured, waking in a hospital to find he has been given a blood transfusion and lost the ability to loop time.\nVrataski frees Cage and they recruit J-Squad to help destroy the Omega before the invasion begins. They fly to Paris, where the soldiers sacrifice themselves so that Cage and Vrataski can reach the Louvre. Before luring away an Alpha standing between them and the submerged Omega, Vrataski kisses Cage to thank him for getting her as far as he did. The Alpha kills Vrataski and mortally wounds Cage, but he manages to drop a belt of grenades that kills the Omega.\nA dying Cage floats down into the Omega's blood. He awakens en route to his first meeting with Brigham, who announces on TV that Mimic activity has ceased following a mysterious energy surge in Paris. Cage goes to Heathrow and finds Vrataski, who greets him as icily as she did in previous loops, causing Cage to chuckle."}