{"_movieID": "271969", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:09:42", "summary": "Ben-Hur is a 1959 American epic historical drama film, directed by William Wyler, produced by Sam Zimbalist for Metro-Goldwyn-Mayer and starring Charlton Heston as the title character. A remake of the 1925 silent film with a similar title, Ben-Hur was adapted from Lew Wallace's 1880 novel Ben-Hur: A Tale of the Christ. The screenplay is credited to Karl Tunberg, but includes contributions from Maxwell Anderson, S. N. Behrman, Gore Vidal, and Christopher Fry.\nBen-Hur had the largest budget ($15.175 million) as well as the largest sets built of any film produced at the time. Costume designer Elizabeth Haffenden oversaw a staff of 100 wardrobe fabricators to make the costumes, and a workshop employing 200 artists and workmen provided the hundreds of friezes and statues needed in the film. Filming commenced on May 18, 1958, and wrapped on January 7, 1959, with shooting lasting for 12 to 14 hours a day, six days a week. Pre-production began in Italy at Cinecittà around October 1957, and post-production took six months. Under cinematographer Robert L. Surtees, MGM executives made the decision to film the picture in a widescreen format, which Wyler strongly disliked. More than 200 camels and 2,500 horses were used in the shooting of the film, with some 10,000 extras. The sea battle was filmed using miniatures in a huge tank on the back lot at the MGM Studios in Culver City, California. The nine-minute chariot race has become one of cinema's most famous action sequences, and the film score, composed and conducted by Miklós Rózsa, is the longest ever composed for a film and was highly influential on cinema for more than 15 years.\nFollowing a $14.7 million marketing effort, Ben-Hur premiered at Loew's State Theatre in New York City on November 18, 1959. It was the fastest-grossing, as well as the highest-grossing film of 1959, in the process becoming the second highest-grossing film in history at the time after Gone with the Wind. It won a record 11 Academy Awards, including Best Picture, Best Director (Wyler), Best Actor in a Leading Role (Heston), Best Actor in a Supporting Role (Griffith), and Best Cinematography – Color (Surtees). Ben-Hur also won three Golden Globe Awards, including Best Motion Picture – Drama, Best Director and Best Supporting Actor – Motion Picture for Stephen Boyd. Today, Ben-Hur is widely regarded as one of the greatest films of all time, and in 1998 the American Film Institute ranked it the 72nd best American film and the 2nd best American epic film in the AFI's 10 Top 10. In 2004, the National Film Preservation Board selected Ben-Hur for preservation by the National Film Registry of the Library of Congress for being a \"culturally, historically, or aesthetically significant\" motion picture.", "plot": "In AD 26, Judah Ben-Hur (Charlton Heston) is a wealthy Jewish prince and merchant in Jerusalem, who lives with his mother, Miriam (Martha Scott); his sister, Tirzah (Cathy O'Donnell); and their female servant Amrah (Stella Vitelleschi). The family's loyal slave, the merchant Simonides (Sam Jaffe), pays a visit with his daughter, Esther (Haya Harareet). Seeing each other for the first time since childhood, Judah and Esther fall in love, but she is bethrothed to another. Judah's childhood friend, the Roman citizen Messala (Stephen Boyd), is now a tribune. After several years away from Jerusalem, Messala returns as the new commander of the Roman garrison, the Fortress of Antonia. Messala believes in the glory of Rome and its imperial power, while Judah is devoted to his faith and the freedom of the Jewish people. This difference causes tension between the friends, and results in their split after Messala issues an ultimatum demanding that Judah deliver potential rebels amongst the populace to the Roman authorities.\nDuring the parade for the new governor of Judea, Valerius Gratus (Mino Doro), loose tiles fall from the roof of Judah's house. Gratus is thrown from his spooked horse and nearly killed. Although Messala knows this was an accident, he condemns Judah to the galleys and imprisons Miriam and Tirzah due to his residual anger at Judah for his refusal to help. By punishing a known friend and prominent citizen, he hopes to intimidate the Jewish populace. Judah swears to take revenge on Messala. As he and other slaves are being marched to the galleys, they stop in Nazareth to water the Romans' horses. Desperate with thirst, Judah begs for water, but the commander of the Roman detachment denies it to him. He collapses, but is revived when Jesus of Nazareth (Claude Heater) gives him water. After three years as a galley slave, Judah is assigned to the flagship of the Roman Consul Quintus Arrius (Jack Hawkins), who has been charged with destroying a fleet of Macedonian pirates. Arrius admires Judah's determination and self-discipline, and offers to train him as a gladiator or charioteer. Judah declines the offer, declaring that God will aid him in his quest for vengeance. When the Roman fleet encounters the Macedonians, Arrius orders all the rowers except Judah to be chained to their oars. Arrius' galley is rammed and sunk, but Judah unchains the other rowers and rescues Arrius. In despair, Arrius wrongly believes the battle ended in defeat and attempts to atone in the Roman way by falling on his sword, but Judah stops him. They are rescued, and Arrius is credited with the Roman fleet's victory. Arrius successfully petitions Emperor Tiberius (George Relph) to free Judah, and adopts him as his son.\nAnother year passes. Wealthy again, Judah learns Roman ways and becomes a champion charioteer, but still longs for his family and homeland. Judah returns to Judea. Along the way, he meets Balthasar (Finlay Currie) and an Arab, Sheik Ilderim (Hugh Griffith). After noting Judah's prowess as a charioteer, the sheik asks him to drive his quadriga in a race before the new governor of Judea, Pontius Pilate (Frank Thring). Judah declines, even after he learns that Messala will also compete. Judah returns to his home in Jerusalem. He meets Esther, and learns her arranged marriage did not occur and that she is still in love with him. He visits Messala and demands his mother and sister's freedom. The Romans discover that Miriam and Tirzah have contracted leprosy in prison, and expel them from the city. The women beg Esther to conceal their condition from Judah so that he may remember them as they were before, so she tells him that they died. This false revelation changes Judah's mind, and he decides to seek vengeance on Messala by competing against him in the chariot race. During the chariot race, Messala drives a chariot with blades on the hubs to tear apart competing vehicles. He attempts to destroy Judah's chariot but wrecks his own instead. Messala is fatally trampled on by another passing chariot, while Judah wins the race. Before dying, Messala tells Judah that \"the race is not over\" and, in one last act of pure hatred, tells him to search for his family in the Valley of the Lepers.\nJudah visits the nearby leper colony, where he confronts Esther while she is delivering supplies for his mother and sister. Esther convinces Judah to remain hidden from them for now and not break Miriam's wishes. Blaming Roman rule for his family's fate, Judah visits Pilate and rejects his patrimony and Roman citizenship. He returns with Esther to the Leper colony, reveals himself to Miriam and finds out that Tirzah is dying. Judah and Esther take Miriam and her daughter to see Jesus of Nazareth, but the trial of Jesus has begun. As Jesus is being marched through the streets he collapses while carrying his cross. Judah recognizes him as the man who gave him water years before, and returns the gesture. Judah witnesses the crucifixion of Jesus, and Miriam and Tirzah are miraculously healed during the rainstorm following the crucifixion. Judah returns home a changed man and embraces Esther, Miriam and Tirzah."}