{"_movieID": "458253", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:56:41", "summary": "Missing Link is a 2019 American stop-motion animated adventure film written and directed by Chris Butler. It is produced by Laika. It features the voices of Hugh Jackman, Zoe Saldana, David Walliams, Stephen Fry, Matt Lucas, Timothy Olyphant, Amrita Acharia, Ching Valdes-Aran, Emma Thompson, and Zach Galifianakis. The plot follows an English explorer who encounters a Sasquatch and must escort him to his Yeti cousins in the Himalayas.\nMissing Link premiered in New York City on April 7, 2019, before it was theatrically released in the United States on April 12, 2019 by Annapurna Pictures through United Artists Releasing. Although the film was a box-office bomb, it received positive reviews from critics, who praised the \"exquisitely crafted sets and a pleasant, easygoing vibe\".", "plot": "In 1886, Sir Lionel Frost, a struggling investigator of mythical creatures, has continuously searched for different creatures to study and announce their presence in the world, which would allow him to be accepted into the \"Society of Great Men\", which is led by Frost's rival Lord Piggot-Dunceby. Frost receives a letter acknowledging the presence of a Sasquatch, making a deal with Piggot-Dunceby that would allow him to join the society if he proved that the creature was real.\nFrost travels to the Pacific Northwest, eventually stumbling upon the Sasquatch in a forest. After dubbing him \"Mr. Link,\" Frost is told by the Sasquatch that he was in fact the one who sent the letter. Mr. Link requests Frost's help in finding his relatives, the Yetis, in the Himalayas. Frost agrees to help him, but is unaware of the fact that Piggot-Dunceby has hired a bounty hunter named Willard Stenk to track Frost and kill him, ensuring that the pro-imperialist conservative views of the society remain unchallenged.\nFrost's old lover Adelina Fortnight has a map to the Himalayas locked in a safe that belonged to her late husband, one of Frost's past partners, so the two visit her mansion to acquire it. However, Adelina harbors resentment for Frost missing her husband's funeral and kicks him out when he offers to pay her for the map. Frost and Mr. Link come back later at night and break in, but Mr. Link's noise-making awakens Adelina, and the safe eventually falls out of the top floor window, cracking open in the aftermath. Frost and Mr. Link grab the map and escape, but are discovered the next day by Fortnight who allows them to search for the Yetis as long as she is there to accompany them. Stenk arrives and a shootout ensues, but the trio trick their pursuer into hopping on the train to search for them.\nThe trio make their journey via boat, and Fortnight pressures Frost into reaching out to Mr. Link to prove his sincerity. Frost enjoys a heartwarming talk with Mr. Link on the boat's deck where Mr. Link gives himself the name \"Susan\", after a friendly prospector he once encountered. However, they are once again ambushed by Stenk. After various scuffles across different parts of the ship, the trio eventually locks Stenk in the boat's boarding rooms while they make another escape.\nThe trio eventually makes their way to the Himalayas and are pointed in the direction of the Yeti temple, and led to their Queen, who reveals their secluded valley to the group. She then reveals their disdain for mankind extends to Susan, who's interacted closely with them. They throw the trio in a pit for them to stay until they die. Susan gives Fortnight a boost and she knocks down a few Yeti guards, allowing them to stack them and escape. They run across the ice bridge, where an armed Piggot-Dunceby and Stenk are waiting at the center of the bridge. Frost denounces his rival's pride and defends Susan as more human than the society ever will be. As a result, the insane Piggot-Dunceby starts firing his rifle at the ice bridge to kill the trio, until Susan stops Piggot-Dunceby from getting any further, still causing it to crack and break. Piggot-Dunceby and his assistant Mr. Collick fall to their deaths while the trio and Stenk make a run for it. They are too late and are left hanging on the edge of the destroyed ice bridge. Stenk, who has made it all the way across, taunts Frost, which leads to the two engaging in a slapping fight while hanging on the bridge. The trio work together to rid themselves of Stenk, who falls to his death after an icicle breaks and falls on him. Frost appoints Susan as his new partner in investigations, who blows a raspberry at the Yeti leader.\nAfter arriving home, Fortnight tells Frost that she will be adventuring on her own for a while and departs, but not before the pair share a brief mutual acceptance of their feelings for each other. Susan and Frost arrive back at the latter's work-space and begin their next case to find Atlantis. After they leave, the end credits reveal maps and souvenirs of their subsequent adventures."}