{"_movieID": "49444", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:51:14", "summary": "Kung Fu Panda 2 is a 2011 American computer-animated wuxia comedy-drama film produced by DreamWorks Animation and distributed by Paramount Pictures. The sequel to 2008's Kung Fu Panda, it is the second installment in the Kung Fu Panda franchise, and was directed by Jennifer Yuh Nelson in her directorial debut. The film stars Jack Black, Angelina Jolie, Dustin Hoffman, Seth Rogen, Lucy Liu, David Cross, James Hong, and Jackie Chan reprising their character roles from the first film, with Gary Oldman, Michelle Yeoh, Danny McBride, Dennis Haysbert, Jean-Claude Van Damme and Victor Garber voicing new characters. In the film, Po and the Furious Five battle an evil white peacock king named Lord Shen who has a powerful weapon that he plans to conquer China with. Meanwhile, Po discovers a terrifying secret about his past, and discovers that Shen has something to do with it.\nThe film was released in theaters on May 26, 2011 in Real D 3D and Digital 3D formats. Like its predecessor, Kung Fu Panda 2 received generally positive reviews, with critics praising its animation, voice acting, action scenes, musical score and character development and grossed $665 million worldwide against its $150 million budget. The film was the highest-grossing animated feature film of the year and was nominated for the 2011 Academy Award for Best Animated Feature at the 84th Academy Awards, losing to Rango. It was followed by Kung Fu Panda 3 in 2016.", "plot": "Lord Shen, the scion of a peacock clan that rules Gongmen City in ancient China, seeks to weaponize his family's recently invented fireworks. After discovering from the court's goat soothsayer that \"a warrior of black-and-white\" will defeat him if he does not change his ways, Shen leads an army of wolves to exterminate the panda population to avert the prophecy. Shen's parents are horrified by this atrocity and exile him as punishment.\nThirty years later, Po is living his dream as the Dragon Warrior, protecting the Valley of Peace alongside his friends and fellow kung fu masters, the Furious Five. However, his teacher Shifu tells him that he has yet to achieve inner peace. While defending a village from wolf bandits who have been stealing metal for Shen, Po is distracted by a symbol on their leader's armor, which causes him to have a flashback of his mother and allows the wolves to escape. Po asks his goose father, Mr. Ping, about his origins; Ping reveals that he found Po as an infant in a radish crate and adopted him, but Po remains unsatisfied, wondering how and why he ended up in the valley.\nShifu learns that Shen has returned to Gongmen City and killed Thundering Rhino, the leader of the kung fu council protecting the City, and is plotting to conquer China with his newly developed cannon that was forged with the stolen metal. Shifu sends Po and the Furious Five to Gongmen City to stop Shen and destroy his weapon. They find the city occupied by Shen's forces, with the two surviving council members Storming Ox and Croc imprisoned, refusing to help liberate the city due to Shen's \"unstoppable\" weapon. Po and the Five are discovered by the wolf boss and give chase, only to be arrested in front of Shen's tower.\nUpon being brought before Shen in his tower, Po and the Five escape and destroy Shen's weapon. However, Po is again distracted by a flashback upon seeing the same symbol as before on Shen's plumage, realizing Shen was there the last night Po saw his parents. This allows Shen to escape and destroy the tower with an arsenal of cannons. After Tigress demands to know why Po let Shen get away, he reveals that Shen knows something about his past and has to face him again. Though understanding, Tigress makes Po stay at the prison while she and the other Furious Five leave to stop further production of Shen's cannons. Po breaks into the factory to question Shen about his past, inadvertently foiling the Five's plan to destroy the factory and causing them to be captured. Shen claims that Po's parents abandoned him before blasting Po out of the factory with a giant cannon, where he is presumed dead.\nPo survives and is rescued by the soothsayer, who takes him to the ruins of the nearby village where Po was born. Guided by the soothsayer to embrace his past, Po remembers that when he was an infant, his parents had sacrificed themselves to save him from Shen's army, his mother hiding him in a radish crate and luring Shen's forces away from him. Po attains inner peace, realizing that he has lived a happy and fulfilling life despite this early tragedy. Po returns to Gongmen City to save the captive Five and prevent Shen's conquest of China. A battle ensues between Shen's armada and Po, the Five, Shifu, Ox, and Croc. Po modifies the movements used during his inner peace training to manipulate and redirect Shen's cannonballs against his own armada, destroying them. Po then urges Shen to let go of his own past, but Shen attacks Po until Shen accidentally kills himself by slashing the ropes holding up his last cannon, which falls and crushes him.\nVictorious, Po returns to the Valley of Peace and reunites with Mr. Ping, lovingly declaring the goose to be his father. At the same time, Po's birth father is revealed to be alive in a hidden village inhabited by surviving pandas, and senses that his son is still alive."}