{"_movieID": "244539", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:55:40", "summary": "Infinitely Polar Bear is a 2014 American comedy-drama film written and directed by Maya Forbes, and starring Mark Ruffalo, Zoe Saldana, Imogene Wolodarsky, and Ashley Aufderheide. The film premiered in competition at the 30th Sundance Film Festival on January 18, 2014. The film was released on June 19, 2015, by Sony Pictures Classics.\n\n", "plot": "In the late 1970s, Cameron Stuart is a Boston man diagnosed with bipolar disorder. He has had a psychotic break, which has caused him to be fired from his job and hospitalized. To be able to afford to take care of their two young children, Cam's wife, Maggie, moves herself, and the children to a small rent-controlled apartment, where she struggles to find enough work to support the three of them.\nAs Cameron is rehabilitated, he moves from a halfway house out on his own. Maggie begins to apply to business schools so the family will eventually become more financially secure, for the sake of the children who are attending a third-rate school in a bad part of town. Maggie manages to obtain a scholarship to attend Columbia University, and she asks Cameron to take care of their daughters while she moves to New York for eighteen months in order to obtain her M.B.A. degree. Cameron reluctantly agrees.\nThe girls are embarrassed to live with Cameron, who sometimes abandons them in the middle of the night, is aggressively friendly with their neighbors, and starts countless messy projects, making their apartment nearly unlivable. However, his daughters love Cameron deeply and try to help him raise them. Cameron takes them to visit his grandmother, a wealthy Boston Brahmin who controls the family trust, and who pays the cost of their rent-controlled apartment. After his grandmother tries to give Cameron her Bentley, he asks her to instead pay for the girls to be privately educated, but the grandmother refuses.\nMaggie begins to near graduation, which Cameron hopes will enable them to live like a family once more. However, Cameron reveals to Maggie that he has been off his lithium since she left, and Maggie is unable to find a suitable job in Boston. Maggie decides to take a job she has been offered at E. F. Hutton & Co. in New York City, leaving Cameron behind in Boston, and taking the girls with her.\nSeeing how unhappy the girls will be, and realizing that her new demanding job will force her to work upwards of twelve hours a day, Maggie decides that, although she will accept the job, she will leave the children in Boston with Cameron, sending money back, so that the girls will be able to attend a good private school. A year later, the girls are enrolled in private school, and Cameron continues to take care of them and watch them proudly.", "cast": "Mark Ruffalo as Cam Stuart\nZoe Saldana as Maggie Stuart\nImogene Wolodarsky (Forbes's 12-year-old daughter) as Amelia Stuart\nAshley Aufderheide as Faith Stuart\nKeir Dullea as Murray Stuart\nBeth Dixon as Pauline Stuart\nMuriel Gould as Gaga\nPaul Elias as Dick\nScott Mildenhall as Grizzly"}