{"_movieID": "332340", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:07:31", "summary": "Man Up is a 2015 British-French romantic comedy film directed by Ben Palmer from a screenplay written by Tess Morris, starring Lake Bell and Simon Pegg. The film follows a single 34-year-old woman (Bell), who after being mistaken for a stranger's blind date, finds the perfect boyfriend in a 40-year-old divorcé (Pegg). The film was released on 29 May 2015 by StudioCanal.", "plot": "Nancy is 34 years old and has been single for four years. She holds a pessimistic view on love, but her sister hopes that Nancy can find love and encourages her to \"put herself out there.\" Nancy has an awkward blind date at her friend's engagement party.\nNancy takes the train to London to attend her parents' 40th anniversary celebration. On the train, Nancy sits across from Jessica, a bubbly 24-year-old woman who is going on a blind date based on a self-help book called 6 Billion People and You. Nancy is rude to Jessica, so when Nancy falls asleep, Jessica leaves behind her copy of the book, bookmarking Chapter 7, \"Your Negative Thoughts are Ruining Your Life (And Everyone Else's...)\". At London Waterloo station, Nancy pursues Jessica to return the book, but is stopped by Jack, Jessica's blind date, who thinks she is Jessica because of the book. Before Nancy  can explain she is not Jessica, the nervous Jack charms her with his rambling introduction. She decides to take a chance and pretend that she is Jessica, and the pair have a very good time drinking and bowling, but Nancy's ruse is destroyed when they run into her creepy secondary school acquaintance, Sean.\nNancy and an angry Jack argue and return to the bar to retrieve his bag and his notebook, where they run into Hilary and Ed, Jack's soon-to-be-ex-wife with the man she left him for. Nancy goes along with Jack's own ruse when he pretends she is his girlfriend. The presence of the self-assured Nancy irritates Hilary, but Nancy ends up consoling Jack in the bathroom, where she shares the story of her own ex and helps him achieve closure.\nNancy wants to invite Jack to her parents' anniversary party — but Jessica has left telephone messages for Jack and still wants to meet up, so he parts ways with Nancy. Nancy arrives at her parents’ party, but is very sad and Jack, who has little in common with Jessica, also quickly realises that letting her go was a mistake. After Jessica- who is pleased about Jack and Nancy's \"love story\" because it supports her optimistic view of the world- sees him off in a taxi, he enlists the help of Sean and some teenagers (Sean sent Jack to the wrong house and went off to try his luck with Nancy himself - to little avail - but one of the teenagers knew where she lived and they all went there together) to find Nancy's house and they decide to take a chance on each other.", "cast": "Lake Bell as Nancy\nSimon Pegg as Jack\nSharon Horgan as Elaine\nRory Kinnear as Sean\nKen Stott as Bert\nHarriet Walter as Fran\nOphelia Lovibond as Jessica\nOlivia Williams as Hilary\nStephen Campbell Moore as Ed\nHenry Lloyd-Hughes as Daniel\nDean-Charles Chapman as Harry\nRobert Wilfort as Ryan\nJohn Bradley as Andy (room service)\nPhoebe Waller-Bridge as Katie (Engagement party)"}