{"_movieID": "156022", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:12:44", "summary": "The Equalizer 2 (sometimes promoted as The Equalizer II or EQ2) is a 2018 American vigilante action thriller film directed by Antoine Fuqua. It is the sequel to the 2014 film The Equalizer, which was based on the TV series of the same name. The film stars Denzel Washington, Pedro Pascal, Ashton Sanders, Melissa Leo, and Bill Pullman. It follows retired United States Marine and ex-DIA agent Robert McCall as he sets out on a path of revenge after one of his friends is killed. The film is the fourth collaboration between Washington and Fuqua, following Training Day (2001), The Equalizer (2014), and The Magnificent Seven (2016).\nTalks of an Equalizer sequel began seven months prior to the release of the first film. The project was officially announced in April 2015. Filming began in September 2017, and took place in Boston as well as other areas around Massachusetts. It also marks the first time Washington has starred in a sequel to one of his films.\nThe Equalizer 2 was released in the United States on July 20, 2018 by Sony Pictures Releasing. The film has grossed $190.5 million worldwide and received mixed reviews, with critics praising Washington's performance and the film's action sequences, but criticizing the pacing and number of subplots.", "plot": "Former Marine and Defense Intelligence Agency (DIA) operative Robert McCall now lives in a diverse apartment complex in Roxbury, Boston. He is working as a Lyft driver and assists the less fortunate with the help of his close friend and former CIA colleague, Susan Plummer. McCall travels to Istanbul to retrieve a Boston bookstore owner's daughter, kidnapped by her father. He also helps Sam Rubinstein, an elderly Holocaust survivor who is looking for a painting of his sister; the siblings were separated in the Nazi death camps and the painting had been auctioned off. After discovering the apartment's courtyard has been vandalised, McCall accepts an offer from Miles Whittaker, a young resident with an artistic but troubled background, to repaint the walls. McCall later rescues Miles, who had been lured away by a local gang.\nSusan and DIA operative Dave York, McCall's former partner, are called to investigate the murder-suicide of an agency affiliate and his wife in Brussels. At their hotel, Susan is accosted in her room and killed in a robbery by two men who got off the elevator on her floor. When he receives the news, McCall begins to investigate both her death and the case she was working on. McCall determines that the suspects' foreknowledge of her floor and the expertly-delivered fatal stab suggest that she was targeted. He also confirms that the incident Susan was looking into was staged to look like a murder-suicide, and that Susan's death is probably connected to it. McCall makes contact with York, who had thought him dead for years, and informs him of his findings.\nDuring one of his Lyft runs, McCall is attacked by a passenger. McCall kills the assailant and retrieves his phone, discovering that York was on the phone's call list. He confronts York at his home, where York admits that he became a mercenary after feeling used and discarded by the government, and that he himself finished Susan off, as she would have figured out that he was behind the Brussels killing. McCall leaves the house where the rest of McCall's former squad, and York's current teammates – Kovac, Ari, and Resnik – are waiting. McCall promises to kill the entire team before escaping safely by getting a ride from York's unsuspecting wife and children.\nResnik and Ari head to Susan's house to kill her husband Brian, but McCall helps him escape. York and Kovac break into McCall's apartment, where Miles is painting the walls. Monitoring via webcams, McCall directs Miles to a passage concealed behind a book case; when York seems to close in on the passage's two-way mirror, McCall phones him to taunt him. Miles emerges from hiding shortly after York and Kovac seem to leave, but is captured as he opens the apartment's front door. \nYork deduces that McCall has gone to his seaside hometown, now evacuated as a hurricane approaches. Kovac, Ari, and Resnik begin searching the town in gale-force winds, as York situates himself on the town's watchtower in a sniper's position. Kovac enters a tackle shop and is killed with a harpoon gun. When Ari heads toward the seaside, he is disturbed by pictures of Susan that he sees along the way; catching him off guard, McCall butchers him with a knife. McCall then enters his late wife's old bakery to lure in Resnik, who is incinerated in a flour explosion set off by his own stun grenade. York reveals that he has Miles tied up in the trunk of his car and begins shooting at it to lure McCall out. With the storm growing heavier, York is knocked down by a gust of wind before being confronted by McCall atop the tower. McCall gets the upper hand and kills York in the same manner in which Susan was killed, then tosses him onto the rocks below, where he is washed away by the ocean.\nBack in Boston, Susan's information about Sam's painting helps McCall reunite Sam with his long-lost sister. Miles finishes repainting the apartment complex, returns to school and focuses on his art. Having moved back into his old house, McCall looks out towards the calm sea.", "cast": "Denzel Washington as Robert McCall\nPedro Pascal as Dave York\nAshton Sanders as Miles Whittaker\nOrson Bean as Sam Rubinstein\nBill Pullman as Brian Plummer\nMelissa Leo as Susan Plummer\nJonathan Scarfe as Resnik\nSakina Jaffrey as Fatima\nKazy Tauginas as Ari\nGarrett Golden as Kovac"}