{"_movieID": "328037", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:39:21", "summary": "Monty Python's The Meaning of Life, also known simply as The Meaning of Life, is a 1983 British musical sketch comedy film written and performed by the Monty Python troupe, directed by Terry Jones. It was the last film to feature all six Python members before Graham Chapman's death in 1989.\nUnlike Holy Grail and Life of Brian, the film's two predecessors, which each told a single, more-or-less coherent story, The Meaning of Life returned to the sketch format of the troupe's original television series and their first film from twelve years earlier, And Now for Something Completely Different, loosely structured as a series of comic sketches about the various stages of life. It was accompanied by the short film The Crimson Permanent Assurance.\nReleased on 23 June 1983 in the United Kingdom, The Meaning of Life, although not as acclaimed as its predecessors, was still well received critically and was a minor box office success, grossing almost $15 million on a $9 million budget. It also screened at the 1983 Cannes Film Festival, where it won the Grand Prix. The film appears in a 2010 list of the top 20 cult films published by The Boston Globe.\n\n", "plot": "A group of fish in a posh restaurant's tank swim together casually, until they look at the customers outside of the tank and see their friend Howard being eaten. This leads them to question the meaning of life. The question is explored in the first sketch, \"The Miracle of Birth\", which features a woman in labour being ignored by the doctors in favour of impressing the hospital's medically-clueless administrator. Meanwhile in Yorkshire, described as \"the third world\", a Roman Catholic man loses his job and returns home to tell his numerous children that he will have to sell them off for scientific experiments due to the Catholic church's opposition to contraception; this leads to the musical number \"Every Sperm Is Sacred\". A Protestant man and his wife look on disapprovingly, and discuss having non-reproductive sex (they add that they have two children, which is the exact number of times they have had sex in their marriage).\nIn \"Growth and Learning\", a class of boys are taught school etiquette before partaking in a sex education lesson which involves watching their teacher have sex with his wife. One boy laughs, and is forced into a violent rugby match pitting pupils against the adult school masters as punishment. \"Fighting Each Other\" focuses on three scenes concerning the British military: first a World War I officer tries to rally his men to remain in cover during an attack, but they insist on throwing him a distracting going away party; second, a modern army RSM attempts to drill his platoon but ends up excusing them all to pursue leisure activities. Lastly, in 1879, during the Anglo-Zulu War, a soldier finds his leg has been bitten off. Suspecting a tiger, despite being in Africa, the soldiers hunt for it and find two men suspiciously wearing two halves of a tiger costume.\nThe prior sequences ends abruptly with a host introducing \"The Middle of the Film\", beginning with a surreal segment called \"Find the Fish\", wherein bizarre characters ask the audience to find a hidden fish over a strange musical number. \"Middle Age\" involves a middle-aged American couple visiting a Hawaiian restaurant themed around Medieval torture, where, to the interest of the fish, the waiter offers a conversation about philosophy and the meaning of life. The customers are unable to make sense of it and move on to a discussion of \"live organ transplants\". \"Live Organ Transplants\" involves two paramedics visiting Mr. Brown, a card-carrying organ donor, forcefully removing his liver whilst he is still alive. Brown's wife is pressured to donate her own liver while alive, which involves meeting a musician who performs \"Galaxy Song\" while discussing man's insignificance in the universe. The Crimson Permanent Assurance pirates from the short pre-film feature appear to invade a corporate boardroom where executives are discussing the meaning of life, but a tumbling skyscraper ends their assault.\nIn \"The Autumn Years\", the horrible and grotesquely obese Mr. Creosote visits a French restaurant, to the horror of the other guests and the fish tank. He vomits continuously and devours an enormous meal. When the maître d' persuades him to eat one last wafer-thin mint, Creosote's stomach begins to rapidly expand until it explodes, the maître d' then giving him the bill. Two staff members clean up Creosote's remains while discussing the meaning of life. A third waiter leads the audience to his house, spouts some weak philosophy, and then angrily dismisses them after his point trails off.\n\"Death\" features a condemned man choosing the manner of his own execution: being chased off the Cliffs of Dover by topless women in sports gear and falling into his own grave below. The Grim Reaper thereupon enters an isolated country house and invites himself to dinner. The guests try to guess who he is until the Reaper tells them they all died from food poisoning. They accompany the Grim Reaper to Heaven, revealed to be the Hawaiian restaurant from earlier. They enter into a Las Vegas-style hotel where perpetual Christmas happens, with all the characters from the previous sketches as guests, and where a Tony Bennett-style singer performs \"Christmas in Heaven\" to the cast.\nThe song is cut off abruptly for \"The End of the Film\", an epilogue features the host of \"The Middle of the Film\" being handed an envelope containing the meaning of life. She reads it out: \"Try and be nice to people, avoid eating fat, read a good book every now and then, get some walking in, and try and live together in peace and harmony with people of all creeds and nations\".", "cast": "Graham Chapman as Chairman / Fish No. 1 / Doctor / Harry Blackitt / Wymer / Hordern / General / Coles / Narrator No. 2 / Dr Livingstone / Transvestite / Eric / Guest No. 1 / Arthur Jarrett / Geoffrey / Tony Bennett-esque singer\nJohn Cleese as Fish No. 2 / Dr Spencer / Humphrey Williams / Sturridge / Ainsworth / Waiter / Eric's assistant / Maître D' / Grim Reaper\nTerry Gilliam as Window Washer / Fish No. 4 / Walters / Middle of the Film announcer / M'Lady Joeline / Mr Brown / Howard Katzenberg\nEric Idle as Gunther / Fish No. 3 / 'Meaning of Life' singer / Mr Moore / Mrs Blackitt / Watson / Blackitt / Atkinson / Perkins / Victim #3 / Man in Front / Mrs Hendy / Man in Pink / Noël Coward / Gaston / Angela\nTerry Jones as Bert / Fish No. 6 / Mum / Priest / Biggs / Sergeant / Man with Bendy Arms / Mrs. Brown / Mr Creosote / Maria / Leaf Father / Fiona Portland-Smythe\nMichael Palin as Window Washer / Harry / Fish No. 5 / Mr Pycroft / Dad / Narrator No. 1 / Chaplain / Carter / Spadger / Regimental Seargeant Major / Pakenham-Walsh / Man in Rear End / Female TV Presenter / Mr Marvin Hendy / Governor / Leaf Son / Debbie KatzenbergThe main company of Monty Python members, who appeared in multiple roles in nearly every section of the film, was supported by featured cast mates:\n\nCarol Cleveland\nSimon Jones\nPatricia Quinn\nJudy Loe\nAndrew MacLachlin\nMark Holmes\nValerie Whittington"}