{"_movieID": "256835", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:40:34", "summary": "Toy Story That Time Forgot is a prehistoric-themed 22-minute television special produced by Pixar Animation Studios and Walt Disney Television Animation that aired on ABC on December 2, 2014. It was written and directed by Steve Purcell and produced by Galyn Susman. Michael Giacchino composed the music for the special. Most of the regular cast from the Toy Story series reprised their roles, including Tom Hanks as Woody, Tim Allen as Buzz Lightyear, Kristen Schaal as Trixie, Wallace Shawn as Rex, Timothy Dalton as Mr. Pricklepants, Don Rickles as Mr. Potato Head, and Joan Cusack as Jessie, with Kevin McKidd and Emma Hudak joining as new characters Reptillus Maximus and Angel Kitty, respectively. The special was Rickles' final role before his death on April 6, 2017, and was the last Toy Story production until the release of Toy Story 4 in 2019. The film was generally well received.", "plot": "During a post-Christmas playdate, Trixie is sad that Bonnie never depicts her as a dinosaur when they play. Bonnie later takes Trixie, Woody, Buzz Lightyear, Rex, and aphorism-spouting Christmas ornament Angel Kitty to her best friend Mason's house for a play date. Bonnie ends up tossing the toys into Mason's playroom to join Mason in playing with his video game console.\nBonnie's toys discover the playroom is dominated by \"Battlesaurs\", a huge dinosaur-themed playset that Mason received for Christmas, led by warrior Reptillus Maximus and The Cleric. Trixie is delighted to interact with them as a dinosaur. She and Rex are armed as warriors, unaware that Woody and Buzz have been taken prisoners. Reptillus and Trixie quickly grow close, but it is soon revealed that the Battlesaurs have not yet been played with, and therefore do not know that they are toys. To Trixie's horror, Mason's other toys are violently attacked in an arena. Woody and Buzz are then brought in to fight, but Trixie defends them. The Cleric denounces Trixie for bearing Bonnie's name on her foot; she flees to get Bonnie's help, and Reptillus is sent after her. She shows him his own toy package, which enrages him.\nIn the arena, the Cleric takes control of Rex's robotic armaments and forces him to seize Woody and Buzz. They realize the Cleric is aware of Mason and their status as toys; with Mason preoccupied by the video game, the Cleric maintains authoritarian control over the Battlesaurs, and apparently, the playroom. The Cleric intends to destroy Woody, Buzz, and Angel Kitty. In Mason's bedroom, Reptillus confronts Trixie as she is about to deactivate the video game. She convinces him that \"surrendering\" to a child for playtime will broaden his horizons, and he reluctantly turns the game off. Mason finds Reptillus, and Bonnie begins playing with him, which convinces Mason to do the same. The children return to the playroom just in time to unknowingly save Woody and Buzz, and they play with the Battlesaurs and other toys in a variety of non-combat settings. Reptillus calls the experience \"glorious\".\nBack in Bonnie's room, Trixie tells the other toys that she is \"Bonnie's dinosaur\", and is happy in every role Bonnie has for her. Angel Kitty gives one last moral and inexplicably vanishes.\nThat night in Mason's room, Reptillus happily bears Mason's name on his hand and looks forward to seeing Trixie at Mason and Bonnie's next playdate, already scheduled for the following week.", "cast": "Tom Hanks as Woody, a cowboy doll\nTim Allen as Buzz Lightyear, a toy Space Ranger\nKristen Schaal as Trixie a toy Triceratops\nKevin McKidd as Reptillus Maximus, a dinosaur action figure and Woody & Buzz's nemesis\nEmily Hahn as Bonnie\nWallace Shawn as Rex, a toy Tyrannosaurus rex\nSteve Purcell as The Cleric, the leader of the Battlesaurs and the arch-enemies of Woody, Buzz, Trixie, Angel Kitty and Rex\nJonathan Kydd as Ray-gon\nR.C. Cope as Mason, Bonnie's friend\nDon Rickles as Mr. Potato Head\nTimothy Dalton as Mr. Pricklepants\nLori Alan as Bonnie's mom\nJoan Cusack as Jessie, a cowgirl doll and Buzz's love interest\nEmma Hudak as Angel Kitty"}