{"_movieID": "449758", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:32:03", "summary": "Five Came Back is a 1939 American black-and-white melodrama from RKO Radio Pictures, produced by Robert Sisk, directed by John Farrow, that stars Chester Morris and Lucille Ball. The film was photographed by cinematographer Nicholas Musuraca, and written by Jerry Cady, Dalton Trumbo, and Nathanael West. Although considered a B movie, the positive notices received by  Ball helped launch her as an A-list actress. Five Came Back is considered a precursor of the disaster film genre.In 1948 Five Came Back was remade (differing only in minor details) as the Mexican film Los que volvieron and again in 1956 by producer-director Farrow as Back from Eternity, starring Robert Ryan and Anita Ekberg.", "plot": "Nine passengers board a commercial flight from Los Angeles to Panama City: wealthy Judson Ellis (Patric Knowles) and Alice Melhorne (Wendy Barrie), eloping because their parents disapprove; an elderly couple, Professor Henry Spengler (C. Aubrey Smith) and his wife Martha (Elisabeth Risdon); Tommy Mulvaney (Casey Johnson), the young son of a gangster, and his escort, gunman Pete (Allen Jenkins); Peggy Nolan (Lucille Ball), a woman with a shady past; and Vasquez (Joseph Calleia), an anarchist being extradited and facing a death sentence for killing a high-ranking politician, and his deportation guard, Crimp (John Carradine), who expects a substantial reward for delivering him. The crew comprises pilot Bill (Chester Morris), co-pilot Joe Brooks (Kent Taylor), and steward Larry (Dick Hogan).\n\nOn their way to Panama, a fierce nighttime storm buffets their airliner, The Silver Queen. A gas cylinder is shaken loose and knocks a door open and little Tommy falls against it; steward Larry attempts to close it and hands Tommy up to one of the other passengers, just before he falls through the open door to his death. An engine fails and the pilots are forced to crash-land in jungle terrain. In the morning the professor recognizes plants of the Amazon rainforest: the aircraft has been blown far south of where rescuers will search; the nearest civilization is across the mountains. But there is water, and enough fruit and game for everyone to live on.\nWeeks go by while Bill and Joe struggle to repair the damaged airliner, while the others clear a runway and lighten the aircraft by removing all unnecessary weight. The experience changes everyone. The Spenglers rediscover their love for each other. Bill warms to an appreciative Peggy, although she tells him about her sordid past. Judson falls apart, staying drunk much of the time, while Alice toughens up and begins to feel attracted to Joe. The biggest change is to Vasquez. Seeing how well most of the group have coped with their situation, he reconsiders his radical beliefs.\nOn the 23rd day, Crimp disappears; Tommy eventually discovers his dead body. When Peggy and Pete go looking for Tommy, he leads them to Crimp's body, which has a poison dart stuck in it. Pete orders Peggy to take Tommy to safety while he covers their retreat, but he is quickly killed by unseen natives.\nThe remaining survivors board the now-repaired airliner, but as the engines turn over, an oil leak develops. Bill and Joe patch it, but realize that their repair will fail some time after takeoff, leaving only one running engine. As a result, the aircraft can only carry four adults and Tommy across the mountains. As everyone tries to decide how to choose who must stay behind, Vasquez suddenly grabs a pistol and announces that, since he is doomed no matter what, he is the only one without bias and will make the decision. While the leak repairs are being made, he is approached by Professor Spengler, who says that he and his wife have lived their lives and should stay; then Judson tries to bribe Vasquez by offering to pay for a top lawyer.\nWhen the aircraft is ready, Vasquez announces that both pilots and both of the younger women will go along with Tommy. Judson attacks, and Vasquez shoots him dead. The airliner takes off, leaving behind Vasquez and the Spenglers. As the natives approach, Professor Spengler quietly informs Vasquez that they must not be taken alive, as they will be tortured. Vasquez lies to him, telling him that there are three bullets left. He kills the couple with his last two bullets, and then awaits his grisly fate."}