{"_movieID": "356298", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:48:13", "summary": "Don't Think Twice is a 2016 American comedy-drama film written and directed by Mike Birbiglia and stars Birbiglia, Keegan-Michael Key, Gillian Jacobs, Kate Micucci, Tami Sagher and Chris Gethard. The film had its world premiere at South by Southwest on March 13, 2016 and was released on July 22, 2016, by The Film Arcade.", "plot": "The Commune is an improv troupe in New York headed by Miles (Birbiglia).  Other members include Jack, a talented improviser with a tendency to grandstand; Sam, his insecure girlfriend who acts as the group's emcee; Allison, who has been working on a graphic novel for years; Lindsay, who lives off of her wealthy parents; and Bill, who loves improv but feels increasingly unsuccessful.  One night, the group learns that staff from Weekend Live, a Saturday Night Live–style show, are attending a performance.  Miles is excited for another chance to audition for the show, having auditioned and not been selected years ago.  However, Jack ends up grandstanding during the performance, much to the anger of the rest of the group.\nFollowing the performance, Jack receives a phone call informing him that he and Sam are being invited to audition.  Jack attends the audition, but Sam loses her nerve at the last minute and does not.  Jack is selected as a new cast member, and his friends begin asking about the possibility of joining the writing staff, or having Jack arrange auditions for them.  Meanwhile, Bill's father is in a serious motorcycle accident and the group travels to Philadelphia to visit him in the hospital.\nJack finds success at Weekend Live playing an old-timey ticket taker in a sketch, but finds the pressure of the show difficult to manage.  The Commune sees an uptick in its audience, but they are mostly there to see Jack and his ticket taker character rather than the rest of the performers.  With their theater space closing, the group decides to hold a show at a new space, but the ticket price discourages audiences from attending and they fail to recoup their investment.\nThe group gathers to watch Weekend Live and discovers Jack performing a sketch they had improvised at a prior Commune show.  Infuriated, the group crashes the after party.  Miles confronts Jack and punches him before being thrown out.  When he then confronts Lindsay for failing to support him, she reveals that she has been hired by the show and did not want to embarrass herself in front of her new co workers.  Embittered by this revelation, Miles, Allison, and Bill storm off.\nAt the final Commune show, Sam stands on stage alone and asks her usual opening question \"Has anyone had a particularly bad day?\"  When an audience member suggests that Sam herself looks like she's had a bad day, she agrees and launches into a solo improv where she is trapped at the bottom of a well while her other castmates cannot decide how to help her.  Jack arrives and joins the scene, promising that he will not abandon her.  But Sam tells him that she is happy in the well and she knows and accepts that their relationship is over.\nEight months later, Jack continues to enjoy success on Weekend Live.  Miles is in a long term relationship with an old flame from high school, and Sam, Bill, and Allison are starting a new improv group and looking for local talent.  Despite their conflict, the group has remained friends."}