{"_movieID": "50837", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:14", "summary": "Martha Marcy May Marlene is a 2011 American dramatic thriller film written and directed by Sean Durkin, and starring Elizabeth Olsen, John Hawkes, Sarah Paulson, and Hugh Dancy. The plot focuses on a young woman suffering from delusions and paranoia after returning to her family from an abusive cult in the Catskill Mountains. The film contains several references to the music of Jackson C. Frank.", "plot": "A 22-year-old woman named Martha has been living as a member of a cult in the Catskill Mountains for some time. The charismatic cult leader, Patrick, granted her the name Marcy May upon her initiation. However, she decides to flee, and escapes into the woods, arriving at a nearby town. In a diner, she is confronted by Watts, a cult member, who attempts to persuade her to return, but she refuses. Martha calls her sister, Lucy. Lucy picks her up and takes her to the vacation lake house in Connecticut that she shares with her husband, a successful and wealthy architect named Ted.\nWhile staying with Lucy and Ted at the lake house, Martha begins exhibiting strange behavior: swimming in a public lake naked, sleeping all the time, not eating, and arguing with her sister and brother-in-law about how to live. Lucy reveals she abandoned Martha and is now attempting to get her back into her life, while she and Ted are also trying to have their own child. One night, Martha climbs into bed with Ted and Lucy while they are having sex, angering Ted. Martha then attempts to phone the cult, but hangs up when one of the female members answer using the code name Marlene Lewis.\nIn flashbacks, Martha recalls a series of disturbing events that led to her escape the cult: While a member, she was drugged and raped by Patrick in an initiation ritual, which she later facilitated for other incoming female members. Patrick would later urge her to murder a cat, which she refused to do. She subsequently began participating in burglaries with the other cultists, one of which culminated in a struggle with a homeowner, in which the homeowner was brutally stabbed to death. Upon witnessing the murder, Martha had a mental breakdown before Patrick forcefully subdued her and berated her for her failing to follow the cult's ideals. \nLucy and Ted host a party at their home, inviting numerous friends from the city. Martha is visibly nervous during the gathering, and has a psychotic episode when she recognizes one of the bartenders as a cult member, and has to be sedated. Ted attempts to convince Lucy to send Martha to a psychiatric hospital, an idea Lucy rejects. \nLater that night, Martha has a nightmare and a panic attack. Ted tries to help her, but Martha kicks him down the staircase. Lucy threatens to send Martha to a psychiatric hospital, to which Martha angrily responds that Lucy will be a terrible mother. The next day, Lucy and Martha reconcile somewhat, and Martha goes swimming. She sees a male cult member watching her across the shore, and leaves the water. When Martha departs the house with Lucy and Ted, she looks behind from the backseat as a car follows them.", "cast": "Elizabeth Olsen as Martha/Marcy May/\"Marlene Lewis\"\nJohn Hawkes as Patrick\nSarah Paulson as Lucy\nHugh Dancy as Ted\nBrady Corbet as Watts\nChristopher Abbott as Max\nMichael Chmiel as Scruffy man\nMaria Dizzia as Katie\nJulia Garner as Sarah\nLouisa Krause as Zoe"}