{"_movieID": "120467", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:45:19", "summary": "The Grand Budapest Hotel is a 2014 comedy-drama film written and directed by Wes Anderson,  from a story by Anderson and Hugo Guinness, inspired by the writings of Stefan Zweig, to whom Anderson wrote the film as a tribute. \nSet in the fictional war-torn European country Zubrowka in the 1930s, The Grand Budapest Hotel tells the story of two people: Monsieur Gustave H. (Ralph Fiennes), a concierge, one of his employees, the lobby boy Zero (Tony Revolori), and the friendship they form as they team up for several misadventures while trying to prove Gustave's innocence after he was framed for murder.\nThe film is an American-German co-production that was financed by German financial companies and film-funding organizations and filmed in Germany. The Grand Budapest Hotel released to widespread critical acclaim and was financially successful, grossing about $175 million worldwide on a $25 million budget, and was included in several critics' year-end top-10 lists.The film won the Golden Globe Award for Best Motion Picture – Musical or Comedy and garnered three more Golden Globe Award nominations, including Best Director for Anderson. It was nominated for nine Academy Awards, including Best Picture and Best Director for Anderson, and won four Oscars for Best Costume Design, Best Makeup and Hairstyling, Best Production Design and Best Original Score. In a 2016 BBC poll, several critics voted the film the 21st greatest film of the 21st century.\n\n", "plot": "In present day, a teenage girl approaches a statue in a courtyard. In her arms is a memoir by \"The Author.\" She begins reading about a trip he made to the Grand Budapest Hotel in the late 1960s. He discovered that the nearly deserted hotel, located in the Republic of Zubrowka, a nation ravaged by war and poverty, has become dilapidated. The Author meets Mr. Moustafa, the hotel's owner, who tells him the tale of how he took ownership of the Grand Budapest and why he is unwilling to close it down.\nThe owner's story begins in 1932 during the final years of the hotel's glory days. Zubrowka is on the verge of war but this is of little concern to M. Gustave, the Grand Budapest's devoted concierge. When he is not attending to the needs of the hotel's wealthy clientele or training the new lobby boy, Zero (a younger Moustafa-to-be), Gustave courts a series of aging, blonde women who all flock to the hotel to enjoy his \"exceptional service.\" One of these, Madame D, spends the night with him prior to her departure.\nA month later, he is informed that Madame D has died under mysterious circumstances and has bequeathed him a valuable painting, Boy with Apple, in her will. This enrages her family, all of whom hoped to inherit it, especially her son, Dmitri Desgoffe-und-Taxis. Gustave and Zero hide the painting in a safe at the Grand Budapest. Gustave is then arrested and framed for the murder of Madame D. In prison, he befriends a group of hardened cons who include him in their escape plan. With the aid of Zero's new fiancée Agatha, the group escapes. After a tense heart-to-heart, Gustave enlists Zero to prove his innocence. Their adventure takes them to a mountaintop monastery where they meet Madame D's butler Serge X, the only person who can provide Gustave with an alibi for the night of Madame D's murder. However, Serge is murdered by J.G. Jopling, Dmitri's henchman. Zero and Gustave steal a sled and chase Jopling. During a clash on the edge of a cliff, Zero kills Jopling, saving Gustave's life.\nZero and Gustave return to the Hotel, which the military has commandeered as war has just broken out. Dmitri has also come, chasing Agatha, who was entrusted with the painting. A gunfight ensues and a different version of Madame D's will is discovered hidden in the painting by Serge X, in which she bequeaths her entire fortune, including the Grand Budapest, to Gustave in the event that she should be murdered. Dmitri disappears and Zero marries Agatha.\nDuring a train trip, soldiers search Gustave's carriage and he is killed while trying to protect Zero. A heartbroken Zero vows to continue his legacy at the Grand Budapest, but the ongoing conflict and the ravages of time take their toll. Agatha succumbs to a disease and dies a few years later.\nZero admits to the Author that he cannot bring himself to close the hotel because it is his last link to Agatha. The Author departs for South America and never returns to the hotel. The hotel is eventually demolished. In the present, the girl continues reading the author's story about the hotel as the film ends."}