{"_movieID": "136558", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:53:40", "summary": "Kingdom Come: Deliverance is an action role-playing video game developed by Warhorse Studios and published by Deep Silver for Microsoft Windows, PlayStation 4 and Xbox One in 2018. It is set in the medieval Kingdom of Bohemia, an Imperial State of the Holy Roman Empire, with a focus on historically accurate content.The story takes place during a war in Bohemia in 1403. On the orders of Hungarian king Sigismund, Cuman mercenaries raid the mining village of Skalitz, a major source of silver. One of the survivors of that massacre is Henry, the son of a blacksmith. Destitute and vengeful, Henry joins the service of Lord Radzig Kobyla, who leads a resistance movement against Sigismund's invasion. As Henry pursues justice for his murdered family, he becomes involved in an effort to restore Bohemia's rightful king and Sigismund's half-brother, Wenceslaus IV, to the throne. The game features branching quest lines and an open world environment which encourages immersive gameplay, and includes early 15th century period-accurate weapons, clothing, combat techniques, and architecture, recreated with the assistance of architects and historians.\nThe game received generally positive reviews and a number of Game of the Year awards. Critics praised the game's story, attention to detail and focus on realism, while criticism was aimed at its technical bugs.", "plot": "In the silver mining town of Skalitz, young Henry is a simple peasant, living under his mother and his blacksmith father, Martin. Henry and Martin are putting the finishing touches on a commissioned sword for King Wenceslaus' hetman, Sir Radzig Kobyla, when Skalitz is attacked by an army of Cuman soldiers under Sigismund's control. Sigismund's crony, Sir Markvart von Aulitz kills Henry's parents, while Henry flees to the nearest castle of Talmberg, warning its lord, Sir Divish, of the attack. Taking advantage of a storm, Sir Radzig sneaks the Skalitz survivors out and leads them to Rattay. Meanwhile, Henry is devastated by the fact his parents have not been properly buried, and sneaks back to Skalitz against Divish's orders. He is confronted by a group of bandits, whose leader, Runt, defeats him in battle and steals the commissioned sword. Henry's life is saved by another Skalitz survivor Theresa and Talmberg's Captain Robard, who take him to Rattay.\nSeeking to get back his father's sword and avenge his parents' death, Henry meets Sir Hanush of Leipa, acting Lord of Rattay as his young nephew Lord Hans Capon's guardian. After saving Capon from a group of Cumans, Henry is accepted into Sir Radzig's envoy. Investigating a bandit raid on a local farm, Henry discovers a concealed camp, which houses both bandits and Cumans. Henry attacks the camp with Sir Radzig's and Talmberg's forces and kills Runt, but fails to locate the commissioned sword.\nThe hybrid camp leads the Lords to believe that someone is secretly attempting to raise an insurgency. Henry follows leads to discover a group of bandits and successfully infiltrates their ranks. He is led to the bandits' stronghold, finding a massive hidden army composed of Czech mercenary soldiers. There he runs into Istvan Toth, a Hungarian nobleman who had been visiting the Lords prior in the game. Toth recognizes Henry and reveals he also holds his father's sword. Henry is captured and tortured, while Toth reveals he plans to use the mercenaries to capture the land, expecting Sigismund to reward him once he reigns as king. He goes on to also reveal that Henry is in fact the bastard son of Sir Radzig himself.\nWith the help of a former Skalitz villager Zbyshek, Henry escapes the stronghold and warns the Lords of Toth's treachery. Radzig acknowledges Henry as his son, but keeps focus on the burgeoning situation. After recruiting Sir Divish, the Lords descend on the stronghold and quickly overwhelm its forces. However, Toth and a large number of his mercenaries have fled to Talmberg where they have captured its castle, left unguarded by Divish, taking Divish's wife Stephanie and Sir Radzig as hostages. With no other options left, the Lords prepare for a siege on Talmberg.\nSir Divish has Henry recruit Konrad Kyeser and commands the building of a trebuchet, which they use to breach the castle's walls. The Lords enter Talmberg and overwhelm Toth's forces. Sir Hanush conducts an agreement to secure Toth's safe departure in exchange for their hostages. Henry and Radzig ponder the outcome of the situation. Henry is disheartened by the loss of his father's sword and Toth and von Aulitz's escape from justice, though Radzig weighs that the lives saved at the end were due to the honoring of their nobility and moral principles.\nIn a dream, Henry is visited by his father Martin, who commends Henry for his courage and endurance. He sees both his father and mother disappear into the light and he awakes, in noble clothes with his new status as a lord's son.\nIn an epilogue, the Lords are visited by Jobst, the Margrave of Moravia, and King Wenceslaus' cousin, who proposes a plan to set a strategic alliance with Sigismund's supporters, who are put off by an uprising in his native Hungary and fear his defeat, to end the war at once. Although the Lords are uncertain of the plan, they agree to rescue and restore Wenceslaus to the throne and end Sigismund's raid peacefully. Henry and Capon depart on a journey to visit one of Sigismund's allies, Otto von Bergow, at his estate in Trosky Castle. With a letter stating their will to end the war at hand peacefully, Henry remarks that his personal quest remains to hunt von Aulitz and recapture his father's sword."}