{"_movieID": "397538", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:39:43", "summary": "Borg vs McEnroe (Swedish: Borg, Finnish: Borg/McEnroe), also known as Borg McEnroe, is a 2017 biographical sports drama film focusing on the famous rivalry between tennis players Björn Borg and John McEnroe at the 1980 Wimbledon Championships, culminating in their encounter in the men's singles final. The film, a production between Sweden, Denmark, and Finland, is directed by Janus Metz Pedersen, from a screenplay written by Ronnie Sandahl, and stars Sverrir Gudnason, Shia LaBeouf, Stellan Skarsgård, Tuva Novotny, and Robert Emms. The film opened the 2017 Toronto International Film Festival.", "cast": "Sverrir Gudnason as Björn Borg:A Swedish former world no. 1 tennis player. Screenwriter Ronnie Sandahl stated in interviews with Swedish newspapers Expressen and Sydsvenskan that \"he [Sverrir] looks very much like the Swedish tennis star\". In an interview, Gudnason talked about his preparation for the part, and stated that \"I [he] spent six months in which he trained 15 hours a week, with two hours of tennis and four workouts with a personal trainer.\" He also revealed that he had not met Borg, stating \"not yet, but I will meet him, sometime after the shooting of the film.\" Leo Borg, the real-life son of Björn Borg, portrays his father from age 9 to 13, while actor Markus Mossberg portrays him from age 14 to 17.Shia LaBeouf as John McEnroe:An American former world no. 1 professional tennis player and Borg's rival. Sandahl stated in an interview, that it was Shia that made contact with the production, when he heard about the script, because \"he [Shia] identifies strongly with the character of McEnroe, and felt that he is a misunderstood person.\" In an interview with Variety, Shia praised the script and called it \"brilliant\", and said that he \"cried when reading it for the first time.\" He also revealed that he has not met with McEnroe about the role, stating \"haven't met him yet, but I'm eager to meet him before we shoot. I got nothing but love and respect for him.\"Stellan Skarsgård as Lennart Bergelin:A Swedish tennis player and Borg's coach. This is his first role in a Swedish film since he starred in the films Arn – The Knight Templar and Arn – The Kingdom at Road's End. Skarsgård described and compared the relationship between Bergelin and Borg to the rivalry between Mozart and Salieri in the 1984 film Amadeus: \"people think that Salieri was jealous of Mozart, but I do not think that's the right word. I think it's more an utter fascination and love of the genius. And the self-doubt that you are not capable.\"Tuva Novotny as Mariana Simionescu:A Romanian tennis player and Borg's fiancée.Robert Emms as Vitas Gerulaitis:An American playboy and professional tennis player.Jason Forbes as Arthur Ashe\nBjörn Granath as Bengt Grive\nScott Arthur as Peter Fleming\nTom Datnow as Jimmy Connors\nJane Perry as Kay McEnroe\nThomas Hedengran as Lennart Hyland"}