{"_movieID": "38356", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:39:29", "summary": "Transformers: Dark of the Moon is a 2011 American science fiction action film directed by Michael Bay, and it is based on the Transformers toy line. It is the third installment in the live-action Transformers film series, and is the sequel to 2009's Revenge of the Fallen. It is also the first film in the series that was not co-produced by DreamWorks, leaving Paramount Pictures as the sole distributor. The film stars Shia LaBeouf, Josh Duhamel, John Turturro, Tyrese Gibson, Rosie Huntington-Whiteley, Patrick Dempsey, Kevin Dunn, Julie White, John Malkovich, and Frances McDormand. Its story is set three years after the events of Revenge of the Fallen, and follows the warring Autobots and Decepticons as they battle to possess powerful technology from their homeworld that had crashed on Earth's moon. Returning Transformers include Optimus Prime, Bumblebee, Ironhide, Ratchet, Sideswipe, Skids and Mudflap (as cameos), Wheelie, Megatron, Starscream, Soundwave, Barricade, Sideways, Long Haul, Scrapper, and Brawl.\nThe script was written by Ehren Kruger. Dark of the Moon employed both regular 35mm film cameras and specially-developed 3-D cameras, with filming locations in Chicago, Florida, Indiana, Milwaukee, Moscow, and Washington, D.C.. The film was rendered specifically for 3-D, and the visual effects involved more complex robots which took longer to render. In May 2011, it was announced that Paramount would move Dark of the Moon's release date of July 1 to June 29, in order to monitor an early response to footage.\nExclusive early premieres in both select 3D and IMAX theaters took place on June 28, 2011, one night before worldwide release in 2D and 3D (including IMAX 3D) formats—each featuring Dolby Surround 7.1 sound. Metacritic characterized the reviews that it cataloged as \"mixed or average\", and the Rotten Tomatoes critical consensus praised the special effects, action scenes, scores, 3D work, and the performances of Peter Cullen and Leonard Nimoy while criticizing the runtime, storyline, performances, and screenplay. Dark of the Moon grossed over $1.1 billion worldwide, and it is currently the 24th highest-grossing film of all time (the 4th-highest at the time of release; behind Avatar, Titanic and Harry Potter and the Deathly Hallows – Part 2), the second-highest-grossing film of 2011 (behind Deathly Hallows – Part 2), the highest-grossing film in the Transformers series, and the tenth film to gross over $1 billion (after Titanic, The Lord of the Rings: The Return of the King, Pirates of the Caribbean: Dead Man's Chest, The Dark Knight, Avatar, Alice in Wonderland, Toy Story 3, Pirates of the Caribbean: On Stranger Tides and Deathly Hallows – Part 2). Like the first film, it was nominated for Best Sound Editing, Best Sound Mixing, and Best Visual Effects at the 84th Academy Awards. It was followed by Transformers: Age of Extinction in 2014 and Transformers: The Last Knight in 2017.", "plot": "In 1961, the Ark, a Cybertronian spacecraft carrying an invention capable of ending the war between the benevolent Autobots and the malevolent Decepticons, crash lands on the dark side of Earth's Moon. The crash is detected on Earth by NASA, and President John F. Kennedy authorizes a mission to put a man on the Moon as a cover for investigating the spacecraft. In 1969, the crew of Apollo 11 lands on the Moon.\nIn the present, the Autobots assist the United States military in preventing major conflicts around the globe. During a mission to Chernobyl to investigate suspected alien technology, the Autobots are attacked by a giant Cybertronian worm-creature called the Driller and his master Shockwave, a Decepticon scientist. After the two escape, Optimus Prime finds the technology is a fuel cell from the Ark, discovering it had survived its escape from Cybertron. After learning of the top-secret mission to the Moon, the Autobots travel there to explore the Ark. They discover a comatose Sentinel Prime—Optimus's predecessor as leader of the Autobots—and five Pillars he created as a means of establishing a Space Bridge between two points to teleport matter. After returning to Earth, Optimus uses the energy of his Matrix of Leadership to revive Sentinel Prime.\nMeanwhile, Sam Witwicky is frustrated that he is unable to work with the Autobots or find a job. He also becomes envious of the close relationship between his new girlfriend, Carly Spencer, and her boss Dylan Gould. After finding work, Sam is provided information by his eccentric co-worker Jerry Wang about the Ark, before Jerry is assassinated by the Decepticon Laserbeak. Sam contacts the now independently wealthy Sector 7 Agent Seymour Simmons, and together they realize the Decepticons and their leader Megatron are murdering people connected to the American and Soviet space missions to the Ark. They locate two surviving cosmonauts, who reveal satellite photos of hundreds of Pillars being stockpiled on the Moon. Sam realizes that the Decepticons raided the Ark long before the Apollo 11 mission to the moon and intentionally left Sentinel and the five Pillars for the Autobots to find, as Sentinel is the key to activating the Pillars and the Decepticons lacked the means to revive him. The Autobots fight off three pursuing Decepticons: the Dreads, and rush to return Sentinel to their base for protection, but Sentinel betrays them and murders the Autobot Ironhide, revealing he had made a deal with Megatron to ensure Cybertron's survival.\nSentinel uses the Pillars to transport hundreds of concealed Decepticons from the Moon to Earth. Carly is later captured by Dylan, who is revealed to be in service of the Decepticons. The Autobots are exiled from Earth at the demand of the Decepticons to avoid war, but as their ship leaves Earth it is destroyed by Starscream, seemingly killing the Autobots. The Decepticons, led by Megatron and Sentinel, invade Chicago as they place Pillars around the world. Dylan reveals to Carly that the Decepticons plan to transport their homeworld Cybertron to the Solar System, and then enslave humanity and use Earth's resources to rebuild their world. Sam teams up with former USAF Chief Robert Epps and several ex-NEST soldiers to go into Chicago to save Carly and arrest Dylan, but they are nearly killed by Decepticon forces before the Autobots intervene, revealing they concealed themselves during the launch of their ship to convince the Decepticons they were destroyed.\nWorking together, the Autobots, along with several ex-Rangers and Navy SEALs, manage to rescue Carly and kill Laserbeak, the Driller, Starscream, Soundwave, and Shockwave, with Optimus using Shockwave's arm-cannon to blast the Control Pillar, disabling the Space Bridge. During the battle, the Autobot Wheeljack is killed while Wheelie and Brains sneak on board a Decepticon warship and sabotage it. Sam confronts Dylan as he reactivates the Control Pillar, and knocks Dylan into the Pillar, killing him. Bumblebee and Ratchet arrive and destroy the Control Pillar, permanently disabling the Bridge and causing the partially transported Cybertron to implode, becoming badly damaged. Optimus and Sentinel fight while Carly convinces Megatron that he will be replaced by Sentinel as leader of the Decepticons. Sentinel severs Optimus's right arm and is about to execute him until Megatron, having listened to Carly, intervenes, incapacitating Sentinel. Megatron slyly proposes a truce, having the desire to become the one in charge again, but Optimus instead attacks Megatron, decapitating and killing him. Sentinel pleads for his life, but Optimus executes him too for his betrayal. With the Decepticons defeated, Carly and Sam are reunited and the Autobots, knowing that Cybertron is badly damaged, remain on Earth still; making it their temporary home.", "cast": "Shia LaBeouf as Sam Witwicky  A recent college graduate who is once again tied to the fate of Earth's survival.\nJosh Duhamel as Col. William Lennox  An Army Rangers officer, who commands the classified strike team NEST, an international task-force battling Decepticons with the Autobots.\nJohn Turturro as Seymour Simmons  A former agent in charge of the terminated Sector 7 unit and now a successful professional writer.\nTyrese Gibson as Chief Master Sergeant Robert Epps  A former NCOIC of the NEST strike team who now works at Kennedy Space Center.\nRosie Huntington-Whiteley as Carly Spencer  Sam's new girlfriend.\nPatrick Dempsey as Dylan Gould  A wealthy car collector and Carly's employer who is secretly in cahoots with the Decepticons.\nKevin Dunn as Ron Witwicky  Sam's father.\nJulie White as Judy Witwicky  Sam's mother.\nJohn Malkovich as Bruce Brazos  Sam's employer and boss at Accuretta Systems.\nFrances McDormand as Charlotte Mearing  The Director of National Intelligence.\nKeiko Agena as the aide and assistant of Charlotte Mearing.\nLester Speight as \"Hardcore\" Eddie  A former member of NEST.\nJosh Kelly as Stone  A former member of NEST.\nAlan Tudyk as Dutch  Simmons' personal assistant.\nMark Ryan as Military Drone Operator.\nKen Jeong as Jerry \"Deep\" Wang  A paranoid software programmer at Sam's work.\nGlenn Morshower as General Morshower  The director of NEST, who communicates with the squad from the Pentagon.\nBuzz Aldrin appears as himself  Meeting Optimus Prime at the NEST headquarters.\nBill O'Reilly appears as himself  Interviewing Simmons through his television program The O'Reilly Factor.\nElya Baskin as Cosmonaut Dimitri  One of the two surviving Russian cosmonauts who gives Sam information on the Moon missions.\nAndy Daly as Donnie  A mailroom worker who loathes Wang.\nMindy Sterling as Martha  An insurance agent.\nChris Sheffield as Pimply Corporate Kid."}