{"_movieID": "446791", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:54:08", "summary": "All the Money in the World is a 2017 crime thriller film directed by Ridley Scott and written by David Scarpa, based on John Pearson's 1995 book Painfully Rich: The Outrageous Fortunes and Misfortunes of the Heirs of J. Paul Getty. Starring Michelle Williams, Christopher Plummer, Mark Wahlberg,  and Romain Duris, the film depicts J. Paul Getty's refusal to cooperate with the extortion demands of a group of kidnappers from the organized crime Mafia group 'Ndrangheta, who abducted his grandson John Paul Getty III in 1973.\nPrincipal photography took place from March to August 2017. Kevin Spacey originally portrayed J. Paul Getty, appearing in the film's initial marketing campaign. However, due to sexual assault allegations made against Spacey prior to the film's release, the role was recast with Plummer. Scenes were reshot just a month prior to the film's release.All the Money in the World premiered at the Samuel Goldwyn Theater in Beverly Hills on December 18, 2017, followed by a United States theatrical release via TriStar Pictures on December 25, 2017; it grossed $56.9 million against its $50 million budget. For his performance as Getty, Christopher Plummer received acclaim from critics and was nominated for the Academy Award for Best Supporting Actor, along with similar recognition from the Golden Globes, BAFTAs and others. The film itself received positive reviews with critics praising the performances, and received three nominations at the 75th Golden Globe Awards, including Best Director and Best Actress – Drama for Williams.", "plot": "In 1973, 16-year-old John Paul Getty III (Charlie Plummer) (AKA Paul), grandson of oil tycoon J. Paul Getty (Christopher Plummer) who was at that time the world's richest private citizen, is kidnapped in Rome by an organized crime ring. The kidnappers demand a ransom of $17 million. Flashbacks show that Paul's parents, Gail Harris (Michelle Williams) and John Paul Getty Jr. (Andrew Buchan), were divorced in 1971 due to Getty Jr.'s drug addiction and that Gail rejected any alimony in exchange for full custody of her children in the divorce settlement; therefore she does not have the means to pay the ransom. She travels to Getty's estate to beseech him to pay the ransom but he refuses, stating that it would encourage further kidnappings on his family members. The media picks up on the story, with many believing Gail to be rich herself and blaming her for the refusal to pay the ransom. Meanwhile, Getty asks Fletcher Chace (Mark Wahlberg), a Getty Oil negotiator and former CIA operative, to investigate the case and secure Paul's release.\nPaul is kept hostage in a remote location in Italy. Initially his captors, particularly Cinquanta (Romain Duris), are tolerant with him because his quiet and submissive demeanor causes them few problems. However, things grow increasingly tense as weeks go by without the ransom being paid, far longer than the captors anticipated. Arguments arise over whether to move Paul to a new location as winter is approaching and their hideout is not suitable for cold conditions. Things get worse when one of the kidnappers accidentally shows his face to Paul, prompting one of the others to kill the man for his foolish mistake. His burned and disfigured body is recovered in the river; investigators erroneously identify the body as Paul's, but Gail examines the body and refutes this.\nUsing the new lead of the body, Chace is able to pinpoint the hideout where Paul is being held. A raid is conducted with several kidnappers being killed, but Paul is no longer there; he had been sold on to a new crime organization. The new captors are much less patient with Paul and negotiate more aggressively with the Getty family to receive their payment. The kidnappers cut off one of Paul's ears and mail it to a major newspaper, claiming that they will continue mutilating him until the ransom is paid.\nAfter repeated negotiations with Gail and Chace, and frustration from the captors at how long the process was taking, they lower the asking price to $4 million. Getty finally decides to contribute to the ransom, but only $1 million – this being the maximum amount that he can claim as tax deductible. Moreover, he also will only do so if Gail signs a legal document waiving her parental access rights to Paul and her other children, giving them to Getty's son, her ex-husband. She reluctantly signs them. Berated by an exasperated Chace, Getty finally relents and agrees to pay the full ransom, also voiding the parental agreement with Gail. Gail and Chace take the money to Italy and follow specific instructions from the captors, leaving the money in a remote location and receiving orders to pick up Paul from a construction site. Based on Cinquanta's advice, Paul runs away from the site towards the nearest town, miles away. Meanwhile the captors realize that Chace has broken his word and led the police to them; angry, they decide to find and kill Paul. Chace, Gail, and the captors arrive at the town to look for Paul. One of the kidnappers finds Paul first, but Cinquanta attacks the man (from behind so Cinquanta can't be identified) in order to allow Paul to escape. With Paul wrapped tightly in Gail's arms, they escape the scene, and quickly smuggle Paul out of the country to safety. \nWhen Getty dies in 1976, Gail is tasked with managing her children's inherited wealth until they are of age. The company was set up as a charitable trust, which meant that Getty's income was tax-free but also not spendable. He had invested much of it in paintings, sculptures and other artifacts, most of them now reside in the J. Paul Getty Museum in Los Angeles."}