{"_movieID": "458506", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:32:42", "summary": "Tour de Pharmacy is a 2017 sports doping mockumentary television film directed by Jake Szymanski, starring Andy Samberg, Orlando Bloom, Freddie Highmore, Daveed Diggs, and John Cena. It premiered on HBO on July 8, 2017.", "plot": "On the first day of the 1982 Tour de France, Italian cyclist JuJu Peppi (Orlando Bloom) accidentally causes a pileup after attempting to grope a bikini clad female spectator, which causes a massive brawl to break out between all the other cyclists, postponing the race until further notice. Police find evidence of narcotics being used by the cyclists and it is revealed that UCI president Ditmer Klerken (Kevin Bacon) accepted bribes of $50,000 each from a majority of the competitors to forego preliminary drug testing. Although all the cyclists are suspected of doping, the UCI allows the Tour to continue with the five competitors who didn't pay off Klerken: Peppi, American-born Nigerian cyclist Marty Hass (Andy Samberg), who is resented by Nigeria for being the one to represent the country, French cyclist Adrian Baton (Freddie Highmore), who is secretly a woman named Adrianna Baton disguised as a man so she can compete, African-American cyclist Slim Robinson (Daveed Diggs), nephew of Jackie Robinson who wants to break the color barrier in cycling like Jackie did in baseball, and Austrian cyclist Gustav Ditters (John Cena), who had gained a considerable amount of muscle mass from the previous year due to steroids.\nBefore resuming the race, the five agree to take turns at the front so everyone else can draft to conserve their energy before the finish line. However, when the race resumes, no one is willing to ride up front, so the cyclists attempt to go as slowly as possible to conserve their energy. This allows Robinson to enjoy the scenery and he eventually leaves the race with a female spectator to become the first black French dairy farmer. Before the end of the day, Ditters is taunted by a spectator for being unable to go fast. When the race resumes ten days later, an enraged Ditters goes as fast as possible to win the day, much to the shock of observers. Believing he had used enhancements, police raid his apartment and find that he had been doping himself with cheetah's blood, which gets Ditters disqualified. When the race resumes, Peppi dies when he overexerts himself, causing his heart to explode within his chest, and falls off a cliff.\nHass and Baton are the only competitors left, but they end up becoming attracted to each other and pause the race to go have sex in the woods. Hass finds out Baton's true identity and agrees to keep it a secret, which inadvertently turns him into a gay sports icon. When they resume the race, they tie their bicycles together to make sure they both win simultaneously. On the final day of the race, BBC reporter Rex Honeycut (James Marsden), who had ridden alongside the competitors for real time interviews during the race, is told that because he had ridden all laps of the race and registered to ride on the Tour, he is eligible to win the Tour de France and makes an attempt to do so. Baton detaches from Hass and jumps at Honeycut, knocking him to the ground so Hass can win the race. Honeycut is shown to have motorized his bicycle to keep up with the cyclists. Baton's true identity is exposed and is sent to 35 years in prison for manslaughter as Honeycut had been accidentally killed during the scuffle.\nHass looks set to win the Tour de France until Robinson, who had missed the thrill of cycling, rushes out to the front and wins the race by 73 feet. Robinson relishes being the first African-American to excel at cycling like his uncle did at baseball, while Hass laments that Baton's sacrifice was in vain.\nPresent day interviews are conducted with Hass (Jeff Goldblum), Baton (Julia Ormond), Robinson (Danny Glover), and Ditters (Dolph Lundgren), along with other outside observers including disgraced cyclist Lance Armstrong who insists on remaining anonymous.", "cast": "Andy Samberg as Marty Hass, Nigerian cyclist\nJeff Goldblum as current-day Marty Hass\nOrlando Bloom as JuJu Peppi, Italian cyclist\nFreddie Highmore as Adrian Baton, French cyclist\nJulia Ormond as current-day Adrian Baton aka Adrianna Baton\nDaveed Diggs as Slim Robinson, American cyclist and nephew of Jackie Robinson (fictionally)\nDanny Glover as current-day Slim Robinson\nJohn Cena as Gustav Ditters, Austrian cyclist\nDolph Lundgren as current-day Gustav Ditters\nJames Marsden as Rex Honeycut, a BBC reporter\nWill Forte as a French police officer investigating an amphetamine-laced water bottle\nMaya Rudolph as Lucy Flerng, editor-in-chief of Cycling Enthusiast Magazine\nKevin Bacon as Ditmer Klerken, former president of UCI\nPhylicia Rashad as Victoria Young, an animator\nAdewale Akinnuoye-Agbaje as Olusegun Okorocha, Marty's childhood neighbor\nNathan Fielder as Stu Ruckman, current head of the World Anti-Doping Agency\nChris \"Romanski\" Romano as Jabin Dolchey, the steroid aggressive cyclist\nJon Hamm as the narrator\nEdgar Wright as the British sports commentator\nJ. J. Abrams as himself\nLance Armstrong as himself\nMike Tyson as himself\nJoe Buck as himself\nChris Webber as himself"}