{"_movieID": "270010", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:08:37", "summary": "A Hologram for the King is a 2016 comedy-drama film directed, written and co-scored by Tom Tykwer, based on the 2012 novel of the same name written by Dave Eggers, and starring Tom Hanks as a washed-up corporate salesman, who goes to Saudi Arabia to propose a business deal.\nSidse Babett Knudsen, Tom Skerritt and Sarita Choudhury also star in this international co-production between France, Germany, the Cayman Islands, Mexico, and the United States. The film was released on April 22, 2016, by Lionsgate, Roadside Attractions and Saban Films.", "plot": "Alan Clay (Tom Hanks) is a salesman for American tech company Relyand, who is sent to sell a holographic teleconferencing system to the Saudi government by overseeing a presentation for the king. The only reason he was offered the job in Saudi Arabia was that he had once met a nephew of the king. Alan is haunted by his former job at bicycle manufacturer Schwinn where he was responsible for outsourcing production to China which led to several hundred people losing their jobs and, in the long run, the financial ruin of the company. He is also depressed because of a messy and costly divorce which leaves him destitute and unable to financially support his daughter Kit (Tracey Fairaway).\nOversleeping on the first day due to jet lag, he misses the shuttle bus to the King's Metropolis of Economy and Trade (a fictionalized version of King Abdullah Economic City), where the sales presentation is to take place. He instead rents a car with a driver. The driver, Yousef (Alexander Black), tells him that he is in contact with a woman and her wealthy husband is jealous, leading Yousef to fear for his life.\nAfter arriving at the development, Alan is informed that neither the king nor his direct contact, Karim Al-Ahmed (Khalid Laith), are there. He furthermore sees that his team is placed in a tent outside the office building where there is no working internet connection and food.\nOver the following few days Alan repeatedly oversleeps and calls Yousef to drive him to the development, both becoming closer during the long drives. At the development, he is repeatedly put off and confined to the tent outside the office building. One day, he slips inside the building and meets Danish executive Hanne (Sidse Babett Knudsen). She is sympathetic to his plight but cannot help him get in contact with the king or Karim Al-Ahmed. She offers him some alcohol, which Alan has missed since arriving in Saudi Arabia.\nIn the evening, Alan gets drunk using the alcohol obtained from Hanne, and tries to cut open a lump he had noticed earlier on his back. Waking the next day, covered with blood from the cut, he goes to a hospital where he meets his doctor, Zahra (Sarita Choudhury) resulting in an immediate connection. She performs a biopsy and asks him to return in a few days for the result.\nAfter more days in the tent without progress in meeting the king or Karim Al-Ahmed, Alan is invited by Hanne to a party at the Danish consulate, where she tries to seduce him. Alan, however, rejects her advances.\nThe next day, having discovered that air conditioning in the tent has broken down, Alan becomes upset. He once again slips into the office building of the development and finally meets Karim Al-Ahmed. Alan tells Karim about all his grievances: the tent with improper air conditioning, bad internet connection and missing food. Karim ensures him that he will take care of the problems but cannot give him a date for the presentation to the king.\nShortly after, Alan has a panic attack in the hotel and, mistaking it for a stroke, calls Zahra and Yousef. Yousef, arriving shortly after Zahra, notices how close they are and, after she leaves, chastises Alan for endangering her by making advances to her, something Alan vehemently denies. Yousef then confesses that he fears even more for his life because the husband of the woman that Yousef is interested in has threatened him. He decides to flee to his home town over the weekend to let things cool down and Alan decides to go with him.\nAfter returning from the trip with Yousef, Alan learns that his lump contains precancerous cells and should be removed the next day. When returning to the development, Alan notices that the technical problems have been taken care of and he is informed that the king will watch the presentation that day, which is successful. Afterwards, Alan again rejects Hanne's advances.\nThe next day, the operation begins with an unknown doctor but, at the last moment, Zahra takes over, to the delight of Alan. After the successful procedure, Alan and Zahra exchange increasingly personal and intimate e-mails which culminate in a secret meeting between the two. They talk about their families, with Zahra explaining that she has children and is also going through a messy divorce. They are driven to a beach house which belongs to Zahra where they go swimming and then have sex.\nThe film ends with Alan writing to Kit telling her that the deal did not happen but that he has taken a well-paid job in Saudi Arabia (implied to be selling office space and apartments in new developments) and that he has found a new positive force in his life (implied to be Zahra, with whom he has started a relationship).", "cast": "Tom Hanks as Alan Clay\nAlexander Black as Yousef, Alan's driver\nSarita Choudhury as Zahra\nSidse Babett Knudsen as Hanne\nBen Whishaw as Dave\nTom Skerritt as Ron, Alan's father\nTracey Fairaway as Kit, Alan's daughter\nDavid Menkin as Brad\nKhalid Laith as Karim Al-Ahmed\nRolf Saxon as Joe Trivoli\nJay Abdo as Dr. Hadad\nDhaffer L'Abidine as Hassan\nAmira El Sayed as Maha"}