{"_movieID": "140300", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:51:18", "summary": "Kung Fu Panda 3 is a 2016  3D computer-animated wuxia comedy film produced by DreamWorks Animation and distributed by 20th Century Fox worldwide and by Oriental DreamWorks in China. It is the third installment in the Kung Fu Panda franchise, and the sequel to 2011's Kung Fu Panda 2. In the film, Po enters the panda village and re-unites with his birth father and other pandas, but problems arise when a villainous undead warrior named Kai, returns to the mortal realm and steals chi from the kung fu masters, with the goal of ending Oogway's legacy. To prevent Kai from taking chi from all kung fu masters and pandas, Po forms the army of pandas to battle Kai's jade minions and Po must become a master of chi to defeat him and save his friends.\nThe film was directed by Jennifer Yuh Nelson and Alessandro Carloni and written by Jonathan Aibel and Glenn Berger. Jack Black, Dustin Hoffman, Angelina Jolie, Lucy Liu, Seth Rogen, David Cross, James Hong and Jackie Chan reprise their roles from the previous films with Randall Duk Kim reprising his role of Oogway from the first film. They are joined by Bryan Cranston, J. K. Simmons and Kate Hudson in the roles of Li Shan, Kai, and Mei Mei, respectively.\nKung Fu Panda 3 premiered on January 16, 2016, in Los Angeles. It received a limited release in China on January 23 for a special three-hour sneak preview and was released in the United States on January 29 in 3D. Like its predecessors, the film received generally positive reviews while grossing $521 million worldwide against its $145 million budget.", "plot": "In the spirit realm, Oogway fights against his old bull adversary, an undead warrior named Kai, who has defeated all the other kung fu masters in the realm and taken their chi. Oogway too is ensnared and has his chi stolen, but warns Kai that the Dragon Warrior, Po, will stop him. Kai takes this as a challenge to steal the Dragon Warrior's chi and returns to the mortal realm.\nMeanwhile, Master Shifu announces his retirement from teaching and passes the role of teacher to Po. An initially excited Po realizes that teaching kung fu is not as easy as anticipated, and the Furious Five are injured as a result. Po is demoralized because of his failure, but Shifu advises Po that instead of trying to be like Shifu, he should try to be himself. Po returns home where he meets a panda, Li Shan, whom they both realize is his long-lost biological father. They quickly bond with each other, much to the jealousy of Po's adoptive father, Mr. Ping.\nAfter introducing Li to Shifu and his friends, Po and the Five defend the Valley of Peace from jade zombies that Kai has created from the chi of past kung fu masters. The team learns through research that Oogway and Kai were once brothers-in-arms. After Oogway was injured in battle, Kai carried him to a village of pandas who healed him with their mastery of chi. The pandas then taught Oogway how to utilize chi to help others. However, Kai wanted the power for himself and tried to steal the pandas' chi, forcing Oogway to banish him to the spirit realm. In order to defeat Kai, Po must learn to master the use of chi himself. Li offers to teach him by taking him to his secret panda village. While Shifu and the Furious Five stay behind to deal with Kai, Po and Li travel to the village. Mr. Ping comes along as a stowaway, worried that he will lose Po's affections to Li. Although Po is eager to learn chi, Li tells him he must first learn the relaxed life of a panda in the village.\nKai takes the chi of nearly every kung fu master in China, including Shifu and the Furious Five except Tigress, who escapes to warn Po and the other pandas that Kai is coming. Afraid, Li and the pandas prepare to run away. When Po demands that Li teach him how to use chi immediately, Li confesses that he lied about Chi mastery and that he only brought Po to their village because he was afraid of losing him again. Po is hurt over his father's misdirection and isolates himself to train vigorously in preparation for fighting Kai. Mr. Ping, who realizes Po has become happier with Li in his life, tells Li that Po being mad at him is part of being a father, but that Po will forgive him. So Li goes back to Po, and says the pandas will help him fight Kai's army. Realizing what had previously made him fail as a teacher, Po agrees and teaches them to use their everyday activities as kung fu skills.\nKai arrives and sends his minions to capture Po, who sets the pandas, Ping, and Tigress upon them, distracting Kai. They defeat the jade zombie army, but when Po tries to use his signature Wuxi Finger Hold on Kai to send him back to the spirit realm, Kai reveals that it only works on mortals, not a spirit warrior like himself. Kai gains the upper hand in their fight, but Po uses the Wuxi Finger Hold on himself while gripping Kai around the neck, transporting them both to the spirit realm. They fight again, and Kai subdues Po and begins to steal his chi. Using what they learned from Po, his friends and family use their chi to empower him. Po harnesses their chi to create a giant dragon figure with which he overloads Kai, destroying him and restoring all of the fallen masters to normal.\nIn an ethereal golden pond, Oogway appears to Po and informs him that his journey as the Dragon Warrior has come full circle, declaring Po to be his successor. He reveals that he sent Li to find Po. Po chooses to return to the mortal world, and brings with him a mystic jade yin-yang staff bestowed by Oogway. He and his extended family all return to the valley, where they continue practicing kung fu and chi."}