{"_movieID": "435557", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:34:28", "summary": "The Party's Just Beginning is a 2018 British-American drama film, written and directed by Karen Gillan. It stars Gillan, Lee Pace, Matthew Beard, Paul Higgins and Siobhan Redmond.\nThe film had its world premiere at the Glasgow Film Festival on February 24, 2018. It was released on December 7, 2018, by The Orchard.", "plot": "Liusaidh is a 24-year-old woman from Inverness. Stuck in a dead end job selling cheese at a supermarket, she spends her evenings binge drinking and engaging in casual sex with strangers. These behaviours are coping mechanisms she's adopted to deal with the suicide of her best friend, Alistair, who died by jumping off a bridge in front of a train almost a year earlier. Throughout the film, Liusaidh keeps flashing back to the preyvious year with Alistair.\nLiusaidh meets a stranger at a bar and has sex with him. To her surprise, he tracks her down and the two have a few more trysts before he informs her that he is returning home.\nWalking home at night after another night out, Liusaidh passes the bridge where Alistair committed suicide. She is surprised to see the stranger there, apparently about to kill himself, and she manages to talk him down. The two spend time together and though Liusaidh asks him to stay, he decides to leave, this time for real. Before he does Liusaidh tells him her name, and he tells her that his name is Dale.\nLiusaidh is fired from her job due to taking several days off work and spirals further out of control. On Christmas, the anniversary of Alistair's death, she blacks out and is raped by three men.She goes home to see her mom still socializing with her friends and slowly realize there is no end to her clash of emotions. Through the phone she talks to the unnamed old man she has been talking to throughout the movie whose wife died and kids abandoned. She opens up with what happened and cries. Her dad who overhears the consversation,while she tries to leave for the night tries to talk to her but gets lost in words and act normally. She goes the spot her best friend died and decides to end her life. But flashbacks and self realization eventually changes her mind and she decides to move on. She goes home to see her parents talking with each though they don't discuss the topic. She calls her friend and reconcile and decides to try to lead a normal life."}