{"_movieID": "340487", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:35:59", "summary": "Certain Women is a 2016 American drama film edited, written, and directed by Kelly Reichardt. Based on three short stories from Maile Meloy's collections, Half in Love and Both Ways Is the Only Way I Want It, the film stars Laura Dern, Kristen Stewart, Michelle Williams, Lily Gladstone, James Le Gros, and Jared Harris.\nThe film, which had its world premiere at the 2016 Sundance Film Festival on January 24, 2016, was released theatrically in the United States on October 14, 2016, by IFC Films and grossed $1,068,054 domestically, becoming the director's highest-grossing film to date.", "plot": "In a small Montana town, attorney Laura Wells has been dealing with a disgruntled client, Fuller, for eight months. Out of work after a work place injury caused a disability, he has taken to visiting Laura repeatedly at her office. As Fuller will not listen to her advice, she takes him to another lawyer. After assessing the case, the lawyer tells Fuller exactly what Laura had told him; that while Fuller's company was clearly at fault for his injuries, Fuller can no longer sue the company, because he previously had accepted their initial small settlement. On his way home from the meeting with the second lawyer, Fuller feuds with his wife, and is kicked out of their car. He takes a ride home with Laura Wells. On the way he tells Laura that he wants to shoot his former employers.\nLate that same night, Laura is called by the police. Fuller has gone back to his former place of employment and has taken a security guard as hostage. After being prepped by the police, Laura agrees to talk to Fuller. She goes into the building and finds Fuller with his hostage; Fuller has her locate his employee records, which include the case file that the company used to settle his disability claim. Fuller has Laura read the entire file, which details clearly how Fuller was cheated out of his rightful settlement. Fuller decides to let the guard go; He asks Laura to stall for him by going to the front and telling the police of his demands as if he has a gun pointed at her, while he slips out the back. Instead, Laura immediately tells the police where Fuller is and he is arrested.\nGina and Ryan Lewis are a married couple with a teenage daughter, building their own home from the ground up. Gina feels that Ryan constantly undermines her with their daughter and is annoyed by his behavior. On their way home from the campsite of their new home, they decide to stop at the home of Albert, an elderly man they know, to try to persuade him to sell them the sandstone on his property. As they talk, Gina tries to persuade Albert to sell her the sandstone, but he interrupts her repeatedly and seems only interested in talking with Ryan. Eventually Albert tentatively agrees to give the sandstone to Gina and Ryan.  Gina, who has been secretly recording the conversation, signals that they should leave. In the car on their way home, she finds it ridiculous how easily she was able to obtain the sandstone.\nSometime later, Gina and Ryan arrive and load up a truck full of the sandstone. She notices Albert watching from his window and waves at him but he does not wave back.\nJamie is a ranch hand living in isolation during the winter, tending to horses on a farm outside Belfry. Heading into town one night, she sees cars turning into the school and follows them. She learns that she has stumbled onto a class on school law taught by a young lawyer, Beth Travis. Jamie goes out to eat with Beth after class.  Beth explains that she lives in Livingston, which is a four-hour drive away, so she must make the eight-hour round trip twice a week to make it back in time for her real job.\nDespite having no interest in education law, Jamie returns to class week after week. One week she brings one of her horses to class, and she and Beth ride the horse to the diner. The following week, she is stunned when she learns Beth has quit and a new teacher is brought in as a permanent replacement. Jamie then immediately leaves the class and drives straight to Livingston. Spending the night in her car, she spends the morning driving to law offices hoping to find Beth. On the way, she has flashbacks of the previous time she drove to the city. Locating her address, Jamie sees Beth in the parking lot, and tells her that she drove over knowing that if she didn't, she would never see her again. Beth fails to respond and Jamie leaves abruptly. On her way home, she falls asleep at the wheel and drives into an empty field.\nSome time later, Laura visits Fuller in prison. He says he understands how she acted and asks her to answer his letters just so as not to feel so lonely. She agrees. Gina has a barbecue with friends at her land and her husband appreciates her work. She looks at the sandstone and smiles. Jamie continues working at the ranch.", "cast": "Laura Dern as Laura Wells - Attorney\nKristen Stewart as Elizabeth 'Beth' Travis - Attorney\nMichelle Williams as Gina Lewis - Wife\nLily Gladstone as Jamie - Rancher\nJames LeGros as Ryan Lewis - Husband\nJared Harris as William 'Will' Fuller - Client\nRené Auberjonois as Albert - Old neighbor\nJohn Getz as Sheriff Rowles\nSara Rodier as Guthrie Lewis - Daughter"}