{"_movieID": "58595", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:35:50", "summary": "Snow White and the Huntsman is a 2012 American fantasy film based on the German fairy tale \"Snow White\" compiled by the Brothers Grimm. The film is the directorial debut of Rupert Sanders, with a screenplay by Evan Daugherty, John Lee Hancock and Hossein Amini, from a screen story by Daugherty. In the film's retelling of the tale, Snow White grows up imprisoned by her evil stepmother, Queen Ravenna, a powerful sorceress. After Snow White escapes into the forest, Ravenna tells Eric, the Huntsman that she will bring back his dead wife if he captures Snow White.\nThe cast includes Kristen Stewart, Charlize Theron, Chris Hemsworth, Sam Claflin, and Bob Hoskins in his final film performance. The film received two Academy Award nominations for Best Visual Effects and Best Costume Design at the 85th Academy Awards. It was a success at the box office, earning $396.6 million worldwide against a $170 million budget. Although critics praised the production design, visual effects, Theron and Hemsworth's performances, musical score, and action sequences; Stewart and Claflin's performances received mixed reviews, and the screenplay was heavily criticized.\nA prequel/sequel, titled The Huntsman: Winter's War, directed by the first film's visual effects supervisor Cedric Nicolas-Troyan, was released on April 22, 2016. Hemsworth, Theron, Claflin and Nick Frost reprised their roles and new characters were played by Emily Blunt and Jessica Chastain. Stewart did not reprise her role, but appeared in archive footage.", "plot": "While admiring a rose blooming in the winter, Queen Eleanor of the kingdom of Tabor pricks her finger on one of its thorns. Drops of blood fall onto the snow, and she wishes for a daughter as white as the snow, with lips as red as the blood, hair as black as a raven's wings and heart as strong as the rose. She gives birth to a daughter, Snow White, but falls ill and dies several years later. After her death, Snow White's father, King Magnus, and his army battle an invading dark army of demonic glass soldiers. Upon rescuing their prisoner Ravenna, the King becomes enchanted with her beauty and marries her.\nRavenna is in fact a powerful sorceress and the Dark Army's master. On their wedding night, Ravenna confesses there was a king much like Magnus that hurt her. She declares she cannot be a weak queen and kills Magnus before taking over the kingdom. Snow White's childhood friend William and his father, Duke Hammond, escape the castle but are unable to rescue her, and she is captured and locked away in a tower for many years.\nTabor is ruined under Queen Ravenna's rule. She periodically drains the youth from the kingdom's young women in order to maintain a spell cast over her as a child by her mother, which allows her to keep her youthful beauty. When her stepdaughter Snow White comes of age, she learns from her Magic Mirror that Snow White is destined to destroy her unless she consumes the girl's heart, which will make her immortal. Ravenna orders her brother Finn to bring her Snow White's heart, but Snow White escapes into the Dark Forest, where Ravenna has no power. Ravenna makes a bargain with Eric the Huntsman, a widower and drunkard, to capture Snow White, promising to bring his wife back to life in exchange. The Huntsman tracks down Snow White, but when Finn reveals that Ravenna does not actually have the power to revive the dead, the Huntsman helps Snow White escape. Finn gathers a band of men to find her, and the Duke and William learn that she is alive. William leaves the castle to find her, joining Finn's band as a bowman.\nThe Huntsman and Snow White leave the Dark Forest, where she saves his life by charming a huge troll that attacks them. They make their way to a fishing village populated by women who have disfigured themselves to make themselves useless to the Queen. The Huntsman learns Snow White's true identity, and leaves her in the care of the women. He returns when he sees the village being burned down by Finn's men. Snow White and the Huntsman evade them and meet a band of eight dwarves. The blind dwarf Muir perceives that Snow White is the only person who can defeat Ravenna and end her reign.\nAs they travel through a fairy sanctuary, they are attacked by Finn and his men. A battle ensues during which Finn, his men, and one of the dwarfs are killed, while William reveals himself and joins the group on their journey to Hammond's castle. Halfway there, Ravenna disguises herself as William and tempts Snow White into eating a poisoned apple. She flees when the Huntsman and William discover her. William kisses Snow White but she does not wake up. Her body is taken to Hammond's castle. The Huntsman professes his regret for not being there to save her, as her heart and strength remind him of his late wife, Sara. He kisses her and the spell breaks, as his kiss was one of true love. Snow White awakens and rallies the Duke's army to mount a siege against Ravenna.\nThe dwarves infiltrate the castle through the sewers and open the gates, allowing the Duke's army inside. Snow White confronts Ravenna, but is overpowered. Ravenna is about to kill her when Snow White uses a move the Huntsman taught her and mortally wounds Ravenna, defeating her for good. The kingdom once again enjoys peace and harmony as Snow White is crowned queen.", "cast": "Kristen Stewart as Snow WhiteRaffey Cassidy as young Snow White\nChris Hemsworth as Eric the Huntsman\nCharlize Theron as Queen Ravenna, Snow White's evil stepmother\nIzzy Meikle-Small as young Ravenna\nSam Claflin as William, son of Duke Hammond\nXavier Atkins as young William\nSam Spruell as Finn, Ravenna's brother and enforcer\nElliot Reeve as young Finn\nVincent Regan as Duke Hammond, William's father\nLily Cole as Greta, a young girl who befriends Snow White\nNoah Huntley as King Magnus, Snow White's father\nLiberty Ross as Queen Eleanor, Snow White's mother\nChris Obi as the voice of Mirror Man, the physical form of the Magic Mirror\nRachael Stirling as Anna\nHattie Gotobed as Lily\nGreg Hicks as Black Knight General\nPeter Ferdinando as Black Knight\nAnastasia Hille as Ravenna's Mother"}