{"_movieID": "79070", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:33:17", "summary": "Sleepless is a 2017 American action crime thriller film directed by Baran bo Odar, and written by Andrea Berloff.  The film stars Jamie Foxx as a corrupt Las Vegas police officer who sets out to rescue his kidnapped son. Michelle Monaghan, Dermot Mulroney, David Harbour, Tip \"T.I.\" Harris, Gabrielle Union and Scoot McNairy also star.\nA remake of the French thriller Sleepless Night, the film was released in the United States on January 13, 2017. It received generally negative reviews from critics and grossed $32 million worldwide against a $30 million production budget.\n\n", "plot": "In Las Vegas, corrupt LVMPD policemen Vincent Downs and his partner Sean Cass rob a shipment of cocaine belonging to entrepreneur Stanley Rubino, who intended to sell it to mobster Rob Novak, the son of a powerful mob boss. They volunteer to investigate the robbery in order to cover up their involvement, clashing with Internal Affairs investigators Jennifer Bryant and her superior Doug Dennison, who are suspicious of their involvement. It is also revealed that Vincent is estranged from his wife Dena, who is getting remarried, and has minimal involvement in the life of his 16-year-old son Thomas.\nWhile driving Thomas to his soccer game, Vincent is ambushed by Rubino's men, who stab him in the abdomen and kidnap his son - demanding the stolen cocaine back in exchange for Thomas's life. Vincent retrieves the cocaine from Cass, places it in a duffel bag and leaves it in the ventilation shaft of one of the bathrooms in Rubino's casino, hoping he can negotiate his son's release before handing over his leverage. He is unknowingly followed by Bryant, who, now convinced he is a dirty cop, retrieves it and hides it in the women's locker room nearby. Upon learning that the drugs were moved, Vincent is forced to present Rubino with bags of sugar to ensure Thomas's safety, but Novak uncovers his ruse and Thomas is recaptured by Rubino's men, while Vincent manages to escape.  Meanwhile, after coming up empty while searching the casino for Downs, Dennison is convinced he's gotten away, and directs Bryant to go home and get some sleep.  Bryant gives him the key to the women's locker with the cocaine, and heads for the exit.\nVincent enters the casino as a janitor, but crosses paths with Bryant on her way out and chased into one of the hotel rooms.  They fight, and he subdues her before revealing he's been undercover on behalf of Internal Affairs for the last two years to dismantle the crime ring within the police department.  He knows his partner Cass is a drug-runner, knew details about a previous investigation by Bryant, and is now attempting to find the senior member of law enforcement that is covering everything up.  A skeptical Bryant directs him to the locker room to retrieve the cocaine, but the drugs have recently been removed by Dennison. Dennison ambushes Vincent, but is ultimately overpowered and knocked unconscious.  Meanwhile, Thomas escapes and steals Rubino's cellphone to contact Vincent, but is quietly being followed by Rubino and his men who allow it all to happen in an attempt to lure Vincent into a trap. Elsewhere, Dena finds out Vincent and Thomas are in danger and heads to the casino.\nCass arrives and confronts Vincent about his Internal Affairs involvement, but then saves Vincent from one of Novak's men. He is shot in the process and presumed dead. Vincent infiltrates the casino in a police uniform that Cass brought and finds out Dennison is the mole in the force upon going through Cass' phone; Dennison is on Novak's payroll and ordered Cass to kill Vincent after informing him that he was Internal Affairs. Bryant and Dennison later find a severely injured Cass in the garage. While Bryant checks the vitals of Novak's man, Dennison privately questions Cass on whether Vincent is aware of his involvement and finishes him off when Cass refuses to answer. Vincent and Thomas reunite just as Novak begins shooting up the casino and escape to the parking garage. In the ensuing shootout, Bryant arrests Rubino.\nVincent and Thomas attempt to escape in a stolen car, but are ambushed by Novak and his men, leading to a violent shootout. Dena arrives and kills Novak's remaining henchman to save Vincent and Thomas, before Novak corners them. He shoots Vincent in the chest, but Vincent survives and fatally shoots Novak. Vincent then contacts Bryant and alerts her of Dennison's corruption. She instantly attempts to apprehend him, but Dennison shoots Bryant. He then kills Rubino after questioning him if Novak's father ever mentioned him in his criminal dealings, then shoots dead the policeman driving the cruiser in order to cause the vehicle to crash - intending to frame Rubino for the incident; however, Bryant survives and exposes Dennison - who is promptly arrested.\nVincent and Bryant are taken to the same hospital, where they make amends and congratulate each other on the job. Meanwhile, a corrupt DEA Agent - seen earlier in the film - contacts Novak's father and informs him that there has been a problem, implying to subsequently tell him about his son's death.", "cast": "Jamie Foxx as Vincent Downs\nMichelle Monaghan as Jennifer Bryant\nScoot McNairy as Rob Novak\nDermot Mulroney as Stanley Rubino\nTip “T.I.” Harris as Sean Cass\nDavid Harbour as Doug Dennison\nGabrielle Union as Dena Smith\nOctavius J. Johnson as Thomas \"T\" Downs\nTim Connolly as McFerrin\nDrew Sheer as Anderson\nSalah Barker as Benik\nTim Rigby as Larry"}