{"_movieID": "20504", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:12:37", "summary": "The Book of Eli is a 2010 American post-apocalyptic neo-western action film directed by The Hughes Brothers, written by Gary Whitta, and starring Denzel Washington, Gary Oldman, Mila Kunis, Ray Stevenson, and Jennifer Beals. The story revolves around Eli, a nomad in a post-apocalyptic world, who is told by a voice to deliver his copy of a mysterious book to a safe location on the West Coast of the United States. The history of the post-war world is explained along the way, as is the importance of Eli's task. Filming began in February 2009 and took place in New Mexico.The film was released in theaters in January 2010. Alcon Entertainment financed and co-produced the film with Silver Pictures, while it was distributed by Warner Bros. in the United States; international sales were handled by Summit Entertainment.", "plot": "Thirty years after a nuclear apocalypse, Eli travels on foot toward the west coast of the former United States. Along the way, he demonstrates uncanny survival and fighting skills, hunting wildlife and swiftly defeating a group of desert bandits who try to ambush him. Searching for water, he arrives in a ramshackle town rebuilt and ruled by a warlord named Carnegie. Carnegie dreams of building more towns and of controlling the people through the power of a certain book. Henchmen scour the desolate landscape daily in search of it, but to no avail. Carnegie also has control of a hidden water supply which he rations to the townspeople. \nIn town Eli barters with a store owner, the Engineer, to recharge the battery of his portable music player. While waiting, he goes across the street to the town bar, where a gang of bikers attack him, but he quickly kills all fifteen. Realizing that Eli is a literate man like himself, Carnegie asks Eli to stay, making it clear that the offer is non-negotiable. After Carnegie's blind mistress Claudia gives Eli some food and water, Carnegie orders Claudia's daughter Solara to seduce Eli, but he turns her down. While killing time, she finds his book. Unperturbed, Eli offers to share his food with her, and before they eat, he says grace. The following day, Solara repeats the prayer during breakfast with her mother, and Carnegie overhears them and realizes that Solara's words relate to the book that he has been seeking. He soon forces Solara to tell him if Eli was reading a book, and realizes that Eli's book is the one that he wants—a Bible.\nEli sneaks out of his room, but Carnegie and his henchmen confront him in the street. When Eli refuses to give up the book, Carnegie orders him killed. But the bullets fail to even wound Eli, flying clear of him as if he were somehow protected. Eli shoots many of Carnegie's men and hits Carnegie in the leg with a ricocheted shotgun blast. Solara, having fled the town, leads Eli to a cave which is the town's water supply, hoping that she can accompany him on his travels. Eli traps her inside and continues alone. Solara escapes and soon finds herself ambushed by two bandits who attempt to rape her, but Eli reappears and kills them. As they continue, Eli explains his mission to Solara. According to Eli, his book is the last remaining copy of the Bible, as all other copies were intentionally destroyed following the nuclear war thirty years ago. He says that he was led to the book by a voice in his head, which then directed him to travel westward to a place where it would be safe. The voice assured him that he would be protected and guided on his journey.\nEventually, Eli and Solara find an isolated house. They fall into a trap, but they manage to allay the suspicions of the residents, George and Martha, who invite them in for tea. When Eli realizes that the couple are cannibals, they attempt to leave just as Carnegie and his henchmen arrive. In the ensuing shootout, George, Martha, and many of Carnegie's men are killed, and Eli and Solara are captured. Carnegie threatens to kill Solara unless Eli surrenders the Bible. With the Bible now in his possession, Carnegie shoots Eli and leaves him for dead. Solara escapes by strangling the driver of the truck that she was in and throwing a hand grenade under another truck. She then drives back towards the house to find Eli. Rather than chase her, Carnegie returns to the town because his sole remaining vehicle is running low on fuel. Solara finds Eli, and they drive until they reach the Golden Gate Bridge. They then row to Alcatraz Island, where they find a group intent on preserving what remains of literature and music. Eli tells the guards that he has a copy of the Bible. Once inside, Eli, revealed to be blind, begins to dictate the New King James Version of the Bible from memory to Lombardi, the leader of the group.Meanwhile, back in the town, the Engineer opens the locked Bible where Carnegie discovers, to his dismay, that it is in Braille, and orders Claudia to read it to him. She pretends that she cannot remember how to read it, telling Carnegie that his leg wound has become infected, and due to limited enforcers, the people have begun to run amok. At the sanctuary, Eli has died, but not before he finished reciting the entire book. The printing press at Alcatraz begins producing copies of the Bible, and Lombardi places one on a bookshelf between the Torah and Tanakh on one side and the Quran on the other. Solara, though offered sanctuary, chooses to return home, taking with her Eli's machete and other possessions."}