{"_movieID": "245703", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:12:28", "summary": "Midnight Special is a 2016 American science fiction film written and directed by Jeff Nichols, and produced by Sarah Green and Brian Kavanaugh-Jones. The film stars Michael Shannon, Joel Edgerton, Kirsten Dunst, Adam Driver, Jaeden Martell, and Sam Shepard.  It is Nichols's fourth full-length film and his first studio production. It was selected to compete for the Golden Bear at the 66th Berlin International Film Festival.The story revolves around Roy Tomlin and his biological son, Alton Meyer, escaping from both the government and a cult, after discovering that Alton has special powers. The film began a theatrical release on March 18, 2016, by Warner Bros. Pictures, expanding wider in subsequent weeks.", "plot": "In a motel, Roy Tomlin (Michael Shannon) and his friend Lucas (Joel Edgerton) watch an AMBER Alert for 8-year-old Alton Meyer (Jaeden Lieberher) and his reported abductor, Roy, while the boy reads on the floor.\nAt the Ranch, a religious cult in rural Texas, Pastor Calvin Meyer (Sam Shepard) dispatches two of his parishioners (Bill Camp and Scott Haze) to retrieve Alton. He then faces his congregation as the FBI storms their church. NSA communications analyst Paul Sevier (Adam Driver) asks Calvin how numbers sent via encoded satellite transmissions made their way into his sermons. Calvin explains that Alton speaks in tongues and gave the numbers to Calvin. As Alton's powers grew, his mother Sarah (Kirsten Dunst) abandoned him, and members of the Ranch have been raising him, with Pastor Meyer as his adoptive father. It is also noted in this sequence that Roy is Alton's biological father.\nAfter a violent confrontation with a state trooper, Roy and Lucas seek cover at the home of Elden (David Jansen), a former Ranch member. During the night, an earthquake seems to wake Roy and Lucas. When they break down the door to Alton's room, they find him linked to Elden by blinding beams of light directly from his eyes into Elden's. Roy knocks out Elden and covers up Alton, who is extremely photosensitive. They take Elden's van and continue on toward a location that Alton specified. Members of the Ranch seem to know this location, but the FBI is desperately trying to figure out where the trio are headed.\nWhen they stop at a gas station, Alton seems to destroy a satellite, creating a rain of debris crashing down on them. They drive to Sarah Tomlin's house, and she is overjoyed to be reunited with her son. After they watch the news together, Alton explains that he caused the satellite to crash because the police were using it to track him. \nAs the fugitives, now including Sarah, continue their trek, Alton appears to be growing sick and weak. He convinces Roy to let him see the daylight, while Lucas and Sarah go ahead to a motel. After witnessing his first sunrise, Alton's eyes begin to glow, and an enormous dome of light surrounds the duo. They reunite with Lucas and Sarah, and Alton is healthy. He explains that seeing the sun helped him realize his true identity. He explains that there is a world \"built on top of\" this one, and that he belongs to it. Roy confirms that he briefly saw this hidden world inside the dome of light.\nWhen they leave the hotel room, they are ambushed by Calvin's trackers from the ranch, who abduct Alton but are soon captured by the police. The boy is taken to a government facility where he insists that he will only talk to Sevier. After Sevier experiences Alton's powers, he helps reunite him with his parents. Having deduced their destination from Calvin's sermons, Sevier warns the fugitives that there is a 5-mile security perimeter around the location, on the Florida panhandle.\nRoy barrels through a roadblock, driving inside the perimeter as the Army scrambles to chase them. Alton and Sarah exit the car and run into the woods. Roy and Lucas lead the Army on a wild goose chase while Alton and Sarah reach the edge of a swamp. There, Alton creates a dome of light that engulfs much of Florida and surrounding states; everyone inside it can see the futuristic structures of a parallel world. Eventually, other beings of this world gather around Alton, and the entire dome disappears, taking Alton with it.\nRoy and Lucas are arrested. Lucas is interviewed by the FBI. He tells them the story, but they are dissatisfied. Sevier then enters to interview him, with Lucas the only one aware of Sevier's previous involvement. Sarah cuts off her cult traditionalist hair braid in a local gas station. Roy, incarcerated and wearing an electroencephalography device, watches the sunrise as his eyes glow faintly."}