{"_movieID": "332562", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:17:25", "summary": "A Star Is Born is a 2018 American musical romantic drama film produced and directed by Bradley Cooper and written by Eric Roth, Cooper and Will Fetters. It stars Cooper, Lady Gaga, Dave Chappelle, Andrew Dice Clay, and Sam Elliott, and follows a hard-drinking musician (Cooper) who discovers and falls in love with a young singer (Gaga). It is the third remake of the original 1937 film, after the 1954 musical and the 1976 musical.\nTalks of a remake of A Star Is Born began in 2011, with Clint Eastwood attached to direct and Beyoncé set to star. The film was in development hell for several years with various actors approached to co-star, including Christian Bale, Leonardo DiCaprio, Jennifer Lopez, Will Smith, and Tom Cruise. In March 2016, Cooper signed on to star and direct, and Lady Gaga joined the cast in August 2016. Principal photography began at the Coachella Valley Music and Arts Festival in April 2017.A Star Is Born premiered at the 75th Venice International Film Festival on August 31, 2018, and was theatrically released in the United States on October 5, 2018, by Warner Bros. It was a huge commercial success grossing over $434 million worldwide and received critical acclaim, with praise for Cooper, Gaga, and Elliott's performances and Cooper's direction, as well as the screenplay, cinematography and music. It was chosen by both the National Board of Review and American Film Institute as one of the Top 10 Films of 2018. The film received numerous accolades, including eight nominations at the 91st Academy Awards, among them Best Picture, Best Actor (Cooper), Best Actress (Gaga) and Best Supporting Actor (Elliott); it won Best Original Song for Gaga's \"Shallow\". It also earned five nominations at the 76th Golden Globe Awards, including Best Motion Picture – Drama, and won Best Original Song for \"Shallow\".", "plot": "Jackson \"Jack\" Maine, a famous country rock singer privately battling an alcohol and drug addiction, plays a concert. His main support is Bobby, his manager and older half-brother. After a show, Jack, searching for his next drink, visits a drag bar where he witnesses a tribute performance to Edith Piaf, by Ally, a waitress and singer-songwriter. Jack is amazed by her performance, and they spend the night talking to each other, where Ally discloses to him her unsuccessful efforts in pursuing a professional music career. Ally shares with Jack some lyrics she has been working on, and Jack tells Ally she is a talented songwriter and should perform her own material.\nJack invites Ally to his next show. Despite her initial refusal she attends and, with Jack's encouragement, sings \"Shallow\" on stage with him. Jack invites Ally to go on tour with him, and they form a romantic relationship. In Arizona, Ally and Jack visit the ranch where Jack grew up and where his father is buried, only to discover that Bobby sold the land and it was converted to a wind farm. Angered at his betrayal, Jack punches Bobby, who subsequently quits as his manager. Before doing so, Bobby reveals that he did inform Jack about the sale, but Jack was too inebriated to notice.\nWhile on tour Ally meets Rez, a record producer who offers her a contract. Although visibly bothered, Jack still supports her decision. Rez refocuses Ally away from country music and towards pop. Jack misses one of Ally's performances after he passes out drunk in public; he recovers at the home of his best friend George \"Noodles\" Stone, and later makes up with Ally. There he proposes to Ally with an impromptu ring made from a loop of guitar string, and they are married that same day at a church ministered by a relative of Noodles.\nDuring Ally's performance on Saturday Night Live, Bobby reconciles with Jack. Later, Jack and Ally fight after he drunkenly voices his disapproval of Ally's new image and music, which is nominated for three Grammy Awards. At the Grammys, a visibly intoxicated Jack performs in a tribute to Roy Orbison, and Ally wins the Best New Artist award. When she goes up on stage to receive her award, Jack staggers up to her, where he publicly wets himself and passes out. Ally's father Lorenzo berates a semi-conscious Jack, while Ally attempts to help Jack sober up. Jack joins a rehabilitation program shortly thereafter. Jack recovers in rehab for about two months, where he discloses to his counselor that he attempted suicide when he was 13 years old. He also mentions that he has tinnitus, which has been getting worse.\nJack tearfully apologizes to Ally for his behavior, and returns home. Ally asks to bring Jack to perform with her on the European leg of her tour; Rez refuses, prompting Ally to cancel the remainder of the tour so she can care for Jack. Rez later confronts Jack, accusing him of being washed-up and of holding Ally back. That evening, Ally lies to Jack, and tells him that her record label has cancelled her tour so she can focus on her second album. Jack promises that he will come to her concert that night, but after Ally leaves, he hangs himself in their garage. Ally, grief-stricken and inconsolable after Jack's suicide, is visited by Bobby, who explains that the suicide was Jack's own decision and it was not her fault. The closing scenes reveal a flashback of Jack working on a song about his love for Ally which he had not finished.  Ally sings this song as tribute to Jack, introducing herself for the first time as Ally Maine.", "cast": "Bradley Cooper as Jackson \"Jack\" Maine, an established singer-songwriter and alcoholic. He is Ally's mentor and husband.\nLady Gaga as Ally, a singer-songwriter who is discovered by Jack and later becomes his wife.\nSam Elliott as Bobby Maine, Jack's older half-brother and manager.\nDave Chappelle as George \"Noodles\" Stone, Jack's best friend, himself a retired musician.\nAndrew Dice Clay as Lorenzo, Ally's father.\nAnthony Ramos as Ramon, Ally's friend.\nRafi Gavron as Rez Gavron, a music producer and Ally's manager.\nGreg Grunberg as Phil, Jackson's driver.Additionally, Shangela Laquifa Wadley appears as the drag bar emcee, Willam Belli as drag queen Emerald, and Ron Rifkin as Jackson's rehab therapist Carl. Rebecca Field portrays Gail, while Michael Harney portrays Wolfie, a friend of Lorenzo. Lukas Nelson & Promise of the Real appear as Jackson's band, Eddie Griffin appears as a local preacher and Luenell appears as a cashier. Marlon Williams, Brandi Carlile, Halsey, Alec Baldwin, and Don Roy King cameo as themselves."}