{"_movieID": "39013", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:42:01", "summary": "Winter's Bone is a 2010 American mystery drama film directed by Debra Granik. It was adapted by Granik and Anne Rosellini from the 2006 novel of the same name by Daniel Woodrell. The film stars Jennifer Lawrence as a teenage girl in the rural Ozarks of Missouri who, to protect her family from eviction, must locate her missing father. The film explores the interrelated themes of close and distant family ties, the power and speed of gossip, self-sufficiency, and poverty as they are changed by the pervasive underworld of illegal meth labs.\nThe film won several awards, including the Grand Jury Prize: Dramatic Film at the 2010 Sundance Film Festival. It also received 4 Academy Award nominations: Best Picture, Best Adapted Screenplay, Best Actress for Lawrence and Best Supporting Actor for John Hawkes.", "plot": "In the rural Ozarks of Missouri, seventeen-year-old Ree Dolly looks after her mentally ill mother, twelve-year-old brother Sonny and six-year-old sister Ashlee. She makes sure her siblings eat and teaches them survival skills such as hunting and cooking. The family is destitute. Ree's father, Jessup, has not been home for a long time; his whereabouts are unknown. He is out on bail following an arrest for manufacturing meth.\nSheriff Baskin tells Ree that if her father does not appear for his court date, they will lose the house because it was put up as part of his bond. Ree sets out to find her father. She starts with her meth-addicted uncle Teardrop and continues to more distant kin, eventually trying to talk to the local crime boss, Thump Milton. Milton refuses to see her; the only information Ree comes up with are warnings to leave the situation alone and stories that Jessup died in a meth lab fire or skipped town to avoid the trial.\nWhen Jessup fails to appear for the trial, the bondsman comes looking for him and tells Ree that she has about a week before the house and land are seized. Ree tells him that Jessup must be dead, because \"Dollys don't run\". He tells her that she must provide proof that her father is dead to avoid the bond being forfeited.\nRee tries to go see Milton again and is severely beaten by the women of his family. Teardrop rescues Ree, promising her attackers that she will not cause more trouble. Teardrop tells Ree that her father was killed because he was going to inform on other meth cookers, but he does not know who killed him. He warns her that if she finds out who did, she must not tell him.\nA few nights later, the Milton women who beat Ree come to her house and offer to take her to \"[her] daddy's bones\". The women place a sack on her head and drive her to a pond, where they row to the shallow area where her father's submerged body lies. They tell Ree to reach into the water and grasp her father's hands so they can cut them off with a chainsaw; the severed arms will serve as proof of death for the authorities. Ree takes the hands to the sheriff, telling him that someone flung them onto the porch of her house.\nThe bondsman gives Ree the cash portion of the bond, which was put up by an anonymous associate of Jessup. Ree tries to give Jessup's banjo to Teardrop, but he tells her to keep it at the house for him. As he is leaving, he tells her that he now knows who killed her father. Ree reassures Sonny and Ashlee that she will never leave them. As the three sit on the porch, Ashlee begins to play the banjo."}