{"_movieID": "246655", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:56:34", "summary": "X-Men: Apocalypse is a 2016 American superhero film directed and produced by Bryan Singer and written by Simon Kinberg from a story by Singer, Kinberg, Michael Dougherty, and Dan Harris. The film is based on the fictional X-Men characters that appear in Marvel Comics and is the ninth installment in the X-Men film series. It is the sequel to X-Men: Days of Future Past (2014) and stars James McAvoy, Michael Fassbender, Jennifer Lawrence, Oscar Isaac, Nicholas Hoult, Rose Byrne, Tye Sheridan, Sophie Turner, Olivia Munn, and Lucas Till. In the film, the ancient mutant En Sabah Nur / Apocalypse awakens in 1983 and plans to wipe out the modern civilization and take over the world, leading the X-Men to try to stop him and defeat his team of mutants. Additionally, Evan Peters reprised his role as Quicksilver from X-Men: Days of Future Past and is also joined by Ben Hardy, who is playing Archangel. \nThe film was announced by Singer in December 2013, with Kinberg, Dougherty, and Harris attached to develop the story. Casting began in October 2014, while principal photography commenced in April 2015 in Montreal and ended in August of the same year. \nX-Men: Apocalypse premiered in London on May 9, 2016, and was released in the United States on May 27, 2016 in 3D and 2D, and in IMAX 3D in select international markets. Critics praised its themes and acting performances, while the Apocalypse character and overuse of CGI were faulted. A sequel, titled Dark Phoenix, was released on June 7, 2019.", "plot": "In 3600 BCE, the powerful mutant lord En Sabah Nur, hailed as a god named Apocalypse, rules ancient Egypt until he is entombed alive by a rebellion. Awakening in 1983, he believes humanity has lost its way. Aiming to destroy the world and remake it in the image he sees fit, he recruits Ororo Munroe and upgrades her power. In East Berlin, shape-shifting mutant Raven frees Kurt Wagner, a teleporting mutant, from a cage match with Angel and requests black marketeer Caliban to transport him to America. Apocalypse recruits Caliban's bodyguard Psylocke, and Angel, enhancing both of their powers.\nAlex Summers takes his brother Scott to Professor Charles Xavier's educational institute, hoping that Xavier and Hank McCoy will teach him to control his mutation for shooting optic beams. Scott meets the Level 5 telepathic and telekinetic Jean Grey, and the two develop an attraction. Apocalypse's powers cause disturbances around the world, leading Xavier and Alex to consult with CIA operative Moira MacTaggert, who has been researching the legend of Apocalypse and tells them Apocalypse's origins; he was born millennia ago in Egypt as the first mutant, leading a team of mutant soldiers known as the Four Horsemen, while Apocalypse used his powers of destruction and rebuild.\nIn Communist Poland, Erik Lehnsherr uses his powers to save a co-worker during an earthquake, prompting local soldiers to capture him. When one accidentally kills his wife and daughter, Erik retaliates by slaughtering the group. Apocalypse takes Erik to Auschwitz and encourages him to use his powers; Erik destroys the camp and joins Apocalypse, who remotely accesses Cerebro, the device Xavier uses to locate mutants, and forces Xavier to make the global superpowers launch their entire nuclear arsenals into space to prevent interference with his plan. \nApocalypse and his Four Horsemen arrive at the mansion and kidnap Xavier. Attempting to stop them, Alex causes an explosion that destroys the mansion. Peter Maximoff arrives and uses his super-speed to evacuate the building, but Alex seemingly dies in the blast. Colonel William Stryker's forces capture Hank, Raven, Peter, and Moira, and take them for interrogation. Scott, Jean, and Kurt follow covertly, and liberate their comrades using Stryker's experiment Weapon X (Wolverine), whose memories Jean partially restores before he escapes. Apocalypse, Xavier and the Horsemen arrive at Cairo.\nIn Cairo, Erik uses his powers to control the Earth's magnetic poles causing destruction across the planet. Apocalypse plans to transfer his consciousness into Xavier's body and enslave every person on Earth. He forces Xavier to send a message to mankind, informing them of his plan. However, Xavier secretly sends a telepathic distress call to Jean, as well as ordering mutants to protect humans, and the others travel to Cairo to battle Apocalypse and his horsemen and rescue Xavier whilst Apocalypse uses his powers to destroy the city, transforming it into a huge pyramid where he would transfer his mind into Xavier's. When Angel and Psylocke attack the plane, Nightcrawler teleports them away and crashes the plane, seemingly killing Angel. Apocalypse discovers Xavier rescued, much to his anger.\nErik and Ororo are persuaded to turn on Apocalypse and, with the help of Scott, keep him occupied physically while Xavier fights him telepathically in the astral plane. Xavier encourages Jean to unleash the full strength of her abilities, incinerating Apocalypse's body to death while Psylocke escapes. \nAfter the battle, Xavier and Moira rekindle their relationship, Erik and Jean help reconstruct the school, but Erik refuses Xavier's offer to stay and help teach; Peter likewise decides not to tell Erik yet that he is Erik's son. Using confiscated Sentinels, Hank and Raven train the new X-Men recruits: Scott, Jean, Ororo, Kurt, and Peter.\nIn a post-credits scene, men in black suits visit the Weapon X facility to retrieve an X-ray and a blood sample marked \"Weapon X\", on behalf of the Essex Corporation.", "cast": "James McAvoy as Charles Xavier / Professor X: A mutant pacifist and the world's most powerful telepath, who is the founder of Xavier's School for Gifted Youngsters and leads the team of mutants known as the X-Men, in order to protect humankind and battle against the deadly enemy within. During the latter part of the film's production, McAvoy shaved his head for the role.\nMichael Fassbender as Erik Lehnsherr / Magneto: A mutant Auschwitz survivor with the ability to control magnetic fields and manipulate metal, who was once Xavier's closest ally and best friend until his belief that mankind and mutantkind would never coexist led to their separation. He is globally infamous for attempting to assassinate U.S. President Richard Nixon on live broadcast 10 years prior.Bill Milner appears in archival footage as a Young Erik.Jennifer Lawrence as Raven Darkhölme / Mystique:A mutant with shapeshifting abilities, globally renowned for saving Nixon's life 10 years prior. She is also Xavier's once closest ally and his adopted sister. Lawrence said, \"she hears about what happened to Erik and she wants to seek him out and help him.\"\nOscar Isaac as En Sabah Nur / Apocalypse: Born in ancient times, and presumably the world's first mutant, he has a variety of destructive superhuman abilities, including telekinesis, cyberpathy, teleportation, and the ability to augment other mutants' abilities, as a result of being able to amass powers when transferring his consciousness from one body to another. Isaac described Apocalypse as the \"creative-slash-destructive force of the Earth.\" He added, \"When things start to go awry, or when things seem like they're not moving towards evolution, [Apocalypse] destroys those civilizations.\" Isaac had to go through extensive makeup and prosthetics applications, and wore high-heeled boots to appear taller and a 40-pound suit. The full costume was uncomfortable, particularly in the humid environment of the outdoor scenes, which forced Isaac to go to a cooling tent between takes. Apocalypse's previous old-form (seen at the beginning of the film) was played by Berdj Garabedian, a 70-year-old Canadian real estate agent, and avid silver screen fan in his first credited film role.\nNicholas Hoult as Hank McCoy / Beast: A mutant with leonine attributes, prehensile feet and superhuman physical abilities. Hank acts as a teacher in Xavier's school and he builds inventions for troubled students. He also built the X-Jet.\nRose Byrne as Moira MacTaggert: A CIA operative who first met and fell in love with Xavier in X-Men: First Class, where he wiped portions of her memories of him and the X-Men at the end. Simon Kinberg said they are \"essentially, strangers\" when they meet in this film.\nEvan Peters as Peter Maximoff / Quicksilver: A mutant who can move, think, and perceive at hypersonic speeds, and the son of Magneto. Describing the relationship between Quicksilver and Magneto, Peters stated, \"I have learned that he's my father at this point and I am trying to ... I don't know what I can say. I'm trying to ... Yeah. It's like an adoptive child or any kind of child who has a strange father trying to ... He knows who he is now so he is trying to find him. He's been searching for him. It's been 10 years and he hasn't found him and then something happens.\"\nTye Sheridan as Scott Summers / Cyclops: A mutant who fires destructive optic beams and wears a ruby visor or sunglasses to stabilize and contain them, and who is the younger brother of Havok. Sheridan describes Cyclops as \"angry and a bit lost.\" He added, \"He's now learning about being a mutant and trying to handle his powers.\"\nSophie Turner as Jean Grey: A mutant who is scared of her telepathic and telekinetic power, and one of Charles Xavier's most prized students. Turner states that she was cast in the film because of the \"dark side\" of her character Sansa Stark in Game of Thrones. She compared Jean to Sansa and described being an outcast in the human world, who struggles with her power and gift, the same way Sansa, who wanted to live a normal life, felt. Turner learned archery in preparation for the role.\nOlivia Munn as Psylocke: A mutant with telepathic, telekinetic and psionic abilities. Her abilities also include projecting purple psychic energy, usually into the form of an energy blade that can burn through metal. Munn described Psylocke as \"very lethal, very powerful and very strong.\" She practiced sword fighting in preparation for the role.\nKodi Smit-McPhee as Kurt Wagner / Nightcrawler: A German teleporting mutant and one of Charles Xavier's new students. Singer said Nightcrawler is a source of comic relief.\nAlexandra Shipp as Ororo Munroe / Storm: A young mutant orphan who can control weather. Storm is discovered by Apocalypse in Cairo. Shipp shaved her head partially, and sported a Mohawk for the role.\nLucas Till as Alex Summers / Havok: A mutant who has the ability to absorb energy and release it with destructive force from his body, and the older brother of Cyclops.\nJosh Helman as Colonel William Stryker: A military officer who hates mutants and has, in the ten years since Days of Future Past, been developing his own plans for resolving \"the mutant problem\".\nBen Hardy as Angel: A mutant with bird-like feathered wings, gaining metallic wings which can also be used as razor sharp projectiles as a result, similar to his Archangel counterpart in the comics. Hardy practiced indoor skydiving in preparation for his role.\nLana Condor as Jubilee: A mutant student at Charles's school who has the ability to create psionic energy plasmoids. Discussing her first day on X-Men: Apocalypse, Condor says, \"I was very new and it was my first role. I'd never been on a set before or in front of a camera, so I didn't know what to expect. The first day we shot scenes in an 80s-themed mall with hundreds of extras in 80s gear, plus crew and cameras. It was surreal...It's a lot easier when you have the costume, as that helps bring everything to life. She has her iconic yellow jacket, which is a staple. It's very bold and confident, like her. A lot of her costumes are super 80s. I also listened to music from the 80s and that helped.\"Tómas Lemarquis portrays Caliban, a mutant with the ability to sense and track other mutants. Wrestler \"Giant\" Gustav Claude Ouimet plays The Blob, Angel's opponent in an underground fight club. Monique Ganderton, Warren Scherer, Rochelle Okoye, and Fraser Aitcheson play Apocalypse's original lieutenants, Death, Pestilence, Famine, and War respectively.   Carolina Bartczak portrays Magda Gurzsky, the wife of Erik Lehnsherr and mother of their mutant daughter Nina Gurzsky.Hugh Jackman makes an uncredited appearance as Logan / Wolverine, in his Weapon X form. In that same scene, director Bryan Singer cameos as a guard who is killed by Wolverine as he attempts to escape the complex. X-Men co-creator Stan Lee and his wife Joan B. Lee make a cameo appearance together, as bystanders witnessing the launch of nuclear missiles worldwide; this was Joan's last film before her death the following year. Željko Ivanek cameos as a Pentagon scientist. In a deleted scene, Scott shows Jean a record from Dazzler. The scene is not in the theatrical film, but is included on the home video release.Archive footage was used of Caleb Landry Jones as Sean Cassidy / Banshee, journalist Jessica Savitch and actors Leslie Parrish and Michael Forest (the latter two appearing in footage with dialogue from the 1967 Star Trek episode \"Who Mourns for Adonais?\")."}