{"_movieID": "104461", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:13:19", "summary": "The Young and the Restless (often abbreviated as Y&R) is an American television soap opera created by William J. Bell and Lee Phillip Bell for CBS. The show is set in a fictionalized version of Genoa City, Wisconsin. First broadcast on March 26, 1973, The Young and the Restless was originally broadcast as half-hour episodes, five times a week. The show expanded to one-hour episodes on February 4, 1980. In 2006, the series began airing encore episodes weeknights on SOAPnet until 2013, when it moved to TVGN (now Pop). As of July 1, 2013, Pop still airs the encore episodes on weeknights.  The series is also syndicated internationally.The Young and the Restless originally focused on two core families: the wealthy Brooks family and the working class Foster family. After a series of recasts and departures in the early 1980s, all the original characters except Jill Foster were written out. Bell replaced them with new core families, the Abbotts and the Williamses. Over the years, other families such as the Newmans, the Barber-Winters, and the Baldwin-Fishers were introduced. Despite these changes, one storyline that has endured through almost the show's entire run is the feud between Jill Abbott and Katherine Chancellor, the longest rivalry on any American soap opera.Since its debut, The Young and the Restless has won 10 Daytime Emmy Awards for Outstanding Drama Series. It is also currently the highest-rated daytime drama on American television. As of 2008, it had appeared at the top of the weekly Nielsen ratings in that category for more than 1,000 weeks since 1988. As of December 12, 2013, according to Nielsen ratings, The Young and the Restless was the leading daytime drama for an unprecedented 1,300 weeks, or 25 years. The serial is also a sister series to The Bold and the Beautiful, as several actors have crossed over between shows. In April 2019, The Young and the Restless was renewed for the 2019–20 United States network television schedule."}