{"_movieID": "26149", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:31:01", "summary": "Music of the Heart is a 1999 American musical drama film directed by Wes Craven and written by Pamela Gray, based on the 1995 documentary Small Wonders.\nThe film is a dramatization of the true story of Roberta Guaspari, portrayed by Meryl Streep, who co-founded the Opus 118 Harlem School of Music and fought for music education funding in New York City public schools. The film also stars Aidan Quinn, Gloria Estefan (in her film debut), and Angela Bassett. It was director Wes Craven's only non-horror film, aside from his contribution to the multifaceted and directorially diverse Paris, je t'aime. It was also his only film to receive Academy Award nominations.", "plot": "In 1988 New York City, Roberta Guaspari, a recently divorced violinist, lives with her two sons, Alexi and Nicholas Tzavaras, and her mother, Assunta Guaspari. With Assunta's encouragement, Guaspari attempts to rebuild her life and is recommended to the head teacher of East Harlem's Central Park East School. Despite having little experience in actual music teaching, she accepts a substitute violin teaching position at Central Park East. With a combination of her toughness and determination, she inspires a group of children, and their initially skeptical parents. The program slowly develops and attracts publicity, eventually expanding to Central Park East II and River East Schools.\nTen years later, the Central Park East, Central Park East II and River East School string programs work with the New York City Board of Education to help eliminate funding for the programs, which leads to Guaspari's early dismissal. Determined to fight the budget cuts, she enlists the support of former pupils, parents and teachers and plans a benefit concert, Fiddlefest, to raise money so that the program can continue. But with a few weeks to go and all participants furiously rehearsing, they lose the venue. However, Arnold Steinhardt, the husband of a publicist friend, is a violinist in the Guarneri Quartet, and he enlists the support of other well-known musicians, including Isaac Stern and Itzhak Perlman. They arrange for the concert to be mounted at Carnegie Hall.\nOn the day of Fiddlefest, Guaspari and her students perform with Perlman, Steinhardt, Stern, Mark O'Connor, Michael Tree, Charles Veal Jr., Karen Briggs, Sandra Park, Diane Monroe, and Joshua Bell, increasing donations and making the event a massive success.\nIn the epilogue, descriptions show Guaspari and the Opus 118 program's activities after the events in 1991.", "cast": "Meryl Streep as Roberta Guaspari\nAidan Quinn as Brian Turner, Roberta's love interest\nAngela Bassett as Janet Williams, school principal\nGloria Estefan as Isabel Vasquez, a teacher\nCloris Leachman as Assunta Vitali Guaspari, Roberta's mother\nJosh Pais as Dennis Rausch\nJane Leeves as Dorothea von Haeften, a wealthy socialite\nKieran Culkin as Alexi Tzavaras, Roberta's son\nMichael Angarano as Nick Tzavaras, Roberta's son\nJay O. Sanders as Dan Paxton\nJean-Luke Figueroa as Ramone Olivas, a student\nOlga Merediz as Ms. Olivas, Ramone's mother\nCharlie Hofheimer as Nicholas Tzavaras, Roberta's son\nBetsy Aidem as Mrs. Lamb"}