{"_movieID": "238615", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:28:08", "summary": "Self/less is a 2015 American science fiction action thriller film directed by Tarsem Singh, produced by Ram Bergman and James D. Stern and written by Alex and David Pastor. The film tells the story of a business tycoon and billionaire named Damian Hale, who is diagnosed with a deadly illness. However, he manages to somehow save his life with the aid of Professor Albright, who transfers Hale's consciousness into a new, younger body. The film stars Ryan Reynolds, Natalie Martinez, Matthew Goode, Victor Garber, Derek Luke, and Ben Kingsley.\nSelf/less was originally set to release on February 27, 2015, but because of multiple setbacks, it was not released until July 10, 2015. It was produced by Endgame Entertainment and was financed by FilmDistrict and was predicted to be financially successful, due to its association with the producers Ram Bergman and James D. Stern, who also produced Looper, as well as the ensemble cast. The film grossed $12 million in North America and a total of $30 million worldwide, against a $26 million production budget. The Rotten Tomatoes critical consensus says the film does not live up to its premise.", "plot": "Billionaire New Yorker Damian Hale is diagnosed with terminal cancer. He finds a business card directing him to Professor Albright, who informs him about a medical procedure called \"shedding\", in which one's consciousness is transferred to an artificially grown body. Damian agrees to the procedure and follows Albright's instructions to stage his own public death. Albright transfers him into a new body and prescribes medication to alleviate the vivid hallucinations which he claims are side effects of the procedure.\nDamian starts a new life in New Orleans under the assumed name of Edward Kidner and quickly befriends his neighbor Anton. He forgets to take his medicine and has hallucinations of a woman and child. Damian questions Albright, who dismisses it but accidentally mentions details of the hallucinations that Damian had not discussed.\nAlbright arranges for Damian to move to Hawaii, but Damian, convinced the hallucinations are a memory, identifies a landmark he saw in his vision and heads to a farmhouse outside of St. Louis. There, he finds the woman, Madeline, who reacts to him as her apparently deceased husband Mark. Damian plays along as Mark, though shocked to learn that Mark sold himself to Albright to pay for their daughter Anna's life-saving treatment. Damian and Madeline are suddenly attacked by Albright's men, including Anton. Damian fatally wounds Anton and kills his accomplices, then flees with Madeline to collect Anna from school.\nAt a motel, Damian uses a laptop to research \"shedding\" and discovers an elderly Dr. Francis Jensen, now deceased, was the pioneer researcher in the field of transhumanism. In a video, Damian notices a tic Jensen shares with Albright, then sees Albright sitting next to Jensen, deducing that Jensen has shed himself into Albright's body.\nDamian finds Jensen's wife, Phyllis, in a nursing home, but she is suffering from Alzheimer's and remembers nothing. Damian lures Jensen to the facility, and Jensen reveals that the pills will eventually eliminate Mark's personality. Without the pills, Damian's consciousness will die, and Mark's will re-emerge.\nJensen escapes when more killers arrive. Damian is almost overpowered, but Madeline wounds the attacker, who proves to be Anton in a new body. Anton reveals that he has shed multiple times. While Damian confiscates Anton's pills, Anton taunts Madeline to ask her \"husband\" why he can not answer personal questions about their life.\nMadeline confronts \"Mark\" over his lack of knowledge of their personal details, and Damian reveals the entire story. He takes her and Anna to his friend Martin O'Neill and convinces Martin to arrange for Madeline and Anna to flee to the Caribbean. When he and Madeline discover Anna playing with Martin's previously deceased child Tony, Martin admits that he used shedding, and that Albright's men are coming. Damian reveals shedding's secret to Martin, who also believed that the bodies were artificially grown. Damian distracts Jensen's men while Martin flees with the others. Damian again fatally injures Anton, but the other thugs realize that Damian is alone and turn to recapture Madeline and Anna.\nDamian stops taking his medicine to experience Mark's memories, which reveal that Jensen has a lab in an abandoned warehouse. Jensen captures him and starts to shed Anton into Mark's body. Damian, remembering that metal interferes with the process, hides a bullet casing in his mouth, destroying Anton's consciousness. Masquerading as Anton, Damian rescues the others. Although Jensen tries to claim that Damian needs him to survive, Martin was able to reverse-engineer the pills and give Damian the formula, allowing Damian to immolate Jensen with a flamethrower. After killing Jensen, he has Martín complete Madeline and Anna's escape to the Caribbean. \nDamian visits his estranged daughter Claire but does not reveal his presence inside Mark, simply giving her a letter that reconciles Claire with her father. Damian travels to the Caribbean and stops taking his medicine. The real Mark re-emerges and finds a video message from Damian, thanking him for the time he gave him. Mark reunites with his family.", "cast": "Ryan Reynolds as Damian Hale/Mark Bitwell: Reynolds plays Mark Bitwell, the man who has decided to sell his body in order to cover his daughter's medical bills. Bitwell's body is overtaken by Hale's consciousness as a vessel to live through.\nNatalie Martinez as Madeline Bitwell: Wife of Mark Bitwell, Madeline is living life convinced her husband has died.\nMatthew Goode as Albright/Dr. Jensen: The creator of the \"shedding\" process, Dr. Jenson underwent the process in his assistant Albright's body. He is the mastermind of the process, but keeps the secret that instead of engineering human bodies in his laboratory, they pay people considerable amounts of money to donate their bodies as vessels.\nBen Kingsley as Damian Hale: A wealthy business man who has a terminal illness. He seeks the best care money can buy, a new body.\nDerek Luke as Anton: First introduced in the movie as Damian's new friend, it is later discovered that Anton works for Albright and was planted in Damian's new life.\nVictor Garber as Martin O'Neill, Damian's close friend\nJaynee-Lynne Kinchen as Anna Bitwell, Mark's and Madeline's daughter\nMelora Hardin as Judy O'Neill, Martin's wife\nMichelle Dockery as Claire Hale, Damian's estranged daughter\nSam Page as Carl\nBrendan McCarthy as Anton 2\nThomas Francis Murphy as Dr. Jensen\nSandra Ellis Lafferty as Phyllis Jensen\nEmily Tremaine as Mallory\nTeri Wyble as Andrea\nMariana Vicente as Leah\nDylan Lowe as Tony O'Neill"}