{"_movieID": "41154", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:56:43", "summary": "Men in Black 3 (alternatively Men in Black III, and stylized as MIB³) is a 2012 American science fiction action comedy film directed by Barry Sonnenfeld and starring Will Smith, Tommy Lee Jones and Josh Brolin. It is the third and final installment in the original Men in Black film trilogy which in turn is loosely based on the comic book series The Men in Black by Lowell Cunningham. It was released fifteen years after the original Men in Black (1997) and ten years after the first sequel, Men in Black II (2002). Sonnenfeld and Steven Spielberg returned as director and executive producer, respectively. In the film, Boris the Animal, an old enemy of Agent K, escapes from prison and travels back in time to kill the younger K in order to allow his species, a ruthless alien race known as Boglodites, to attack Earth. This forces Agent J to go back in time and team up with K's younger self to save his partner and the world.\nMen in Black 3 was released on May 25, 2012 by Columbia Pictures and grossed over $624 million worldwide, making it the 10th highest-grossing film of 2012. Unadjusted for inflation, it is the highest-grossing film in the series. The film also received generally positive reviews from critics, who praised it as an improvement over its predecessor. A spin-off film in the series, Men in Black: International, was released on June 14, 2019.", "plot": "In 2012, an alien criminal named Boris the Animal, a Boglodite, escapes from a maximum-security prison on the Moon and goes to Earth to take revenge on Agent K, who shot off his left arm and captured him in 1969. He confronts K, who is with his partner Agent J, and tells him he is \"already dead\". Back at MiB Headquarters, J peruses MiB's files and discovers K was responsible not only for capturing Boris, but for deploying the \"ArcNet\", a shield that prevented the Boglodites from conquering Earth, causing their extinction.\nUsing an illegal time-jump device, Boris travels back in time to kill the young Agent K. With history altered so that K is long-dead, only J's memory is somehow unaffected, and no one from the Agency understands his obsession with K until Agent O, the new Chief of MIB following Zed's death, deduces there has been a fracture in the space-time continuum. With K dead, the ArcNet was never deployed, and there is nothing to protect the present-day Earth from the Boglodite invasion, so J uses the same device to travel back in time to stop Boris and save K.\nOnce in 1969, J goes to Coney Island, knowing from the Agency's records that in 1969, Boris will commit a murder there. However, he ends up arrested by young K, who takes him to MiB Headquarters and prepares to neuralyze him, but decides at the last minute to investigate J's claims that he traveled from the future to protect him. K and J follow clues, leading them to a bowling alley, then to The Factory, where they come across an alien named Griffin, who is in possession of the ArcNet. Griffin, who can see all possible future timelines and outcomes, senses Boris is coming and flees, but tells J and K where to meet him so he can give them the ArcNet. There, Boris captures Griffin. J and K pursue and rescue Griffin, acquiring the ArcNet. Young Boris escapes and Old Boris arrives, and they team up.\nUpon learning that they must go to Cape Canaveral so they can attach the ArcNet to the Apollo 11 rocket to deploy it in space, J reveals that Boris will kill K, who initially takes the news badly. J, K, and Griffin fly there using jetpacks, but they are stopped by the military. Griffin shows a colonel the future, revealing to him the importance of their mission, and the officer assists them in reaching the launch site. As the agents climb the rocket's launch tower, they are attacked by both young and old Boris. Unable to stop old Boris, J uses his time-travel device to evade his attacks and knock him off one of the launch tower bridges. K shoots off young Boris's left arm, knocking him off of the tower while also restoring the timeline. K attaches the ArcNet to the rocket and it is deployed successfully when the rocket launches, with old Boris incinerated by the rocket exhaust. Young Boris attacks K on a beach, but the colonel saves K by sacrificing himself. Boris, knowing he is going to be arrested from his older self, taunts K, but this causes K to kill him, thus preventing the cycle from repeating. The colonel's young son arrives and when he inquires about his father, K neuralyzes him and tells him only that his father is a hero. Observing from afar, J realizes that the young boy is himself, the colonel was his father, K has been watching over him his whole life and that he was there when the timeline changed, thus explaining why he was the only one who remembered K in the alternate 2012.\nWith his mission complete, J returns to 2012, where he reconciles with K, who tells him that the Boglodites are now extinct. Griffin observes this, and says it is his new favorite moment in human history.", "cast": "Will Smith as Agent J\nTommy Lee Jones as Agent K\nJosh Brolin as Young Agent K\nJemaine Clement as Boris the Animal\nEmma Thompson as Agent O\nMichael Stuhlbarg as Griffin\nMike Colter as Colonel James Darrell Edwards Jr.\nMichael Chernus as Jeffrey Price\nAlice Eve as Young Agent O\nNicole Scherzinger as Lily\nDavid Rasche as Agent X\nKeone Young as Mr. Wu\nBill Hader as Agent W\nWill Arnett as Agent AA\nLanny Flaherty as Obadiah Price\nCayen Martin as Young Agent JJustin Bieber, Lady Gaga and Tim Burton make uncredited cameo appearances as aliens on the TV monitors. Rick Baker appears in a cameo as the Brain Alien. Will Arnett portrays the uncredited MIB Agent AA, J's partner in the altered timeline. Tony Shalhoub has an uncredited cameo as a 1960s Newsdealer, and Rip Torn cameos as a large-headed alien at Zed's funeral."}