{"_movieID": "286521", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:09:37", "summary": "5 Flights Up (released in the United Kingdom as Ruth & Alex) is a 2014 American comedy-drama film directed by Richard Loncraine, written by Charlie Peters, and starring Morgan Freeman and Diane Keaton. The film is based on the novel Heroic Measures by Jill Ciment. It was released on May 8, 2015 by Focus World.", "plot": "Alex and Ruth Carver, an older couple, want to move because living in a 5-story walk-up is too difficult without an elevator. Alex is a painter and uses one of the rooms as his studio. Ruth is a retired school teacher. They have lived there so many years that it and the neighborhood have become intertwined with their lives. Their niece Lilly is their broker and believes the apartment is worth up to $1M.\nThree other plot lines develop simultaneously with the sale of the apartment. One is the problem with the Carvers' old dog Dorothy who gets a ruptured disc and the issue of how much money to spend to help her. The second is an ongoing news story about a driver of a disabled tanker truck, a supposed terrorist, on the bridge near the Carvers' apartment. The third is the Carvers looking at new apartments.\nThe vet tells them that an operation costing $10,000 might fix Dorothy's ruptured disk. Alex is against it at first but later agrees with Ruth that they have to do whatever it takes to save Dorothy. After the operation, Dorothy is still unable to move her legs. Toward the end of the movie, while still under the care of the vet, Dorothy starts walking again.\nIn their search for a replacement apartment, Ruth finds one she really likes, and their offer is accepted. However, the sellers' agent wants a deposit check that evening or it will go back out to bid. When Alex, Ruth, and Lilly arrive at the apartment to write the deposit, the owners tell them it's not enough. Meanwhile, the news reports that the driver of the tanker has been apprehended. Alex is startled that the driver is \"just a kid\".\nAlex does not like the owners' attitude and refuses to write a deposit check. Alex and Ruth leave. As they are leaving, Lilly finds out that the Carvers are no longer interested in selling their apartment. She flips them off and walks away.\nThe film ends with Alex walking Dorothy up the stairs to their apartment in the winter. He sees a young couple moving into their building, similar to when he and Ruth first moved in 40 years ago.", "cast": "Morgan Freeman as Alex Carver\nKorey Jackson as young Alex\nDiane Keaton as Ruth Carver\nClaire van der Boom as young Ruth\nCarrie Preston as Miriam Carswell\nMiriam Shor as Cool lady\nCynthia Nixon as Lilly\nJames Claude Bristow as Larry\nJoanna P. Adler as Boy's mother\nAlysia Reiner as Blue Leggings\nJosh Pais as Jackson\nSterling Jerins as Zoe\nMaury Ginsberg as Dr. Kramer"}