{"_movieID": "291356", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:44:58", "summary": "In a Valley of Violence is a 2016 American western film written and directed by Ti West. Jason Blum serves as producer through his production company Blumhouse Productions. The film stars Ethan Hawke, Taissa Farmiga, James Ransone, Karen Gillan, and John Travolta. It had its world premiere at South by Southwest on March 12, 2016, and was released in a limited release and through video on demand on October 21, 2016 by Focus World.", "plot": "A drifter named Paul and his dog, Abbie, make their way towards Mexico through the desert of the Old West. They encounter a priest attempting to get to the nearby town of Denton. The priest holds Paul at gunpoint in order to steal his horse, but Paul has Abbie attack him; the drifter then takes the bullets out of the priest's revolver and his water canteen, then goes on his way. Paul enters Denton in order to get supplies and reduce their journey time.\nIn the local tavern, Paul meets Deputy Gilly Martin, who challenges the drifter to a fight when Paul ignores his attempt to start a conversation. In order to coax him out of the tavern, Gilly approaches Abbie, but Paul knocks him out. Gilly's fiancée Ellen rushes to his aid as Paul makes his way into the town's hotel. Ellen's younger sister Mary-Anne works at the hotel  and draws Paul and Abbie a bath to thank him for having stood up to Gilly.\nLater, Paul finds the Marshal, Gilly's father Clyde Martin, waiting for him in the inn's lobby. The Marshal identifies Paul as an ex-soldier, and requests he leave Denton and never return. Before Paul moves on, Mary-Anne gives him a picture to remember her by. That night, Paul and Abbie are found by Gilly and his henchmen Roy, Tubby and Harris. They label Paul an Army deserter and traitor, kill Abbie and push Paul off a cliff. An injured Paul awakens the next day, buries Abbie and swears revenge. On his way back to the town, Paul again encounters the priest and steals his mule and revolver.\nBack in Denton, Mary-Anne shelters Paul at her father's house and offers help. She begs Paul to take her away from the town once he gets revenge. He refuses, telling her that he abandoned his wife and daughter to enlist and never intends to return. At the hotel, Paul kills Roy in a bathroom. The Marshal is alerted to the situation and has the men prepare for a fight. He orders Gilly to stay behind to keep the women safe. Gilly accuses Mary-Anne of aiding Paul and while arguing Ellen reveals to Gilly that she is pregnant.\nOn the roof of the jailhouse, Paul shoots Harris when the latter at gunpoint refuses to shoot at Tubby and the Marshal. Inside the jailhouse, upset at the deaths of Roy and Harris, Tubby is unable to cope with the bloodshed and throws down his gun. Paul shoots Tubby in the back through a window. The Marshal agrees to leave his weapons inside so that they can talk. Gilly then comes out to end Paul, but the Marshal refuses to get out of the way. Gilly and Paul proceed to shoot at each other with the Marshal in the way, fatally shooting him in the process.\nPaul is wounded and hides in a barn. When Gilly enters, Paul slips a noose over his head and hangs him then proceeds to beat him then relents. As Gilly draws a knife, Mary-Anne appears and shoots him in the back. Mary-Anne and Paul make their way back to the inn, Ellen finds Gilly's body. The priest wanders back through Denton and Paul suggests that he should stay.", "cast": "Ethan Hawke as Paul\nTaissa Farmiga as Mary-Anne\nJames Ransone as Deputy Gilly Martin\nKaren Gillan as Ellen\nJohn Travolta as Marshal Clyde Martin\nBurn Gorman as Priest\nToby Huss as Harris\nLarry Fessenden as Roy\nK. Harrison Sweeney as William T. Baxter\nTommy Nohilly as Tubby\nJumpy as Abbie"}