{"_movieID": "43539", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:15:48", "summary": "The Next Three Days is a 2010 American thriller film  written and directed by Paul Haggis and starring Russell Crowe and Elizabeth Banks. It was released in the United States on November 19, 2010, and was filmed on location in Pittsburgh. It is a remake of the 2008 French film Pour elle (Anything for Her) by Fred Cavayé and Guillaume Lemans.", "plot": "Lara Brennan is wrongly convicted of murdering her boss and is sentenced to life in prison. Her young son Luke ceases to acknowledge her during prison visits. Following the failure of her appeal, her attorney balks at her acquittal. Lara attempts suicide and her husband John becomes obsessed with breaking her out of prison.\nJohn consults Damon Pennington, a former inmate who wrote a book on escaping prison. Following Damon's advice, John prepares to break his wife out. He studies escape routes, prison routines and buys a handgun. Struggling to obtain fake IDs, he loses much of his money. He sells his furniture and belongings. John is almost caught testing a bump key inside Lara's current jail.\nWhen John learns that Lara will be transferred in three days to a distant prison facility, he is forced to make an emergency plan. Unable to sell his house in time, he considers robbing a bank, but hesitates at the last minute. Desperate at his wife's failing mental health, John tails a local drug dealer to a drug house and robs it of cash.\nInvoking his plan, John plants falsified blood work indicating Lara is in a state of hyperkalemia and leaves Luke at a birthday party. Lara is transferred from jail to a nearby hospital.\nFollowing clues left behind at the drug house, police track down John's car, find his empty house and conclude that he is planning to break his wife out.\nLara's guards at the hospital are overtaken by John, and he convinces her to escape with him. John and Lara exit the hospital, narrowly evade police and leave the area. They discover Luke is at the zoo for the birthday party and drive there to retrieve him while police establish roadblocks around the city. John and Lara pass a roadblock by picking up an elderly couple for cover. They drop off the couple and drive to a Canadian airport. Police are misled by escape plan fragments John has purposely left behind and delay the wrong flight. John, Lara and Luke successfully board a plane to Venezuela.\nDetectives return to the crime scene where Lara's boss was killed. A flashback shows details of the murder and Lara's innocence. Remembering that Lara claimed to have lost a button at the time of the murder, a detective searches a nearby storm drain but just misses the button.\nJohn, Lara and Luke arrive at a hotel in Venezuela. As Lara lies down next to her son, Luke kisses his mother and they fall asleep together. As the film ends, John takes a picture of his sleeping wife and son.", "cast": "Russell Crowe as John Brennan\nElizabeth Banks as Lara Brennan\nBrian Dennehy as George Brennan\nLennie James as Lieutenant Nabulsi\nOlivia Wilde as Nicole\nTy Simpkins as Luke Brennan\nHelen Carey as Grace Brennan\nLiam Neeson as Damon Pennington\nDaniel Stern as Meyer Fisk\nKevin Corrigan as Alex Gaidar\nJason Beghe as Detective Quinnan\nAisha Hinds as Detective Collero\nTyrone Giordano as Mike\nJonathan Tucker as David\nAllan Steele as Sergeant Harris\nRZA as Mouss\nJames Ransone as Harv\nMoran Atias as Erit\nMichael Buie as Mick Brennan\nTrudie Styler as Dr. Byrdie Lifson\nTyler M Green and Toby J. Green as 3-year-old Luke\nKaitlyn Wylde as Julie"}