{"_movieID": "76757", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:55:05", "summary": "Jupiter Ascending is a 2015 space opera film written and directed by the Wachowskis. Starring Channing Tatum, Mila Kunis, Sean Bean, and Eddie Redmayne, the film is centered on Jupiter Jones (Kunis), an ordinary cleaning woman, and Caine Wise (Tatum), an interplanetary warrior who informs Jones that her destiny extends beyond Earth. Supporting cast member Douglas Booth has described the film's fictional universe as a cross between The Matrix and Star Wars, while Kunis identified indulgence and consumerism as its underlying themes.The film was produced by Grant Hill and the Wachowskis, making Jupiter Ascending Hill's seventh collaboration with the Wachowskis as producer or executive producer. Several more longstanding Wachowski collaborators since the creation of The Matrix films have contributed to the picture, including production designer Hugh Bateup, visual effects supervisor Dan Glass, visual effects designer John Gaeta, supervising sound editor Dane Davis and costume designer Kym Barrett. Other notable past collaborators include Speed Racer composer Michael Giacchino, Cloud Atlas director of photography John Toll along with its editor Alexander Berner and hair and make-up designer Jeremy Woodhead, who worked on both.\nThe film received generally negative reception upon release, with most criticism focused on incoherence in the screenplay, the characterization and an over-reliance on special effects. Some critics praised the visuals, originality, world-building and Giacchino's musical score. However, the film received positive response from a niche of female science fiction fans who appreciated the film's campiness and deviation from typical gender stereotypes in a genre that is traditionally male-centered.", "plot": "Earth and countless other planets were established by families of transhuman and alien royalty for the purpose of later \"harvesting\" the resulting organisms to produce a type of youth serum for the elites on other planets. After the death of the matriarch of the House of Abrasax, the most powerful of the alien dynasties, her children, Balem, Kalique, and Titus, quarrel over the inheritance, with Balem inheriting an enormous refinery on Jupiter and Titus spending his inheritance on a lavish spaceship.\nJupiter Jones narrates that her father, Maximilian Jones, met her mother, Aleksa, in Saint Petersburg, Russia. After Maximilian is killed in a robbery, Aleksa names their daughter Jupiter, after his favorite planet, and they move to Chicago to live with Aleksa's family.\nMany years later, Jupiter Jones cleans the homes of wealthy neighbors. To buy a telescope, Jupiter agrees to sell her egg cells with the help of her cousin Vladie, under the name of her friend Katharine Dunlevy. At Katharine's house, Jupiter and Katharine are attacked by extraterrestrial \"Keepers\"; and when Jupiter photographs these, they erase both of their memories of the incident. Jupiter stumbles upon the strange photograph on her phone while waiting at an egg donation clinic, but cannot recall anything about it. During the procedure, the doctors and nurses are revealed to be Keepers sent to kill her, and she is saved by Caine Wise, a former soldier sent by Titus to bring her to him.\nWhile Caine and Jupiter ascend to a ship, it is destroyed by a squad of Keepers who then attack them. Caine fends off the attack and manages to kill the Keepers and hijack one of their vehicles while protecting Jupiter. Afterwards, Caine realizes that Jupiter must be of great significance to both Titus and Balem, who are revealed to have sent the Keepers to Earth to capture her. He takes Jupiter to the hideout of Stinger Apini, another former soldier living in exile on Earth. As Jupiter discovers that she can control the bees in Stinger's residence, she is revealed to be galactic royalty. Stinger agrees to help Jupiter, but a group of hunters who initially were hired by Balem but bribed by Kalique capture her and take her to Kalique's palace on a distant planet, where Kalique explains that Jupiter is genetically identical to the dead matriarch, and therefore the Earth's rightful owner. Supported by Captain Diomika Tsing of the Aegis (an intergalactic police force), Caine retrieves her from Kalique, and takes her to the planet Ores (the intergalactic capital planet) to claim her inheritance.\nIn another attempt to lure Jupiter to him, Balem sends Greeghan to kidnap Jupiter's family. On the way back to Earth, Titus's henchmen capture Jupiter and detain Caine, as punishment for not bringing Jupiter to him as promised. Titus reveals to Caine his plan to marry and kill Jupiter and claim Earth. He then throws Caine into the void of space; he attempts to seduce Jupiter, declaring his intention to dismantle the youth serum trade, of which Earth is the next intended source. Caine survives being spaced and returns with Stinger to save Jupiter at the altar before she completes the marriage contract. Jupiter asks to return home, but learns that her family has been taken hostage by Balem. In his refinery in the Great Red Spot, Balem demands Earth in exchange for Jupiter's family. Realizing that Balem can \"harvest\" Earth only with her permission, Jupiter refuses. Caine infiltrates the refinery and damages its gravity hull, causing the refinery to begin collapsing. While the occupants evacuate the refinery, Tsing's ship moves in and rescues Jupiter's family.\nJupiter survives the collapsing structures, only to land at the feet of Balem who tries to kill her; but she fights him off, and is rescued by Caine while Balem falls to his death. As the refinery is in its final stages of collapse, Tsing opens a portal to Earth and prepares to evacuate, potentially leaving Caine and Jupiter behind. However, she is relieved to find that they have survived and crossed the portal along with Tsing's ship. Jupiter's family is returned home with no memory of their disappearance, while Jupiter secretly retains ownership of the Earth. Caine's rank in the Legion is restored, and he and Jupiter begin a relationship."}