{"_movieID": "59967", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:54:27", "summary": "Looper is a 2012 American science fiction action film written and directed by Rian Johnson, and produced by Ram Bergman and James D. Stern. It stars Bruce Willis, Joseph Gordon-Levitt, and Emily Blunt. It revolves around \"present-day\" contract killers called \"loopers\" hired by criminal syndicates from the future to terminate victims that they send back through time.\nLooper was selected as the opening film of the 2012 Toronto International Film Festival and was released in the United States on September 28, 2012. The film grossed $176 million on a $30 million budget, while receiving critical acclaim.\n\n", "plot": "In 2044, 25-year-old Joe works for a Kansas City crime syndicate as a \"looper\". Since future tracking systems have made it near-impossible to dispose of bodies, the syndicate uses time travel, invented thirty years later and instantly outlawed. Managed by a future man named Abe, loopers kill and dispose of face-concealed victims, and are paid with silver bars strapped to the target. To prevent connections to the syndicate, a looper's final victim will be their retired future self (identified by gold bars strapped to them instead of silver), ending the contract and \"closing the loop\".\nJoe's friend Seth, part of a minority that manifest low-level telekinesis (or TK), confides that his old self has escaped, after warning him of a person in the future called the Rainmaker who will overthrow the five major bosses and close all loops. Joe reluctantly hides Seth in his apartment's floor safe, but is taken to Abe by Kid Blue, one of Abe's elite \"Gat Men\". Joe reveals Seth's location instead of forfeiting half his silver and Abe's men cut an address into younger Seth's arm, then begin severing Young Seth's body parts. These effects appear on Old Seth, who goes to the address and is killed.\nWhen Joe's next target arrives, it is his older self with his face uncovered and hands unbound. Before Joe can kill him, Old Joe shields himself, knocks Young Joe unconscious and escapes. Returning to his apartment, Young Joe fights with Kid Blue, only to fall off a fire escape and black out.\nIn another timeline, Young Joe kills his older self as he arrives. He moves to Shanghai, where his drug addiction and partying persist, becoming a hitman to finance himself. Years later, he meets a woman during a bar fight and they marry. Seven years after, Joe is taken to close the loop and his wife is killed in the process. Overpowering his captors, Joe sends himself back to 2044, thereby altering history. When Old Joe arrives, he evades and incapacitates Young Joe before escaping.\nOld Joe begins to manifest vague memories of Young Joe's actions in the present, and meets his younger self at a diner. He explains that he intends to save his wife by killing the Rainmaker as a child. Kid Blue and several other Gat Men arrive at the diner and a gunfight ensues. Young Joe collects a corner of Old Joe's map as both escape.\nYoung Joe follows the map to a farm where a woman called Sara and her son Cid live. Sara recognizes a number on the map as Cid's birthday and hospital code. Young Joe guesses that Old Joe is going to kill all three children born on the same day, not knowing which one will become the Rainmaker, so he stays at the farm to wait for Old Joe.\nJesse, another Gat Man, comes looking for both Joes at the farm, but Cid and Young Joe hide. Later that night, Sara and Young Joe have sex and Sara reveals that she has above-average TK powers. Cid's powers are revealed to be even stronger, with Sara hiding in a safe when he has a tantrum. In the morning, Young Joe wakes to find Jesse holding Sara at gunpoint in the living room. Frightened, Cid falls down the stairs and kills Jesse using telekinesis. Young Joe realizes that Cid will become the Rainmaker and that Old Joe will now know this from his memories.\nKid Blue captures Old Joe and takes him to Abe. Old Joe breaks free and kills Abe and his henchmen, before travelling to Sara's farm. While Young Joe kills Kid Blue, Old Joe pursues Sara and Cid. Cid's face is grazed by a bullet and he creates a telekinetic blast, but is calmed by Sara before he can kill them. Telling Cid to run into the cane field, Sara stands between Old Joe and her son. Realizing that Sara's death will turn Cid into the Rainmaker, Young Joe commits suicide, erasing Old Joe's existence, saving Sara and preventing Cid from becoming the Rainmaker."}