{"_movieID": "328111", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:37:35", "summary": "The Secret Life of Pets is a 2016 3D American computer-animated comedy film produced by Illumination Entertainment. It is directed by Chris Renaud, co-directed by Yarrow Cheney, written by Brian Lynch, Cinco Paul and Ken Daurio and is the first film of the franchise of the same name. The film stars Louis C.K., Eric Stonestreet, Kevin Hart, Steve Coogan, Ellie Kemper, Bobby Moynihan, Lake Bell, Dana Carvey, Hannibal Buress, Jenny Slate, and Albert Brooks.\nThe Secret Life of Pets premiered at the Annecy International Animated Film Festival on June 16, 2016, and was released in theaters in the United States on July 8, 2016, by Universal Pictures. The film received generally positive reviews and grossed $875 million worldwide, becoming the sixth-highest-grossing film of 2016, and was the year's most profitable release.\nA sequel, The Secret Life of Pets 2, was released on June 7, 2019 with Patton Oswalt taking over Max's role from C.K.", "plot": "A spoiled Jack Russell Terrier named Max lives with his owner Katie in a Manhattan apartment. While she is at work during the day, he hangs out with other pets in the building: tabby cat Chloe, pug Mel, dachshund Buddy, and budgerigar Sweet Pea. One day, Katie adopts Duke, a large Newfoundland mix from the pound, leaving Max jealous because of her divided focus on Duke. Enraged by Max's attitude towards him, Duke tries to abandon Max in an alley, but they are both attacked by cats led by Sphynx cat Ozone who removes both dogs' collars and leaves them to be caught by Animal Control. Duke fears that he will be killed if he goes back to the pound. When Gidget, a white Pomeranian who is not so secretly in love with Max, discovers that he is missing, she decides to find him.\nMax and Duke are rescued by a white rabbit named Snowball, the leader of \"The Flushed Pets\"—a cult of feral sewer-dwelling animals who hate humans because their owners mistreated and abandoned them. After Max and Duke pretend to despise humans as much as they do by saying they killed their owners, the Flushed Pets invite them to join. Before they can prove their loyalty by allowing a one-fanged viper to bite them, Snowball learns from the cats that Max and Duke are tamed. The two dogs escape the sewers and board a ferry to Brooklyn, inadvertently killing the viper in the process. Snowball vows to kill them and leads the Flushed Pets after them.\nMeanwhile, Gidget recruits a red-tailed hawk named Tiberius to find Max, but he mistakenly locates Ozone, whom Gidget coerces into telling what he knows about the dogs. They then enlist Mel, Buddy, Chloe, guinea pig Norman and Sweet Pea. On the way, they meet Pops, an old Basset Hound who helps Gidget and the pets find Max. Gidget and her team encounter Snowball, who vows to kill them as well, and Norman is captured as the rest of Gidget's team flees.\nIn the meantime, Max and Duke raid a sausage factory for food. While there, Duke tells Max about his previous owner, Fred, an elderly man who adopted him as a puppy and loved spending time with him. One day, Duke got lost while chasing a butterfly and was caught by Animal Control, but Fred never came to claim him. Max convinces him to visit Fred's house in a nearby neighborhood, confident Fred will still love him and take him back. When they arrive at Fred's house, they learn from the resident cat Reginald that Fred has died. Heartbroken, Duke accuses Max of attempting to get rid of him and barks at the new homeowners who have just returned to the house and called Animal Control. The handlers catch Max, but Duke interferes long enough for Max to escape and ends up being captured instead.\nWhile trying to rescue Duke as he follows the Animal Control van, Max is attacked by Snowball who tries to kill him. However, when his gang is captured, Snowball realizes that he and Max must work together to rescue them. They drive a city bus into the van on the Brooklyn Bridge, stopping traffic. The Flushed Pets encircle Max, unaware of his partnership with Snowball, but Gidget and her team save him. Upon seeing Gidget using her kung-fu fighting skills, Max starts to fall in love with her. The van gets stuck in scaffolding and the Flushed Pets escape. As soon as Max gets the keys to Duke's cage, the van plummets into the East River with him inside. Max is unable to free Duke, so Snowball jumps into the river to retrieve the keys, allowing them to escape the sinking van.\nThe entire group returns to the apartment block by pig-driven taxi. Max expresses his love for Gidget, who returns his affection. Snowball and the Flushed Pets then come up with a new plan to annihilate all humans, but a woman and her daughter named Molly arrives and adopts Snowball and the remaining Flushed Pets return to the sewers. At first, Snowball resists, but gives in and lets himself become a domesticated pet. Snowball soon goes home with Molly and her mother while the other pets return to their homes and embrace their owners, and Max and Duke finally reunite with Katie, sparking a true friendship as brothers. In a post-credits scene, Buddy and Mel show up in costume at a party in poodle Leonard's apartment, hosted by a now-friendlier Snowball.", "cast": "Louis C.K. as Max, a Jack Russell Terrier.\nEric Stonestreet as Duke, a large, brown, shaggy Newfoundland mix.\nJenny Slate as Gidget, a white Pomeranian.\nKevin Hart as Snowball, a white rabbit.\nEllie Kemper as Katie, Max and Duke's owner.\nLake Bell as Chloe, a morbidly obese and apathetic grey tabby cat.\nDana Carvey as Pops, an elderly Basset Hound who is paralyzed in his back legs.\nHannibal Buress as Buddy, a laid-back dachshund.\nBobby Moynihan as Mel, a hyperactive pug.\nTara Strong as Sweetpea, a green and yellow budgie parakeet.\nSteve Coogan as Ozone, a Cockney-accented Sphynx cat.\nCoogan also voices Reginald, a Himalayan cat residing in Brooklyn.\nAlbert Brooks as Tiberius, a curmudgeonly red-tailed hawk.\nChris Renaud as Norman, a guinea pig who keeps getting lost trying to find his apartment.\nMichael Beattie as Tattoo, a slow-witted tattooed pig who is one of the Flushed Pets.\nSandra Echeverría as Maria, a character from the La Pasión de la Pasión telenovela that Gidget watches.\nJaime Camil as Fernando, a character from the La Pasión de la Pasión telenovela that Gidget watches.\nKiely Renaud as Molly, a little girl who adopts Snowball."}