{"_movieID": "9906", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:31:09", "summary": "The Ant Bully is a 2006 American computer-animated adventure fantasy comedy film written and directed by John A. Davis and based on the 1999 children's book of the same name by John Nickle. Starring the voices of Zach Tyler Eisen, Julia Roberts, Nicolas Cage, Meryl Streep and Paul Giamatti, the film was produced by Tom Hanks and Gary Goetzman's Playtone, Davis and Keith Alcorn's DNA Productions and Legendary Pictures as its first (and so far, only) animated film, and distributed by Warner Bros. Pictures.\nJust before its release, most of the DNA employees were laid off and the studio was closed. It was the last film role by Ricardo Montalbán, before his death on January 14, 2009. The film received mixed reviews from critics and was a box office disappointment, grossing only $55.2 million against its $50 million budget.\n\n", "plot": "In Las Vegas, lonely 10-year-old Lucas Nickle (Zach Tyler Eisen) is left with his older sister, Tiffany (Allison Mack) and his grandmother (Lily Tomlin) when his parents go to Puerto Vallarta. Neglected by his family and tormented by a local bully named Steve (Myles Jeffrey) and his friends, Lucas takes out his frustration on an anthill and attacks it with a squirt gun, terrifying the colony. One ant, an eccentric wizard named Zoc (Nicolas Cage), tries to fight back. His girlfriend, a nurse ant named Hova (Julia Roberts) who is fascinated by humans, attempts to communicate with Lucas. He drops his gun on the grass, and kicks the anthill with one of his sneakers, sending the colony flying into the grass. Hova tries to communicate to him, but she is almost crushed before being rescued by Zoc. The leaders of the colony decide to use a potion Zoc has recently created to shrink Lucas down to ant size.\nThe local exterminator, Stan Beals (Paul Giamatti), convinces Lucas to sign a contract to kill vermin. Later, Zoc and a small troop of ants pour the potion into his ear. He wakes up and discovers that he is now tiny, when he lands on a potato chip. He is carried to the anthill into a world of giant caves, caterpillars, and ants. Zoc insists that he should be studied then eaten, but he is overruled by the Queen (Meryl Streep). She sentences him to hard labor.\nHova volunteers to train Lucas, much to Zoc's mortification. They both learn about the differences between ants and humans. However, when she forces him to forage for jelly beans with Kreela (Regina King) and Fugax (Bruce Campbell), he is unsuccessful. The ants are attacked by tarantula hawk wasps. Lucas finds a firecracker discarded by Steve and uses it to scare away the wasps. This earns him the admiration of all the ants except Zoc.\nLucas is introduced to honeydew, the feces of caterpillars, and he gets sick when he learns where they come from. He is shown a painting which depicts the Great Ant Mother and the evil \"Cloud-Breather\", an exterminator. Lucas is told that the Great Ant Mother will return and shower the ants with honeydew, while the Cloud-Breather will spell destruction for all of them. He and his friends return to his house, where he tries to cancel Stan's contract but calls a pizza restaurant instead. To make matters worse, Tiffany comes in as a giantess, and tries to crush the ants with the phone as they are forced into hiding until dark.\nWhen Zoc finds out that Lucas put Hova in possible danger, he accuses him of further treachery and tells him that he should find another wizard because there is no way that he will give him the antidote, causing him to run away in fright. Upon hearing what happened, Hova becomes angry with Zoc and goes out to look for Lucas. Once she finds him, he is swallowed by a frog. Zoc witnesses the event and realizes how much Hova cares about Lucas and frees him to make up for his selfishness. Afterward they discuss their differences. Zoc explains that ants work for the benefit of the colony. Lucas states that most humans work for personal gain. Zoc is unsure as to how anything gets accomplished in Lucas' world but then sympathizes with him when they both admit that they both used to act without thinking.\nNext day, when Stan arrives to exterminate the colony, Lucas and Zoc enlist the aid of the wasps; at first, the wasps want to eat them, but hearing that their nest is being destroyed by Stan, they agree to help. During the battle with Stan, Lucas saves the lives of Hova and an injured wasp. Both the ants and wasps are no match against pesticide, but as Stan is about to exterminate the anthill, a beetle and glowworm bite him in the groin. As he doubles up in pain, Lucas injects him with the shrinking potion, severely disfiguring him, and he retreats on a tricycle.\nThe Queen pronounces Lucas an ant in honor of his heroic actions, and Zoc gives him the antidote. He returns back to normal size and finally stands up to Steve who runs away from him (and Steve's friends whose abusing by him give them orders, which Lucas says that together, they are taller than him). He then showers the colony with jelly beans as a farewell gift.", "cast": "Zach Tyler Eisen as Lucas Nickle.\nJulia Roberts as Hova, a nurse ant.\nNicolas Cage as Zoc, a wizard ant.\nMeryl Streep as The Queen Ant.\nPaul Giamatti as Stan Beals, a local exterminator.\nRegina King as Kreela, a forager ant.\nBruce Campbell as Fugax, a scout ant.\nLily Tomlin as Grandma (known as Mommo).\nCheri Oteri as Doreen Nickle, Lucas's mother.\nMyles Jeffrey as Steve, the local neighborhood bully.\nLarry Miller as Fred Nickle, Lucas' father.\nRichard Green as Wasp Leader.\nJake T. Austin as Nicky, a neighborhood boy who originally acts under Steve's lead.\nDon Frye as Soldier Ant\nRicardo Montalbán as The Head of Council\nAllison Mack as Tiffany Nickle, Lucas's older sister.\nRob Paulsen as Beetle.\nS. Scott Bullock as Glowworm.\nMark DeCarlo as Fly.Additional voices were provided by Tyler James Williams, Jaishon Fisher, Frank Welker, Tom Kenny, Neil Ross, Bob Joles, Wally Wingert, Leon Morenzie, Johnathan Cook, Clive Robertson, S. Scott Bullock, Susan Silo, Zack Shada (uncredited), Benjamin Bryan (uncredited), and Jordan Orr (uncredited)."}