{"_movieID": "109418", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:36:58", "summary": "Grown Ups 2 is a 2013 American comedy film directed by Dennis Dugan and co-produced by Adam Sandler, who also starred in the film. It is the sequel to the 2010 film Grown Ups. The film co-stars Kevin James, Chris Rock, David Spade, Nick Swardson, and Salma Hayek. The film is produced by Adam Sandler's production company Happy Madison Productions and distributed by Sony Pictures Releasing (Columbia Pictures). The film was released on July 12, 2013. The film grossed roughly $247 million on an $80 million budget. It was nominated for nine Razzies at the 2014 Golden Raspberry Awards.", "plot": "Three years after the events of the first film, Lenny Feder has relocated his family back to his Connecticut hometown of Stanton where he and his friends grew up.\nIn the film's opening in the Feder household, Lenny wakes up to find a wild deer standing next to his bed. Lenny quietly tries to get his wife Roxanne to open the window. She wakes up abruptly and startles the deer, causing it to urinate all over the bed and on Lenny. The deer runs down the hall and crashes into the bathroom where it runs into Lenny's elder son Greg showering, scaring him and making the deer urinate on him. It turns out that Lenny's daughter, Becky, left the door open overnight for any animals that wanted to come in. Lenny is able to get the deer out of the house by using Becky's monkey doll, which rips it apart, devastating her. Greg, Keith, and Becky then go to their last day of school. Roxanne brings up the idea of their family having another baby, but Lenny says their family is perfect as it is, angering Roxanne.\nAt the Lamonsoff household, Eric Lamonsoff and his wife Sally are at loggerheads with each other over how to raise their children. Sally believes in unwavering support while Eric prefers to be more practical with them, as proven for their son's bad math skills and daughter's eccentric sense in fashion. At the McKenzie household, Kurt surprises his wife Deanne with a thoughtful anniversary present, only to find that she has completely forgotten. Meanwhile, Marcus Higgins is waiting at a train station after receiving a letter from an old girlfriend, who tells him that he has a seventeen-year-old son Braden. Marcus is shocked to see a tattooed, six-foot-tall boy, who turns out to be Braden. Marcus tries to be nice and takes him to school, but Braden displays immediate hatred toward him, believing that he abandoned him and his mother.\nAfter dropping off their kids, Lenny, Eric, Kurt, and Marcus form as a group and spend the day roaming around town, reminiscing about the amazing summers they used to have when they were little, and about Lenny's bully, Tommy Cavanaugh. Lenny argues that he could take Tommy as a little boy and he can still take him. Eventually, the friends go to see Becky's ballet recital, where Lenny runs into Tommy, by whom Lenny is visibly intimidated. Tommy threatens that if Lenny ever lies again about being able to beat him up, he will publicly attack Lenny.\nOnce the kids are out of school, Lenny, Eric, Kurt, and Marcus decide to visit the old quarry, where they used to swim as little boys. However, they encounter Andy and his gang of college frat men, who force them to jump naked into the quarry lake and they all land in very painful positions. Braden, who was partying with the frat men, witnesses this and goes off to vandalize their frat house in retaliation. When the frat men return, they think that Lenny and friends did it and swear to take revenge.\nLenny arrives home to help Roxanne set up for a 1980s-themed party for their friends. Meanwhile, Marcus begins to bond with Braden. As all of their friends begin to arrive, Roxanne urges Lenny to consider having another baby. Lenny continues to protest the idea and is left speechless when Roxanne reveals that she is pregnant as a result of them having had sex in a Motel 6 hot tub. Lenny, feeling overwhelmed by this discovery, goes off to drink with his friends. The Feder's party goes well most of the night until Tommy Cavanaugh shows up and disrespects Lenny in front of everyone, so Lenny challenges Tommy to a fight. In a surprising turn, Tommy decides to take a dive so that Lenny can look tough for his own bullied son, and the two develop a mutual respect. Soon after, Andy, along with his friends and their entire fraternity gatecrash the party, looking for retribution for the damage to their frat house. When they go on to insult the local town residents, Dickie Bailey, Lenny's old nemesis, points out that Lenny accomplished more in his life than the entire frat put together, inciting a fight. The locals hold their own against the frat men and eventually send them fleeing the scene.\nAfter the battle is over, the four friends, plus Bailey, have pancakes at Eric's mom's house. After sharing an embarrassing photo of him and Bailey in kindergarten, Mrs. Lamonsoff reassures Lenny that a new baby is a wonderful thing and eventually he will never be able to remember life with just three kids. She then tells everyone how Eric had been accidentally conceived when she and his father were having sex in the men's room at a New England Patriots game. Lenny has a change of heart and returns home, telling Roxanne he is sorry and excited about the new baby, and they reconcile."}