{"_movieID": "87825", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:17:32", "summary": "Trouble with the Curve is a 2012 American sports drama film directed by Robert Lorenz and starring Clint Eastwood, Amy Adams, Justin Timberlake, Matthew Lillard, and John Goodman. The film revolves around an aging baseball scout whose daughter joins him on a scouting trip. Filming began in March 2012, and the film was released on September 21, 2012.\nThis was Eastwood's first acting project since 2008's Gran Torino and his first acting role in a film he did not direct since his cameo in 1995's Casper. A year after its release the film became the subject of a plagiarism lawsuit by a producer alleging that his former partner had taken an unfinished script after a dispute and conspired with his agent and Warner Brothers to present it as the work of a relative unknown.", "plot": "An aging Atlanta Braves baseball scout, Gus Lobel (Eastwood), is given one last assignment to prove his value to the organization, who views him as unable to adapt to changes within the game. His boss and friend Pete (Goodman) does not want to see him let go, but he must contend with an ambitious junior executive, Philip (Lillard), who is trying to get a promotion to the team's general manager post and wants Gus fired as an obstacle to his own baseball philosophy and methods.\nPete suspects Gus is hiding problems with his health, so against Gus's wishes, Pete contacts Gus's daughter Mickey (Adams), a workaholic lawyer pursuing a partnership at her firm, to join her father on a scouting trip to North Carolina. Gus is to review a top prospect named Bo Gentry, a brash amateur whose statistics make him a likely top draft pick.\nMickey realizes that Gus's vision is failing and starts to take an active role in his work to make up for his shortcoming. Along the way, Gus reconnects with a former player he once scouted,  Johnny \"The Flame\" Flanagan (Timberlake), who is now a scout for the Boston Red Sox, and who takes an interest in Mickey. When Mickey questions Gus about his leaving her with an uncle she barely knew as a child, after her mother's passing, the conversation takes a sour turn, and Mickey storms off, leaving Gus frustrated.\nAs Gus, Mickey and a group of other scouts watch Bo play, Gus and Mickey realize he can't hit a curveball. Gus advises Johnny to pass on Bo in the draft, and Johnny takes his advice. However, when Gus calls Pete and the Braves' management with the same advice, Philip disagrees based on statistical analysis and stakes his career on his opinion, leading Braves general manager Vince (Patrick) to draft Bo against Gus's advice. When Johnny learns of the move, he believes that Gus and Mickey double-crossed him to allow the Braves to draft Bo instead and angrily leaves.\nGus abandons Mickey at the hotel. She hears a pitcher throwing outside her room, and realizes he is talented just from the sound. She approaches the young man, Rigoberto, and volunteers to catch for him. After seeing him throw a few curveballs, she calls Pete, who reluctantly agrees to have him tryout in Atlanta.\nGus returns to the Braves' office where Vince and Philip criticize him for his evaluation of Bo. Pete interrupts to let them know that Mickey has brought Rigo to the field. As Bo practices batting, Philip mocks Gus and Mickey for bringing in Rigo, an unknown. Mickey insists, however, and Pete allows Rigo to pitch. Rigo throws several fastballs, which Bo repeatedly misses. Mickey calls for Rigo to throw a curve and again Bo cannot connect with the ball, and the staff realize they were wrong about both Bo and Gus.\nThe management resume their meeting, intent on signing Rigo. Gus suggests Mickey could be Rigo's sports agent, due to her legal background and knowledge of the game. When Philip makes another snide remark towards Gus, Vince fires him and offers Gus a contract extension. Mickey then gets a partnership offer from her firm. Outside the stadium, Mickey and Gus find Johnny waiting. Mickey approaches him and they kiss while Gus lights a cigar and walks away.", "cast": "Clint Eastwood as Gus Lobel\nAmy Adams as Mickey Lobel\nJustin Timberlake as Johnny Flanagan\nMatthew Lillard as Phillip Sanderson\nJack Gilpin as Schwartz\nJohn Goodman as Pete Klein\nRobert Patrick as Vince\nScott Eastwood as Billy Clark\nEd Lauter as Max\nChelcie Ross as Smitty\nRaymond Anthony Thomas as Lucious\nMatt Bush as Danny\nGeorge Wyner as Rosenbloom\nBob Gunton as Watson\nTom Dreesen as Rock\nJames Patrick Freetly as Todd\nJoe Massingill as Bo Gentry\nJay Galloway as Rigoberto (Rigo) Sanchez\nSammy Blue as the blues guitar musician"}