{"_movieID": "258489", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:29:00", "summary": "The Legend of Tarzan is a 2016 adventure film based on the fictional character created by Edgar Rice Burroughs. Directed by David Yates, with a screenplay by Adam Cozad and Craig Brewer, the film stars Alexander Skarsgård as the title character, with Samuel L. Jackson, Margot Robbie, Djimon Hounsou, Jim Broadbent, and Christoph Waltz in supporting roles. Principal photography began on June 21, 2014, at Warner Bros. Leavesden Studios in the United Kingdom and wrapped four months later on October 3.\nThe film premiered at the Dolby Theatre in Los Angeles on June 29, 2016, and was theatrically released in the United States on July 1, 2016, in 2D, 3D, IMAX and IMAX 3D. The film grossed over $356 million against a budget of $180 million and received mixed reviews from critics.", "plot": "As a result of the Berlin Conference of 1884-1885, the Congo Basin is claimed by King Leopold II of the Belgians, who rules the Congo Free State in personal union with the Kingdom of Belgium. The country is on the verge of bankruptcy, Leopold having borrowed huge sums of money to finance the construction of railways and other infrastructure projects. He sends his envoy Léon Rom (Christoph Waltz) to secure the fabled diamonds of Opar. Rom's expedition is ambushed and massacred. A tribal leader, Chief Mbonga (Djimon Hounsou), offers Rom the diamonds in exchange for an old enemy: Tarzan.\nThe man once called \"Tarzan\", John Clayton III (Alexander Skarsgård), has left Africa behind and settled down in London with his American-born wife, Jane Porter (Margot Robbie). He took up his birth name and ancestral family residence as Lord Greystoke. In the eight years since returning from Africa, John's story as Tarzan has become legendary among the Victorian public, although John wants to leave that past behind. Through the British Prime Minister (Jim Broadbent), John is invited by King Leopold to visit Boma and report on the development of the Congo by Belgium; he declines to participate in the perceived publicity stunt. \nAn American envoy, George Washington Williams (Samuel L. Jackson), privately reveals his suspicions that Leopold is enslaving the Congolese population to increase rubber production to recoup his debts. Williams persuades Greystoke to go to the Congo in order to prove his suspicions. Jane is thrilled to \"go home\" to Africa and see the friends and family she grew up with in the tribal village where her father taught. Greystoke says that she should not come, as he thinks the trip would be too dangerous. Jane recently had a miscarriage and he remembers the harshness of the jungle. Jane reminds him that she grew up in Africa as well, and misses her home and friends there. John relents, and allows Jane to accompany him after she promises to stay with the tribe while John and Williams investigate.\nJohn, Jane, and Williams take the trip to the Congo. There, the trio circumvent the diplomatic envoy and travel solo to the tribal village of their youth. The village celebrates reuniting with their friends. Jane explains to Williams that her husband was once considered an evil spirit by the African tribes. Jane was an object of curiosity to the young Tarzan, and Tarzan revealed himself to Jane during a childhood game of hide and seek. \nFrustrated by John's deviation from the travel plan, Rom and his mercenaries raid the sleeping village after the celebration. They kill the tribe's leader, capture John and Jane, and kidnap several villagers for use as slaves. John is rescued by Williams, but Rom's crew takes the remaining captives, including Jane, on board their steamship traveling on the nearby river. Rom intends to use Jane as bait to lure John, and is surprised and admiring of Jane's vibrant tenacity and ferociousness. Rom also reveals that John's state invitation from King Leopold was engineered by Rom, and Rom intends to deliver Tarzan to Chief Mbonga.\nJohn and Williams, with the aid of the tribe's remaining warriors, travel through the jungle, hoping to use the new Belgian railway to intercept the steamship and rescue their loved ones. After a struggle to overtake a Belgian military train, the group discovers the train is carrying captured slaves and find a ledger detailing the Rom's government-sanctioned plan to take over the Congo using slaves, the railways, and a massive mercenary army. The only thing needed are the Opar diamonds; King Leopold has nearly bankrupted his country paying for the initial stages of the plan, and requires the diamonds to pay for the army of mercenaries needed to complete his hostile takeover and see a return on his investment. With the ledger, William now has the evidence he needs to expose King Leopold. \nJohn and Williams task the warriors with returning the released slaves to their homes and then delivering the ledger to the port city of Boma via the railway as John and Williams continue on through the jungle to catch the steamship. As John and Williams continue, John encounters the adult Akut, who was raised as his ape brother and now is leader of the apes. Aware that Akut considers him a deserter, John must fight Akut for permission to travel through their territory. John soon loses, but the pair are permitted to travel on. John remembers saving a young Jane's life by shielding her from Kerchak's attack when they were teens, suffering severe injuries. Jane took the injured Tarzan home, starting their relationship. As John recovers from his recent fight, Williams recalls the massacres of Native Americans during the Indian Wars, comparing them to the abuses of Rom and Leopold.\nJane escapes Rom's clutches on the steamship, jumping from the boat and swimming to the shore as the remaining captured villagers escape to rally extra forces. Her flight through the jungle is halted when she stumbles into a group of mangani apes, and must make a show of deference to avoid them attacking. Rom approaches the apes, making the gesture of deference as Jane promises to return with Rom in exchange for the apes being unharmed, but Rom's nervous men shoot, leading to slaughter. John saves the remaining apes, reconciling with Akut, before pursuing Rom, who is now fleeing in the direction of Mbonga's tribe with Jane in tow in the hopes of delivering Tarzan to them and receiving his payment of diamonds. \nJohn is cornered by Mbonga and his tribe. It is revealed that John had earlier killed Mbonga's only son, who had killed Kala, John’s adoptive ape mother. A defeated Mbonga accuses John of lacking honor, as his son was just a young boy when John killed him. John spares Mbonga, just as Akut and the manganis arrive to subdue the tribe. \nRom takes Jane and the diamonds to Boma, where he plans to take control of the mercenary army waiting offshore. John triggers a massive stampede of wildebeest through Boma, destroying the town and soldiers. John rescues Jane. As Rom attempts to escape by boat, Williams sinks it with a machine gun as John swims aboard. Rom incapacitates John by strangling him and then tying him by the neck to the ship's railing, before trying to escape again. John overpowers Rom and leaves him to be devoured by crocodiles before escaping the destroyed vessel.\nWilliams returns to England and presents the Prime Minister with evidence exposing the slave trade and abuses of the Congolese in the Belgian-held lands. One year later, John and Jane have settled in Africa, in the old house of Jane's father. John returns to his place among the great apes as Tarzan and celebrates Jane having their child.", "cast": "Alexander Skarsgård as John Clayton III / Tarzan, 5th Baron Greystoke. On his character Tarzan, Skarsgård said, \"This is about a man who’s holding back; and slowly, as you peel off the layers, he reverts back to a more animalistic state and lets that side of his personality out.\" To get in Tarzan shape, Skarsgård spent four months in a training regimen before principal photography started and gained 24 pounds. Part of his training was for movement work with choreographer Wayne McGregor.Rory J. Saper as 18 year old Tarzan\nChristian Stevens as 5 year old Tarzan\nChristoph Waltz as Captain Léon Rom, a corrupt merciless Belgian captain sent by King Leopold of Belgium to find diamonds and control the region.\nSamuel L. Jackson as George Washington Williams, an American entrepreneur and veteran of the American Civil War\nMargot Robbie as Jane Clayton, Baroness Greystoke, née Porter (Tarzan's wife)\nDjimon Hounsou as Chief Mbonga, the leader of the leopard men of Opar (an African tribe that controls the diamond region), who wants revenge against Tarzan for the death of his son.\nJim Broadbent as Robert Gascoyne-Cecil, 3rd Marquess of Salisbury, the British Prime Minister\nCasper Crump as Major Kerckhover, Rom's violent first lieutenant\nBen Chaplin as Captain Moulle\nHadley Fraser as John Clayton II, 4th Baron Greystoke (Tarzan's father)\nGenevieve O'Reilly as Alice Clayton, Baroness Greystoke (Tarzan's mother)\nYule Masiteng as Muviro, the tribal leader of the Kuba people\nMimi Ndiweni as Eshe\nSimon Russell Beale as Mr. Frum\nMatt Cross as Akut, Tarzan's adoptive ape brother, Kala's biological son, and the current leader of the Mangani.\nMadeleine Worrall as Kala, Tarzan's adoptive ape mother and the biological mother of Akut\nWilliam Wollen as Kerchak, the former leader of the Mangani who killed Tarzan's father and hates Tarzan\nCédric Weber as The French Engineer\nRichard James-Neale as The Jug-Eared Solidier, a defiant Belgian conscript"}