{"_movieID": "50393", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:51:15", "summary": "Kung Fu Panda Holiday is a 2010 American computer-animated television special produced by DreamWorks Animation and directed by Tim Johnson. A spinoff of the Kung Fu Panda franchise, the special stars the voices of Jack Black, Angelina Jolie, Dustin Hoffman, Jackie Chan, Seth Rogen, David Cross, Lucy Liu, James Hong, and Jack McBrayer. The special premiered on NBC on November 24, 2010, and its premiere broadcast drew 5.9 million viewers.", "plot": "Master Shifu (Dustin Hoffman) assigns Po (Jack Black) to host the annual Winter Feast at the Jade Palace, a highly ritualized formal occasion where all the Kung Fu masters of China attend, insisting on the perfection of the event. Although excited, Po also wishes to spend the holiday with his father Mr. Ping (James Hong), and rejects the finest chefs in China in an attempt to have him cater the event. However, Mr. Ping believes Po is more concerned with his duties as the Dragon Warrior, and adamantly remains at his restaurant to feed the townsfolk who have nowhere else to eat for the holiday.\nGuilt-ridden, Po tries to cook the banquet by himself, but is quickly overwhelmed by the myriad  responsibilities that come with it, further complicated by the interference of Wo Hop (Jack McBrayer), a rabbit chef he had accidentally disgraced earlier and is desperate to die at the hands of the Dragon Warrior to redeem his honor. A comment from Wo Hop that \"kung fu can't solve everything\" inspires Po to enlist the Furious Five to complete the preparations for the feast while he has the still-suicidal Wo Hop help him in the kitchen.\nOn the night of the Winter Feast, Po comes to realize that he should be with his father for the holiday and excuses himself before the masters to help Mr. Ping prepare food for the townsfolk. For his part, Mr. Ping, who had been struggling with the business alone, realizes that he was being unfair to his son for attending to his larger responsibilities and apologizes to him. With this reconciliation, father and son prepare their feast with polished skill.\nMoved by Po's loyalty to his family, the Furious Five and the other masters participate in the festivities with the townsfolk. Po is additionally able to restore Wo Hop's honor by presenting him with the Golden Ladle originally intended for the chef selected to cook for the masters' banquet. Shifu is initially mortified that everyone abandoned the feast, but upon seeing the merry time everyone is having at the noodle shop, he realizes Po did the right thing, creating a truly perfect event with his father. Although Shifu turns to leave, Po persuades him to join them, firmly asserting Shifu's place with his family."}