{"_movieID": "445629", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:27:33", "summary": "Fighting with My Family is a 2019 biographical sports comedy-drama film written and directed by Stephen Merchant. Based on the documentary by Max Fisher, it depicts the WWE career of professional wrestler Paige, portrayed by Florence Pugh. The film also stars Lena Headey, Nick Frost, Jack Lowden, Vince Vaughn, and Dwayne Johnson, who also acts as a producer.\nThe film premiered at the Sundance Film Festival on 28 January 2019, and was theatrically released in the United States on 14 February 2019. It received positive reviews and grossed $39 million worldwide.", "plot": "In 2002, in Norwich, England, UK, 12-year-old Zak Bevis is engrossed by the WWF (now WWE) King of the Ring pay-per-view event until his younger sister Saraya changes the channel to her favorite program, Charmed. The siblings wrestle, urged on by their parents Rick and Julia. Rick books the children for their first wrestling match where Saraya, initially reluctant to wrestle a boy, goes on to win as planned.\nAt 18, competing under the ring name “Britani Knight”, Saraya and her brother “Zak Zodiac” help their parents train prospective wrestlers while working toward their own promotion. Rick and Julia, struggling financially, ask WWE trainer Hutch Morgan to sign the siblings. He finally agrees to a tryout before a SmackDown taping at The O2 Arena, and tells Saraya to find a different name as they \"already have a Britani\". The siblings receive advice from Dwayne Johnson, and Saraya adopts the name Paige from her favorite character on Charmed. \nThe two try out with several other wrestlers and are all belittled by Morgan. He ultimately chooses Paige over the rest, despite her attempt to have Zak signed as well. With her brother’s encouragement, Paige leaves for America while Zak continues wrestling on the British independent circuit, assisting his parents’ wrestling school, and tending to his girlfriend and newborn son.\nArriving at NXT in Florida, Paige has difficulty adjusting to the WWE style of entertainment – chiefly, the absence of intergender competition and the inexperience of her fellow female trainees Jeri-Lynn, Kirsten, & Maddison. Paige struggles with performing promos and Morgan’s constant belittlement. Morgan makes it clear to Zak that he will never be signed to WWE, and Zak falls into a  depression. Paige discovers her parents are selling merchandise of her likeness without her permission and have booked her in a match against Zak scheduled for her Christmas break.\nAt an NXT live event and her in-ring debut, Paige is heckled by the crowd and freezes up, leaving the ring in tears. She decides to bleach her hair blonde and spray tan to look more like her fellow trainees, which only causes more friction between them. After failing an obstacle course, Paige lashes out at the trainees for gossiping about her when they were actually discussing Kirsten, who has been away from her daughter in order to give her a better life. \nMorgan tells Paige that her brother’s future in WWE would only have been as enhancement talent and signing would have ruined his life, implying that it did the same to him. Morgan encourages Paige to quit and return to her family for a happier life. She travels home for the Christmas break. Just before the match against her brother, Paige tells Zak she is leaving WWE. Angry that she is giving up the dream he failed to achieve himself, Zak goes off-script, defeats Paige and then tells their parents her plans to quit, devastating Ricky. After the family find Zak in a drunken bar fight, Paige admits that Morgan declined to sign Zak to protect him and he needs to focus on what is important in life; his family and coaching children who look up to him. Paige changes her mind after Zak berates her for giving up on their shared dream, and she returns to Florida, resuming her original hair color and skin tone.\nShe drastically improves in training, befriending and encouraging her fellow trainees. Zak returns to training his parents’ students. Morgan brings the trainees to WrestleMania XXX, where Paige is booked in a suite with The Rock and learns she will make her Raw debut the following night against WWE Divas Champion AJ Lee, as recommended by Morgan. Paige makes her Raw debut and again freezes up, but Lee starts the match and unexpectedly puts the Divas Championship on the line. With her family watching on TV, Paige wins the match and the title, finally comfortable enough to say a promo, \"This is MY house!\".\nAn epilogue explains that Paige remains the youngest Divas Champion and was an early leader in the ongoing Women's Revolution, that one of Zak's trainees, who was blind, became a wrestler, and pokes fun at The Rock's movie career and Rick selling shares in the family business. The closing credits include footage from the family’s 2012 documentary and Paige’s debut match.", "cast": "Additionally, WWE wrestlers Big Show, Sheamus and The Miz make appearances as themselves, while an uncredited actor played John Cena. Michael Cole, Jerry Lawler, and John Layfield provide commentary on the Paige vs. AJ Lee match. Several other WWE wrestlers (including Cena himself), as well as the real Knight family, appear in archival footage throughout the film."}