{"_movieID": "492452", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:35:08", "summary": "Ben Is Back is a 2018 American drama film written and directed by Peter Hedges and starring Julia Roberts, Lucas Hedges (son of the film's director), and Courtney B. Vance. The plot follows a mother who tries to help her addict son after he returns home from rehab.\nThe film had its world premiere at the Toronto International Film Festival on September 8, 2018, and was theatrically released on December 7, 2018, by LD Entertainment, Roadside Attractions, and Lionsgate. The film received generally favorable reviews from critics, who praised the performances of Hedges and Roberts.", "plot": "Driving home with her kids on Christmas Eve, Holly Burns is startled to see her son Ben standing in the driveway. Ben has been in rehab for the past few months and is not supposed to be released yet. Ben tells them his sponsor said a trip home would be good for him. Though wary, Holly is happy to see him and says he can stay for 24 hours on the condition he does not leave her sight.\nHolly takes Ben out to do some holiday shopping and get him clothes for church. While at the mall Holly runs into Ben's former doctor, now an old man riddled with dementia. When his caregiver walks away Holly scolds him for getting her son hooked on painkillers after a snowboarding accident when he was younger. Ben also makes eye contact with someone who clearly recognizes him, leaving Ben looking worried. He tells Holly he needs to get to a support group meeting immediately.\nAt the meeting Ben shares the story of how he almost overdosed but his mom and dog saved him. After the meeting he is approached by a young girl. He doesn't recognize her, but she tells him he was her dealer and asks if he wants to get high with her one last time.\nBack shopping once again Holly finds drugs on Ben and he claims the girl at the meeting gave them to him. Holly takes the drugs and they go home and get ready for church. At church they see a distraught woman. Holly approaches her and gives her condolences for the loss of her daughter Maggie. It is implied that Maggie was the friend or girlfriend of Ben's and a fellow person with an addiction.\nThe family drives home from church that night to find that someone has broken into their home and kidnapped the family dog, Ponce. Realizing it has something to do with him, Ben runs off to retrieve the dog. Holly follows him in the car and they end up driving around trying to find the dog together. They first visit one of Ben's former high school teachers whom Holly is shocked to learn used to provide her son with drugs in exchange for sexual favors. Next they go to Maggie's father's apartment. Seeing him sleeping and no dog in sight they retreat to their car but he wakes and angrily smashes the car window screaming for Ben to leave.\nWhile eating at a diner Ben tells Holly he got Maggie hooked on drugs and is responsible for her death. He says that he lied to her telling her that the drugs were the best thing ever.  Holly explains at the time he believed this to be the truth, so it was not a lie.  Ben's childhood friend Spencer (the guy from the mall) shows up and after a physical confrontation, confirms Ben's fear: Clayton, a drug dealer he used to work for, is the one who took the dog.  Ben tries to get his mom to go home, telling her this will be dangerous and she should let him handle it. He also says he's a liar and not worth all the trouble but Holly refuses to leave him.\nBen is able to trick Holly at a gas station convenience store, leaving her stranded there while he goes to meet Clayton.  Ben tries to buy his dog back but Clayton says Ben must do one more job for him - handling a drug run. Meanwhile, Holly goes to Maggie's mom for help. Maggie's mom gives her a med kit for reviving a person who has suffered an overdose and the keys to her car to go find Ben. Holly tracks down Spencer, and gives him the drugs she confiscated from Ben earlier, in exchange for him telling her where Ben might be. Holly also goes to a drive-through pharmacy and tries to fill an old prescription, presumably for anti-overdose medication. The pharmacist refuses to fill the prescription, because the store does not want to encourage bad behavior.\nBen completes the mission and gets his dog back, but Clayton also gives him some drugs as a thank you. Ben goes to the same drive-through pharmacy, ironically receiving a syringe from the same person who previously denied Holly anti-overdose medication on the grounds of not wanting to encourage bad behavior. Ben drives out to an abandoned barn and parks on the side of the road. He leaves Ponce in the car with a note asking whoever finds it to call Holly.\nAfter wandering around all night, searching unsuccessfully for Ben, Holly finally goes to a police station. While screaming for someone to find and arrest her son, she gets a call from a guy who has found Ponce, and drives out to retrieve him. She follows Ponce down a nearby path that leads to an old barn where she finds Ben unconscious, having taken the drugs from Clayton. Holly uses the Naloxone kit from Maggie's mom and performs mouth-to-mouth on him, and finally is able to revive him as the movie cuts to ending credits.", "cast": "Julia Roberts as Holly Burns-Beeby, Ben and Ivy's mother and Neal's wife\nLucas Hedges as Ben Burns, Holly's son, Ivy's brother and Neal's stepson\nCourtney B. Vance as Neal Beeby, Ben and Ivy's stepfather and Holly's husband\nKathryn Newton as Ivy Burns, Ben's sister, Holly's daughter and Neal's stepdaughter\nRachel Bay Jones as Beth Conyers, the mother of Ben's deceased ex-girlfriend, Maggie\nDavid Zaldivar as Spencer \"Spider\" Webbs, a drug addict and one of Ben's old friends\nAlexandra Park as Cara K at AA meeting, a Ben drug customer\nMichael Esper as Clayton, Ben's local drug supplier and Ponce thief\nTim Guinee as Phil, AA meeting member\nHenry Stram as Mr. Richman, Ben's high school history teacher who gave Ben oxycontin in exchange for sexual favors\nMyra Lucretia Taylor as Sally, a homeless woman\nKristin Griffith as Mrs. Crane, wife of Alzheimer doctor\nMia Fowler as Lacey Burns-Beeby, Ben's little sister - age 10\nJakari Fraser as Liam Burns-Beeby, Neal and Holly's 6-year-old son\nPonce as family dog"}