{"_movieID": "70706", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:16", "summary": "Very Good Girls is a 2013 American drama film and the first feature film directed by American screenwriter Naomi Foner, whose script for drama Running on Empty was Oscar-nominated. First screened publicly in early 2013, the film stars Dakota Fanning and Elizabeth Olsen as two friends who fall for the same man (Boyd Holbrook). The film premiered at the Sundance Film Festival on January 22, 2013; it was given release on home formats on June 24, 2014.\nThe supporting cast includes Demi Moore, Richard Dreyfuss, Ellen Barkin, Clark Gregg, and Peter Sarsgaard. The film was produced by Norton Herrick, Michael London, and Mary Jane Skalski.\n\n", "plot": "School friends Lilly and Gerri spend their last summer in New York together. On Brighton Beach, they run into David, an attractive guy selling ice cream. After an awkward conversation, they move away, and David takes a picture of Lilly from the back. After coming back home, Lilly sees her father kissing another woman in the office. Upset by this, she takes comfort in spending the evening with Gerri's family, who are loud and open in contrast to Lilly's. The girls are uncomfortable to be 'the last ones' and vow to lose their virginity before leaving for college.\nAs Lilly walks to work as a boat tour guide in Manhattan, David watches from a distance. He starts posting her pictures around the block, asking where she lives. She doesn't tell Gerri, who chased David to the restaurant printed on his matchbox, who is obviously clear that she likes David. Lilly goes to the beach to see David, who asks her out, and she reluctantly gives him her address.\nLilly's mother learns about her father's affair and asks him to leave. Lilly wishes her father stayed so her family would be together, but her mother disagrees and acts depressed for a while. She hangs out with David and they kiss but David sends her away. Gerri invites David to an open mic night where she sings a song she wrote for David, but David takes Lilly's hand and holds it under the table out of Gerri's view, which shows his preference between the two best friends.\nLilly's boss flirts with her, offering lucrative night shifts without her consent. As she's walking home, Lilly sees David waiting outside her house; they kiss and have sex in the garage. The next morning Lilly runs into her father who apologizes for his affair and asks her to have dinner with him, but she declines. Afterward, David sneaks in through the bathroom window as Lilly takes her morning shower. They have sex, go around the city posting David's art and taking pictures of themselves. \nLater in the evening Lilly calls her mother and learns that Gerri's father died after suddenly collapsing in the subway. She leaves David to be with Gerri. Gerri is in despair, realizing her life will never be the same. This encourages Lilly to ask her mother to forgive her father. Gerri confides she can't stop thinking about David and wishes him to be with her. Feeling guilty, Lilly rejects David's attempts to meet again. When he confronts her, she rebuffs him then asks him to meet up with Gerri. David complies. When Gerri breaks down and asks him to make love to her, he comforts her and they kiss, but do not have sex.\nAt her father's memorial service, Gerri confides to Lilly that she lost her virginity to David. Lilly is upset and goes to see her boss. They kiss and start making out in the tour boat, but Lilly runs away. She confronts David about having sex with Gerri. Seeing him confused, Lilly lies that she too had sex with her boss, then leaves.\nThe next day, Lilly finds her parents cooking in the kitchen, and is upset to learn they are back together. David shows up and claims he didn't sleep with Gerri, asking Lilly to tell Gerri the truth about their affair. Lilly storms off, ignoring him.\nGerri tells Lilly that David is leaving for Paris, and Lilly goes to David to admit she didn't really sleep with her boss. David thinks Lilly is too spoiled and warns her to stop manipulating other people's feelings, or soon there will be no-one left to play with. He kisses her goodbye and leaves in a cab. As Lilly walks away, Gerri confronts her, having overheard their conversation. Gerri is furious at Lilly for 'playing God' because she would have rather had David outright reject her than string her along by the order of her friend.\nLilly makes amends with her father and tells him about the situation between Gerri and David, and he gives her valuable advice. As she is about to leave for Yale, Gerri comes over with a photograph of Lilly which David sent her to make sure the girls meet each other. Gerri reveals she never actually slept with David because he claimed to be in love with someone else. The two make up and end up dancing in their bras and panties while the sprinklers come on.", "cast": "Dakota Fanning as Lilly Berger\nElizabeth Olsen as Gerri\nBoyd Holbrook as David Avery\nDemi Moore as Kate, Gerri's Mother\nRichard Dreyfuss as Danny, Gerri's father\nEllen Barkin as Norma, Lilly's mother\nClark Gregg as Edward, Lilly's father\nKiernan Shipka as Eleanor, Lilly's sister\nPeter Sarsgaard as Fitzsimmons, Lilly's summertime job boss"}