{"_movieID": "401981", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:42:21", "summary": "Red Sparrow is a 2018 American spy thriller film directed by Francis Lawrence and written by Justin Haythe, based on the 2013 novel of the same name by Jason Matthews. The film stars Jennifer Lawrence, Joel Edgerton, Matthias Schoenaerts, Charlotte Rampling, Mary-Louise Parker, and Jeremy Irons. It tells the story of a Russian intelligence officer, who is sent to make contact with a CIA officer in the hope of discovering the identity of a mole.\nMatthews, a former member of the CIA, advised the production on the depiction of spying. Based on historic Soviet sexpionage and contemporary Russian use of kompromat, filming took place in Hungary, Slovakia and Austria.\nRed Sparrow premiered at the Newseum in Washington, D.C. on February 15, 2018, and was released in the United States on March 2, 2018. The film grossed $151 million worldwide, becoming a modest box-office success, and received mixed reviews from critics, who described it as having \"more style than substance\", and criticized the film's length and over-reliance on graphic violence and sex, while praising Jennifer Lawrence's performance.", "plot": "In modern-day Russia, Dominika Egorova is a famous ballerina who supports her ill mother. Following a career-ending injury, Dominika is approached by her uncle Ivan, the Deputy Director of SVR. She is tasked with seducing Dimitry Ustinov, a Russian gangster, in exchange for her mother's continued medical care. As Ustinov rapes her, he is killed by Sergei Matorin, an SVR operative authorized by Ivan. Ivan offers Dominika a choice: become an SVR operative, or be executed for witnessing Ustinov's assassination.\nNate Nash is a CIA operative working in Moscow. While meeting with an asset in Gorky Park, they are confronted by the police. Nash creates a diversion to ensure his asset, a mole in Russian ranks code-named Marble, escapes unidentified. Nash is reassigned back to the U.S. but insists he is the only person with whom Marble will work. Since he cannot return to Russia, he is assigned to Budapest to reestablish contact with Marble, which the SVR also deduce.\nDominika is sent to State School 4, a brutal specialist training school for \"Sparrows\"—SVR operatives capable of seducing their targets with sexpionage. Dominika excels in her training, despite some friction with her trainers. After graduating, Ivan assigns Dominika to Budapest to gain Nash's trust and expose Marble's identity.\nIn Budapest, Dominika lives with another sparrow named Marta Yelenova, and is supervised by SVR station chief Maxim Volontov. Dominika makes contact with Nash, who quickly determines she is a Russian intelligence operative and attempts to convince her to defect.\nDominika inspects Marta's room and realizes that Marta has been assigned to buy classified intelligence from Stephanie Boucher, the chief of staff to a U.S. Senator. When Ivan pressures Dominika about her slow progress with Nash, Dominika claims to be helping Marta with Boucher as well. Marta is brutally killed by the SVR for apparently sharing her classified mission with Dominika and to warn Dominika what will happen to her if she fails. Dominkia contacts Nash, agrees to become a double agent in exchange for protection for her and her mother, and has sex with him. Under Russian orders, Dominika travels to London with Volontov to meet Boucher and complete the trade, but covertly switches out the intelligence Boucher supplies with CIA-supplied disinformation. \nUpon leaving the meeting, Boucher sees American agents coming to arrest her, panics, unintentionally steps into traffic, and is killed. Russian agents observing Boucher realize their mission has been compromised. Suspected of tipping off the Americans, Dominika and Volontov are recalled to Moscow where they are tortured and interrogated for days. Volontov is executed, but Dominika's claims of innocence are eventually believed by Ivan, and she is allowed to return to Budapest to continue her original mission of extracting Marble's identity from Nash. Instead, she convinces Nash to relocate her and her mother to America.\nAfter spending the night with Nash, Dominika awakes to find him being tortured by Matorin for Marble's identity. She initially assists Matorin with torturing Nash until Matorin lowers his guard and she kills him, but is badly injured while doing so. She wakes in a hospital where General Vladimir Korchnoi, a high-ranking official working with Ivan, reveals himself as Marble. He explains that he was initially patriotic, but became disillusioned by Russia's corruption. He fears he will be caught soon and, instead of dying in vain, instructs Dominika to expose his identity to Ivan. Doing so would make her a national hero, and allow her to replace him as a mole passing critical intelligence to the CIA. But when Dominika contacts her superiors, she frames Ivan as the mole instead, using evidence she had been fabricating since she first arrived in Hungary, and blaming him for the botched exchange in London. Ivan is killed and Dominika is honored in a Russian military ceremony attended by Korchnoi.\nBack in Russia, Dominika lives with her mother, and receives a phone call from an unknown person who plays Grieg's piano concerto, which she previously had told Nash was the piece to which she danced her first solo performance."}