{"_movieID": "169209", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:27:03", "summary": "The Empire State Building is a 102-story Art Deco skyscraper in Midtown Manhattan, New York City. It was designed by Shreve, Lamb & Harmon and completed in 1931. The building has a roof height of 1,250 feet (380 m) and stands a total of 1,454 feet (443.2 m) tall, including its antenna. Its name is derived from \"Empire State\", the nickname of New York, which is of unknown origin. As of 2019 the building is the 6th-tallest completed skyscraper in the United States and the 45th-tallest in the world. It is also the 6th-tallest freestanding structure in the Americas. The Empire State Building stood as the world's tallest building for nearly 40 years until the completion of the World Trade Center's North Tower in Lower Manhattan in late 1970. Following the September 11 attacks in 2001, it was again the tallest building in New York until the new One World Trade Center was completed in April 2012.\nThe site of the Empire State Building, located in Midtown South on the west side of Fifth Avenue between West 33rd and 34th Streets, was originally part of an early 18th-century farm, then became the site of the Waldorf–Astoria Hotel in 1893. In 1929, Empire State Inc. acquired the site and devised plans for a skyscraper there. The design for the Empire State Building was changed fifteen times until it was ensured to be the world's tallest building. Construction started on March 17, 1930, and the building opened thirteen and a half months afterward on May 1, 1931. Despite the publicity surrounding the building's construction, its owners failed to make a profit until the early 1950s. However, since its opening, the building's Art Deco architecture and open-air observation deck has made it a popular attraction, with around 4 million tourists from around the world visiting the building's 86th and 102nd floor observatories every year.The building stands within a mile of other major Midtown tourist attractions including Grand Central Terminal, Pennsylvania Station, Madison Square Garden, Koreatown, and Macy's Herald Square.\nThe Empire State Building is an American cultural icon and has been featured in more than 250 TV shows and movies since the film King Kong was released in 1933. A symbol of New York City, the tower has been named as one of the Seven Wonders of the Modern World by the American Society of Civil Engineers. The Empire State Building and its ground-floor interior have been designated as a city landmark by the New York City Landmarks Preservation Commission, and were confirmed as such by the New York City Board of Estimate. It was also designated a National Historic Landmark in 1986, and was ranked number one on the American Institute of Architects' List of America's Favorite Architecture in 2007."}