{"_movieID": "290512", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:42:50", "summary": "The Mountain Between Us is a 2017 American drama film directed by Hany Abu-Assad and written by Chris Weitz and J. Mills Goodloe, based on the 2011 novel of the same name by Charles Martin. It stars Idris Elba and Kate Winslet as a surgeon and a journalist, respectively, who survive a plane crash, with a dog, and are stranded in High Uintas Wilderness with injuries and harsh weather conditions. The film premiered on September 9, 2017, at the 2017 Toronto International Film Festival, and was theatrically released in the United States on October 6, 2017, by 20th Century Fox.", "plot": "After their flight is cancelled due to stormy weather, neurosurgeon Dr. Ben Bass (Idris Elba) and photojournalist Alex Martin (Kate Winslet) hire private pilot Walter (Beau Bridges) to get them to Denver for connecting flights to Alex's wedding in New York and Ben's emergency surgery appointment in Baltimore. Walter, who has not filed a flight plan, suffers a fatal stroke mid-flight, and the plane crashes on a mountaintop in the High Uintas Wilderness. Ben, Alex, and Walter's dog survive the crash with various injuries.\nAlex thinks Ben has a better chance of finding help if he leaves her behind, but Ben refuses. Stranded for days with dwindling supplies, Alex grows skeptical that they will be rescued, although Ben wants to wait for help by the plane's wreckage. After arguing, Alex starts a lone descent down the mountain. Ben catches up and they make-up over past grievances. \nAlex falls into freezing water near an abandoned cabin. They stay there for several days while Alex recuperates, and they have sex. Ben reveals that his wife died two years prior from a brain tumor. As Ben sleeps, Alex takes his picture. Later, she again asks Ben to leave her behind to find help. Ben initially agrees but soon returns; they press forward again. \nThe dog alerts them to a nearby timber yard. On their way toward it, Ben's leg gets caught in a bear trap. Alex cannot free him, but she reaches the yard and collapses in front of an approaching truck. Ben awakens in a hospital and goes to Alex's room, where he finds her with Mark (Dermot Mulroney), her fiancé. After a brief discussion, Ben leaves heartbroken. Some time after, Mark discovers Alex is no longer in love with him.\nBen and Alex go their separate ways after the hospital, with Ben keeping the dog. Alex tries calling Ben, but he ignores her calls until she sends him pictures of them on the mountain. This encourages Ben to call Alex. They meet at a restaurant, where it is revealed that Alex is now a part-time teacher, and Ben is a consultant at trauma clinics because his frostbitten hands have not recovered sufficiently for him to perform surgery. Ben says he did not call Alex because he thought she would be married; Alex says she could not go through with it because she fell in love with Ben. After leaving the restaurant, Ben admits to Alex that they survived because they fell in love. Alex dismisses her feelings and reminds Ben of something he said on the mountain: \"the heart is just a muscle.\" They hug goodbye, but as they depart in opposite directions they run back to each other.", "cast": "Idris Elba as Dr. Ben Bass, a neurosurgeon\nKate Winslet as Alex Martin, a photojournalist\nDermot Mulroney as Mark Robertson, Alex’s fiancé\nBeau Bridges as Walter, the pilot of the charter plane\nRaleigh and Austin as Walter's dog"}