{"_movieID": "347375", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:54:02", "summary": "Mile 22 is a 2018 American espionage action thriller film directed by Peter Berg and written by Lea Carpenter, from a story by Carpenter and Graham Roland. The film stars Mark Wahlberg, Iko Uwais, John Malkovich, Lauren Cohan, and Ronda Rousey. It follows an elite CIA task force composed of paramilitary officers from Ground Branch of Special Activities Division, that has to escort a high-priority asset 22 miles to an extraction point while being hunted by the government. The film marks the fourth collaboration between Berg and Wahlberg, following Lone Survivor, Deepwater Horizon, and Patriots Day. \nThe film was released in the United States on August 17, 2018, and grossed $66 million worldwide. It received generally unfavorable reviews from critics, who called it \"confusing and a chaotic mess,\" alongside criticizing the cinematography in the action sequences, although the performance of Uwais received praise.", "plot": "CIA officer and former USMC Force Recon veteran, James Silva, leads a Special Activities Division team code-named Overwatch to raid a Russian FSB safe house in the United States. Under the remote supervision of James Bishop and his team, the mission is to locate and destroy shipments of caesium before the highly radioactive substance can be weaponized. In the ensuing firefight, most of the Russians and Overwatch operative Greg Vickers are killed, but critical intelligence on the caesium is destroyed. Silva executes the last survivor, a teenager who warns him that he is making a mistake.\nSixteen months later, in the Southeast Asian country of Indocarr, police officer Li Noor surrenders himself at the US Embassy to negotiate for passage out of the country in exchange for information. Noor is revealed to be the asset of Overwatch agent Alice Kerr and reveals he possesses a disc containing information on the caesium, and is able to negotiate passage out of the country in exchange for unlocking the disc, which is programmed to self destruct within eight hours. Ambassador Dorothy Brady is visited by the country's Deputy Foreign Minister and state intelligence agent Axel, with the two demanding that Noor be handed over as he is wanted for espionage. Meanwhile, Noor fends off an assassination attempt by disguised government agents in the embassy infirmary using his skills as a former member of the elite tactical squad. \nWanting access to the intel, Silva's team is instructed to take Noor to an airplane at an airstrip 22 miles away, being provided with remote assistance from Bishop's team in Colombia. En route they are attacked by a group of men on motorcycles, who use a brief camera blackout to plant a bomb on one of the vehicles. During the ensuing gunfight, operative Sam Snow is mortally injured, and sacrifices herself to buy the group time. Taking cover in a restaurant, they are again attacked by Axel's men, in which Silva is saved by Noor and operative William “Dougie” Douglas is seriously injured. The group retreats into an apartment complex, and Douglas sacrifices himself by putting down cover fire. Inside the building, Alice becomes separated from Silva and Noor, but is able to escape harm by using booby-trapped grenades and is later saved by Noor. Axel attempts to stop their car from reaching the airstrip, but is killed by Bishop's team via a drone strike. Arriving just before the plane takes off, Noor and Alice board the aircraft, with Alice having been given time off to see her estranged daughter. Noor provides Overwatch with the passcode to access the disk, with the intel appearing to be legitimate locations of the caesium. \nNoticing that the password \"rozhdestvo111\" matches the address of the FSB safehouse at the start of the film which was Christmas 111, Bishop comes to the conclusion Noor has betrayed them, and is actually acting as a triple agent for the Russian government. The entire mission is revealed to have been compromised, with a team on board a Beriev A-50, led by Senior Lieutenant Aleksander Aslanov, having breached the CIA's secure communications and caused the earlier blackout. The teenager Silva killed at the safehouse is shown to be Anatole Kuragin, the son of high ranking government official Vera Kuragina, who ordered the operation and sought personal revenge against the group. She hired Noor to give Alice the wrong information so they would trust him and activate Overwatch. As Alice realizes Noor's true intentions, he disarms a guard and breaches the cockpit, leaving her fate uncertain. The team in Colombia, having been traced by the Russians, are gunned down, with a critically injured Bishop barely escaping. Having been unable to stop what occurred, Silva tells of his experience during a post-mission debriefing. Returning to his apartment, he puts up a picture of Noor on his wall, vowing revenge."}