{"_movieID": "356846", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:39:05", "summary": "The Gamechangers is a British docudrama produced by the BBC. The programme depicts the story of the controversy caused by Grand Theft Auto, a video game series by Rockstar Games, as various attempts were made to halt the production of the games. Directed by Owen Harris and written by James Wood, the film centres on the legal feud between Rockstar Games president Sam Houser (Daniel Radcliffe) and controversial attorney Jack Thompson (Bill Paxton) over Rockstar's popular video game series Grand Theft Auto, and the debate regarding the psychological effects of violent video games.", "cast": "Daniel Radcliffe as Sam Houser, co-founder and president of Rockstar Games\nBill Paxton as Jack Thompson\nJoe Dempsie as Jamie King, VP of development at Rockstar Games\nAlex McGregor as Bridjet\nShannon Esra as Jen Kolbe, head of the publishing team at Rockstar Games\nMark Weinman as Terry Donovan, VP of marketing at Rockstar Games\nIan Keir Attard as Dan Houser, VP of creative at Rockstar Games\nJames Alexander as Tom Masters\nNick Boraine as Doug Lowenstein, president of the Entertainment Software Association\nFiona Ramsay as Patricia Thompson\nInge Beckmann as Michelle Gerilikos, a member of Blank Rome's lawyer team\nGarion Dowds as Johnny Thompson\nNicole Sherwin as Jdg. Dava Tunis\nD. David Morin as Jdg. Moore\nGarth Breytenbach as Police Ofc. Arnold Strickland\nJenna Dover as Pat Vance\nThabo Rametsi as Devin Moore\nGideon Lombard as Patrick Wildenborg, a Dutch modder who rose to fame after uncovering the 'Hot Coffee' minigame within the code of GTA San Andreas\nAbena Ayivor as Laila\nThorsten Wedekind as Steve Strickland\nChristiaan Schoombie as JP\nStephen Jennings as Lt. Col. Dave Grossman\nDean Fourie as Ray Reiser\nRichard September as DJ Dog\nDavid Butler as Dr. John Murray\nJan Neethling as Police Dispatcher Ace Mealer\nNkangisang Maduo as Police Cpl. James Crump\nBridget Thorpe as Mrs. Wildenborg"}