{"_movieID": "135397", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:15:26", "summary": "Jurassic World is a 2015 American science fiction adventure film, the fourth installment of the Jurassic Park film series, and the first film in the Jurassic World trilogy. It was directed by Colin Trevorrow, written by Derek Connolly and Trevorrow, produced by Frank Marshall and Patrick Crowley, and stars Chris Pratt, Bryce Dallas Howard, Vincent D'Onofrio, Ty Simpkins, Nick Robinson, Omar Sy, BD Wong, and Irrfan Khan.\nSet 22 years after the events of Jurassic Park, Jurassic World takes place on the same fictional Central American island of Isla Nublar, which is located off the Pacific coast of Costa Rica, where a theme park of cloned dinosaurs has operated for nearly a decade. The park plunges into chaos when a genetically-engineered dinosaur escapes from its enclosure and goes on a rampage.\nUniversal Pictures intended to begin production of a fourth Jurassic Park film in 2004 for a mid-2005 release but development stalled while the script underwent several revisions. Following a suggestion from Spielberg, writers Rick Jaffa and Amanda Silver explored the idea of a functional dinosaur park. Once Trevorrow was hired as director in 2013, he followed the same idea while developing a new script with Derek Connolly. Filming lasted from April to August 2014 in Louisiana and at the original Jurassic Park locations in Hawaii. The dinosaurs were created by Industrial Light & Magic using CGI and by Legacy Effects using life-sized animatronics.\nProduction was completed in May 2015, and Jurassic World was released in over 60 countries beginning on June 10, 2015. After a record-breaking opening weekend during which it became the first film to gross over $500 million, Jurassic World generated $1.6 billion in box office revenue, ranking sixth among the highest-grossing films of all time. The film has a 72% approval rating on Rotten Tomatoes, which called it an entertaining popcorn thriller. It was also the second-highest-grossing film of 2015 and the highest-grossing in the franchise. Furthermore, it is the highest grossing film ever released by Universal Pictures unadjusted for inflation. A sequel titled Jurassic World: Fallen Kingdom was released in June 2018. An animated series based on the film is scheduled for a 2020 release on Netflix.", "plot": "Brothers Zach and Gray Mitchell visit Jurassic World, a dinosaur theme park on Isla Nublar, of which their aunt Claire Dearing is the operations manager. Claire assigns her assistant Zara Young as the boys' guide, but they evade her and explore on their own. Elsewhere on the island, U.S. Navy veteran and ethologist Owen Grady has been training four Velociraptors and researching their intelligence. Based on the raptors' ability to follow commands, head of InGen security Vic Hoskins believes that the animals can be weaponized, an idea Owen and his assistant Barry begrudgingly oppose.\nPrior to its opening, Claire and park owner Simon Masrani inspect the park's newest attraction, the Indominus rex, a genetically-engineered dinosaur created by geneticist Dr. Henry Wu. Masrani tasks Owen with evaluating the enclosure. Owen warns Claire that the Indominus lacks social skills, making it dangerous and unpredictable. When it seems that the Indominus has escaped, Owen and two park workers enter the enclosure. The Indominus, which can camouflage itself and mask its heat signature, suddenly appears. Owen survives, but it devours the other two men before escaping into the island's interior. Owen advises Masrani to have the Indominus killed, but with an interest to protect his company's investment, Masrani dispatches a specialized unit to subdue it with non-lethal weaponry. After most of the unit is slaughtered, Claire orders the evacuation of the island's northern sector.\nWhile exploring the park in a gyrosphere, Zach and Gray enter a restricted area. The Indominus arrives and destroys the gyrosphere but the boys narrowly escape. They find the ruins of the original Jurassic Park visitor center, repair an old Jeep Wrangler, and drive back to the park resort. As Claire and Owen search for the boys, they barely escape the Indominus. Masrani and two troopers hunt the Indominus by helicopter but it breaks into the park's aviary, releasing pterosaurs – Pteranodon and Dimorphodon species – which collide with the helicopter, causing it to crash, killing Masrani and his troopers in the process. Gray and Zach find Owen and Claire at the resort as armed personnel shoot down swarming pterosaurs with tranquilizers.\nAssuming command, Hoskins orders the raptors to be used to track the Indominus. Forced to comply, Owen leads the raptors. Upon finding the Indominus, the dinosaurs begin communicating among themselves. Owen realizes that the Indominus has Velociraptor DNA, and it usurps Owen's dominance, becoming the pack's new alpha. Troops fire on the Indominus, but it escapes. The raptors slaughter most of the troops, but one raptor is killed. Hoskins evacuates Wu and the dinosaur embryos from the island to protect Wu's research. Owen, Claire, and the boys find Hoskins at the lab, but a raptor breaks in and kills him.\nOwen re-establishes his bond with the three raptors before the Indominus reappears. They attack the Indominus but two are killed. Claire releases the park's Tyrannosaurus rex and lures it into a battle with the Indominus, which gains the advantage over the T. rex until Blue, the last surviving raptor, joins the battle. The Indominus is cornered at the lagoon's edge, where it is dragged underwater by the park's Mosasaurus. The survivors are evacuated and the island is abandoned again. Zach and Gray are reunited with their parents, while Owen and Claire decide to stay together.", "cast": "Chris Pratt as Owen Grady, a Navy veteran and ethologist, and a Velociraptor expert and handler at Jurassic World.\nBryce Dallas Howard as Claire Dearing, the Jurassic World operations manager. Aunt to Zach and Gray Mitchell.\nVincent D'Onofrio as Vic Hoskins, head of InGen's security operations, who wants to use the Velociraptors and the Indominus rex as military animals.\nTy Simpkins as Gray Mitchell, one of Claire's nephews and the younger brother of Zach.\nNick Robinson as Zach Mitchell, one of Claire's nephews and the older brother of Gray.\nOmar Sy as Barry, Owen's assistant who helps care for the raptors.\nBD Wong as Dr. Henry Wu, a geneticist who heads the team that created the dinosaurs for Jurassic World. He is revealed to have an alliance with Hoskins. Wong is the only actor in the film to reprise his role from any of the previous movies.\nIrrfan Khan as Simon Masrani, CEO of the Masrani Corporation and the owner of Jurassic World.\nJake Johnson as Lowery Cruthers, an employee in the park's control room.\nLauren Lapkus as Vivian, an employee in the park's control room.\nBrian Tee as Hamada, the leader of the ACU (Asset Containment Unit), a group of security guards installed on Isla Nublar.\nKatie McGrath as Zara, Claire's personal assistant.\nJudy Greer as Karen Mitchell, Claire's sister and mother of Zach and Gray.\nAndy Buckley as Scott Mitchell, Karen's husband and father of Zach and Gray.Additionally, Jimmy Fallon and Jimmy Buffett cameo as themselves. Patrick Crowley, the film's producer, cameos as Masrani's flight instructor while Colin Trevorrow briefly provides the voice of Mr. DNA, an animated DNA helix who explains the park's technology to visitors. The character was previously voiced by Greg Burson in Jurassic Park. Brad Bird provides a voice cameo as the park's monorail announcer and Jack Horner, the film's technical advisor, also cameos."}