{"_movieID": "438650", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:16:23", "summary": "Cold Pursuit is a 2019 action thriller film directed by Hans Petter Moland (in his Hollywood debut) from a screenplay by Frank Baldwin. The film stars Liam Neeson, Tom Bateman, Tom Jackson, Emmy Rossum, Domenick Lombardozzi, Julia Jones, John Doman, and Laura Dern.  It is an official remake of the 2014 Norwegian film In Order of Disappearance (Kraftidioten), also directed by Moland, and follows a vengeful snowplow driver who starts killing the members of a drug cartel following the murder of his son.\nThe film was released in the United States on February 8, 2019, by Summit Entertainment. It was a moderate box office success grossing over $74 million worldwide and received generally positive reviews from critics, who praised the action sequences and the dark humor.", "plot": "After being awarded \"Citizen of the Year\" by the fictional ski resort of Kehoe, Colorado, snowplow driver Nels Coxman's quiet life is disrupted when his son dies from a forced heroin overdose. Nels' wife Grace has a psychotic breakdown and leaves her husband in grief. He is about to commit suicide when he learns that his son was murdered by a Denver drug cartel. He decides to seek vigilante justice, makes a sawed-off rifle, and kills three members of the cartel, dumping their bodies in a nearby river. \nThe cartel's leader, drug lord Trevor \"Viking\" Calcote, first suspects that these deaths are the work of his rival White Bull, an Ute with whom he has so far avoided conflict. Viking has one of Bull's gangsters murdered, not knowing it is Bull's only son. This drives Bull to seek revenge (\"a son for a son\"), and he orders his men to kidnap Viking's young son.\nNels seeks advice from his brother Brock, once a mob enforcer known as \"Wingman\", and learns about Viking. Brock tells Nels that killing Viking requires a hired assassin, and recommends a transplanted African American hitman known as \"the Eskimo\". The Eskimo agrees to kill Viking for $90,000, but decides he can get another $90,000 from Viking by informing him that \"Coxman\" has hired him for the hit. Viking doesn't appreciate the Eskimo's \"lack of professional ethics\" and kills him. He thinks the Eskimo meant Brock Coxman, and takes him for his \"last ride\". Since Brock is dying of cancer, he takes responsibility for the hits to protect his brother. \nViking tries in vain to stop the gang war by using one of his own men as a scapegoat and sending White Bull the man's head. This is insufficient to placate Bull, who kills the messenger. Meanwhile, Nels kidnaps Viking's son from his prep school before Bull's men can, in order to draw Viking into an ambush. Nels treats the boy well and protects him from the violence to come, but his identity is revealed to Viking by a Janitor in the prep school.\nBoth gangs arrive at Nels' workplace, and most of them are killed in the ensuing shootout; Viking is trapped when Nels drops a shorn tree on his car, and is shot in the chest by White Bull. He dies when found by Kehoe police detectives Kimberly Dash and Gip. As Nels leaves the property in his snowplow to continue his work, White Bull jumps into the cab and the two men drive away together. Bull's last remaining enforcer, who had set off on a paraglide flight from the ski resort hotel where the gang stayed the night before, accidentally flies into the snowplow and is killed.", "cast": "Uncredited actors play George \"Palomino\" Pillane, Antony \"Little Man\" Pillane, Garson Benjamin \"Growbar\" Oleonto, Strater \"Rushmore\" Olsen, Barry \"Scalp\" Cantori, Andy \"Andy, Andy\" Andino and Philip \"Weatherman\" Torsvell, all of whom were listed in the on-screen death notice following the shootout."}