{"_movieID": "164457", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:55:35", "summary": "Out of the Furnace is a 2013 American drama film, directed by Scott Cooper, from a screenplay written by Cooper and Brad Ingelsby. Produced by Ridley Scott and Leonardo DiCaprio, the film stars Christian Bale, Casey Affleck, Woody Harrelson, Zoe Saldana, Forest Whitaker, Willem Dafoe, and Sam Shepard.\nThe film is about Pennsylvania steel mill worker Russell Baze (Bale), and his Iraq war veteran brother Rodney (Affleck) who cannot adjust to civilian life. Rodney makes money fighting bareknuckle for bar owner and small-time criminal John Petty (Dafoe), who runs illegal gambling operations, but becomes so indebted due to gambling losses that he begs Petty for a big money fight. After Petty reluctantly arranges this with a ruthless backwoods criminal gang, Rodney disappears and his brother tries to find out what has happened. \nThe film received a limited release in Los Angeles and New York City on December 4, 2013, followed by a wide theatrical release on December 6. The film earned $15.7 million against its $22 million budget and it received mixed reviews.", "plot": "After getting off work at a North Braddock, Pennsylvania steel mill, Russell Baze sees his brother, Rodney, at a horse racing simulcast, where Rodney had just bet on a losing horse. Rodney reveals he is betting with money lent by John Petty, who owns a bar and runs several illegal games.  Russell visits Petty, pays off some of Rodney's debt, and promises to pay Petty the rest with his next paycheck if Rodney has not yet paid it off. Driving home intoxicated, Russell hits a car, killing its occupants including a little boy. He is incarcerated for vehicular manslaughter. While in prison, he is informed that his ailing father has died and his girlfriend Lena has left him for the small town police chief, Wesley Barnes. Upon his release from prison, Russell returns home and resumes his job.\nThe same day, Rodney  participates in an illegal bare-knuckle prizefight. Rodney was supposed to take a \"dive\" to repay some of the debt but becomes enraged at his opponent and defeats him. The next morning, Russell finds Rodney's bloodied knuckle tapes in the trash and confronts him about it.  Russell wants him to work in the mill, but Rodney, a four-tour Iraq war veteran, is too mentally scarred for a regular job.\nRodney tells Petty that these \"nickel and dime\" fights will never earn him enough to repay Petty. Rodney then insists that Petty organizes a more lucrative fight. Petty reluctantly arranges one with Harlan DeGroat, a sociopathic drug dealer from rural New Jersey to whom Petty is in debt. Meanwhile Russell wants his girlfriend back, but she is pregnant with Wesley's baby. Russell unsuccessfully feigns contentment to Lena, saying she will be a great mom: both know that her pregnancy makes their getting back together impossible.\nRodney is told he must intentionally lose the New Jersey fight. When DeGroat seeks assurances Rodney will lose, Petty promises he will. Rodney knocks out his opponent, but after Petty pleads with him, he helps his opponent up, takes a dive, and lets the man pummel his face into a bloody mess. After the fight, DeGroat asks for the rest of his loan, but Petty reminds him they had agreed that this fight made them even, and DeGroat drops the subject. While driving back home, however, DeGroat and his men ambush Petty and Rodney. DeGroat first shoots and kills Petty, then has Rodney dragged into the woods and kills him, too. Unknown to anyone, Petty's cell phone had fallen out of his pocket onto the car seat,  accidentally connecting to his bartender Dan's voicemail and recording DeGroat murdering Petty.\nThat night, Russell finds a letter from Rodney, stating that this will be his last fight and that he wants to work with Russell at the mill. Wesley informs Russell about Rodney's disappearance, and Russell and his uncle, Red, set off to find him. In DeGroat's town, Russell and Red are stopped by the sheriff, who informs them that DeGroat's men would kill them if they knew why the two were in town, and, as a favor to Sheriff Wesley, he will escort them to the state line rather than searching and arresting them for illegally carrying concealed weapons.\nUpon returning to the mill, Wesley visits Russell and confirms Rodney's death. Russell goes to Petty's office, finds a phone number for DeGroat, and calls him without identifying himself, enticing him to come to collect Petty's debt. At the bar, Russell sabotages DeGroat's van to prevent his escape and confronts him.  DeGroat escapes to a nearby shutdown mill, where Russell shoots him in the thigh. Russell then follows DeGroat to a field outside the mill as he hobbles off and shoots him in the back. Russell informs DeGroat that he is Rodney's brother, as Wesley approaches the field in a squad car. Wesley pleads for Russell to put down his gun, but Russell proceeds to carefully aim his hunting rifle and shoots DeGroat in the head. The film cuts to Russell sitting at home at the dining table – Wesley having arranged matters so that Russell avoided prison.", "cast": "Christian Bale as Russell Baze\nWoody Harrelson as Harlan DeGroat\nCasey Affleck as Rodney Baze, Jr.\nForest Whitaker as Wesley Barnes\nWillem Dafoe as John Petty\nTom Bower as Dan Dugan\nZoë Saldana as Lena Taylor\nSam Shepard as Gerald \"Red\" Baze"}