{"_movieID": "38931", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:56:10", "summary": "OMG – Oh My God! is a 2012 Indian satirical comedy-drama film. It is an official remake of The Man Who Sued God. The storyline is based on a Gujarati stage-play entitled Kanji Virudh Kanji. It is directed by Umesh Shukla. The film features Akshay Kumar and Paresh Rawal in the lead roles, along with Mithun Chakraborty. Made on a budget of ₹20 crore (US$2.9 million), the film released on 28 September 2012 to widespread critical acclaim. The film was remade in Telugu as Gopala Gopala in 2015 with Venkatesh and Pawan Kalyan in the lead roles and in Kannada with Upendra and Sudeep titled as Mukunda Murari in 2016.", "plot": "Kanji Lalji Mehta (Paresh Rawal), a middle-class atheist Hindu owns a shop of Hindu idols and antiques in Mumbai. A low-intensity earthquake hits the city, and Kanji's shop is the only shop that is destroyed.\nAt the insurance office, Kanji learns that the disaster claim does not cover any damage caused by natural calamities classified under \"Act of God\". Running out of options, he decides to sue God but fails to find a lawyer for such a lawsuit. Hanif Qureshi (Om Puri), a poor Muslim lawyer, helps him file the case after Kanji decides to fight on his own. Legal notices are sent to the insurance company as well as to religious priests, Siddheshwar Maharaj, Gopi Maiyya, and their group's founder, Leeladhar Swamy (Mithun Chakraborty), summoning them to court as representatives of God.\nAs the court case commences and gains traction for its bizarre quality, Kanji finds himself facing armed fundamentalists and harassment, with his mortgage bank occupying the house, and his wife and kids leaving him. He is rescued from all of this by Krishna Vasudev Yadav (Akshay Kumar), who claims to be a real estate agent, but appears to do fantastical tricks not possible for a human.\nThe lawsuit causes a public outcry. On Krishna's advice, Kanji goes to the media and gets wide coverage. Many people in a similar situation join him in the lawsuit, causing the amount of claims to skyrocket and Catholic priests and Muslim Mullahs to also be summoned as defendants. When the court demands written proof that the earthquake was an 'Act of God,' Krishna steers Kanji toward holy books like Bhagavad Gita, The Quran and The Bible. Kanji reads them and finds a passage in each that says the world and all that happen in it, from beginning to end, is a creation of God and comes from God's will alone. This strengthens his case and increases public support. However, Kanji suffers a stroke in court and is rushed to the hospital where he goes into a coma and is paralyzed. When he opens his eyes after a month, he finds Krishna, who reveals that he is God, and proves it by curing Kanji completely.\nKanji learns that the lawsuit's verdict was in his favor and religious organizations were ordered by court to pay the compensation to all the plaintiffs; people have begun revering Kanji himself as a god. Leeladhar, Gopi Maiyya, and Siddheshwar have taken advantage of this by opening a temple dedicated to Kanji and accumulating millions in donations. Krishna explains to Kanji that his job as God is to show people right and wrong - people do with it what they will. Kanji decides to fight back. He breaks his own statue, admonishing the crowd about trusting in God-men. He advises them to search for God in themselves and in others, not in statues; that God is everywhere, not just in temples, and faith should come from within. He tells them not to believe in fraudulent God-men, as their job is to turn religion into business.\nKrishna looks on proudly as Kanji speaks, then vanishes when Kanji tries to reach him after. Kanji is reunited with his family and sees Krishna's key chain on the ground. When he is about to keep it, he hears Krishna's voice, telling him to get rid of the key chain as fear of God and reliance on religious objects was what he'd fought against all this time. Kanji smiles and throws it away, watching as it disappears in the sky with a flash."}