{"_movieID": "378278", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:31:52", "summary": "Kingsman: The Secret Service is a 2014 action spy comedy film directed and produced by Matthew Vaughn. The screenplay, written by Vaughn and Jane Goldman, is based on Dave Gibbons's and Mark Millar's comic book series The Secret Service. The film follows the recruitment and training of Gary \"Eggsy\" Unwin (Taron Egerton), into a secret spy organisation. Eggsy joins a mission to tackle a global threat from Richmond Valentine (Samuel L. Jackson), a wealthy megalomaniac. Colin Firth, Mark Strong, and Michael Caine play supporting roles.\nKingsman: The Secret Service premiered at the Butt-Numb-A-Thon festival on 13 December 2014, and was theatrically released in the United Kingdom on 29 January 2015 and United States on 13 February 2015. The film received generally positive reviews from critics who highly praised the stylised action sequences, the acting performances, villain, score, and its dark humor, though some violent and sexual scenes were critiqued as over-the-top. The film grossed over $414 million worldwide, becoming Vaughn's most commercially successful film to date. In 2015, it won the Empire Award for Best British Film.\nA sequel, titled Kingsman: The Golden Circle, was released in September 2017, with Vaughn and the main cast returning. A prequel, The King's Man, is currently scheduled to be released on 14 February 2020.", "plot": "During a mission in the Middle East in 1997, probationary secret agent Lee Unwin sacrifices himself to protect his superior, Harry Hart. Hart, blaming himself, returns to London to give Lee's widow, Michelle, and her young son Gary \"Eggsy\" a medal engraved with an emergency assistance number.\nSeventeen years later, Eggsy, having dropped out of training for the Royal Marines despite his intelligence and capability of both gymnastics and parkour, has become a stereotypical chav. After being arrested for stealing a car, Eggsy calls the number. Hart arranges his release. Hart explains that he is a member of Kingsman, a private intelligence service founded by the tailors of wealthy British individuals who gave said tailors their vast fortunes after losing their heirs in World War I. Hart, code name \"Galahad\", explains there is a position available, as agent \"Lancelot\" was killed by the assassin Gazelle while trying to rescue Professor James Arnold from kidnappers. Eggsy becomes Hart's candidate. Other candidates are eliminated through dangerous training tests run by operative \"Merlin\", until only Eggsy and Roxy, a candidate he befriended, are left. Eggsy refuses to complete the final test – shooting a Pug puppy he has raised during the training process (unaware that the gun holds blanks) – and Roxy is named the new \"Lancelot\".\nMeanwhile, Merlin discovers that Professor Arnold has returned to work as if nothing had happened. Hart attempts to interrogate him, but a chip in Professor Arnold's neck explodes, killing him. The detonation signal is traced to a facility owned by Internet billionaire and philanthropist Richmond Valentine, who has recently offered everyone in the world SIM cards that grant free lifetime cellular and Internet connectivity. Hart, impersonating a billionaire philanthropist, meets Valentine face-to-face. Hart learns of Valentine's connection to an obscure hate group's church in Kentucky, and travels there, wearing glasses containing a video transceiver. As Eggsy watches, Valentine activates the SIM cards in the church, triggering a signal that causes the parishioners to become murderously violent. Hart's spy training leaves him as the only survivor. Outside the church Valentine explains what happened, and then shoots Hart in the face.\nEggsy returns to Kingsman headquarters and finds that Chester \"Arthur\" King, Kingsman's leader, has a scar on his neck just like Professor Arnold's. King reveals that Valentine plans to transmit his \"neurological wave\" worldwide via satellite network, believing the resulting \"culling\" of some of the human race will avert its extinction. Only those Valentine has chosen, willing and unwilling, will be unaffected. King tries to poison Eggsy but Eggsy switches glasses and King poisons himself.\nEggsy, Merlin and Roxy set out to stop Valentine. Roxy uses high-altitude balloons to destroy one of Valentine's satellites and break up the network, but Valentine quickly secures a replacement from a business associate. Merlin flies Eggsy to Valentine's base, where he masquerades as King. Eggsy is discovered by a failed Kingsman recruit, Charlie Hesketh, leading to both Eggsy and Merlin being cornered. On Eggsy's suggestion, Merlin activates the implanted chips' failsafe, killing almost everyone with a chip. An angry Valentine activates the signal and triggers worldwide pandemonium. Eggsy kills Gazelle and uses one of her sharpened prosthetic legs to impale Valentine and kill him, stopping the signal and ending the threat.\nUltimately, Eggsy, having become the new agent \"Galahad\", offers his mother and half-sister a new home away from his abusive stepfather Dean, who flatly objects to Eggsy's suggestion. Eggsy then dispatches him in exactly the same manner that Hart dealt with one of Dean's henchmen earlier.", "cast": "Hanna Alström and Bjørn Floberg appear as Crown Princess Tilde of Sweden, and Swedish Prime Minister Morten Lindström, respectively. Jack Cutmore-Scott portrays Rufus Saville, and Lily Travers portrays Lady Sophie. Jonno Davies played Lee Unwin, Eggsy's father and a former Kingsman candidate who sacrificed himself to save Hart. Nicholas Banks, Nicholas Agnew, Rowan Polonski and Tom Prior portrayed, respectively, Digby Barker, Nathaniel, Piers and Hugo Higins, the other four Kingsman candidates. Fiona Hampton played Amelia, a Kingsman employee who masquerades as a candidate in order to \"die\" during the first test. Richard Brake played the interrogator during the penultimate test, Ralph Ineson the police interviewer after Eggsy's arrest, whereas Corey Johnson starred as a fanatic church leader, and Velibor Topić portrayed the biggest goon in the bar fight scene. Tobias Bakare and Theo Barklem-Biggs play Eggsy's friends Jamal and Ryan."}