{"_movieID": "82682", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:09", "summary": "Gangster Squad is a 2013 American action crime thriller film directed by Ruben Fleischer, written by Will Beall and starring Josh Brolin, Ryan Gosling, Nick Nolte, Emma Stone, Anthony Mackie, Giovanni Ribisi, Robert Patrick, Michael Peña and Sean Penn. Set in 1949, the plot is a fictionalized account of the LAPD officers and detectives called the \"Gangster Squad\" who attempt to keep Los Angeles safe from Mickey Cohen and his gang.\nThe film was originally set to be released September 7, 2012, but in the wake of the 2012 Aurora shooting, the film was pushed back to a January 11, 2013 release date by Warner Bros. in order to accommodate reshoots. It received mixed reviews and grossed $105 million worldwide.\n\n", "plot": "In 1949 Los Angeles, Mafia gangster Mickey Cohen has become the most powerful figure in the California criminal underworld, and intends to continue to expand his criminal enterprise to Chicago and New York City. The LAPD has not been able to stop Cohen's ruthless rise, as he has eliminated witnesses and bribed both the court and the police.\nDetermined to put a stop to Cohen, LAPD Chief Bill Parker creates a secret police unit with the sole mission of bringing Cohen to justice. Parker puts a trusted friend, Sgt. John O'Mara, in charge of secretly building the unit. With the help of his wife, Connie, he recruits Sgt. Jerry Wooters and four un-corruptible misfit officers – black Lieutenant Coleman Harris, electronics expert and family man Conway Keeler, sharpshooter Max Kennard and his Hispanic protégé Navidad Ramirez. Calling themselves the \"Gangster Squad\", they begin the task of destroying Cohen's operations.\nThe Squad's plans go well, striking several successful blows at the heart of Cohen's criminal organization, even shutting down his ultra-lucrative wire gambling business. Cohen, not knowing the Squad is LAPD, believes someone has betrayed him to rivals and strikes out at those around him, including his girlfriend Grace Faraday. Wooters has also been seeing Faraday and tries to help her escape from Cohen, enlisting the help of mutual friend Jack Whalen.\nRealizing the attackers have never stolen his money, Cohen deduces they are cops and will have bugged his house.  He uses it to lure the Squad into a trap in Chinatown, while Keeler is killed at the Squads' operation base. When Faraday later witnesses Cohen murder Whalen, she agrees to testify against Cohen. O'Mara forces a crooked judge to do his duty and sign an arrest warrant. The Squad then goes over to the Park Plaza Hotel to arrest Cohen.\nCohen and his men engage in a gun battle with the Squad, with Wooters and Kennard being wounded in the process. Cohen and  bodyguard Karl Lennox escape, but O'Mara rams their vehicle into a fountain. Navidad helps a dying Kennard shoot Lennox, who was about to shoot O'Mara. Cohen and O'Mara fight each other in a brutal bare-knuckle fight, while a crowd of onlookers and journalists gather. O'Mara finally beats Cohen and has him arrested, ending his spread of the mafia into the Los Angeles area. The Gangster Squad is never mentioned for their role, and their surviving members remain a secret. Cohen is sentenced to life imprisonment, and is greeted with a beating by inmates who were friends of Jack Whalen. Wooters and Faraday get married, and O'Mara quits his job with the LAPD to live a quiet life with his wife and son."}