{"_movieID": "112200", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:53:29", "summary": "Thanks for Sharing is a 2012 American comedy-drama film directed by Stuart Blumberg, from a screenplay written by Blumberg and Matt Winston. The film stars Mark Ruffalo, Tim Robbins, Gwyneth Paltrow, Josh Gad, Joely Richardson, and Pink with supporting roles from Patrick Fugit, Carol Kane, Michaela Watkins, Emily Meade and Isiah Whitlock, Jr.\nThe film premiered at the 2012 Toronto International Film Festival to mixed reviews, and was released in the United States a year later.\n\n", "plot": "Set in New York City, Thanks for Sharing centers around three people undergoing a 12-step process to recover from their sexual addiction.\nAdam (Mark Ruffalo) walks along the streets of New York, tempted to have sex by various advertisements and women on his way to work. Neil (Josh Gad), a doctor who is addicted to sex and masturbation, purposely grinds against a stranger in a train on the way to attend a sex addiction meeting. Mike (Tim Robbins) is a married recovering sex addict who leads the group. He sponsors Adam, who has not had sex in five years. Adam sponsors Neil. They are all at the sex addiction meeting, talking about their progress. Adam proclaims he's been 'sober' for five years, while Neil cracks jokes and admits he is only there because the court has forced him to. He goes back to masturbating the same night, and lies about being one month sober to the addiction group.\nAdam meets Phoebe (Gwyneth Paltrow) at a 'bug party' and they go out on a date. She reveals  that she is a breast cancer survivor and that her ex-boyfriend is an alcoholic; he does not tell her about his own addiction for fear that she will reject him. They begin a relationship. Dede (Alecia Moore) joins the sex addiction meetings, and reveals at her first meeting that she has been addicted to sex since she was a young girl. Neil, a doctor, is caught secretly filming under the skirt of his boss, and is fired. He then begins to take the meetings more seriously, and admits he has a problem. Meanwhile, Mike's son Danny (Patrick Fugit), a recovering drug addict, has returned home and is attempting to make amends to Mike and his mother Katie (Joely Richardson).\nPhoebe eventually finds out about Adam's sex addiction when finding an addiction token in his pocket the morning after sleeping with him. She takes some time away from him, but eventually agrees to continue their relationship. Neil talks Dede out of having sex with her abusive ex-boyfriend, and they go to a dance together. They come close to kissing, but don't. Mike and Danny get into a fight when Mike assumes Danny stole his mother's pills. Danny reveals that Mike gave Katie Hepatitis C, and confronts him about hitting him when he was a child. Mike slaps Danny, who attacks Mike and knocks Katie over; upon realizing what he has done, Danny panics and runs out of the house.\nPhoebe has become frustrated with Adam's reticence to be physical with her, and breaks it off after they have a fight. Adam sleeps with a prostitute. Dede comes over to Neil's place, and helps him clean up his house and burns his porn. She admits she's never been 'just friends' with a man before. Mike finds Katie's pills, and realizes Danny didn't steal them after all. Katie tells Mike off for \"always having to be right\", and Mike goes to find Danny. While he is out, Katie calls him to tell him Danny is in the hospital after a DUI. Mike hugs his son in the hospital, who turns out to have been sober for the past eight months. Adam invites his ex-girlfriend Becky (Emily Meade) over, and as they start out by reenacting her father issues, she then wants Adam to slap her. When he refuses, she breaks down, locks herself in the bathroom and attempts suicide. Neil takes the train to get over to Adam's and breaks down his bathroom door to rescue Becky. Adam gets sober and goes back to Phoebe, who admits she too is not perfect. Neil confronts his inappropriately sexual mother, Roberta (Carol Kane), and all the addicts celebrate their sobriety.", "cast": "Mark Ruffalo as Adam\nTim Robbins as Mike\nGwyneth Paltrow as Phoebe\nJosh Gad as Neil\nJoely Richardson as Katie\nPink as Dede (credited as Alecia Moore)\nPatrick Fugit as Danny\nCarol Kane as Roberta\nMichaela Watkins as Marney\nIsiah Whitlock, Jr. as Charles\nEmily Meade as Becky\nPoorna Jagannathan as Lili Kazhani\nOkieriete Onaodowan as Lou"}