{"_movieID": "209401", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:29:36", "summary": "Half of a Yellow Sun is a novel by Nigerian author Chimamanda Ngozi Adichie. Published in 2006 by Knopf/Anchor, the novel tells the story of the Biafran War through the perspective of the characters Olanna, Ugwu, and Richard.", "plot": "The novel takes place in Nigeria prior to and during the Nigerian Civil War (1967–70). The effect of the war is shown through the dynamic relationships of five people's lives including twin daughters of an influential businessman, a professor, a British citizen, and a houseboy. After Biafra's declaration of secession, the lives of the main characters drastically changed and were torn apart by the brutality of the civil war and decisions in their personal lives.\nThe book jumps between events that took place during the early and late 1960s, when the war took place, and extends until the end of the war. In the early 1960s, the main characters are introduced: Ugwu, a 13-year-old village boy who moves in with Odenigbo, to work as his houseboy. Odenigbo frequently entertains intellectuals to discuss the political turmoil in Nigeria. Life changes for Ugwu when Odenigbo's girlfriend, Olanna, moves in with them. Ugwu forms a strong bond with both of them, and is very loyal. Olanna has a twin sister, Kainene, a woman with a dry sense of humor, tired by the pompous company she runs for her father. Her lover Richard is an Englishman who has come to Nigeria to explore Igbo-Ukwu art.\nJumping four years ahead, trouble is brewing between the Hausa and  the Igbo people and hundreds of people die in massacres, including Olanna's beloved auntie and uncle. A new republic, called Biafra, is created by the Igbo. As a result of the conflict, Olanna, Odenigbo, their infant daughter, whom they refer to only as \"Baby\", and Ugwu are forced to flee Nsukka, which is the university town and the major intellectual hub of the new nation. They finally end up in the refugee town of Umuahia, where they suffer as a result of food shortages and the constant air raids and paranoid atmosphere. There are also allusions to a conflict between Olanna and Kainene, Richard and Kainene and Olanna and Odenigbo.\nWhen the novel jumps back to the early 1960s, we learn that Odenigbo slept with a village girl, Amala, who then had his baby. Olanna is furious at his betrayal, and sleeps with Richard in a moment of liberation. She goes back to Odenigbo and when they later learn that Amala refused to keep her newborn daughter, Olanna decides that they would keep her.\nDuring the war, Olanna, Odenigbo, Baby, and Ugwu are living with Kainene and Richard, where Kainene was running a refugee camp. Their situation is hopeless, as they have no food or medicine. Kainene decides to trade across enemy lines, but does not return, even after the end of the war a few weeks later. The book ends ambiguously, with the reader not knowing if Kainene lives."}