{"_movieID": "291264", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:18:01", "summary": "The Family Fang is a 2015 American comedy-drama film directed by Jason Bateman and written by David Lindsay-Abaire, based on the 2011 novel of the same name by Kevin Wilson. The film stars Bateman, Nicole Kidman and Christopher Walken. The film was released on April 29, 2016, by Starz Digital.", "plot": "The film opens on Baxter and Annie Fang (Jack McCarthy and Mackenzie Smith) holding hands in the back of their parents car as their father Caleb (Jason Butler Harner) dons a security guard uniform. The family enters a bank and Baxter uses a gun to rob a teller of all her lollipops. Baxter shoots his gun when Caleb rushes him, while posing as a security guard. Their mother Camille (Kathryn Hahn) pretends to be shot, and Annie grieves over her prone body. When the family gets up and leaves, Caleb gives a speech to the bank patrons about cherishing life and takes a bow.\nThe adult Annie (Nicole Kidman) is a successful actress on a film set where the director has surprised her by asking her to go topless in a scene. After initially refusing, she returns to the set without her top. A crew member snaps her photo and sells it to a tabloid. The adult Baxter (Jason Bateman) sees the photos in a convenience store. He is out of sorts after having published two novels, and he accepts a job writing about potato guns. Baxter gets drunk with his subjects and allows them to perform the William Tell trick on him, which results in him getting shot in the ear and hospitalized. The Fangs reunite due to Baxter's injury.\nCaleb enlists Annie and Baxter, whom he calls \"A and B\", into a new piece of performance art. Annie hands out fake coupons for free chicken sandwiches at an open air food court. Caleb tasks Baxter with filming the chaos that will ensue when the cashier declines to honor them and customers get mad. To his dismay, the cashier gives free sandwiches to everyone who asks for one. Caleb becomes irate, while Annie and Baxter feel that their parents have lost whatever artistic merit they used to have.\nDuring their reunion, Annie watches old tapes of the family's performance art, as well as a documentary about her parents shot by Hobart Waxman (Harris Yulin). The film captures Caleb's sophomoric and didactic performance pieces, like shooting Hobart with a crossbow. Annie also recalls another piece that featured her and Baxter performing outsider music in Central Park with songs like \"KAP (Kill All Parents)\". Camille and Caleb heckle the kids, which horrifies the small crowd of onlookers. Later, the family laughs about the piece.\nAfter a short while, Caleb and Camille disappear. Their car is found with blood on the dashboard. Annie tells the cops that the blood is fake and the disappearance is just another of Caleb's pieces. Baxter does not think it matters either way and is simply convinced that they have probably seen the last of their parents. Annie becomes obsessed with solving their disappearance.\nAnnie recalls a performance of Romeo and Juliet in her senior year of high school where Romeo could not make the performance. Baxter was tasked with standing in for him, but he balked at having to kiss his sister onstage. He reluctantly agrees to do it, but when the audience laughs at his attempts to avoid kissing Annie, she is humiliated. Baxter finally gives Annie a fully romantic kiss onstage to the horror of the principal. He fires the drama teacher, Miss Delano (Linda Emond), who reveals to Annie and Baxter that losing her job was worth it to be a part of one of Caleb and Camille's more elaborate pieces. Annie and Baxter are horrified to realize that they were unwittingly made to kiss, and that was the beginning of the end of their performances with their parents. Later, in the documentary, Caleb confesses that until he realized he could use his children as living art, he was uninterested in being a father.\nWhen the siblings are having a yard sale, they put on one of their parents CDs by a band called the Vengeful Virgins. They are stunned to hear a cover of \"KAP\", which was known only to the Fangs. They track down the teenage twin brothers in the band, and Annie interrogates them about the song while Baxter searches their house. He finds a videotape of Caleb cutting open his arm and smearing blood on the dashboard of his car. A short time later, Miss Delano comes home and reveals she is the boys' mother. Caleb enters the house behind her, and he reluctantly agrees to take Annie and Baxter to see their mother.\nCaleb and Camille reveal that they have been planning this final piece for years. Caleb has spent time living together with Miss Delano as husband and wife, and accidentally fathered the twin boys. Camille has been spending time in a remote small town, posing as a widow for several months of each year. They had each established separate identities and believed that this final piece would be a fitting end to their career. They beg Annie and Baxter to help them keep their secret. The siblings are bitter over the betrayal but agree to hide the truth. The film shows Annie and Baxter seemingly happier and more well-balanced after letting go of their parents."}