{"_movieID": "350", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:34", "summary": "The Devil Wears Prada is a 2006 American comedy-drama film directed by David Frankel and produced by Wendy Finerman. The screenplay, written by Aline Brosh McKenna, is based on Lauren Weisberger's 2003 novel of the same name. The film adaptation stars Meryl Streep as Miranda Priestly, a powerful fashion magazine editor, and Anne Hathaway as Andrea \"Andy\" Sachs, a college graduate who goes to New York City and lands a job as Priestly's co-assistant. Emily Blunt and Stanley Tucci co-star as co-assistant Emily Charlton and art director Nigel, respectively. Adrian Grenier, Simon Baker, and Tracie Thoms play key supporting roles.\nIn 2003, 20th Century Fox bought the rights to a film adaptation of Weisburger's novel before it was completed for publication. However, the project was not greenlit until Streep was cast in the lead role. Principal photography ran for 57 days, primarily taking place in New York from October 2005 to December later that year. Additional filming also occurred in Paris.\nAfter premiering at the LA Film Fest on June 22, 2006, the film was theatrically released in the United States on June 30. The film received positive reviews from critics, with Streep's performance being singled out for praise. This earned her many award nominations, including an Academy Award nomination for Best Actress, as well as the Golden Globe Award for Best Actress in a Comedy or Musical. Blunt also drew favorable reviews and nominations for her performance. The film grossed over $300 million worldwide, against its $41 million budget, and was the 12th highest-grossing film worldwide in 2006.\nAlthough the film is set in the fashion world, most designers and other fashion notables avoided appearing as themselves for fear of displeasing US Vogue editor Anna Wintour, who is widely believed to have been the inspiration for Priestly. Still, many allowed their clothes and accessories to be used in the film, making it one of the most expensively costumed films in history. Wintour later overcame her initial skepticism, saying she liked the film and Streep in particular.", "plot": "Andy is an aspiring journalist fresh out of Northwestern University. Despite her ridicule for the shallowness of the fashion industry, she lands a job as junior personal assistant to Miranda Priestly, the editor-in-chief of Runway magazine. Andy plans to put up with Miranda's excessive demands and humiliating treatment for one year in the hopes of getting a job as a reporter or writer somewhere else.\nAt first, Andy fumbles with her job and fits in poorly with her gossipy, fashion-conscious co-workers, especially Miranda's senior assistant, Emily Charlton. However, she does find an ally in art director Nigel, and gradually learns her responsibilities and begins to dress more stylishly to show her effort and commitment to the position. She also meets an attractive young writer, Christian Thompson, who offers to help her with her career. As she spends increasing amounts of time at Miranda's beck and call, problems arise in her relationships with her college friends and her live-in boyfriend, Nate, a chef working his way up the career ladder.\nMiranda is impressed by Andy and allows her to be the one to bring the treasured \"Book\", a mock-up of the upcoming edition, to her home, along with her dry cleaning. She is given instructions by Emily about where to leave the items and is told not to speak with anyone in the house. Andy arrives at Miranda's home only to discover that the instructions she received are vague. As she tries to figure out what to do, Andy begins to panic. Miranda's twins, Caroline and Cassidy, falsely tell her she can leave the book at the top of the stairs just as Emily has done on many occasions. At the top of the stairs, Andy interrupts Miranda and her husband having an argument. Mortified, Andy leaves the book and runs out of the house.\nThe next day, Miranda tells Andy that she wants the new unpublished Harry Potter book for her daughters and, if Andy cannot find a copy, she will be fired. Andy desperately attempts to find the book and nearly gives up, but ultimately obtains it through Christian's contacts. She surprises Miranda by not only finding the book but having copies sent to the girls at the railway station, leaving no doubt that she accomplished Miranda's \"impossible\" task, thus saving her job. Andy gradually begins to outperform Emily at her job, and slowly but surely becomes more glamorous and begins aligning herself, unwittingly at first, to the Runway philosophy.\nOne day, Andy saves Miranda from being embarrassed at a charity benefit, and Miranda rewards her by offering to take her to Paris for Fashion Week in the fall instead of Emily. Andy hesitates to take this privilege away from Emily, but is forced to accept the offer after being told by Miranda that she will lose her job if she declines. Andy tries to tell Emily on her way to work. Focused more on the phone conversation than on her surroundings, Emily walks out in front of a car while crossing the street and is struck, sustaining a broken leg and other injuries. Andy later breaks the news to a hospitalized Emily.\nWhen Andy tells Nate she is going to Paris, he is angered by her refusal to admit that she has become what she once ridiculed, and they break up. Once there, Miranda, without makeup, opens up to Andy about the effect Miranda's impending divorce will have on her daughters. Later that night, Nigel tells Andy that he has accepted a job as Creative Director with rising fashion designer James Holt at Miranda's recommendation. Andy finally succumbs to Christian's charms and, after spending the night with him, learns from him about a plan to replace Miranda with Jacqueline Follet as editor of Runway. Despite the suffering she has endured at her boss's behest, she attempts to warn Miranda.\nAt a luncheon later that day, however, Miranda announces that it is Jacqueline instead of Nigel who will leave Runway for Holt. Nigel remarks to a stunned Andy that, though disappointed, he has to believe that his loyalty to Miranda will one day pay off. Later, when Miranda and Andy are being driven to a show, she explains to a still-stunned Andy that she was grateful for the warning, but already knew of the plot to replace her and sacrificed Nigel to keep her own job. Pleased by this display of loyalty, she tells Andy that she sees a great deal of herself in her. Andy, repulsed, says she could never do that to anyone. Miranda replies that she already did, stepping over Emily when she agreed to go to Paris. When they stop, Andy gets out and throws her cell phone into the fountain of the Place de la Concorde, leaving Miranda, Runway, and fashion behind.\nSometime later, Andy meets up with Nate, who is moving to Boston because he got a new job as the sous chef of a restaurant. Andy apologizes to Nate, and they joke about grilled cheese in Boston, leaving the future of their relationship uncertain. The same day, Andy is interviewed and is accepted to work at a major New York publication company. The editor recounts how he called Runway for a reference on Andy, and got a response from Miranda herself. Miranda described Andy as \"her biggest disappointment\"—and said that the editor would be \"an idiot\" if he did not hire her. Emily is offered her Paris wardrobe by Andy and Emily warns the new assistant that she has big shoes to fill. Andy passes the Runway office building and sees Miranda get into a car. Andy gives a wave, but Miranda does not acknowledge her. Andy is used to this and instead walks further into the crowd. Once inside the car, however, Miranda smiles and then orders her chauffeur to drive."}