{"_movieID": "354861", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:45:32", "summary": "Father Figures (known as Who's Your Daddy? in the United Kingdom) is a 2017 American comedy film directed by Lawrence Sher (in his directorial debut), written by Justin Malen, and starring Owen Wilson, Ed Helms, J. K. Simmons, Katt Williams, Terry Bradshaw, Ving Rhames, Harry Shearer, June Squibb, Christopher Walken, and Glenn Close. The film follows two adult brothers who set out to find their biological father.\nPrincipal photography began on October 5, 2015, in Atlanta, and the film was released in the United States on December 22, 2017, by Warner Bros. Pictures. It was poorly received by critics, who called it devoid of \"energy or purpose\" and grossed $25 million against its $25 million budget.", "plot": "Kyle (Owen Wilson) and Peter Reynolds (Ed Helms) are fraternal twins who were raised by their mother Helen (Glenn Close) as their father died before they were born. Kyle is dating his pregnant girlfriend Kaylani (Jessica Gomes) and is wealthy from royalties for his image on BBQ sauce labels. Peter is a divorced proctologist with a teenage son (Zachary Haven) who resents him.\nShortly after Helen's wedding to Gene (Harry Shearer), Peter recognizes an actor on Law and Order: SVU from photos of his supposed father and confronts Helen. Helen explains that she had been promiscuous at the time of their conception, and did not want their father involved. When they keep pressing, Helen reveals that their father is Terry Bradshaw.\nThe brothers fly to Florida to meet Bradshaw, who they encounter at a signing event. Bradshaw is excited to have them as sons. As Bradshaw recounts stories with former teammate Rod Hamilton (Ving Rhames), the brothers realize that Bradshaw had been in Australia at the time of their conception, and thus isn't their father. Bradshaw points out that Roland Hunt, a New York investor, also dated Helen.\nAs they travel north, Kyle finds that his BBQ sauce royalties deal is ending. Arriving at what they assumed was Hunt's office, they find a boarded-up house. Hunt (J.K. Simmons) confronts them at gunpoint until they reveal why they were looking for him. He invites them inside, but expresses his dissatisfaction at having children in front of his mother (June Squibb). As the brothers prepare to depart, they offer to help their father with his repossession service. As Hunt breaks into a Ferrari, it becomes clear that he is a criminal. As the brothers argue with the owners of the Ferrari, Hunt flees only to feel remorse for abandoning his sons. The brothers steal the Ferrari and hit Hunt who was returning to them. At the hospital, the brothers find that they are incompatible to give Hunt blood, indicating that he cannot be their father. Hunt realizes that he was in prison at the time of their conception, but directs them to find Sparkly P, another of Helen's ex-boyfriends.\nUnable to find Sparkly P, the brothers start driving for home. Along the way, they pick up a hitchhiker (Katt Williams), who provides advice as they travel. After accidentally parking on railroad tracks, Peter and the hitchhiker narrowly escape getting hit by a train, while Kyle is stuck in the car and presumably killed. Initially devastated, Peter is surprised to see Kyle walk away from the car, only to be punched by Kyle for abandoning him. As they are being treated, police officers recognize the name Sparkly P as the nickname of Patrick O'Callaghan (Jack McGee), a former police officer. The brothers stop at a hotel, where Peter meets and seduces Sarah (Katie Aselton).\nThe brothers arrive at Patrick O'Callaghan's house in time for his wake. Patrick's daughter is invited to speak, and Peter realizes that it is Sarah, his possible half-sister. Disgusted, Peter runs out of the wake. Patrick's twin brother Kevin (Jack McGee) explains that Patrick could not be the father as he had been celibate during that period. Though Kevin directs them to another of Helen's ex-boyfriends, Dr. Walter Tinkler (Christopher Walken), who is a family friend and veterinarian in their home town.\nKyle and Peter confront Dr. Tinkler. After being called down, Helen arrives and reveals that she is not their biological mother. She and Tinkler had been working at a shelter when a young woman came in and gave birth. The woman died during childbirth, and Helen chose to adopt Kyle and Peter instead of having them separated by adoption and Helen also reveals she never knew their father at all. The brothers are happy to have learned their history.\nA year later, Kyle, Peter, and Helen are on vacation in Maui. Peter is now dating Sarah and his son respects him. Kyle and Kaylani have twin daughters. The brothers have gone into business together and created an app that provides advice from the universe spoken by the hitchhiker.", "cast": "Owen Wilson as Kyle Reynolds, Peter's brother. A laid-back model who made millions by selling his image to a BBQ sauce company, he is resented by Peter for his life being so easy.\nEd Helms as Peter Reynolds, Kyle's brother and a proctologist. He is divorced and facing a mid-life crisis because his teenage son, Ethan, hates him. Having never known his own father, Peter is unsure of how to deal with his son, inspiring him to attempt to find his biological father.\nJ. K. Simmons as Roland Hunt, a former financial investor, reclusive criminal, and one of the potential fathers of Kyle and Peter.\nKatt Williams as a hitchhiker who Kyle and Peter meet on their journey.\nTerry Bradshaw as himself, a retired football player and one of the potential fathers of Kyle and Peter.\nVing Rhames as Rod Hamilton, a friend and ex-teammate of football player Bradshaw.\nHarry Shearer as Gene, Helen's new husband.\nJune Squibb as Mrs. Hunt, Roland Hunt's mother.\nChristopher Walken as Dr. Walter Tinkler, a veterinarian and one of the potential fathers of Kyle and Peter.\nGlenn Close as Helen Baxter, Kyle and Peter's eccentric mother who is revealed to have been heavily sexually active in the mid 1970s, and appears not to know who the twins' biological father is.\nJack McGee as Patrick O'Callaghan, a police officer, the father of Sarah, and one of the potential fathers of Kyle and Peter who was dead before Kyle and Peter arrived.\nJack McGee also portrays Kevin O'Callaghan, Patrick's twin brother and the uncle of Sarah.\nRyan Cartwright as Liam O'Callaghan, one of Patrick's sons.\nRyan Gaul as Sean O'Callaghan, one of Patrick's sons.\nAli Wong as Ali, Dr. Tinkler's nurse.\nRetta as Annie, Helen and Gene's wedding planner.\nJessica Gomes as Kaylani, Kyle's girlfriend\nKatie Aselton as Sarah O’Callaghan, the daughter of Patrick, niece of Kevin, and brother of Kevin and Liam.\nDebra Stipe as Karen Bradshaw\nZachary Haven as Ethan, Peter's teenage son who hates him.\nRobert Walker Branchaud and B'nard Lewis as police officers who direct Kyle and Peter to where Patrick lives."}