{"_movieID": "72545", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:26:53", "summary": "Journey 2: The Mysterious Island is a 2012 American science fiction comedy adventure film directed by Brad Peyton and produced by Beau Flynn, Tripp Vinson and Charlotte Huggins. It is the sequel to Journey to the Center of the Earth (2008). Following the first film, the sequel is based on another Jules Verne novel, this time The Mysterious Island. The film stars Dwayne \"The Rock\" Johnson, Michael Caine, Josh Hutcherson, Vanessa Hudgens, Luis Guzmán, and Kristin Davis. The story was written by Richard Outten, Brian Gunn and Mark Gunn, and the screenplay by Brian and Mark Gunn. Journey 2: The Mysterious Island was released in cinemas on February 10, 2012 by Warner Bros. Pictures, New Line Cinema and Walden Media to mixed reviews, but became a box office success with a worldwide gross of nearly $335 million, surpassing its predecessor. Journey 2: The Mysterious Island was released on DVD/Blu-ray on June 5, 2012.", "plot": "It has been four years since the events of the first movie. Seventeen-year-old Sean Anderson (Josh Hutcherson) is caught by the police after a brief chase on his dirtbike which ends with him driving into a swimming pool while trying to evade them. Minutes later, his stepfather Hank (Dwayne Johnson) arrives when a police officer (Stephen Caudill), who is friends with Hank tells him that Sean has illegally broken into a remote satellite research center and that he has talked Mr. and Mrs. McGillicutty (the owners of the swimming pool) out of pressing charges. Hank takes Sean home where his mother Elizabeth (Kristin Davis) is not pleased with his actions and is unhappy that he and Hank don't get along well.\nHank discovers that Sean trespassed in the satellite research center in order to boost the signal of a code Sean received from someone he suspects is Alexander Anderson, Sean's grandfather who had been missing for two years. Wanting to bond with his stepson, the next day Hank helps Sean decipher the code of Jules Verne characters which lead to three books: Treasure Island, Gulliver's Travels, and Verne's own Mysterious Island. Using the books' individual island maps, Hank suspects they are books about the same island and uses a backlight in order to make them all one completed land mass with the coordinates to its location. Hank manages to convince Liz to let both of them go in search of the island, in the slight hope of proving Sean wrong, that there is no so-called mysterious island there.\nThey arrive in Palau where they need transportation to travel to this dangerous part of the ocean. A Palauan helicopter tourism guide Gabato (Luis Guzman) and his daughter Kailani (Vanessa Hudgens), whom Sean develops an immediate crush on, agree to fly them out to the island for $3,000, but the helicopter gets caught in a hurricane and they crash into the Pacific, waking up on the island.\nMoving into the island, they discover one of the laws of the Mysterious Island is that, traditionally small animals become large and large animals become small (inspired by Lilliput from Gulliver's Travels). The crew discovers tiny elephants and giant butterflies, which are the first creatures they come across on the island. The group decides to explore further into the island.\nAfter leaving that part of the island they come across an egg clutch belonging to a giant frilled lizard, they are then saved by Sean's grandfather Alexander (Michael Caine) who takes them to a large hut he'd built from the wreckage of the ship that brought him to the island, called the Blue-Eyed Lucy. He has a working radio, but due to the positioning of the communications satellite, it will be two weeks before they can call for help.\nThe next morning, Alexander leads the group to the lost city of Atlantis, which is periodically submerged in the ocean for extended times, and he also calculates that the island sinks once every 70 years. However, Hank discovers the sea water appearing from the ground is the evidence that Alexander's calculations are wrong, and that the island will sink in a couple of days. Their only means of salvation seems to be the legendary Nautilus (Captain Nemo's submarine), hidden somewhere on the island. \nKailani enters Nemo's crypt and finds his journal, which shows the whereabouts of the ship in a cave at Poseidon's Cliffs. They decide to go to that cave through the heart of the island.\nThey mount giant bees in order to fly over a high ridge and makeup time, but encounter large birds (spectacular bee-eaters, to be specific) that try to devour the bees. After saving Kailani's life, Sean crashes and dislocates his ankle. Hank and Alexander patch up Sean's ankle the best way they can. Afterward, they have a bonding moment when Hank sings his rendition of \"What a Wonderful World\" to ease Sean's pain.\nThe next morning, the water has risen greatly and Hank deduces that the island will sink in a matter of hours, not days. Gabato is missing, having gone toward the island's golden volcano (inspired by Treasure Island) in search of gold to give his daughter a better life. While Alexander and Kailani go after him, Sean and Hank head for Poseidon's Cliffs to look for the Nautilus. Alexander also finally calls Hank by his preferred name, as up to that point he only called him \"Henry\", and the family makes up.\nTo deal with the rising water after finding the Nautilus' cave underwater, Sean and Hank create makeshift oxygen tanks and dive down fifty feet in order to get to the Nautilus and are nearly killed by a giant electric eel. They are unable to power the ship, however, because the vessel's batteries have run down due to being 140 years old. They engineer a way to power the submarine from the electric eel's electricity.\nMeanwhile, Kailani and Alexander find Gabato and convince him to escape with them instead of trying for the golden volcano. They head towards the shore as the island begins to suddenly and violently rip itself apart. The golden volcano starts to erupt violently, pouring lava all over the area. Highly flammable lava bombs are thrown from the golden volcano into the air and suddenly land on the sinking island's debris. Sean and Hank use a harpoon to get an electrical jump start from the electric eel swarming around them and they are able to power the machine, just in time to pick up the others who had fallen into the water. Gabato pilots the submarine out of harm's way while Hank and Sean fire torpedoes into the path of falling island debris. As they clear the dangers, Kailani finally kisses Sean for his bravery.\nSix months later, Kailani and Gabato are well off. Gabato is now running the most popular tourist attraction on Palau providing tours aboard the Nautilus and Kailani is attending college. Kailani goes to visit Sean on his birthday. While they are celebrating, Alexander shows up with a book for Sean's birthday present. Sean opens it to find Jules Verne's From the Earth to the Moon, Alexander's suggestion for a new adventure with the family, to which Liz protests. Hank replies \"What could possibly go wrong? It's only the moon!\"\nDuring the credits, the mini-elephants from the earlier scene are swimming underwater over Atlantis.", "cast": "Dwayne Johnson as Hank Parsons, Sean's stepfather and a former Navy code breaker.\nJosh Hutcherson as Sean Anderson, Hank's stepson who wants to find his missing grandfather on the Mysterious Island.\nMichael Caine as Alexander Anderson, Sean's grandfather also the father of Max and Trevor Anderson.\nVanessa Hudgens as Kailani Laguatan, Sean's love interest who is part of the father-daughter tour guide.\nLuis Guzman as Gabato Laguatan, Kailani's father, who is part of the father-daughter tour guide team.\nKristin Davis as Elizabeth Anderson-Parsons, Sean's mother and Hank's wife.\nAnna Colwell as Jessica\nStephen Caudill as Cop\nBranscombe Richmond as Tour Guide\nWalter Bankson as Hockey Player"}