{"_movieID": "147441", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:29:22", "summary": "Exodus: Gods and Kings is a 2014 epic biblical film directed and produced by Ridley Scott. An international co-production between the United States, the United Kingdom, and Spain, it was produced by Peter Chernin, Jenno Topping, Michael Schaefer, and Mark Huffam with music by Alberto Iglesias and written by Adam Cooper, Bill Collage, Jeffrey Caine, and Steven Zaillian. The film stars Christian Bale, Joel Edgerton, John Turturro, Aaron Paul, Ben Mendelsohn, María Valverde, Sigourney Weaver, Ghassan Massoud, Indira Varma, Golshifteh Farahani, and Ben Kingsley. It is inspired by the biblical episode of The Exodus of the Hebrews from Egypt led by Moses and related in the Book of Exodus.\nThe film was released on December 12, 2014 by 20th Century Fox. It received generally negative reviews from critics and was a commercial disappointment, earned $268 million worldwide.", "plot": "In 1300 BC, Moses, a general and accepted member of the Egyptian royal family, prepares to attack an encamped Hittite army with Prince Ramesses at Kadesh. A High Priestess divines a prophecy from animal intestines, which she relates to Ramesses's father, Seti I. She tells the two men of the prophecy, in which \"a leader\" (either Moses or Ramesses) will be \"saved\" and the savior \"will someday lead\". During the battle, Moses saves Ramesses's life, leaving both men troubled. Later, Moses is sent to the city of Pithom to meet with the Viceroy Hegep, who oversees the Hebrew slaves. Upon his arrival, he encounters the slave Joshua and saves him from a vicious lashing. Moses is appalled by the horrific conditions the slaves must toil in. Afterward, Moses meets Nun, who informs him of his true lineage; he is the child of Hebrew parents who was sent by his sister Miriam to be raised by Pharaoh's daughter. Moses is stunned at the revelation and leaves angrily. However, two Hebrews overhear Nun's story and report their discovery to Hegep.\nSeti dies soon after, and Ramesses becomes the new Pharaoh (Ramesses II). Hegep reveals Moses's true lineage to Ramesses, but Ramesses is unconvinced. At the urging of Queen Tuya, he interrogates the servant Miriam, who denies being Moses's sister. When Ramesses threatens to cut off her arm, Moses says \"yes\", he is a Hebrew. Although Tuya wants Moses killed, Ramesses, still unwilling to believe the story, exiles him instead. Before leaving Egypt, Moses meets with his adopted mother and Miriam, who refer to him by his birth name of Moshe. Following a journey into the desert, Moses comes to Midian where he meets Zipporah and her father, Jethro. Moses becomes a shepherd, marries Zipporah, and has a son, Gershom.\nYears later, Moses is injured in a rockslide. He encounters a burning bush and a boy, a manifestation of God of Abraham.  While recovering, Moses reveals his past to Zipporah and reveals what God has asked him to do. This drives a wedge between the couple, but Moses leaves anyway. In Egypt, Moses reunites with Nun and Joshua, as well as meeting his brother Aaron for the first time. Moses confronts Ramesses, demanding the Hebrews be released from servitude. Ramesses refuses to listen, insisting that freeing them is economically impossible. Upon Moses threatening Ramesses's life, Ramesses orders Moses's death, as well as killing random Hebrew families until Moses is found. Using his military skills, Moses trains the slaves and leads them in an insurgency, prompting Ramesses to retaliate harshly. God's manifestation appears to Moses and explains that ten plagues will affect Egypt. The first nine plagues deal massive damage to Egypt and its people, but Ramesses does not back down, even oppressing his people further to maintain his position. Moses is horrified to learn from God that the tenth plague will be the death of all firstborn children but follows through with the plan. The Hebrews protect themselves by covering their doors with lambs' blood as instructed by Moses, while all of Egypt's firstborn children die, including Ramesses's infant son. Ramesses, devastated, surrenders, allowing the Hebrews to leave.\nDuring the exodus from Egypt, the Hebrews follow Moses's original path through the desert towards the Red Sea. Still grieving for his son, Ramesses assembles his army and gives chase, intending to destroy the Hebrews. After making their way through a dangerous mountain pass, Moses and the Hebrews arrive at the edge of the sea, uncertain about what to do. In despair, Moses flings his sword into the sea, which recedes, clearing a path to the opposite side. Ramesses and his army continue the pursuit, but Moses stays behind to confront them. The Red Sea reverts to its normal state, drowning the majority of the Egyptians (crossing the Red Sea). Moses survives and rejoins the Hebrews. Ramesses also survives, but is distraught and stunned over the destruction of his army and empire, and with no way to return to Egypt. Moses leads the Hebrews back to Midian, where he reunites with Zipporah and Gershom. At Mount Sinai, Moses transcribes the Ten Commandments. Years later, an elderly Moses riding with the Ark of the Covenant sees God's manifestation walking with the Hebrews through the desert.", "cast": "Christian Bale as Moses – The adoptive son of Bithiah, the son of Amram and Jochebed, brother of Aaron and Miriam, the husband of Zipporah and father of Gershom, and a descendant of Levi (son of Jacob and Leah)\nJoel Edgerton as Ramesses II – The son of Seti I and Queen Tuya, and the husband of Nefertari\nJohn Turturro as Seti I – The father of Ramesses II, the son of Ramesses I (Paramessu) and Queen Tuya's husband\nAaron Paul as Joshua – The son of Nun, and a descendant of Joseph (a son of Jacob and Rachel) and his son Ephraim\nBen Mendelsohn as Viceroy Hegep\nSigourney Weaver as Tuya – the mother of Ramesses II and Seti I's wife\nBen Kingsley as Nun – Joshua's father, and a descendant of Joseph (a son of Jacob and Rachel) and his son Ephraim\nMaría Valverde as Zipporah – The wife of Moses and the mother of Gershom, and a daughter of Jethro\nIsaac Andrews as Malak – The mysterious little boy who serves as a manifestation of the God of Abraham.\nHiam Abbass as Bithiah – The adoptive mother of Moses, Seti I's sister, Ramesses II's aunt, daughter of Ramesses I (Paramessu)\nIndira Varma as High Priestess\nEwen Bremner as Expert\nGolshifteh Farahani as Nefertari – The wife of Ramesses II\nGhassan Massoud as Paser, Ramesses II's Grand Vizier\nTara Fitzgerald as Miriam – The sister of Moses and Aaron, only daughter of Amram and Jochebed, and a descendant of Levi\nAndrew Tarbet as Aaron – The brother of Moses and Miriam, son of Amram and Jochebed, and a descendant of Levi\nKevork Malikyan as Jethro – Zipporah's father, and Moses's father-in-law and Gershom's grandfather\nAnton Alexander as Dathan – The son of Eliab, and a descendant of Reuben (a son of Jacob and Leah)\nDar Salim as Khyan"}