{"_movieID": "11324", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:52:18", "summary": "Shutter Island is a 2010 American neo-noir psychological thriller film directed by Martin Scorsese and written by Laeta Kalogridis, based on Dennis Lehane's 2003 novel of the same name. Leonardo DiCaprio stars as U.S. Marshal Edward \"Teddy\" Daniels who is investigating a psychiatric facility on Shutter Island after one of the patients goes missing. Mark Ruffalo plays his partner officer, Ben Kingsley is the facility's lead psychiatrist, Max von Sydow is a German doctor and Michelle Williams is Daniels's wife. Released on February 19, 2010, the film received mostly positive reviews from critics, was chosen by National Board of Review as one of the top ten films of 2010 and grossed over $294 million worldwide.\nThe film is also noteworthy for its soundtrack using classical (Mahler) and mainly modern classical music by composers such as Penderecki, Ligeti, Cage, Ingram Marshall, and others.", "plot": "In 1954, U.S. Marshals Edward \"Teddy\" Daniels and his new partner Chuck Aule travel to the Ashecliffe Hospital for the criminally insane on Shutter Island in Boston Harbor. They are investigating the disappearance of patient Rachel Solando, who was incarcerated for drowning her three children. Their only clue is a cryptic note found hidden in Solando's room: \"The law of 4; who is 67?\" The two U.S. Marshals arrive just before a massive storm hits the island, preventing their return to the mainland for a few days.\nDaniels and Aule find the staff confrontational. Dr. John Cawley, the lead psychiatrist, refuses to turn over records, and they learn that Solando's doctor Lester Sheehan left the island on vacation immediately after Solando disappeared. They are given access to the hospital, but they are told that Ward C is off limits and that the lighthouse has already been searched. While being interviewed, one patient secretly writes the word \"RUN\" in Daniels' notepad. Daniels starts to have migraine headaches from the hospital's atmosphere and experiences waking visions of his involvement in the Dachau liberation reprisals. He has disturbing dreams of his wife Dolores Chanal, who was killed in a fire set by a local arsonist named Andrew Laeddis. In one instance, she tells him that Solando is still on the island somewhere—as is Laeddis, who everyone claims was never there to begin with. Daniels later explains to Aule that locating Laeddis was an ulterior personal motive for taking the case.\nDuring their investigation, Daniels and Aule find that Solando has abruptly resurfaced with no explanation as to her former whereabouts or how she escaped. This prompts Daniels to break into the restricted Ward C. There he encounters George Noyce, a patient in solitary confinement. Noyce warns him that the doctors are performing questionable experiments on the patients, some of whom are taken to the lighthouse to be lobotomized. Noyce warns Daniels that everyone else on the island is playing an elaborate game specifically designed for Daniels—including his partner Aule.\nDaniels regroups with Aule and is determined to investigate the lighthouse. They become separated while climbing the cliffs toward it, and Daniels later sees what he believes to be Aule's body on the rocks below. By the time he climbs down, however, the body has disappeared, but he finds a cave where he discovers a woman in hiding who claims to be the real Rachel Solando. She states that she is a former psychiatrist at the hospital who discovered the experiments with psychotropic medication and trans-orbital lobotomy in an attempt to develop mind control techniques. Before she could report her findings to the authorities, however, she was forcibly committed to Ashecliffe as a patient. Daniels returns to the hospital, but finds no evidence of Aule ever being there.\nDaniels is convinced that Aule was taken to the lighthouse; he attacks a guard, steals his rifle, and proceeds to break in to the lighthouse only to discover Cawley calmly waiting there for him. Cawley explains that Daniels is actually Andrew Laeddis, their \"most dangerous patient\" incarcerated in Ward C for murdering his manic depressive wife Dolores Chanal after she drowned their children. Edward Daniels and Rachel Solando are anagrams of Andrew Laeddis and Dolores Chanal; furthermore, the little girl from Laeddis's recurring dreams is his daughter Rachel.\nAccording to Cawley, the events of the past several days have been designed to break Laeddis's conspiracy-laden insanity by allowing him to play out the role of Daniels. The hospital staff were part of the test, including Dr. Sheehan posing as Aule and a nurse posing as Rachel Solando. The migraines that Laeddis suffered were withdrawal symptoms from his medication, as were the hallucinations of the \"real Rachel Solando\". Overwhelmed, Laeddis faints.\nLaeddis awakens in the hospital under the watch of Cawley and Sheehan. When questioned, he tells the truth in a coherent manner, which satisfies the doctors as a sign of progression. Nevertheless, Cawley notes that they have achieved this state nine months before but Laeddis quickly regressed, and further warns that this will be his last chance to redeem himself; otherwise, they will have to lobotomize him for safety reasons, citing how he previously attacks and almost kills Noyce for calling him by his real name.\nSome time later, Laeddis relaxes on the hospital grounds with Dr. Sheehan, but he calls him \"Chuck\" and says that they need to leave the island. Sheehan shakes his head to an observing Cawley, who gestures to the orderlies. Laeddis asks Dr. Sheehan if it is worse to live as a monster or die as a good man. With Sheehan looking at him in surprise and shock, Laeddis calmly gets up and walks towards the orderlies. They leave together, presumably to the lobotomy procedure."}