{"_movieID": "11778", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:48", "summary": "The Deer Hunter is a 1978 American epic war drama film co-written and directed by Michael Cimino about a trio of steelworkers (Americans of Russian origin) whose lives were changed forever after they fought in the Vietnam War. The three soldiers are played by Robert De Niro, Christopher Walken, and John Savage, with John Cazale (in his final role), Meryl Streep, and George Dzundza playing supporting roles. The story takes place in Clairton, Pennsylvania, a small working class town on the Monongahela River south of Pittsburgh, and in Vietnam.\nThe film was based in part on an unproduced screenplay called The Man Who Came to Play by Louis Garfinkle and Quinn K. Redeker, about Las Vegas and Russian roulette. Producer Michael Deeley, who bought the script, hired writer/director Michael Cimino who, with Deric Washburn, rewrote the script, taking the Russian roulette element and placing it in the Vietnam War. The film went over-budget and over-schedule, and ended up costing $15 million. The scenes depicting Russian roulette were highly controversial after the film's release. EMI Films, who produced the film, released the film internationally while Universal Pictures handled its distribution in North America. \nThe film received critical acclaim from critics and audiences, with praise going towards Cimino's direction, the performances of its cast, particularly from De Niro, Walken, and Streep, screenplay, realistic themes and tones, and cinematography. It was also successful at the box office, grossing $49 million. At the 51st Academy Awards, it was nominated for nine Academy Awards, and won five including Best Picture, Best Director for Cimino, Best Supporting Actor for Walken, Best Sound, and Best Film Editing. The film marked Meryl Streep's first Academy Award nomination (for Best Supporting Actress); she would go on to become the most nominated actor in history. Considered one of the best films ever made, it was selected for preservation in the United States National Film Registry by the Library of Congress in 1996 as being \"culturally, historically, or aesthetically significant\", and was named the 53rd greatest American film of all time by the American Film Institute in 2007 in their 10th Anniversary Edition of the AFI's 100 Years...100 Movies list.", "plot": "In the small working class town of Clairton, Pennsylvania in late 1967, steel workers Mike Vronsky (Robert De Niro), Steven Pushkov (John Savage) and Nick Chevotarevich (Christopher Walken), with the support of their friends and co-workers Stan (John Cazale) and Peter \"Axel\" Axelrod (Chuck Aspergen) and local bar owner and friend John Welsh (George Dzundza), prepare for two rites of passage: marriage and military service. Mike is a serious but unassuming leader; Steven the groom-to-be, pecked-at by his mother (Shirley Stoler); and Nick the introspective man who loves deer hunting.\nBefore the trio ships out, Steven and his girlfriend Angela (Rutanya Alda) marry in a Russian Orthodox wedding. Mike works to control his feelings for Nick's girlfriend Linda (Meryl Streep). At the wedding reception held at the local VFW hall, the guys drink, dance, sing, and enjoy the festivities, but then notice a soldier in a U.S. Army Special Forces uniform. Mike attempts to ask what Vietnam is like, but the soldier ignores him. After Mike explains that he, Steven, and Nick are going to Vietnam, the Green Beret raises his glass and says: \"Fuck it\". After being restrained from starting a fight, Mike goes back to the bar and raises his glass and toasts him with: \"Fuck it!\" The soldier glances over at Mike and grins.\nLater, Steven and Angela drink from conjoined goblets - a traditional part of the Orthodox wedding ceremony. Superstition asserts that, if they drink without spilling any wine, they will have good luck for life. No one notices two drops of blood-red wine spill on her wedding gown. After Linda catches the bride's bouquet, Nick asks her to marry him and she agrees. Later that night, a drunken Mike runs through the town, stripping himself naked along the way. After Nick chases him down, he begs Mike not to leave him \"over there\" if anything happens in combat. The next day, Mike, Nick, Stan, John and Axel go deer hunting one last time. Mike is exasperated by his friends, especially Stan, who drinks and clowns, showing little respect for the ritual of hunting, which to Mike is a nearly sacred experience. Only Nick understands Mike's attitude, but he is more indulgent toward his friends. Mike goes hunting afterwards and kills a deer with one clean shot.\nThe friends return to Welsh's bar, with Michael's deer strapped to the hood of the car. They enter rambunctiously, spraying beers over each other and singing loudly. Welsh then makes his way to the piano and begins playing Chopin's Nocturne No. 6 Op. 15-3.\nIn Vietnam, U.S. helicopters attack a village. An unconscious Mike (now a Staff Sergeant in the Special Forces) wakes up to see an NVA soldier shoot a woman carrying a baby. Mike kills him with a flamethrower. Meanwhile, a unit of UH-1 \"Huey\" helicopters drops off several U.S. infantrymen, Nick and Steven among them. Mike, Steven and Nick unexpectedly find each other just before they are captured and held in a prisoner of war camp. For entertainment, the guards force the prisoners to play Russian roulette, gambling on the outcome. All three friends are forced to play. Steven plays against Mike, who offers moral support, but Steven breaks down and points the gun upwards while pulling the trigger, grazing himself with the bullet when it discharges. As punishment, the guards put him into an underwater cage full of rats and dead bodies. Mike and Nick hatch a plan to escape by playing against each other, with Mike convincing the guards to let them play Russian roulette with three bullets in the gun. After a tense match, they kill their captors and escape.\nAfter killing the guards, Mike rescues Steven. The three float downriver on a tree limb. An American helicopter finds them, but only Nick is able to climb aboard. The weakened Steven falls back into the water, and Mike plunges in the water to rescue him. Mike helps Steven to reach the river bank, but Steven's legs are broken, so Mike carries him through the jungle to friendly lines. Approaching a caravan of locals escaping the war zone, Mike stops a South Vietnamese military truck and places the wounded Steven on it, asking the soldiers to take care of him.\nNick recuperates in a military hospital in Saigon with no knowledge of his friends, having suffered some form of stress-induced amnesia. After being released, he goes AWOL and aimlessly stumbles through the red-light district at night. He encounters Julien Grinda, a Frenchman, outside a gambling den where men play Russian roulette for money. Grinda entices the reluctant Nick to participate and leads him into the den. Mike is present in the den, watching the game, but the two friends do not notice each other at first. When Mike does see Nick, he is unable to get his attention. When Nick is introduced into the game, he grabs the gun, fires it at the current contestant, and then again at his own temple, causing the audience to riot in protest. Grinda hustles Nick outside to his car to escape the angry mob. Mike cannot catch up with them as they speed away.\nBack in the U.S., Mike maintains a low profile. He tells a cab driver to drive past the house where all his friends are waiting, as he is embarrassed by the fuss Linda and the others have made, by arranging a welcome home party for him. He visits Linda the following day and grows close to her, but only because of the friend they both think they have lost. Mike goes to visit Angela at Steven's mother's home. Angela is barely responsive. When asked by Mike about Steven's whereabouts, she writes a phone number on a scrap of paper, which leads Mike to the local VA hospital where Steven has been for several months. Mike goes hunting with Axel, John, and Stan one more time, and after tracking a deer across the woods, fires into the air. He then sits on a rock escarpment and yells out, \"OK?\", which echoes back at him. He also berates Stan for carrying around a small revolver and waving it around, not realizing it is loaded. Mike visits Steven, who is now confined to a wheelchair, having had both legs amputated. Steven reveals that someone in Saigon has been mailing large amounts of money to him; Mike is convinced that it is Nick. Mike brings a reluctant Steven home to Angela and then travels to Saigon just before its fall in 1975.\nHe tracks down Grinda, who has made a lot of money from the Russian roulette-playing Nick. He finds Nick in a crowded gambling club, but Nick still has no recollection of his friends or his home. Mike enters the game of Russian roulette against Nick, hoping to jog his memory and persuade him to come home, but Nick's mind is gone. To keep him from taking another turn, Mike grabs Nick's arms, which are covered in scars from drug use. At the last moment, after Mike reminds Nick of their hunting trips together, Nick recognizes Mike and smiles. Nick raises the gun to his temple, and pulls the trigger, killing himself.\nBack home in 1975, the friends have gathered for Nick's funeral, whom Mike has brought home, staying true to his promise. Together, they quietly sing 'God Bless America', and Mike offers a toast to the memory of Nick.", "cast": "Robert De Niro as SSG Michael \"Mike\" Vronsky. Producer Deeley pursued De Niro for The Deer Hunter because he felt that he needed De Niro's star power to sell a film with a \"gruesome-sounding storyline and a barely known director\". \"I liked the script, and [Cimino] had done a lot of prep,\" said De Niro. \"I was impressed.\" De Niro prepared by socializing with steelworkers in local bars and by visiting their homes. Cimino introduced De Niro as his agent, Harry Ufland. No one recognized him. De Niro claims this was his most physically exhausting film. He explained that the scene where Mike visits Steven in the hospital for the first time was the most emotional scene that he was ever involved with. De Niro was a last-minute replacement for Roy Scheider, who dropped out of the production two weeks before the start of filming due to \"creative differences\"; Universal managed to keep Scheider to his three-picture contract by forcing him into doing Jaws 2 (1978).\nChristopher Walken as Cpl. Nikanor \"Nick\" Chevotarevich. His performance garnered his first Academy Award, for Best Supporting Actor.\nJohn Savage as Cpl. Steven Pushkov.\nJohn Cazale as Stan (\"Stosh\"). All scenes involving Cazale, who had terminal cancer, were filmed first. Because of his illness, the studio initially wanted to fire him, but Streep, with whom he was in a relationship, and Cimino threatened to walk away if they did. He was also uninsurable, and according to Streep, De Niro paid for his insurance because he wanted Cazale in the film. This was Cazale's last film, as he died shortly after filming wrapped. Cazale never saw the finished film.\nMeryl Streep as Linda. Prior to The Deer Hunter, Streep was seen briefly in Fred Zinnemann's Julia (1977) and the eight-hour miniseries Holocaust (1978). In the screenplay, Streep's role was negligible. Cimino explained the set-up to Streep and suggested that she write her own lines.\nGeorge Dzundza as John Welsh\nPierre Segui as Julien Grinda\nShirley Stoler as Steven's mother\nChuck Aspegren as Peter \"Axel\" Axelrod. Aspegren was not an actor; he was the foreman at an East Chicago steelworks visited early in pre-production by De Niro and Cimino. They were so impressed with him that they offered him the role. He was the second person to be cast in the film, after De Niro.\nRutanya Alda as Angela Ludhjduravic-Pushkov\nAmy Wright as Bridesmaid\nJoe Grifasi as BandleaderWhile producer Deeley was pleased with the revised script, he was still concerned about being able to sell the film. \"We still had to get millions out of a major studio,\" wrote Deeley, \"as well as convince our markets around the world that they should buy it before it was finished. I needed someone with the caliber of Robert De Niro.\" De Niro was one of the biggest stars at that time, coming off Mean Streets (1973), The Godfather Part II (1974), and Taxi Driver (1976). In addition to attracting buyers, Deeley felt De Niro was \"the right age, apparently tough as hell, and immensely talented.\"Hiring De Niro turned out to be a casting coup because he knew so many actors in New York. De Niro brought Meryl Streep to the attention of Cimino and Deeley. With Streep came John Cazale. De Niro also accompanied Cimino to scout locations for the steel mill sequence as well as rehearsed with the actors to use the workshops as a bonding process.Each of the six principal male characters carried a photo in their back pocket depicting them all together as children, to enhance the sense of camaraderie amongst them. Additionally, director Cimino instructed the props department to fashion complete Pennsylvania IDs for each of them, including driver's licenses, medical cards, and various other pieces of paraphernalia, in order to enhance each actor's sense of his character."}