{"_movieID": "50839", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:26:32", "summary": "Margin Call is a 2011 American drama film written and directed by J. C. Chandor in his feature directorial debut. The principal story takes place over a 24-hour period at a large Wall Street investment bank during the initial stages of the financial crisis of 2007–08. In focus are the actions taken by a group of employees during the subsequent financial collapse. The ensemble cast features Kevin Spacey, Paul Bettany, Jeremy Irons, Zachary Quinto, Penn Badgley, Simon Baker, Demi Moore, and Stanley Tucci.\nThe film was produced by the production companies Before the Door Pictures, Benaroya Pictures, and Washington Square Films. Theatrically, it was commercially distributed by Lionsgate and Roadside Attractions. Margin Call explores capitalism, greed, and investment fraud. Following its wide release in theaters, the film garnered award nominations from the Detroit Film Critics Society, along with several separate nominations for its screenplay and direction from recognized award organizations, including a nomination for the Academy Award for Best Original Screenplay. The score was orchestrated by musician Nathan Larson.\nThe film made its premiere at the Sundance Film Festival on January 25, 2011, and opened in theaters nationwide in the United States on October 21, 2011, grossing $5,354,039 in domestic ticket receipts. It was screened at 199 theaters during its widest release in cinemas. It earned an additional $14,150,000 in business through international release to top out at a combined $19,504,039 in gross theatrical revenue. It was a ground-breaking day-and-date release that earned more than $10,000,000 in video-on-demand sales during its initial theatrical release. Preceding its theatrical release, Margin Call was met with positive critical reviews. The DVD and Blu-ray editions of the film were released in the United States on December 20, 2011.", "plot": "An unnamed investment bank begins a mass layoff on the trading floor during a normal business day. Among those let go is Eric Dale (Tucci), head of risk management. Dale tries to speak about his current, unfinished project, first with human resources staff and then with desk head Will Emerson (Bettany), but is told that this is no longer his concern. While being escorted out of the building he meets one of his risk analysts, Peter Sullivan (Quinto), and gives him a USB stick to look at with a vague instruction to \"be careful.\"\nSullivan works late that night to finish Dale's project, and discovers that current volatility in the firm's portfolio of mortgage-backed securities has exceeded the historical volatility levels of the positions. Because of excessive leverage, if the firm's assets decrease by 25%, the loss will be greater than the value of the firm itself and the firm will go bankrupt. Sullivan and his colleague, junior analyst Seth Bregman (Badgley), tell Emerson about the situation. Emerson alerts floor head Sam Rogers (Spacey), who also returns to the office. They attempt to contact Dale, but the company shut off his phone and he hadn't yet returned home.\nThey have emergency meetings in the middle of the night with division head Jared Cohen (Baker), chief risk management officer Sarah Robertson (Moore), and other senior executives to discuss their options.  Finally CEO John Tuld (Irons) is called in.  Cohen's plan is for the firm to quickly dump all of the toxic assets in a fire sale before the market learns of their worthlessness, thereby limiting the firm's exposure.  Tuld favors the plan, comparing the economic situation to one of musical chairs: when the music stops, the last one standing will be left with only toxic, worthless securities.  Sullivan suggests caution, saying that the \"music\" in Tuld's analogy is only \"slowing\".  Rogers is stronger in opposing Jared's plan, warning that dumping all of their toxic assets, spreading the risk throughout the financial sector, will destroy the firm's relationships with its counterparties, and cripple the market for the foreseeable future. He also warns Cohen that their customers will quickly learn of the firm's plans once they realize that the firm is only selling the toxic securities, but is not buying any new ones.\nBy early morning, Eric Dale is found back at his home in Brooklyn.  Will convinces Dale to return to the office, informing him that the firm will not pay him his severance and other benefits unless he agrees to participate in their plan. Will also tells Seth he'll probably lose his job in the crisis, but will get a large severance, while explaining to him the amoral, cyclical nature of the markets. Meanwhile, it is revealed that Robertson, Cohen, and Tuld were aware of the risks in the weeks leading up to the crisis. Tuld offers Robertson up as the scapegoat, putting the blame of the crisis on her and forcing her resignation. Both Dale and Robertson are instructed to remain in the office all day and do nothing in return for an increase to their severance packages. Robertson expresses regret for not doing more to stop the crisis.\nWith the markets yet to open, Tuld convinces Rogers to go along with Cohen's plan. In a speech to his traders in preparation for the fire sale, Rogers warns them that, by participating, they are effectively ruining their reputations and ending their careers in the industry, but offers a $1.3 million dollar bonus to those able to sell 93% of their assigned securities, with further $1.3 million dollar bonuses if the entire sales floor can reach 93% as a whole. As the trading bell sounds and the markets open, Emerson and the traders immediately begin rapidly selling off their securities, and quickly arouse suspicion and anger from their buyers as the hours pass, and by closing bell the firm takes tremendous losses while dumping positions for cents on the dollar, but is able to successfully sell off all the toxic assets. After trading hours end, Cohen tells Rogers there will be another round of layoffs, but Rogers will keep his job. Angry that he was retained, Rogers confronts Tuld in the executive dining room, telling him that he wants to cash in on his options and severance pay and leave the company, but Tuld dismisses his protests, claiming that the current crisis is no different from various bear markets of the past, and that sharp gains and losses are simply part of the economic cycle. He persuades Rogers to stay at the firm for another two years, promising that there will be a lot of money to be made from the coming crisis. Cohen is seen bringing Sullivan into the dining room, and Tuld informs Rogers he is promoting Sullivan. Rogers reluctantly accepts Tuld's deal, but says it's only because he needs the money.\nRogers buries his dog in his ex-wife's front yard in the middle of the night, and learns from her that their son's financial firm took a big hit but survived the day's trading.\nThe screen cuts to black and the credits roll as the sound of Rogers shoveling dirt continues."}