{"_movieID": "64689", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:36:17", "summary": "Killing Them Softly is a 2012 American neo-noir crime film directed by Andrew Dominik and starring Brad Pitt, based on George V. Higgins' novel Cogan's Trade (1974). On May 22, 2012, the film premiered in competition for the Palme d'Or at the 2012 Cannes Film Festival and received positive early reviews. The film is about three small-time crooks who rob a Mob-protected illegal gambling operation, which prompts the Mob to send in two hitmen, Jackie (Pitt) and Mickey (James Gandolfini), to deal with the perpetrators.", "plot": "During the American financial crisis and presidential election campaign in the fall of 2008, Johnny \"Squirrel\" Amato plans to rob a Mafia poker game. He enlists Frankie, a former business associate, and Russell, a heroin-addicted Australian expatriate who is stealing purebred dogs for money. They decide to target a game run by Markie Trattman, who is known to have previously orchestrated an inside job by paying two men to rob his own illegal poker game. Squirrel anticipates that Markie will be the obvious suspect because of this, and the Mafia will simply have him killed without investigating further. \nFrankie and Russell, although obviously amateurs, do the holdup and leave with the money. Afterwards, a mafioso named Driver hires hitman Jackie Cogan to deal with the situation. Although Jackie correctly intuits that Markie was uninvolved with the recent heist, he believes Markie still needs to die since he looks guilty, and an example needs to be made to discourage further robberies. \nUpon completing the crime, Russell travels to Florida to sell the dogs. While in Florida, he inadvertently informs a man named Kenny Gill of his involvement in the heist while trying to recruit him as a drug dealer. Kenny informs Jackie, who deduces that Russell, Frankie, and Squirrel were the perpetrators.\nJackie carries out the hit on Markie himself but brings in another hitman named Mickey Fallon, who is on parole in New York, to kill Squirrel. Jackie explains to Driver how he prefers \"killing them softly\"—shooting his victims from a distance, without warning, giving them no opportunity to experience fear or despair—and that his acquaintance with Squirrel risks complicating this approach.\nMickey postpones going through with his assigned hit, and instead indulges in drunkenness and sex with prostitutes in a hotel room. During conversation with Jackie, Mickey reveals that he has violated his parole, and doesn't seem to either care about nor really comprehend the consequences; instead he goes off on drunken tangents. It becomes clear to Jackie that the respected hitman has lost his nerve and ability to do his job. Jackie eventually decides to carry out the hit on Squirrel himself. He convinces Driver to arrange Mickey's arrest before the job has been completed.\nRussell is arrested on a drug possession charge and deported; meanwhile, Jackie confronts Frankie and convinces him to trade Squirrel's whereabouts for his life. Jackie has Frankie drive him to Squirrel; upon reaching Squirrel's apartment complex, he kills Squirrel with a shotgun. After confirming Squirrel is dead, Jackie has Frankie drive him to get his car several hours away. Frankie becomes very nervous and begins speeding. Unable to get Frankie to slow down, Jackie takes over driving. Once they arrive at the parking garage, Jackie shoots Frankie in the head without warning. Jackie then wipes down any fingerprints he might have left and leaves the scene.\nOn the night of the presidential election, Jackie meets with Driver to collect his fee for the three hits. On the TV in the bar, Barack Obama is giving his election victory speech. The two argue over his fee, with Driver trying to pay a lesser amount and Jackie insisting on the full sum. Referring to Obama's speech, Jackie angrily declares: , \"This guy wants to tell me we're living in a community? Don't make me laugh. I'm living in America, and in America, you're on your own. America is not a country; it's just a business. Now fucking pay me.\""}