{"_movieID": "245846", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:18:03", "summary": "Strangerland is a 2015 Australian-Irish drama suspense film directed by Kim Farrant at her directorial debut, and written by Michael Kinirons and Fiona Seres. The film stars Nicole Kidman, Joseph Fiennes, and Hugo Weaving. The film premiered at the Sundance Film Festival on 23 January 2015\nand in a limited release in cinemas and through video on demand on 10 July 2015 by Alchemy. It was a box office bomb, grossing $1 million against a $10 million budget.", "plot": "Catherine and Matthew Parker move with their children Lily and Tom to the remote Australian desert town of Nathgari.  Although the family is unhappy with the move, Matthew and Tom blame Lily for forcing them to leave the larger town of Coonaburra.  When he can't sleep, Tom sometimes walks around the neighbourhood at night, an activity his parents discourage.  One night, Matthew sees Tom leave the house, followed by Lily.   Half asleep, he says nothing and goes back to sleep.  Next morning Catherine oversleeps, and when she cannot find the kids, calls Matthew at work.   He reassures her that they must have gone to school before she woke up.  When the school calls to report that Tom and Lily have not been attending, she once again becomes worried, as a dust storm is forecast to hit the town.  Matthew discourages her from contacting anyone, as he does not wish the family's business to once again become public knowledge.  Against his wishes, Catherine contacts several people and finally the police.\nWhile taking their report, Detective David Rae finds that Lily has once before been reported missing.  Catherine and Matthew reluctantly reveal that she merely disappeared for a few days, they panicked and reported, but she soon turned up at a friend's house.  After further investigation, Rae learns that one of Lily's Coonaburra teachers, Neil McPherson, had sex with her.  When Matthew found out, he beat up McPherson, earning a restraining order.  The Parkers admit to Rae that they were forced to leave Coonaburra to escape the attention.  Catherine becomes frustrated with Matthew's focus on his job as a pharmacist, though he insists that he has no choice, since the community needs his services.  Rae's queries in town reveal that Lily had indeed multiple sexual relationships despite being underage (she's fifteen).  When Catherine finds Lily's diary she reluctantly reads it.  It's irate/angsty with hyper-sexualised imagery and includes pictures and poetry about several people : McPherson, the Parker's mentally handicapped handyman Burtie, and a local youth nicknamed Slug.  It also describes her parents' marriage as a sham, which causes Catherine to cry.  Catherine hands the diary to Rae with the proviso that he not reveal it to Matthew.\nMatthew drives to Coonaburra and questions/threatens McPherson.  Coreen, Rae's girlfriend and Burtie's sister, becomes annoyed when Rae won't share details of the case with her.  She's also jealous, fearing Rae is attracted to Catherine.  Rae secretly shreds the evidence from the diary that connects Burtie to Lily and discourages Burtie from telling him anything incriminating.  Rae arrests Slug, but without any evidence of an actual crime, must release him.  When the kids remain missing, the town organises a search party.  Matthew refuses to participate, further angering Catherine.  Rae suggests to Catherine that her children could have run away for a reason closer to home.  Catherine confronts Matthew with Lily's sexual history and asks if he ever molested her.  Incredulous, he denies it and asks why she would even ask; she cites his apparent reluctance to help find the kids.  Knowing now that Burtie had a sexual relationship with Lily, Matthew beats up Burtie and searches his house.  Coreen demands Rae arrest Matthew, and when she accuses him of taking the Parkers' side, Rae reveals Burtie's connection.\nBurtie visits the Parkers and asks to speak with Matthew.  Catherine invites him in, but he leaves when she attempts to seduce him in Lily's clothes.  When Matthew drives into the desert alone, in the opposite direction of search, he finds Tom dehydrated and delirious.  Tom initially refuses to speak, so Catherine yells at him; Tom eventually tells Matthew that he saw Lily get into a car.   Catherine listens as locals discuss Lily's disappearance and likely death, and becomes distraught when she receives prank calls that call Lily \"a whore\".  Desperate, she visits Rae, and when she fails to seduce him, wanders into the desert night, alone.  Unsure why she's hated or has done wrong, she despairs.  Next morning, traumatised and stripped naked, she reappears in town; gathering all to gawp.  Matthew rescues her, then tenderly bathes her.  In bed together, as they hold each other, Catherine admits that she hid the diary from Matthew, and Matthew reveals he saw the kids leave that night.  He admits he did not stop them because, angry with Lily, he wanted to punish her.  Catherine hugs Tom and walks onto the porch, where she and Matthew console each other.  While holding Lily's diary, Matthew cries and says that he wishes he could take back that one moment.\nTwo passages of Lily's poetry, in her voice, over aerial imagery of the vast outstretching 'Outback' - Lily's fate is left uncertain...", "cast": "Nicole Kidman as Catherine Parker\nJoseph Fiennes as Matthew Parker\nHugo Weaving as David Rae\nMaddison Brown as Lily Parker\nLisa Flanagan as Coreen\nMeyne Wyatt as Burtie\nNicholas Hamilton as Tom Parker\nMartin Dingle-Wall as Neil McPherson"}