{"_movieID": "94204", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:28:37", "summary": "Meeting Evil is a 2012 mystery thriller film directed by Chris Fisher. It is based on the 1992 novel Meeting Evil by Thomas Berger. It stars Samuel L. Jackson and Luke Wilson.", "plot": "John Felton, who lives in Orly County in an unnamed southern state, has a wife named Joanie, and two kids named Sam and John Jr.. John is a mild-mannered real estate agent who has just been fired, making his personal crisis (his marriage is on the rocks because of his infidelity) go from bad to worse.\nJohn comes home and finds a foreclosure notice on the front door, and goes inside to a surprise birthday party thrown by Joanie and the kids. The foreclosure notice has John angry, so Joanie takes the kids to a local park.\nJohn is in the backyard, staring at the hole that's being dug for the swimming pool he is having installed and notices that the job is going slowly.  There is an incessant banging on the front door. John answers, and it's a man who calls himself Richie. Wearing a suit and fedora, Richie says his car, a 1972 Pontiac GTO stalled and requires a push. As John pushes the car from the back while Richie steers, the car backfires, injuring John's left knee. Richie opens the trunk of his car and approaches John concealing a revolver behind his back but hides it when he sees a little girl walking her dog.\nRichie offers to take John to the hospital, and he reluctantly accepts, not realizing that he's leaving his wallet and cell phone behind at the house. On the way, John wonders about Richie's strange behavior—Richie is continuously \"whistling Dixie\"—and then Richie stops at a bar. John goes across the street to a cell phone dealership, where Rhonda, a clerk with a severe attitude problem, rudely denies him the use of a phone to call Joanie for a ride home.\nAt the bar, John crosses paths with Trevor, the man who fired him, and Tammy Strate, the woman with whom he had his affair.  Tammy was Trevor's girlfriend before she left Trevor to be with John, and this is hinted as why he was fired.\nA few minutes later, police cars start showing up, and Richie suggests that he and John leave. They leave with Tammy in her car, and once they  get out onto a remote part of the road, a trucker harasses them and forces them to pull over.\nThe trucker is Rhonda's boyfriend, angry that Rhonda has been killed, and he thinks John did it. John gets out of the car, and the trucker approaches him with a tire iron. Suddenly, Richie hits the trucker with the car, killing the trucker. It turns out that Richie, who killed Rhonda, is a murderous psychopath. Local cops  Frank and Latisha think John is the killer.\nJohn realizes that this was not the day to play good samaritan. He and Tammy are in for a violent ride that they don't want to be on. Tammy escapes from Richie, and John tries to escape, Richie, disguised as a deputy, recaptures John. John forces Richie to let him go, and Richie threatens Joanie and the kids.\nAfter a massacre at a store, John is arrested by Frank, who refuses to believe John's story about Richie, and that night, Latisha learns that John is not the killer—murders were committed in a diner while John was in custody, and Tammy has corroborated John's story about Richie.\nFrank releases John, who goes home with Joanie and the kids, and Frank and Latisha, who thought Richie was killed at the diner, learn that he's still alive, and may be on his way to the Felton house.\nIn fact, Richie is already there, harassing the Feltons, and it's raining heavily. While they are eating dinner, Richie explains to John that Joanie is having an affair and had, in fact, hired Richie to kill him for insurance money. John attacks Joanie being egged on by Richie, she tries to stab John with a knife and he takes it from her ready to do the same, but instead stabs Richie and she then uses one of John's golf clubs to attack Richie as well. John and Richie crash through a window and fall into the pool hole struggling, which has been filled with water because of the rain. Frank and Latisha arrive, and Latisha fires a shot that kills Richie. That night, in bed, Joanie asks if everything is going to be okay, and Joanie turns out her light. John doesn't answer and turns out his light, ominously whistling Dixie, just like Richie.", "cast": "Samuel L. Jackson as Richie\nLeslie Bibb as Joanie Felton\nLuke Wilson as John Felton\nPeyton List as Tammy Strate\nTracie Thoms as Latisha Rogers\nMuse Watson as Frank"}