{"_movieID": "395991", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:19", "summary": "Only the Brave is a 2017 American biographical drama film directed by Joseph Kosinski, and written by Ken Nolan and Eric Warren Singer, based on the GQ article \"No Exit\" by Sean Flynn. The film tells the story of the Granite Mountain Hotshots, an elite crew of firefighters who lost 19 of 20 members while fighting the Yarnell Hill Fire in June 2013, and is dedicated to their memory. It features an ensemble cast, including Josh Brolin, James Badge Dale, Jeff Bridges, Miles Teller, Alex Russell, Taylor Kitsch, Ben Hardy, Thad Luckinbill, Geoff Stults, Scott Haze, Andie MacDowell, and Jennifer Connelly.\nPrincipal photography began in New Mexico in June 2016. Only the Brave was released in the United States by Columbia Pictures on October 20, 2017. It received positive reviews from critics, with praise aimed at the cast and the film's touching tribute to its subjects. The film is dedicated to the Granite Mountain Hotshots and their families.", "plot": "Eric Marsh, superintendent of Fire and Rescue Crew 7 in Prescott, Arizona, receives a call to the Cave Creek Complex Wildfire. Due to Crew 7's status as municipal firefighters, Eric's prediction that the fire will threaten a nearby neighborhood is ignored by a hotshot crew from California. The fire behaves as Eric anticipated, and the neighborhood is destroyed.\nEric's wife Amanda suggests he talk to Duane Steinbrink, the city fire chief, to complete Crew 7's certification as wildfire hotshots. Duane warns that the crew will now have to commit to a longer working season. This frustrates Amanda, who resents how the time commitment already keeps Eric from wanting to start a family.\nBrendan McDonough is unemployed, listless, and abuses drugs. His ex-girlfriend Natalie is pregnant with his baby, but she feels he is too irresponsible to be in her life. When he gets arrested for larceny, his mother kicks him out of the house. When his daughter is born he wants to provide for her, so he interviews with Eric, who hires him despite the reservations of some of the crew.\nThe crew trains hard and is finally deployed to a wildfire for evaluation. They pass and become the Granite Mountain Hotshots. Natalie begins to accept Brendan and lets him spend time with their daughter.\nThe crew fights several fires, including saving an historic juniper tree, but Brendan is bitten by a rattlesnake while walking a fire line. While he recovers in hospital, his mother suggests that Brendan reconsider his dangerous career for his daughter's sake. Brendan later approaches Eric about transferring to a standard municipal fire hall, structure fire crew. Eric erupts, suggesting Brendan’s criminal past makes a transfer nearly impossible and that he will return to drugs without the purpose being a hotshot provides.\nEric and Amanda argue about Eric's attitude about Brendan's sense of priorities, and his reluctance to start a family. Eric has a heartfelt talk with Duane, then returns home and tells Amanda he's ready to start a family.\nThe Granite Mountain Hotshots are called to the Yarnell Hill Fire, 30 Miles from Prescott. Driving to the area, Eric tells his second-in-command Jesse that he will be stepping down and will recommend Jesse as superintendent. Walking into the fire zone, Eric tells Brendan that he will help Brendan secure a transfer so he can spend more time with his family.\nThe crew begins a controlled burn to contain the fire, but an air tanker mistakes it for a secondary fire and extinguishes it. The crew is forced to relocate, so Eric sends Brendan to higher ground as a lookout. When the wind suddenly intensifies and shifts, Brendan is rescued by another hotshot crew, and they evacuate to the mobile fire headquarters. The rest of the Granite Mountain Hotshots head to a designated safe zone after realizing that the fast-moving fire is too intense to go up against.\nThe fire picks up speed and jumps the safe zone, continuing towards the Granite Mountain Hotshots and cutting off their escape route. The crew clears a small site, and Eric calls in an air tanker to douse them. The tanker misses the crew, and they deploy their compact personal fire shelters. As the fire sweeps over the crew, multiple radio calls go unanswered. Brendan hears the radio call from the first helicopter to reach the site: all 19 firefighters are dead.\nThe worried families of the hotshots gather at Prescott Middle School, where they hear reports of a lone survivor of the twenty firefighters. Brendan is driven to the school and enters the gymnasium. Upon seeing Brendan, knowing that he was one of the hotshots, they realize that he is the only one who made it out alive, and that their loved ones had all perished. As they grieve, Brendan storms out of the gym and collapses outside, where Amanda comforts him, all the while Brendan saying that he should’ve died alongside them.\nThree years later, Brendan takes his daughter to the juniper tree that was saved by the crew. During the credits, photos are shown of the actual Granite Mountain Hotshots and their actor counterparts."}