{"_movieID": "411144", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:44:09", "summary": "We Have Always Lived in the Castle is a 1962 mystery novel by American author Shirley Jackson. It was Jackson's final work, and was published with a dedication to Pascal Covici, the publisher, three years before the author's death in 1965. The novel is written in the voice of eighteen-year-old Mary Katherine \"Merricat\" Blackwood, who lives with her sister and uncle on an estate in Vermont. Six years before the events of the novel, the Blackwood family experienced a tragedy that left the three survivors isolated from the rest of their small village.\nThe novel was first published in hardcover in North America by Viking Press, and has since been released in paperback and as an audiobook and e-book. It is widely considered Jackson's masterpiece. Its first screen adaptation appeared in 2018, based on a screenplay by Mark Kruger and directed by Stacie Passon.", "plot": "Merricat Blackwood, her elder sister Constance, and their ailing Uncle Julian live in a large house on extensive grounds, in isolation from the nearby village. Constance has not left their home in six years, going no farther than her large garden. Uncle Julian, confined to a wheelchair, obsessively writes and re-writes notes for his memoirs, while Constance cares for him.\nThrough Uncle Julian's ramblings, the events of the past are revealed, including what happened to the remainder of the Blackwood family: six years ago both the Blackwood parents (John and Ellen), an aunt (Julian's wife Dorothy), and a younger brother (Thomas) were murdered – poisoned with arsenic, which was mixed into the family's sugar bowl and sprinkled onto blackberries at dinner. Julian, though poisoned, had survived; Constance, who did not put sugar on her berries, was arrested for, and eventually acquitted of, the crime. Merricat was not at dinner, having been sent to bed without dinner as punishment. The people of the village believe that Constance had gotten away with murder and the family is ostracized. The three remaining Blackwoods had grown accustomed to their isolation, and lead a quiet, happy existence. Merricat is the family's sole contact with the outside world, walking into the village twice a week and carrying home groceries and library books, where she is faced directly with the hostility of the villagers and often followed by groups of children, who taunt her, often with an accusing rhyme. They are quite harsh and rude, and it is made obvious that Merricat knows that her family is hated by the townsfolk.\nMerricat is protective of her sister and is a practitioner of sympathetic magic. She feels that a dangerous change is approaching; her response is to reassure herself of the various magical safeguards she has placed around their home, including a book nailed to a tree. After discovering that the book has fallen down, Merricat becomes convinced that danger is imminent. Before she can warn Constance, their estranged cousin, Charles, appears for a visit.\nCharles quickly befriends Constance, insinuating himself into her confidence. Charles is aware of Merricat's hostility and is increasingly rude to her and impatient of Julian's weaknesses. He makes many references to the money the sisters keep locked in their father's safe, and gradually forms something of an alliance with Constance. Merricat perceives Charles as a threat, calling him a demon and a ghost, and tries various magical and otherwise disruptive means to drive him from the house. Uncle Julian is increasingly disgusted by Charles, and Constance is caught between the warring parties.\nOne night before dinner, Constance sends Merricat upstairs to wash her hands, and Merricat, in her anger against Charles, pushes Charles' still-smoldering pipe into a wastebasket filled with newspapers. The pipe sets fire to the family home. The villagers arrive to put out the fire, but once it's out, in a wave of long-repressed hatred for the Blackwoods, they begin throwing rocks at the windows, smashing them and surging into the house to destroy whatever they can, all the while chanting their children's taunting rhyme. Merricat and Constance, driven outdoors, are encircled by some of the villagers who seem on the verge of attacking them, en masse. Merricat and Constance flee for safety into the woods. In the course of the fire, Julian dies of what is implied to be a heart attack, and Charles attempts to take the family safe. While Merricat and Constance shelter for the night under a tree Merricat has made into a hideaway, Constance confesses for the first time that she always knew Merricat poisoned the family. Merricat readily admits to the deed, saying that she put the poison in the sugar bowl because she knew Constance would not take sugar.\nUpon returning to their ruined home, Constance and Merricat proceed to salvage what is left of their belongings, close off those rooms too damaged to use, and start their lives anew in the little space left to them. The house, now without a roof, resembles a castle \"turreted and open to the sky\". The villagers, awakening at last to a sense of guilt, begin to leave food on their doorstep. Charles returns once to try to renew his acquaintance with Constance, but she now knows his real purpose is greed and ignores him. The two sisters choose to remain alone and unseen by the rest of the world."}