{"_movieID": "49040", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:13:44", "summary": "The Bourne Legacy is a 2012 American action film directed by Tony Gilroy, and is the fourth installment in the series of films adapted from the Jason Bourne novels originated by Robert Ludlum and continued by Eric Van Lustbader, being preceded by The Bourne Identity (2002), The Bourne Supremacy (2004), and The Bourne Ultimatum (2007). Although this film has the same title as Van Lustbader's first Bourne novel, The Bourne Legacy, the actual screenplay bears little resemblance to the novel. Unlike the novel, which features Jason Bourne as the principal character, the film centers on black ops agent Aaron Cross (played by Jeremy Renner), an original character. In addition to Renner, the film stars Rachel Weisz and Edward Norton.\nThe titular character Jason Bourne does not appear in The Bourne Legacy, as actor Matt Damon chose not to return for the fourth film, due to Paul Greengrass not directing. Bourne is shown in pictures and mentioned by name several times throughout the film. Tony Gilroy, co-screenwriter of the first three films, sought to continue the story of the film series without changing its key events, and parts of The Bourne Legacy take place at the same time as the previous film, The Bourne Ultimatum (2007). Aaron Cross is a member of a black ops program called Operation Outcome whose subjects are genetically enhanced. He must run for his life once former CIA Treadstone agent Jason Bourne's actions lead to the public exposure of Operation Treadstone and its successor Operation Blackbriar.\nFilming was primarily in New York City, with some scenes shot in the Philippines, South Korea, Pakistan, and Canada. Released on August 10, 2012, the film received mixed reviews, with critics praising the story, James Newton Howard's score, and Renner's performance, but expressing disappointment in Matt Damon's absence, as well as the lack of shaky camera work (a key element of Greengrass' directorial style) that the second and third films had used. The film was followed in 2016 by Jason Bourne, in which Damon and Greengrass reprised their earlier roles.", "plot": "Six weeks after Jason Bourne's escape from Moscow in The Bourne Supremacy, Aaron Cross, an operative belonging to a Department of Defense black ops program called Operation Outcome, is assigned to Alaska for a training exercise. He is forced to survive weather extremes and traverse rugged terrain to arrive at a remote cabin as punishment for missing training and going off the grid for four days. The cabin is operated by an exiled Outcome operative, Number Three, who informs Cross that he has broken the mission record by two days. As an Outcome operative, Cross uses experimental pills known as \"chems\" which enhance the physical and mental abilities of their users.\nRetired Air Force colonel Eric Byer is tasked with containing the fallout from the exposure of the Treadstone and Blackbriar programs. He discovers a potentially scandalous video on the Internet showing a meeting between Treadstone and Outcome medical directors, Albert Hirsch and Dan Hillcott. To prevent the Senate investigation from learning about Outcome, Byer orders everyone associated with the program killed. He sees the sacrifice as acceptable to protect next-generation \"beta programs\", including the supersoldier program LARX.\n\nByer deploys a drone to eliminate Outcome agents Number Three and Five (Cross) in Alaska. Cross evades the drone and force-feeds his radio-frequency identification to a wolf which is then blown up by a missile, tricking Byer into believing Cross is dead. At Sterisyn-Morlanta, a biogenetics company supporting Outcome, researcher Dr. Donald Foite shoots and kills all but one of his colleagues in the research laboratory. After being cornered by guards, Foite turns his gun on himself, leaving biochemist Dr. Marta Shearing as the sole survivor.  Other Outcome agents are eliminated when their handlers give them poisoned yellow pills disguised as new chems.\nFour \"D-Trac\" assassins disguised as federal agents visit Shearing at her country house. When she states her belief of Foite having been chemically brainwashed into becoming an emotionless killer, the assassins attempt to fake her suicide, but are killed by Cross. Shearing reveals that Cross has been genetically modified by a tailored virus to retain the physical benefits permanently without needing the green chems anymore. He still requires regular doses of blue chems to maintain his intelligence, but he is running out. Cross confides to her that he is Private First Class Kenneth J. Kitsom (reportedly killed by an improvised explosive device in the Iraq War) and that his recruiter added twelve points to his IQ, enabling Cross to meet the United States Army's requirements. Without his enhanced intelligence, Cross believes they stand no chance of survival. Cross and Shearing travel to Manila, where the chems are manufactured, to try to infect him with another virus that will make his intelligence permanent.\nCross and Shearing bluff their way into the Morlanta Pacific pharmaceutical factory and Shearing injects Cross with the live virus stems. Byer alerts factory security, but they evade capture. Byer orders LARX-03, a chemically-brainwashed supersoldier, to track and kill them. As Cross is struck by flu-like symptoms induced by the virus, he hallucinates about his Outcome training. When police surround their shelter while Shearing is buying medicine, Cross rescues her and steals a motorbike. After a lengthy chase through the streets and marketplaces of Manila and Marikina, they lose the police and kill the assassin. Shearing persuades a Filipino boatman to help them escape by sea.\nBack in New York, Blackbriar supervisor Noah Vosen lies to the Senate, stating that Blackbriar was created solely to track down Jason Bourne, and that Deputy Director Pamela Landy committed treason by assisting Bourne and trying to sell Treadstone secrets to the press."}