{"_movieID": "93456", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:39:59", "summary": "Despicable Me 2 is a 2013 American 3D computer-animated comedy film and the sequel to the 2010 animated film Despicable Me. Produced by Illumination Entertainment for Universal Pictures and animated by Illumination Mac Guff, the film was directed by Pierre Coffin and Chris Renaud, and written by Cinco Paul and Ken Daurio. Steve Carell, Russell Brand, Miranda Cosgrove, Elsie Fisher, and Dana Gaier reprise their roles as Gru, Dr. Nefario, Margo, Agnes, and Edith respectively. Kristen Wiig, who played Miss Hattie in the first film, voices agent Lucy Wilde, while Ken Jeong, who played the Talk Show Host, voices Floyd Eagle-san. New cast members include Benjamin Bratt as Eduardo \"El Macho\" Pérez and Steve Coogan as Silas Ramsbottom, head of the fictional Anti-Villain League (AVL).\nDespicable Me 2 premiered on June 5, 2013 in Australia and had a wide theatrical release in the United States on July 3, 2013. It received generally positive reviews from critics, and it has grossed over $970 million worldwide against a budget of $76 million. It was nominated for Academy Award for Best Animated Feature and for Academy Award for Best Original Song (for \"Happy\"), losing both to Walt Disney Animation Studios' Frozen. It became the second-highest-grossing animated film of 2013 and the third highest-grossing film of 2013. It is also the most profitable film in the 101-year history of Universal Pictures. A spinoff/prequel film, Minions, focusing on the little yellow henchmen before they met Gru, was released on July 10, 2015. A sequel, Despicable Me 3, was released on June 30, 2017.", "plot": "A mysterious vehicle using a giant magnet steals a highly potent mutagen known as PX-41 from a secret laboratory in the Arctic Circle. The Anti-Villain League (AVL), led by Silas Ramsbottom, sends one of its agents, Lucy Wilde to collect Gru, who was a former super-villain. Meanwhile, at Gru's house, it is one of his daughters, Agnes's birthday and he hosts a party for her. Later, Lucy Wilde uses her lipstick taser to get Gru to the AVL headquarters, as two minions witness the kidnapping and try to save Gru only to end up tagging along. When they make it at the AVL Silas Ramsbottom introduces himself (much to Gru's and the minions amusement) and tells him he was taken there to track down the culprit of the person who stole the lab and recover the mutagen. However, Gru refuses, claiming that he is now a legitimate father and cheap jelly businessman. Longing to resume his criminal life, Dr. Nefario, Gru's friend and assistant, leaves Gru for new employment. This convinces a reluctant Gru to investigate the theft and work with undercover AVL agent Lucy Wilde.\nThe pair begin their search in the Paradise Shopping Mall, disguised as bakery employees. Gru immediately suspects the Mexican restaurant owner, Eduardo Pérez, of being the infamous \"El Macho\", a legendary super-villain who supposedly died by riding a shark into the mouth of an active volcano with 250 pounds of dynamite strapped to his chest. Gru and Lucy break into Eduardo's restaurant at night but find no proof. Meanwhile, Agnes, who dreams of having a mother one day, believes that Gru will fall in love with Lucy. Gru denies it, saying his relationship with Lucy is only professional.\nAlthough holding Eduardo as his prime suspect, Gru agrees to pursue others, including wig merchant Floyd Eagle-san. After witnessing Eduardo's two-timing son, Antonio, woo Margo and invite everyone to his Cinco de Mayo party, Gru renews his focus on Eduardo. His neighbor, Jillian, sets him up on a dinner date with her vacuous friend Shannon. The date goes awry, but Lucy arrives and rescues Gru from being humiliated by shooting Shannon with a tranquilizer gun. While they take Shannon home, Gru and Lucy spend personal time together, and Gru falls in love with her.\nThe next day, the AVL arrest Eagle-san after finding an almost-empty jar of the mutagen in his shop, and the investigation is closed by Ramsbottom. Lucy is reassigned to Australia and gives Gru her lipstick taser as a gift before leaving. A heartbroken Gru, having lacked the courage to ask Lucy out on a date, instead takes the girls to the Cinco de Mayo party. There, he follows Eduardo and discovers a secret musical steps-activated elevator, where he finally finds proof that Eduardo is El Macho.\nOn her flight, Lucy, realizing that she has also fallen in love with Gru, jumps out of the plane and uses a hang-glider to reach the party. Gru discovers that El Macho, who has hired Nefario as a partner, has been abducting Gru's minions and using the stolen PX-41 serum to make them rabid and indestructible. El Macho plans to launch rockets full of the mutated Minions into major cities in order to dominate the world. He offers Gru the chance to team up with him, but Gru walks away and El Macho sends one of his minions after him.\nGru takes the girls home and finds a heartbroken Margo as Antonio has chosen another girl to dance with other than her; Gru freezes him on the way out. Lucy later arrives at the party right after Gru leaves, but El Macho captures Lucy after Pollito, El Macho's pet chicken, retrieves her AVL ID badge from her purse. Nefario rejoins Gru and tells him that Lucy has been captured, Gru goes back to his fortress with two of his own minions. Meanwhile, back at Gru's house, the minion that El Macho released finds his home and attacks the girls, but Nefario comes to their rescue as he had created an antidote to the serum and puts it in the jelly. Gru enters the fortress with two disguised minions covered with purple paint pretending to be captured to help him enter El Macho's fortress, but one of the minions wipes some paint off of his face with his glove revealing to all the purple minions that he is not one of them and the kidnapping was fake, therefore the purple minions attack and corner them, Luckily Nefario, the girls and the rest of Gru's minions who are in a normal state arrive with the antidote and return all the Minions to their normal state. El Macho then applies the mutagen on himself and turns into a monster, but Gru and Nefario defeat him using Lucy's lipstick taser and a fart gun respectively.\nGru finds Lucy strapped to a TNT-loaded shark rocket and starts to untie her, but Pollito launches the rocket, sending it flying towards the same volcano where El Macho previously faked his death. Lucy accepts Gru's invitation for a date, and the pair dive into the ocean seconds before the rocket enters the volcano and violently explodes. Gru rejoins the AVL, and he and Lucy eventually get married, giving Margo, Edith and Agnes a mother.", "cast": "Steve Carell as Gru, a former villain turned father (and then member of the Anti-Villain League).\nKristen Wiig as Lucy Wilde, an Anti-Villain League agent and then Gru's love interest. Wiig previously voiced Miss Hattie in the first film.\nBenjamin Bratt as Eduardo \"El Macho\" Pérez, the owner of Salsa & Salsa, a Mexican restaurant in the Paradise Mall, and the mastermind behind the theft of the PX-41 serum. Al Pacino was originally cast in the role and had recorded all his lines, but left the film due to creative differences.\nMiranda Cosgrove as Margo, the eldest of the three girls.\nDana Gaier as Edith, the middle of the three girls.\nElsie Fisher as Agnes, the youngest of the three girls.\nRussell Brand as Dr. Nefario, Gru's elderly, hearing impaired gadget man.\nSteve Coogan as Silas Ramsbottom, the director of the Anti-Villain League.\nKen Jeong as Floyd Eagle-san, the owner of Eagle Hair Club, a wig store in the Paradise Mall.\nMoisés Arias as Antonio Pérez, Margo's first love interest and Eduardo's son.\nNasim Pedrad as Jillian, Gru's irritating matchmaking neighbor who wants Gru to date her friends.\nKristen Schaal as Shannon, Jillian's superficial friend.\nPierre Coffin as Kevin, Stuart, Bob and additional evil Minions. According to Coffin, he lent his voice to 899 Minions.\nChris Renaud as additional evil Minions.\nRenaud also voices an Italian waiter.\nVanessa Bayer as Flight Attendant.\nNickolai Stoilov as Arctic Lab Guards."}