{"_movieID": "381078", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:20:20", "summary": "The American Epic Sessions is a documentary film in which an engineer restores the fabled long-lost first electrical sound recording system from 1925, and twenty contemporary artists pay tribute to the momentous machine by attempting to record songs on it for the first time in 80 years. The film was directed and co-written by Bernard MacMahon and stars Nas, Alabama Shakes, Elton John, Willie Nelson, Merle Haggard, Jack White, Taj Mahal, Ana Gabriel, Pokey LaFarge, Beck, Ashley Monroe, Los Lobos, The Avett Brothers, Pokey LaFarge, Bettye Lavette, Rhiannon Giddens, Raphael Saadiq, Edie Brickell, Steve Martin, and others.The film employed a diverse line-up of performers both ethnically and musically to represent the breadth of cultures that were first given a national platform through the invention of this recording machine. It also explored the extent to which the recordings made on it in the 1920s influenced and inspired contemporary music.The film involved a decade of work restoring the machine, which was pieced together from spare parts scattered across the globe, in order to better understand the origins of modern recording technology, and the influence the machine had on world culture. The machine would go on to put sound on motion pictures. The recreation of a live 1920s-style recording session, explored the essence of what makes a great recorded performanceThe film resulted in unexpected insights into how sound recording was developed and perfected and its impact on how musicians communicate on recordings today. MacMahon filmed the live performances like a Hollywood musical in single unedited takes to focus on the music, the sound the machine produced, and the impact it had on the artists performances. The technical aspects of the recording were covered in sequences interspersed throughout the film where, with rigorously filmed tracking shots and extreme close-ups using a macro lens, the viewer could observe and understand the inner workings of the machine.The film received widespread acclaim for its direction, musical performances, sound and cinematography. The film won the Discovery Award and the Audience Award at the Calgary International Film Festival, was nominated for a Primetime Emmy Award, Bernard MacMahon and Allison McGourty were nominated as Breakthrough Talents by the British Academy Film Awards and won a Grammy Award for the Alabama Shakes performance of “Killer Diller Blues”."}