{"_movieID": "331583", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:43:40", "summary": "The Whole Truth is a 2016 American thriller film directed by Courtney Hunt and written by Nicholas Kazan. The film stars Keanu Reeves, Gabriel Basso, Gugu Mbatha-Raw, Renée Zellweger, and Jim Belushi.\nThe film was released on October 21, 2016.", "plot": "Defense attorney Richard Ramsay works on a tough case to defend 17-year-old Mike Lassiter for the alleged murder of his wealthy lawyer father Boone Lassiter. Ramsay, being a good personal as well as professional friend of Boone, feels double pressure to gather evidence to save Mike but finds it harder to do so as Mike completely stops talking after the incident. Ramsay employs a young talented lawyer Janelle Brady, daughter of another professional friend, as his assistant, after she left corporate law to pursue career in criminal defense.  \nThe first witness, a flight attendant for a charter flight, states that she witnessed certain tension between father and son on a return journey from Stanford. In a flashback its shown that Mike wants to go to Reeds while Boone forces him to attend Stanford. The police officer who first responded to the call testifies that at the scene of the crime, Mike muttered 'I should've done it long ago', and she and the chief detective affirms that his fingerprints were found on the murder weapon. \nThe Lassiters' neighbors testify that Mike was very close to Boone when he was young but gradually grew distant in his teens and also report Boone's arrogant attitude towards his family and neighbors. Series of flashbacks show Boone's various affairs and his bossy and belittling behavior towards his wife, Loretta, both in public and private. Loretta testifies and confirms that she had indeed endured emotional and physical abuse for years, including the day of his death. She testifies that she went to take a shower after the fight and when she came back, she found his dead body. She tearfully says that Mike admitted to her that he did it. Ramsay provides pictures of her bruised body, taken a day after her husband's death, as an evidence of Boone's cruelty towards her. \nAfter that, Mike finally decides to talk and wants to take the stand to present his case and threatens to fire Ramsey when he objects. He corroborates his mother's and neighbors' version about his father's arrogance and cruelty, and suddenly admits to killing his father, not to save his mother but to save himself as he was molested by his father since he was about 12. It stopped for a while but his father resumed it on their flight back from Stanford and he killed him when he again tried it on the day of his death. \nProsecution calls the flight attendant who first insists that nothing happened on the flight but later, owing to tactful line of questioning by Janelle, and to cover up her extramarital affair with the co-pilot, she admits that there's a chance that she spent too much time in cockpit to confidently deny any unusual interaction between father and son. Janelle later gets suspicious about Mike's story and meets Loretta outside the courtroom and gradually deduces that Mike has taken blame on himself to protect Loretta. She confronts Ramsey but he says that his duty was to save Mike, not to dwell deep into the case. She angrily leaves, making Ramsey worry about the Jury's reaction to her absence, but she later decides to continue with the case. \nDespite the lack of proper evidence of Boone's mistreatment of his son, the Jury decides to acquit Mike. While waiting for his belongings in a private room, Mike confronts Ramsey, saying that he saw Ramsey's watch lying beside his father's corpse, which was covertly removed by his mother while she persuaded Mike to step away from the body. Mike says that he took blame to save his mother but now, as he was certain of Ramsey's involvement, wants to restart the case. Ramsey denies his suspicions and tells him that the case won't stand and it only hurts Mike's credibility. \nMike doesn't believe him but reluctantly decides not to pursue it for the lack of further evidence. As they all leave the court house, Ramsey recalls the true events. He and Loretta were having an affair and when Boone gets suspicious about his wife's infidelity, Ramsey advises him to divorce her but Boone repeats what he always says- he'd kill her if she ever leaves him. He implies that he knew it was Ramsey she was involved with but doesn't explicitly say anything about it. Loretta and Ramsey conspire to kill him and present the case as self-defense on Loretta's part but Mike comes home early and takes blame upon him before they could arrange the evidence and confesses to detective that he committed the crime."}