{"_movieID": "109431", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:50:09", "summary": "Identity Thief is a 2013 American comedy film directed by Seth Gordon, written by Craig Mazin, and starring Jason Bateman and Melissa McCarthy. The film tells a story about a man (Bateman) whose identity is stolen by a woman (McCarthy).\nDespite negative critical reception, the film was a commercial success, grossing over $174 million worldwide on a $35 million budget.", "plot": "In Denver, accountant Sandy Patterson buys identity theft protection from Diana, a con artist, over the phone and reveals all of his personal information. At work, after Sandy clashes with his obnoxious and bullying boss, Harold Cornish, he receives a phone call that reminds him he has an appointment at a salon in Florida. Confused, he puts it out of his mind when co-worker Daniel Casey suggests they and several others leave Cornish's company and start their own firm; Sandy agrees to join them.\nWhile paying for gas, Sandy's credit card is declined, and Luis, the attendant, cuts it up. As the credit card company tells him that he has spent huge amounts of money in Florida, he is arrested for missing a court date there. At the police station, Detective Reilly determines Diana has stolen Sandy's identity. The situation worsens when cops ask Daniel, now his boss, about Sandy's possession of drugs. Reilly says Sandy's name was used to buy drugs from someone named Paolo. Even though it's clear Sandy is not guilty, Reilly states he cannot be formally cleared of suspicion until they have evidence of Diana's guilt as it still could technically be Sandy in the eyes of the law. Daniel states they may have to fire Sandy due these issues. When the police say they can do nothing due to jurisdictional issues unless the identity thief is in Denver, Sandy offers to retrieve her and convince her to clear his name with his boss, despite his wife, Trish's concerns. Daniel gives Sandy a week to clear up the mess, otherwise he will lose his job.\nSandy manages to track Diana at the salon in Florida, but when he confronts her, she steals his rental car. Finding her address in her abandoned car, he investigates her house, which is full of merchandise and stolen credit cards. The pair scuffle; before Sandy can handcuff her, criminals Marisol and Julian burst in, angry that Diana gave Paolo bad credit cards. After Sandy and Diana escape, Sandy tells her about his plan to restore his reputation, and she agrees to help on condition that no police are involved, Sandy agrees, but secretly has plans to have police in the next room when she speaks to his boss. Because their IDs are identical, flight is impossible, and they travel to Denver by car. \nMeanwhile, a skiptracer is dispatched to track down Diana for a substantial bounty. He catches up to the pair at a motel in Georgia and captures Diana. Sandy gives chase; Diana knocks the skiptracer unconscious, and Sandy rams his van off the road. When Sandy's rental car gets plowed and totaled by an oncoming semi, they take the skiptracer's van, with him tied up in the back. When it overheats, they continue on foot. Diana thanks Sandy for saving her and calls him a good friend, but Sandy coldly says they are not friends. Hoping to reach a nearby bus station, they take a detour through a forest, but get lost and have to spend the night. Sandy discards his pants when he finds a snake in them, and Diana accidentally knocks him unconscious when another bites his neck. The next morning, Sandy wakes at a bus station, and Diana says she carried him until she flagged down a truck. As the next bus to Denver leaves in three days, Sandy uses money hidden in his socks to buy a $200 car from an auto wrecking yard. Low on funds for gas money, Diana offers to help; Sandy is at first reluctant, but Diana asks if he does not know anyone who truly deserves it. The pair then con an accounts processor at a branch of Sandy's old firm in St. Louis, and, out of vengeance, steal Cornish's identity to create new credit cards. Meanwhile, Marisol shoots the skiptracer, and the criminals continue their pursuit of Sandy and Diana.\nThat evening, the two share dinner, and Diana admits she does not know her real name due to growing up as a foster child. Soon, the accounts processor enters with the police, who arrest Sandy and Diana. Diana uncuffs herself in the back of the police car, breaks the back windshield, and escapes with Sandy. The skiptracer shoots and abducts Marisol and Julian, finds Diana and Sandy on the highway mid-escape, hits Diana with his car, and is arrested, along with Marisol and Julian. Sandy comes to her aid, but Diana revives and defensively strikes Sandy in the throat. Diana and Sandy eventually return to Denver, where Diana has dinner with Sandy's family and reconciles with them.\nThe next morning, Sandy finds Diana gone and a note that apologizes for the trouble she caused. Sandy prepares to quit his job, but Daniel shows him that Diana turned herself in. Detective Reilly tells Sandy he is no longer part of the investigation, then congratulates him for catching Diana, who is then arrested. Before she leaves, Sandy asks her why; Diana says she knew he would not turn her in, but it was the right thing to do. A year later, Sandy celebrates another birthday, this time with his third child. The family visits Diana in prison, and Sandy presents her with a birth certificate that reveals her name as Dawn Budgie. They both agree it is an awful name. When Diana heads back to her cell, a guard insults her, Diana punches the guard, and another guard stuns her with a Taser. As she recovers and walks back to her cell, Sandy watches with a shocked and slightly bemused expression."}