{"_movieID": "257091", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:57:15", "summary": "Get Hard is a 2015 American comedy film directed by Etan Cohen (in his directorial debut) and written by Cohen, Jay Martel and Ian Roberts. The film stars Will Ferrell, Kevin Hart, Tip 'T.I.' Harris, Alison Brie, and Craig T. Nelson. The film was released on March 27, 2015 to negative reviews but was a financial success, grossing over $111 million worldwide.\n\n", "plot": "James King (Will Ferrell) is an extremely wealthy hedge fund manager at Barrow Funds, run by Martin Barrow (Craig T. Nelson). He is engaged to Martin's daughter Alissa (Alison Brie). James has come to know Darnell Lewis (Kevin Hart), who manages a small car wash service in the garage used by James. Darnell and his wife Rita (Edwina Findley) are trying to put their daughter Makayla (Ariana Neal) in a better school, away from the bad neighborhood they live in.\nDuring an engagement party for James and Alissa, the FBI arrive and arrest James for fraud and embezzlement. James' lawyer, Peter Penny (Greg Germann), urges him to go for a guilty plea and a likely short sentence, but James refuses and insists that he will be exonerated. Instead, James is found guilty and sentenced to ten years in San Quentin State Prison, with the judge (Elliot Grey) giving him 30 days to get his affairs in order. Though forbidden from crossing county lines, James wants to flee the country with Alissa, but she dumps him.\nJames encounters Darnell and, assuming he has been incarcerated before because he is black, begs him for help and agrees to pay him $30,000 to toughen him up for prison. Darnell, who has little idea of how to act tough, trains James by pepper-spraying him, trying to get him to develop a \"mad dog\" face, and creating scenarios in which James must defend himself, but all of these efforts fail miserably. During the training, James gets in touch with Martin and says he is getting help. Barrow, the actual crook, thinks James is onto him and orders a hitman named Gayle (Paul Ben-Victor) to monitor him.\nWith no sign that James is toughening up, Darnell figures that James should be prepared in other ways for prison and takes him to a gay hookup spot for James to learn how to perform oral sex in prison. James can't go through with it and tells Darnell that he will keep going and do whatever it takes to \"get hard\". James starts to work out harder and faster, makes shivs, and learns \"keistering\" (smuggling contraband in the anus). Darnell simulates a prison raid with help from James' domestic staff. In the chaos, James gets a shiv stuck in his head, so Darnell takes James to his home for Rita to treat it. He has dinner and listens to Darnell make up a story of how he went to prison, which is just a retelling of Boyz n the Hood.\nJames and Darnell resolve for James to join a local gang called the Crenshaw Kings to gain protection in prison. However, Darnell's cousin Russell (T.I.), the gang leader, rebuffs James and redirects him to the Alliance of Whites gang. James is unable to be a convincing racist, leading the gang to think he is a cop, but Darnell rescues him by bursting in with a flamethrower.\nDarnell and James finally deduce that Martin is the crook. They sneak into his office and find the embezzlement records on Martin's computer. Unfortunately, Gayle finds them and takes back the computer, while informing James that Darnell has never been in prison. Dejected, James returns to the Crenshaw Kings on his own. They accept him and order him to kill someone as their initiation. Darnell arrives in time to convince James to expose Martin. The two sneak onto Martin's yacht to retrieve the computer, only to come across Gayle and his men. James unleashes a series of capoeira moves on them before Martin and Alissa arrive, both confessing to the fraud and embezzlement, a scheme that also included Peter. They try to convince James to run away with them, but he turns them down and heads to a life raft with Darnell. When Gayle shoots the life raft, James pulls out a gun he had \"keistered\" and aims it at Gayle. U.S. Marshals suddenly appear, summoned by the ankle monitor that James triggered, having worn it past the county line.\nBarrow's computer provides the evidence needed to clear James. Martin, Gayle, Alissa, and the henchmen are arrested and James is cleared of all charges. However, he gets arrested for his unlicensed gun. Darnell's training helps James through his six-month prison sentence - something that Martin is unprepared for as he is quickly attacked by inmates when his San Quentin sentence with Peter begins. James spends his sentence helping the FBI retrieve all the assets that Martin stole, while guiding Darnell's investments so that he and Rita are able to open their own carwash. As Darnell drives James home after his release, James announces his intent to celebrate his freedom with a Wall Street Journal and a forty, which he now considers a perfect Sunday.", "cast": "Will Ferrell as James King, a hedge fund manager who is framed for embezzlement\nKevin Hart as Darnell Lewis, a car wash attendant who helps James prepare for prison\nCraig T. Nelson as Martin Barrow, the head of Barrow Funds and father of Alissa who frames James for embezzlement\nAlison Brie as Alissa Barrow, the gold-digging fiancé of James and daughter of Martin Barrow\nEdwina Findley as Rita Lewis, Darnell's wife\nTip 'T.I.' Harris as Russell, Darnell's cousin who is the leader of the Crenshaw Kings\nAriana Neal as Makayla Lewis, Darnell and Rita's daughter\nErick Chavarria as Cecelio, James' gardener\nKatia Gomez as Rosa, James' maid\nGreg Germann as Peter Penny, a lawyer associated with James and Martin\nPaul Ben-Victor as Gayle, Martin's hired help\nJohn Mayer as himself, he performs at James and Alissa's engagement party and later appears on The Tonight Show Starring Jimmy Fallon where he talks about James and sings a sample about his ballad about him\nJon Eyez as Big Mike\nNito Larioza as Jaoa\nDan Bakkedahl as Leo\nRon Funches as Jojo, a member of the Crenshaw Kings\nElliot Grey as Judge, an unnamed judge that presides over James' trial\nMatt Walsh as Bathroom Stall Man\nT. J. Jagodowski as Chris\nDominique Perry as Shonda\nJimmy Fallon as himself (uncredited), he interviews John Mayer about being present during James' arrest"}