{"_movieID": "336472", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:16:35", "summary": "Love Thy Nature is a 2016 documentary film directed by Sylvie Rokab and narrated by Liam Neeson. The film underwent development in the mid-2000s, with production lasting nearly a decade. Produced and distributed by In The Light Productions, the first version of the film premiered on 18 October 2014 at the Hollywood Film Festival, with a film festival run throughout 2014 and 2015 and a theatrical run with the final version of the film in 2016. It has had nearly 300 theatrical and community screenings in 140 cities in 16 countries, earned 27 awards, and was covered in 28 publications.The film has been used to help advance local environmental organizations' mission as well as grow the nature-connecting movement. The film team partnered with film screenings' hosts to create \"view and do\" events, offering audience members the opportunity to engage in a nature program following the screening of the film. Rokab expanded this concept by creating Love Thy Nature Journeys with expeditions and workshops which start with the screening of the film and then transitions into activities guiding attendees in the wilderness for nature communion and forest therapy.", "cast": "Liam Neeson as Sapiens (voice), the narrative character of the film.IntervieweesDayna Baumeister is a researcher, design consultant, author, public speaker and co-founder of Biomimicry 3.8 and the Biomimicry Guild. Her extensive Biomimicry research work resulted in establishing the first Biomimicry Professional Certification Program.\nBrian Swimme is a cosmologist, CIIS professor, and Director of the Center for the Story of the Universe. He is known for his work which includes a series of educational videos, authoring several published books, and hosting and writing the PBS film Journey of the Universe.\nAndy Lipkis is the founder and CEO of TreePeople, a non-profit dedicated to emphasizing the importance of maintaining natural surroundings in urban areas throughout Los Angeles County.\nDuane Elgin is a NASA consultant, social scientist, public speaker, and author. Through his work, he has emphasized on looking deeper into the trends transforming the world.\nStephen R. Kellert was a Board Member of Biological Capital, co-founder and consultant of Environmental Capital Partner,Yale University professor and scholar, and author. He is credited as being a leading authority on environmental conservation movements.\nEvon Peter is an indigenous leader, who is the Vice Chancellor for Rural, Community and Native Education at UAF and co-founder of the Native Movement.\nJean Shinoda Bolen is a psychiatrist, Jungian analyst, author, and public speaker. She has authored 10 books with over eighty foreign translations along with appearing in Oscar-winning Women – for America, for the World (1986).\nJay Harman  is an Australian Biomimicry Inventor, credited as a pioneer of biomimicry. His designed are apart of a permanent collection at the New York Museum of Modern Art.\nElisabet Sahtouris is an evolution biologist, futurist, author, and public speaker. Her work has credited for showing the significance of biological systems in globalization and government.\nJulian Walker is an American yoga instructor, retreat coordinator, author, and blogger, whose recent work has made connections between psychology and neurosciences to spirituality and body care.\nAlex Zaphiris is a family integrative physician based in San Francisco, CA. Zaphiris helps those who struggle with mental health and addition, primarily. She puts an emphasis on getting to \"the root\" of one's issue through alternative therapies\nPhilip Barr is an American integrative medical physician who emphasizes on internal and integrative healing."}