{"_movieID": "426543", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:09:52", "summary": "The Nutcracker and the Four Realms is a 2018 American fantasy adventure film directed by Lasse Hallström and Joe Johnston based on a screenplay by Ashleigh Powell and Tom McCarthy. It is a retelling of E. T. A. Hoffmann's short story \"The Nutcracker and the Mouse King\" and Marius Petipa's and Pyotr Ilyich Tchaikovsky's The Nutcracker, about a young girl who is gifted a locked egg from her deceased mother and sets out in a magical land to retrieve the key. The film stars Keira Knightley, Mackenzie Foy, Eugenio Derbez, Matthew Macfadyen, Richard E. Grant, Misty Copeland, with Helen Mirren, and Morgan Freeman. \nThe film was announced in March 2016 with Hallström directing a script by Powell. Much of the cast signed on that summer, and filming began in October at Pinewood Studios, lasting through January 2017. In December 2017, it was announced Joe Johnston would direct a month of reshoots written by Tom McCarthy, with Hallström agreeing to Johnston receiving co-directing credit.\nThe Nutcracker and the Four Realms premiered in Los Angeles on October 29, 2018, and was released by Walt Disney Studios Motion Pictures in the United States on November 2, 2018, in RealD 3D and Dolby Cinema. The film grossed $174 million worldwide, against a production budget of over $120 million, making it a box office bomb. It received generally negative reviews from critics, criticizing the slow pace and lack of dance numbers and also deeming the film as \"soulless\" and \"incoherent\", although the visual effects received some praise.", "plot": "In Victorian London, England on Christmas Eve, Mr. Stahlbaum gives his children the Christmas presents his wife Marie had set aside for them before she died. The younger daughter, Clara, receives a handcrafted egg-shaped box, which she is unable to unlock. In the package, she discovers a note from her mother that states that the inside of the egg is all she would ever need. The Stahlbaum family then heads to a Christmas Eve ball, hosted by the children's godfather and skilled engineer Drosselmeyer. Refusing to dance with her father, Clara scurries from the crowd to ask Drosselmeyer how to unlock her egg. He then reveals to Clara that the egg was a creation of his that he gifted to Clara's mother when she was younger, and that her mother's wish was to bestow the gift to her daughter.\nReturning to the ballroom, where Drosselmeyer announces it being time for the children to receive their gifts, then Clara gets scolded by her father for disobeying him and not dancing with him. They call each other selfish, after which Clara finds her string with her name on it, signifying her gift, and follows it into a forest in a parallel world where she sees the key. Before she can grab it, a mouse snatches it. Unable to reach the mouse, which crosses a frozen-over river, Clara approaches Captain Philip Hoffman the Nutcracker. He leads her across the bridge into the Fourth Realm, but they are unable to obtain the key from the mice. Captain Philip then guides Clara to the palace, where she meets three regents of each land: the Sugar Plum Fairy of the Land of Sweets; Shivers of the Land of Snowflakes, and Hawthorne of the Land of Flowers. They tell Clara that they are at war with the Land of Amusements which they now refer to as \"the Fourth Realm\".\nWatching a ballet that tells the story of their world's creation, the Sugar Plum Fairy explains to Clara that her mother created this world as a young girl. She later explains that Marie animated everyone with a machine that can turn toys into real-life people. Sugar Plum says that she can use this machine to defend the other three realms against Mother Ginger, the Regent of the Fourth Realm, but it needs a key. Clara notices that the machine's keyhole matches that of the one on her egg. Clara and her soldiers head towards Mother Ginger and steal the key the mouse had snatched. However, Clara is disappointed upon discovering that the egg is only a music box.\nOnce Sugar Plum obtains the key, she uses the machine to turn toy soldiers into life-size soldiers that obey her every command, including the one to attack the Fourth Realm. She then reveals that she had lied about Mother Ginger who, with her people, resisted against Sugar Plum's plan of taking over all four realms in revenge for her perceived abandonment by Marie and that the machine can turn this world's people back into toys as well, intending that to be the fate of the other regents who resist her. Sugar Plum then imprisons Clara, Captain Philip, Shivers, and Hawthorne.\nWhen Clara opens her egg-shaped music box again, she discovers that the top flips up to reveal a mirror, illustrating that all she needed was herself. She and the other prisoners escape and she and Captain Philip are then greeted by one of Mother Ginger's mice who shows Clara another way into the machine room and guides Captain Philip to Mother Ginger to convince her to help Clara overthrow Sugar Plum. Clara enters the machine room and shuts down the machine while fighting off soldiers. Mother Ginger comes to her aid and helps her to fight off the soldiers. Sugar Plum ultimately traps Mother Ginger and attempts to turn her back into a toy with the machine. However, Clara tinkers with the machine so that it aims at Sugar Plum, which zaps her and turns her back into a porcelain doll as punishment for high treason to the Realms, deactivating her army and saving Mother Ginger.\nThanked for restoring peace among the Realms and the implied destruction of Sugar Plum, Clara promises to visit the Realms in the future and returns to London, where time has hardly passed since she left. She then approaches her father, apologizes for her earlier behavior, and asks him to dance. He accepts, and Clara opens her music box. Clara's father becomes emotional and reveals that the music box's song was the first song that he and Clara's mother had ever danced to. The two then continue to dance throughout the night.", "cast": "Mackenzie Foy as Clara Stahlbaum, a young girl who travels into the Four Realms, searching for a key of a gift from her late mother Marie.\nJayden Fowora-Knight as Captain Philip Hoffman, a nutcracker who helps Clara on her journey. He was named after the late Philip Seymour Hoffman.\nKeira Knightley as The Sugar Plum Fairy, the regent of the Land of Sweets. It is revealed that Sugarplum lied about Mother Ginger being evil, and wanted to rule the Four Realms.\nHelen Mirren as Mother Ginger, regent of the Land of Amusements (also known as The Fourth Realm). Sugarplum lied about Mother Ginger being evil, leaving her to be betrayed by the Realms.\nMorgan Freeman as Drosselmeyer, Clara's godfather, a skilled engineer, who gives her a magical gift that once belonged to her mother.\nEugenio Derbez as Hawthorne, regent of the Land of Flowers.\nRichard E. Grant as Shiver, regent of the Land of Snowflakes.\nMisty Copeland as The Ballerina Princess, a gifted dancer in the mysterious Four Realms.\nMatthew Macfadyen as Benjamin Stahlbaum, Clara's father and a widower following the death of his wife Marie.\nAnna Madeley as Marie Stahlbaum, Clara's late mother who created and ruled over the Four Realms as a child.\nSergei Polunin as The Sweets Cavalier, a dancer who performs alongside the Ballerina Princess.\nEllie Bamber as Louise Stahlbaum, Clara's older sister.\nTom Sweet as Fritz Stahlbaum, Clara's younger brother.\nJack Whitehall as Harlequin, a guard at The Palace of the Four Realms.\nOmid Djalili as Cavalier, another guard at The Palace of the Four Realms and Harlequin's cohort.\nMeera Syal as The Stahlbaum's Cook, a member of staff in the Stahlbaum household.\nCharles \"Lil Buck\" Riley as The Mouse King, ruler of the legion of mice. Riley also provided the choreography and motion capture performance for the character.Although it was originally announced that Miranda Hart had been cast in the role of The Dew Drop Fairy, she did not appear in the final cut of the theatrical release for the film. Maestro Gustavo Dudamel has a brief cameo conducting an orchestra in a shot modeled after the Toccata and Fugue in D minor segment of Fantasia."}