{"_movieID": "283350", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:26:13", "summary": "Before We Go is a 2014 American independent romantic drama film directed by Chris Evans in his directorial debut, and starring Evans and Alice Eve. The film had its world premiere in the special presentations section of the 2014 Toronto International Film Festival. The film was released on video on demand on July 21, 2015, and had a limited release on September 4, 2015 in the United States by Radius-TWC.", "plot": "While busking in Grand Central Terminal, Nick Vaughan (Chris Evans) sees a woman, Brooke Dalton (Alice Eve), drop her phone while running to catch a train. She misses the train and returns to the station where Nick returns her broken phone. When he finds her standing outside the terminal she confesses that she has just been robbed and is trapped in the city. He offers to pay for a cab to take her to Boston but his debit card is declined and his credit card is expired. When he tries to call a friend to come loan him the money he finds his phone has died. Nick offers to try to pay for a room for Brooke for the night, but she insists that she needs to reach Boston by morning.\nNick decides to help Brooke find her missing purse. They are able to track it down at a sweatshop that deals in stolen purses. Nick heads inside to retrieve the purse while Brooke uses a payphone to call her husband. After using the phone she then gets a couple of police officers to investigate the building Nick is in. The sweatshop owners get spooked, punch Nick, and run out along with the bag. They then head for the wedding of a friend of Nick's, hoping to borrow money. Along the way Nick and Brooke open up more about why they're in New York. Brooke had just sold a painting and was going to surprise her husband by coming home early. Nick has an audition for a band that he has wanted to play with for a while. Instead of ending up at the wedding, they stumble upon an event where they are mistaken for members of the band. Nick and Brooke perform My Funny Valentine and flee when the real band shows up. After their last-ditch attempt to get a bus to Boston fails for lack of funds, Brooke borrows a man's phone, calls a friend, and begs her to retrieve a letter she has left for her husband that she does not want him to read.\nElated that her problem is now solved, Brooke offers to go to Nick's friend's wedding and pretend to be his girlfriend in front of his ex, Hannah. At the reception, Nick sees Hannah, but after being introduced to her new boyfriend, he leaves abruptly. Outside Nick tells Brooke that this was the first time he had seen Hannah since she rejected his marriage proposal and broke up with him six years ago. At Brooke's insistence, Nick goes back to speak to Hannah and discovers that she is pregnant and that their relationship is truly over. Wandering around the city, the two find a psychic who is still open. After he reads her future, he allows Brooke to use his phone and she learns her friend could not get into her home to retrieve the letter.\nAfter they leave the psychic, Brooke reveals to Nick that she discovered that her husband was cheating on her. Though he ended the relationship, she discovered that he was going to see his mistress again. Devastated, she wrote him a letter ending the marriage and went to New York for work. However, during her trip she received a phone call from her husband saying he was coming home early and realized that he had ended the relationship for good.\nAt a restaurant Nick tells Brooke that her husband will most likely understand that what he did was wrong and that if he doesn't, that's that. Brooke, worried about getting home before her husband, sneaks out the back of the restaurant and tries to hail a cab. Nick appears, frustrated that she tried to bail on him, and they argue about their relationships and the relationship with each other. They then go to Nick's friend's hotel room. Together they unwind from the nights adventures and write on the back of paintings in the room (a reference to an earlier encounter with a painting with erotic writing on the back of it). They then share a kiss and reflect on their night.\nIn the morning they return to the train station where they are about to part. Suddenly, Nick picks up a phone from a phone booth and, like an earlier joke, uses it as a \"time machine\" and pretends to call himself, saying that he will meet a woman and \"you will need her more than she needs you\". They share one last kiss and finally depart. On her way home, Brooke finds a guest service paper that she and Nick filled out at the hotel. On the bottom it says \"Turn over,\". After reading what was on the back, she smiles.", "cast": "Chris Evans as Nick Vaughan\nAlice Eve as Brooke Dalton\nEmma Fitzpatrick as Hannah Dempsey\nMark Kassen as Danny\nDaniel Spink as Tyler\nElijah Moreland as Cole\nJohn Cullum as Harry\nScott Evans as Concierge\nAndre Pith as Man"}