{"_movieID": "440472", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:37:44", "summary": "The Upside is a 2017 American comedy-drama film directed by Neil Burger and written by Jon Hartmere. It is a remake of the French 2011 film The Intouchables, which was itself inspired by the life of Philippe Pozzo di Borgo. The film follows a paralyzed billionaire (Bryan Cranston) who strikes up an unlikely friendship with a recently paroled convict (Kevin Hart) whom he hires to take care of him. Nicole Kidman, Golshifteh Farahani, and Julianna Margulies also star.  It is the third remake of The Intouchables after the Telugu film Oopiri, and the Argentinian film Inseparables (2016).An English-language remake was first announced in July 2011. Numerous actors were rumored to star, including Chris Rock, Idris Elba, Colin Firth and Jessica Chastain, and different directors, including Paul Feig and Simon Curtis, were attached to direct. Hart officially signed on in October 2014, Cranston in March 2016, and Burger to direct that August. Filming began in Philadelphia in January 2017.\nThe film premiered at the 2017 Toronto International Film Festival. Originally to be distributed by The Weinstein Company in March 2018, the film was shelved and sold off following the Harvey Weinstein sexual abuse allegations. It was eventually bought by STX Entertainment and Lantern Entertainment (the successor of TWC), who then released it in the United States on January 11, 2019, becoming Lantern's first release. The Upside grossed $122 million worldwide and received mixed reviews from critics, who praised Hart and Cranston's chemistry and performances but criticized the plot for being \"predictable and cliché\".", "plot": "Speeding through New York City in a Ferrari, Dell Scott (Kevin Hart) and quadriplegic Philip Lacasse (Bryan Cranston) are pulled over by the police. Dell convinces the officers that he is rushing Philip to the emergency room; Philip grudgingly plays along, and the two are escorted to the hospital.\nSix months earlier, Dell needs signatures to prove he is seeking a job or he will be held in violation of his recent parole. He enters a building seeking a janitorial job, but ends up in the penthouse home of Philip, a wealthy quadriplegic. Philip, with his assistant Yvonne Pendleton (Nicole Kidman), is interviewing candidates for the position of his \"life auxiliary\" caregiver. Dell barges in and demands a signature for his parole officer. Intrigued, Philip offers him the job over Yvonne's objections, but Dell declines.\nDell visits his ex-wife Latrice (Aja Naomi King) and son Anthony (Jahi Di'Allo Winston) at their dilapidated apartment, but neither is willing to accept Dell back into their lives. He gives Anthony a book he stole from Philip's library. Dell then accepts Philip's offer; Yvonne stipulates that he must show he can handle his responsibilities, and \"three strikes\" will get him immediately fired. Dell, having no training, is initially daunted, despite guidance from Philip's physical therapist Maggie (Golshifteh Farahani), and quickly earns two strikes. Dell leaves to give his first paycheck to Latrice and asks for the stolen book back, but she refuses. Upon his return, Yvonne gives him a third strike for his unexplained absence, but Philip covers for him.\nWhen Philip explains his strict Do Not Resuscitate order, Dell realizes he has lost the will to live, but when he finds Philip struggling to breathe, refuses to allow him to die. Dell takes Philip out into the city, where they share a joint to ease Philip's neurogenic pain. Dell and Philip begin to bond, and Philip tells Dell that he was paralyzed in a paragliding accident, and later lost his wife to cancer. Dell adjusts to caring for Philip, even modifying his wheelchair, and is introduced to opera and modern art; he creates his own painting, which Philip displays in the penthouse.\nDell suspects that Yvonne has feelings for Philip, but she informs him that Philip is in an epistolary relationship with a woman named Lily (Julianna Margulies); they have never met or even spoken, corresponding only through letters. With Dell's encouragement, Philip leaves Lily a voicemail.\nPhilip joins Dell as he takes Anthony out for the day. Everything goes well until Dell asks Anthony for the book back; disappointed in his father, Anthony returns the book and leaves. Dell and Philip return home to a surprise birthday party Yvonne has organized with Philip's neighbors against his wishes. He argues with Dell, who then smashes various items around the room at his bidding as a means of catharsis. Dell and Philip share another joint, and then socialize at the party. Carter (Tate Donovan), a neighbor Philip dislikes, approaches him about Dell's criminal record, but Philip ignores him. Lily calls Philip, and they agree to have dinner.\nAt the restaurant, Philip reveals Carter bought Dell's painting for $50,000, which he gives him to start his own business. When Lily arrives, she allows Dell to leave, having researched Philip's condition in advance, but gradually becomes agitated and overwhelmed. Hurt, Philip abruptly ends the date and returns home, where he lashes out and fires Dell.\nTime passes; Dell buys Latrice and Anthony a new home, and starts a business building motorized wheelchairs. Maggie asks Dell to help Philip, who has sunken into depression and driven Yvonne away. Dell takes Philip for a drive, leading to the encounter with police. They flee the hospital and repair their friendship. Dell surprises Philip with a paragliding trip, and is surprised himself when he is forced to join. Dell then brings Philip to meet Yvonne, leaving the two of them to reunite as he returns home to Latrice and Anthony. \nThe film's ending subtitles state that Dell and Philip remain close friends.", "cast": "Kevin Hart as Dell Scott\nBryan Cranston as Phillip Lacasse\nNicole Kidman as Yvonne Pendleton, Phillip's PA\nGolshifteh Farahani as Maggie, Phillip's PT\nAja Naomi King as Latrice, Dell's ex-wife\nTate Donovan as Carter, Phillip's neighbor\nJahi Di'Allo Winston as Anthony, Dell's son\nGenevieve Angelson as Jenny, Phillip's late wife\nSuzanne Savoy as Charlotte, Phillip's cook\nJulianna Margulies as Lily, Phillip's epistolary love interest"}