{"_movieID": "474214", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:45:09", "summary": "Trading Paint (also released as Burning Rubber) is a 2019 sports film starring John Travolta, Michael Madsen, Shania Twain, and Toby Sebastian. It is directed by Karzan Kader, with a script co-written by Craig Welch and Gary Gerani.Principal photography began in August 2017 in Alabama.\n\n", "plot": "Sam (John Travolta) and Cam Munroe (Toby Sebastian) are a father and son duo competing at the Talladega dirt car race pits. Sam is a local racing legend who now supports his son's racing in between dating divorcee Becca (Shania Twain). Despite being a talented racer, Cam's car doesn't race well due to poor funding. Frustrated for losing the race due to engine issues, Sam's long-time rival, Linsky, offers Cam a chance to join his team with a new car. Cam decides to leave his father to join Linksy as a chance to prove his worth and win races. When Cam tells his father about his choice to join Linsky, Sam is enraged and warns that Linsky is a snake before firing his own son from the garage.\nFeeling down from Cam's defection, Sam spends the night drinking his woes away. By the following day, Sam decides to bring himself out of retirement and restore his status as a champion racer. While everyone thinks Sam is crazy to race so late in life, he quickly proves his experience and driving skills are still top notch and wins several races. With Sam reclaiming his title as champion racer, Linsky feels threatened by Sam and wants Cam to crash into Sam's car. Unable to crash into his father, Linsky has another racer stage a crash at the next race. Dunn causes Cam to spin out and Sam crashes into Cam's car onto the side. Although Cam survives his crash, he suffers multiple fractures on his leg and he is out of race for several months.\nIn between these six months of recovery, Sam and Cam make peace with each other and Sam learns about Linsky wanting Cam to crash into him. With both cars severely damaged, they need a new car to get back into racing. Throughout this time, Sam has kept the 1970 Mustang that killed his wife. Because of sentimental value, he could never sell it. However, in order to buy a new dirt Late Model for Cam to drive, which costs about $80,000, Sam decides to sell his car to Linsky. Now devoting all his energy into building the new car, the Munroe family pools their efforts into getting the car ready and supports Cam's return to the circuit. \nLinsky wants to beat Sam to finally prove who's the better racer; he has to settle with racing Cam instead. During the race, Linsky spins out Cam in the final two laps of the race. Cam manages to restart his car and rallies from the rear of the field over the final two laps (which is quite unlikely) and wins the race. Linsky is denied his victory as Munroe won the race. When commenting about the race with the press, Cam gives credit to Sam and his loving wife for their support. In the aftermath, the Munroes celebrate Cam's daughter's first birthday. Cam has gotten a new apartment to settle the family in and Sam solidifies his relationship with Becca, having finally found happiness and peace with his life.", "cast": "John Travolta as Sam Munroe\nShania Twain as Becca\nToby Sebastian as Cam Munroe\nRosabell Laurenti Sellers as Cindy (Cam's wife)\nMichael Madsen as Linsky\nKevin Dunn as Stumpy\nBuck Taylor as Ben\nLuis Da Silva as Diner Redneck\nMargaret Bowman as Martha\nGioia Libardoni as Kelly\nDenny Méndez as Dr. Deena Thompson\nChris Mullinax as Jack Dunn\nJen Baker and Faith Bruner as Track Girls\nJonathan Aidan Cockrell as James\nJohn Flanagan as Race Car Driver\nHaley Flanagan as Banquet Dancer\nAudrey Fafard as Jenny Monroe"}