{"_movieID": "157834", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:45:52", "summary": "The Zero Theorem is a 2013 British-French-Romanian science fiction film directed by Terry Gilliam and starring Christoph Waltz, Lucas Hedges, Mélanie Thierry, Matt Damon, David Thewlis, and Tilda Swinton. Written by Pat Rushin, the story centres on Qohen Leth (Waltz), a reclusive computer genius working on a formula to determine whether life holds any meaning.\nGilliam has given conflicting statements about whether his personal view is that the film serves as the third part of a satirical dystopian trilogy or \"Orwellian triptych\" begun with 1985's Brazil and continued with 1995's 12 Monkeys.The film began production in October 2012.", "plot": "Qohen Leth, an eccentric programmer who refers to himself in the plural, is assigned to \"crunch entities\" for a company named Mancom. Finding himself suffering existential angst, Qohen constantly waits for a phone call, hoping that it might bring him happiness or the answers he seeks. When Qohen requests a \"disability\" evaluation, three company doctors determine that he is physically healthy, but require he have therapy from Dr Shrink-ROM, an AI therapist designed to provide mental evaluation. Wanting to meet with \"Management\", Qohen attends a party held by his supervisor, Joby. Stumbling into an empty room, Qohen finds Management and requests to work from home, as he would be more productive and would no longer risk missing his call; Management simply notes he finds Qohen \"quite insane,\" but later grants his request. Qohen is pressed into staying at the party by Joby, but chokes on an olive and is rescued by Bainsley, a partygoer. \nAs he begins working from home, Qohen is required to order the data of the Neural Net Mancrive, a massive supercomputer that contains all of the entities crunched by workers, with the goal of solving the \"Zero Theorem\", a mysterious mathematical formula. Qohen spends months as a hermit working on the program, during which he is diagnosed with multiple conditions by Shrink-ROM and begins experiencing nightmares involving a black hole.\nFrustrated with his work, Qohen smashes his computer with a hammer, and is soon visited by Bainsley. Qohen confides in Bainsley that he believes he accidentally hung up a call that would have given him the meaning of life, and has desperately been waiting for a call-back ever since. Qohen is then visited by Bob, the teenage son of Management. Bob repairs his computer, reveals Management is spying on him, and suggests that Bainsley is only interested in Qohen because she is paid to be. Bob promises to get Qohen his call if he continues working on the Zero Theorem. Having received a VR suit from Bainsley, Qohen interacts with her through virtual reality, which makes them both appear on a beach together. When Qohen asks if the sun in the horizon ever sets, Bainsley responds it is not programmed to do so. They soon kiss one another.\nBob visits Qohen again and tells him that the Zero Theorem aims to prove life is meaningless through the Big Crunch theory. Digitally connecting to Bainsley again, Qohen is comforted by her, but when he denounces Management and suggests eloping together, she forcefully disconnects, damaging Qohen's suit. When Bob takes his suit to repair it, Qohen connects to Bainsley unannounced, only to discover she is a webcam stripper. Bob returns with Qohen's suit, now repaired, and reveals Qohen's phone call is only a delusion, and admits his Dr. Shrink-ROM was only designed to identify his pathology rather than treat it. Bainsley visits Qohen and apologizes for deceiving him, claiming she truly fell in love with him. Despite Bainsley's offer to elope, which is encouraged by Bob, Qohen turns her down.\nQohen discovers Bob's health is radically declining. While caring for Bob, Qohen begins to uncover and smash Management's cameras hidden throughout his home, after which Management employees break in and take Bob away. Joby is fired by management as a result of this and visits Qohen to berate him. Qohen dons his now \"repaired\" virtual reality suit and connects to his computer, but is nearly electrocuted.\nAppearing at the Neural Net Mancrive, Qohen is greeted by an image of Management, who tells him that Bob is hospitalized due to a chronic illness. Management explains that Qohen is now part of the Neural Net, there is no meaning of life, and there was never a higher power able to grant Qohen his call. Management explains that while the Zero Theorem would prove that everything is meaningless, the entire purpose of Mancom in \"crunching entities\" was to bring order to disorder, finding meaning in some form that he could sell. Management chose Qohen to solve the Zero Theorem because Qohen had faith in finding meaning — the antithesis of the theorem (and having done nothing but wait for his call, he had lived a meaningless life). Management tells Qohen he no longer needs him and disappears, leading Qohen to smash the Neural Net, collapsing it and revealing a black hole inside. Smiling, Qohen jumps into it, only to appear back on the virtual beach. Resigned, calm and alone, Qohen stands in front of the sea and, after interacting with the sun, watches the sunset he caused. \nAs the credits roll, Bainsley's voice calls to Qohen.", "cast": "Christoph Waltz as Qohen Leth:A loner computer programmer and mathematician searching for the meaning of life. The script called for Qohen to be bald; Gilliam insisted that Waltz also shave his eyebrows, both to challenge his acting and visually differentiate Qohen from Waltz's previous roles. Ewan McGregor and Billy Bob Thornton were previously cast.Mélanie Thierry as Bainsley:A femme fatale who enters Qohen's life. Gilliam resisted pressure to cast an established American actress, wanting someone whom few viewers had seen. The director stated that \"the difference is, in particular the American actresses, they all look similar, they're all the same shape, they're all trimmed down. I want somebody's who's real and beautiful at the same time. She had a kid a couple of years ago, so she has a real body as opposed to these manufactured bodies.\" Thierry had previously played \"reserved, beautiful characters\"; Gilliam instructed her to think of Bainsley as \"Marilyn Monroe and Judy Holliday combined\". Jessica Biel was originally attached to the role.David Thewlis as Joby\nLucas Hedges as Bob\nMatt Damon as Management. Al Pacino was previously attached to the role.\nTilda Swinton as Dr Shrink-ROM\nSanjeev Bhaskar as Doctor 1\nPeter Stormare as Doctor 2\nBen Whishaw as Doctor 3\nDana Rogoz as pizza girl\nEmil Hostina as Clone 1\nPavlic Nemes as Clone 2\nGwendoline Christie, Rupert Friend, Ray Cooper, and Lily Cole as street commercials"}