{"_movieID": "314385", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:36:28", "summary": "The sea, the world ocean or simply the ocean is the connected body of salty water that covers over 70% of Earth's surface (361,132,000 square kilometres (139,434,000 sq mi), with a total volume of roughly 1,332,000,000 cubic kilometres (320,000,000 cu mi)). It moderates Earth's climate and has important roles in the water cycle, carbon cycle, and nitrogen cycle. It has been travelled and explored since ancient times, while the scientific study of the sea—oceanography—dates broadly from the voyages of Captain James Cook to explore the Pacific Ocean between 1768 and 1779. The word sea is also used to denote smaller, partly landlocked sections of the ocean and certain large, entirely landlocked, saltwater lakes, such as the Caspian Sea and the Dead Sea.\nThe most abundant solid dissolved in sea water is sodium chloride. The water also contains salts of magnesium, calcium, and potassium, amongst many other elements, some in minute concentrations. Salinity varies widely, being lower near the surface and the mouths of large rivers and higher in the depths of the ocean; however, the relative proportions of dissolved salts varies little across the oceans. Winds blowing over the surface of the sea produce waves, which break when they enter shallow water. Winds also create surface currents through friction, setting up slow but stable circulations of water throughout the oceans. The directions of the circulation are governed by factors including the shapes of the continents and Earth's rotation (the Coriolis effect). Deep-sea currents, known as the global conveyor belt, carry cold water from near the poles to every ocean. Tides, the generally twice-daily rise and fall of sea levels, are caused by Earth's rotation and the gravitational effects of the orbiting Moon and, to a lesser extent, of the Sun. Tides may have a very high range in bays or estuaries. Submarine earthquakes arising from tectonic plate movements under the oceans can lead to destructive tsunamis, as can volcanoes, huge landslides or the impact of large meteorites.\nA wide variety of organisms, including bacteria, protists, algae, plants, fungi, and animals, live in the sea, which offers a wide range of marine habitats and ecosystems, ranging vertically from the sunlit surface and shoreline to the great depths and pressures of the cold, dark abyssal zone, and in latitude from the cold waters under polar ice caps to the colourful diversity of coral reefs in tropical regions. Many of the major groups of organisms evolved in the sea and life may have started there.\nThe sea provides substantial supplies of food for humans, mainly fish, but also shellfish, mammals and seaweed, whether caught by fishermen or farmed underwater. Other human uses of the sea include trade, travel, mineral extraction, power generation, warfare, and leisure activities such as swimming, sailing, and scuba diving. Many of these activities create marine pollution. The sea is important in human culture, with major appearances in literature at least since Homer's Odyssey, in marine art, in cinema, in theatre and in classical music. Symbolically, the sea appears as monsters such as Scylla in mythology and represents the unconscious mind in dream interpretation."}