{"_movieID": "52449", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:39", "summary": "Bad Teacher is a 2011 American comedy film directed by Jake Kasdan based on a screenplay by Lee Eisenberg and Gene Stupnitsky, and starring Cameron Diaz, Justin Timberlake, Lucy Punch, Jason Segel, and Phyllis Smith.\nThe film was released in the United States and Canada on June 24, 2011. It focuses on a lazy middle school teacher who returns to the teaching job she hates and tries to make enough money for breast implants after her wealthy fiancé dumps her.", "plot": "Elizabeth Halsey is an immoral English teacher at John Adams Middle School (JAMS) in Cook County, Illinois. She is foul-mouthed and greedy, drinks alcohol heavily, smokes marijuana, and shows movies while sleeping through class. She plans to quit teaching and marry her wealthy fiancé Mark, but resumes her job when he dumps her after learning she is only after his money. Elizabeth tries to win over substitute teacher Scott Delacorte, who is also wealthy because his family runs a watch company. Amy Squirrel, a dedicated and enthusiastic colleague, also pursues Scott while the school's gym teacher, Russell Gettis, makes it clear that he is interested in Elizabeth romantically, and she is not interested in him because he is a gym teacher.\nElizabeth plans to get surgery to enlarge her breasts and becomes all the more motivated to do so once she learns Scott's ex-girlfriend had large breasts, but she cannot afford $9,300 for the procedure. She feels worse when Scott admits that he is interested in Amy, and that he only likes Elizabeth as a friend. Elizabeth attempts to raise money for the surgery by participating in her 7th grade class car wash in provocative clothing and by manipulating parents to give her money for more school supplies and tutoring, but her efforts are not enough. Amy, acting on the growing resentment between them due to Elizabeth pursuing Scott and ignoring school rules, attempts to warn the principal about Elizabeth's embezzlement scheme, but he dismisses her claims as groundless.\nElizabeth later learns from her best friend, Lynn Davies, that the teacher of the class with the highest state test scores will receive a $5,700 bonus. With this knowledge, Elizabeth decides to change her style of teaching, forcing the class to intensely read and study To Kill a Mockingbird for the upcoming test. However, the change is too late and insufficient. The students receive low scores on their quizzes, frustrating her even more. Meanwhile, she befriends Russell the gym teacher as Amy and Scott start dating. Desperate to pay off the procedure for her breast surgery, Elizabeth steals the state test answers by disguising herself as a journalist and seducing Carl Halabi, a state official who is in charge of creating and distributing the exams. Elizabeth gets Carl drunk and convinces him to take her to his office to have sex, but she spikes his drink and steals a copy of the answers. A month later, Elizabeth's class aces the test and she wins the bonus, giving her the funds needed to get her breasts enlarged.\nWhen Elizabeth learns that Amy and Scott are chaperoning an upcoming field trip, she smears an apple with poison ivy and leaves it for Amy, who ends up with her face breaking out in blisters, so she cannot go. On the trip, Elizabeth seduces Scott. They dry hump and Elizabeth secretly calls Amy using Scott's phone leaving a message recording all the action, ensuring she knows about the affair. Elizabeth ultimately finds Scott unsatisfying. On a field trip, her student Garrett is embarrassed and ridiculed by his classmates after publicly confessing his unrequited love for a classmate named Chase. Elizabeth consoles him afterwards and tells him how she is too superficial to return his interest, which causes Elizabeth to reflect on her own superficial ways. To stop the other students from making fun of Garrett, she helps by giving him her bra and telling everyone she caught a student from another school giving him a handjob.\nLeft behind at the school, Amy switches Elizabeth's desk with her own to trick the janitor into unlocking Elizabeth's sealed drawer. Amy finds Elizabeth's journalist disguise and the practice test, which leads her to suspect Elizabeth cheated on the state exam. Amy informs the principal and gets Carl to testify against her. However, Elizabeth took embarrassing photos of Carl while he was drugged and, with the help of her roommate, Kirk, uses them to blackmail him to say she is innocent. Having failed to expose Elizabeth's cheating, Amy accuses her of drug use, based on a tip from a student. When the police arrive and bring their sniffer dog to search the school, they find Elizabeth's mini liquor bottles, marijuana and OxyContin pills in Amy's classroom (the desks were not switched back), in a secret compartment Elizabeth helpfully points out to the police. At the end of the school year, Amy is moved to another school in the county by the superintendent. Scott asks Elizabeth to start over, wanting a relationship with her, but Elizabeth rejects him to be with Russell, who she has learned she has a lot in common with.\nWhen the new school year starts, Elizabeth has not gotten the breast enlargement after all, because she feels that she looks fine the way she is. She also has a new position as the school's guidance counselor.", "cast": "Cameron Diaz as Elizabeth Halsey, a gold-digging, drug-abusing teacher\nJustin Timberlake as Scott Delacorte, a wealthy substitute teacher whom Elizabeth likes\nLucy Punch as Amy Squirrel, Elizabeth's co-worker and rival who attempts to get Elizabeth discredited, fired and arrested\nJason Segel as Russell Gettis, a gym teacher who is smitten with Elizabeth\nPhyllis Smith as Lynn, Elizabeth's best friend and fellow teacher\nJohn Michael Higgins as Wally Snur, the principal at JAMS\nDave Allen as Sandy Pinkus\nMolly Shannon as Melody Tiara, Garrett's mother who invites Elizabeth to spend Christmas with her family\nEric Stonestreet as Kirk, Elizabeth's roommate\nThomas Lennon as Carl Halabi, an educator who gets seduced and blackmailed by Elizabeth\nNat Faxon as Mark, Elizabeth's wealthy fiancé who dumps her at the beginning of the film\nKaitlyn Dever as Sasha Abernathy, a student who seems to idolize Elizabeth\nMatthew J. Evans as Garrett Tiara, a lovestruck boy\nNoah Munck as Tristan Munck, one of Elizabeth's students who frequently bullies Garrett\nKathryn Newton as Chase Rubin-Rossi, a popular, superficial student and Garrett's crush\nAja Bair as Devon, Gaby and Chase Rubin-Rossi's friend, later ends up with Garret\nAndra Nechita as Gaby, Devon and Chase Rubin-Rossi's friend\nChristine Smith as Doctor's Assistant (one with augumented breasts)\nJillian Armenante as Ms. Pavicic"}