{"_movieID": "267860", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:09:33", "summary": "London Has Fallen is a 2016 American action thriller film directed by Babak Najafi. It is the second installment in the Fallen film series, following Olympus Has Fallen (2013). The film stars Gerard Butler, Aaron Eckhart, Morgan Freeman, Alon Moni Aboutboul, Angela Bassett, Robert Forster, Jackie Earle Haley, Melissa Leo, Radha Mitchell, Sean O'Bryan, Waleed Zuaiter, and Charlotte Riley. The film follows a plot to assassinate the world leaders who are attending the funeral of British Prime Minister in London and United States Secret Service agent Mike Banning's efforts to protect US President Benjamin Asher from being killed by the terrorists.\nFilming began in London on October 24, 2014. A Christmas break started in November, with filming resuming in February 2015. The film was released in the United States on March 4, 2016, by Focus Features. It grossed $205 million worldwide. However, the critical reception was generally negative.\nA sequel, titled Angel Has Fallen, was released on August 23, 2019.", "plot": "G8 intelligence services track down Pakistani arms dealer and terrorist mastermind Aamir Barkawi (Alon Moni Aboutboul) and authorize an American drone strike on his compound, apparently killing Barkawi and his family.\nTwo years later, Prime Minister of the United Kingdom James Wilson dies suddenly, and world leaders prepare to attend his funeral in London. Director of the United States Secret Service Lynne Jacobs (Angela Bassett) assigns agent Mike Banning (Gerard Butler) to lead U.S. President Benjamin Asher’s (Aaron Eckhart) overseas security detail, even though Banning's wife Leah (Radha Mitchell) is due to give birth in a few weeks. The entourage arrives via Air Force One at Stansted Airport, and Banning arranges an earlier arrival at Somerset House in London via Marine One.\nAs Asher's Presidential State Car arrives at St Paul's Cathedral, coordinated attacks by terrorists disguised as Metropolitan Police, the Queen's Guardsmen, and other first responders kill five Western leaders, damaging major landmarks and generating mass panic. Asher's early arrival throws off the St. Paul's attack, and Banning returns Asher and Jacobs to Marine One.\nThe terrorists destroy the helicoptor’s escorts with Stinger missiles, forcing the damaged helicopter to crash-land in Hyde Park. Fatally injured, Jacobs makes Banning promise to stay alive for his unborn child, and to punish those responsible for the attack. Banning escorts Asher into the London Underground as the city's power is lost and residents shelter indoors.\nIn Washington, D.C., U.S. Vice President Allan Trumbull (Morgan Freeman) investigates the incident with British authorities while trying to track down the President. Trumbull receives a call from Barkawi, still alive and operating out of Yemen. Barkawi takes responsibility for the attacks coordinated by his son Kamran (Waleed Zuaiter), seeking revenge for the drone strike that killed his family, especially his daughter who was to be married that day.\nHaving poisoned Wilson to lure Western leaders to London, Barkawi knows Asher is still alive, and promises that if Kamran captures him, he will broadcast Asher’s execution online. Trumbull orders his staff to locate Barkawi's known operatives and find any connection to the attack, while British authorities stands down all first responders so any left in the open can be identified as terrorists.\nAfter leaving a sign to be picked up by satellite, Banning leads Asher to an MI6 safe-house, where Jacquelin \"Jax\" Marshall (Charlotte Riley) briefs them. Marshall receives a voice message from Trumbull that they saw Banning's sign and an extraction team is en route. Security monitors show an approaching Delta Force team, but Banning suspects they have arrived too soon and may be terrorists working for Barkawi and Kamran.\nBanning’s suspicions are confirmed as he fights off the terrorists and drives away with Asher, but their car is struck by the terrorists before they can reach the US Embassy, and Asher is taken. Banning is rescued by the combined Delta Force and SAS extraction team, who suspect there is a mole in the British government.\nTrumbull's staff identify a building owned by Barkawi, drawing massive power despite being unoccupied, and suspect it is Kamran's headquarters. Banning joins the extraction team to infiltrate the building, arriving seconds before Kamran can decapitate Asher. Kamran escapes when one of his men drops a grenade, forcing Banning to protect Asher from the blast.\nBanning and Asher escape just before the building is destroyed by the Delta Force/SAS squad, killing Kamran and the remaining terrorists. Marshall and British authorities restore London's security system and, discovering that MI5 Intelligence Chief John Lancaster (Patrick Kennedy) aided Barkawi's attack, she kills him when he goes for his own gun. Trumbull tells Barkawi that his plan failed, moments before the building is destroyed by another drone strike, killing Barkawi and his guards.\nTwo weeks later, Banning is home spending time with Leah and their newborn child Lynne, named after Jacobs. As Banning contemplates sending a letter of resignation, he watches Trumbull speak on television regarding the recent events, with a message that the U.S. will prevail. Inspired, Banning deletes the letter."}