{"_movieID": "400155", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:07:12", "summary": "Hotel Transylvania 3: Summer Vacation (released internationally as Hotel Transylvania 3: A Monster Vacation; also known as Hotel Transylvania 3 and marketed as such on home release) is a 2018 American computer-animated comedy film produced by Sony Pictures Animation and distributed by Sony Pictures Releasing. The third installment in the Hotel Transylvania franchise and sequel to Hotel Transylvania 2 (2015), it was directed by Genndy Tartakovsky and written by Tartakovsky and Michael McCullers, and features Adam Sandler, Andy Samberg, Selena Gomez, Kevin James, David Spade, Steve Buscemi, Keegan-Michael Key, Molly Shannon, Fran Drescher, and Mel Brooks reprising their roles, as well as new additions to the cast including Kathryn Hahn and Jim Gaffigan. In the film, Dracula finds love with a ship captain named Ericka Van Helsing while on a vacation on a cruise with his family and friends, but Mavis discovers that Ericka is actually the great-granddaughter of Abraham Van Helsing, Dracula's arch-enemy.\nHotel Transylvania 3: Summer Vacation premiered at the Annecy International Animated Film Festival on June 13, 2018, and was theatrically released in the United States on July 13. The film received mixed reviews from critics and it was a box office success, grossing over $528 million worldwide, against a budget of $80 million. To date, it is the highest-grossing film in the Hotel Transylvania series and Sony Pictures Animation's highest-grossing film worldwide to be completely animated. A sequel is currently in development and is scheduled to be released on December 21, 2021.", "plot": "In 1897, Dracula and his friends travel in disguise on a train to Budapest. Professor Abraham Van Helsing, Dracula's arch-enemy, boards the train and unveils the monsters; the monsters escape by climbing through the roof, and Dracula pushes his friends off the train for their safety. Van Helsing is obsessed with destroying Dracula but is constantly outsmarted by him.\nIn the present day, Dracula is running his hotel business smoothly, with his daughter Mavis and son-in-law Johnny. Drac is depressed that he has remained single since his wife Martha's death despite his attempts to meet someone. Misinterpreting this as stress from overwork, Mavis books a cruise so they can all take a break and spend more time together as a family. Dracula, Mavis, Johnny, Dennis, Vlad, and the hotel guests board a cruise ship called the Legacy. Dracula sees the ship's human captain, Ericka, and immediately falls for her, something that he thought was impossible as he had already \"zinged\" before.\nEricka goes to a private and secret room on the lower decks where she meets Abraham Van Helsing, who is revealed to be her great-grandfather and is almost completely mechanised, to avoid death. Van Helsing has a plan to eliminate all the monsters, in the cruise upon its arrival at the lost city of Atlantis using an Instrument of Destruction, which could be found in Atlantis' ruins. Van Helsing makes Ericka promise to not assassinate Dracula beforehand, but she makes repeated unsuccessful attempts. Dracula's friends hear Ericka complain about her inability to get him and misinterpret this as a sign of affection. Dracula nervously asks Ericka out on a date, and she accepts since she sees this as another chance to kill him. As they dine on a deserted island, Ericka unexpectedly begins to fall in love with Drac, after they learn about each other's pasts.\nMavis discovers Dracula is interested in Ericka and becomes suspicious of Ericka's motives. The cruise ship reaches Atlantis, which has been converted into a casino; Dracula decides to tell Mavis the truth about Ericka but gets distracted seeing Ericka enter an underground crypt. Drac follows her, with Mavis not far behind, and learns that Ericka is after a \"family heirloom\". With Dracula's help, she evades the booby traps around the object and escapes. Mavis arrives and confronts them, and Dracula confesses that he \"zinged\" with Ericka, to Mavis' surprise and confusion. After Ericka is told what a \"zing\" is, she rejects Dracula's romantic feelings, leaving Dracula distraught.\nA regretful Ericka gives Van Helsing the object – revealed to be the Instrument of Destruction – and he sets a trap for the monsters at a dance party. Noticing that Dracula is still sad about Ericka, Mavis, after some advice from Johnny, tells her father to talk to Ericka, admitting that she was afraid of him leaving her, which allays Drac's fears. Van Helsing shows up and pushes away the DJ, and a saddened Ericka is forced to reveal that she is his great-granddaughter. Van Helsing unveils the Instrument of Destruction, a case for a music note sheet, and plays a song that drives a friendly Kraken living near the island to attack the monsters. Dracula tries to stop the Kraken, but gets injured. Ericka saves Dracula from the Kraken and pleads with her great-grandfather to stop the destruction, confessing her love for Drac. This infuriates Van Helsing, and he attacks them both.\nTo pacify the Kraken, Johnny opens up a portable DJ kit and plays positive songs (Good Vibrations, and Don't Worry, Be Happy) to beat Van Helsing's song. Upon playing the Macarena, the Kraken is relaxed and happy for good; Van Helsing is unable to counter the song as everyone begins to dance, including the music sheet. When Van Helsing also dances, he accidentally slips and falls, but Dracula saves him. Touched by the act of kindness, Van Helsing apologizes to the monsters and gives everyone a full refund for the cruise, before sending them back. Back at Hotel Transylvania, Dracula proposes to Ericka, who stammers at the question before agreeing."}