{"_movieID": "293167", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:29:03", "summary": "Kong: Skull Island is a 2017 American monster film directed by Jordan Vogt-Roberts and written by Dan Gilroy, Max Borenstein and Derek Connolly. The film is a reboot of the King Kong franchise, and serves as the second film in Legendary's MonsterVerse. The film stars Tom Hiddleston, Samuel L. Jackson, John Goodman, Brie Larson, Jing Tian, Toby Kebbell, John Ortiz, Corey Hawkins, Jason Mitchell, Shea Whigham, Thomas Mann, Terry Notary, and John C. Reilly.\nThe film was announced in July 2014 at San Diego Comic-Con and Vogt-Roberts was announced as the director in September 2014. The project originally began at Universal as an origin story but was later moved to Warner Bros. in order to develop a shared cinematic universe featuring Godzilla and King Kong. Principal photography began in October 2015 in Hawaii and various locations around Vietnam and ended in March 2016.\nKong: Skull Island had its world premiere at Empire, Leicester Square on February 28, 2017 and was released on March 10, 2017, by Warner Bros. Pictures. The film received generally positive reviews, with praise for its visual effects, action, and performances (particularly that of Jackson and Reilly). It was also a box office success, grossing $168 million domestically and $566 million worldwide. The film was nominated for Best Visual Effects at the 90th Academy Awards. A sequel, Godzilla vs. Kong, is scheduled to be released on March 13, 2020.", "plot": "In 1944, two World War II fighter pilots, American pilot Hank Marlow and Japanese pilot Gunpei Ikari, parachute onto an island in the South Pacific after a dogfight and engage in close combat, but the fight is interrupted by a giant ape.\n29 years later, in 1973, Bill Randa, head of the U.S. government organization Monarch, plans a search for primeval creatures on the recently-discovered Skull Island. He hires a military force commanded by Lieutenant Colonel Preston Packard, tracker and former British Special Air Service Captain James Conrad, and anti-war photographer Mason Weaver. Arriving at Skull Island, Packard's men begin dropping seismic explosives, developed by Randa's seismologist Houston Brooks, to map out the island and prove Brooks' Hollow Earth theory. Suddenly, the air unit is attacked by the giant ape, scattering the survivors across the island. Two groups form between the survivors: Conrad, Weaver, the researchers and one of the soldiers gather quickly, while Randa and the rest of the soldiers land a few miles away. Packard goes in search of the transport helicopter piloted by his right-hand man Major Jack Chapman, intending to use the weapons on board to kill the ape.\nConrad's group eventually encounters the local Iwi natives and an older Marlow. Marlow tells the group that the giant ape is named Kong, and he protects the island from many predators, including a race of subterranean reptilian creatures christened \"Skullcrawlers\". The Skullcrawlers are responsible for killing Kong's entire species, leaving him as the last of his kind. The Iwi believe that when Kong dies, the most powerful Skullcrawler, or \"the Big One\" as Marlow calls it, will awaken and ravage the island. Marlow reveals he and Ikari became friends, but Ikari was killed by a Skullcrawler some time ago. As Chapman is ambushed and devoured by a Skullcrawler, Conrad's group helps Marlow complete a boat built from parts of Marlow's and Ikari's downed planes. They ride down the river, and manage to secure communication with Packard's group. They regroup with Packard, who insists on searching for Chapman. Marlow leads them through a mass grave, but they are attacked by the Skullcrawler that killed Chapman, killing Randa and others before dying in a flammable gas explosion triggered by Weaver. Learning about Chapman's death, Packard reveals his plan to kill Kong and avenge his fallen men. Marlow and Brooks explain that killing Kong would lead to the Skullcrawlers running rampant, but Packard, due to the loss of so many of his men, has become obsessed and refuses to listen. The group parts ways, with Packard's group retrieving the weapons from Chapman's chopper and laying a trap for Kong at a nearby lake, while the non-military personnel head back to the boat. While scouting the path ahead, Conrad and Weaver encounter Kong up close and, seeing his true peaceful nature, they resolve to save him. Packard's group lures Kong with the remaining seismic charges and incapacitates him with ignited napalm.\nConrad, Weaver, and Marlow arrive and after a standoff, persuade the other soldiers to spare Kong, but Packard, still insane, refuses. \"The Big\" Skullcrawler emerges from the lake and Packard is crushed by Kong. The Skullcrawler fights and overpowers Kong, but with the humans' help, the ape emerges victorious in the end. The survivors reach the rendezvous point and leave the island as Kong watches. During the credits, Marlow returns home, reuniting with his wife, meeting his son for the first time, and watching a Chicago Cubs game on television.\nIn a post-credits scene, Conrad and Weaver are detained and recruited by Monarch. They are informed by San Lin and Brooks that Kong is not the only monster king to roam the world and are shown archive footage of cave paintings depicting Godzilla, Rodan, Mothra, and King Ghidorah. As the screen cuts to black, Godzilla's roar can be heard.", "cast": "Tom Hiddleston as James Conrad:A former British Special Air Service Captain who served in the Vietnam War with the Australian Special Air Service Regiment, hired as a hunter-tracker for the expedition by Randa. Hiddleston described his character as a man who holds \"no political allegiance in the conflict\" but \"understands conflict\", further stating, \"He's a former soldier who has been formed by an understanding of war, but his specific skill set is something that's attached to the power of nature; and I think that's something people haven't seen in a long time\".\nSamuel L. Jackson as Preston Packard:A United States Army Lieutenant Colonel and leader of the Sky Devils helicopter squadron, assigned to escort the group of explorers on the expedition. Jackson compares his character to Captain Ahab from Moby-Dick, stating, \"He does have to exact some measure of revenge for the people he's lost. That's just the nature of how we operate—eye for an eye!\".\nJohn Goodman as Bill Randa:A senior official in the government organization Monarch, who is in charge of the expedition.\nBrie Larson as Mason Weaver:An anti-war photographer and investigative photojournalist. Larson stated that her character has her \"own sort of motive\" as to why she joined the expedition: \"That's the interesting thing about this movie. It's a group of misfits that are all coming from different angles looking at the same thing. You get to see how many different views in regards to nature and how we should handle it are dealt with from many different perspectives\". Larson further added that Weaver has an \"interest and respect for nature\" and \"Through that she has a closer, more loving, and intimate relationship with Kong\".\nJing Tian as San Lin:A biologist working for Monarch. According to Vogt-Roberts and Borenstein, her role was originally larger but had been reduced. Alison de Souza of the Straits Times wrote that in the final film Jing Tian's role would be described in Chinese as a \"hua ping\" (花瓶), meaning a vase, which refers to insignificant roles, and that she \"hardly does or says a thing.\"\nToby Kebbell as Jack Chapman:A United States Army major and Sea Stallion helicopter pilot who is Packard's right-hand man.\nJohn Ortiz as Victor Nieves:A senior Landsat official on the expedition.\nCorey Hawkins as Houston Brooks:A geologist and Yale University graduate, recruited for the expedition by Monarch for his groundbreaking theories on seismology. An older version portrayed by Joe Morton appears in Godzilla: King of the Monsters.\nJason Mitchell as Glenn Mills:A warrant officer and helicopter pilot of the Sky Devils and close friend of Cole.\nShea Whigham as Earl Cole:A seasoned Captain of the Sky Devils who wields an AK-47 instead of an M16 and close friend of Mills.\nThomas Mann as Reg Slivko:A warrant officer of the Sky Devils, known for carrying a portable record player.\nTerry Notary and Toby Kebbell as King Kong (mo-cap performance):A 104-foot-tall gorilla who is the last of his kind and is worshiped as the king and god on Skull Island by the Iwi natives. Notary stated that this Kong is an adolescent and he tried to play Kong like a \"14-year-old that's trapped in the life of an adult\", stating that it took three days to film the motion capture scenes. In addition to playing Chapman, Toby Kebbell also provided some facial references for Kong, stating, \"I gave some facial reference – certain subtleties, certain looks. Terry and I worked on stuff together and created what Kong needed. I was just there as backup for pieces that Terry really wanted to get details on. It's a real honor to be asked by someone who's a great performer, to come and help support their performance.\"\nJohn C. Reilly as Hank Marlow:A U.S. Army Air Forces lieutenant of the 45th Pursuit Squadron who has been stranded for nearly 29 years on Skull Island since World War II. He knows the creatures of the island, and is a friend of the Iwi natives. Will Brittain portrays a young Hank Marlow, and also plays Marlow's son.Additionally, Eugene Cordero appears as Reles, a warrant officer of the Sky Devils and Packard's door gunner; Marc Evan Jackson portrays Steve Woodward, a Landsat employee on the expedition; Richard Jenkins portrays Senator Al Willis, a politician who reluctantly funds the expedition; Miyavi portrays Gunpei Ikari, a Japanese World War II pilot who crash-lands on Skull Island alongside Marlow; and Robert Taylor portrays the captain of the Athena. Thomas Middleditch voices Jerry."}