{"_movieID": "38167", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:34:56", "summary": "Eat Pray Love is a 2010 American biographical romantic drama film starring Julia Roberts as Elizabeth Gilbert, based on Gilbert's 2006 memoir of the same name. Ryan Murphy co-wrote and directed the film, which was released in the United States on August 13, 2010. It received mixed to negative reviews from critics, but was a financial success, grossing $204.6 million worldwide against a $60 million budget.", "plot": "Elizabeth Gilbert had everything a modern woman is supposed to dream of having – a husband, a house, a successful career – yet like so many others, she found herself lost, confused, and searching for what she really wanted in life. Newly divorced and at a crossroads, Gilbert steps out of her comfort zone, risking everything to change her life, embarking on a journey around the world that becomes a quest for self-discovery. In her travels, she discovers the true pleasure of nourishment by eating in Italy, the power of prayer in India, and, finally and unexpectedly, the inner peace and balance of true love in Indonesia.", "cast": "Julia Roberts as Elizabeth \"Liz\" Gilbert\nJavier Bardem as Felipe, a Brazilian businessman Gilbert falls in love with on her journey\nJames Franco as David, the man Gilbert has an intense relationship with while she is finalizing her divorce\nRichard Jenkins as Richard, a Texan Liz befriends at an Indian ashram\nViola Davis as Delia Shiraz, Gilbert's best friend\nBilly Crudup as Steven, Gilbert's ex-husband\nSophie Thompson as Corella, a woman at the Indian ashram\nMike O'Malley as Andy Shiraz, Delia's husband\nChristine Hakim as Wayan, Gilbert's best friend in Indonesia\nArlene Tur as Armenia\nHadi Subiyanto as Ketut Liyer, Gilbert's advisor in Indonesia\nGita Reddy as The Guru\nTuva Novotny as Sofi, Gilbert's Swedish best friend in Rome\nLuca Argentero as Giovanni, Gilbert's Italian tutor and Sofi's love interest\nRushita Singh as Tulsi, Liz's friend at the ashram who has an arranged marriage"}