{"_movieID": "88794", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:51:54", "summary": "J. Edgar is a 2011 American biographical drama film directed, produced and scored by Clint Eastwood. Written by Dustin Lance Black, the film focuses on the career of FBI director J. Edgar Hoover from the Palmer Raids onward. The film stars Leonardo DiCaprio, Armie Hammer, Naomi Watts, Josh Lucas, and Judi Dench. It marked Adam Driver's film debut.\nJ. Edgar opened the AFI Fest 2011 in Los Angeles on November 3, 2011, and had its limited release on November 9, 2011 followed by wide release on November 11. The film received mixed reviews from critics, although the performances were praised, and it grossed $84 million worldwide. It was chosen by the National Board of Review as one of the top ten films of 2011, while DiCaprio earned a nomination for a Golden Globe Award and both he and Hammer earned Screen Actors Guild Award nods.", "plot": "In 1919, after anarchists attempt to assassinate Attorney General A. Mitchell Palmer, he puts his protegé J. Edgar Hoover in charge of a new division dedicated to purging radicals. Hoover quickly begins compiling a list of suspects. He meets Helen Gandy, a new secretary at the Justice Department, and takes her to the Library of Congress to show her the card catalog system he devised. He makes an awkward pass at her, then proposes to her. She refuses him, but agrees to become his personal secretary.\nHoover finds that the Department of Labor refuses to deport anyone without evidence of a crime. Learning that Anthony Caminetti, the Commissioner General of Immigration, dislikes the anarchist Emma Goldman, Hoover arranges to make her eligible for deportation and thereby creates a precedent of deportation for radical conspiracy.  Following several such Justice Department raids of suspected radical groups, Palmer loses his job as Attorney General. His successor, Harlan F. Stone, appoints Hoover as director of the Justice Department's new Bureau of Investigation. Hoover meets lawyer Clyde Tolson, and hires him.\nWhen the Lindbergh kidnapping captures national attention, President Herbert Hoover asks the Bureau to investigate. Hoover employs several novel techniques, including the monitoring of registration numbers on ransom bills and expert analysis of the kidnapper's handwriting. When the monitored bills begin showing up in New York City, the investigators find a filling station attendant who wrote down the license plate number of the man who gave him the bill. This leads to the arrest, and eventual conviction, of Bruno Richard Hauptmann for the kidnapping and murder of the Lindbergh child.\nAfter Hoover, Tolson, and Hoover's mother (with whom Hoover still lives) see the James Cagney film G Men, Hoover and Tolson go out to a club, where Hoover is seated with Anita Colby, Ginger Rogers, and Rogers' mother Lela. Rogers' mother asks Hoover to dance and he becomes agitated, saying that he and Tolson must leave, as they have a lot of work to do in the morning. When he gets home, he tells his mother that he dislikes dancing with girls. She tells him she would rather he be dead than a \"daffodil\". She insists on teaching him to dance, and they dance in her bedroom.\nHoover and Tolson go on a vacation to the horse races. That evening, Hoover tells Tolson that he cares deeply for him, and Tolson tells Hoover that he loves him. Hoover panics and claims that he wants to marry Dorothy Lamour. Tolson accuses Hoover of making a fool out of him and they end up fighting on the floor. Tolson suddenly kisses Hoover, who says that must never happen again; Tolson says that it won't, and tries to leave. Hoover apologizes and begs him to stay, but Tolson threatens to end their friendship if Hoover talks about another woman again. After Tolson leaves, Hoover says that he loves him, too.\nYears later, Hoover feels his strength begin to decline, while Tolson suffers a stroke. Hoover tries to blackmail Martin Luther King, Jr. into declining his Nobel Peace Prize, sending him a letter threatening to expose his extramarital affairs. King disregards this and accepts the prize.\nHoover tells Gandy to destroy his secret files after his death in order to prevent President Richard Nixon from possessing them. He visits Tolson, who urges him to retire. Hoover refuses, claiming that Nixon is going to destroy the bureau he has created. Tolson accuses Hoover of having exaggerated his involvement with key events of the Bureau. Moments later, Hoover tells Tolson that he needed Tolson more than he ever needed anyone else. He holds Tolson's hand, kisses his forehead, and leaves.\nHoover returns home from work, obviously weakened. Shortly after Hoover goes upstairs, his housekeeper calls Tolson, who goes to the house and finds Hoover dead next to his bed. A grief-stricken Tolson covers his friend's body. Nixon gives a memorial speech on television for Hoover, while several members of his staff enter Hoover's office and search through the cabinets and drawers in search of his rumored \"confidential\" files, but find nothing. In the last scene, Gandy destroys stacks of files.", "cast": "Gunner Wright and David A. Cooper have cameos as future presidents Dwight D. Eisenhower and Franklin D. Roosevelt, respectively, and are seen in the group of onlookers who arrive following the bombing at A. Mitchell Palmer's house."}