{"_movieID": "58233", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:50:02", "summary": "Johnny English Reborn  is a 2011 spy action comedy film directed by Oliver Parker and written by Hamish McColl from a story by William Davies. A sequel to Johnny English (2003) and the second installment in the Johnny English series, it is a British-American venture produced by StudioCanal, Relativity Media and Working Title Films, and distributed by Universal Pictures. The film stars Rowan Atkinson (reprising his role as the title character) alongside Gillian Anderson, Dominic West, Rosamund Pike, Daniel Kaluuya and Richard Schiff as new characters.Much like its predecessor, the film parodies traits from the James Bond film series and clichés of the spy genre (as well as Atkinson's Mr. Bean character) and marks Atkinson and Tim McInnerny's second collaboration after the series Blackadder. Johnny English Reborn was met with mixed reviews but has grossed a total of $160 million worldwide.\nThe film was released in the United Kingdom on 7 October 2011, and topped the country's box office for the next two weekends, before being dethroned by Paranormal Activity 3. It was later released in North America on 21 October 2011. A sequel to the film, Johnny English Strikes Again was released in October 2018.", "plot": "Seven years after the events of the first film, Johnny English has been training in martial arts in Tibet after being fired and disgraced in a botched mission in Mozambique for failing to protect the newly-elected president. Upon being called back to service by MI7, he (under his new boss Pamela Thornton, codename \"Pegasus\") is put on a mission to investigate a plot to assassinate the Chinese Premier during scheduled talks with the Prime Minister. He meets fellow agent and old acquaintance Simon Ambrose, MI7's resident quartermaster Patch Quartermain, and junior agent Colin Tucker, who will be English's new assistant.\nIn Hong Kong, English finds former CIA agent Titus Fisher, who reveals himself to be a member of Vortex, a group responsible for ruining English's Mozambique mission. He reveals Vortex holds a secret weapon that requires three metal keys to unlock, owned by himself and two other former spies. However, when he reveals his key, Fisher is killed by an elderly woman assasin disguised as a maid, and another man steals the key. \nEnglish chases the thief across Hong Kong and manages to get the first key, but is duped by another Vortex operative disguised as a flight attendant en route back to London, and is humiliated in a meeting with the Foreign Secretary and Pegasus when he attempts to present the key and the plans.\nKate Sumner, MI7's behavioral psychologist, uses hypnosis to help English recall his suppressed memory of the Mozambique incident, revealing another Vortex operative, Russian spy Artem Karlenko, who is masquerading as millionaire Sergei Pudovkin. English and Tucker meet Karlenko at an exclusive golf course outside London. However, the Killer Cleaner critically injures Karlenko. English and Tucker try to bring him to a nearby hospital via a helicopter, but it is too late and Karlenko dies upon reaching the hospital, though he manages to reveal that the third and final key is held by a member of MI7, who is a mole.\nOver dinner, English confides with Ambrose about the mole. Ambrose confides with English that he suspects Quartermain is the traitor. Tucker later confronts Ambrose about him being the mole, but English, being the complete imbecile that he is, dismisses Tucker and lets Ambrose go free, giving him Karlenko's key. English confronts Quartermain, but realizes Ambrose has framed him as the third Vortex member. The other MI7 agents chase him, but he manages to escape and hide at Sumner's flat. When reviewing the footage of the Mozambique mission, Sumner realizes the assassin has been manipulated by Vortex via a mind control drug known as Timoxeline Barbebutenol. Ambrose comes to pick Sumner up and English realizes he is the mole after briefly recalling his memory in Mozambique. English encounters the Killer Cleaner, but manages to evade her by jumping into a garbage chute and heads to Tucker's apartment. English persuades Tucker to join him in infiltrating Le Bastion, a fortress in the Swiss Alps where the talks are to be held after apologizing for his mistake. \nIn the fortress, however, English accidentally activates a distress beacon that alerts the guards of the fortress to their presence. Left with no choice, English commands Tucker to knock him out and put him inside a body bag so that the both of them may go up to the fortress. Having been taken into the fortress, English manages to get out of the body bag and warns Pegasus of the threat, but accidentally imbibes the drug-spiked drink. Ambrose, at the scene, commands English to subdue Pegasus. \nAssigning English to be the Prime Minister's bodyguard in place of Pegasus, Ambrose orders him to assasinate the Chinese Premier using a pistol disguised as lipstick, which was initially designed for Pegasus. However, English tries to resist the drug and prevent himself from shooting the premier. Tucker arrives and interrupts Ambrose's communication feed briefly by cutting Cameo's \"Word Up\" into the frequency before Ambrose resets the communication, exposing himself to be the mastermind to the others in the process. English resists again and shoots Ambrose, who escapes while the drug enters its lethal stage to which English loses consciousness. Sumner arrives and is able to revive English with a passionate kiss. English then pursues Ambrose down the mountainside and both engage in a fistfight in a cable car. English manages to overpower Ambrose for a while, but accidentally falls out the carriage. \nAmbrose shoots at English, who tries to use his spy umbrella as a bulletproof shield, but is soon revealed to be a missile launcher when he closes it. The missile destroys the carriage, killing Ambrose. Later on, Vortex is shut down and English is to have his knighthood reinstated by the Queen. During the ceremony, the Killer Cleaner reveals herself disguised as the Queen and attacks English again before escaping, to which English accidentally attacks the real Queen and realizes his mistake only when the real Killer Cleaner is finally caught by the royal guards.\nDuring the credits, English prepares dinner for Kate to the tune of \"In the Hall of the Mountain King\".", "cast": "Rowan Atkinson as Johnny English, an accident prone but good hearted MI7 agent.\nGillian Anderson as Pamela Thornton a.k.a. Pegasus, head of MI7.\nDominic West as Simon Ambrose, a MI7 agent and colleague of English; later revealed as the main antagonist, as a member of Vortex.\nRosamund Pike as Kate Sumner, a behavioral psychologist at MI7, and English's love interest.\nDaniel Kaluuya as Colin Tucker, an MI7 agent who becomes English's assistant and sidekick in his mission.\nRichard Schiff as Titus Fisher, an ex CIA operative and member of Vortex.\nTim McInnerny as Patch Quartermain, MI7's wheelchair user quartermaster.\nPik-Sen Lim as The Killer Cleaner, an assassin hired by Vortex who attempts to kill English and appears variously as a grey-haired maid, Pegasus' mother, and later the Queen.\nStephen Campbell Moore as the British Prime Minister.\nBurn Gorman as Slater, a MI7 intelligence expert who works with Ambrose and is a member of Vortex.\nTogo Igawa as Ting Wang, English's mentor in Tibet, and MI7 sleeper agent.\nMark Ivanir as Artem Karlenko, a Russian former double agent and member of Vortex.\nJoséphine de La Baume as Madeleine, a deceivingly charming member of Vortex, responsible for luring English off his post in Mozambique.Lily Atkinson, the daughter of Rowan Atkinson, made her cameo appearance as the girl that gets her helmet stolen by Johnny English. Ben Miller reprised his role of Angus Bough from the previous film in one scene, but was cut from the final film. He would later reprise his role as Bough in Johnny English Strikes Again."}