{"_movieID": "382079", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:44:29", "summary": "Donald Trump's The Art of the Deal: The Movie is a 2016 American parody film by the production company Funny or Die. The satire of businessman Donald Trump was released during his 2016 campaign for President of the United States.\nLoosely based on the 1987 autobiographical book Trump: The Art of the Deal, the film purports to be a 1988 adaptation of the book, with Johnny Depp as Donald Trump, Michaela Watkins as Ivana Trump, and a supporting cast that includes Jack McBrayer, Stephen Merchant, Patton Oswalt, Alfred Molina, Henry Winkler, Andy Richter, Jacob Tremblay, Paul Scheer, Kristen Schaal, Jason Mantzoukas, and Ron Howard as himself.", "plot": "Director Ron Howard begins by saying that he has discovered a long-lost movie of the week based on Donald Trump's bestselling book The Art of the Deal that was written by, directed by and stars Trump himself.\nThe film starts in 1986, where a young boy stumbles into Donald Trump's office holding a copy of the book The Art of the Deal. Trump must then take a call from Merv Griffin, who refuses to sell him Taj Mahal Casino and Resort in Atlantic City. Trump then describes his background and personal history in order to educate the young boy.\nChapter 1: The Art of Intimidating Rent Controlled Tenants, which takes place in 1983, Trump meets a homeless vagrant and convinces him to scare away the tenants of one of the buildings he owns.\nChapter 2: The Art of Defeating Totally Bogus Discrimination Lawsuits features Trump in 1973 butting heads with the Mayor of New York City, Ed Koch. He agrees with club owner Igor Cassini that he won't sleep with any of the wives of the other club members. Trump recruits Roy Cohn to help him fight discrimination charges, which they win. Jerry Schrager becomes Trump's new lawyer after Cohn dies of AIDS.\nAfter performing a rap about litigation with hip-hop group The Fat Boys, Trump introduces Chapter 3: The Art of Suing Those Losers at the NFL. He recounts his feud with Pete Rozelle over the New Jersey Generals, which causes Trump to sue Rozelle for breaking antitrust laws. A judge rules in favor of Trump.\nAfter learning that the young boy is named Jose, Trump cuts to commercial and has him replaced with an Asian-American boy.\nTrump's wife Ivana enters the office, talking about her time working at the Trump Castle in Atlantic City. Trump then introduces Chapter 4: The Art of Buying a Casino from the Hilton Family, which recounts Trump traveling to meet Barron Hilton, who sells him a casino.\nIn Chapter 5: The Art of Marrying a Gorgeous Immigrant, he recounts his wedding to Ivana in 1977, where his best man was ALF.\nTrump once again tries to negotiate for the Taj Mahal with Griffin, to no avail. Trump's architect Der Scutt shows Trump his design for the Taj Mahal. After learning that the replacement boy is Japanese-American, Trump asks for a new kid, this time African-American, who gets immediately replaced with a Caucasian boy.\nThe final chapter, entitled Chapter 6: The Art of Building the Trump Tower, has Scutt and Trump discussing the plans for the soon-to-be-constructed Trump Tower in 1978. Trump meets with Tiffany & Co. head Walter Hoving in order to discuss the air rights above his building. Protesters from the Metropolitan Museum of Art protest Trump destroying valuable Art Deco sculptures, but he is apathetic to their concerns.\nAfter the boy tells Trump everything he's learned from him, Merv Griffin finally relents and sells Trump the Taj Mahal in Atlantic City. As Trump and his friends are about to celebrate his 40th birthday, a time traveler comes from the year 2016, planning to stop Trump from running for President of the United States. Then, the 2016 Trump appears, wiping the time traveler from existence, having apparently killed Christopher Lloyd so that he would never appear in the Back to the Future movies. 2016 Trump assures 1986 Trump that he will become President. When Trump and the boy blow out the candles of Trump's birthday cake together, they apparently switch bodies.\nIn a post-credits scene, Ron Howard says that the film was so bad it has forced him to re-examine his passion for filmmaking. Imploring the audience to forget the film or Donald Trump ever existed, he throws the video tape away and burns it.", "cast": "Ron Howard as himself\nEmjay Anthony as Kid 1\nJohnny Depp as Donald Trump\nKristen Schaal as the voice of Trump's receptionist Gloria (whom Trump calls \"Deborah\")\nPatton Oswalt as Merv Griffin\nJason Mantzoukas as a homeless man\nHenry Winkler as Ed Koch\nRob Huebel as Le Club boss Igor Cassini\nPaul Scheer as Roy Cohn\nAlfred Molina as Jerry Schrager, Trump's lawyer\nRon Funches, Jordan Coleman, and Joe Nunez as The Fat Boys\nAndy Richter as Pete Rozelle\nTymberlee Hill as a judge\nAlbert Tsai as Kid 2\nMichaela Watkins as Ivana Trump\nStephen Merchant as Barron Hilton\nPaul Fusco as ALF\nJack McBrayer as Der Scutt\nSayeed Shahidi as Kid 3\nJacob Tremblay as Kid 4\nRobert Morse as Walter Hoving\nChristopher Lloyd as Dr. Emmett \"Doc\" Brown"}