{"_movieID": "290825", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:44:24", "summary": "Yoga Hosers is a 2016 American horror comedy film written and directed by Kevin Smith. It is a spin-off of Smith's 2014 horror film Tusk, and stars Lily-Rose Depp and Smith's daughter Harley Quinn Smith, alongside Depp's father Johnny Depp. The film is the second in Smith's True North trilogy, and had its world premiere on January 24 at the 2016 Sundance Film Festival. The film was released on September 2, 2016 by Invincible Pictures. It was a commercial failure and was universally panned by critics and audiences, who considered it a low point in Smith's career.", "plot": "Colleen Collette and Colleen McKenzie are two average 15-year-old girls that spend their days studying yoga with their guru, Yogi Bayer, and working an after-school job at a Manitoba convenience store called Eh-2-Zed. They are also in a cover band called Glamthrax with their 35-year-old friend, Ichabod, on drums. The two are invited to a party by a popular senior, Hunter Calloway, who is the object of Colleen M's affections.\nThe next day at school, the girls' history teacher informs the class that the Nazi Party once had an influence in Winnipeg. Led by the self-proclaimed \"Canadian Führer\" Adrien Arcand and his right-hand-man, Andronicus Arcane, the Canadian Nazis were once a great force of terror. Arcand was later arrested by Federal authorities, but Andronicus Arcane was never found.\nColleen C's father Bob, who owns the Eh-2-Zed, and his girlfriend Tabitha, the store's manager, decide to take a spontaneous trip to Niagara Falls, leaving the girls to run the store on the night of Hunter's party. The Colleens invite Hunter and his friend Gordon Greenleaf to bring the party to the store so that they would not miss out. Colleen M escorts Hunter to the back room at his request, only to discover that Hunter and Gordon are actually Satanists who wish to sacrifice and dismember the Colleens. Before this can occur, an army of little monsters called Bratzis (one-foot-tall Nazis made from bratwurst) attack and kill Hunter and Gordon. Using their yoga skills, the Colleens fight and defeat the Bratzis, but are soon arrested for the murder of Hunter and Gordon.\nLegendary man-hunter Guy LaPointe, who had an encounter with the Colleens once before, arrives at the police station to interrogate the girls. Having obtained some of his own evidence of the Bratzis, he believes the girls' testimony and wishes to help them prove their innocence. After sneaking them out of the station and taking them back to the Eh-2-Zed, LaPointe and the Colleens are knocked unconscious by the Bratzis. They are taken to an underground lair beneath the store where they find the Bratzis' master, Andronicus Arcane.\nArcane reveals to LaPointe and the Colleens that he once had dreams of becoming an artist. After having his work ridiculed by various critics, he decided to become a scientist for the Canadian Nazi movement. The Nazis hid him in the underground lair to create a clone army to conquer Canada and the United States. The clones, made from bratwurst and Arcane's DNA, needed to incubate for 100 years before they were fully grown, so Arcane cryogenically froze himself until the time when he and his clones could rise again. This process was interrupted when a power outage at the Eh-2-Zed 70 years later caused Arcane to thaw and the clones' incubation to stop, rendering them just one foot in height. Learning that the Nazi Party had long since been defeated, Arcane began a new mission to kill all critics as revenge for those that poorly reviewed his early work. He reveals he has constructed a ten-foot-tall goaltender from body parts of the Bratzis' victims to carry out his murderous deeds. This \"Goalie Golem\" is controlled by the Bratzis who operate it from its insides. No longer wishing to follow Arcane's orders, the Golem kills him and then turns on the Colleens. The Colleens once again use their yoga skills to defeat the Golem and soon after, clear their names.\nAfter being dubbed \"Hero Clerks\" by the media, the Colleens return to their normal lives and end the film with a cover of \"O, Canada\", accompanied on guitar by Guy LaPointe."}