{"_movieID": "273481", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:11", "summary": "Sicario ([si.ˈka.ɾjo], Spanish for \"Hitman\") is a 2015 American crime thriller film directed by Denis Villeneuve, written by Taylor Sheridan and starring Emily Blunt, Benicio del Toro, Josh Brolin, and Victor Garber. The film follows a principled FBI agent who is enlisted by a government task force to bring down the leader of a powerful and brutal Mexican drug cartel. Sicario was selected to compete for the Palme d'Or at the 2015 Cannes Film Festival. It began a limited release in the United States on September 18, 2015, followed by a nationwide release on October 2, 2015.\nSicario received praise for its screenplay, direction, musical score, cinematography, and Blunt's and del Toro's performances. The film was nominated for Best Cinematography, Best Original Score, and Best Sound Editing at the 88th Academy Awards, as well as three BAFTA nominations for Best Supporting Actor, Best Cinematography, and Best Film Music. . A sequel, Sicario: Day of the Soldado, was released on June 29, 2018, with Columbia Pictures replacing Lionsgate.", "plot": "In Chandler, Arizona, FBI agents Kate Macer (Emily Blunt) and Reggie Wayne (Daniel Kaluuya) lead a raid on a suspected Mexican cartel safehouse, where they discover dozens of hidden decaying corpses and a booby trap that kills two policemen. Following the raid, Kate's boss recommends her for a Department of Justice special joint task force, overseen by Matt Graver (Josh Brolin) and the secretive Alejandro Gillick (Benicio del Toro), to apprehend the Sonora Cartel lieutenant Manuel Díaz (Bernardo Saracino). Assured that the task force will bring Díaz and those responsible for the safehouse incident to justice, Kate enlists in the operation. \nThe team travels in force to Ciudad Juárez, Mexico, to extradite Díaz's brother and henchman Guillermo Díaz (Edgar Arreola). To preempt an ambush, the team kills several Mexican cartel gunmen at the public border checkpoint, shocking Kate. Alejandro tortures Guillermo and learns that the cartel uses a tunnel to smuggle drugs into the U.S.\nReggie and Kate begin to question the task force's illegal and seemingly inexplicable methods. Finally, Matt reveals that the objective is not to apprehend Díaz, as originally suggested, but to disrupt his drug operations to such a degree that Díaz will be summoned back to Mexico by his boss, the elusive Sonora Cartel drug lord Fausto Alarcón. By following Díaz, they plan to bring Alarcón to justice.\nTo disrupt Díaz's cash flow, the team raids a bank used by his money launderers. Kate and Reggie want to use their findings from the raid to mount a legal case against Díaz, but are ordered to stand down, so as to not jeopardize the operation — much to their frustration. While commiserating at a bar, Reggie introduces Kate to Ted (Jon Bernthal), a friend and Phoenix police officer. Kate and Ted go to her apartment, but as they become passionate, Kate realizes Ted is working with the cartel. In the ensuing struggle, Ted begins strangling Kate, but Alejandro suddenly appears and subdues him. Alejandro and Matt reveal that they used her as bait, knowing the cartel would target her after she foolishly allowed herself to be seen at the bank raid. Alejandro and Matt coerce Ted into revealing the names of other officers working for Díaz.\nThey soon learn that Díaz is being recalled to Mexico, as they had hoped. Kate questions the good news, pointing out that they have no jurisdiction in Mexico. Matt advises Kate that her and Reggie’s involvement in the operation is simply a technical necessity, as working with U.S. law officers grants the CIA legal auspice to participate in the operation. Angered, Reggie advises that he and Kate leave the task force, but she insists on joining a task force raid on the tunnel to learn more about the operation's true nature. At the Mexican end of the tunnel, Kate witnesses Alejandro kidnapping one of Díaz's drug mules, a corrupt Mexican police officer named Silvio (Maximiliano Hernández). Kate attempts to arrest Alejandro, but he purposely shoots her in the bulletproof vest to incapacitate her, before driving off with Silvio. Realizing that Alejandro is operating illegally with the task force's support, and that there was never any intention of bringing Alarcón and Díaz to justice through legal channels, Kate confronts Matt.\nMatt explains that they are attempting to return to a time when a single cartel, Medellín, ran the drug trade. This monopoly gave the U.S. more control. Alejandro, a hitman who worked for Medellín, was brought on to topple the Sonora Cartel by assassinating Alarcón, thus reducing cartel competition. Alejandro's motive is also personal: Alarcón had ordered the murder of Alejandro's wife and daughter back when Alejandro was a prosecutor in Juarez. In Mexico, Alejandro forces Silvio to drive him to Díaz, kills Silvio, and then forces Díaz to continue to Alarcón. Reaching Alarcón's estate, Alejandro kills Díaz, the guards, and the entire Alarcón family, including his wife and two sons.\nAlejandro appears in Kate's apartment and forces her, at gunpoint, to sign a statement declaring the operation maintained legal methods. As he leaves, she aims her pistol at him, but cannot bring herself to pull the trigger.\nIn Nogales, Sonora, Silvio's widow watches her son's soccer game. The game is briefly interrupted by the sound of gunfire, before continuing."}