{"_movieID": "248574", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:28:47", "summary": "Barely Lethal is a 2015 American action comedy film directed by Kyle Newman, written by John D'Arco, starring Hailee Steinfeld, Sophie Turner, Jessica Alba, Dove Cameron and Samuel L. Jackson. The film follows a teenage special ops agent (Steinfeld) yearning for a \"normal\" adolescence who fakes her own death and enrolls as an \"exchange\" student in a suburban American high school. She quickly learns that surviving the treacherous waters of being a teenager can be more difficult than international espionage.\nThe film received a digital release through DirecTV Cinema on April 30, 2015, and a limited release in theaters by A24 and through video-on-demand on May 29, 2015.", "plot": "The young female orphans in the government-run Prescott Academy are trained to become assassins. Their number one rule, taught by trainer Hardman (Samuel L. Jackson), is \"no attachments\". Agent 83 has top skills, which has made her rivals with Agent 84. 83 has always been curious about the world outside the Academy, brushing up on teen culture through popular magazines and watching movies and TV shows like Mean Girls and Beverly Hills, 90210.\nHardman assigns the agents to capture arms dealer Victoria Knox (Jessica Alba). Undercover in Chechnya, 83 poses as one of those captured and brought before Knox. She manages to latch herself and Knox onto Hardman's passing jet but Knox pulls a knife and cuts the rope and 83 drops (into a river) as Knox is apprehended. 83 ignores comms calls causing Hardman to declare her MIA.\n83 starts life as a regular teenager, adopting the name Megan Walsh and going through an exchange program to live with the Larson family.  Mrs. Larson is kind, son Parker instantly likes Megan, but daughter Liz is cold and distant.\nMegan picks a ridiculous outfit for her first day of school and is laughed at and mocked at her first assembly, leaving both Megan and Liz embarrassed. Megan soon makes friends with a geeky kid named Roger, who has an interest in her.  Megan is attracted to Cash, hacking the school's system to make him her biology lab partner, to the ire of two mean girls. As retaliation, the girls convince Megan that Cash loves girls with school spirit and convince her to try out as the school mascot, for which she is the only contender. When kids from a rival school follow tradition and try to kidnap mascot Megan from a game, she fights them off, with a video of her actions going viral. It earns her some popularity, while annoying Liz.\nMegan is apprehended by a Prescott agent and brought to Hardman. He assumes she is working with their enemies and tells his minion, Pedro, to torture Megan. He injects her with a truth serum and realizes she is honest when she says she only wanted to enjoy a normal life outside the Academy. Hardman lets her go, but warns her that if she gets into trouble, they won't be there to bail her out.\nMegan and Liz both attend a big party at the home of the school's class clown, Gooch. Megan hangs out with Cash, while Liz gets drunk with Gooch, learning that his real name is Bernard. To Megan's surprise, 84 is there, calling herself Heather. Megan thinks Hardman sent Heather to shadow her, but Heather has her own plans, going after Cash to annoy Megan. Megan eventually wins Cash's attention and gets asked by him to the homecoming dance.\nMegan is waiting for the school bus the next morning, and is surprised to see that Hardman is driving, only passing through to warn Megan that Knox has escaped from the Academy. Liz drives Megan to school, but they are pursued by a masked assassin. Megan steers them away from danger while telling Liz her secret. Megan crashes their car, crashing out the assassin as well.  The assassin escapes, but Megan recognizes the smell of Ke$ha perfume, deducing that Heather was their attacker.\nAt the homecoming dance, Megan realizes that Cash is a boring person and dumps him. She goes to apologize to Roger, but finds out that his date is Heather, who provokes a fight with Megan.  Their fight rambles through the hallways and into the school's kitchen. Heather reveals she joined Knox's operation in order to get a chance to kill Megan. Liz sneaks up on Heather and stabs her in the leg with a skewer from a corndog. Megan then uses a frying pan and hits Heather in the head, knocking her unconscious, and she falls to the floor. The girls return home to find that Knox and some models have taken Parker and Mrs. Larson. Megan fights the goons but Liz gets captured as well. Knox reveals that she was Prescott Agent 1, but she left and turned against them. Hardman shows up with reinforcements and defeats Knox and her goons. Megan uses a Prescott helicopter to stop Roger, who is driving home with his father. She tells Roger her true feelings for him and they kiss.\nIn a mid-credits scene, Heather is in a car with one of Knox's former minions. She stares at a photo of Megan on a tablet and orders him to find out where she is going to college."}