{"_movieID": "419709", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:40:05", "summary": "Last Flag Flying is a 2017 American drama film directed by Richard Linklater with a screenplay by Linklater and Darryl Ponicsan, based upon the latter's 2005 novel of the same name. It stars Steve Carell, Bryan Cranston, and Laurence Fishburne as three Vietnam War veterans who reunite after one of their sons is killed in the Iraq War.\nPonicsan's novel Last Flag Flying is a sequel to his 1970 novel The Last Detail, which covered the same characters earlier in their lives. For that reason, Last Flag Flying has been described as an unofficial sequel to the earlier novel's 1973 film adaptation, The Last Detail.Principal photography began in Pittsburgh in November 2016. The film had its world premiere at the New York Film Festival on September 28, 2017, and was released in the United States by Amazon Studios and Lionsgate on November 3, 2017.", "plot": "In 2003, Larry \"Doc\" Shepherd visits the bar of Sal Nealon, a former Marine that he served with in Vietnam. Sal willingly joins Doc on an impromptu drive where Doc reveals that he's also tracked down another friend from Vietnam, now-Reverend Richard Mueller. Sal and Doc are invited to dinner with the Muellers, where Doc reveals he is recently widowed and just lost his only son in Iraq. He admits he tracked down Sal and Mueller in the hope that they would accompany him to collect his son Larry Jr's body and take him to his scheduled burial. Sal agrees, though Mueller is hesitant, claiming that Sal and Doc represent a dark period in his life. His wife urges him to do it, so he reluctantly agrees to accompany him.\nAlong the way, Sal and Mueller clash over their differing philosophies and their mutual guilt over their past; both Sal and Mueller (nicknamed the Mauler) indulged in alcohol, drugs and prostitutes while on deployment, and on one occasion used up the entire supply of then-19 year old Doc's painkillers, which led to a needlessly painful death for one of their fellow Marines and a bad conduct discharge (BCD) for Doc. Sal, who has no social filter from a head injury from the war, continually gets under Mueller's skin for having found religion, whilst Mueller expresses frustration at Sal's lack of maturity. At Dover Air Force Base, Doc requests to view the maimed body of his son, against the advice of Mueller and LtCol Willits. During the viewing, LCpl Charlie Washington, Larry's close friend, reveals to Sal and Mueller that Larry Jr had been killed while shopping at an Iraqi market, contrary to the official story of dying while fighting heroically; Sal reveals the truth to a disillusioned Doc, who refuses the Arlington National Cemetery burial and insists on giving Larry Jr a civilian burial. Willits orders Washington to accompany the body and coerces Doc into changing his mind about having his deceased son buried in civilian clothing.\nSal, Mueller and Doc begin a long road trip back home, waylaid by the Department of Homeland Security (alerted by their cash rental, vague destination and Mueller's praying) and a missed train in New York.  Over the course of the journey, the clashing becomes more good natured and Doc begins to boost in the company of his friends. Sal asks Doc to move to his town to run the bar with him, and the three purchase their first cell phones to stay in contact. Their trip takes them to Boston where Sal insists that they meet the mother of Jimmy Hightower, the fellow Marine who died painfully without morphine. When they arrive, they realise that Mrs. Hightower was given the same story about her son's heroism that Doc was given about Larry Jr; Sal decides not to deny her the story and the trio pretend to have been the men that Hightower saved when he was killed in action.\nThe group return to Portsmouth for Larry Jr's funeral, and where Washington persuades Doc that Larry's civilian suit will be too small and he should be buried in his dress blues. At the burial, Sal and Mueller wear their uniforms, and participate in the flag-folding ceremony. Back at Doc's house, Charlie gives Doc a letter from Larry, claiming not to have read it. Doc reads Larry's wishes; to be buried beside his mother wearing his uniform. Doc smiles as Larry thanks him for being a great father."}