{"_movieID": "340485", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:39:40", "summary": "American Honey is a 2016 epic road drama film written and directed by Andrea Arnold. The film stars Sasha Lane, Shia LaBeouf and Riley Keough. The film follows Star (Lane), a teenage girl from a troubled home, who runs away with a traveling sales crew who drive across the American Midwest selling magazine subscriptions door to door. Principal photography began in May 2015 with filming taking place in several states across America. It is Arnold's first film to be set and filmed outside the United Kingdom.\nThe film was selected to compete for the Palme d'Or at the 2016 Cannes Film Festival where it won the Jury Prize. The film received positive reviews, with Lane's performance receiving critical praise and accolades along with those of LaBeouf and Keough. The film was released in the United States on 30 September 2016, by A24 and in the United Kingdom on 14 October 2016 by Universal Pictures. For the 70th BAFTA Awards, American Honey received a nomination for Best British Film.", "plot": "Star is a teenager living in Muskogee, Oklahoma. She lives a painful life, dumpster-diving in a mall parking lot to find food for her two younger half-siblings. Later she’s forced into a queasy slow dance by a groping drunk who seems to be either her father or stepfather. While trying to hitchhike home one day, she spies a van full of young adults and makes eye contact with Jake, one of the boys in the group. Star follows them to a local K-Mart and returns Jake's phone after it fell out of his pocket. Jake kisses her on the cheek and tells her to come with him to Kansas City, where he will offer her a job. Star declines but Jake nevertheless tells her to meet them in the parking lot of the local Motel 6.\nPacking her belongings, Star takes the children to the club where their neglectful mother dances, telling her it's her turn to care for them. Though the mother refuses, Star runs away from the club and sleeps outside the group's van until morning. Star is then interviewed by their leader, Krystal, and finds out they travel around the country selling magazine subscriptions door to door. Krystal hires her after she establishes that Star is 18, that no one will miss her, and that Star promises to work hard.\nIn the car on the way to Kansas, Star meets the other members of the crew. When they get there, they disperse into groups of two. Since Star is new, she is paired with Jake, the veteran of the group. Star finds it difficult to sell as Jake lies to a potential customer in order to make sales. Star also distracts Jake by flirting with and eventually kissing him. That night, Krystal calls Star in and tells her that Jake has posted his lowest sales ever. Krystal then has Jake put tanning lotion on her body as Star watches, and Star promises to improve. The following day, annoyed by Jake, Star vows to outsell him. Star is picked up by three strangers in cowboy hats who offer to help her, thinking she is being harassed by Jake.\nThe trio bring her to their home and offer to buy several subscriptions if she drinks the worm at the bottom of a bottle of mezcal. Star does, and makes the sale. Jake however, fearing the worst, arrives and threatens the men with a gun before stealing their car. Initially angry at Jake, Star is later touched that he came to find her, and the two have sex. When they return to the hotel for the evening, Jake tells her not to mention their relationship, and he gives the money Star earned to Krystal. \nFor a while, things between Jake and Star are tense, and Krystal threatens to drop her on the side of the road if she keeps causing trouble. The crew ends up living temporarily in a rundown house, and Jake and Star renew their relationship. Star asks him what his dreams are, and he shows her his private stash of cash and items he's stolen from the houses he visits, which he intends to use to buy a home.\nKrystal dumps the girls off where oil workers are about to go to work in the morning. Star climbs in the back of their truck and tries to sell to them, but one of the oil workers tells her he'll pay her five hundred dollars to go on a date with him. Star asks for a thousand and performs sexually for the money. After the man drops her off, she hears him being attacked. Shortly after, a bloodied Jake asks her if she was hurt by the man and later asks if she slept with him. Star eventually admits what happened, causing Jake to throw a fit, smashing the belongings in the house before running off. \nThe following morning, the crew get in the car and there is a new girl there, while Jake is missing. Krystal calls Star to her room and informs her she has let Jake go, that she paid him money for each girl he recruited, and that he slept with all of them. Krystal later takes them to a poor area in Rapid City, South Dakota to sell subscriptions. Star enters a house and meets several affable children whose mother is on drugs. As Star's own mother died of a meth overdose, she feels sympathetic toward them and goes out to buy them groceries. At the pickup that day, Jake is in the van, and Star is confused as to whether to be happy to see him or not. That evening, the crew light a bonfire. Dancing around the fire, Star is pulled aside by Jake, who privately hands her a turtle. Star takes it to the edge of the water and releases it before following the turtle into the water. Star then immerses herself fully before rising out of the water as the film ends."}