{"_movieID": "324552", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:43:34", "summary": "John Wick: Chapter 2 (also known as simply John Wick 2) is a 2017 American neo-noir action thriller film directed by Chad Stahelski and written by Derek Kolstad. It is the second installment in the John Wick film series, and the sequel to the 2014 film John Wick. It stars Keanu Reeves, Common, Laurence Fishburne, Riccardo Scamarcio, Ruby Rose, John Leguizamo, and Ian McShane. The plot follows hitman John Wick (Reeves), who goes on the run after a bounty is placed on him. Principal photography began on October 26, 2015, in New York City. \nThe film premiered in Los Angeles on January 30, 2017, and was theatrically released in the United States on February 10, 2017. It was acclaimed by critics, with praise for the action sequences, direction, editing, visual style and the performances of the cast, particularly Reeves. The film grossed $171 million worldwide against its $40 million budget, nearly twice the $88 million gross of the original film.A sequel, titled John Wick: Chapter 3 – Parabellum, was released on May 17, 2019.", "plot": "Four days after the events of the first film, former assassin John Wick retrieves his stolen 1969 Ford Mustang Mach 1 from a chop shop owned by Abram Tarasov, brother of Viggo and uncle of Iosef. John dispatches Tarasov's men in a violent rampage that heavily damages the Mustang but spares Tarasov under the auspices of peace and returns home, later cementing his weapons into the ground once again.\nAfter chop-shop owner Aurelio takes John's Mustang for repairs, John is visited by Italian crime lord Santino D'Antonio. It is revealed that to complete his \"impossible task,\" which allowed him to retire and marry Helen, John asked Santino for help. As a form of contract, Santino swore John to a \"marker,\" an unbreakable promise symbolized by a \"blood oath\" medallion. Santino presents the medallion to demand services from John, who declines, claiming that he is retired. In retaliation, Santino burns John's home.\nJohn walks all the way to The Continental Hotel in New York City. Winston, the owner of the hotel, reminds John that if he rejects the marker, he will be violating one of the two unbreakable rules of the underworld: no blood on Continental grounds, and every marker must be honored. John reluctantly accepts his commitment and meets with Santino, who tasks him with assassinating his sister Gianna so he can claim her seat at the \"High Table,\" a council of 12 high-level crime lords. Santino sends Ares, his mute personal bodyguard, to surveil John.\nIn Rome, John infiltrates Gianna's coronation party and confronts her in her dressing room. Faced with certain death, Gianna chooses to take her own life by slitting her wrists. With John's finger on her pulse, he shoots her in the head when she dies to complete the marker. On his way out, Cassian, Gianna's bodyguard, recognizes John and, on realizing that John was sent to kill Gianna, attacks him. John escapes to the catacombs, where he is ambushed by Ares and Santino's henchmen, who intend to \"tie up loose ends\" by killing him. After killing most of the henchmen, John is pursued by Cassian. During their intense fight, their battle is halted when they crash into the reception area of the Rome Continental, which—like the New York Continental—prohibits any \"business\" on its grounds. As the two share a tense drink, John explains why he had to kill Gianna. Nevertheless, Cassian vows revenge for Gianna's death, promising to kill him quickly as a sign of professional respect.\nAfter John returns to New York City, Santino opens a $7 million contract for John's death under the guise of avenging his sister, leading numerous assassins to unsuccessfully attack John. Eventually, Cassian confronts John once again in the subway and makes their way to a subway car for a final showdown. John wins the fight and badly wounds Cassian, but leaves him alive out of professional respect. Injured and desperate, John seeks help from an underground crime lord titled the Bowery King, whose subordinates treat John's injuries and guide him to Santino's location. John kills Santino's bodyguards and defeats Ares in a knife fight, but Santino is able to escape to the Continental. Santino smugly makes it clear that he intends to remain indefinitely in its sanctuary. Despite Winston's warnings, John shoots and kills Santino in the Continental lounge.\nThe next day, Winston sends for John and explains that, per the High Table, the contract on John has been doubled and offered globally. As a consequence of killing Santino on Continental grounds, Winston declares John \"excommunicado\" from the Continental, losing all access and privileges to the Continental's underworld resources. However, Winston delays announcing John's excommunication and global bounty by one hour to give him a head start and provides him with a marker for future use. Before leaving, John advises Winston to make it known that whoever tries to come after him will be killed. As John and his dog run through the park, dozens of cellphones around him ring, signaling that the global contract is about to be posted and offered."}