{"_movieID": "9374", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:30:58", "summary": "Death Becomes Her is a 1992 American black comedy directed by Robert Zemeckis, written by David Koepp and Martin Donovan, and starring Meryl Streep, Bruce Willis, and Goldie Hawn. The film focuses on a pair of rivals (Streep and Hawn), who drink a magic potion that promises eternal youth, but experience unpleasant side effects when they physically die, becoming walking, talking corpses in the process.\nDeath Becomes Her won the Academy Award for Best Visual Effects. The film received mixed reviews from critics, but was a commercial success, grossing $149 million worldwide. It has developed a strong cult following, particularly among the LGBT community.\n\n", "plot": "In 1978, narcissistic, manipulative actress Madeline Ashton performs in an awful musical version of Sweet Bird of Youth on Broadway. She invites long-time rival Helen Sharp, an aspiring writer, backstage along with Helen's fiancé, plastic surgeon Ernest Menville. Ernest is smitten with Madeline, and breaks off his engagement with Helen to marry her. Seven years later, in 1985, Helen winds up in a psychiatric hospital after fixating upon Madeline. Obese and depressed, Helen feigns rehabilitation and is released, plotting revenge on Madeline.\nAnother seven years later, in 1992, Madeline lives in Beverly Hills with Ernest, but they are now miserable. Madeline's acting career has faded with age, and Ernest is an alcoholic reduced to working as a reconstructive mortician. Receiving an invitation to a party celebrating Helen's new book, Madeline rushes to a spa where she regularly receives facial treatments. Understanding Madeline's situation, the spa owner gives her the business card of Lisle Von Rhuman, a woman specializing in youth rejuvenation.\nMadeline and Ernest attend the party for Helen's novel, Forever Young, and discover that somehow, Helen is now slim, youthful, and beautiful. Dumbfounded and depressed by Helen's appearance, Madeline visits her young lover, but discovers that he is with a woman his age. Dejected, Madeline drives to Lisle's home. Lisle is a mysterious, glamorous, wealthy socialite claiming to be 71, but looks decades younger. She reveals to Madeline the secret of her beauty and youth—an expensive potion that promises eternal life and an everlasting youthful appearance. Madeline purchases and drinks the potion and is rejuvenated, regaining her beauty. As a condition of purchase, Madeline must disappear from public life after 10 years to keep the existence of the potion secret. Lisle also warns Madeline to take good care of her body.\nHelen seduces Ernest and convinces him to kill Madeline. When Madeline returns home, Ernest and she argue, during which Madeline falls down the stairs, breaking her neck. Believing Madeline dead, Ernest phones Helen for advice, not seeing Madeline stand and approach him with her head twisted backward. Ernest assumes she has a dislocated neck and drives her to the emergency room. Madeline is told she is technically dead, and faints. She is taken to the morgue due to her body having no pulse and a temperature below 80 °F. After rescuing Madeline, Ernest takes the sign of her \"resurrection\" as a miracle, returns home with Madeline, and uses his skills as a mortician to repair her body.\nHelen demands information about Madeline's situation. Overhearing Helen and Ernest discussing their plot to stage Madeline's death, Madeline shoots Helen with a shotgun. Although the blast creates a hole in her abdomen, Helen survives, revealing that she drank the same potion. Fed up with the pair, Ernest prepares to leave, but Helen and Madeline convince him to do one last repair on their bodies. They realize that they will need constant maintenance and scheme to have Ernest drink the potion to ensure that he will always be available.\nAfter bringing Ernest to Lisle, she offers to give him the potion free of charge in exchange for his surgical skills. Ernest refuses to drink it when he realizes the pitfalls of immortality. He pockets the potion and flees, but becomes trapped on the roof. Helen and Madeline implore Ernest to drink the potion to survive an impending fall. Ernest, realizing that they only want him to drink it because they need him for their own selfish reasons and nothing more, refuses and drops the potion to the ground several stories below, but after falling he lands in Lisle's pool and escapes. After Lisle banishes Madeline and Helen from her group, the pair realize that they must now rely on each other for companionship and maintenance.\n37 years later, Madeline and Helen attend Ernest's funeral, where he is eulogized as having lived an adventurous and fulfilling life with a large family and friends. The two women are now parodies of their former selves, with cracked, peeling paint and putty covering most of their grey and rotting flesh. Helen trips and teeters at the top of a staircase. After Madeline hesitates to help her, Helen grabs Madeline and the two tumble down the stairs, breaking to pieces. As their disembodied heads totter down together, Helen sardonically asks Madeline, \"Do you remember where you parked the car?\""}