{"_movieID": "263472", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:43:35", "summary": "Knock Knock is a 2015 American erotic thriller-horror film directed by Eli Roth, who also co-wrote the script with Guillermo Amoedo and Nicolás López. The film stars Keanu Reeves, Lorenza Izzo, and Ana de Armas. The film was released on October 9, 2015, by Lionsgate Premiere. Knock Knock is a remake of the 1977 film Death Game, which was directed by Peter S. Traynor and starred Sondra Locke and Colleen Camp. All three individuals had a hand in the production of Knock Knock, while Camp also had a cameo in the newer film.", "plot": "Architect and happily married man Evan Webber (Keanu Reeves) has the house to himself and his dog, Monkey, on Father's Day weekend due to work and a physical therapy appointment for a shoulder injury while his wife and children go on a family-planned beach trip. His wife Karen (Ignacia Allamand), a successful artist, leaves their assistant Louis (Aaron Burns) in charge of her sculpture that needs to be moved to an art gallery.\nTwo women, Genesis (Lorenza Izzo) and Bel (Ana de Armas) knock on Evan's door. He opens the door and they say that they are looking for the address of a party. As they have no means of communication, Evan allows them in to use the Internet and get hold of the party's host. The girls make themselves at home and Evan plays a few of his old vinyl records he has from when he was a DJ. They then disappear to the bathroom when their driver arrives. Evan tries to convince them to leave, but as they start forcing themselves upon him, he gives in and has a threesome with them.\nAfter Evan, Genesis, and Bel have had sex, Evan finds out that his wife's sculpture has been vandalized by the girls. When Evan threatens to call the police, the girls reveal they are underage. Vivian (Colleen Camp), a friend of Karen's, stops by to see if Evan needs help. Seeing Genesis, Vivian angrily leaves. When Evan threatens to report a break-in, they give in and agree to be taken home.\nHe then returns home, cleans the mess, and tries to go back to his work. Just as he is getting closer to completing his project, he hears a shattering noise. He finds a broken picture frame of his family and Genesis knocks him out with one of his wife's sculptures. Bel climbs onto him trying to arouse him while role-playing as a Schoolgirl  in his daughter's school uniform. Evan initially refuses, but the girls threaten to FaceTime his wife with him unless he agrees with their methods. Bel rapes him, and Genesis records everything. However, Evan releases himself, knocking Bel off. He charges at Genesis, but is then disarmed by her and Bel who tie him up to a chair with an electrical cord.\nLouis arrives to collect the sculpture and finds Evan tied up to a chair, but before he can help him he hears the girls smashing the vandalized sculpture. He runs to stop them, but then has an asthma attack and realizes they took his inhaler. As he tries to get it back, he slips on a piece of the sculpture, hits his head while falling, and dies. They turn Louis's body into a red sculpture and dig a makeshift grave in the backyard for Evan. They tie him up with a hose, then bury him in the hole, leaving only his head above ground. The two then reveal how the entire ordeal was merely a \"game\", as they never intended to kill Evan nor are either of them underage and that everything they did was part of a wicked hobby of seducing, torturing, and ruining the homes of married men with children. Genesis shows Evan the video she recorded earlier with his phone of him and Bel having sex. As Evan watches on, she uploads it to his Facebook profile. They depart for another victim and take Monkey with them, leaving Evan to his fate as Karen and the kids arrive to find the house ruined.\nIn an alternate ending Evan takes revenge by finding the girls in another house where he reaches and knocks on the door and girls ask 'Who's there'.", "cast": "Keanu Reeves as Evan Webber\nLorenza Izzo as Genesis\nAna de Armas as Bel\nIgnacia Allamand as Karen Alvarado\nDan Baily as Jake\nMegan Baily as Lisa\nAaron Burns as Louis\nColleen Camp as Vivian\nOtto as Monkey"}