{"_movieID": "227735", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:09:28", "summary": "Dolphin Tale 2 is a 2014 American family film written and directed by Charles Martin Smith as the sequel to his 2011 film Dolphin Tale. Harry Connick Jr., Ashley Judd, Nathan Gamble, Cozi Zuehlsdorff, Kris Kristofferson, Morgan Freeman, Juliana Harkavy, Austin Stowell, Betsy Landin, and Austin Highsmith all reprise their roles from the first film, while Lee Karlinsky, Julia Jordan, Taylor Blackwell, and Bethany Hamilton join the cast. It was released on September 12, 2014 and tells the story of another dolphin at the hospital named \"Hope\". After Winter's elderly companion and surrogate mother, Panama, dies, Winter's future is in jeopardy, unless Sawyer, Clay, Hazel, and the rest of the Clearwater Marine Aquarium team can find a new companion for her. The film received positive reviews from critics and grossed $57.8 million.", "plot": "Three years after saving Winter, the staff at Clearwater Marine Aquarium rescue a severely sunburned beached dolphin, named Mandy after a little girl who finds her. Sawyer, now aged fourteen, gets a chance for a scholarship to the elite SEA Semester program, which involves three months at sea doing marine mammal research, after impressing his cousin Kyle's advisor Dr. Miguel Arroyo when champion surfer Bethany Hamilton swims with him and Winter. Sawyer is reluctant to go because he is concerned about leaving Winter.\nWinter needs attention and shows signs of stress and loneliness, especially after her older companion, Panama, dies. Acting on Rufus's erratic behavior one morning, Sawyer and Hazel find and rescue a sea turtle from some fishing line. Rufus becomes obsessed with the sea turtle, named Mavis, following her everywhere, even watching her during a CT scan at the hospital where Lorraine works.\nGeorge Hatton, a USDA inspector, insists that Winter must be matched with a new companion within 30 days or be transferred elsewhere. However, Winter's behavior has become unpredictable, even dangerous; when Sawyer tries to get her out of the tank to prepare to make her a new prosthetic tail, she becomes aggressive and knocks him into the water. Dr. Clay prohibits Sawyer from swimming with Winter until further notice. Winter spends weeks in isolation, and despite people not being allowed to visit her, Sawyer allows Susie, a new volunteer, and her grandfather to see her; Hazel becomes slightly jealous, because she has feelings for Sawyer.\nSawyer and Hazel hope Mandy will become Winter's companion. CMA begins to rehabilitate Mandy, contemplating releasing her soon, causing alarm for Hazel in particular. Lorraine advises Hazel that no one spends any more time at a hospital than they need to. Clay, Sawyer, and Hazel test her readiness by giving Mandy three live fish, which she catches effortlessly, so they reluctantly decide they must release her. Hazel takes charge of her release.\nSawyer and Hazel break the rules and swim with Winter, who appears to be feeling better. Clay finds them doing so and scolds them, but then states that it does not matter, because George issued an order that Winter be transferred to a marine park in Texas. Meanwhile, Sawyer wins the scholarship to attend the SEA Semester, so Lorraine and his friends arrange a party. Though this cheers him up a little, he still cannot decide whether to go. Dr. McCarthy shows him an old watch which must be tapped to keep ticking, and so encourages Sawyer to \"shake it up now and then\" and try new things in life.\nDuring the party, Clay is informed that another female dolphin has been rescued and is headed to CMA; one so young that she has not yet learned how to hunt and cannot return to the wild. This offers new hope of companionship for Winter, so they name her \"Hope\". Meanwhile, Mavis is released, and Rufus follows her out to sea.\nGeorge gives Clay an extension to keep Winter from being transferred, and CMA tries to introduce Hope as her new companion. Hope panics and circles the pool at high speed, and staff members quickly separate the two dolphins. They realize that Hope had sensed that Winter had no tail and moved differently from other dolphins. Sawyer thinks that a new prosthetic tail might have better results; though Phoebe, Rebecca, and Kat are initially wary of the potential repercussions, everyone agrees.\nIn her second meeting with Hope, Winter wears the new tail designed by Dr. McCarthy. A huge crowd, including George, is present to watch, and eventually the two dolphins accept each other. Everyone rejoices that Winter can stay at CMA now that she has a companion. With his uncertainty about Winter resolved, Sawyer decides to go to the SEA Semester program, but reassures her that he will be back. Hazel says goodbye to him by releasing helium balloons and holding up a sign, and Sawyer sends her a text message saying, \"Thanks, Hazel. You're the best!\", causing her to blush as she smiles to herself, while Rufus returns to the aquarium. As Sawyer's mother drives away, Hazel quietly affirms she will really miss Sawyer.\nReal-life footage shown at the end includes Mandy's actual release, Hope's rescue, a sea turtle named Mavis and her release, Winter wearing the new prosthetic tail, and amputees interacting with Winter.", "cast": "Winter as herself\nHope as herself\nHarry Connick Jr. as Dr. Clay Haskett, Hazel's father who runs the Clearwater Marine Aquarium\nAshley Judd as Lorraine Nelson, Sawyer's mother\nKris Kristofferson as Reed Haskett, Clay's father and Hazel's grandfather\nNathan Gamble as Sawyer Nelson, the boy who found Winter three years earlier and has since then became experted in the fields of marine biology and Winter's trainer.\nCozi Zuehlsdorff as Hazel Haskett, Clay's daughter, Reed's granddaughter and Sawyer's best friend who starts to develop feelings for Sawyer in the movie.\nMorgan Freeman as Dr. Cameron McCarthy, the prosthetic designer who designed Winter's tail three years earlier.\nBethany Hamilton as herself\nDenisea Wilson as Julia\nJulia Jordan as Mandy, a little girl who finds a dolphin stranded on the beach at the beginning of the movie\nAustin Stowell as Kyle Connellan, Sawyer's cousin who has recovered from his injury and depression since he was injured in the army three years earlier\nKim Ostrenko as Alyce Connellan, Kyle's mother, Sawyer's aunt, and Lorraine's sister.\nJuliana Harkavy as Rebecca\nAustin Highsmith as Phoebe, a marine animal trainer at the aquarium and Clay's assistant\nBetsy Landin as Kat, Panama's trainer and later Hope's\nLee Karlinsky as Troy, Mandy's older brother\nTaylor Blackwell as Susie, an aquarium volunteer who takes a liking to Sawyer\nCarlos Gómez as Dr. Miguel Arroyo, Kyle's advisor at Boston University who's impressed by Sawyer's work with Winter\nDennis Ardnt as Veteran Dennis\nTom Hillmann as Mel Prince\nTom Nowicki as Philip J. Hordern\nCharles Martin Smith as George Hatton"}