{"_movieID": "374464", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:47:10", "summary": "A planetarium (plural planetaria or planetariums) is a theatre built primarily for presenting educational and entertaining shows about astronomy and the night sky, or for training in celestial navigation.A dominant feature of most planetaria is the large dome-shaped projection screen onto which scenes of stars, planets, and other celestial objects can be made to appear and move realistically to simulate the complex 'motions of the heavens'. The celestial scenes can be created using a wide variety of technologies, for example precision-engineered 'star balls' that combine optical and electro-mechanical technology, slide projector, video and fulldome projector systems, and lasers. Whatever technologies are used, the objective is normally to link them together to simulate an accurate relative motion of the sky. Typical systems can be set to simulate the sky at any point in time, past or present, and often to depict the night sky as it would appear from any point of latitude on Earth.\nPlanetariums range in size from the 37 meter dome in St. Petersburg, Russia (called “Planetarium No 1”) to three-meter inflatable portable domes where attendees sit on the floor. The largest planetarium in the Western Hemisphere is the Jennifer Chalsty Planetarium at Liberty Science Center in New Jersey (27 meters in diameter). The Birla Planetarium in Kolkata, India is the largest by seating capacity (630 seats). Thereafter, the China Science and Technology Museum Planetarium in Beijing, China has the largest seating capacity (442 seats). In North America, the Hayden Planetarium at the American Museum of Natural History in New York City has the greatest number of seats (423).\nThe term planetarium is sometimes used generically to describe other devices which illustrate the solar system, such as a computer simulation or an orrery. Planetarium software refers to a software application that renders a three-dimensional image of the sky onto a two-dimensional computer screen. The term planetarian is used to describe a member of the professional staff of a planetarium."}