{"_movieID": "86835", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:47:08", "summary": "Knight of Cups is a 2015 American experimental drama film written and directed by Terrence Malick and produced by Nicolas Gonda, Sarah Green and Ken Kao. The film features an ensemble cast, starring Christian Bale as the central character.\nThe film follows depressed screenwriter Rick (Bale) on an odyssey through Los Angeles and Las Vegas as he undertakes a series of adventures with colorful figures, identified by eight tarot cards, with Bale as the Knight of Cups. The film is loosely inspired by, and at times quotes directly from, the 1678 Christian allegory The Pilgrim's Progress, the Acts of Thomas passage \"Hymn of the Pearl,\" and Suhrawardi's A Tale of the Western Exile.After over two years in post-production, the film premiered in the main competition section at the 65th Berlin International Film Festival on February 8, 2015 to mixed reviews. It was released in the United States on March 4, 2016, by Broad Green Pictures to more mixed reviews from critics and audiences alike.", "plot": "Rick is a screenwriter living in Los Angeles, California. He is successful in his career, but his life feels empty. Haunted by the death of one brother and the dire circumstances of the other, he finds temporary solace in Hollywood excess. Women provide a distraction from the daily pain he endures, and every encounter brings him closer to finding his place in the world.\nThe film is divided into eight chapters (each named after a tarot card, except the final chapter, \"Freedom\"), plus a prologue, each loosely based around the central character's relationship with somebody in his life:\nI. The Moon - Della, a rebellious young woman.\nII. The Hanged Man - His brother Barry and father Joseph.\nIII. The Hermit - Tonio, an amoral playboy.\nIV. Judgment - His physician ex-wife Nancy.\nV. The Tower - Helen, a serene model.\nVI. The High Priestess - Karen, a spirited, playful stripper.\nVII. Death - Elizabeth, a married woman with whom he has a relationship and who becomes pregnant with a child that may be his.\nVIII. Freedom - Isabel, an innocent who helps him see a way forward.", "cast": "Ben Kingsley is among the many narrators, but does not appear in the film."}