{"_movieID": "446021", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:11:29", "summary": "Bad Times at the El Royale is a 2018 neo-noir thriller film written, produced and directed by Drew Goddard. The film stars Jeff Bridges, Cynthia Erivo, Dakota Johnson, Jon Hamm, Cailee Spaeny, Lewis Pullman and Chris Hemsworth. Set in 1969, the plot follows seven strangers each hiding dark secrets, who come to a head one night in a shady hotel on the California-Nevada border.Bad Times at the El Royale premiered at Fantastic Fest on September 27, 2018, and was theatrically released in the United States on October 12, 2018. Although a box office failure, grossing $31 million worldwide against its $32 million budget, it received generally positive reviews from critics, with praise for its acting and Goddard's screenplay and direction, although some reviewers criticized the runtime and pacing.", "plot": "In 1959, in the aftermath of a bank robbery gone awry, a crook hides a bag of money inside the floorboards of a hotel room. After successfully hiding the cash, he is double-crossed by one of his accomplices and killed. \nTen years later, Catholic priest Daniel Flynn, singer Darlene Sweet, salesman Laramie Seymour Sullivan, and hippie Emily Summerspring arrive at the El Royale  hotel at the California-Nevada border, popular with Hollywood and political elite until losing its gambling license. They meet the hotel's only remaining employee, Miles Miller. \nUpon checking into his room, Sullivan removes wire taps from the honeymoon suite and finds a secret corridor from which guest's rooms can be observed via two-way mirrors and filmed via a 16mm camera setup. From the corridor, Sullivan sees Emily committing an apparent kidnapping. It is revealed that he is Dwight Broadbeck, an FBI agent on assignment to remove FBI surveillance from the hotel; he reports his findings to J. Edgar Hoover, who instructs him to ignore the kidnapping and to prevent the guests from leaving until the surveillance materials are secured. \nFlynn invites Sweet to join him for dinner. She sees him spiking her drink and knocks him unconscious with a bottle. Miller finds and revives Flynn, then shows him the secret passageway, explaining that \"management\" regularly had him film guests' intimate encounters and send the footage to them. Miller admits having withheld one incriminating film of a deceased public figure who had been kind to him. When Flynn leaves to evaluate the film, Miller witnesses through the two-way mirror Agent Broadbeck attempting to rescue Emily's hostage, who is revealed to be Emily's younger sister, Rose. Emily opens fire, killing Broadbeck, and accidentally brutalizing half of Miller's face with buckshot. Emily interrogates Miller about the surveillance operation. It is revealed that Emily forcibly removed her sister from a murderous cult in California led by Billy Lee, a lecherous and sadistic but charismatic figure. Emily is disappointed to learn that Rose has called Lee to the El Royale.\nSweet, who has witnessed Broadbeck's murder, attempts to escape, but to no avail. Flynn arrives and reveals that he is a criminal named Dock O'Kelly, imprisoned for the robbery in 1959. Recently paroled, he returned to the El Royale in priest garb to retrieve the money that had been hidden there before; his brother Felix was the robber who was double-crossed and killed. Due to O'Kelly's failing memory, he picked the wrong room and discovered the money was not there. Believing it to be in Sweet's room, he had attempted to drug her simply to gain access to her room. Withholding knowledge that he is in possession of the film, O'Kelly offers to split the cash with Sweet. O'Kelly and Sweet shelter their ulterior motives from Emily, as she begins to investigate the premises while O'Kelly retrieves the money. \nAs O'Kelly and Sweet attempt to leave with the money, Lee and his cult arrive and take them, Emily and Miller hostage. Lee finds the money and the film, which he realizes is worth more than the money. Beginning to terrorize the group, Lee kills Emily playing a life-or-death game of roulette between her and Miller. Before Lee completes another roulette round between O'Kelly and Sweet, O'Kelly attacks Lee and a melee ensues. When Sweet implores Miller to pick up a gun and help, he reveals that he served in Vietnam as a U.S.-military sniper and killed 123 people. A defiant Miller kills Lee and his followers to save O'Kelly. A distraught Rose stabs Miller, then is shot by O'Kelly. Before Miller dies, Sweet tells \"Father Flynn\" to absolve Miller of the guilt over his actions in Vietnam. O'Kelly complies. O'Kelly and Sweet retrieve the money, Sweet tosses the film into the fire, and the pair leaves the hotel.\nThe next day, Sweet performs in Reno for a small audience. She smiles as she spots O'Kelly, who has arrived to see her perform."}