{"_movieID": "117263", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:09:19", "summary": "Olympus Has Fallen is a 2013 American action thriller film directed by Antoine Fuqua, and written by Creighton Rothenberger and Katrin Benedikt.  It is the first installment in the Fallen film series. The film stars Gerard Butler, Aaron Eckhart, Morgan Freeman, Angela Bassett, Robert Forster, Cole Hauser, Ashley Judd, Melissa Leo, Dylan McDermott, Radha Mitchell, and Rick Yune. The plot depicts a North Korean-led guerrilla assault on the White House, and focuses on disgraced United States Secret Service agent Mike Banning's efforts to rescue the US President, Benjamin Asher.\nThe film was released in the United States on March 22, 2013, by FilmDistrict. It earned $170 million against a $70 million production budget. The film received mixed reviews from critics, who praised Fuqua's direction and Butler's performance, but criticized the violence and screenplay. Olympus Has Fallen was one of two films released in 2013 that dealt with a terrorist attack on the White House; the other was White House Down.\nA sequel, titled London Has Fallen, was released on March 4, 2016, with the principal cast members reprising their roles. Another sequel, Angel Has Fallen, was released in 2019.", "plot": "Former Army Ranger Mike Banning (Gerard Butler) leads the U.S. Presidential Secret Service detail, maintaining a personal, friendly relationship with President Benjamin Asher (Aaron Eckhart), First Lady Margaret (Ashley Judd), and their son Connor (Finley Jacobsen). On a snowy Christmas drive from Camp David, the car transporting the First Family spins out of control on an icy bridge; Banning pulls Asher from the vehicle, but fails to save Margaret as she falls to her death.\nEighteen months later, having been removed from the presidential detail, Banning works at Treasury headquarters. During Asher’s meeting with Prime Minister of South Korea Lee Tae-Woo (Keong Sim) at the White House, a North Korean terrorist organization, led by Kang Yeonsak (Rick Yune), mounts an air and ground assault and captures the building. The group is aided by members of the prime minister's own detail, including Dave Forbes (Dylan McDermott), a former Secret Service agent. Asher and several top officials are held hostage in the White House bunker; Prime Minister Lee is executed on live video. Before being killed, Agent Roma (Cole Hauser) alerts the Director of the Secret Service Lynne Jacobs (Angela Bassett) that \"Olympus has fallen\".\nBanning joins the White House's defenders during Kang’s initial assault. He falls back into the White House, disabling internal surveillance and gaining access to Asher's satellite ear phone, which he uses to maintain contact with Jacobs and Speaker of the House Allan Trumbull (Morgan Freeman), now Acting President.\nKang seeks to use Asher as a hostage to force U.S. officials to withdraw the Seventh Fleet and U.S. forces from the Korean Peninsula, thus removing American opposition to a North Korean invasion of South Korea. He also seeks to detonate the American nuclear arsenal, turning the United States into an irradiated wasteland. This requires access codes to the Cerberus system, held by three government officials including the President, all of whom are inside the bunker. Asher orders the other two officials to reveal their codes to save their lives, certain that he will not give up his own code.\nAuthorized to proceed, Banning’s first act is to save Connor, whom Kang plans to use to force Asher to reveal his Cerberus code. Banning finds Connor hiding in the building's walls and sneaks him to safety. On reconnaissance, Banning kills several of the terrorists, including Forbes. Army Chief of Staff General Edward Clegg (Robert Forster) convinces Trumbull to order an aerial SEAL assault on the White House. Kang discovers the assault force and activates advanced Hydra 6 anti-aircraft system. Banning advises Trumbull and Clegg to abort the mission, but the new weapon system annihilates most of the assault force before Banning can stop it. Kang retaliates by killing Vice President Charlie Rodriguez (Phil Austin).\nAfter Banning disables Kang’s communications, Kang tries to execute Secretary of Defense Ruth McMillan (Melissa Leo) outside the White House in front of the media, but Banning rescues her. With his forces dwindling, Kang fakes his and Asher's death by sacrificing several of his men and the remaining hostages, but Banning sees through the ruse. Kang eventually cracks Asher’s code using a brute-force attack and activates Cerberus. As Kang and his remaining men attempt to escape, Banning ambushes and kills the remaining terrorists. Asher tries to break free from Kang's grip and is shot in the stomach. Banning confronts Kang, who quickly gains the upper hand, before Banning stabs him in the head and disables Cerberus with the assistance of Trumbull and his staff, with only seconds to spare.\nBanning walks out with Asher and is received by the soldiers posted to await their arrival. In the wake of the attack, Banning once again heads the president's security detail."}