{"_movieID": "373929", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:56:04", "summary": "Touch of Evil is a 1958 American film noir written, directed by and co-starring Orson Welles. The screenplay was loosely based on the novel Badge of Evil by Whit Masterson. Along with Welles, the cast includes Charlton Heston, Janet Leigh, Joseph Calleia, Akim Tamiroff and Marlene Dietrich.\nOne of the last examples of film noir in the genre's classic period, its reputation has grown since its release, and it is now widely regarded as one of Welles's best motion pictures and one of the best classic-era films noir.\nIn 1993, it was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".", "plot": "In a Mexican town along the U.S.–Mexico border, a time bomb is planted in a car. Rudy Linnekar (Jeffrey Green) and Zita (Joi Lansing) enter the vehicle and make a slow journey through town to the U.S. border, during which Zita insists that she can hear something ticking. Newlyweds Miguel \"Mike\" Vargas (Charlton Heston), a drug enforcement official in the Mexican government, and his wife Susie (Janet Leigh) pass the car several times on foot. The car crosses the border, then explodes.\n\nRealizing the implications of a Mexican bomb exploding on American soil, Vargas takes an interest in the investigation. Police Chief Pete Gould (Harry Shannon) and District Attorney Adair (Ray Collins) arrive on the scene, followed by the game-legged police captain Hank Quinlan (Orson Welles) and Quinlan's longtime partner, Pete Menzies (Joseph Calleia)—who clearly worships Quinlan. The obese and disheveled Captain nostalgically visits a brothel run by Tanya (Marlene Dietrich), who barely recognizes him because he's gained so much weight.\nQuinlan's and Menzies' prime suspect is Sanchez, a young Mexican secretly married to the victim's daughter (Joanna Moore). They interrogate Sanchez in his apartment with Vargas present. Vargas visits the bathroom and accidentally knocks over an empty shoebox. Moments later, Menzies enters the bathroom and announces that two sticks of dynamite were found in the same shoebox. Vargas accuses Quinlan of planting the evidence and begins to suspect that he may have been doing so for years, to help win convictions. Quinlan dismisses Vargas's claim, saying he is just biased in favor of fellow Mexicans. The stress of these accusations, along with pressure from \"Uncle\" Joe Grandi (Akim Tamiroff), the brother of a man Vargas has been investigating, to strike a deal to discredit Vargas, causes Quinlan—who has been sober for 12 years—to fall off the wagon. With assistance from District Attorney's Assistant Al Schwartz (Mort Mills), Vargas studies the public records on Quinlan's previous cases, revealing his findings to Gould and Adair. Quinlan arrives in time to overhear the discussion and angrily threatens to resign.\nSusie Vargas moves from her Mexican hotel to a remote American motel to escape the unwanted attention of Grandi. The motel, which Menzies recommended to her, has no other guests and is staffed only by a very peculiar night manager (Dennis Weaver), and, unknown to Susie, is owned by Grandi himself.  Grandi's family members take over the motel and terrorize Susie. Vargas becomes concerned when his attempts to telephone Susie at the motel are blocked. Quinlan conspires with Grandi, arranging for Susie to be knocked unconscious, kidnapped, and made to look like she had overdosed on drugs by placing drugs around her unconscious body. Quinlan then double-crosses Grandi, strangles him, and leaves Susie, still unconscious, in the room with Grandi's body, all in order to discredit Vargas.  However, exhausted, drunk, and shaken from killing Grandi, Quinlan carelessly leaves his cane at the scene of the murder, implicating himself.  When Susie wakes up, she sees Grandi's dead body, screams for help, and is arrested on suspicion of murder.\nVargas confronts Menzies about the history of evidence \"discovered\" by Quinlan. When he goes to Susie's motel, but cannot find her, Vargas learns the motel is owned by Grandi, and that his handgun has been stolen. He rushes back to town and enters a bar, where he confronts the gang members who attacked his wife. When they refuse to answer his questions, Vargas violently beats them down, destroying the bar in the process. Schwartz then informs a shocked Vargas that Susie has been arrested for murder. At the lockup, Vargas finds her barely conscious. Menzies reveals to Vargas that he discovered Quinlan's cane at the murder scene. Vargas fits Menzies with a wire. Quinlan is at Tanya's brothel, where he asks her to use her tarot cards to tell his future; she tells him that he has no future. A loud player piano prevents recording, so Menzies lures Quinlan out to \"talk\". They walk to a nearby oil field while being tracked on foot by Vargas, who is carrying a recorder and taping the conversation.\nQuinlan admits to Menzies that he planted evidence on people, but insists that he did so only because he knew they were guilty. Quinlan hears an echo from the secret microphone and says his \"game leg\" has informed him of Menzies' betrayal. Quinlan demands that Vargas show himself. Quinlan then shoots Menzies with Vargas's gun, which he had earlier stolen from Vargas's briefcase. Quinlan prepares to shoot Vargas (saying that he can claim Vargas was resisting arrest) but is, instead, shot by the dying Menzies.  Quinlan staggers backwards into a filthy pool of wastewater and dies.  Schwartz arrives at the scene and tells Vargas that the planted dynamite was unnecessary because Sanchez confessed to the crime. Vargas is reunited with Susie, having been exonerated from prison after evidence of Quinlan's confession was found. Tanya finds Quinlan in the wastewater and is asked by Schwartz about what she has to say about Quinlan. Tanya replies, \"He was some kind of a man. What does it matter what you say about people?\" Tanya then walks away as the movie ends.", "cast": "Charlton Heston as Ramon Miguel Vargas\nJanet Leigh as Susan Vargas\nOrson Welles as Police Captain Hank Quinlan\nJoseph Calleia as Pete Menzies\nAkim Tamiroff as Uncle Joe Grandi\nJoanna Cook Moore as Marcia Linnekar\nRay Collins as District Attorney Adair\nDennis Weaver as the Night Manager\nVal de Vargas as Pancho\nMort Mills as Al Schwartz\nVictor Millan as Manolo Sanchez\nLalo Rios as Risto\nPhil Harvey as Blaine\nJoi Lansing as Zita\nHarry Shannon as Police Chief Pete Gould\nRusty Wescoatt as Casey\nWayne Taylor as a gang member\nKen Miller as a gang member\nRaymond Rodriguez as a gang member\nArlene McQuade as Ginnie\nDan White as the Border Guard\nZsa Zsa Gabor as the Strip-club owner\nMarlene Dietrich as Tanya\nMercedes McCambridge as a hoodlum\nWilliam Tannen as Howard Frantz\nJoseph Cotten (uncredited) as a coroner"}