{"_movieID": "135921", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:39:15", "summary": "James Bond 007: Everything or Nothing is a third-person shooter video game, in which the player controls James Bond. Bond is modeled after and voiced by the former James Bond actor Pierce Brosnan. Developed by EA Redwood Shores and published by Electronic Arts, it was released for the GameCube, PlayStation 2, and Xbox consoles. The Game Boy Advance version was developed by Griptonite Games and when linked to the GameCube version via the Nintendo GameCube–Game Boy Advance link cable allowed unique premium content. The game achieved Platinum Hits status on the Xbox.\nWritten by Bruce Feirstein, Danny Bilson and Paul De Meo, Everything or Nothing centers around Bond dealing with the use of nanotechnology as terrorism. It is the second Bond game played in third-person after Tomorrow Never Dies, and is the first Bond game to feature a two-player cooperative mode. The game features returning actors John Cleese and Judi Dench, as Q and M respectively.Electronic Arts retired this game's servers on or around January 13, 2006.", "plot": "Opening in Tajikistan, MI6 agent James Bond infiltrates a stronghold where an organization sells a stolen Soviet suitcase bomb.  Bond triggers a firefight between the two factions making the exchange, using the confusion to steal the device and escape.\nThe game then cuts to Bond infiltrating a research facility in Egypt, with the intent of destroying a nanobot stolen by terrorists that is capable of repairing damaged nuclear reactors without danger to humans. Bond rescues its inventor, Dr. Katya Nadanova (Heidi Klum), and the two make their escape on an armored train where Bond encounters and dispatches Jaws (Richard Kiel), and takes Nadanova by helicopter to her safehouse. Unbeknownst to Bond, after his departure, Nadanova gives a vial of her nanobots to Nikolai Diavolo (Willem Dafoe), a former KGB agent with ties to Max Zorin, and promises him that he will have \"everything he desires.\"\nSome time later, Bond is investigating the disappearance of another 00 Agent, 003, who was last seen near a platinum mine in Peru. Enlisting the aid of an American geologist, Serena St. Germaine (Shannon Elizabeth), Bond finds 003, only for Diavolo to mortally wound the latter; when Bond reaches him, 003 tells Bond that Diavolo is moving his operations to New Orleans before dying. During his escape, Bond discovers that Serena has been captured by Dr. Nadanova, who is revealed to be collaborating with Diavolo. Bond rescues Serena and heads for America.\nSearching New Orleans, Bond infiltrates a factory owned by Diavolo and uncovers a lead pointing to a local nightclub, where he crosses paths with NSA double agent Mya Starling (Mýa), who is also investigating Diavolo. When Starling's cover is blown, Bond rescues her and they track Diavolo's operations to an abandoned plantation in Louisiana; Bond discovers Diavolo has altered Nadanova's nanobots to eat through all metals but platinum. Destroying the laboratory, Bond finds a tanker of nanobots which is being driven by Jaws to the levees with the intent of flooding New Orleans. Bond destroys the truck before it can reach the levees, and returns to Peru to further investigate Diavolo's platinum mines.\nAfter winning a rally race hosted by Diavolo, Bond finds he has captured Serena, allowing Diavolo to escape to the mines. After saving Serena, Bond reaches the mines, but is captured by Nadanova. Diavolo explains that he intends to use the nanobots to destroy the Kremlin and use his army of tanks, armored with platinum to make them immune to the nanobots, to control Russia, and then overthrow Europe. Tied in the path of a mining drill, Bond escapes his shackles and flees the mines in a helicopter piloted by Serena.\nFollowing Diavolo to Moscow, Bond steals one of Diavolo's platinum tanks and uses it to  prevent the release of the nanobots in Red Square and heads for a missile silo hidden under the Kremlin. Deactivating the nanotech missiles, Bond then shoots down a Soviet jet containing Diavolo and Nadanova, killing the latter. Ejecting from the jet, Diavolo reaches a control tower; Bond detonates it, but Diavolo reactivates a missile before falling to his death into the missile silo. Bond then destroys the missile as it launches, before kissing Serena outside the Kremlin.", "cast": "Recurring characters:\n\nJames Bond - (likeness and voice of Pierce Brosnan)\nM - (likeness and voice of Judi Dench)\nQ - (likeness and voice of John Cleese)\nJaws - (likeness and voice of Richard Kiel)Other characters:\n\nWillem Dafoe as Nikolai Diavolo, the game's primary antagonist and an ex-KGB agent, mentored by Max Zorin.\nHeidi Klum as Katya Nadanova, Ph.D., an Oxford nano-technology scientist who is later revealed to have affiliations with Diavolo.\nShannon Elizabeth as Serena St. Germaine, an American geologist and helicopter pilot whose expertise allows her to help Bond in Peru.\nMýa as Mýa Starling, an NSA double agent who aids Bond.\nJames Arnold Taylor as Jack Mason, 003\nKeith Szarabajka as Arkady Yayakov, a New Orleans based Russian crime lord.\nMarc Graue as Jean le Rouge, a hired assassin\nMisaki Ito as Miss Nagai, Q's assistant."}