{"_movieID": "38407", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:59", "summary": "Shanghai (Chinese: 上海, Shanghainese pronunciation: [zɑ̃.hɛ] (listen); Mandarin Chinese pronunciation: [ʂâŋ.xài] (listen)) is one of the four municipalities under the direct administration of the central government of the People's Republic of China, the most populous urban area in China, and the second most populous city proper in the world (after Chongqing), with a population of 26.3 million as of 2019. It is a global financial center and transport hub, with the world's busiest container port. Located in the Yangtze River Delta, it sits on the south edge of the estuary of the Yangtze in the middle portion of the Eastern China coast. The municipality borders the provinces of Jiangsu and Zhejiang to the south, east and west, and is bound to the east by the East China Sea.As a major administrative, shipping and trading city, Shanghai grew in importance in the 19th century due to trade and recognition of its favorable port location and economic potential. The city was one of five treaty ports forced open to foreign trade following the British victory over China in the First Opium War. The subsequent 1842 Treaty of Nanking and 1844 Treaty of Whampoa allowed the establishment of the Shanghai International Settlement and the French Concession. The city then flourished as a centre of commerce between China and other parts of the world (predominantly the Occident), and became the primary financial hub of the Asia-Pacific region in the 1930s. During World War II, the city was the site of the major Battle of Shanghai. After the war, with the CCP takeover of mainland China in 1949, trade was limited to other socialist countries, and the city's global influence declined. In the 1990s, the economic reforms introduced by Deng Xiaoping resulted in an intense re-development of the city, aiding the return of finance and foreign investment to the city. It has since re-emerged as a hub for international trade and finance; it is the home of the Shanghai Stock Exchange, one of the world's largest by market capitalization.Shanghai has been described as the \"showpiece\" of the booming economy of mainland China; renowned for its Lujiazui skyline, and museums and historic buildings, such as those along The Bund, as well as the City God Temple and the Yu Garden."}