{"_movieID": "489929", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:43:51", "summary": "Destination Wedding is a 2018 American romantic comedy-drama film written and directed by Victor Levin, and stars Winona Ryder and Keanu Reeves as two strangers who turn out to be attending the same wedding in Paso Robles.\nIt was theatrically released in the United States on August 31, 2018, by Regatta.", "plot": "Frank and Lindsay meet at the airport as they wait to board their flight to Paso Robles. Initially complimentary towards each other, Lindsay is irritated by Frank after he steps in front of her, thinking that he is going to cut in line. They argue and Frank moves to a different part of the waiting area, cutting in front of another passenger. To both of their irritation, they are forced to sit next to each other on the plane since all other seats are taken. As they talk, they realize that they are both in town for the same wedding. It is revealed that the groom is Frank's half brother, who he loathes, and Lindsay's ex fiancée, who left her five weeks before their wedding. They discover that their hotel rooms are attached after Lindsay walks into his room after mistakenly assuming that the connecting door was a closet.\nThey are seated together for the rehearsal dinner and Frank notes that they were seated together because the groom does not know where else to put them. Lindsay works up the courage to congratulate her ex fiancée and his family, before returning to her hotel room early for the night. As both Frank and Lindsay are going to bed, they realize that they are watching the same movie after hearing each other’s television through the wall. Both approach the connecting door to knock, but do not have the courage to do so and return to watch the film by themselves. \nThroughout the weekend, Frank and Lindsay stick together, often going on walks to avoid participating in various activities with the other wedding guests. As they do so, they reveal more about their past and opinions on relationships. Frank reveals that he does not get along with his brother, but especially dislikes his parents. He cites his parent’s dysfunctional marriage, which was filled with infidelity as a reason for his negativity and cynicism towards love and relationships. Lindsay, while hurt and bitter due to her history of bad relationships, is slightly more hopeful about finding a partner, but has given up on the idea of having children. Although they butt heads on a lot of topics, they seem to find each other amusing and a connection forms.\nAt the wedding reception, unable to take the happiness of the newlyweds and in an attempt to avoid having to dance, Frank and Lindsay decide to go for a walk. Several minutes into their walk, they encounter a mountain lion. Each wants to stay behind and fight the lion in order to give the other a chance at escaping. Frank eventually is able to scare the mountain lion away and they run away. As they run, they trip and end up rolling down a hill, which knocks Lindsay unconscious. After Frank is able to wake her up, he kisses her. She pushes him away and they debate over whether it would be a good idea to have sex. They ultimately decide to even though they don't have condoms. As they have sex, Frank tells Lindsay more about his difficult childhood and ponders whether she will end up pregnant after their encounter. Before she climaxes, he tells her what she must do if she wants the baby to be a boy.\nThey return to Frank’s hotel room to watch bad television, and Lindsay coaxes him into eating the contents of the mini bar, despite how expensive it is. They acknowledge that they find each other attractive and despite several differences, enjoy each other’s company. Lindsay is more open to exploring their relationship, but Frank is adamant that it would be a bad idea, stating that it’s better to accept that they used each other to get through a painful weekend. This upsets Lindsay and she starts to leave until Frank convinces her to return to the bed. Lindsay ends up spending the night in Frank’s room and when they wake up the next morning, he asks her again if she thinks she's pregnant. They have breakfast together and then share a cab to the airport. As they fly back, Lindsay gets drunk and once again tries to convince Frank to give their connection a chance, but he refuses, though he seems unsure about his decision.\nFrank helps Lindsay get a cab and admonishes her for giving the cab driver her full address since it is unsafe, which flatters her. Despite him agreeing with Lindsay when she says that they should not exchange contact information, he seems saddened by the fact that they must say goodbye, and watches as the cab finally drives away. \nBack at his home, Frank goes through his wedding gift basket that was given to guests. As he looks through the items, he is reminded of the weekend he spent with Lindsay. She is at her home trying to save a plant that died while she was away when there is a knock at her door. She opens the door to find Frank. They smile at each other and Lindsay moves to the side to let him inside.", "cast": "Winona Ryder as Lindsay\nKeanu Reeves as Frank"}