{"_movieID": "77948", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:54:25", "summary": "The Cold Light of Day is a 2012 American/Spanish action thriller film directed by Mabrouk El Mechri, starring Henry Cavill, Bruce Willis, and Sigourney Weaver. The film is about Will (Cavill), who finds that his family has been kidnapped by foreign agents who are searching for a briefcase stolen by Will's father (Willis), leading to Will taking matters into his own hands to find them.", "plot": "Will Shaw (Henry Cavill) owns a consultancy business in San Francisco about to go into insolvency, reluctantly visiting his family in Spain for a holiday. He is met there by his father, Martin Shaw (Bruce Willis), an advisor for the U.S. government, who he has a tense relationship with. Will's preoccupation with his phone results in a sailing accident where Will leaps to save his brother's (Rafi Gavron) girlfriend Dara (Emma Hamilton) from being hit by the yacht's boom but she hits her head on a winch. Martin grabs Will's phone and throws it into the ocean. Will swims to town to fetch medical supplies and to cool down. When he returns, he can no longer find his family in the yacht. Will goes to the police and they lead him to Zahir (Roschdy Zem), who knows where Will's family is.  Will senses something is amiss, and attempts to escape in a police car. Martin appears, and aids Will by beating the officers.\nMartin reveals he is a CIA agent, and that the people who kidnapped their family are after a briefcase he had taken on an assignment. Martin meets his CIA team leader Jean Carrack (Sigourney Weaver) in Madrid, who claims she no longer has the briefcase, but he knows she is lying. As Martin returns to his car, he is sniped and killed by Gorman (Joseph Mawle). Will retrieves Martin's phone as Gorman starts shooting at him and gives chase. As Will escapes, he takes a call from the kidnappers, who want to speak to \"Tom\", providing a 21 hour deadline and a meeting point to exchange the briefcase for his family.\nReceiving no help from the US embassy, Will is picked up by Carrack in a car outside, but he realizes she is untrustworthy and gets away. Will arranges a meeting with his father's friend Diego at his office and meets receptionist Lucia Caldera (Verónica Echegui), Diego's niece, where he fights off one of Carrack's men. The pair go to Diego's apartment, but he was killed by Carrack and Gorman. Will and Lucia escape across the rooftops, but Will is shot. Lucia takes him to a nightclub, to a friend who has medical experience that cauterizes the wound. Lucia informs Will that \"Tom\" is Martin's alias in Spain, and she is Will's half sister, being Martin's daughter by another woman. As Will arrives at the meeting point, he is grabbed and tortured for his father's whereabouts by the kidnappers, actually Israeli Mossad agents lead by Zahir, who was using the briefcase to lure a traitor when Martin stole it from them. They realize Carrack framed Martin and she has the briefcase, so they want Will to lure her out. Will briefly sees his family before Zahir releases him.\nWill meets Lucia at the nightclub, where she starts a tab on Carrack's credit card. Gorman appears and is subdued by bouncers at the nightclub and tortured for information but he refuses to budge. Will lets Gorman escape so he can follow him, leading them to Carrack, who tries to sell the briefcase in an underground car park. Zahir's men surround the deal but give away their position, so Carrack and Gorman open fire on their own buyers before starting to attack and escape from Mossad, during which Lucia kills Gorman in a car crash, enraging Carrack as she flees. Will and Lucia pursue Carrack through Madrid, with Carrack causing death and destruction along the way, regardless of discretion, until eventually their cars collide and Lucia is seriously injured. Just as Carrack is about to shoot Will, she is killed by Zahir with a sniper rifle, who retrieves the briefcase and releases Will's family. Lucia recovers in the hospital with her new half family as Will looks on at his new expanded family. Will is offered a job in the CIA; whether he accepts is left unresolved.", "cast": "Henry Cavill as Will Shaw\nSigourney Weaver as Jean Carrack\nBruce Willis as Martin Shaw\nVerónica Echegui as Lucia Caldera\nCaroline Goodall as Laurie Shaw\nRafi Gavron as Josh Shaw\nÓscar Jaenada as Maximo\nLolo Herrero as Reynaldo\nMark Ullod as Vicente\nEmma Hamilton as Dara Collins\nJoseph Mawle as Gorman\nMichael Budd as Esmael\nAlex Amaral as Cesar\nJim Piddock as Meckler\nPaloma Bloyd as Cristiana\nRoschdy Zem as Zahir\nColm Meaney as CIA Agent"}