{"_movieID": "395990", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:54:41", "summary": "Death Wish is a 2018 American vigilante action thriller film directed by Eli Roth and written by Joe Carnahan. It is a remake of the 1974 film of the same name starring Charles Bronson, based on Brian Garfield's 1972 novel. The film stars Bruce Willis as Paul Kersey, a Chicago doctor who sets out to get revenge on the men who attacked his family. Vincent D'Onofrio, Elisabeth Shue, Dean Norris, and Kimberly Elise also star.\nThe film was released in the United States by Metro-Goldwyn-Mayer and in international markets by Annapurna Pictures on March 2, 2018. It was the first film released by MGM through their joint distribution venture with Annapurna (later rebranded as United Artists Releasing). Despite receiving negative reviews from film critics, it was positively received by audiences", "plot": "Paul Kersey, a trauma surgeon in Chicago, lives with his wife Lucy and college-bound daughter Jordan. A restaurant valet, Miguel, photographs the home address from their car's navigation software after overhearing that they will be out one night. Their plans change when Paul is called to work. Jordan and Lucy return home and are confronted by three masked burglars who kill Lucy and leave Jordan in a coma.\nPolice detective Kevin Raines is tasked with the case, but Paul soon becomes frustrated with the lack of progress. One night, Paul comes across two thugs harassing a woman and tries to intervene but gets beaten up. When an injured gang member is brought to the hospital and his Glock 17 falls off the gurney, Paul takes it, using online videos to learn how to use it. Paul uses it to stop a carjacking, a video of which goes viral; he is dubbed Chicago's \"Grim Reaper\". His reputation as the Grim Reaper soars after he kills a drug dealer known as \"The Ice Cream Man\". When Miguel is hospitalized, Paul finds that Miguel is  wearing his stolen watch. After Miguel dies, Paul takes his phone and finds information leading him to a liquor store that fences stolen goods.\nWhen Paul visits the liquor store, the owner Ponytail realizes who he is, secretly messages an accomplice for backup and reaches for a gun. Paul stabs him and demands the goods stolen from him. The accomplice Fish arrives and accidentally kills Ponytail. After shooting Fish, Paul learns from him that Lucy's killer is an auto body worker named Joe. Fish gains the upper hand on Paul, but is killed by a bowling ball falling on his head.\nThe detectives visit Paul and show him a ring found at Fish's, which he identifies as his. They tell him that the discovery of the ring will lead them closer to his wife's killer, including the phones of those involved. Once they leave, he destroys the phones of the perpetrators. At the auto body shop, Paul approaches Joe while he is working under a car. He tortures Joe for information by cutting his sciatic nerve with a scalpel and pouring brake fluid into the wound. Joe divulges that their leader Knox shot Lucy. Paul then crushes Joe's head with the car.\nKnox calls Paul, arranging to meet in a bathroom at a nightclub. When he arrives, Paul calls the number back and hears it ringing in one of the stalls. After shooting into the stall, he finds it is a ruse as Knox is at the other end of the bathroom. They wound each other and Paul gets away. Knox ends up at the hospital where he pretends to be a victim. \nPaul goes home where his brother Frank (after being questioned by the detectives who think he is the \"Grim Reaper\") is. During their questioning, he realized it was Paul. Frank begs him to stop before he has to bury him next to his wife. During their talk, the hospital calls Paul to tell him that Jordan has regained consciousness. \nA week later, as Paul and Jordan leave the hospital, Knox talks to them in the hospital elevator. Jordan does not recognize Knox but Knox tells Paul he'll see him around. Paul returns to the gun store to legally purchase weapons.\nDays later, Knox and two henchmen invade Paul's home at night. Paul glimpses a man running across his lawn and hides Jordan in a closet under the stairs, telling her to call the police. After killing the two henchmen upstairs, Paul heads into the basement, where he suspects Knox is hiding. There, Knox emerges from the darkness, shoots Paul in the shoulder and threatens to burn Jordan alive. When Knox is distracted by Jordan yelling out her father's name, Paul retrieves a fully automatic M4 carbine assault rifle from a hidden compartment under a coffee table and shoots Knox dead. When the police arrive, Det. Raines suspects that Paul is the Grim Reaper but pretends to buy his story because he's satisfied that justice was served. The detective subtly suggests to Paul that his Grim Reaper days are over.\nMonths later, Paul drops Jordan off at NYU. As Paul is leaving, he spots a man who steals a bag from a bellhop, calls out to him and points at him with a finger gun.", "cast": "Bruce Willis as Dr. Paul Kersey\nVincent D'Onofrio as Frank Kersey\nElisabeth Shue as Lucy Kersey\nDean Norris as Detective Kevin Raines\nBeau Knapp as Knox\nKimberly Elise as Detective Leonore Jackson\nStephanie Janusauskas as Sophie\nCamila Morrone as Jordan Kersey\nJack Kesy as The Fish\nRonnie Gene Blevins as Joe\nLen Cariou as Ben\nKirby Bliss Blanton as Bethany\nWendy Crewson as Dr. Jill Klavens"}