{"_movieID": "44264", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:45:42", "summary": "True Grit is a 2010 American Revisionist Western film directed, written, produced, and edited by the Coen brothers and executively produced by Steven Spielberg. It is the second adaptation of Charles Portis' 1968 novel of the same name, which was previously released in 1969 starring John Wayne and Glen Campbell. This version stars Hailee Steinfeld as Mattie Ross and Jeff Bridges as Deputy U.S. Marshal Reuben J. \"Rooster\" Cogburn, along with Matt Damon, Josh Brolin, and Barry Pepper.\nFeisty 14 year-old farm girl Mattie Ross (Steinfeld) hires Cogburn (Bridges), a boozy, trigger-happy lawman after an outlaw named Tom Chaney (Brolin) murders her father. The bickering duo are accompanied on their quest by a Texas Ranger named LaBoeuf (Damon) who has been tracking Chaney for killing a State Senator. As they embark on a dangerous adventure, each character has his or her \"grit\" tested in different ways.\nFilming began in March 2010, and the film was officially released in the U.S. on December 22, 2010 after advance screenings earlier that month. The film opened the 61st Berlin International Film Festival on February 10, 2011. It was well received by critics, garnering a 96% Rotten Tomatoes score. It was nominated for ten Academy Awards: Best Picture, Best Director, Best Adapted Screenplay, Best Actor in a Leading Role (Bridges), Best Actress in a Supporting Role (Steinfeld), Best Art Direction, Best Cinematography, Best Costume Design, Best Sound Mixing, and Best Sound Editing. However, it won none. The film was released on Blu-ray and DVD on June 7, 2011.", "plot": "Mattie Ross's father was murdered by Tom Chaney when she was 14 years old. While collecting her father's body in Fort Smith, Arkansas, Mattie asks the local sheriff about the search for Chaney. He tells her that Chaney has fled with \"Lucky\" Ned Pepper and his gang into Indian Territory, where the sheriff has no authority, so she inquires about hiring a Deputy U.S. Marshal. The sheriff gives three recommendations, and Mattie chooses Rooster Cogburn. Cogburn initially rebuffs her offer, not believing she has the money to hire him, but she raises the money by aggressively horse-trading with Colonel Stonehill.\nTexas Ranger LaBoeuf arrives in town, pursuing Chaney for the murder of a Texas State Senator. LaBoeuf proposes joining Cogburn, but Mattie refuses his offer. She wishes Chaney to be hanged in Arkansas for her father's murder, not in Texas for killing the senator. Mattie also insists on traveling with Cogburn but he leaves without her, having gone with LaBoeuf to apprehend Chaney and split the reward.\nAfter being refused passage on the ferry that conveyed Cogburn and LaBoeuf, Mattie crosses the river on horseback. LaBoeuf expresses his displeasure by spanking Mattie with a stick, but Cogburn eventually allows Mattie to accompany them. After a dispute over their respective service with the Confederate Army, Cogburn ends their arrangement and LaBoeuf leaves to pursue Chaney on his own. Cogburn and Mattie meet a trail doctor who directs them to an empty dugout for shelter. They find two outlaws, Quincy and Moon, and interrogate them. Quincy insists they have no information about the Pepper gang, but eventually Moon divulges what he knows; Quincy fatally stabs Moon, and Cogburn shoots Quincy dead. Before dying, Moon says Pepper and his gang will be returning for fresh horses that night.\nLaBoeuf arrives at the dugout and is confronted by the Pepper gang. Cogburn, hiding on the hillside with Mattie, shoots two gang members and accidentally hits LaBoeuf, but Pepper escapes. However, Cogburn and LaBoeuf argue the next day, and the latter departs again. While retrieving water from a stream, Mattie encounters Chaney. She wounds him with the first shot from her revolver, but when she attempts to shoot him a second time, her gun does not fire allowing Chaney to drag her back to Pepper, who forces Cogburn to leave by threatening to kill her. Pepper leaves Mattie alone with Chaney, ordering him not to harm her or he will not get paid after his remount arrives.\nChaney tries to knife Mattie, but LaBoeuf appears and knocks Chaney out. They watch from a distance as Cogburn fights the remaining members of Pepper's gang, killing two and wounding Ned before his horse is shot and falls, trapping his leg, whereupon LaBoeuf snipes Pepper. Chaney regains consciousness and knocks out LaBoeuf, but Mattie seizes LaBoeuf's rifle and shoots Chaney in the chest. The recoil knocks her into a cave, where she is bitten by a rattlesnake. Cogburn cuts into her hand to suck out as much of the venom as he can, then rides day and night to reach a doctor, carrying her on foot after her horse collapses from exhaustion.\nWe see that Mattie's left forearm was amputated due to gangrene from the snakebite. Cogburn stays until she is out of danger, but leaves before she regains consciousness. She never sees Cogburn or LaBoeuf again, despite writing a letter inviting Cogburn to collect the money she owed him. Twenty-five years later, she receives a note from Cogburn inviting her to a travelling Wild West show  where he now performs. She arrives, only to learn that he died three days earlier. She has his body moved to her family cemetery. Standing over Cogburn's grave, she reflects on her decision to move his remains, and about never having married, as well as the possibility of seeing LaBoeuf again."}