{"_movieID": "172391", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:16:07", "summary": "Khumba is a 2013 3D South African computer-animated comedy film directed and produced by Anthony Silverston, written by Silverston and Raffaella Delle Donne. The film stars the voices of Jake T. Austin, Steve Buscemi, Loretta Devine, Laurence Fishburne, Richard E. Grant, AnnaSophia Robb, Catherine Tate, and Liam Neeson. It was the second movie made by Triggerfish Animation Studios and is distributed by Millennium Entertainment in the US. The International distribution rights are being licensed by Cinema Management Group. The film is about Khumba, a zebra who is half-striped like a quagga and blamed for the lack of rain by the rest of his insular, abusive, superstitious herd, except his dad, mom and Tombi. He embarks on a quest to earn his stripes.\nThe film was dedicated in memory of The Quagga Breeding Project founder Reinhold Rau, who died on 11 February 2006. Rau was known for efforts to use selective-breeding to recreate the extinct quagga, a close relative of the plains zebra. The film premiered at the TIFF on 8 September 2013 and was released on 25 October 2013 by Indigenous Film Distribution. The film earned $28.42 million on a $20 million budget.\n\n", "plot": "In South Africa within the Great Karoo, a half-striped zebra named Khumba (Jake T. Austin) is born into an insular isolated herd of all-striped zebras where his mother is Lungisa (Anika Noni Rose) and his father is Seko (Laurence Fishburne). Rumors that the strange foal is cursed spread and before long he is blamed for the drought that sets into the Great Karoo. As he matures, Khumba is picked on and remains ostracized by most of the herd with the exception of Tombi (AnnaSophia Robb), a young female zebra friend close in age - whom Khumba has a crush on - and uncomfortable in the herd due to her tomboyish manners.\nWhen a mystical African mantis (Adrian Rhodes) appears to Khumba, he draws a map to what could be interpreted as either water or stripes between it. Khumba jeopardizes the herd and gets into trouble when he attempts to admit several gemsbok (Nhlanhla Mkhwanazi and Anele Matoti) into the watering-hole enclosure when their wise elderly healer (Sindiwe Magona) needs water. He also nearly admits the ferocious half-blind African leopard Phango (Liam Neeson) who warns Mkhulu (Ben Vereen) that he and his zebra herd can't stay in their enclosure forever. Seko berates and scolds Khumba for putting the herd at risk and for the next week, he'll drink half of his rations. Lungisa tells the story of how a white horse got its stripes by swimming in a magic river and other horses wanted to have stripes like him, making the zebra we know today. Shortly after, Lungisa succumbs to her disease and dies. Then, Khumba leaves the confines of his home knowing that he cannot survive in the herd where it is viewed as only \"half-a-zebra\" even to his father.\nKhumba ventures beyond the fence and encounters an opportunistic African wild dog named Skalk (Steve Buscemi) who nearly leads the unsuspecting zebra to his doom when Skalk's pack try to eat him. He is saved by a maternal wildebeest named Mama V (Loretta Devine) and a flamboyant British ostrich named Bradley (Richard E. Grant). Mama V is a self-confessed free spirit who does not want to be the average stay-at-home mom, like other wildebeest. She mothers Bradley who possesses a histrionic diva-esque attitude. The duo join Khumba on his quest in the hope that their own search for a safe waterhole is over.\nOn their journey, Khumba aids a migrating herd of springbok in opening a hole in a great fence to continue journeying forward. Curiously, the springbok are all so similar that they cannot even differentiate among one another.\nKhumba thinks his journey is over when he wanders into a new age, bohemian community living safely within the confines of Ying's National Park. There he meets a colorful group of individuals like a family of meerkats, a pangolin, some bushbucks, a bat-eared fox, and an Australian endangered riverine rabbit (Jeff Bennett) who has survived extinction by mastering a myriad of skills ranging from impersonations to beat-boxing. After narrowly escaping capture by an opportunistic group of park rangers who tranquilizes Bradley and traps Khumba in a cage, he wanders to a nearby mountain to speak to the mighty Black Eagle under the advice of the riverine rabbit.\nKhumba encounters a group of fanatical rock hyraxes who worship the Black Eagle and stymie his advance. From the albino Black Eagle (Roger L. Jackson), he learns the way to the watering hole and that it lies in Phango's cave. The Black Eagle also reveals the origins of Phango. Born half-blind and rejected by his family as a cub, Phango is obsessed with being whole and murdered his whole family. Unbeknownst to Khumba, Phango is trailing him because of an ancient myth that says consuming the half-striped zebra will make Phango the most powerful hunter that ever lived.\nAs Khumba journeys onwards, Seko becomes withdrawn and is remorseful that he has let his herd down. He would have never been so hard on Khumba if it never happened. With Tombi’s help, he realizes that if he does not lead his herd in search of another waterhole, they will all die and sets out to follow the trail of Phango. He is prompted by evidence that Khumba may be alive.\nTensions between Khumba, Mama V, and Bradley escalate as they move on. While slaking their thirst at a well on a farm, they are driven away by Nora (Catherine Tate), a loony, solitary Merino sheep, and Khumba reveals that the watering-hole is in Phango's cave. It was revealed that Nora talked about Phango and Khumba reveals that the waterhole is at his cave. The trio has an argument and a fall-out and Khumba continues on alone. Lost and delirious in a saltpan, Khumba is rescued by the same gemsbok healer that he tried to help and wanders the remaining distance to the mountain, and Phango's lair.\nMeanwhile, Phango intercepts Mama V and Bradley and discovers that Khumba is fortuitously heading straight to him and returns to his cave. During this time, it was revealed that Mama V lost her child to Phango. Concerned for Khumba's safety, Mama V and Bradley decide to intercede and warn him. Meanwhile, determined to find the waterhole and get his stripes, Khumba ventures into the leopard's lair.\nAt the same time, Seko and the zebras journey to Phango's lair where they are joined by the springbok herd, the animals from Ying's National Park, the rock-rabbits, Skalk (who left his pack due to \"creative differences\"), and Nora (who was let out of the farm by Skalk).\nWhile Khumba wanders the depths of the dark cave, his herd arrives at the base of the mountain, along with many of the other animals he has encountered along his journey. Within the cave, Khumba finds the watering hole and upon reflection of his mother's words and all of the interactions he has had, he realizes that diversity is essential for survival and that would can be one's difference can, in fact, be one's strength. As Phango closes in, he ends up chasing after Khumba. Khumba races to escape the leopard's clutches as the cave starts to collapse. Part of the cliff gives way which forms a water hole outside Phango's cave. The assembled animals watch the fight between Khumba and Phango, which results in both of them falling due to the collapsing cave. During the battle, Khumba was fatally scarred but Phango falls off the cliff where he is killed by two large rocks falling on him, while Khumba falls into the water and his body washes up on the shores.\nAs it starts to rain, everyone begins to mourn Khumba until he suddenly awakens from his apparent death. As Khumba gets up, Tombi notices the scratch marks that Phango left on Khumba's right side during the fight.\nWith Phango dead and the zebra herd now having a new home, Khumba celebrates with his herd, Mama V, Bradley, Skalk, Nora, the gemsbok herd, the springbok herd, the animals from Ying's National Park, and the rock-rabbits as they engage in different activities around the waterfall.", "cast": "Jake T. Austin as Khumba the Zebra\nSteve Buscemi as Skalk the African Wild Dog\nLoretta Devine as Mama V the Wildebeest\nLaurence Fishburne as Seko the Zebra\nRichard E. Grant as Bradley the Ostrich\nAnnaSophia Robb as Tombi the Zebra\nCatherine Tate as Nora the Merino Sheep\nLiam Neeson as Phango the Leopard\nAnika Noni Rose as Lungisa the Zebra\nBen Vereen as Mkhulu the Zebra\nCharlie Adler as Rock-Rabbit Leader\nDee Bradley Baker as Meerkat Father\nJeff Bennett as Rabbit\nJennifer Cody as Fifi the Zebra\nGreg Ellis as Thabo the Zebra\nRoger L. Jackson as The Black Eagle\nJuanita Jennings as Zuki  the Zebra\nSindiwe Magona as Gemsbok Healer\nAlexander Polinsky as Nigel the Zebra\nJoey Richter as Themba the Zebra\nSam Riegel as Jock the Zebra"}