{"_movieID": "96936", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:19:47", "summary": "The Bling Ring is a 2013 satirical crime film written, directed and produced by Sofia Coppola. It features an ensemble cast, led by Katie Chang, Israel Broussard, Emma Watson, Taissa Farmiga, and Claire Julien. It is based on the 2010 Vanity Fair article \"The Suspects Wore Louboutins\" by Nancy Jo Sales, which dealt with a real-life gang known as the Bling Ring. The story follows a group of fame-obsessed teenagers who use the internet to track celebrities' whereabouts in order to rob their homes.\nThe film is an international co-production by producers in the United States, the United Kingdom, France, Germany and Japan. Coppola began developing a screenplay based on the real-life burglaries in December 2011. Casting took place in early 2012, before principal photography began in March that same year in Los Angeles, California.\nThe Bling Ring had its world premiere in the Un Certain Regard section of the 2013 Cannes Film Festival on May 16, 2013. The film was theatrically released in limited theaters on June 14, 2013 by A24, before opening in a wide release on June 21. The film received mixed-to-positive reviews from critics, with many praising the cast and Coppola's \"stylish\" direction; Watson received critical acclaim for her performance. However, others criticized the film for its \"shallow\" and morally ambiguous approach towards the subject matter.The Bling Ring represents the final work of cinematographer Harris Savides, who died of brain cancer while the film was in post-production. The film is dedicated to him.", "plot": "Quiet teenager Marc Hall arrives as a new student at Indian Hills High School in Agoura Hills, California. Soon after arriving, he is befriended by fame-obsessed Rebecca Ahn. While at a party at Rebecca's house, Rebeca encourages Marc to sneak away with her and the pair check unlocked vehicles on the street, taking valuables such as cash and credit cards. The two begin hanging out after school, and Marc begins to see Rebecca as a sister figure. When he briefly mentions that one of his wealthy acquaintances is out of town, she persuades him to join her in breaking into his house. Rebecca steals a handbag, mentioning that her idol, Lindsay Lohan, has the same one. She also steals cash and the keys to a Porsche, which the pair use to flee the scene. With the cash, the two go on a shopping spree, affording themselves the luxury lifestyle they admire in magazines.\nMarc visits a nightclub with Rebecca and her friends, who include Nicki Moore, Nicki's adoptive sister Sam, and Chloe Tainer, where they rub shoulders with celebrities such as Kirsten Dunst and Paris Hilton. Later, while researching Hilton on the Internet, Marc and Rebecca realize that she is out of town. The pair find her address, go to her house, and, upon finding the key under the doormat, they break in. They go through Hilton's belongings, taking some jewelry with them, including a bracelet that Rebecca later flaunts to Nicki, Sam, and Chloe at a party.\nAt Nicki's request, Rebecca and Marc take her, Sam and Chloe back to Hilton's house. The group marvels at the excess of Hilton's lifestyle, and steals shoes, bags, dresses, cash, and jewelry. Marc and Rebecca return to rob Hilton's house on a third occasion. The pair also decides to rob the home of Audrina Patridge, once again using the Internet to determine when she will not be home. The entire group uses the same method to burgle the home of Megan Fox, with Nicki's younger sister Emily squeezing through a pet door to gain access to the home.\nThe group enters the home of Orlando Bloom and his girlfriend, Miranda Kerr. The girls proceed to steal similar items, while Marc finds a case filled with seven of Bloom's Rolex watches along with a roll of cash. Chloe then helps Marc sell the watches to her friend, a night club manager named Ricky. The group returns once again to Hilton's house, with Sam's boyfriend Rob, who also steals from the home.\nA news report releases captured CCTV footage from the robbery at Patridge's home. This concerns Marc, but Rebecca is undeterred and instigates a burglary at the home of Rachel Bilson. Word spreads amongst the group's social circles, and the girls boast of their accomplishments at parties, also posting photographs of the stolen items on social media sites. The group ultimately breaks into Lohan's house and robs it. Shortly after, Rebecca moves to Las Vegas with her father due to troubles at home, leaving some of her stolen items with Marc, who inadvertently helps Rebecca transfer stolen items across state lines.\nNews reports of the Hollywood Hills burglaries intensify, with the media labeling the group \"The Bling Ring\". CCTV from several robberies in addition to the evidence on social media allows authorities to identify the group. Police arrest Marc, Nicki, Chloe, Rebecca, Rob, and Ricky, but Sam is not identified in the footage and avoids arrest. Marc cooperates with the police, informing them on the details of the burglaries, much to the chagrin of Rebecca, who has been identified as the ringleader. A Vanity Fair journalist interviews Marc, who is remorseful, and Nicki, who vehemently suggests the others were at fault, and that she was simply involved with the wrong people. Rebecca also denies being at fault and tries to pass the blame for all of this to Marc and her other friends. The group is ultimately prosecuted, receiving varying amounts of jail time and is ordered to collectively pay millions of dollars in restitution for the stolen items.\nThe group serves their jail time, and Marc and Rebecca each go into seclusion and never see or speak to each other again, both of them steadfastly blaming each other for the robberies. In the final scene, set a few months later, Nicki is on a talk show talking about her time in jail, and reveals that her cell was next to Lohan's. After digressing, she turns to the audience (and the viewers) as she finds a way to enhance her newfound notoriety, telling them to visit her now-popular website detailing her life after \"The Bling Ring\".", "cast": "CameosParis Hilton as herself\nKirsten Dunst as herself\nBrett Goodkin as himself"}