{"_movieID": "65086", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:38:57", "summary": "The Woman in Black is a 1983 horror novel by Susan Hill, written in the style of a traditional Gothic novel. The plot concerns a mysterious spectre that haunts a small English town, heralding the death of children. A television film based on the story, also called The Woman in Black, was produced in 1989, with a screenplay by Nigel Kneale. In 2012, a theatrical film adaptation of the same name was released, starring Daniel Radcliffe.\nThe book has also been adapted into a stage play by Stephen Mallatratt. It is the second longest-running play in the history of the West End, after The Mousetrap.\n\n", "plot": "The story begins with Arthur Kipps, a retired solicitor who formerly worked for Mr. Bentley. One night he is at home with his wife Esme and four stepchildren, who are telling ghost stories. When he is asked to tell a story, he becomes irritated and leaves the room, and begins to write of his horrific experiences several years in the past.\nMany years earlier, whilst still a junior solicitor for Bentley, Kipps was summoned to Crythin Gifford, a small market town on the north east coast of England, to attend the funeral of Mrs. Alice Drablow. Kipps is reluctant to leave his fiancée, Stella, but he is eager to leave the London smog. The late Drablow was an elderly and reclusive widow who lived alone in the desolate and secluded Eel Marsh House.\nThe house is situated on Nine Lives Causeway. At high tide, it is completely cut off from the mainland, surrounded only by marshes and sea frets. Kipps soon realizes there is more to Alice Drablow than he originally thought. At the funeral, he sees a woman dressed in black and with a pale face and dark eyes, whom a group of children are silently watching. While sorting through Mrs Drablow's papers at Eel Marsh House over the course of several days, he endures an increasingly terrifying sequence of unexplained noises, chilling events and appearances by the Woman in Black. In one of these instances, he hears the sound of a horse and carriage in distress, closely followed by the screams of a young child and his maid, coming from the direction of the marshes.\nMost of the people in Crythin Gifford are reluctant to reveal information about Mrs Drablow and the mysterious woman in black. Any attempts by Kipps to find out the truth causes pained and fearful reactions. From various sources, Kipps learns that Mrs Drablow's sister, Jennet Humfrye, gave birth to a child, Nathaniel. Because she was unmarried, she was forced to give the child to her sister. Mrs Drablow and her husband adopted the boy,  and insisted that he should never know that Jennet was his mother. The child's screams that Kipps heard were those of Nathaniel's ghost.\nJennet went away for a year. When realising she could not be parted for long from her son, she made an agreement to stay at Eel Marsh House with him as long as she never revealed her true identity to him. She secretly planned to abscond from the house with her son.  One day, a horse and carriage carrying the boy across the causeway became lost and sank into the marshes, killing all aboard, while Jennet looked on helplessly from the window.\nAfter Jennet died, she returned to haunt Eel Marsh House and the town of Crythin Gifford, as the malevolent Woman in Black. According to local tales, a sighting of the Woman in Black presaged the death of a child.\nAfter some time (but still years before the beginning of the story), Kipps returns to London, marries Stella, has a child of his own, and tries to put the events at Crythin Gifford behind him. At a fair, while his wife and child are enjoying a horse and carriage ride, Kipps sees the Woman in Black. She steps out in front of the horse and startles it, causing it to bolt and wreck the carriage against a tree, killing the child instantly and critically injuring Stella, who dies ten months later.\nKipps finishes his reminiscence with the words, \"They have asked for my story. I have told it. Enough.\""}