{"_movieID": "162215", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:47:41", "summary": "How I Live Now is a novel by Meg Rosoff, first published in 2004. It received generally positive reviews and won the British Guardian Children's Fiction Prize and the American Printz Award for young-adult literature.", "plot": "Fifteen-year-old Elizabeth (who goes by the name of Daisy) is sent from the US to stay with her aunt Penn and her children, Daisy's cousins, on a remote farm in the United Kingdom during the outbreak of a fictional third world war of the 21st century. Though she is happy about moving away from her stepmother who is pregnant, Daisy is homesick at first. First meeting her 14-year-old cousin Edmond at the airport, Daisy calls him \"some kind of mutt\"; however, her view of Edmond changes after settling in. Arriving at the farm she also meets Edmond's twin brother Isaac, 9-year-old Piper, and Osbert, who is the eldest brother. Daisy's homesickness only lasts for a short while before she and her extended family become close, and Daisy begins to embrace her new home. Daisy soon finds herself falling in love with Edmond and, after realising that the affection is mutual, begins a relationship with him.\nAunt Penn travels to Oslo, where she is stranded after war breaks out. An unknown enemy occupies the UK. The war becomes increasingly difficult for Daisy and her cousins as it increasingly affects their lives, eventually leading to food shortages and lack of other resources. One day, the farm is taken over by soldiers who separate the boys from the girls by sending them away to live at separate homes, and then separate farms. Daisy and Piper are forced to put survival as their top priority and cannot look for the male members of their family. Gradually finding their way back home, the two girls learn the harsh consequences of war and wait for their family in the barn house. After the war ends, Daisy must deal with putting the pieces of her life back together and overcoming the terrible experience of war as she reunites with the forever changed members of her family, including a physically and emotionally scarred Edmond.\nNear the end of the book, Daisy (who had been pulled back to the US by her father) goes back to the UK to see Edmond and the rest. Edmond, who thinks Daisy has broken their promise of always being together, refuses to see her at first. However, he eventually accepts her once again. Instead of going back to the US, Daisy continues to live with Edmond and the rest of the family in the UK."}