{"_movieID": "567649", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:08:57", "summary": "The last mile or last kilometer is a phrase widely used in the telecommunications, cable television and internet industries to refer to the final leg of the telecommunications networks that deliver telecommunication services to retail end-users (customers). More specifically, the last mile means the portion of the telecommunications network chain that physically reaches the end-user's premises. Examples are the copper wire subscriber lines connecting landline telephones to the local telephone exchange; coaxial cable service drops carrying cable television signals from utility poles to subscribers' homes, and cell towers linking local cell phones to the cellular network. The word \"mile\" is used metaphorically; the length of the last mile link may be more or less than a mile. Because the last mile of a network to the user is conversely the first mile from the user's premises to the outside world when the user is sending data, the term first mile is also alternatively used.\nThe last mile is typically the speed bottleneck in communication networks; its bandwidth effectively limits the bandwidth of data that can be delivered to the customer. This is because retail telecommunication networks have the topology of \"trees\", with relatively few high capacity \"trunk\" communication channels branching out to feed many final mile \"twigs\". The final mile links, being the most numerous and thus the most expensive part of the system, as well as having to interface with a wide variety of user equipment, are the most difficult to upgrade to new technology. For example, telephone trunklines that carry phone calls between switching centers are made of modern optical fiber, but the last mile is typically twisted pair wires, a technology which has essentially remained unchanged for over a century since the original laying of copper phone cables.\nTo resolve, or at least mitigate, the problems involved with attempting to provide enhanced services over the last mile, some firms have been mixing networks for decades. One example is fixed wireless access, where a wireless network is used instead of wires to connect a stationary terminal to the wireline network. Various solutions are being developed which are seen as an alternative to the last mile of standard incumbent local exchange carriers. These include WiMAX and broadband over power lines.\nIn recent years, usage of the term \"last mile\" has expanded outside the communications industries, to include other distribution networks that deliver goods to customers, such as the pipes that deliver water and natural gas to customer premises, and the final legs of mail and package delivery services. The term has also been used to describe education and training providers that more tightly link individuals with job opportunities."}