{"_movieID": "10024", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:49:32", "summary": "My Sister's Keeper is a 2009 American drama film directed by Nick Cassavetes and starring Cameron Diaz, Abigail Breslin, Sofia Vassilieva, Jason Patric, and Alec Baldwin. Based on Jodi Picoult's 2004 novel of the same name, on June 26, 2009 the film was released to cinemas in the United States, Canada, Ireland, Mexico, and the United Kingdom.", "plot": "Kate Fitzgerald (Sofia Vassilieva) has acute promyelocytic leukemia. Conceived by in vitro fertilization, her younger sister Anna (Abigail Breslin) was brought into the world as a savior sister. She is a genetic match to her older sister and can donate compatible organs, blood, and tissue to help her. When Kate turns 15, she goes into renal failure and 11-year-old Anna knows that she will be forced by her parents to donate one of her kidneys. She also realizes that she may not be able to live the life she wants to lead – she will not be able to play sports, drink alcohol, or be a mother in the future. Anna tells her parents that she does not want to be a donor and sues them for medical emancipation and the rights to her own body. Her father, Brian (Jason Patric), understands her, though her domineering mother, Sara (Cameron Diaz), who leads an obsessive campaign to keep Kate alive, is indignant at her decision. Attorney Campbell Alexander (Alec Baldwin) agrees to work for Anna as her guardian ad litem, suing for partial termination of parental rights. He has agreed to take the case because he has epilepsy, and is sympathetic to her predicament.\nThe film is interlaced with flashbacks that detail Kate and Anna's close relationship, as well as how Kate's illness has affected her siblings, including their brother, Jesse (Evan Ellingson) who has run away from his summer camp. In a flashback, Kate meets a fellow cancer patient, Taylor Ambrose (Thomas Dekker), whom she begins dating. He asks her to the hospital's prom for teen patients; there, they slow-dance, then have sex. A few days later, Kate is upset that she has not seen Taylor since the dance. She learns that Taylor has died and attempts suicide by overdosing on painkillers, but Anna stops her. Kate expresses hope that after she dies, she will see Taylor.\nKate makes a request to go to the beach one last time. Brian obtains permission and discharges her from the hospital for the day. Sara overreacts and demands that Kate be returned to the hospital immediately. Brian angrily refuses and threatens Sara with a divorce if she does not join them. Sara shows up at the beach, where they enjoy one final family outing.\nDuring the hearing, Jesse reveals that Anna is actually acting under Kate's instruction; Kate, not wanting to live any longer, had persuaded Anna to refuse to donate her kidney. Anna had wanted to give Kate her kidney and had been upset at Kate's decision. Sara is finally forced to acknowledge what Kate has been trying to tell her all this time: she is ready to die. Later that day, Kate dies sleeping, with her mother by her side. After her death, Campbell states that Anna has won the case. The family moves on with their lives. Sara, who gave up practicing law to look after Kate, returns to work, Brian retires from firefighting and counsels troubled youths, and Jesse receives an arts scholarship in New York. Anna reveals that every year on Kate's birthday they go to Montana, which was her \"most favorite place in the world\". She concludes that she was not born merely to save her sister, she was born because she had a sister, and that their relationship continues even in death.", "cast": "Abigail Breslin as Anna Fitzgerald\nAlexandra Casteele as Young Anna Fitzgerald\nCameron Diaz as Sara Fitzgerald\nSofia Vassilieva as Kate Fitzgerald\nOlivia Hancock as young Kate Fitzgerald\nJason Patric as Brian Fitzgerald\nChris Kinkade as Dr. Nguyen\nDavid Thornton as Dr. Chance\nEvan Ellingson as Jesse Fitzgerald\nBrennan Bailey as young Jesse Fitzgerald\nPaul Christopher Butler as three-year-old Jesse\nAlec Baldwin as Campbell Alexander\nE.G. Daily as Nurse Susan\nLin Shaye as Nurse Adele\nJoan Cusack as Judge De Salvo\nHeather Wahlquist as Kelly\nThomas Dekker as Taylor Ambrose\nEmily Deschanel as Dr. Farquad"}