{"_movieID": "383498", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:56:41", "summary": "Deadpool 2 is a 2018 American superhero film based on the Marvel Comics character Deadpool. It is the eleventh installment in the X-Men film series, and is the sequel to 2016's Deadpool. The film was directed by David Leitch from a screenplay by Rhett Reese, Paul Wernick, and Ryan Reynolds, who stars in the title role alongside Josh Brolin, Morena Baccarin, Julian Dennison, Zazie Beetz, T.J. Miller, Brianna Hildebrand, and Jack Kesy. In the film, Deadpool forms the X-Force to protect a young mutant from the time-traveling soldier Cable.\nPlans for a sequel to Deadpool began before the original film's release, and were confirmed in February 2016. Though the original creative team of Reynolds, Reese, Wernick, and director Tim Miller were quickly set to return for the second film, Miller left the project in October 2016 due to creative differences with Reynolds and was soon replaced by Leitch. An extensive casting search took place to fill the role of Cable, with Brolin ultimately cast. Filming took place in British Columbia from June to October 2017. The film is dedicated to stuntwoman Joi \"SJ\" Harris, who died in a motorcycle accident during filming. \nDeadpool 2 was released in the United States on May 18, 2018 by 20th Century Fox. It grossed over $785 million worldwide, becoming the ninth-highest-grossing film of 2018, as well as the highest-grossing R-rated film of all time and the highest-grossing X-Men film of all time. The film received positive reviews from critics, who praised its humor, acting (particularly Reynolds, Brolin, and Beetz's performances), story, and action sequences. Some critics considered it better than the first film, although others criticized its tone and script. A PG-13 rated version of the film, titled Once Upon a Deadpool, released on December 12, 2018, to mixed reviews.", "plot": "After fighting organized crime as the mercenary Deadpool for two years, Wade Wilson fails to kill one of his targets on his anniversary with Vanessa, his girlfriend. That night, after the pair decide to start a family together, the target tracks Wilson down and inadvertently kills Vanessa. Wilson kills the man in revenge, and blaming himself for her death attempts to commit suicide six weeks later by blowing himself up. Wilson has a vision of Vanessa in the afterlife, but the pieces of his body remain alive and are put back together by Colossus. Wilson is left with only a Skee-Ball token, an anniversary gift, as a final memento of Vanessa.\nRecovering at the X-Mansion, Wilson reluctantly agrees to join the X-Men because he believes Vanessa would have wanted him to. He, Colossus, and Negasonic Teenage Warhead respond to a standoff between authorities and the unstable young mutant Russell Collins / Firefist at an orphanage, labeled a \"Mutant Reeducation Center\". Wilson realizes that Collins has been abused by the orphanage staff, and kills one of the staff members. Colossus stops him from killing anyone else, and both Wilson and Collins are arrested. Restrained with collars that suppress their powers, they are taken to the Ice Box, an isolated prison for mutant criminals. Meanwhile, Cable—a cybernetic soldier from the future whose family is murdered by an older Collins—travels back in time to kill Collins before he ever becomes a killer.\nCable breaks into the Ice Box and attacks Collins. Wilson, whose collar breaks in the ensuing melee, attempts to defend Collins. After Cable takes Vanessa's token, Wilson forces himself and Cable out of the prison, but not before Collins overhears Wilson deny that he cares for the young mutant. Near death again, Wilson has another vision of Vanessa in which she convinces him to help Collins. Wilson organizes a team called X-Force to break Collins out of a prison-transfer convoy and defend him from Cable. The team launches its assault on the convoy by parachute, but all of the members die during the landing except for Wilson and the lucky Domino. While they fight Cable, Collins frees fellow inmate Juggernaut, who agrees to help Collins kill the abusive orphanage headmaster. Juggernaut destroys the convoy, allowing himself and Collins to escape.\nCable offers to work with Wilson and Domino to stop Collins' first murder, and agrees to give Wilson a chance to talk Collins down. At the orphanage, they are overpowered by Juggernaut while Collins attacks the headmaster, until Colossus—who had at first refused to help Wilson due to Wilson's murderous ways—arrives to distract Juggernaut. When Wilson fails to talk down Collins, Cable shoots at the young mutant. Wilson leaps in front of the bullet while wearing the Ice Box collar and dies, reuniting with Vanessa in the afterlife. Seeing this sacrifice, Collins does not kill the headmaster; this changes the future so that Cable's family now survives. Cable uses the last charge on his time-traveling device, which he needed for returning to his family, to go back several minutes and strap Vanessa's token in front of Wilson's heart. Now when Wilson takes the bullet for Collins, it is stopped by the token and both survive while Collins still has his change of heart. Afterwards, the headmaster is run over by Wilson's taxi-driver friend Dopinder.\nIn a mid-credits sequence, Negasonic Teenage Warhead and her girlfriend Yukio repair Cable's time-traveling device for Wilson. He uses it to save the lives of Vanessa and X-Force member Peter, and kills both X-Men Origins: Wolverine's version of Deadpool and actor Ryan Reynolds while he is considering starring in the film Green Lantern.", "cast": "Ryan Reynolds as Wade Wilson / Deadpool: A wisecracking mercenary with accelerated healing but severe scarring over his body after undergoing an experimental regenerative mutation. He forms the X-Force, a team of mutants, after finding himself at his \"lowest point\" at the beginning of the film. The film makes several references to Deadpool's pansexuality after the first film was criticized for ignoring it. As a co-writer on the film, Reynolds ad-libbed much of his dialogue throughout the production process. For the film's mid-credits sequence, archive footage of Reynolds portraying Deadpool in X-Men Origins: Wolverine is used, and Reynolds also portrays himself before he acted in the film Green Lantern.\nJosh Brolin as Cable: A time-traveling cybernetic soldier, \"in many ways the opposite of Deadpool\". Director David Leitch called the dynamic between Cable and Deadpool \"sort of classic buddy-cop fare\", and compared them to the characters portrayed by Nick Nolte and Eddie Murphy, respectively, in 48 Hrs. (1982). Leitch added that the character as written in the script was mostly just an \"action character\", and he relied on Brolin to add nuance to the role and explore the character's internal pain to avoid it becoming a caricature. Brolin signed a four-film deal to play the character, and described his appearance here as just the introduction for the character, with \"three more movies to reveal more\".\nMorena Baccarin as Vanessa: Wilson's fiancée. The character is killed at the beginning of the film in an example of \"fridging\"—the killing of a female character to forward the development of a male character. This happens to Cable's wife and daughter as motivation for his story arc as well. Leitch and the writers said they were unaware of the term \"fridging\", and that they were not being \"consciously sexist\". Earlier versions of the film simply had Vanessa breaking up with Wilson, but the writers wanted to use the opportunity to \"engender great suffering for him by having his line of work be the thing that costs Vanessa her life\". They were also more comfortable with the deaths due to the increased number of strong female characters in the film, and because the deaths are reversed by the end of the film with time travel; screenwriter Rhett Reese stated, \"Maybe that's a sexist thing. I don't know. And maybe some women will have an issue with that. I don't know. I don't think that that'll be a large concern, but it didn't even really occur to us.\" Baccarin said she trusted the storyline was necessary for the film, and emphasized the fact that Vanessa is saved at the end of the film.\nJulian Dennison as Russell Collins / Firefist: A young mutant with pyrokinesis who is being hunted by Cable. Reynolds insisted on casting Dennison after seeing him in Hunt for the Wilderpeople (2016), with the character \"tailor-made\" for him, and no other actors considered for the role. The character is considered a villain for much of the film, which Leitch thought was an \"interesting take on the whole angle of the villain\". Dennison felt the role was particularly special because, being \"chubby\", he would watch superhero films and \"never see anyone like me. I am excited to be that for other kids who look like me.\"Sala Baker as Older Firefist, who appears in Cable's future.Zazie Beetz as Domino: A mercenary with the mutant ability to manipulate luck, who joins Deadpool's X-Force team. Leitch described the film's version of the character as Beetz' own \"real fun interesting take\", with the actress interpreting the character as an only child who forms a \"sibling sort of relationship\" with Deadpool, with \"that back-and-forth banter where she is not dealing with his\". Beetz began \"working out everyday\" when she got the role, which required her to shoot guns and use \"full body\" physicality, and chose not to shave her armpits to match the changing perception of the practice among the general public and to prove that it is \"not something that is gross or shameful\".\nT.J. Miller as Weasel: Wilson's best friend and the owner of a bar frequented by mercenaries.\nBrianna Hildebrand as Negasonic Teenage Warhead: A teenage X-Man with the mutant power to detonate atomic bursts from her body, she is now a \"new level of X-Men\" after being a trainee in the first film. Hildebrand felt that \"it's cool that she's grown and matured and she still has so much of this essence of a punk kid\" from the first film, and added that the character would have a \"cooler\" costume in the sequel. The filmmakers intended to have Hildebrand shave her head to indicate that her abilities burned off her hair, but she was unable to do so due to a television series commitment. The film also reveals that Negasonic is in a same-sex relationship, which is the first openly LGBTQ relationship depicted in a Marvel film. When Reynolds asked Hildebrand how she felt about the potential storyline during development, the actress—a member of the LGBTQ community herself—responded positively with the stipulation that the film not make \"a big deal\" about the relationship. In a statement, GLAAD President and CEO Sarah Kate Ellis praised the relationship as \"a milestone in a genre that too often renders LGBTQ people invisible, and should send a message to other studios to follow this example of inclusive and smart storytelling\".\nJack Kesy as Black Tom Cassidy: A mutant inmate of the facility where Deadpool and Firefist are imprisoned. He was originally written as a more prominent antagonist, who would have acted as a \"devil on Firefist's shoulder\", but it was reduced after the writers decided that there were too many antagonists in the story, and that the budget would be better spent on a character such as Juggernaut.In addition to portraying Deadpool and himself, Reynolds provided the voice for the Juggernaut. Juggernaut is credited as being voiced by \"himself\", and was previously portrayed by Vinnie Jones in the 2006 film X-Men: The Last Stand. According to Reese, the creative team on Deadpool 2 felt that appearance did not do justice to the character. Wanting an additional villain for the film to support Firefist for the final fight with X-Force, the writers chose Juggernaut because he is \"a force of nature [who] was probably the coolest character never to be used ... in the right way\". The character's face was modeled on Leitch's, with Reynolds providing facial capture and his voice. The latter was digitally modulated to make it deeper. Reese added that the character \"didn't have many lines, he's a man of few words, but he's a man of great anger and forcefulness\".Stefan Kapičić voices Colossus, an X-Man with the mutant ability to transform his entire body into organic steel. Kapičić described Colossus as one of the most important characters in the film, requiring a more intense process for Kapičić during recording for the character. He explained that Colossus would continue to try make Deadpool a better person and potential X-Man after doing so in the first film. Unlike the first film, Kapičić also provided performance capture for the character's face on the sequel, while Andre Tricoteux returned to stand-in for the character on set. Leslie Uggams and Karan Soni also return from the first film as Deadpool's elderly roommate Blind Al and the taxi driver Dopinder, respectively. Additionally, Eddie Marsan plays the headmaster of the Essex Home for Mutant Rehabilitation, an orphanage; Robert Maillet briefly appears as Sluggo, an inmate of the Ice Box who originally had a more prominent antagonistic role alongside Black Tom before both roles were reduced due to the number of villains in the film; Hayley Sales and Islie Hirvonen respectively appear as Cable's wife and Hope, their daughter, during a flashforward; and Shioli Kutsuna portrays Yukio, Negasonic Teenage Warhead's girlfriend and fellow X-Man. A version of Yukio previously appeared in the 2013 film The Wolverine, portrayed by Rila Fukushima. The film's version of the X-Force team also includes Terry Crews as Bedlam, Lewis Tan as Shatterstar, Bill Skarsgård as Zeitgeist, Rob Delaney as Peter, and Brad Pitt as Vanisher. Pitt was considered for the role of Cable before scheduling issues prevented him from taking it; he filmed his Vanisher cameo in two hours during post-production.Reprising their roles as the X-Men for a brief appearance are James McAvoy as Professor X, Nicholas Hoult as Beast, Evan Peters as Quicksilver, Tye Sheridan as Cyclops, Alexandra Shipp as Storm, and Kodi Smit-McPhee as Nightcrawler. Archive footage of Hugh Jackman as Wolverine from X-Men Origins: Wolverine is used in the mid-credits sequence, with Jackman's permission. This was re-edited for the sequence, and included raw footage shot for that film. Luke Roessler, who portrays a young David Haller in the X-Men based television series Legion, appears as a young mutant credited as \"Cereal Kid\". When Cable travels to the present day, he comes across two \"rednecks\" discussing a toilet paper manifesto. This was inspired by a real manifesto written by Reese, which the writers wanted to be discussed in the film by a certain \"calibre\" of actor: the characters are portrayed by Alan Tudyk and a disguised Matt Damon, with the latter credited as \"Dickie Greenleaf\" (a reference to the 1999 film The Talented Mr. Ripley in which Damon stars). Leitch and writers Reese and Paul Wernick respectively cameo as Ice Box inmate \"Ground Chuck Mutant\", a news helicopter pilot, and a news cameraman. Stan Lee was unable to cameo in the sequel, as he did in the first film and the short No Good Deed, but his likeness was used for a bust in the X-Mansion and for graffiti on a wall."}