{"_movieID": "12502", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:31:00", "summary": "Silkwood is a 1983 American biographical drama film directed by Mike Nichols and starring Meryl Streep, Cher and Kurt Russell. The screenplay by Nora Ephron and Alice Arlen was inspired by the life of Karen Silkwood. Silkwood was a nuclear whistleblower and a labor union activist who died in a car collision while investigating alleged wrongdoing at the Kerr-McGee plutonium plant where she worked. In real life, her death gave rise to a 1979 lawsuit, Silkwood v. Kerr-McGee, led by attorney Gerry Spence. The jury rendered its verdict of $10 million in damages to be paid to the Silkwood estate (her children), the largest amount in damages ever awarded for that kind of case at the time. The Silkwood estate eventually settled for $1.3 million.Silkwood was shot largely in both New Mexico and Texas on a budget of $10 million. Factual accuracy was maintained throughout the script, with some incidents exactly parallel to the real-life experiences of Karen Silkwood. One scene in particular involved the activation of a radiation alarm at the plant. Silkwood herself had forty times the legal limit of radioactive contamination in her system. Streep had just finished filming Sophie's Choice (1982) when production began. The film also marked a departure for some of its stars: it is noted for being one of the first \"serious\" works of Cher, who had been previously known mostly for her singing, and for Russell, who was at the time widely known for his work in the action genre.\nThe film received positive reviews and was a box office success, with particular attention focused on the performances by the three leads. At the 56th Academy Awards, Silkwood received five nominations in total, including Streep for Best Actress, Cher for Best Supporting Actress, and Nichols for Best Director. After being out of print on DVD in the United States, the film was released on Blu-ray on July 25, 2017.", "plot": "Karen Silkwood, a worker at the Kerr-McGee Cimarron Fuel Fabrication Site (near Crescent, Oklahoma), shares a ramshackle house with two co-workers, her boyfriend Drew Stephens and her lesbian friend Dolly Pelliker. She makes plutonium fuel rods for nuclear reactors, where she deals with the threat of exposure to radiation. She has become a union activist, concerned that corporate practices may adversely affect the health of workers. She is also engaged in a conflict with her former common-law husband in an effort to have more time with their three children.\nBecause the plant has fallen behind on a major contract—ostensibly to provide fuel rods for a breeder reactor at the Hanford Site—employees are required to work long hours of overtime. She believes that managers are falsifying safety reports and cutting corners wherever possible, risking the welfare of the personnel. Karen approaches the union with her concerns and becomes active in lobbying for safeguards. She travels to Washington, D.C. to testify before the Atomic Energy Commission. She interacts with union officials who appear to be more interested in the publicity she is generating than her welfare and that of her co-workers.\nWhen Silkwood and other workers become contaminated by radiation, plant officials try to blame her for the incident. When she discovers that negatives of photographs of faulty fuel rods have been retouched and records of inadequate safety measures have been altered, she decides to conduct an investigation of her own. Complications arise in her personal life when Angela, a funeral parlor beautician, joins the household as Dolly's lover. Unable to deal with Silkwood's obsession with gathering evidence and her potential infidelities, Drew moves out.\nOnce she feels she has gathered sufficient documentation, Silkwood contacts a reporter from The New York Times and arranges a nighttime meeting. In the film's final moments, the scene fades out as Silkwood, on her way to the meeting, sees approaching headlights in her rear-view mirror, which draw up so close that they blind her and make her unable to watch the road ahead. The scene fades in on the aftermath of her fatal one-car crash."}