{"_movieID": "463821", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:35:27", "summary": "The House with a Clock in Its Walls is a 2018 American fantasy comedy film directed by Eli Roth, based on the 1973 novel of the same name by John Bellairs, and starring Jack Black, Cate Blanchett, Owen Vaccaro, Renée Elise Goldsberry, Sunny Suljic, and Kyle MacLachlan. The film follows a young boy, Lewis, who is sent to live with his uncle, Jonathan, in a creaky old house. He soon learns it was previously inhabited by a sinister wizard. \nUniversal Pictures released the film in the United States on September 21, 2018. It was a box office success, grossing over $131 million worldwide, and received lukewarm reviews from critics, who largely praised the cast but said the film did not fully live up to its potential.", "plot": "In 1955, after his parents are killed in a car crash, ten-year-old Lewis Barnavelt moves to live with his Uncle Jonathan. All he has left of his parents is a Magic 8-Ball they had given him, and a family photograph. He meets Jonathan’s neighbor and best friend Florence Zimmerman.\nDuring the night, Lewis is puzzled when he hears a ticking sound in the walls. Lewis begins exploring the house and stumbles upon Jonathan smashing a wall with an ax. Frightened, he runs away and stumbles upon multiple household objects coming to life. Jonathan confesses that he is a warlock and Florence is a witch. The house’s previous owners were a sinister warlock named Isaac Izard and his equally wicked wife Selena, who had hidden a clock within the walls of the house before they died. Jonathan has been trying to find it and discover its purpose. Despite Jonathan’s cautions, Lewis begins teaching himself magic.\nOn his first day at his new school, Lewis meets Tarby Corrigan, who befriends him during Tarby’s campaign for class president. When Tarby wins the election he abandons Lewis.\nLewis’ mother visits him in dreams. When he laments that Tarby does not see him as a friend, she suggests that he use a spell from a forbidden book to impress Tarby. On Halloween night Lewis performs a necromancy spell in a cemetery, accidentally summoning the ghost of Isaac.\nLewis spots Isaac in the house of a neighbor, Mrs. Hanchett. He brings her to the house, but before he can find Jonathan, Isaac emerges. He reveals that Mrs. Hanchett is really Selena, who killed Mrs. Hanchett and took her place. It was also she who took the form of Lewis’ mother to persuade him to summon Isaac. Isaac explains that his hidden clock will turn time back so that humanity never existed. Florence, Jonathan, and Lewis run from the house.\nUsing the Magic 8-Ball to learn the location of the clock under the boiler room, the three return, but Florence is sidelined, and the Izards transform Jonathan into a half baby-half adult. Lewis consults the Magic 8-Ball, which says \"Say goodbye\". He realizes he has to let go of the pain of losing his parents to harness his true power. He breaks the clock by dropping the ball into its gears, then, using his own magic, he blasts Isaac and Selena with magic he channels from the clock. They fall, de-age, and are ultimately erased from existence. \nLewis returns to school with more confidence and gets revenge on Tarby and his friends by magically bouncing a basketball on their faces, and also befriends a girl named Rose Rita Pottinger. At the end of the day, Jonathan and Florence are shown picking up Lewis, the three of them now like a regular family.", "cast": "Jack Black as Jonathan Barnavelt, Lewis’s uncle and a warlock\nCate Blanchett as Florence Zimmerman, Jonathan’s neighbor, and friend, and a witch\nOwen Vaccaro as Lewis Barnavelt, Jonathan’s 10 year-old orphaned nephew\nRenée Elise Goldsberry as Selena Izard, Isaac’s wife and an evil witch\nSunny Suljic as Tarby Corrigan, Lewis’ classmate\nColleen Camp as Mrs. Hanchett, Jonathan’s nosey neighbor\nLorenza Izzo as Mother, Lewis’ mother and Jonathan's sister\nKyle MacLachlan as Isaac Izard, an evil warlock\nVanessa Anne Williams as Rose Rita Pottinger, a classmate that Lewis is sweet on"}