{"_movieID": "369192", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:40:02", "summary": "Battle of the Sexes is a 2017 biographical sports film directed by Valerie Faris and Jonathan Dayton and written by Simon Beaufoy. The plot is loosely based on the 1973 tennis match between Billie Jean King and Bobby Riggs. The film stars Emma Stone and Steve Carell as King and Riggs, leading an ensemble cast including Andrea Riseborough, Elisabeth Shue, Austin Stowell, Bill Pullman, Natalie Morales, and Sarah Silverman in supporting roles.\nThe film had its premiere at the Telluride Film Festival on September 2, 2017, and was theatrically released in the United States by Fox Searchlight Pictures on September 22, 2017. It received positive reviews from critics, who praised the performances of Stone and Carell and the direction, with some calling it the best performance of Stone's career. Despite the positive reviews, the film was a box office bomb, grossing $18.4 million against a $25 million budget. \nAt the 75th Golden Globe Awards, Stone and Carell received nominations for Best Actress – Motion Picture Musical or Comedy and Best Actor – Motion Picture Musical or Comedy respectively. Both received Critics Choice Awards nominations in the categories Best Actress in a Comedy and Best Actor in a Comedy. At the 24th Screen Actors Guild Awards, Carell received a nomination for Outstanding Performance by a Male Actor in a Supporting Role.", "plot": "In 1970, Billie Jean King and Gladys Heldman confront Jack Kramer, who has organized a tennis tournament where the top prize for women is one-eighth of the men's prize, despite equal ticket sales. King and Heldman threaten to start their own tour but Kramer won't alter the terms, citing the inferiority of women's tennis. When Billie Jean, Julie Heldman, Valerie Ziegenfuss, Judy Dalton, Kristy Pigeon, Peaches Bartkowicz, Kerry Melville Reid, Nancy Richey, and Rosie Casals sign on as the “Original 9” players of what becomes the Virginia Slims Circuit, Kramer bans them from tournaments organized by the US Lawn Tennis Association.\nWhile the women's tour struggles during its early days, Billie Jean begins an affair with Marilyn Barnett, her hairdresser, threatening her marriage to Larry King. Meanwhile, Bobby Riggs' marriage to the wealthy Priscilla Whelan is in trouble because of his addiction to gambling. Thrown out of his house when he can't conceal a Rolls Royce he won in a tennis bet, he hits upon the idea of a challenge match against the top woman player, boasting that even at age 55 he can beat any woman.\nThe women's tour has slowly gained a stronger foothold, with the Women's Tennis Association formed in 1973. Riggs continues to pressure King to play him. Eventually, Riggs persuades Margaret Court, who recently overtook King to gain the World No. 1 ranking, to play a match in May 1973. Riggs easily defeats Court and King decides she has to accept his challenge, but demands a final say as to the arrangements. King trains intensely, while Riggs relaxes. King objects to Kramer as a game announcer, threatening to not play unless he withdraws, which he does. After a slow start, King wins the match and Riggs reunites with his wife."}