{"_movieID": "80321", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:48:04", "summary": "Madagascar 3: Europe's Most Wanted (also simply known as Madagascar 3) is a 2012 American computer-animated comedy film produced by DreamWorks Animation and distributed by Paramount Pictures.1 It is the third installment of the Madagascar series and the sequel to Madagascar: Escape 2 Africa (2008). It is also the first in the series to be released in 3D. The film was directed by Eric Darnell, Tom McGrath, and Conrad Vernon from a screenplay by Darnell and Noah Baumbach. Ben Stiller, Chris Rock, David Schwimmer, Jada Pinkett Smith, Sacha Baron Cohen, Cedric the Entertainer, and Andy Richter reprise their roles from the previous films, with newcomers including Jessica Chastain, Bryan Cranston, Martin Short, and Frances McDormand.\nIn this film, Alex, Marty, Melman, and Gloria are still struggling to get home to New York. This time, their journey takes them to Europe, where they are relentlessly pursued by the murderous Monaco-based French Animal Control officer Captain Chantel DuBois. As a means of getting passage to North America, the animals join a circus, where they become close friends with the animal performers, including the new characters of Gia, Vitaly, and Stefano. Together, they spectacularly revitalize the business and along the way find themselves reconsidering where their true home really is.\nMadagascar 3: Europe's Most Wanted made its world premiere at the 2012 Cannes Film Festival on May 18, 2012, and was released in the United States on June 8. It has a 79% approval rating on Rotten Tomatoes (the highest rating in the series) and is the eighth highest-grossing film of 2012 and the highest-grossing Madagascar film with a worldwide gross of over $746 million. A spin-off titled Penguins of Madagascar was released on November 26, 2014. A sequel, Madagascar 4, was initially planned but was later put on indefinite hold due to DreamWorks Animation's 2015 restructuring.", "plot": "Many days after bidding the penguins goodbye, Alex the lion suggests to his friends, Marty the zebra, Melman the giraffe and Gloria the hippopotamus and the lemurs, King Julien XIII the ring-tailed lemur, Maurice the aye-aye and Mort the mouse lemur that they should go to Monte Carlo to get the penguins and chimpanzees, Mason and Phil and fly back to New York City, which they agree to do.\nIn Monte Carlo, the penguins and chimpanzees have been saving up their daily winnings from the casino to fly back to Africa and bring their friends home. Alex's interference to kidnap them leads to animal control, led by a vicious big-game hunter and animal control veteran named Chantel DuBois, pursuing them around the city, with Alex and the gang barely escaping. With determination, DuBois vows to capture Alex and add his head to her collection of animals' heads she's captured.\nIn the skies of France, the plane crashes due to mechanical failure, and the authorities close in. They come across a circus train consisting of Stefano the sea lion, Gia the jaguar, and Vitaly the tiger, and manage to gain entry, claiming that they are circus animals themselves. The team soon learn from Stefano that they are performing in Rome and London, where they plan to impress a promoter to get them on their first American tour. Before the zoo animals' claim is discredited, the penguins suddenly appear with a deal to purchase the circus themselves; however, the circus animals' show in Rome proves to be a failure.\nEn route to London, Stefano soon reveals to Alex that Vitaly was the biggest star of them all, but quit due to an accident in one of his stunts; therefore, the friends lost faith in the circus. At a stop in the Alps, Alex convinces the circus to continue pursuing the circus. Marty finds a new passion in being shot out of a cannon along with Stefano, while Melman and Gloria decide to dance on a tightrope. Gia persuades Alex to teach her Trapeze Americano. In the process, they grow closer and start to fall in love.\nMeanwhile, DuBois is arrested in Rome while chasing the animals, but swiftly escapes and discovers that Alex was the missing lion from the zoo in New York. Once free, DuBois personally reassembles her injured men and they head toward the Alps, forcing the animals to proceed to London despite incomplete rehearsals. Alex finds Vitaly preparing to leave and convinces him to stay by reminding him of how he enjoys performing the impossible. He suggests that he uses hair conditioner as a safer lubricant to perform his flaming ring jump as well as fix his damaged fur. As a result, Vitaly's stunt is performed perfectly and the show is a spectacular success. After the impressed promoter arranges for an American tour, DuBois shows up with a paper showing that Alex was missing. Though the penguins are able to foil Dubois' plan, Alex is forced to confess that the four of them are just zoo animals trying to get home, disappointing Gia, Vitaly, Stefano and the other circus animals  who feel used and lied to.\nThe zoo and circus animals go their separate ways but arrive in New York City at the same time. Realizing how much their adventures have changed them, the zoo animals find that their true home was with the circus. Before they can go back, however, DuBois tranquilizes and captures them, before being discovered by the zoo staff, who believe she is responsible for returning the missing animals. King Julien and the penguins manage to get to the circus and convince the circus animals to rescue their friends.\nBack at the zoo, Alex awakens to find that he along with his friends are trapped in larger fence enclosures. DuBois who was honored by the zoo guards, secretly loads a poison-filled dart into a gun that she hides, inside a foam finger in preparation for publicly executing Alex. Seconds before the poisoned bullet hits Alex, Gia swings in and rescues him. Suddenly, the entire circus arrives in the hot air balloon, frees the zoo animals and defeat DuBois and her henchmen. Alex and his friends eventually decide to permanently join the circus to pursue their adventures, while DuBois and her henchmen are sent off in crates bound for Madagascar (just like the zoo animals themselves were in the first film) thanks to the penguins.", "cast": "Ben Stiller as Alex, a lion.\nChris Rock as Marty, a plains zebra and Alex's best friend.\nDavid Schwimmer as Melman, a reticulated giraffe, another of Alex's friends and Gloria's love interest.\nJada Pinkett Smith as Gloria, a hippopotamus, another of Alex's friends and Melman's love interest.\nSacha Baron Cohen as King Julien XIII, a ring-tailed lemur.\nCedric the Entertainer as Maurice, an aye-aye.\nAndy Richter as Mort, a Goodman's mouse lemur.\nTom McGrath as Skipper, a penguin and First Policeman.\nFrances McDormand as Captain Chantel DuBois, the leader of the Animal Control.\nJessica Chastain as Gia, an Italian jaguar and Alex's love interest.\nBryan Cranston as Vitaly, a Russian Siberian tiger.\nMartin Short as Stefano, an Italian New Zealand sea lion.\nChris Miller as Kowalski, a penguin and Skipper's right-hand man.\nChristopher Knights as Private, a penguin\nJohn DiMaggio as Rico, a penguin\nFrank Welker as Sonya, a Eurasian brown bear\nPaz Vega as the Andalusian Triplets (Esmeralda, Esperanza and Ernestina)\nConrad Vernon as Mason, a chimpanzee and Second Policeman\nVinnie Jones as Freddie, a Great Dane\nSteve Jones as Jonesy, a Bernese Mountain Dog\nNick Fletcher as Frankie, an Entlebucher Mountain Dog\nJules de Jongh as Shakey, a Bernese Mountain Dog\nEric Darnell as Comandante, Zoo Official and Zoo Announcer\nDan O'Connor as Casino Security and Mayor of New York City\nDanny Jacobs as Croupier and Circus Master"}