{"_movieID": "458156", "source": "wikipedia", "created_utc_dt": "08/28/2019, 14:43:45", "summary": "John Wick: Chapter 3 – Parabellum (also known as John Wick: Chapter 3 or simply John Wick 3) is a 2019 American neo-noir action thriller film starring Keanu Reeves as the titular character. It is the third installment in the John Wick film series, following John Wick (2014) and John Wick: Chapter 2 (2017). The film is directed by Chad Stahelski and written by Derek Kolstad, Shay Hatten, Chris Collins, and Marc Abrams, based on a story by Kolstad. It also stars Halle Berry, Laurence Fishburne, Mark Dacascos, Asia Kate Dillon, Lance Reddick, Anjelica Huston, and Ian McShane. In the film, which takes place one hour after the events of the previous film, ex-hitman John Wick finds himself on the run from legions of assassins after a $14 million contract is put on his head due to his recent actions.\nThe third installment was announced in June 2017. Much of the returning cast and crew was confirmed in February 2018, with new members joining that May. Filming began that month and lasted through November, taking place in New York City, Montreal, and Morocco.\nJohn Wick: Chapter 3 – Parabellum was theatrically released in the United States on May 17, 2019, by Summit Entertainment. It has grossed $321 million worldwide, becoming the highest-grossing film of the franchise in just 10 days, and received positive reviews from critics, with praise for the action sequences, visual style, and Reeves' performance. A sequel, John Wick: Chapter 4, is in development and is set to be released May 21, 2021.", "plot": "Ten minutes after the conclusion of the previous film, former hitman John Wick is now a marked man and on the run in Manhattan. After the unsanctioned killing of crime lord and new member of the High Table Santino D'Antonio in the New York City Continental, John is declared \"excommunicado\" by his handlers at the High Table and placed under a $14 million bounty which rises each hour. On the run from assassins, John reaches the New York Public Library and recovers a crucifix necklace and a \"marker\" medallion from a secret cache in a book. He fights his way through numerous assassins until he reaches the Director, a woman from his past who used to raise him. She accepts the crucifix as a \"ticket\" for safe passage to Casablanca, Morocco, and has Wick branded to signify that he has used up his ticket.\nMeanwhile, an Adjudicator with the High Table meets with Winston, the manager of the New York City Continental, and the Bowery King, the leader of a network of vagrant assassins. The Adjudicator admonishes both for helping John kill Santino, a new member of the high court, and both are given seven days to give up their offices or face serious consequences. The Adjudicator hires Zero, a Japanese assassin, afterwards to enforce the will of the high table. They find the Director while she is watching her ballet students perform. The Director's penance for helping Wick by putting the ticket above the rules of the High Table is by blood, whereby Zero used his sword to make a cut through the centre of both her hands.\nIn Casablanca, John meets Sofia, a former friend and the manager of the Casablanca Continental. He presents his marker and asks Sofia to honor it by directing him to the Elder, the only person known to be above the High Table, so that he can ask to have his bounty waived. John has Sofia's marker because he helped get her daughter out in the past. Sofia takes him to an assassin and her old boss named Berrada, who tells John that he may find the Elder by wandering through the desert until he cannot walk any longer. In exchange for this information, Berrada asks for one of Sofia's dogs; when Sofia refuses, he shoots the dog. In retaliation, Sofia shoots Berrada, and the duo fight their way out of the kasbah and flee into the desert.\nHaving fulfilled her marker, Sofia leaves John in the desert. He roams until he collapses from exhaustion but is found and brought to the Elder. John says he is desperate to live on to \"earn\" the memory of the love he once had with his wife. The Elder agrees to forgive John but only if he assassinates Winston and continues to work for the High Table until his death. To show his commitment, John severs his ring finger and gives his wedding ring to the Elder.\nMeanwhile, the Adjudicator uses Zero to accost the Director and the Bowery King because both of them did not agree to leave their offices after 7 days. As penance, both are maimed, the Bowery King almost fatally. John arrives back in New York City and is pursued by Zero's men. Zero nearly kills John before his pursuit is halted as they arrive at the New York City Continental, under threat of being declared excommunicado. John meets with Winston, who encourages John not to die as a killer but as a man who loved, and was loved by, his wife.\nThe Adjudicator arrives, but Winston refuses to give up his office, and John refuses to kill Winston. As a consequence, the Adjudicator \"deconsecrates\" the New York City Continental, revoking its protected neutral ground status. The Adjudicator notifies Zero and sends two busloads of body-armored High Table enforcers as support. With the help of the hotel's concierge, Charon, John defends the Continental from the enforcers. John is ambushed by Zero and his students. John kills all but two of the students, then fatally wounds Zero.\nThe Adjudicator negotiates a parley with Winston, who explains the rebellion as a \"show of strength\" and offers penance to the High Table. John arrives, and when the Adjudicator identifies him as a threat to the negotiation, Winston shoots John repeatedly, causing John to fall off of the Continental's roof. The New York City Continental returns to operation and is \"reconsecrated\", but the Adjudicator informs Winston that John's body has disappeared and that he remains a threat for both of them. Meanwhile, a wounded John Wick is delivered to the heavily-scarred Bowery King, who tells John he is angry with the High Table and will be fighting against them. He asks John if he also feels pissed off, and John responds with, \"Yeah\".", "cast": "Keanu Reeves as John Wick, a retired assassin on the run after having a $14 million bounty set on him. He sets out on a path to seek the Elder, the only man above the High Table, and has the power to have John's bounty and excommunicado status waived.\nIan McShane as Winston, the manager of the Continental Hotel in New York.\nMark Dacascos as Zero, a Japanese assassin recruited by the Adjudicator. He aligns himself with John Wick, in terms of both combat strategy and prowess, although the latter disagrees.\nLaurence Fishburne as the Bowery King, an underground crime lord. By order of the Adjudicator, he is wounded by Zero for aiding John Wick in the form of seven cuts to the body by a sword.\nAsia Kate Dillon as the Adjudicator, a member of the High Table. The Adjudicator removes Winston as the manager of the Continental Hotel, and later deconsecrates the hotel.\nHalle Berry as Sofia, an ex-assassin and close friend of John Wick and the manager of the Continental Hotel in Casablanca. She aids John after he presents her with a marker, which translates into a favor she owes him in return for saving her daughter years ago.\nLance Reddick as Charon, the concierge at the Continental Hotel in New York. He later aids John Wick in battling the enforcers sent by the High Table.\nAnjelica Huston as the Director, a leading member of the Ruska Roma society that John Wick once belonged to.\nSaïd Taghmaoui as the Elder, the only man above the High Table.\nJerome Flynn as Berrada, the assassins' master of coin and marker and a member of the High Table.\nCecep Arif Rahman as Shinobi #1, Zero's pupil.\nYayan Ruhian as Shinobi #2, Zero's pupil.\nBoban Marjanović as Ernest, an assassin.\nRandall Duk Kim as the Doctor.Additionally, Riccardo Scamarcio cameos as Santino d'Antonio's corpse, Jason Mantzoukas cameos as the Tick Tock Man, Robin Lord Taylor cameos as the Administrator, Susan Blommaert plays Librarian, Tobias Segal plays Earl, and Roger Yuan, Arjon Bashiri, Tiger Chen, Vladimir and Vlado Mihailov, Danish Bhatt, and Candace M. Smith play assassins."}